{
  "id": "6c5598f8-e427-43d5-b895-76ac351dbff2",
  "language_model": "assemblyai_default",
  "acoustic_model": "assemblyai_default",
  "language_code": "en_us",
  "status": "completed",
  "audio_url": "https://datastori.es/podlove/file/122/s/feed/c/mp3/Datastories-26.mp3",
  "utterances": [
    {
      "end": 18406,
      "speaker": "Enrico Bertini",
      "start": 8960,
      "text": "Hi everyone. Data stories number 26 after a long break, summer break. Hi, Moritz. Hey, Enrico, how are you?",
      "id": "ep_26_ut_0"
    },
    {
      "end": 20090,
      "speaker": "Moritz Stefaner",
      "start": 18518,
      "text": "Good, good. How are you?",
      "id": "ep_26_ut_1"
    },
    {
      "end": 24610,
      "speaker": "Enrico Bertini",
      "start": 20470,
      "text": "Good. Mellow, relaxed. How do you feel?",
      "id": "ep_26_ut_2"
    },
    {
      "end": 32500,
      "speaker": "Moritz Stefaner",
      "start": 25190,
      "text": "Good. I had a great summer. In fact was quite sunny here and I took some time off for once.",
      "id": "ep_26_ut_3"
    },
    {
      "end": 34488,
      "speaker": "Enrico Bertini",
      "start": 32840,
      "text": "Time off? Time off.",
      "id": "ep_26_ut_4"
    },
    {
      "end": 34832,
      "speaker": "Moritz Stefaner",
      "start": 34544,
      "text": "Actually.",
      "id": "ep_26_ut_5"
    },
    {
      "end": 37380,
      "speaker": "Enrico Bertini",
      "start": 34896,
      "text": "Time off sounds weird now.",
      "id": "ep_26_ut_6"
    },
    {
      "end": 46064,
      "speaker": "Moritz Stefaner",
      "start": 38000,
      "text": "I'm not exactly relaxed, but I feel like in a good mood and productive and so on. So that's cool.",
      "id": "ep_26_ut_7"
    },
    {
      "end": 47264,
      "speaker": "Enrico Bertini",
      "start": 46232,
      "text": "Cool, cool, cool.",
      "id": "ep_26_ut_8"
    },
    {
      "end": 61800,
      "speaker": "Moritz Stefaner",
      "start": 47312,
      "text": "Yeah, I'm doing fun projects right now, so it's just a small selection of. What I'm doing is a b infographic analysis software for pro soccer players. Like a training device for pro soccer players. And I do the analysis software.",
      "id": "ep_26_ut_9"
    },
    {
      "end": 62804,
      "speaker": "Enrico Bertini",
      "start": 62140,
      "text": "Wow.",
      "id": "ep_26_ut_10"
    },
    {
      "end": 67132,
      "speaker": "Moritz Stefaner",
      "start": 62932,
      "text": "And a new type of election map for the German. You know, we have the big election.",
      "id": "ep_26_ut_11"
    },
    {
      "end": 69868,
      "speaker": "Enrico Bertini",
      "start": 67276,
      "text": "Oh, you're gonna have the big elections. When is that?",
      "id": "ep_26_ut_12"
    },
    {
      "end": 70820,
      "speaker": "Moritz Stefaner",
      "start": 69924,
      "text": "In two weeks.",
      "id": "ep_26_ut_13"
    },
    {
      "end": 71676,
      "speaker": "Enrico Bertini",
      "start": 70940,
      "text": "In two weeks?",
      "id": "ep_26_ut_14"
    },
    {
      "end": 75760,
      "speaker": "Moritz Stefaner",
      "start": 71748,
      "text": "Yeah. And I'll do like a new type of map for the results.",
      "id": "ep_26_ut_15"
    },
    {
      "end": 79840,
      "speaker": "Enrico Bertini",
      "start": 76140,
      "text": "So you have the chance to influence the elections. Actually.",
      "id": "ep_26_ut_16"
    },
    {
      "end": 90744,
      "speaker": "Moritz Stefaner",
      "start": 81580,
      "text": "In fact that's true because we published the results from last time like a week before in this format. And so who knows? Yeah, maybe. Wow.",
      "id": "ep_26_ut_17"
    },
    {
      "end": 96456,
      "speaker": "Enrico Bertini",
      "start": 90792,
      "text": "Let's talk about impact. Cool, cool, cool.",
      "id": "ep_26_ut_18"
    },
    {
      "end": 99900,
      "speaker": "Moritz Stefaner",
      "start": 96528,
      "text": "Yeah, well, yeah, it's a nice mixture. What are you up to?",
      "id": "ep_26_ut_19"
    },
    {
      "end": 151442,
      "speaker": "Enrico Bertini",
      "start": 100680,
      "text": "Oh, I had a nice summer in New York. Stayed here, basically walked the kids around. That was fun. I discovered that there are nice beaches around New York, which I didn't expect. Cool. That was fun. That was a lot of fun. And I came back to work kind of like one week ago and was super crazy. But I'm excited. I'm really excited. My new course started. It's a visual analytics course and it looks like I have some nice students. They are excited too. And lots of new projects going on. I have also two new PhD students. So these are actually my first two students here. So I'm super, super excited. So it's great time actually. Great time, great time.",
      "id": "ep_26_ut_20"
    },
    {
      "end": 152910,
      "speaker": "Moritz Stefaner",
      "start": 151506,
      "text": "You're getting into the groove.",
      "id": "ep_26_ut_21"
    },
    {
      "end": 159234,
      "speaker": "Enrico Bertini",
      "start": 153210,
      "text": "Absolutely, absolutely. Lots of work. But it's good. It's really good. I like it.",
      "id": "ep_26_ut_22"
    },
    {
      "end": 159978,
      "speaker": "Moritz Stefaner",
      "start": 159322,
      "text": "Sounds great.",
      "id": "ep_26_ut_23"
    },
    {
      "end": 160750,
      "speaker": "Petra Isenberg",
      "start": 160074,
      "text": "Yeah.",
      "id": "ep_26_ut_24"
    },
    {
      "end": 195520,
      "speaker": "Enrico Bertini",
      "start": 161930,
      "text": "So let's start. Of course we have another great guest today. We have Petra Eisenberg and we are going to talk about visualization beyond the desktop interface. Petra is a researcher and an old friend of mine and she's been working in the area in the intersection between visualization, human computer interaction, computer supported collaborative work. It's a very nice mix of skills and. Welcome, Petra. How are you?",
      "id": "ep_26_ut_25"
    },
    {
      "end": 200440,
      "speaker": "Petra Isenberg",
      "start": 195860,
      "text": "Hey, thanks for having me. I'm good. Also had a good summer, really.",
      "id": "ep_26_ut_26"
    },
    {
      "end": 204130,
      "speaker": "Enrico Bertini",
      "start": 201750,
      "text": "Not too much taking care of kids too?",
      "id": "ep_26_ut_27"
    },
    {
      "end": 207250,
      "speaker": "Petra Isenberg",
      "start": 204670,
      "text": "No, the grandparents were there for.",
      "id": "ep_26_ut_28"
    },
    {
      "end": 228250,
      "speaker": "Enrico Bertini",
      "start": 208150,
      "text": "I don't have that. So Petra, we normally let our guests introduce themselves a little bit. Can you tell us a little bit about yourself? Give a little bio sketch and tell us what you do and what are your research interests or even mention your projects, stuff like that.",
      "id": "ep_26_ut_29"
    },
    {
      "end": 301690,
      "speaker": "Petra Isenberg",
      "start": 229000,
      "text": "Sure. Yeah. So I started doing information visualization and that I would say is my main area when I was studying in Magdeburg in Germany, a subject called computational visualistics, which is a little bit like computer science with a focus on images. So that was a lot of fun. Afterwards I moved to the University of Calgary to do my PhD with Sheelagh Carpentale. And that's where I actually started to work on this intersection as you just introduced of CCW. So computer supported cooperative work and infovis. And afterwards I did a postdoc at INRIA in France in the Avis team, and that's where I now have a permanent researcher position. So this is my sort of where I came from and where I'm now. And my main research interests are still basically fit exactly the topic of this podcast. So I'm really interested in how we can combine information visualization with novel context or novel devices, and in novel settings, like collaborative settings.",
      "id": "ep_26_ut_30"
    },
    {
      "end": 359510,
      "speaker": "Enrico Bertini",
      "start": 302230,
      "text": "Great. Fantastic. Yeah. By the way, I suggest our listeners to give a look to your webpage because there are lots of interesting examples and images. I guess you also have some videos, right? Yeah, yeah, there are a few, yeah, yeah. We will put the URL on the website, of course. So I think that's really interesting because, I mean, by looking at what you do, it's really interesting because I start asking myself, what can we do with visualization once we move beyond the desktop interface? It looks like there are lots of potential opportunities and of course a lot of challenges. Right. So can you give us a little bit of a broad overview of what happens when you move from the desktop to some other kind of devices? Also, what kind of devices you can move to. I guess you've been working with surfaces, what else? Display walls, stuff like that, right?",
      "id": "ep_26_ut_31"
    },
    {
      "end": 485530,
      "speaker": "Petra Isenberg",
      "start": 360330,
      "text": "Yeah, exactly. So there actually several, or I would say two main reasons why you may want to move away from the desktop setting. And here I'm saying I'm thinking of the desktop setting as something that the visualization community has considered in most of the past work. And it's sort of a work setting where you imagine there's some sort of analyst who has a lot of data and for him or her, you're creating a visualization to help their work task, whatever it may be. It could be simple charts or it could be something very complex in the area of biology or. So now if you start thinking about surfaces, then basically two new opportunities open up. One is that you can support visualization in new environments. So you can actually think about using visualizations in meeting rooms, in museums, in emergency response settings where there's a really hectic environment, potentially in hallways as ambient displays, or also in shared work settings where several people come together. So that's the one new thing you can consider. And the other one is that you can actually reach new audiences that you may not have been able to reach before. And this is where collaboration becomes really important, because if you think about surfaces that are large. So last time you talked to Dominicus about mobile devices that has some similar new benefits. It's also part of the desktop. But now if you talk about larger surfaces such as tabletops and malls, you can support people standing around the same display and looking at data together and exploring it together and discussing it and making decisions. And of course you can support many non work contexts as well. So audiences in a museum, for example, that may just want to learn something.",
      "id": "ep_26_ut_32"
    },
    {
      "end": 512180,
      "speaker": "Enrico Bertini",
      "start": 486630,
      "text": "Sure, sure. Well that sounds great. So basically you have a lot of new opportunities because you can let visualization happen in completely new environments, right? And at the same time you have people interacting in completely new ways. Right. That's really, really interesting. Yeah, please go ahead. Sorry.",
      "id": "ep_26_ut_33"
    },
    {
      "end": 564328,
      "speaker": "Petra Isenberg",
      "start": 512260,
      "text": "Yeah, so this is basically the one type of benefit where you have new users context, either to the location or the types of people you can support. But then of course, if you think about a surface as coupled with the input technology, for example, touched you discussed last time. But there are many, many other ways of interacting with the surface. Surfaces can have more pixels, so you can show more data. You may be able to show data in a completely different way if you think, for example, of a bendable surface or something like e paper and things like that. So there may be very different types of exploration that interactive exploration that you could support with a surface that is not the standard desktop screen with a mouse and a keyboard in front of you.",
      "id": "ep_26_ut_34"
    },
    {
      "end": 596390,
      "speaker": "Enrico Bertini",
      "start": 564424,
      "text": "Okay, so what are. So one thing I'm curious about, I guess there are some type of visualizations that happen in standard environments that make sense to move to this new kind of environments and other type of visualizations that just don't make sense to move there, right? I mean, just as, I guess, and probably the other way around too. I mean, I guess there are visualizations that can happen in this kind of environments and just cannot happen with a standard desktop interface, right?",
      "id": "ep_26_ut_35"
    },
    {
      "end": 715366,
      "speaker": "Petra Isenberg",
      "start": 597450,
      "text": "Yes. So one of the problems here is that if you're now going to ask me like, which visualization should I never put, for example, on a tabletop display like horizontal surface? This is very difficult to answer because it depends on the environment and depends on the type of task and people you want to support. For example, if you think about something standard like Tableau, for example, and I just take the desktop version of Tableau and put it on a tabletop and put five people around it, most likely it will not be the most effective way for these five people to explore data together, or at least not in a synchronous way. If you have one person driving the interface, then, and the others are just watching, it could still be better than a desktop display, but not for synchronous sort of fluid interaction and exploration in parallel. But in terms of you just think about as a single visualization, then it's a bit difficult to say if you should, for example, never put a lion chart on a tabletop display or something like that because it really depends on who your audience is going to be. If you put something in a museum, you most likely would not put a very complex and complicated visualization for people who will just walk, try and walk up and use it. But if you put it on another type of surface that like in a meeting room where people like say a meeting room where biologists meet all the time to discuss the results from their experiments, then you may be able to put something more complex and very domain specific there that you couldn't put in a museum, for example.",
      "id": "ep_26_ut_36"
    },
    {
      "end": 774320,
      "speaker": "Enrico Bertini",
      "start": 715538,
      "text": "Sure, sure. So I guess that basically, roughly speaking, we can still have some kind of visualizations that are more some kind of communication kind of visualizations where you expect people to walk by, give a look, maybe have a little bit of interaction and leave, and other type of visualizations that are more targeted towards data analysis. Right. And I think that's a very interesting angle because as soon as you think about what people can do, what kind of data analysis people can do in front of these surfaces or walls, now you have this collaborative kind of capabilities that was very limited on the desktop. Right. So do you have any direct experience of observing people doing some data analysis in a collaborative fashion with this kind of devices?",
      "id": "ep_26_ut_37"
    },
    {
      "end": 855832,
      "speaker": "Petra Isenberg",
      "start": 775660,
      "text": "Yeah. So we actually did a study, this is while I was working at Microsoft for an internship, we did a study on the Microsoft Surface, which surface? One which was a, I would say like a large desktop display, just as a horizontal surface. So it was a 30 inch and 1024 by 768 kind of display. So not particularly big and not particular high resolution, but you could sit around it with, I would say, to one to four people. So what we did there is we actually gave people a fairly complex task, so they had to search 300 documents for hidden stories. So this was part of the vast contest. I think you interviewed somebody about the vast contest in the past. Within these 300 text documents, they were mostly newspaper articles. There was a story hidden about. So people started with a document talking about a car accident, and somebody was yelling something very strange, like, oh, the flowers. And so people had to go from this accident to actually finding out that there were some illegal things going on in this town, and this guy was poisoned and why he was poisoned and so on.",
      "id": "ep_26_ut_38"
    },
    {
      "end": 856380,
      "speaker": "Enrico Bertini",
      "start": 855856,
      "text": "And.",
      "id": "ep_26_ut_39"
    },
    {
      "end": 924046,
      "speaker": "Petra Isenberg",
      "start": 856750,
      "text": "And this task took people around one to 2 hours to complete. So it was fairly complex and not so easy to answer. But what was very interesting was that. So we built a dedicated system for exploring this document collection for people. And we studied fairly regular people who had, like, they weren't researchers or computer scientists, just people basically from any kind of discipline or even seniors or so coming in. And they were very, very comfortable using the system, even though it was for document exploration and search, and fairly complex. Just the familiarity of sitting around a table and being able to look at things together and discussing, it was a great, great entry point. My hunch is that if we had compared it to a desktop setting, that the way people behaved in first entering or looking at this tool would have been quite different.",
      "id": "ep_26_ut_40"
    },
    {
      "end": 985740,
      "speaker": "Enrico Bertini",
      "start": 924198,
      "text": "Sure, sure. I mean, that's my answer too. And I think so. This reminded me, there is a. I don't know if you remember this kind of study a few years back, I think, 2000 something. There was a study, I think, conducted on standard interfaces from Alfred cops. I guess, that basically says that two pairs of eyes actually discover more stuff than one pair of eyes. So if you put more people on a data analysis task, the sum of what they find is definitely more than what a single person would find. Roughly speaking, I think that was the outcome of the study. And now I think as you move from a desktop interface to something that is more where people can, can actually collaboratively work together, this may be even more powerful. Right. Because you have not only, you have more eyes, you also have the interaction between these people, right?",
      "id": "ep_26_ut_41"
    },
    {
      "end": 1047687,
      "speaker": "Petra Isenberg",
      "start": 986040,
      "text": "Yeah, exactly. So we saw people discussing the hypothesis, challenging each other's hypothesis coming up, and just finding different things. Like you said, they saw more, they could split the work in whichever way they wanted to. And this was really like a benefit to the group work. And interestingly, actually, we also did an analysis of how successful people were in completing the task and how correct the answers were. And those people who worked very, very closely together. So who paid attention to what the other person had read and discussed closely what they had found, they were the most successful. Because even if you use a tabletop display and you are in the same place, doesn't necessarily mean that you always know what the other person is doing. Especially when you're doing very, like, reading tasks where you concentrated on something small, you can't just at a glance see what the other person is actually looking.",
      "id": "ep_26_ut_42"
    },
    {
      "end": 1048535,
      "speaker": "Enrico Bertini",
      "start": 1047863,
      "text": "Sure.",
      "id": "ep_26_ut_43"
    },
    {
      "end": 1061390,
      "speaker": "Moritz Stefaner",
      "start": 1048687,
      "text": "So much of the effect comes probably just from the fact that people actually have a dialogue about what they are seeing. And this helps you, like, maybe think in a more structured way or just discover new stuff.",
      "id": "ep_26_ut_44"
    },
    {
      "end": 1105660,
      "speaker": "Petra Isenberg",
      "start": 1061690,
      "text": "Yeah, exactly. There are some interface elements that you can build in to help people become aware of what the other person has done. But we need a bit more research to find out exactly if, like, how to design that, such that groups, for example, don't communicate naturally with each other that are actually forced to or strongly encouraged to share more. Like in this document, for example. In this document, example, you could show, okay, the other person has read this, or you have already read this, and the other person has looked at something similar, and you can build interface elements that will show this.",
      "id": "ep_26_ut_45"
    },
    {
      "end": 1125392,
      "speaker": "Moritz Stefaner",
      "start": 1106040,
      "text": "Yeah, but it's interesting because we are really not used to operating computers together, so. And it's always a strange moment when you sit at your machine and somebody else takes over the mouse. It's always like, what's he doing there? And so, yeah, we're really not used to doing stuff on a computer. Like really? Yeah.",
      "id": "ep_26_ut_46"
    },
    {
      "end": 1156012,
      "speaker": "Enrico Bertini",
      "start": 1125496,
      "text": "In a shared workspace, in a shared space. Yeah, absolutely. I mean, this level of intimacy that you normally have in front of your computer, this is totally lost, even if you are the single person. So now I'm thinking about the museum scenario. Even if you are the only person who is interacting with the interface, you still have the feeling that it's not very intimate anymore. Right? I don't know, Moritz, I think you've been working on some similar kind of projects where you have some kind of public display somewhere, is that correct?",
      "id": "ep_26_ut_47"
    },
    {
      "end": 1216840,
      "speaker": "Moritz Stefaner",
      "start": 1156156,
      "text": "Yeah, occasionally. I mean, the biggest was probably that table we did for the Venice Biennale in 2008. And it was not a multi touch, but like an object based thing where you could move cards on the table. But that was quite educational, and we sort of started it without much experience in the area and a few things. Well, one thing we learned along the way, for instance, was that if you have a table, you have no up and down, but you have more like center and outside. And this is what you work with. So you have to switch your mindset to a bit more. A polar coordinate system. Yeah, because, I mean, people can approach the table from any side, right. When you have a vertical surface, it's always clear where there's left right, up and down, right. And so that was kind of interesting. And also this whole situation, like, who's in control of the visualization? Or are people competing in some form, stuff like that. That's something you never think about.",
      "id": "ep_26_ut_48"
    },
    {
      "end": 1279080,
      "speaker": "Petra Isenberg",
      "start": 1217660,
      "text": "There's actually some interesting past research in the era of CCW that that comes from Sheelagh Carpendale. So my previous lab, where they looked at this kind of personal spaces that you form on a tabletop display and what they found, or they call this theory of territoriality, where it's clear that people sort of form these intrinsic spaces around them when they're standing around the tabletop. So you have a personal space that's quite close to where you're standing and then there shared spaces. For example, if the typical example in early tabletop work was this photo collection. So looking at photos together or something, and then if you want to look at something just by yourself, you would move those photos closer to you. If you want to make them available to the whole group, you would move them more in a central location. And then there were some storage spaces that people also often created to make piles of stuff that had a. Yeah.",
      "id": "ep_26_ut_49"
    },
    {
      "end": 1281572,
      "speaker": "Moritz Stefaner",
      "start": 1279460,
      "text": "You want some stuff somewhere, right?",
      "id": "ep_26_ut_50"
    },
    {
      "end": 1288192,
      "speaker": "Petra Isenberg",
      "start": 1281716,
      "text": "Yeah, exactly. You need to, like, location is a strong indicator of I need to do something with this.",
      "id": "ep_26_ut_51"
    },
    {
      "end": 1290808,
      "speaker": "Moritz Stefaner",
      "start": 1288296,
      "text": "Right. That's interesting.",
      "id": "ep_26_ut_52"
    },
    {
      "end": 1318510,
      "speaker": "Enrico Bertini",
      "start": 1290864,
      "text": "Yeah, but so now I'm thinking that there might be also some kind of public displays that are, that I'm thinking about, I don't know, public environments where there is a display somewhere that people cannot really interact with, but past buyers can just look, get some information and leave. Right. I'm thinking about urban environments or stuff like that. That's also an option. Right?",
      "id": "ep_26_ut_53"
    },
    {
      "end": 1345934,
      "speaker": "Petra Isenberg",
      "start": 1319690,
      "text": "Yeah. And actually, you can also, you don't need to necessarily think about interaction always as being something active. Yeah, you can. You can passively interact by walking closer. And you could build an inter, like a visualization that reacts just on the proximity of people to the display or something they do, like motion or speech or something like that.",
      "id": "ep_26_ut_54"
    },
    {
      "end": 1346526,
      "speaker": "Enrico Bertini",
      "start": 1346022,
      "text": "Yeah.",
      "id": "ep_26_ut_55"
    },
    {
      "end": 1371490,
      "speaker": "Moritz Stefaner",
      "start": 1346638,
      "text": "Are there any recommendations, like, for designing these? Because I hear more and more about, like, big display screens somewhere for ambient awareness or let's say big walls at an airport, things like that. Are there any tips you can give, like, from research how. How to work with this totally different situation, like what to avoid or what to encourage? Things like that.",
      "id": "ep_26_ut_56"
    },
    {
      "end": 1397340,
      "speaker": "Petra Isenberg",
      "start": 1372110,
      "text": "So I've actually worked on big wall displays, but more with the thought of using it in a more really data analysis centered kind of way, because you can imagine having a big wall display that you actually need to analyze data on, whereas what you're describing something in the airport or something you're just passing by the. You would have completely different requirements.",
      "id": "ep_26_ut_57"
    },
    {
      "end": 1397820,
      "speaker": "Moritz Stefaner",
      "start": 1397420,
      "text": "Exactly.",
      "id": "ep_26_ut_58"
    },
    {
      "end": 1501462,
      "speaker": "Petra Isenberg",
      "start": 1397860,
      "text": "So I can tell you a little bit about the recent stuff we did on wall displays, but for work purposes, one of the problems we were having is we have this wall here at Inria that is approximately 5 meters by 2 meters. 5 meters long, 2 meters high. So it's much higher than at least I can reach, and it's quite long. So you have to walk, walk along it to see everything. And our question was, okay, if we were to design a visualization for this wall that people actually. Where people actually need to go up and read and analyze the data that we're showing, where should we place this data, and where should we place things like the legends or interaction widgets and things like this? So in order to get some recommendations for this, we went quite low level. So we did a perceptual experiment that just looked at how accurately can people actually read information on a wall, depending on where they're standing. So we said, okay, let's take a very extreme case. You're standing on the very left of this wall, and you're looking at something, and you, for some reason have to read something that's quite far away, like, let's say 5 meters away or above your head. So what we had people do is we showed them, for example, a circle right in front of their eyes and at the far end of the wall, and then we had them match the size of the circle. So this is something that studies how well people are able to estimate the size of objects that are far away and that are at a very oblique angle, viewing angle. And what we found was a little bit.",
      "id": "ep_26_ut_59"
    },
    {
      "end": 1522900,
      "speaker": "Enrico Bertini",
      "start": 1501606,
      "text": "Sorry if I interrupt just to make sure. So this basically means that now, since, since people have such a larger extent, I mean, it's much more freedom, you can move close and far away. So now you might actually have new kind of distortions in the visualization. Is that correct? Is that what you're saying?",
      "id": "ep_26_ut_60"
    },
    {
      "end": 1571308,
      "speaker": "Petra Isenberg",
      "start": 1523320,
      "text": "Yeah, so, yes, exactly. So, because now you can have all sorts of different viewing angles on the data that on a desktop display, we're currently assuming people looking right at the data, their head is moved just a little bit. But if you're thinking about a wall that's 5 meters long and you're showing a map on it, for example, or, yeah, let's say a map and circles show, for example, the number of people in that city on the map. You could think about just a simple visualization such as this, and you may want to compare the size of this one city to another city. So, in this case, you would have to compare the size of the circles. How well would you be able to do it if the other city is 5 meters away from you? That's the kind of scenario. Does that make sense?",
      "id": "ep_26_ut_61"
    },
    {
      "end": 1573052,
      "speaker": "Enrico Bertini",
      "start": 1571404,
      "text": "It makes a lot of sense, sure.",
      "id": "ep_26_ut_62"
    },
    {
      "end": 1614890,
      "speaker": "Petra Isenberg",
      "start": 1573196,
      "text": "Yeah. So what we found is that people actually made quite a few errors, and mostly when they had to judge angles. So, for example, in the extreme case, when you're looking at an angle, imagine a pie chart. So you have to judge the size of the angle that one pie makes to the angle of another pie that's 5 meters away. People actually thought that, for example, an angle of, say, 100 degrees was 1.5 times the size it actually was. They made quite a bit of an error.",
      "id": "ep_26_ut_63"
    },
    {
      "end": 1623140,
      "speaker": "Moritz Stefaner",
      "start": 1617040,
      "text": "And they were not aware of that error, or were they aware? Or were they, like, expressing doubt about their own judgment?",
      "id": "ep_26_ut_64"
    },
    {
      "end": 1627208,
      "speaker": "Enrico Bertini",
      "start": 1625320,
      "text": "So now, well, we asked them to.",
      "id": "ep_26_ut_65"
    },
    {
      "end": 1671352,
      "speaker": "Petra Isenberg",
      "start": 1627224,
      "text": "Be as accurate as possible. So I think they tried. They tried to be quite accurate. But. So the experiment is a bit longer and more complicated. I want to explain in detail. But we had people also. We later gave people the opportunity to walk, to walk closer and double check if they wanted to. And some, we found that things improved when people could walk, but only if they walked in a certain way. If they walked actually to the middle center in front of the screen, they became better. But people are lazy, right? So lots of people just stepped, like, one step back and leaned, you know, as if you're playing basketball and trying to get around someone and then look. But this didn't help at all.",
      "id": "ep_26_ut_66"
    },
    {
      "end": 1672340,
      "speaker": "Moritz Stefaner",
      "start": 1671496,
      "text": "Okay.",
      "id": "ep_26_ut_67"
    },
    {
      "end": 1742430,
      "speaker": "Petra Isenberg",
      "start": 1673400,
      "text": "So, yeah, the large viewing angles may be a problem. And what we also found is you may be familiar with this ranking of visual variables that Cleveland and McGill came up with, where they say, okay, we're really good at judging lengths. So comparing lengths, something we can do almost accurately. And we found something similar for the wall displays. We can judge length quite well. But then, in Cleveland's work, the next best thing would be judging angles and then areas. So the circle example would be the areas. Yeah, we actually found that the area judgments on the wall were better than the angles. So there's something reversed. So I think in terms of guidelines and recommendations exactly for how to design visualizations, there's still lots of research that needs to be done because now we tested something a very low level. But of course, we don't want to just show circles and lines and angles. We want to assemble them into more complex visualizations and then study.",
      "id": "ep_26_ut_68"
    },
    {
      "end": 1749314,
      "speaker": "Moritz Stefaner",
      "start": 1742550,
      "text": "Yeah, but that's a good piece of information already that you cannot trust your usual rules of thumbnails, necessarily.",
      "id": "ep_26_ut_69"
    },
    {
      "end": 1774916,
      "speaker": "Enrico Bertini",
      "start": 1749442,
      "text": "Yeah. And probably also that you need to design also the space in front of your wall. Right. I mean, it's no longer only designing the visualization itself. It's also trying to maybe put some constraints in the space you have in front of the wall. Right. If I understand correctly, I mean, you might want to constrain how people, or giving instructions on how people should move in front of a wall. I don't know.",
      "id": "ep_26_ut_70"
    },
    {
      "end": 1813810,
      "speaker": "Petra Isenberg",
      "start": 1774948,
      "text": "Yeah, this is one thing. And for example, if you think about tabletops, of course, you have this weird viewing angle from all sides of the table. You're looking at a skewed angle. So you have to consider if this is potentially a problem for whatever visualization you're building. And if so, then you could move it sort of in a tilted way. I think Moritz worked on a project with the Max Planck Institute where you guys used a tilted table. I'm not sure if this was a design decision you made or who made it, but this is something you can consider.",
      "id": "ep_26_ut_71"
    },
    {
      "end": 1849436,
      "speaker": "Moritz Stefaner",
      "start": 1814630,
      "text": "Yeah. That was from the company designing the exhibition. And they have developed that as a product. And it's sort of a slightly tilted, maybe 20 degrees or so vertical display. And it's nice because you can stand in front of it and have a comfortable body posture with your hands, you know, and looking a bit down. And you can sort of rest your hands a bit. And you don't have that awkward interaction with, like, a totally vertical surface, which is a bit more demanding, like bodily. That's also something.",
      "id": "ep_26_ut_72"
    },
    {
      "end": 1849764,
      "speaker": "Petra Isenberg",
      "start": 1849508,
      "text": "Right.",
      "id": "ep_26_ut_73"
    },
    {
      "end": 1860010,
      "speaker": "Moritz Stefaner",
      "start": 1849812,
      "text": "Fatigue. Like you said, people are lazy. And if you run around at a wall and have to move your arms all the time, it is quite. It can make you tired quite quickly. Right.",
      "id": "ep_26_ut_74"
    },
    {
      "end": 1862850,
      "speaker": "Petra Isenberg",
      "start": 1860470,
      "text": "Yeah. This is something people are.",
      "id": "ep_26_ut_75"
    },
    {
      "end": 1946260,
      "speaker": "Enrico Bertini",
      "start": 1863230,
      "text": "Yeah, this is. This is something I'm really curious about because I've been so. My personal experience with this kind of surfaces is that so when I was in Konstanz, we had this huge power wall. And here, when I moved here at NYU Poly, we also have a wall. It's a little smaller and I am intimidated by this stuff because, I mean, my reaction is the first time you see a visualization on this kind of device, of course your reaction is, wow, it looks beautiful and so many details. But as soon as you try to interact with this stuff, it's a nightmare. I mean, you just don't know how. You don't even know how to start. Right. And I remember, for instance, in Konstanz, we used to interact with, with just standard mouse and keyboard. It's unbelievably hard. Right. And so, Pedro, can you tell us something more about how you interact with this kind of new devices? Because it looks like a big, big challenge to me. And of course, I mean, even if you have new ways of interacting with a wall, like, for instance, gesture interfaces or stuff like that, then you still have new challenges, like fatigue. That is, it's the thing that Morris just mentioned, but probably a lot of other problems, right?",
      "id": "ep_26_ut_76"
    },
    {
      "end": 2025330,
      "speaker": "Petra Isenberg",
      "start": 1946800,
      "text": "Yeah. So there's actually a lot of research in particular in HCI that you would, for example, see at the CHI conference, that looks exactly at what would be the best ways and least fatiguing ways to interact with the wall. There are wands, there are gloves. Lots of people now are looking at body tracking, like stuff that they connect, and mid air gestures. And there's some work that takes, as I mentioned before, takes into account where you're standing. So if you're moving closer to the wall, you get more detailed information. If you're moving back, you will be shown something else, or the data moves with you as you move along the wall. It always depends on context, if this kind of interaction would make sense or not. But, yeah, so there's lots of things going on, but specifically for visualization purpose, there's actually very little research on interaction and, well, on non mouse interaction. Like what? Even just something as touch displays. Well, you talked with Dominicus last time, but there's not that much research on how to interact most effectively with a visualization using touch.",
      "id": "ep_26_ut_77"
    },
    {
      "end": 2069450,
      "speaker": "Enrico Bertini",
      "start": 2025490,
      "text": "Yeah. And my feeling is that touch is really, I mean, if I have to guess what kind of, if I have to say, what's the kind of interaction I'd like to have? I think this medium sized displays with touch, it looks like the most natural thing I would do. I mean, I never tried, but it looks the most natural thing I would do. I mean, it still allows to have some higher resolution, it still allows you to collaborate with one, maybe another two people, and you have natural interaction in front of it. I don't know. What's your opinion on that? I mean, anything larger than that, it looks really intimidating to me as soon as you try to interact with it.",
      "id": "ep_26_ut_78"
    },
    {
      "end": 2149362,
      "speaker": "Petra Isenberg",
      "start": 2070070,
      "text": "Yeah, so we're actually going to build a very large touch enabled wall here in the future and the University of Groningen for example also has one. But I'm not sure quite what the experiences are. And I'm very curious to start some research on, on touch interaction for visualizations on a very large wall. But one thing that needs to be considered when you're just thinking about touch is that it's not usually touch alone that you think about when you're actually implementing a touch based environment. You usually also do away with all the wimp type interfaces, so you're changing. But if you think about something like Excel for example, how you create a chart and how you would interact with a chart, it's still very menus, icons, pointer based, right. On a tabletop or on tablet, usually you would just stop designing and visualization with this kind of interface completely and you're starting to map interactions to other, other things. So you're not, it's not only just adding about adding touch, it's also just making the whole environment different. So it's difficult and there definitely needs to be more work done and that.",
      "id": "ep_26_ut_79"
    },
    {
      "end": 2155910,
      "speaker": "Moritz Stefaner",
      "start": 2149386,
      "text": "Makes it hard, of course, from a research point of view to isolate individual factors if everything has changed.",
      "id": "ep_26_ut_80"
    },
    {
      "end": 2199580,
      "speaker": "Petra Isenberg",
      "start": 2156730,
      "text": "Yeah, and it's actually also a big problem for validation. So if you're thinking about comparing a mouse based interface to a touch based interface, or let's say you're building a touch enabled scatter plot, something very simple and a mouse based scatter plot, the question is, can you really, in an evaluation, isolate the value that the touch brings beyond just measuring speed and accuracy in some task? What's the value that you get by actually touching data and moving your arms and knowing where in space something is located? It's quite difficult.",
      "id": "ep_26_ut_81"
    },
    {
      "end": 2212400,
      "speaker": "Enrico Bertini",
      "start": 2201120,
      "text": "Wow. Yeah, that's interesting. I wanted to ask you something. I forgot, sorry, it was in the back of my mind.",
      "id": "ep_26_ut_82"
    },
    {
      "end": 2213440,
      "speaker": "Petra Isenberg",
      "start": 2212480,
      "text": "I can actually tell you.",
      "id": "ep_26_ut_83"
    },
    {
      "end": 2214976,
      "speaker": "Enrico Bertini",
      "start": 2213480,
      "text": "Yeah, go ahead, sorry.",
      "id": "ep_26_ut_84"
    },
    {
      "end": 2280060,
      "speaker": "Petra Isenberg",
      "start": 2215088,
      "text": "I can tell you one more thing that's a little bit related to interaction in that you can also think about designing visualization such that you can sort of passively interact. In one example is a project we're going to present, I'm going to present with Pierre, who you interviewed with Yvonne in the past on the physical visualization. But yeah, so we did a project where we actually combining two encodings of data and overlaying them such that when you close you see one thing and when you far away you see another thing, so you can walk close to the wall, read detailed data, walk far away, and read either completely different or related or just meta information from afar. So this is a way where the encoding is done in a way that without actually having to have a dedicated input device, you can interact by walking close and far, and you still get some different content.",
      "id": "ep_26_ut_85"
    },
    {
      "end": 2281400,
      "speaker": "Enrico Bertini",
      "start": 2280960,
      "text": "Okay.",
      "id": "ep_26_ut_86"
    },
    {
      "end": 2294140,
      "speaker": "Moritz Stefaner",
      "start": 2281440,
      "text": "That sounds like a very, very interesting way of interacting and a very natural one, obviously, because this is what you will do. Like, when you want to learn a detail about something, you will get closer. Sounds nice.",
      "id": "ep_26_ut_87"
    },
    {
      "end": 2356436,
      "speaker": "Enrico Bertini",
      "start": 2294720,
      "text": "Yeah. So now I recall what I wanted to ask you. So, moving away from, let's say, the research world, are you aware of any real world settings or companies that are already using this kind of technologies for doing some collaborative work in front of a display? So I remember, for instance, a professor mentioning to me, he's been, he had a contact with a big pharma company, and they are definitely exploring the idea of doing some visualization on large walls to understand, to collaboratively discuss things like molecules for engineering, new drugs or stuff like that. So can you give us, do you have other examples or things you know, or you have experience yourself that are more on the market? Right?",
      "id": "ep_26_ut_88"
    },
    {
      "end": 2413796,
      "speaker": "Petra Isenberg",
      "start": 2356628,
      "text": "Yeah. So I think there are two main places. One is museums, as Moritz probably has some experience, for example, art, and is one of the companies that's making lots and lots of large display kind of visualizations for museums and exhibits and so on. And they're doing really cool stuff. It's worth looking at. And the other one, I would say probably command and control center. So there have even been some research papers describing how people collaborated around a mission, NASA mission planning tool. And recently I attended a workshop on the European Crisis center in Italy. So there were a bunch of companies that came that design, like mission type, I would say, dashboard systems for large displays. So in these cases, they're certainly in use by real world settings.",
      "id": "ep_26_ut_89"
    },
    {
      "end": 2416732,
      "speaker": "Enrico Bertini",
      "start": 2413948,
      "text": "Sure, sure. Well, this reminds me, there's also, I'd.",
      "id": "ep_26_ut_90"
    },
    {
      "end": 2444260,
      "speaker": "Moritz Stefaner",
      "start": 2416756,
      "text": "Like to mention the panic status board, which is really nice. Panic is quite a nice software company, and they built their own sort of dashboard. They would hang into their own office. It's something, I think it's not done enough. So whenever you have people working together, you could always have, like a big display with information relevant to them. And so they built first the status board and then an iPad app. So you can sort of click together your own little dashboard with information relevant to you.",
      "id": "ep_26_ut_91"
    },
    {
      "end": 2444668,
      "speaker": "Petra Isenberg",
      "start": 2444420,
      "text": "Yeah.",
      "id": "ep_26_ut_92"
    },
    {
      "end": 2454668,
      "speaker": "Moritz Stefaner",
      "start": 2444684,
      "text": "And you can hook it up to a big screen, and then you have your own real time ambient awareness thing. It's kind of nice and I hope we'll see much more of this type of thing.",
      "id": "ep_26_ut_93"
    },
    {
      "end": 2532310,
      "speaker": "Enrico Bertini",
      "start": 2454804,
      "text": "Sure. And this actually reminds me that these kind of applications are basically what is called situation awareness kind of stuff. And it's a totally new kind of task for visualization. Right. So we are used to talk about visualizations in terms of either communicating some story or message or doing some deep data analysis. But here you have a completely new kind of task. Right. So you have people in a room who have probably a lot of different displays and they want to make sure that if something happens, they would notice and they would basically figure out as fast as they can what's going on there. Right. And that's a totally new angle and it looks really fascinating to me. Me. So one thing, another thing I wanted to ask you, Petra. So I'm trying to think about our listeners right now. Maybe some of them think, oh, cool, I would do something like that. I would love to do something like that. How can a person start doing that? It looks really intimidating to me, both from the technical point of view, even from the cost. What can a person afford? And knowledge. How can you get the knowledge you need to set up all these things? So it looks a little bit intimidating. So how do I start if I want to do something like that?",
      "id": "ep_26_ut_94"
    },
    {
      "end": 2639806,
      "speaker": "Petra Isenberg",
      "start": 2532350,
      "text": "Yeah. Yeah. So there are a couple of recommendations I can give, I guess, from my past project. So one of the first things, let's say you're starting from nothing. You don't know what visualization you want, you don't know where you want to put it, or you don't know what who you want to support. So in that case, definitely find the right collaborators first. They can help you with choosing the right technology and helping you with whatever social setting you want to support. But generally I recommend the following process. So first you need to figure out what scenario and environment you want to support. Do you want to put something in a museum? Do you want to put something in a hallway where people will just walk by and give a glance to your visualization and then continue walking? Or do you want to support something where people will actually spend an hour or two in front to analyze data? So this is something you need to know first because it influences what types of displays you most likely should be choosing, what kind of interaction techniques you may want to support, what kind of resolution of technology you may want, and so on. So let's say, should we pick an example? Let's say you want to support something that people will just like an ambient display, people will walk past and they want to see the bus schedule or something very simple. In this case, you need to decide, okay, where do you want to put it? Outside or inside? In a hallway? In a building where it can be destroyed or not. And this influences what technology you want. Should people interact with it or just look at it?",
      "id": "ep_26_ut_95"
    },
    {
      "end": 2641238,
      "speaker": "Enrico Bertini",
      "start": 2639878,
      "text": "Sure, sure.",
      "id": "ep_26_ut_96"
    },
    {
      "end": 2835540,
      "speaker": "Petra Isenberg",
      "start": 2641414,
      "text": "So once you know all of this, then figure out, do you want, for example, a really large display? Are you fine with just a large tv, for example, or a large lcd or a couple small displays? What do you want? Is it really important that you have very high resolution? For example, if you're trying to support someone working in front of a display for hours at a time, I probably go for higher resolution. If it's just for walking by at a glance, you can probably get away with tv resolution. Depends. Something to think about. Yeah. And then you need to consider what type of interaction your surface should support. If you need none, then, well, that's fairly simple. Then you can just pick a tv or an lcd or whatever you want. You don't have to bother. If you want to support touch, then there's a bunch of displays you can buy that already have it included, or you can buy an overlay that you can just hang over your display, like over your tv you bought, or your lcd or something like that. If you want other types of interaction, then you have to worry about, for example, let's say you want like mid air gestures. Then you may want to consider buying a kinect. And where can you put it? Can you put it somewhere so people don't steal it? And I. And things like that. So once you have all of this figured out, like where you put your technology, what it supports, what it looks like and where it will be located, then you should start thinking about your visualizations, what data makes most sense to show to people that, for example, are just passing by, or people like their domain. And for this you may, you may have to follow your typical design cycle of doing some pre studies or whatever needs to be done. Yeah. So then once you have figured out what representation you want, and you want interaction, then you really have to consider how would the interaction make more sense with this representation. So if it's touch based, you have to consider, do you need any menus that people have to click, for example, to set a filter? Or can you just get away with some simple buttons? Can you do any gestures that people would have to learn? Or can you not afford to teach people anything? They just have to be able to use the interface, right? Like as soon as they step in front of it for the first time. So, yeah, it is a little bit daunting, but you learn from every project that you do, and the more experience you get with different types of displays and hardware and software environments and so on, the easier it becomes, in my opinion.",
      "id": "ep_26_ut_97"
    },
    {
      "end": 2858890,
      "speaker": "Enrico Bertini",
      "start": 2836200,
      "text": "And I guess there might be some challenges. This is something we discussed with Dominicos as well, some challenges in terms of what kind of libraries you are forced to work with. Right. So how does it look like? I mean. I mean, if you are, I guess you would have to use proprietary libraries or stuff like that.",
      "id": "ep_26_ut_98"
    },
    {
      "end": 2931770,
      "speaker": "Petra Isenberg",
      "start": 2859950,
      "text": "Yeah. So it depends a little bit on, similar to what Dominico said, it really depends on if you need a lot of how much data you have and how much power you basically need, you can do a lot of stuff in a web browser. So, like, touch is. Touch, for example, is supported by lots of environments and you can build D3 applications, if you want, that are touch enabled. If you're building a sophisticated, I don't know, brain network visualization, maybe the browser is not the best. And then I. You can, like, there's some projects that, for example, connect things like the VTK library, if you know that one. It's a fairly big one, especially in SCIVIS, scientific visualization with touch. But for example, for the wall display that we're working here, we're mostly working with our own kinds of toolkits. So then it becomes when you have to move stuff to different, like the 16 different machines we have here, then things become a little bit more complicated.",
      "id": "ep_26_ut_99"
    },
    {
      "end": 2951650,
      "speaker": "Enrico Bertini",
      "start": 2932710,
      "text": "Okay. And if I want to get an overview of what are the challenges, the technologies, the existing research, is there any kind of survey or document or anything around that people can use, that you can mention and maybe we can put on the website.",
      "id": "ep_26_ut_100"
    },
    {
      "end": 3035784,
      "speaker": "Petra Isenberg",
      "start": 2953320,
      "text": "Yeah, I'm going to send you the link to one with Tobias. My husband originally did a literature review of six or seven different conferences and looked at all the papers that were about surfaces and visualizations in a relatively broad sense. We looked at what data people used in their project, what kind of visual representations they used, what types of displays, what types of input they supported, and sort of what the research focus was and how many. I mean, if they supported single users or groups. So the paper isn't quite out yet, but the Google Doc that contains all the research papers I can give you the link to. Then there's an interest. There are lots of blogs on surface technology. And if you. I can. There's also Google Google list where Johannes Schoening, who's now at Hasselt, called Hasselt University, sends out a newsletter every week with the newest and coolest surface technology. So this is something to subscribe to. I recommend it. I read that every week. And so what else? You asked me three things. I forgot the last one.",
      "id": "ep_26_ut_101"
    },
    {
      "end": 3037180,
      "speaker": "Enrico Bertini",
      "start": 3035872,
      "text": "I forgot it, too.",
      "id": "ep_26_ut_102"
    },
    {
      "end": 3039768,
      "speaker": "Petra Isenberg",
      "start": 3037720,
      "text": "Research. Research and technology. And.",
      "id": "ep_26_ut_103"
    },
    {
      "end": 3053100,
      "speaker": "Enrico Bertini",
      "start": 3039824,
      "text": "Yeah, I'm just trying to figure out a person who wants to start with this stuff and what kind of documents are around material that people can use to just get acquainted with the old topic. Just that.",
      "id": "ep_26_ut_104"
    },
    {
      "end": 3095626,
      "speaker": "Petra Isenberg",
      "start": 3053760,
      "text": "Yeah. And of course, there's some specialized books. For example, there's one on tabletops, wherever that you can read if you want to learn, for example, about what would be the best resolution I should pick for my display, which is something quite tricky, because a lot of the tabletop displays, and also, if you think about tvs, their pixel per inch ratio is actually not very good for reading text. And reading text is something very important if you have a visualization application. So if you would like to find out, you know, how many pixels per inch do I need? Do I need to go up to 300, or can I go with 100 or even less? Then that would be a good place to look.",
      "id": "ep_26_ut_105"
    },
    {
      "end": 3111476,
      "speaker": "Moritz Stefaner",
      "start": 3095818,
      "text": "That's great, too, because that's. It's true. It's really hard to figure out. And, you know, full hd sounds like a lot, but once you blow it up to a few meters, your text will look really bad, too. So. Yeah, yeah. So that's. That's really a big gotcha in many cases.",
      "id": "ep_26_ut_106"
    },
    {
      "end": 3123092,
      "speaker": "Petra Isenberg",
      "start": 3111548,
      "text": "Yeah, yeah. Even the 4k. If you think about a 4k display at 64 inches, it actually only has 72 pixels per inch, which is less.",
      "id": "ep_26_ut_107"
    },
    {
      "end": 3125132,
      "speaker": "Moritz Stefaner",
      "start": 3123156,
      "text": "Than your normal screen these days, right?",
      "id": "ep_26_ut_108"
    },
    {
      "end": 3136230,
      "speaker": "Petra Isenberg",
      "start": 3125236,
      "text": "Yeah, exactly. You can read ten point text at regular viewing distance, like a desktop viewing distance. Still fine, but anything smaller than ten points already, not that great.",
      "id": "ep_26_ut_109"
    },
    {
      "end": 3143230,
      "speaker": "Moritz Stefaner",
      "start": 3136340,
      "text": "Yeah, yeah, but that's great. If you have some material there, we will definitely put it into the posts.",
      "id": "ep_26_ut_110"
    },
    {
      "end": 3145562,
      "speaker": "Enrico Bertini",
      "start": 3143770,
      "text": "Yeah, yeah, that would be really useful.",
      "id": "ep_26_ut_111"
    },
    {
      "end": 3146750,
      "speaker": "Petra Isenberg",
      "start": 3145626,
      "text": "I'll send you that.",
      "id": "ep_26_ut_112"
    },
    {
      "end": 3152882,
      "speaker": "Enrico Bertini",
      "start": 3147290,
      "text": "Okay. I don't know, Moritz. You want to ask something else, or. I think.",
      "id": "ep_26_ut_113"
    },
    {
      "end": 3154738,
      "speaker": "Moritz Stefaner",
      "start": 3152946,
      "text": "No, I think we covered.",
      "id": "ep_26_ut_114"
    },
    {
      "end": 3190240,
      "speaker": "Enrico Bertini",
      "start": 3154914,
      "text": "Yeah, I think we covered pretty much everything. Pedro, is there anything else you want to mention from your work? You have so many interesting projects on your website. I got lost basically looking at that. No, seriously. I mean, you guys, you should definitely check her website. There are so many interesting projects and papers all over the place. And I definitely want to mention that Pedro is one of my favorite researchers around. And, I mean, at some point, I decided that instead of competing with her. I should collaborate with her.",
      "id": "ep_26_ut_115"
    },
    {
      "end": 3193400,
      "speaker": "Petra Isenberg",
      "start": 3192380,
      "text": "Come on.",
      "id": "ep_26_ut_116"
    },
    {
      "end": 3210630,
      "speaker": "Enrico Bertini",
      "start": 3194500,
      "text": "And it's somewhat true, and yeah, so we are doing some stuff together, but it's more on the perceptual side and not, not related to walls or surfaces. Sorry, we've been running a workshop together. Yeah, that's fun.",
      "id": "ep_26_ut_117"
    },
    {
      "end": 3285498,
      "speaker": "Petra Isenberg",
      "start": 3212570,
      "text": "Yeah, I guess maybe the only thing that I guess you didn't dare to ask me was about kind of recommending a certain technology. I can, I cannot tell you exactly what I would buy at this moment because it really depends. But what I can tell you is a little bit just the characteristics that I would be looking for that may be potentially important for other people to think about. So from my past project, something that I would really be looking for is that the display is large enough, if you want to support collaboration, that people can stand around such that they don't easily bump into each other, that they can actually have their personal space in front of the display if possible. I would like display to be seamless. So a lot of especially display walls are put together from several, for example, lcd screens. So the least amount of bezels you can have, the better, in my opinion, because especially for visualization applications, it kind of chunks the space artificially or physically. This may sometimes conflict with whatever data you may want to show.",
      "id": "ep_26_ut_118"
    },
    {
      "end": 3293790,
      "speaker": "Enrico Bertini",
      "start": 3285674,
      "text": "Yeah, we have this kind of display here and I don't like it at all. When you have these very large bezels, it just doesn't work.",
      "id": "ep_26_ut_119"
    },
    {
      "end": 3350040,
      "speaker": "Petra Isenberg",
      "start": 3295450,
      "text": "And as I said before, you want as high resolution as you can get, in particular because for most visualizations you actually need to read labels, so you need to be able to read text and small data items potentially, but you also want high resolution for the input, so you want to be able to interact relatively accurately with your data if possible. I would like multi touch. So I think the time of single touch displays is almost over, but there may still be some around. So the more touches you can have, the better. What would be really nice, and is hardly ever supported currently is identity tracking. So in particular, if you want to be able to show people, for example, what they've already looked at in collaboration and you cannot tell who has interacted where, this may become quite difficult.",
      "id": "ep_26_ut_120"
    },
    {
      "end": 3364530,
      "speaker": "Enrico Bertini",
      "start": 3351100,
      "text": "That's a very important point that we didn't even mention. Right. I mean, tracking people around, being able. Yeah, from the application standpoint, being able to say who did what, it's, it's a big. Yeah.",
      "id": "ep_26_ut_121"
    },
    {
      "end": 3366450,
      "speaker": "Moritz Stefaner",
      "start": 3364830,
      "text": "And whose stuff is what.",
      "id": "ep_26_ut_122"
    },
    {
      "end": 3383590,
      "speaker": "Petra Isenberg",
      "start": 3367390,
      "text": "Yeah, yeah, exactly. And even sometimes if the fingers, if you think about touch, if the fingers from two people are touching an object of it's the same person can help you resolve conflicts. So yeah, it's true.",
      "id": "ep_26_ut_123"
    },
    {
      "end": 3387766,
      "speaker": "Moritz Stefaner",
      "start": 3383630,
      "text": "Like the hands, they might merge if they are too close to each other. Oh my God.",
      "id": "ep_26_ut_124"
    },
    {
      "end": 3388518,
      "speaker": "Enrico Bertini",
      "start": 3387838,
      "text": "Wow.",
      "id": "ep_26_ut_125"
    },
    {
      "end": 3389570,
      "speaker": "Moritz Stefaner",
      "start": 3388694,
      "text": "Horrible.",
      "id": "ep_26_ut_126"
    },
    {
      "end": 3423378,
      "speaker": "Petra Isenberg",
      "start": 3390750,
      "text": "Yeah. So identity tracking something if you can have it. Great. Marker detection is something also very interesting if you want to combine a display of tangibles. For example, if you want to provide some knobs that people can rotate instead of using a virtual interface, or if you want to provide physical data representations on a surface, then being able to track those would be nice. And my dream interface would also have haptic feedback. But this is still a little far in the future.",
      "id": "ep_26_ut_127"
    },
    {
      "end": 3427850,
      "speaker": "Enrico Bertini",
      "start": 3423474,
      "text": "Wow. Okay. Directly from the display you mean or what?",
      "id": "ep_26_ut_128"
    },
    {
      "end": 3447562,
      "speaker": "Petra Isenberg",
      "start": 3428010,
      "text": "Yeah, there was actually a really nice demo it kind of maybe one or two years ago where it was very small, maybe the size of a phone, but on the display you could touch and by doing some magic you could actually feel the button and it was a flat surface otherwise. So it was really, really nice.",
      "id": "ep_26_ut_129"
    },
    {
      "end": 3448730,
      "speaker": "Enrico Bertini",
      "start": 3447666,
      "text": "Wow. Wow.",
      "id": "ep_26_ut_130"
    },
    {
      "end": 3456190,
      "speaker": "Moritz Stefaner",
      "start": 3448890,
      "text": "I heard Apple is also rumored to be working on something like touch feedback on there for the iPhone and so on. Yeah.",
      "id": "ep_26_ut_131"
    },
    {
      "end": 3460066,
      "speaker": "Enrico Bertini",
      "start": 3456970,
      "text": "Cool. Okay.",
      "id": "ep_26_ut_132"
    },
    {
      "end": 3460826,
      "speaker": "Moritz Stefaner",
      "start": 3460138,
      "text": "Crazy stuff.",
      "id": "ep_26_ut_133"
    },
    {
      "end": 3464350,
      "speaker": "Enrico Bertini",
      "start": 3460898,
      "text": "Crazy. It's too futuristic for us.",
      "id": "ep_26_ut_134"
    },
    {
      "end": 3468270,
      "speaker": "Petra Isenberg",
      "start": 3466770,
      "text": "No, come on.",
      "id": "ep_26_ut_135"
    },
    {
      "end": 3472440,
      "speaker": "Enrico Bertini",
      "start": 3469780,
      "text": "Okay. I think we should stop here. Right?",
      "id": "ep_26_ut_136"
    },
    {
      "end": 3478388,
      "speaker": "Moritz Stefaner",
      "start": 3472980,
      "text": "Yeah, great, great. Very informative. Lots of great material in the document already, so.",
      "id": "ep_26_ut_137"
    },
    {
      "end": 3479324,
      "speaker": "Enrico Bertini",
      "start": 3478444,
      "text": "Yeah, absolutely.",
      "id": "ep_26_ut_138"
    },
    {
      "end": 3480308,
      "speaker": "Moritz Stefaner",
      "start": 3479412,
      "text": "It's good stuff.",
      "id": "ep_26_ut_139"
    },
    {
      "end": 3484796,
      "speaker": "Enrico Bertini",
      "start": 3480404,
      "text": "So folks, let's just create talking about this.",
      "id": "ep_26_ut_140"
    },
    {
      "end": 3487428,
      "speaker": "Petra Isenberg",
      "start": 3484828,
      "text": "I'll send you a couple more links for the website.",
      "id": "ep_26_ut_141"
    },
    {
      "end": 3488244,
      "speaker": "Moritz Stefaner",
      "start": 3487564,
      "text": "Fantastic.",
      "id": "ep_26_ut_142"
    },
    {
      "end": 3492880,
      "speaker": "Enrico Bertini",
      "start": 3488292,
      "text": "Fantastic. Okay, good. Thanks a lot. Thank you, Petra.",
      "id": "ep_26_ut_143"
    },
    {
      "end": 3495258,
      "speaker": "Petra Isenberg",
      "start": 3493300,
      "text": "Good. Thank you guys. Bye.",
      "id": "ep_26_ut_144"
    },
    {
      "end": 3520880,
      "speaker": "Moritz Stefaner",
      "start": 3495404,
      "text": "Thanks so much. Bye bye. It.",
      "id": "ep_26_ut_145"
    }
  ],
  "confidence": 0.925688736282382,
  "audio_duration": 3529,
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_status_code": null,
  "webhook_auth": false,
  "webhook_auth_header_name": null,
  "speed_boost": false,
  "auto_highlights_result": null,
  "auto_highlights": false,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_audio_quality": null,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "content_safety": false,
  "iab_categories": true,
  "content_safety_labels": {
    "status": "unavailable",
    "results": [],
    "summary": {}
  },
  "language_detection": false,
  "language_detection_threshold": null,
  "language_confidence": null,
  "custom_spelling": null,
  "throttled": false,
  "auto_chapters": true,
  "summarization": false,
  "summary_type": null,
  "summary_model": null,
  "custom_topics": false,
  "topics": [],
  "speech_threshold": null,
  "speech_model": "best",
  "chapters": [
    {
      "summary": "Enrico: I'm doing fun projects right now. Like a b infographic analysis software for pro soccer players. And a new type of election map for the German. Data stories number 26 after a long break, summer break.",
      "gist": "Summer Break",
      "headline": "Data stories number 26 after a long break, summer break. Hi everyone. How are you doing after a summer break",
      "start": 8960,
      "end": 98576,
      "id": "ep_26_ch_0"
    },
    {
      "summary": "What are you up to? Oh, I had a nice summer in New York. My new course started. It's a visual analytics course and it looks like I have some nice students. And lots of new projects going on. Great time, great time.",
      "gist": "Summer vacation in New York",
      "headline": "What are you up to? Oh, I had a nice summer in New York",
      "start": 98688,
      "end": 160750,
      "id": "ep_26_ch_1"
    },
    {
      "summary": "We have another great guest today. We are going to talk about visualization beyond the desktop interface. Petra Eisenberg is a researcher and an old friend of mine. She's been working in the area in the intersection between visualization and human computer interaction.",
      "gist": "Ventures beyond the Desktop:",
      "headline": "Petra Eisenberg talks about visualization beyond the desktop interface",
      "start": 161930,
      "end": 209410,
      "id": "ep_26_ch_2"
    },
    {
      "summary": "Petra Kohn: I'm really interested in how we can combine information visualization with novel context or novel devices, and in novel settings, like collaborative settings. There are lots of potential opportunities and of course a lot of challenges when moving from the desktop to surfaces.",
      "gist": "Surfaces in the world of visualization",
      "headline": "Petra Sur: What can visualization do once we move beyond desktop interfaces",
      "start": 212790,
      "end": 564328,
      "id": "ep_26_ch_3"
    },
    {
      "summary": "There are visualizations that can happen in this kind of environments and just cannot happen with a standard desktop interface. Which visualization should I never put on a tabletop display like horizontal surface? This is very difficult to answer because it depends on the environment.",
      "gist": "Tableau and the future of data visualization",
      "headline": "There are some visualizations that just cannot happen with a standard desktop interface",
      "start": 564424,
      "end": 1146960,
      "id": "ep_26_ch_4"
    },
    {
      "summary": "Moritz Kohn: You have to switch your mindset to a bit more. A polar coordinate system. People can approach the table from any side. You can passively interact by walking closer. Now I'm thinking that there might be also some kind of public displays that are.",
      "gist": "Public Display at the Venice Biennale",
      "headline": "Moritz has been working on tabletop displays where people interact",
      "start": 1147780,
      "end": 1346526,
      "id": "ep_26_ch_5"
    },
    {
      "summary": "Big wall displays could be used in a more data analysis centered kind of way. A perceptual experiment looked at how accurately can people actually read information on a wall, depending on where they're standing. People made quite a few errors, mostly when they had to judge angles.",
      "gist": "Big Wall Displays",
      "headline": "Are there any recommendations, like, for designing big wall displays",
      "start": 1346638,
      "end": 1635180,
      "id": "ep_26_ch_6"
    },
    {
      "summary": "Large viewing angles may be a problem. You might want to constrain how people, or giving instructions on how people should move in front of a wall. Also consider if this is potentially a problem for whatever visualization you're building.",
      "gist": "The role of angles in visual design",
      "headline": "Large viewing angles may be a problem for some visualizations",
      "start": 1635760,
      "end": 1917520,
      "id": "ep_26_ch_7"
    },
    {
      "summary": "There's not that much research on how to interact most effectively with a visualization using touch. We're actually going to build a very large touch enabled wall here in the future. Can you really isolate the value that the touch brings beyond just measuring speed and accuracy in some task?",
      "gist": "How to interact with a touch screen",
      "headline": "Pedro: There's not that much research on how to interact with touch displays",
      "start": 1918020,
      "end": 2295480,
      "id": "ep_26_ch_8"
    },
    {
      "summary": "Moritz: Are you aware of any real world settings or companies that are already using this kind of technologies for doing some collaborative work in front of a display? Moritz: There are two main places. One is museums, one is command and control center. These kind of applications are basically what is called situation awareness kind of stuff.",
      "gist": "Real world applications of large-scale visualizations",
      "headline": "Are there any real world settings using visualization technologies in front of displays",
      "start": 2295640,
      "end": 2495750,
      "id": "ep_26_ch_9"
    },
    {
      "summary": "First you need to figure out what scenario and environment you want to support. This influences what types of displays you most likely should be choosing. Also what kind of interaction techniques you may want to supports. How can a person start doing that?",
      "gist": "How to start a design project with a touchscreen display",
      "headline": "So one thing, another thing I wanted to ask you is what can a person afford",
      "start": 2499330,
      "end": 3032300,
      "id": "ep_26_ch_10"
    },
    {
      "summary": "A lot of tabletop displays are not very good for reading text. How many pixels per inch do I need? Do I need to go up to 300, or can I go with 100 or even less? If you have some material there, we will definitely put it into the posts.",
      "gist": "What is the best screen for reading text?",
      "headline": "You asked me three things. Research and technology. Just that. I forgot the last one. Yeah, yeah",
      "start": 3033240,
      "end": 3146750,
      "id": "ep_26_ch_11"
    },
    {
      "summary": "Moritz: Pedro is one of my favorite researchers around. At some point, I decided that instead of competing with her, I should collaborate with her. We are doing some stuff together, but it's more on the perceptual side. Is there anything else you want to mention from your work?",
      "gist": "Pedro on Collaboration with Moritz",
      "headline": "Okay. Pedro, is there anything else you want to mention from your work",
      "start": 3147290,
      "end": 3210630,
      "id": "ep_26_ch_12"
    },
    {
      "summary": "The time of single touch displays is almost over, but there may still be some around. What would be really nice, and is hardly ever supported currently, is identity tracking. My dream interface would also have haptic feedback.",
      "gist": "What is a good display for a visualization application?",
      "headline": "Petra says the time of single touch displays is almost over",
      "start": 3212570,
      "end": 3520880,
      "id": "ep_26_ch_13"
    }
  ],
  "disfluencies": false,
  "entity_detection": false,
  "sentiment_analysis": false,
  "sentiment_analysis_results": null,
  "entities": null,
  "speakers_expected": null,
  "summary": null,
  "custom_topics_results": null,
  "is_deleted": null,
  "episode_num": "26",
  "episode_metadata": {
    "speakers": [
      "Enrico Bertini",
      "Moritz Stefaner",
      "Petra Isenberg"
    ],
    "WPid": "122",
    "url": "https://datastori.es/podlove/file/122/s/feed/c/mp3/datastories-26.mp3",
    "episode_title": "Visualization Beyond the Desktop w/ Petra Isenberg"
  }
}