{
  "id": "aad0506f-7b0e-4787-b866-b4778abdf21c",
  "language_model": "assemblyai_default",
  "acoustic_model": "assemblyai_default",
  "language_code": "en_us",
  "status": "completed",
  "audio_url": "https://datastori.es/podlove/file/3962/s/feed/c/mp3/98-data-sketches-with-nadieh-bremer-and-Shirley-wu.mp3",
  "utterances": [
    {
      "end": 10034,
      "speaker": "Shirley Wu",
      "start": 280,
      "text": "Why did it work out so well? And I think one is definitely the responsibility of not wanting to let each other down, but also kind of this friendship and trust that we've also developed.",
      "id": "ep_98_ut_0"
    },
    {
      "end": 32364,
      "speaker": "Enrico Bertini",
      "start": 14414,
      "text": "Data stories is brought to you by click. Are you missing out on meaningful relationships hidden in your data? Unlock the old story with Qlik sense through personalized visualizations and dynamic dashboards, which you can download for free at click de data stories.",
      "id": "ep_98_ut_1"
    },
    {
      "end": 136450,
      "speaker": "Moritz Stefaner",
      "start": 51904,
      "text": "Hey everyone, it's a new data stories. Today. There's no Enrico. It's just me, Moritz, because I'm here to do a live recording, one of the rare live recordings. And I have two guests here which I will introduce in a minute. We are in Berlin in a very strange hotel room. It's very pink and curvy, but it's a good ambience for a podcast and it's nice to record live for once. Before we start, episode 100 is coming up, so it's two more episodes out. We are very excited. And yes, we wanted to ask you, the listeners, maybe you want to contribute a bit. So we have an audio mailbox or an audio voice box and you can leave us messages. And if you want, just call us and tell us. Bit over the last years of the podcast, what were the most memorable moments for you? How do you think the field has changed? How has the podcast changed? Did we get better or worse or different? How has maybe your perspective on data as a whole changed or your whole profession? And yeah, basically just tell us any stories you want to share. Maybe data stories connected a few dots in your life as well. And of course we would love to hear that. So call us at that's a us number plus 141-36-5502 course, the number will be in the show notes, so maybe that's easier enough about us. Let's dive right in with our guests. So I'm here in Berlin with Shirley Wu. Hi, Shirley.",
      "id": "ep_98_ut_2"
    },
    {
      "end": 137074,
      "speaker": "Shirley Wu",
      "start": 136522,
      "text": "Hello.",
      "id": "ep_98_ut_3"
    },
    {
      "end": 138594,
      "speaker": "Moritz Stefaner",
      "start": 137194,
      "text": "And Nadieh Bremer.",
      "id": "ep_98_ut_4"
    },
    {
      "end": 139074,
      "speaker": "Nadieh Bremer",
      "start": 138674,
      "text": "Hello.",
      "id": "ep_98_ut_5"
    },
    {
      "end": 144554,
      "speaker": "Moritz Stefaner",
      "start": 139154,
      "text": "Hi, Nadieh. You might know Nadieh from an episode last year where we talked about the Olympic rings, right?",
      "id": "ep_98_ut_6"
    },
    {
      "end": 145722,
      "speaker": "Nadieh Bremer",
      "start": 144634,
      "text": "Yes, Olympic feathers.",
      "id": "ep_98_ut_7"
    },
    {
      "end": 146058,
      "speaker": "Moritz Stefaner",
      "start": 145778,
      "text": "Yeah.",
      "id": "ep_98_ut_8"
    },
    {
      "end": 148306,
      "speaker": "Nadieh Bremer",
      "start": 146106,
      "text": "But I like your tree rings better yesterday.",
      "id": "ep_98_ut_9"
    },
    {
      "end": 160552,
      "speaker": "Moritz Stefaner",
      "start": 148410,
      "text": "Yeah, tree feathers, rings type things. So can you briefly introduce yourself, maybe Nadieh, now that we started talking already, who are you? What are you doing doing? And how did you end up doing data with this?",
      "id": "ep_98_ut_10"
    },
    {
      "end": 189810,
      "speaker": "Nadieh Bremer",
      "start": 160608,
      "text": "Yeah, so I started doing data visualization. I don't even know when it was just basic charts, doing astronomy, making my papers, visualizing my data. But I didn't quite know that I was doing data visualization then. And I became a consultant, did data science presented a lot to clients, which meant more data visualization. And at some time, I went to a presentation where Mike Freeman showed that he was a data visualization specialist. And I'm like, oh, my God, you can be.",
      "id": "ep_98_ut_11"
    },
    {
      "end": 191114,
      "speaker": "Moritz Stefaner",
      "start": 189912,
      "text": "It's an actual job.",
      "id": "ep_98_ut_12"
    },
    {
      "end": 195958,
      "speaker": "Nadieh Bremer",
      "start": 192094,
      "text": "And that's when I dove straight in and I haven't, haven't come back up since.",
      "id": "ep_98_ut_13"
    },
    {
      "end": 199726,
      "speaker": "Moritz Stefaner",
      "start": 196006,
      "text": "So, cool. And now you're a freelance consultant designer.",
      "id": "ep_98_ut_14"
    },
    {
      "end": 200718,
      "speaker": "Nadieh Bremer",
      "start": 199830,
      "text": "Yes, indeed.",
      "id": "ep_98_ut_15"
    },
    {
      "end": 201438,
      "speaker": "Moritz Stefaner",
      "start": 200806,
      "text": "Speaker two.",
      "id": "ep_98_ut_16"
    },
    {
      "end": 205366,
      "speaker": "Nadieh Bremer",
      "start": 201486,
      "text": "So you're speaking. I love speaking about my passion for Dataviz. Yeah.",
      "id": "ep_98_ut_17"
    },
    {
      "end": 206846,
      "speaker": "Moritz Stefaner",
      "start": 205430,
      "text": "Cool. Shelley, how about you?",
      "id": "ep_98_ut_18"
    },
    {
      "end": 304444,
      "speaker": "Shirley Wu",
      "start": 206910,
      "text": "Yeah, so I actually studied business in college, and then I thought I was going to go into finance, and then I did an internship and was like, hells no. So then I, like, really quickly switched to computer science, came out as a software engineer for a big data company, and at the time, they were starting to look into doing visualizations with D3. And I just happened to be that new kid that had nothing to do. And my manager was like, hey, do you want to learn D3? And I was like, sure, why not? And then for, I think, I think maybe two or three years into, you know, doing D3 with, like, I think at the time was backbone. And I started talking about my experiences and I actually had like, a little tiny bit of an existential crisis where I was like, I am not going into this niche. Like, I don't want to be just data visualization. I want to do a bunch of other things, too. And then, like another a year in or so, I was having way too much fun with data visualization. That was, I fully embraced it. And that was around when I realized that as a kid, I actually drew and painted for 14 years of my life. And then I loved math growing up. And that was when, the moment when I realized that data visualization is basically all of that together in a bundle. And it's creative and it's fun. There's math, there's numbers, there's code that I love. And so, like Nadieh, I haven't gone back since I've embraced the niche and, yeah, and now I'm a freelancer, full time freelancer in San Francisco and hoping to make it work for as long as I can.",
      "id": "ep_98_ut_19"
    },
    {
      "end": 338042,
      "speaker": "Moritz Stefaner",
      "start": 304604,
      "text": "Very nice. Yeah, it's interesting because, yeah, as you can hear, the two have really technical and data chops, but I think now you're mostly perceived for your really creative and, yeah, very like, aesthetic data visualizations. And the project that you are working on together is called data sketches. Right. And I think this is how most people also know you now, because some of these visualizations have been really popular, and you do a lot of them. So can you tell us a bit, how did you start the project, what it's about? And also, how did you even meet? Like, how did all this go?",
      "id": "ep_98_ut_20"
    },
    {
      "end": 395608,
      "speaker": "Shirley Wu",
      "start": 338098,
      "text": "Yeah, yeah. So actually, Nadia and I actually met online in a Dataviz slack. And we didn't actually meet each other in person until. So we met each other online fall 2015 or so. And then we met each other in person in Boston at Openvizconf 2016. Cause we were both speakers. We, like, hung out the whole time. And then, and I really liked Nadieh, and apparently she liked me, too. And then a few months later, Nadieh actually put up all of her tutorials from her Openviz talk. And I had just quit my full time job then to try freelancing. I had a lot of time on my hands. And I went through all of her, all of her tutorials in one day, started messaging her questions about all of her tutorials. And then we started talking about how you hadn't done as many visualization projects as you were.",
      "id": "ep_98_ut_21"
    },
    {
      "end": 405542,
      "speaker": "Nadieh Bremer",
      "start": 395656,
      "text": "Yeah, no, mostly tutorials and maybe one project. You could see that this is a data visualization in itself. Yeah. And we were lamenting the fact that, yeah, we hadn't done.",
      "id": "ep_98_ut_22"
    },
    {
      "end": 427982,
      "speaker": "Shirley Wu",
      "start": 405678,
      "text": "Cause full time jobs keep us busy. And that was when I was like, wait. And I actually, I, like, you know, plucked up all my courage. Cause I was like, there's no way Nadieh wants to work with me. And like, I was like, Nadieh, do you want to collaborate together? And she was like, yeah. And I was like, yes. And that's how I started.",
      "id": "ep_98_ut_23"
    },
    {
      "end": 437452,
      "speaker": "Moritz Stefaner",
      "start": 428038,
      "text": "Nice. Nice. And so how did you make up? Like, there's some rules, basically, or some, like, like a way the whole project is organized. What is it? And how did you decide on that?",
      "id": "ep_98_ut_24"
    },
    {
      "end": 443028,
      "speaker": "Nadieh Bremer",
      "start": 437508,
      "text": "Yeah, so the thing is that, like, maybe after three months, we sort of forget the details already of how we.",
      "id": "ep_98_ut_25"
    },
    {
      "end": 445348,
      "speaker": "Moritz Stefaner",
      "start": 443156,
      "text": "Came up with these concepts. It just happened.",
      "id": "ep_98_ut_26"
    },
    {
      "end": 455004,
      "speaker": "Nadieh Bremer",
      "start": 445396,
      "text": "It just happened. But it happened really quickly. So maybe the next day already, we were like, yeah, we should do something every month and then do that for a year. And then a topic, and then we both create something.",
      "id": "ep_98_ut_27"
    },
    {
      "end": 471978,
      "speaker": "Shirley Wu",
      "start": 455124,
      "text": "I just want to say. So the next day, when Nadia says next day, she literally means that next day, she sent me a Google Doc, and the dog says something. Something like, Shirley and naughty, awesome collaboration marathon or something like this. We listed out.",
      "id": "ep_98_ut_28"
    },
    {
      "end": 476094,
      "speaker": "Moritz Stefaner",
      "start": 472146,
      "text": "So you said, let's do one project, and naughty was like, let's do 20. Is it like that?",
      "id": "ep_98_ut_29"
    },
    {
      "end": 500294,
      "speaker": "Nadieh Bremer",
      "start": 479354,
      "text": "No, no, it was. I think the year idea and the month idea was really quickly, and then at some point, we wanted to do more than just present the final visualizations. I wanted to write about that. And so the data and the coding part was really quickly. But I think you weren't sketching really before that. Right, because the sketching was an important part for me to add in.",
      "id": "ep_98_ut_30"
    },
    {
      "end": 537180,
      "speaker": "Shirley Wu",
      "start": 500374,
      "text": "Yeah. So the sketch part, I have a bad habit of. I just think things and then I go and code it, so there's no sketch process for me. And just because I'm just like, if I'm going to take the time to, like, draw it out, like, I can do that faster with code. Anyways, Nadia just made a face, but so this really forced me to start sketching. And actually, that was a really great. I think that's actually made me so much better than I was before. Yeah.",
      "id": "ep_98_ut_31"
    },
    {
      "end": 546076,
      "speaker": "Moritz Stefaner",
      "start": 537372,
      "text": "So the idea is every month, both of you do a visualization. They share a theme. Right. There's one. Is it just one word, the theme, or is more to the theme?",
      "id": "ep_98_ut_32"
    },
    {
      "end": 550404,
      "speaker": "Nadieh Bremer",
      "start": 546140,
      "text": "Well, there can be more words, but it's concise, like music or nostalgia.",
      "id": "ep_98_ut_33"
    },
    {
      "end": 580278,
      "speaker": "Moritz Stefaner",
      "start": 550484,
      "text": "Right. So it's big enough that you can do something interesting, and then each of you does a visualization, and then you document it. Like, how did you end up doing the visualization? And there's a lot of material on the process and so on. The sketching part is interesting. So to me, these look like finished projects, basically. I mean, I guess because both of you are like, just have this eye for detail and just want to do it right. So, yeah, to me, these seems like full fledged project, not like sketches. Or would you see them as sketches?",
      "id": "ep_98_ut_34"
    },
    {
      "end": 599284,
      "speaker": "Nadieh Bremer",
      "start": 580326,
      "text": "I guess, yeah. We had a lot of time thinking of a name, but we like the idea of the data sketches. We could have also called it data sketch code, but it was the idea of being a bit of the frivolous part of it as well, just having the fun. That was our most important thing, to have fun while we were doing these things. So that's why we sort of open.",
      "id": "ep_98_ut_35"
    },
    {
      "end": 601692,
      "speaker": "Moritz Stefaner",
      "start": 599324,
      "text": "Exploration and just playing and seeing what happens.",
      "id": "ep_98_ut_36"
    },
    {
      "end": 618794,
      "speaker": "Nadieh Bremer",
      "start": 601748,
      "text": "Sketching with your data, it's not meant as the literal way because we also found out that you can sort of sketch with code and go back to with the pen and with the code. So they are fully flat, complete data visualization projects. But I guess the data sketches makes it a bit more, takes off the pressure.",
      "id": "ep_98_ut_37"
    },
    {
      "end": 620074,
      "speaker": "Shirley Wu",
      "start": 618874,
      "text": "Yeah, yeah, yeah.",
      "id": "ep_98_ut_38"
    },
    {
      "end": 621082,
      "speaker": "Moritz Stefaner",
      "start": 620114,
      "text": "It's very smart. Yeah.",
      "id": "ep_98_ut_39"
    },
    {
      "end": 650744,
      "speaker": "Shirley Wu",
      "start": 621138,
      "text": "From the very beginning, it was supposed to just be like a fun thing that we did on the side and at first, when we were talking about it, we were like, yeah. So each week we spend five to 6 hours, and that's quite reasonable. Unfortunately, I think it's kind of like what you were saying. We're both a little bit obsessed with the details and the finishing touches, and I don't think either of us have spent 20 hours on a project since maybe the very first one and then maybe your February 1. Other than that, all of ours have been like, way more, way more, way more.",
      "id": "ep_98_ut_40"
    },
    {
      "end": 653052,
      "speaker": "Moritz Stefaner",
      "start": 651404,
      "text": "Yeah, they look like a lot of works.",
      "id": "ep_98_ut_41"
    },
    {
      "end": 655956,
      "speaker": "Nadieh Bremer",
      "start": 653108,
      "text": "Yes. But it's all done with.",
      "id": "ep_98_ut_42"
    },
    {
      "end": 657584,
      "speaker": "Moritz Stefaner",
      "start": 656100,
      "text": "Escalated quickly.",
      "id": "ep_98_ut_43"
    },
    {
      "end": 659504,
      "speaker": "Shirley Wu",
      "start": 658324,
      "text": "Very quickly.",
      "id": "ep_98_ut_44"
    },
    {
      "end": 670260,
      "speaker": "Moritz Stefaner",
      "start": 661004,
      "text": "Yeah, that's the problem. When you start a series, you want to top every previous step, probably. Yes. So you want to keep progressing, and then things escalate.",
      "id": "ep_98_ut_45"
    },
    {
      "end": 677778,
      "speaker": "Nadieh Bremer",
      "start": 670332,
      "text": "Yeah. Although when we're talking amongst ourselves, it's like, we should get back to that first. And it was still, like normal hours.",
      "id": "ep_98_ut_46"
    },
    {
      "end": 691106,
      "speaker": "Moritz Stefaner",
      "start": 677866,
      "text": "When things were, like, reasonable. I can see that, yeah. Can you tell us a bit, like, just give an overview of the types of projects you have done, like what the themes were, what your most favorite visualization maybe up to now was.",
      "id": "ep_98_ut_47"
    },
    {
      "end": 822772,
      "speaker": "Shirley Wu",
      "start": 691170,
      "text": "Oh, yeah. So all of we make sure that all of the topics that we choose are things that we can be excited about, that we can find an angle, grab onto it, and go out and find the dataset. And actually, since, since January, we've actually had guests feature. Well, we have guest features lined up for each month, and we try to make sure that the topic is exciting for them also. So for me personally, my favorite day to sketches is probably the Hamilton one in November, just because. So I have been obsessed with Hamilton the musical since, like, April of last year. I had it on repeat for like, three or four months. And then at one point, my boyfriend was like, wouldn't it be fun if you just visualize this? And I was like, oh, no, no, no. There's no way. And then a month later, Matt Daniels, who runs polygraph slash pudding, he contacted me, and I was like, hey, I have an idea to pitch you. And that's kind of how it started. So it actually wasn't supposed to be a data sketches at first, but it's slowly, slowly took so long that it became one. And it's basically this visualization. It's kind of a scrolly telling thing that I don't even know how to describe it. You scroll through, and at first, there's all of the analysis I did and the insights I found of the musical. And then as the user goes through and finishes all of that, I provide the kind of exploratory tool that helped me come to those insights. So that tool helps the user filter all of the songs in the musical by the characters, their conversations and their themes. And it's probably my favorite just because of how much I obsessed over it. And it's also my favorite just because of how hard it was. It's actually the very first time that I ever. Because I come from a very visualizations in the product sort of background. So it's the first time.",
      "id": "ep_98_ut_48"
    },
    {
      "end": 824612,
      "speaker": "Moritz Stefaner",
      "start": 822788,
      "text": "So the data was always a given problem?",
      "id": "ep_98_ut_49"
    },
    {
      "end": 857714,
      "speaker": "Shirley Wu",
      "start": 824748,
      "text": "No, no, no. In the sense that, like, it was always geared towards some sort of an end user product use case kind of thing. And this is the first time I did something that was more expository. So I had to think about the narrative and the story that I wanted to tell and pair that with the visualization itself. And I had never, ever done that before. And that was really hard. So I had a lot of panic attacks during it and, like, mild depressions. And it just makes me really happy that I came out on the other side and it's out in the world now, and I'm just so happy.",
      "id": "ep_98_ut_50"
    },
    {
      "end": 859468,
      "speaker": "Moritz Stefaner",
      "start": 857754,
      "text": "And it was a big success in the end, right?",
      "id": "ep_98_ut_51"
    },
    {
      "end": 879204,
      "speaker": "Shirley Wu",
      "start": 859546,
      "text": "Yeah, I'm so I also had little tiny panic attacks of, like, if. What if nobody cares? And I was like, naughty, like, what if nobody cares? And after, I, like, towards the end, I was like, you know what, Nadieh? I don't even care if nobody cares. But Nadieh was super supportive the whole time.",
      "id": "ep_98_ut_52"
    },
    {
      "end": 889580,
      "speaker": "Moritz Stefaner",
      "start": 879584,
      "text": "So this one took longer than a month, right? It was like three and a half months. So. I can see that. I can see that. Yeah. Yeah. You should check it out. So all the data sketches are also on the website datasketch.",
      "id": "ep_98_ut_53"
    },
    {
      "end": 890300,
      "speaker": "Shirley Wu",
      "start": 889732,
      "text": "Yes.",
      "id": "ep_98_ut_54"
    },
    {
      "end": 898884,
      "speaker": "Moritz Stefaner",
      "start": 890412,
      "text": "Right? And yeah, there's lots of great documentation. And this piece is really nice, too. Nadieh, how about you? What's your, like, favorite so far?",
      "id": "ep_98_ut_55"
    },
    {
      "end": 902164,
      "speaker": "Nadieh Bremer",
      "start": 899044,
      "text": "I still like the Olympic feathers one, but we already have, like, a separate one.",
      "id": "ep_98_ut_56"
    },
    {
      "end": 903436,
      "speaker": "Moritz Stefaner",
      "start": 902204,
      "text": "Oh, that was a data sketch, too.",
      "id": "ep_98_ut_57"
    },
    {
      "end": 905444,
      "speaker": "Nadieh Bremer",
      "start": 903500,
      "text": "That was a data sketch we didn't.",
      "id": "ep_98_ut_58"
    },
    {
      "end": 911196,
      "speaker": "Moritz Stefaner",
      "start": 905484,
      "text": "Even know at the time, so that's perfect. Yeah, I guess that was a nice one.",
      "id": "ep_98_ut_59"
    },
    {
      "end": 919604,
      "speaker": "Nadieh Bremer",
      "start": 911220,
      "text": "Yeah. What am I, more recent? Favorite ones is the month I did on. We had nostalgia as the topic and I did it about Dragon Ball Z.",
      "id": "ep_98_ut_60"
    },
    {
      "end": 920428,
      "speaker": "Moritz Stefaner",
      "start": 919684,
      "text": "Okay.",
      "id": "ep_98_ut_61"
    },
    {
      "end": 994924,
      "speaker": "Nadieh Bremer",
      "start": 920596,
      "text": "Like 15 years ago, during my teens, I was very much into Dragon Ball Z because it was the only anime that was in the Netherlands. So I just, you know, I watched every show and every episode and it was great fun diving into that again and rewatching most of this, most of the episodes again. And I spent a lot of time. So the visualization is about all of the fights that happened during all of Dragon Ball Z. Okay. And then it's sort of split apart by the sagas, which is sort of like an episode, but it's more like when the main bad guy is vanquished, the saga ends. But that can be like seven episodes or 20 episodes. And then each fight is like a group of circles and each circle is one character. And if you hover over the group, it sort of splits apart and you see who the characters really are and then they're sort of connected. You can see one character through all of the fights and it was really a lot of fun. And there are like touches in there that maybe nobody will see that. I've manually arranged the data in such a way that the bad guys are always on the right side and the good guys are on the left side. And I've annotated each of the fights. Like, what is actually happening with this fight? Why is it important? That was. It was such. It took 80 hours. It was the first time I actually sort of timed.",
      "id": "ep_98_ut_62"
    },
    {
      "end": 1001764,
      "speaker": "Moritz Stefaner",
      "start": 994964,
      "text": "Did you manually tag everything yourself or. Yeah. Okay. That's like 75 of the 80 hours, probably.",
      "id": "ep_98_ut_63"
    },
    {
      "end": 1011472,
      "speaker": "Nadieh Bremer",
      "start": 1003384,
      "text": "I spent 2 hours alone going through all of Dragon Ball Z's gifts that I could find to find the best ones to annotate the most spectacular times.",
      "id": "ep_98_ut_64"
    },
    {
      "end": 1013644,
      "speaker": "Moritz Stefaner",
      "start": 1011568,
      "text": "That's money. Well spent time.",
      "id": "ep_98_ut_65"
    },
    {
      "end": 1020712,
      "speaker": "Nadieh Bremer",
      "start": 1014784,
      "text": "So that one was just a lot of fun because I was so renewed obsessed with the topic.",
      "id": "ep_98_ut_66"
    },
    {
      "end": 1047432,
      "speaker": "Moritz Stefaner",
      "start": 1020768,
      "text": "Yeah, cool. Yeah, it's nice. And I think it's interesting because these are also very pop cultural visualizations. Often people think visualization or data analysis and culture doesn't go that well together. That's a very recent development. Only also that do we have something like digital humanities or these types of projects. So in your experience, what makes a good pop cultural visualization? How is it different to do other types of visualizations?",
      "id": "ep_98_ut_67"
    },
    {
      "end": 1054076,
      "speaker": "Nadieh Bremer",
      "start": 1047528,
      "text": "I'm not quite sure about this, but I think it really helps if the person making the visualization is also into it.",
      "id": "ep_98_ut_68"
    },
    {
      "end": 1057892,
      "speaker": "Shirley Wu",
      "start": 1054140,
      "text": "Hugely obsessed, the more the better.",
      "id": "ep_98_ut_69"
    },
    {
      "end": 1069964,
      "speaker": "Nadieh Bremer",
      "start": 1057948,
      "text": "Because then that person really knows what items to pick out that will connect with other fans in the same region. Or it can go more about how can I bring this to a wider audience? What are the best things about it?",
      "id": "ep_98_ut_70"
    },
    {
      "end": 1072332,
      "speaker": "Moritz Stefaner",
      "start": 1070124,
      "text": "But it's also about domain expertise.",
      "id": "ep_98_ut_71"
    },
    {
      "end": 1110070,
      "speaker": "Nadieh Bremer",
      "start": 1072468,
      "text": "Domain expertise, that's a good word. Yes, but maybe it's also about having going beyond the standards. So making also maybe a visualization that is maybe visually a bit more weird in a way. And it's not something that maybe visualization experts would say, no, no, no. This is maybe not the right way, but it has a visual thing about it, like, maybe doing it in a circle, even though a circle isn't the best way. Because the main point of most of these pop culture things is not in particular, I think, of getting, like, 100% accuracy in reading it, but just engaging your audience and guiding them through the story and guiding them through moments and things like that.",
      "id": "ep_98_ut_72"
    },
    {
      "end": 1112286,
      "speaker": "Moritz Stefaner",
      "start": 1110102,
      "text": "And maybe make a cultural artifact yourself.",
      "id": "ep_98_ut_73"
    },
    {
      "end": 1112774,
      "speaker": "Nadieh Bremer",
      "start": 1112350,
      "text": "Yes.",
      "id": "ep_98_ut_74"
    },
    {
      "end": 1115086,
      "speaker": "Moritz Stefaner",
      "start": 1112854,
      "text": "Right. So, because you're in that sphere already.",
      "id": "ep_98_ut_75"
    },
    {
      "end": 1117830,
      "speaker": "Nadieh Bremer",
      "start": 1115150,
      "text": "In that space, but that's my opinion.",
      "id": "ep_98_ut_76"
    },
    {
      "end": 1119894,
      "speaker": "Moritz Stefaner",
      "start": 1118022,
      "text": "How about you? Like, what's your take on that?",
      "id": "ep_98_ut_77"
    },
    {
      "end": 1243178,
      "speaker": "Shirley Wu",
      "start": 1120014,
      "text": "So. Well, okay, so, first of all, I think it's. I don't think we even really thought that much about it. We're just. We do it just for fun. And I think that's what translates so well towards the end, that it's the things that we love and. And that shows through in the final creation because of all the obsessive details that we put in there. But for me, I think the actually, the most important thing is that this is something I started thinking recently because of data sketches and because of that Hamilton piece, I started thinking about, how do I reach a wider audience? I think a lot of the things I created before that piece was more intended towards the data visualization community that we're in and the friends that we have. And if they appreciated it and they enjoyed it, then that was something that would make me happy. But for the Hamilton one, I knew that I wanted to reach people that maybe haven't even seen a visualization before or don't know how to read these things fluently. And so I think, to me, that might actually be the important thing, that we create these pieces that maybe, like what Nadieh said, that it's not necessarily all of the right visualization forms that we adhere to, but rather things that create delight, that user engagement. So for, like, the Hamilton, when I have dots that fly apart for no visual reason, they're like, it adds no actual insight, but it flies apart and it dances in the background and comes back together for, like, when I'm telling them the story and the insights, and that's just so that they'll keep scrolling down the screen. It's like a very cheap trick, but it really works. And I think it's tiny little things like that that I think, yeah, makes that piece and really reaches. I'm hoping that's what reached the wider audience, and it could just be the very obsessed fan base, but you reach them, definitely. It could just be that.",
      "id": "ep_98_ut_78"
    },
    {
      "end": 1257230,
      "speaker": "Moritz Stefaner",
      "start": 1243346,
      "text": "Yeah. But it's interesting because maybe you expose some more data heavy, data driven people to the cultural stuff, but maybe you also expose some of the people who know Hamilton, in this case, to data analysis, and they think about data. So it can go both ways.",
      "id": "ep_98_ut_79"
    },
    {
      "end": 1274838,
      "speaker": "Shirley Wu",
      "start": 1257362,
      "text": "I got some really great feedback about, I got tweets that were like, oh, my God, Dataviz plus Hamilton, two of my favorite loves. And there were also people that were like, oh, you know, my son and I are learning how to code, and this is such a great inspiration. And that was an amazing. Yeah. Feedback.",
      "id": "ep_98_ut_80"
    },
    {
      "end": 1306494,
      "speaker": "Moritz Stefaner",
      "start": 1274926,
      "text": "Cool. Like, coming back to the sketches part. So you document all the, like, the process, your thought process. I think that's really great that you also, like, go into detailed documenting all this. How is the relation of sketching by hand and sketching with codes? Like, how do you approach a new topic? So you just know, okay, I want to do something about nostalgia or about movies or whatever. How do you develop this idea, and how do you figure out which data works and which design works? What's your process there? And can you sketch with code? Is that a thing?",
      "id": "ep_98_ut_81"
    },
    {
      "end": 1398514,
      "speaker": "Nadieh Bremer",
      "start": 1306654,
      "text": "Yes. Well, I think that's definitely a thing. I typically, when I start sketching well, I try and find a topic first, although sometimes I might bump into data, but I try and find the angle first that I want to. That I want to go into. What do I want to tell people about this data set or about this topic? And when. My sketching in itself is usually very simple, so I really focus only on how do I want to morph my main data in, what kind of shape should it be? So I don't. I hardly ever use colors to sketch. It's really just pen strokes on. I want this shape, or it should flow like this, or this variable should be encoded as that. It's very simple. And then I try and get the data into that shape. And when I see that, if I put all of that data together and there is insights to be found, I can either go back to sketching, but often I sort of start focusing on the more details, like the colors, thickness. I do that with code, so that's when it sort of transforms into sketching with code. Because beforehand, I often don't know what kind of colors I want to use, how I want to implement my details, and then when I see the main abstract, shape works. Okay, great. How can I put in more details, more layers? How can I make it visually engaging? I start thinking about these small things. For example, I made visualization up music in December using circles. And while I was visualizing it, I thought, wow, what if I just make the top ten songs into tiny vinyls? Wouldn't that be fun? And it's like an on the go thing that I never thought about before, but goes during the sketching with code kind of phase.",
      "id": "ep_98_ut_82"
    },
    {
      "end": 1491514,
      "speaker": "Shirley Wu",
      "start": 1398854,
      "text": "And I think for me, a lot of the sketching part actually is just about because one of the lessons I learned, one of the earlier months is I need to explore my data before I start sketching so that I understand at least the basics of the attributes of the data and the extremes and how the distribution of it. But the way that I use the sketching is as I'm exploring the data, I'm basically jotting down, down notes of, like, I think these attributes are important, or I think, and like, how about if these attributes I use for these visual encodings and like, maybe this is how it will look like. And then, and then I start, like, like Nadieh said, I start putting that in code, and then I start seeing what it looks like on screen. And what I found also is that that process of data exploration and sketching with paper only goes so far in terms of the size of the data set. So, like, if the data set is relatively small and manageable, works really well. But when it's bigger than, say, a few thousand rows, then I definitely need to. Sometimes I don't even go to paper. I go straight to the code so that I can see what it looks like on the screen. And maybe as I'm going through exploration on the screen with my code, I might jot things down in my sketchbook of just notes that I have in my head of this insight is interesting, maybe this will be useful later or something. So that's how I interact with the sketching now, whereas, whereas I didn't at all before we started this.",
      "id": "ep_98_ut_83"
    },
    {
      "end": 1543634,
      "speaker": "Moritz Stefaner",
      "start": 1492134,
      "text": "Yeah, and it's kind of interesting. And you need to find your own way of developing and bootstrapping these projects, making sense out of this fuzzy challenge of, okay, I need to do a project about this and I don't know what it could be. And I think it's always so interesting how everybody, like, what the strategies are to get there. But, yeah, like, for the two of you, it definitely helps if you're fluent with code and then you can try things out immediately and see if they deliver value and insights. So, yeah, it's interesting. The other interesting thing is, of course, your tag team, basically, they have been more. I immediately have to think of dear data, of course, like Stephanie's and Georgia's project, which is, in a way, totally similar, but also totally different. So I think that's kind of interesting. And was that an inspiration to you, or did you later realize, oh, that's very similar to dear data, or do you see it as a totally different thing?",
      "id": "ep_98_ut_84"
    },
    {
      "end": 1586184,
      "speaker": "Shirley Wu",
      "start": 1543934,
      "text": "Yeah, I mean, I think, I mean, Georgia and Stephanie and dear data is like, I think, definitely a huge inspiration to me personally, and I think for Nadia as well. But I think when we first started thinking about this, I think the only thing that's really similar about it is we're two women in two different continents and, you know, 9 hours of time difference, and we wanted to do some sort of like a collaboration, and whereas they wanted to find out more about each other, our express purpose was have fun, learn, and do more projects. And that's, I think, maybe the main difference for us.",
      "id": "ep_98_ut_85"
    },
    {
      "end": 1609754,
      "speaker": "Nadieh Bremer",
      "start": 1587524,
      "text": "Yeah, yeah, I think that, yes. So when Shirley asked to do the collaboration, I'm sure that we were both, like, it was in our minds because we knew about dear data, but it wasn't like, hey, dear data thing. Yes, but I think it was definitely in our minds, like, you can actually do a collaboration, but, yeah, we just so happened to be two females as well.",
      "id": "ep_98_ut_86"
    },
    {
      "end": 1623810,
      "speaker": "Moritz Stefaner",
      "start": 1609794,
      "text": "Yeah, yeah, but I think it's great. And it's the thing, like, often you sit around and you think like, oh, I should do a project about this, or one should sometimes do a project about that. Right. But if you're in a team.",
      "id": "ep_98_ut_87"
    },
    {
      "end": 1624378,
      "speaker": "Nadieh Bremer",
      "start": 1623922,
      "text": "Yes.",
      "id": "ep_98_ut_88"
    },
    {
      "end": 1628122,
      "speaker": "Moritz Stefaner",
      "start": 1624466,
      "text": "You suddenly, I don't know, you have to do it. Right.",
      "id": "ep_98_ut_89"
    },
    {
      "end": 1629442,
      "speaker": "Shirley Wu",
      "start": 1628258,
      "text": "You're motivated. Yes.",
      "id": "ep_98_ut_90"
    },
    {
      "end": 1641322,
      "speaker": "Moritz Stefaner",
      "start": 1629538,
      "text": "We have the same thing with the podcast, obviously, like, alone, I would stopped the podcast like five times already, but because two of us, you know, you're obliged basically to each other. Right. Is that an experience you made too, that this keeps you going?",
      "id": "ep_98_ut_91"
    },
    {
      "end": 1641834,
      "speaker": "Shirley Wu",
      "start": 1641418,
      "text": "Yes.",
      "id": "ep_98_ut_92"
    },
    {
      "end": 1643506,
      "speaker": "Moritz Stefaner",
      "start": 1641914,
      "text": "You don't want to let the other one down.",
      "id": "ep_98_ut_93"
    },
    {
      "end": 1657178,
      "speaker": "Shirley Wu",
      "start": 1643610,
      "text": "Oh, that is exactly, that is exactly the reason why I'm still here doing this, because Nadia is like, I like to joke and say this, but it's completely true. Nadia is like the much more responsible one out of both of us.",
      "id": "ep_98_ut_94"
    },
    {
      "end": 1659218,
      "speaker": "Moritz Stefaner",
      "start": 1657346,
      "text": "She makes sure things are actually like.",
      "id": "ep_98_ut_95"
    },
    {
      "end": 1726022,
      "speaker": "Shirley Wu",
      "start": 1659306,
      "text": "Yeah, it's on track, and. But I think so. I'm actually, I think there's both great things about partnerships, and I think it's very special when you find somebody that you can really work with, because I think if you partner up with someone, maybe that you don't get along as well or that it's completely possible that both of you fall off on, like, the track right. And the project goes nowhere. So I think. I think it's also really important. I never thought it would work out as well as it did, but. Yeah, but, like, the, you know, and we really thought about, why did it work out so well? And I think one is definitely the responsibility of not wanting to let each other down, but also kind of this friendship and trust that we've also developed. Because now not only, like, if I don't do it on time, not only am I letting her down in a, quote, unquote, professional way, but, like, also kind of, like, a personal way of, like, I feel like now I'm, like, letting down my friend on, like, a promise I made.",
      "id": "ep_98_ut_96"
    },
    {
      "end": 1750382,
      "speaker": "Nadieh Bremer",
      "start": 1726118,
      "text": "And it also helps that so sometimes people ask us how we collaborate, but we completely separately build our visualizations, but we share a lot of the process in between. So we. I tell Shirley, like, oh, I found this data set that I'm gonna do something with. And then we share screenshots, and we share photos of our sketches. So it's, like, continuously throughout the month. We're showing each other what we're doing, which, again, when I see what Shirley's doing, it, again motivates me.",
      "id": "ep_98_ut_97"
    },
    {
      "end": 1753318,
      "speaker": "Moritz Stefaner",
      "start": 1750438,
      "text": "Doesn't drive you crazy. She's already, like, so far.",
      "id": "ep_98_ut_98"
    },
    {
      "end": 1760470,
      "speaker": "Shirley Wu",
      "start": 1753406,
      "text": "No, no. That's usually the other way around, where I'm like, oh, damn it. Nadia is like, already, so far, it's, like, running together.",
      "id": "ep_98_ut_99"
    },
    {
      "end": 1761154,
      "speaker": "Moritz Stefaner",
      "start": 1760542,
      "text": "Right?",
      "id": "ep_98_ut_100"
    },
    {
      "end": 1768470,
      "speaker": "Nadieh Bremer",
      "start": 1761614,
      "text": "Yeah, but it's like, because it's like a back and forth kind of ping pong kind of thing. It keeps me going, in that sense, to go to.",
      "id": "ep_98_ut_101"
    },
    {
      "end": 1774622,
      "speaker": "Moritz Stefaner",
      "start": 1768582,
      "text": "And do you give advice to each other or do you? Yeah. So while you work, you critique and say, like, try this, try that.",
      "id": "ep_98_ut_102"
    },
    {
      "end": 1780078,
      "speaker": "Nadieh Bremer",
      "start": 1774678,
      "text": "No, it's not only like, hey, Shirley. And then it's like, oh, my God. Amazing. And that's it, I'm told.",
      "id": "ep_98_ut_103"
    },
    {
      "end": 1780574,
      "speaker": "Moritz Stefaner",
      "start": 1780126,
      "text": "Naughty.",
      "id": "ep_98_ut_104"
    },
    {
      "end": 1792982,
      "speaker": "Nadieh Bremer",
      "start": 1780654,
      "text": "Like, when I tell myself, yeah, no, no pointers. Yeah, yeah. Or we. I tell her, like, I have this and it's not working. I can't figure it out. And then she really looks at it, and she gives me ideas like that.",
      "id": "ep_98_ut_105"
    },
    {
      "end": 1794394,
      "speaker": "Moritz Stefaner",
      "start": 1792998,
      "text": "So it's like, yeah, it doesn't work.",
      "id": "ep_98_ut_106"
    },
    {
      "end": 1814944,
      "speaker": "Shirley Wu",
      "start": 1797164,
      "text": "Even this morning, I was like, hey, Nadia, I have this thing. And I think I was being really stupid. And then we worked through, I think it was a more stats kind of thing, and Nadia helped me work through it. It's definitely very collaborative in that sense. Not the code part, but rather just a lot of support.",
      "id": "ep_98_ut_107"
    },
    {
      "end": 1834818,
      "speaker": "Moritz Stefaner",
      "start": 1816724,
      "text": "So coming to the practical side. So, I mean, this sounds, like, amazing, but also super time intensive. Right? And so all the communication, all the, like, doing the actual project. Then you speak a lot about projects. Like, you also work freelance. How do you balance all these, like, all these full time jobs?",
      "id": "ep_98_ut_108"
    },
    {
      "end": 1866362,
      "speaker": "Nadieh Bremer",
      "start": 1834866,
      "text": "I have like a list of all the Netflix shows I still have to see after June is done next year, maybe books I need to read. So it's. Yeah, it takes a lot of effort. It takes a lot of time. But I guess we're both very passionate about it. So we do spend a lot of evenings and during the weekends we work on these things as well. It's finding a balance between your personal life and having time set aside for this as well. Yeah, but, yeah, I'm super motivated. I really enjoy what I'm doing. Sometimes it goes a bit crazy. I'm like, I should round this off for this month.",
      "id": "ep_98_ut_109"
    },
    {
      "end": 1867974,
      "speaker": "Moritz Stefaner",
      "start": 1866418,
      "text": "I've been doing this too much.",
      "id": "ep_98_ut_110"
    },
    {
      "end": 1874654,
      "speaker": "Nadieh Bremer",
      "start": 1871074,
      "text": "In general, I enjoying every hour.",
      "id": "ep_98_ut_111"
    },
    {
      "end": 1879978,
      "speaker": "Moritz Stefaner",
      "start": 1875074,
      "text": "And if you have momentum, you need to keep going. You have to at some point, make sure it's sustainable.",
      "id": "ep_98_ut_112"
    },
    {
      "end": 1881890,
      "speaker": "Nadieh Bremer",
      "start": 1880026,
      "text": "But, you know, there's an end point.",
      "id": "ep_98_ut_113"
    },
    {
      "end": 1917014,
      "speaker": "Shirley Wu",
      "start": 1882002,
      "text": "Yeah, I think the June end date, or like the, you know, June is our last month, so July is our end is kind of the light at the end of the tunnel that's like keeping us going. But also, I think speaking about that, I think Nadieh might be the person that I talk to spend the most time with after my boyfriend. And sometimes I feel like maybe I might spend more time talking to and working with naughty more than my boyfriend, I don't think. I hope that's not true. My boyfriend and I live together, so.",
      "id": "ep_98_ut_114"
    },
    {
      "end": 1920754,
      "speaker": "Nadieh Bremer",
      "start": 1918034,
      "text": "I mean, it takes more effort to type in the talk. So.",
      "id": "ep_98_ut_115"
    },
    {
      "end": 1924914,
      "speaker": "Shirley Wu",
      "start": 1920834,
      "text": "Yeah, I think. Sorry, Alex, thank you for being supportive.",
      "id": "ep_98_ut_116"
    },
    {
      "end": 1959882,
      "speaker": "Moritz Stefaner",
      "start": 1924954,
      "text": "Yeah. Maybe we should talk to him next. Yeah, that's the thing. On the one hand, like a project, when you know you have a good direction, you want to finish it and you want to keep the momentum at the same, same time. Yeah. You want to balance it with other things. Right, yeah. But also, I've seen you've been smart in a way that the work you've done, you also place it at different places, like polygraph or last month you published something with story news lab. And I think that's, of course, great if you develop your own visualization, but then you're able to place it in publishing context, right?",
      "id": "ep_98_ut_117"
    },
    {
      "end": 1960314,
      "speaker": "Nadieh Bremer",
      "start": 1959938,
      "text": "Yes.",
      "id": "ep_98_ut_118"
    },
    {
      "end": 1975904,
      "speaker": "Shirley Wu",
      "start": 1960394,
      "text": "And that's been extremely helpful just because I started the freelancing gig last, last summer. And this has been extremely, extremely helpful in getting contracts that help me eat and live.",
      "id": "ep_98_ut_119"
    },
    {
      "end": 1998228,
      "speaker": "Moritz Stefaner",
      "start": 1977884,
      "text": "But that's an interesting question. Do people approach you a lot. And how is freelance life for you right now, especially as a woman? And also, do people see that you actually have really serious technical jobs as well? Or is it always like, yeah, she does these colorful, crazy visualizations, but who knows if she can do, like, really serious stuff?",
      "id": "ep_98_ut_120"
    },
    {
      "end": 2066126,
      "speaker": "Shirley Wu",
      "start": 1998276,
      "text": "Being a woman, I downplay my skills. I'm like, oh, I just built these fun, silly things on the web. And it's actually other people that are like, no. Like, they're like, no, Shirley. Like, this is amazing. Like, this is technically, like, you know, really. And so other people are actually, like, you know, like, my friends, female and male, are the ones that are kind of, like, saying these nice things about me. So they definitely don't downplay the technical skills I do have. So I'm really, really thankful for that. And I think the other nice thing about just, like, doing this for fun and staying true to who I am and making things I just call fun and silly and colorful is that people that find me for these contracts, they find me because they like my style. I have not had to work with anybody bad or, like, you know, or sexist or racist or any of that just because I think they, they find, they see me who. For who I am. And so that's been really, really amazing. Yeah.",
      "id": "ep_98_ut_121"
    },
    {
      "end": 2076790,
      "speaker": "Moritz Stefaner",
      "start": 2066190,
      "text": "Yeah. So that's the advantage. Maybe if you first put your work out there that people will recognize you for your work and have a clear idea of what you like and what you like to do, and then. Yeah, that helps. Yeah.",
      "id": "ep_98_ut_122"
    },
    {
      "end": 2077278,
      "speaker": "Shirley Wu",
      "start": 2076862,
      "text": "Yeah.",
      "id": "ep_98_ut_123"
    },
    {
      "end": 2079484,
      "speaker": "Moritz Stefaner",
      "start": 2077366,
      "text": "Do you have a similar experience? How is it for you?",
      "id": "ep_98_ut_124"
    },
    {
      "end": 2109264,
      "speaker": "Nadieh Bremer",
      "start": 2079564,
      "text": "Yes, it's been the same for me. So before data sketches, I've already been putting out personal projects that help define what I do and the kind of style I like. And now I can use the data sketches projects as well. So people that come to me, they indeed know what kind of data visualizations I make, and so they come for me for specifically that kind of thing. And I also have very clearly on my contact page that I can do. I love to do a lot of data visualization, but I'm not doing dashboards, so that's no dashboard.",
      "id": "ep_98_ut_125"
    },
    {
      "end": 2111414,
      "speaker": "Shirley Wu",
      "start": 2110634,
      "text": "Yeah.",
      "id": "ep_98_ut_126"
    },
    {
      "end": 2124050,
      "speaker": "Nadieh Bremer",
      "start": 2112994,
      "text": "So, yeah, it's been very good for me as well. Yeah. I haven't, I've emailed two or three people myself saying, hey, I'm a freelancer, but for the rest is like just email and just answering my emails I get in my inbox.",
      "id": "ep_98_ut_127"
    },
    {
      "end": 2124426,
      "speaker": "Moritz Stefaner",
      "start": 2124122,
      "text": "Yeah.",
      "id": "ep_98_ut_128"
    },
    {
      "end": 2125414,
      "speaker": "Nadieh Bremer",
      "start": 2124490,
      "text": "That's amazing.",
      "id": "ep_98_ut_129"
    },
    {
      "end": 2147174,
      "speaker": "Moritz Stefaner",
      "start": 2125914,
      "text": "So I know you have also followed the discussion on the D3 slack, and we also had Elijah on the show, Elijah mix. I think two episodes ago or something. Your experience, is there like a crisis for custom made visualizations, or are things going fine? Or what's your take on this whole very complicated and convoluted debate?",
      "id": "ep_98_ut_130"
    },
    {
      "end": 2156386,
      "speaker": "Nadieh Bremer",
      "start": 2148274,
      "text": "Yeah, so I'm also not in the Bay area, so I have not experienced this sort of movement towards more of the backend. I actually come from data science towards data visual.",
      "id": "ep_98_ut_131"
    },
    {
      "end": 2156498,
      "speaker": "Shirley Wu",
      "start": 2156410,
      "text": "Right.",
      "id": "ep_98_ut_132"
    },
    {
      "end": 2158786,
      "speaker": "Moritz Stefaner",
      "start": 2156506,
      "text": "I have to think of that. You did it the other way.",
      "id": "ep_98_ut_133"
    },
    {
      "end": 2178480,
      "speaker": "Nadieh Bremer",
      "start": 2158850,
      "text": "Yeah, I did it the other way around. People have been very supportive of getting me into data visualization about the custom things. I feel like it's still in the up. So it's still an upcoming thing. I wish there was more, but it's been getting more the last year, the last two years. So I hope that just that trend keeps continuing.",
      "id": "ep_98_ut_134"
    },
    {
      "end": 2180824,
      "speaker": "Moritz Stefaner",
      "start": 2178552,
      "text": "And you do get requests for these types of.",
      "id": "ep_98_ut_135"
    },
    {
      "end": 2192934,
      "speaker": "Nadieh Bremer",
      "start": 2180984,
      "text": "Yes. Especially people want to have they see that not all of the data fits into either a bar chart or a line chart. They have more complex data, so they want more or newer or. How do you say that? Customized charts for that data.",
      "id": "ep_98_ut_136"
    },
    {
      "end": 2286812,
      "speaker": "Shirley Wu",
      "start": 2193914,
      "text": "I guess I'll also kind of talk a little bit about my take on this. So it's interesting because I did work in the Bay area at a tech startup doing data visualization in product. So that's the background I come from. And it's interesting because up until Elijah mentioned it, I hadn't noticed that people were leaving. That could also be because I have been freelancing for the past year and not talking to anybody and. But, you know, once I started thinking a lot more about what Elijah and others in the community were pointing out about the companies in the Bay area, I started to kind of realize that, like, a lot of it is about educating not only, like, upper management or anything like that. I suddenly I started to remember, like, the kind of pushback I would get as soon as I tried to propose a visualization that wasn't, as, you know, commonplace. That wasn't the bar chart or. We were a security company, so people were very familiar with network graphs. But I remember my teammate wanted to propose a parallel coordinate, and that was hard. Yeah. Like a sankey diagram was, like, too far. And so, you know, we were. Would prototype these things, but it wouldn't go. And this is a whole separate conversation. Like a whole conversation that. Yeah, but I have many thoughts on this.",
      "id": "ep_98_ut_137"
    },
    {
      "end": 2324842,
      "speaker": "Moritz Stefaner",
      "start": 2286908,
      "text": "Yeah, maybe next. Next time. Yeah, I agree. And there's so many angles to it, and I think we were all amazed how many different takes are on this very simple issue, actually. And I think that shows also there's a lot still to be developed and. Yeah, yeah. But I'm also a person working now on a very applied data visualization, just to show that custom visualization can like play, play a good functional role in the company. I hope it will be good. We have to wrap up soon. It's a pity, but yeah. What's coming next in the series? So you're almost done?",
      "id": "ep_98_ut_138"
    },
    {
      "end": 2326122,
      "speaker": "Shirley Wu",
      "start": 2324898,
      "text": "Almost done.",
      "id": "ep_98_ut_139"
    },
    {
      "end": 2345522,
      "speaker": "Moritz Stefaner",
      "start": 2326178,
      "text": "Then there will be a huge vacation like this will be amazing, with lots of Netflix and Pina colada doing nothing. What do you have in mind for afterwards? Will you work as a studio? As one of the online publications has already speculated, I think Faz company wrote that you have the data sketches studio.",
      "id": "ep_98_ut_140"
    },
    {
      "end": 2350762,
      "speaker": "Shirley Wu",
      "start": 2345578,
      "text": "Together we asked for the correction. We asked them to correct. There were two data visualizations maybe we.",
      "id": "ep_98_ut_141"
    },
    {
      "end": 2357242,
      "speaker": "Moritz Stefaner",
      "start": 2350778,
      "text": "Shouldn'T correct, but just found the studio. I mean, that's the other solution. What do you think?",
      "id": "ep_98_ut_142"
    },
    {
      "end": 2413870,
      "speaker": "Shirley Wu",
      "start": 2357298,
      "text": "Well, okay, so for the immediate future, what we have planned is a medium publication. Because even though, you know, we've run out of steam by June to keep doing this intense pace, what we realized was that one of the feedbacks, the continuous feedbacks we get is the value of our write ups, especially for people that are just starting out to do data visualization or to code or design or. And so I think to keep that spirit going, we want to do this medium publication. So it's like medium.com data sketches, so that we can curate visualization projects that we're really excited about and then be able to put up and ask the authors, the creators, to do the write up. And the only restriction we have is that they follow the format of data, sketch code and their write ups, and hopefully building a tiny little community around it.",
      "id": "ep_98_ut_143"
    },
    {
      "end": 2417382,
      "speaker": "Moritz Stefaner",
      "start": 2413902,
      "text": "And will you invite people or do people apply, or how does it work?",
      "id": "ep_98_ut_144"
    },
    {
      "end": 2424724,
      "speaker": "Nadieh Bremer",
      "start": 2417558,
      "text": "Both is fun. Yeah. It's mostly that there would be one place on the Internet that people can go to and read about. How are some of these fantastic projects made?",
      "id": "ep_98_ut_145"
    },
    {
      "end": 2430788,
      "speaker": "Moritz Stefaner",
      "start": 2424764,
      "text": "Fantastic. Yeah. That's cool. And we're just looking forward to the final one or two pieces coming up, or how many.",
      "id": "ep_98_ut_146"
    },
    {
      "end": 2431956,
      "speaker": "Nadieh Bremer",
      "start": 2430836,
      "text": "Well, it's.",
      "id": "ep_98_ut_147"
    },
    {
      "end": 2435444,
      "speaker": "Shirley Wu",
      "start": 2432140,
      "text": "I mean, speaking of track and on track.",
      "id": "ep_98_ut_148"
    },
    {
      "end": 2440324,
      "speaker": "Nadieh Bremer",
      "start": 2435564,
      "text": "So April was actually, we spent time on creating the presentation for openvisconf.",
      "id": "ep_98_ut_149"
    },
    {
      "end": 2440724,
      "speaker": "Moritz Stefaner",
      "start": 2440364,
      "text": "Oh, yeah.",
      "id": "ep_98_ut_150"
    },
    {
      "end": 2443180,
      "speaker": "Nadieh Bremer",
      "start": 2440764,
      "text": "So we both have, still have to do April, even though it's may.",
      "id": "ep_98_ut_151"
    },
    {
      "end": 2447516,
      "speaker": "Moritz Stefaner",
      "start": 2443252,
      "text": "Yeah, I have three more coming up probably after. Yeah. Okay.",
      "id": "ep_98_ut_152"
    },
    {
      "end": 2448516,
      "speaker": "Shirley Wu",
      "start": 2447540,
      "text": "Yeah, we'll see.",
      "id": "ep_98_ut_153"
    },
    {
      "end": 2452424,
      "speaker": "Moritz Stefaner",
      "start": 2448700,
      "text": "For us, it's great. I mean, we just consume them, but you have to create them.",
      "id": "ep_98_ut_154"
    },
    {
      "end": 2474004,
      "speaker": "Shirley Wu",
      "start": 2453684,
      "text": "I'm actually pretty excited for my April 1 because it's quite relevant to the D3 community and Elijah because I'm visualizing the survey responses because they haven't been visualized yet. Probably there's been in a basic way, but yeah, the Dataviz community survey, that's great visualization.",
      "id": "ep_98_ut_155"
    },
    {
      "end": 2475260,
      "speaker": "Moritz Stefaner",
      "start": 2474164,
      "text": "It's very metal.",
      "id": "ep_98_ut_156"
    },
    {
      "end": 2478304,
      "speaker": "Shirley Wu",
      "start": 2475412,
      "text": "Yes, that's what I go for.",
      "id": "ep_98_ut_157"
    },
    {
      "end": 2494728,
      "speaker": "Moritz Stefaner",
      "start": 2480184,
      "text": "Very good. Much looking forward. So everybody check out the website at Datasketch es and read all the process documentations there and the medium publication. We will link everything. And thanks so much for coming and it's a lovely project and thanks for sharing all of this.",
      "id": "ep_98_ut_158"
    },
    {
      "end": 2495832,
      "speaker": "Shirley Wu",
      "start": 2494736,
      "text": "Thank you so much for having me.",
      "id": "ep_98_ut_159"
    },
    {
      "end": 2496920,
      "speaker": "Nadieh Bremer",
      "start": 2495848,
      "text": "Yes, super cool.",
      "id": "ep_98_ut_160"
    },
    {
      "end": 2499204,
      "speaker": "Moritz Stefaner",
      "start": 2496992,
      "text": "Thank you. Bye bye bye.",
      "id": "ep_98_ut_161"
    },
    {
      "end": 2513868,
      "speaker": "Enrico Bertini",
      "start": 2506284,
      "text": "Hey guys, thanks for listening to data stories again. Before you leave, here are a few ways you can support the show and get in touch with us.",
      "id": "ep_98_ut_162"
    },
    {
      "end": 2528580,
      "speaker": "Moritz Stefaner",
      "start": 2513956,
      "text": "First, we have a page on Patreon where you can contribute an amount of your choosing per episode. As you can imagine, we have some costs for running the show and we would love to make it a community driven project. You can find the page@patreon.com Datastories and.",
      "id": "ep_98_ut_163"
    },
    {
      "end": 2539204,
      "speaker": "Enrico Bertini",
      "start": 2528612,
      "text": "If you can spend a couple of minutes rating us on iTunes, that be extremely helpful for the show. Just search us in iTunes store or follow the link in our website.",
      "id": "ep_98_ut_164"
    },
    {
      "end": 2563312,
      "speaker": "Moritz Stefaner",
      "start": 2539544,
      "text": "And we also want to give you some information on the many ways you can get news directly from us. We're of course on twitter@twitter.com, Datastories but we also have a Facebook page@Facebook.com, datastoriespodcast and we also have a newsletter. So if you want to get news directly into your inbox, go to our homepage data stories and look for the link that you find in the footer.",
      "id": "ep_98_ut_165"
    },
    {
      "end": 2584926,
      "speaker": "Enrico Bertini",
      "start": 2563448,
      "text": "And finally, you can also chat directly with us and other listeners using slack again, you can find a button to sign up at the bottom of our page. And we do love to get in touch with our listeners. So if you want to suggest a way to improve the show or know amazing people you want us to invite or projects you want us to talk about, let us know.",
      "id": "ep_98_ut_166"
    },
    {
      "end": 2588794,
      "speaker": "Moritz Stefaner",
      "start": 2585030,
      "text": "That's all for now. See you next time, and thanks for listening to data stories.",
      "id": "ep_98_ut_167"
    },
    {
      "end": 2610134,
      "speaker": "Enrico Bertini",
      "start": 2592694,
      "text": "Data stories is brought to you by click. Are you missing out on meaningful relationships hidden in your data? Unlock the old story with Qlik sense through personalized visualizations and dynamic dashboards which you can download for free at Qlik Datastories.",
      "id": "ep_98_ut_168"
    }
  ],
  "confidence": 0.922376181007008,
  "audio_duration": 2610,
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_status_code": null,
  "webhook_auth": false,
  "webhook_auth_header_name": null,
  "speed_boost": false,
  "auto_highlights_result": null,
  "auto_highlights": false,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_audio_quality": null,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "content_safety": false,
  "iab_categories": true,
  "content_safety_labels": {
    "status": "unavailable",
    "results": [],
    "summary": {}
  },
  "language_detection": false,
  "language_detection_threshold": null,
  "language_confidence": null,
  "custom_spelling": null,
  "throttled": false,
  "auto_chapters": true,
  "summarization": false,
  "summary_type": null,
  "summary_model": null,
  "custom_topics": false,
  "topics": [],
  "speech_threshold": null,
  "speech_model": "best",
  "chapters": [
    {
      "summary": "Data stories is brought to you by click. Are you missing out on meaningful relationships hidden in your data? Unlock the old story with Qlik sense through personalized visualizations and dynamic dashboards.",
      "gist": "Data Stories: The Stories of Your Data",
      "headline": "Are you missing out on meaningful relationships hidden in your data",
      "start": 280,
      "end": 32364,
      "id": "ep_98_ch_0"
    },
    {
      "summary": "Episode 100 is coming up, so it's two more episodes out. Tell us any stories you want to share. Call us at 141-36-5502. What were the most memorable moments for you over the last years of the podcast?",
      "gist": "Data Stories",
      "headline": "This is a new data stories podcast. And yes, we want to contribute a bit",
      "start": 51904,
      "end": 133138,
      "id": "ep_98_ch_1"
    },
    {
      "summary": "Shirley Wu and Nadieh Bremer talk about their passion for data visualization. Bremer started doing data visualization as a software engineer for a big data company. Now she's a freelance consultant designer in San Francisco.",
      "gist": "In the Elevator With Data Visualization",
      "headline": "Nadieh Bremer started doing data visualization when he was a software engineer",
      "start": 133186,
      "end": 305452,
      "id": "ep_98_ch_2"
    },
    {
      "summary": "The project that Nadia and I are working on together is called data sketches. There's some rules, basically, or some, like, like a way the whole project is organized. The two are mostly known for their creative and aesthetic data visualizations.",
      "gist": "Shirley and Nadieh on Data sketches",
      "headline": "Nadia and Shirley are working on a data visualization project called data sketches",
      "start": 305588,
      "end": 537180,
      "id": "ep_98_ch_3"
    },
    {
      "summary": "Every month, both of you do a visualization. They share a theme. To me, these look like finished projects, basically. But the data sketches makes it a bit more, takes off the pressure. When you start a series, you want to top every previous step.",
      "gist": "The Data Skills Project",
      "headline": "So the idea is every month, both of you do a visualization",
      "start": 537372,
      "end": 681602,
      "id": "ep_98_ch_4"
    },
    {
      "summary": "Nadieh: My favorite day to sketches is probably the Hamilton one in November. It's probably my favorite just because of how much I obsessed over it. This is the first time I ever did something that was more expository. All the data sketches are also on the website datasketch.",
      "gist": "What's Your Favorite Project?",
      "headline": "Can you tell us a bit, like, what the types of projects you have done",
      "start": 681778,
      "end": 1022884,
      "id": "ep_98_ch_5"
    },
    {
      "summary": "Nadieh: What makes a good pop cultural visualization? How is it different to other types of visualizations? Nadieh: It's also about having going beyond the standards. It's not necessarily all of the right visualization forms that we adhere to, but rather things that create delight.",
      "gist": "What Makes a Good Pop Cultural Visualization?",
      "headline": "Many people think visualization or data analysis and culture don't go well together",
      "start": 1023584,
      "end": 1275594,
      "id": "ep_98_ch_6"
    },
    {
      "summary": "How is the relation of sketching by hand and sketching with codes? How do you develop this idea, and how do you figure out which data works and which design works?",
      "gist": "Sketching by Hand and Code",
      "headline": "How is the relation of sketching by hand and sketching with codes",
      "start": 1275934,
      "end": 1519364,
      "id": "ep_98_ch_7"
    },
    {
      "summary": "Stephanie and Nadia's project is totally similar to dear data, but also totally different. Their express purpose was to have fun, learn, and do more projects. Why did it work out so well? Both the responsibility of not letting each other down and the friendship and trust that they've developed.",
      "gist": "The Imagination Tag Team",
      "headline": "The other interesting thing is, of course, your tag team is totally different",
      "start": 1519404,
      "end": 1818660,
      "id": "ep_98_ch_8"
    },
    {
      "summary": "You also work freelance. How do you balance all these, like, all these full time jobs? Sometimes it goes a bit crazy. If you have momentum, you need to keep going. But, you know, there's an end point.",
      "gist": "How Do You Balance Working Full Time With Your Personal Life?",
      "headline": "You also work freelance. How do you balance all these full time jobs",
      "start": 1818692,
      "end": 1975904,
      "id": "ep_98_ch_9"
    },
    {
      "summary": "How is freelance life for you right now, especially as a woman? Do people see that you actually have really serious technical jobs as well? People that find me for these contracts, they find me because they like my style.",
      "gist": "Data Sketches: The freelance life",
      "headline": "How is freelance life for you right now as a woman",
      "start": 1977884,
      "end": 2125414,
      "id": "ep_98_ch_10"
    },
    {
      "summary": "Is there like a crisis for custom made visualizations, or are things going fine? Or what's your take on this whole complicated and convoluted debate? What's coming next in the series?",
      "gist": "Custom Visualizations: Are We in a Crisis?",
      "headline": "Is there a crisis for custom made visualizations or are things going fine",
      "start": 2125914,
      "end": 2335618,
      "id": "ep_98_ch_11"
    },
    {
      "summary": "Elijah: For the immediate future, what we have planned is a medium publication. It's like medium. com data sketches, so that we can curate visualization projects. Here are a few ways you can support the show and get in touch with us.",
      "gist": "Data Stories: A Medium Publication",
      "headline": "Elijah: What do you have planned for the immediate future",
      "start": 2335786,
      "end": 2610134,
      "id": "ep_98_ch_12"
    }
  ],
  "disfluencies": false,
  "entity_detection": false,
  "sentiment_analysis": false,
  "sentiment_analysis_results": null,
  "entities": null,
  "speakers_expected": null,
  "summary": null,
  "custom_topics_results": null,
  "episode_num": 98,
  "episode_metadata": {
    "speakers": [
      "Shirley Wu",
      "Enrico Bertini",
      "Moritz Stefaner",
      "Nadieh Bremer"
    ],
    "WPid": "943",
    "url": "https://datastori.es/podlove/file/3962/s/feed/c/mp3/98-data-sketches-with-nadieh-bremer-and-shirley-wu.mp3",
    "episode_title": "Data Sketches with Nadieh Bremer and Shirley Wu"
  }
}