{
  "id": "7cf6b13e-cc95-4d11-8da7-34fcf4df57a6",
  "language_model": "assemblyai_default",
  "acoustic_model": "assemblyai_default",
  "language_code": "en_us",
  "status": "completed",
  "audio_url": "https://datastori.es/podlove/file/478/s/feed/c/mp3/data-stories-42-with-Santiaho-Ortiz.mp3",
  "utterances": [
    {
      "end": 38762,
      "speaker": "Enrico Bertini",
      "start": 320,
      "text": "Hi, everyone. Enrico here. Moritz is next to me, and we have an announcement before we start the episode. Great announcement. So Tableau Software decided to sponsor data stories. This is, of course, great, great news for us and for everyone because we will be able to create more episodes, Higher quality, audio quality, quick gear, maybe proper microphones for us and for our guests, hopefully. And we will be able to pay Nathan and Fabricio, who been editing data stories for quite a while, for free. Thanks, Nathan and Fabricio. And so that's great.",
      "id": "ep_42_ut_0"
    },
    {
      "end": 48946,
      "speaker": "Moritz Stefaner",
      "start": 38946,
      "text": "It puts the whole project also on a bit more solid feat. You know, it's been a spare time thing for us all the time. And now with a sponsor, we can sort of treat it a bit differently as well, which is great.",
      "id": "ep_42_ut_1"
    },
    {
      "end": 52850,
      "speaker": "Enrico Bertini",
      "start": 49018,
      "text": "Yeah. Maybe we should tell our listeners how this is gonna play out.",
      "id": "ep_42_ut_2"
    },
    {
      "end": 68726,
      "speaker": "Moritz Stefaner",
      "start": 52930,
      "text": "Yeah, I guess so. We will have two short snippets at the beginning and end of each episode and a short section in the middle where we discuss the product. And there's a special URL. So if you go to that URL on the Tableau side, they know actually they come from you, are coming from us, and.",
      "id": "ep_42_ut_3"
    },
    {
      "end": 69438,
      "speaker": "Enrico Bertini",
      "start": 68838,
      "text": "Which is good.",
      "id": "ep_42_ut_4"
    },
    {
      "end": 69878,
      "speaker": "Moritz Stefaner",
      "start": 69494,
      "text": "Yeah.",
      "id": "ep_42_ut_5"
    },
    {
      "end": 72166,
      "speaker": "Enrico Bertini",
      "start": 69974,
      "text": "Which is good to keep them doing.",
      "id": "ep_42_ut_6"
    },
    {
      "end": 75454,
      "speaker": "Moritz Stefaner",
      "start": 72198,
      "text": "It and so on and. Yeah, that's about it.",
      "id": "ep_42_ut_7"
    },
    {
      "end": 77350,
      "speaker": "Enrico Bertini",
      "start": 75582,
      "text": "Okay, let's start the show then.",
      "id": "ep_42_ut_8"
    },
    {
      "end": 104610,
      "speaker": "Moritz Stefaner",
      "start": 77390,
      "text": "Let's get started. Datastore is supported by Tableau software, helping people see and understand their data. Get answers from interactive dashboards. Wherever you go for your free trial, visit Tableau software at table software.com Datastories. That's Tableau software.com Datastories.",
      "id": "ep_42_ut_9"
    },
    {
      "end": 120074,
      "speaker": "Enrico Bertini",
      "start": 115630,
      "text": "Hi, everyone. Data stories number 42. Hi, Moritz. How's it going?",
      "id": "ep_42_ut_10"
    },
    {
      "end": 122058,
      "speaker": "Moritz Stefaner",
      "start": 120242,
      "text": "Hey, Enrico, how's life?",
      "id": "ep_42_ut_11"
    },
    {
      "end": 125130,
      "speaker": "Enrico Bertini",
      "start": 122194,
      "text": "It's. It's great. Yeah? Yeah, yeah.",
      "id": "ep_42_ut_12"
    },
    {
      "end": 125706,
      "speaker": "Moritz Stefaner",
      "start": 125250,
      "text": "Very good.",
      "id": "ep_42_ut_13"
    },
    {
      "end": 127910,
      "speaker": "Enrico Bertini",
      "start": 125738,
      "text": "A little bit hectic, but great.",
      "id": "ep_42_ut_14"
    },
    {
      "end": 131746,
      "speaker": "Moritz Stefaner",
      "start": 129570,
      "text": "I'm super busy, too. I'm really tired.",
      "id": "ep_42_ut_15"
    },
    {
      "end": 139090,
      "speaker": "Enrico Bertini",
      "start": 131898,
      "text": "Yeah, I wish it was. Busy is the new normal, right? I mean, so we should actually meet and say, oh, you know, I'm not busy.",
      "id": "ep_42_ut_16"
    },
    {
      "end": 141018,
      "speaker": "Moritz Stefaner",
      "start": 139210,
      "text": "Yeah, I'm bored.",
      "id": "ep_42_ut_17"
    },
    {
      "end": 144070,
      "speaker": "Enrico Bertini",
      "start": 141114,
      "text": "I'm bored. Yeah. You know, vacation.",
      "id": "ep_42_ut_18"
    },
    {
      "end": 157710,
      "speaker": "Moritz Stefaner",
      "start": 144850,
      "text": "Yeah, I read all my comic books. I don't know what to do. Yeah. No, but fall is always a bit crazy, and I knew it before, but I'm still complaining. But it's okay.",
      "id": "ep_42_ut_19"
    },
    {
      "end": 158662,
      "speaker": "Enrico Bertini",
      "start": 157830,
      "text": "Yeah. I don't know.",
      "id": "ep_42_ut_20"
    },
    {
      "end": 160174,
      "speaker": "Moritz Stefaner",
      "start": 158686,
      "text": "I'll have vacation soon, so.",
      "id": "ep_42_ut_21"
    },
    {
      "end": 160970,
      "speaker": "Enrico Bertini",
      "start": 160302,
      "text": "Really?",
      "id": "ep_42_ut_22"
    },
    {
      "end": 166366,
      "speaker": "Moritz Stefaner",
      "start": 161270,
      "text": "Yeah, I try and finish work by Wednesday, so that's like two, three more days.",
      "id": "ep_42_ut_23"
    },
    {
      "end": 168174,
      "speaker": "Enrico Bertini",
      "start": 166438,
      "text": "You are a lucky and wise man.",
      "id": "ep_42_ut_24"
    },
    {
      "end": 172822,
      "speaker": "Moritz Stefaner",
      "start": 168302,
      "text": "Yeah. And then have like, ten days off or so. But that's part of why I'm so busy.",
      "id": "ep_42_ut_25"
    },
    {
      "end": 176718,
      "speaker": "Enrico Bertini",
      "start": 172966,
      "text": "Okay, so we will actually meet in Paris for this.",
      "id": "ep_42_ut_26"
    },
    {
      "end": 179172,
      "speaker": "Moritz Stefaner",
      "start": 176774,
      "text": "That's right. In like ten days or something.",
      "id": "ep_42_ut_27"
    },
    {
      "end": 183472,
      "speaker": "Enrico Bertini",
      "start": 179366,
      "text": "Fantastic. So we should organize some data stories thing there.",
      "id": "ep_42_ut_28"
    },
    {
      "end": 185624,
      "speaker": "Moritz Stefaner",
      "start": 183616,
      "text": "Yeah, let's try and have a meetup or something.",
      "id": "ep_42_ut_29"
    },
    {
      "end": 195860,
      "speaker": "Enrico Bertini",
      "start": 185672,
      "text": "So if you guys are listening to this and are coming to this, let us know. Just drop a line somewhere on Twitter or email or whatever. Just let us know.",
      "id": "ep_42_ut_30"
    },
    {
      "end": 206494,
      "speaker": "Moritz Stefaner",
      "start": 197720,
      "text": "That's a good idea. And we can sort of, yeah, we'll find the data maybe Wednesday or Thursday and have, can have an evening in a bar or something. Yeah, right. Yeah.",
      "id": "ep_42_ut_31"
    },
    {
      "end": 214230,
      "speaker": "Enrico Bertini",
      "start": 206662,
      "text": "And we will be, and by the way, we will be reporting from this, right? At least we are planning to. So let's see how these things.",
      "id": "ep_42_ut_32"
    },
    {
      "end": 216990,
      "speaker": "Moritz Stefaner",
      "start": 214310,
      "text": "That's totally gonna work out. No, we should definitely do that.",
      "id": "ep_42_ut_33"
    },
    {
      "end": 217902,
      "speaker": "Enrico Bertini",
      "start": 217030,
      "text": "Yeah, yeah.",
      "id": "ep_42_ut_34"
    },
    {
      "end": 219790,
      "speaker": "Moritz Stefaner",
      "start": 218006,
      "text": "Some live life coverage.",
      "id": "ep_42_ut_35"
    },
    {
      "end": 237170,
      "speaker": "Enrico Bertini",
      "start": 219910,
      "text": "Yeah, yeah, yeah. Absolutely. Let's do that. So we have another special, special guest today and an old friend of us, actually. He's been on the show already in the past, and we are very glad to have Santiago Ortiz with us again. Hi, Santiaho.",
      "id": "ep_42_ut_36"
    },
    {
      "end": 239606,
      "speaker": "Santiago Ortiz",
      "start": 238070,
      "text": "Hi, Enrico. Hi, Moritz.",
      "id": "ep_42_ut_37"
    },
    {
      "end": 240610,
      "speaker": "Enrico Bertini",
      "start": 239678,
      "text": "How's it going?",
      "id": "ep_42_ut_38"
    },
    {
      "end": 242870,
      "speaker": "Santiago Ortiz",
      "start": 241510,
      "text": "Good, good. Fantastic.",
      "id": "ep_42_ut_39"
    },
    {
      "end": 257450,
      "speaker": "Enrico Bertini",
      "start": 242950,
      "text": "We are so glad to have you on the show again. That's going to be fun, I'm sure. So, Santiaho, you know, we ask our guests to introduce themselves, so can you spend a few words explaining who you are and what you do?",
      "id": "ep_42_ut_40"
    },
    {
      "end": 296520,
      "speaker": "Santiago Ortiz",
      "start": 258840,
      "text": "Okay. Santiago Ortiz here working on interactive information visualization for, I don't know, 15 years or something, recently publishing a lot of experiments and research, and more recently working on more client based sort of projects and introducing some data science into the, into the projects and to the offer to the clients. So mixing data science and interactive data visualization, that will be pretty much my current state of affairs.",
      "id": "ep_42_ut_41"
    },
    {
      "end": 306840,
      "speaker": "Enrico Bertini",
      "start": 297380,
      "text": "Fantastic. So and so I'm curious to hear, so you said that you're doing experiments. What do you mean exactly by experiments here?",
      "id": "ep_42_ut_42"
    },
    {
      "end": 376700,
      "speaker": "Santiago Ortiz",
      "start": 307340,
      "text": "Well, yes, in the last, let's say, three years after leaving Bestiario, I was working at Bestiario, a company I actually co found in Spain in 2005. So I left the company two years ago and started doing a lot of experimentation, a lot of research, trying to find new ways to visualize data, especially in the taking advantage of interaction, movement, etcetera. And also at the time, I changed from actually script to JavaScript. So it was also about learning the new language, building again my framework, etcetera. But a lot of experimentation before started working for clients. So I created like my own portfolio based on those research projects. And only one year after that, I started like, having work opportunities and started working for clients, which is pretty much what I am doing now.",
      "id": "ep_42_ut_43"
    },
    {
      "end": 378960,
      "speaker": "Enrico Bertini",
      "start": 376740,
      "text": "So you are basically a freelancer, right?",
      "id": "ep_42_ut_44"
    },
    {
      "end": 436648,
      "speaker": "Santiago Ortiz",
      "start": 380220,
      "text": "Well, the last month I been working with more and more people. So actually it's like I am building a team right now. That's why I changed a little bit. My website, instead of saying just Moebio and presented it as a portfolio, now it says Moebio Labs and it's more a team. I'm working with people in this team. The most stable people are Javier Moreno, which is a data scientist and Danyel Aguilar, which is an interactive developer and project manager that actually worked in Bestiario in the past as well. And we will for sure work with more and more people because it's crazy how many projects and clients are contacting many opportunities. Yes.",
      "id": "ep_42_ut_45"
    },
    {
      "end": 438300,
      "speaker": "Enrico Bertini",
      "start": 436824,
      "text": "That's so interesting.",
      "id": "ep_42_ut_46"
    },
    {
      "end": 441392,
      "speaker": "Santiago Ortiz",
      "start": 438920,
      "text": "Yeah, it's like a fantastic moment, I think.",
      "id": "ep_42_ut_47"
    },
    {
      "end": 443820,
      "speaker": "Enrico Bertini",
      "start": 441456,
      "text": "So where are you guys located right now?",
      "id": "ep_42_ut_48"
    },
    {
      "end": 464164,
      "speaker": "Santiago Ortiz",
      "start": 445100,
      "text": "Well, I continue living in Argentina, in a small town 2 hours far from Buenos Aires. Danyel lives in Barcelona. Javier is now based in Toronto. And let's see who else will join the team from which place of the world?",
      "id": "ep_42_ut_49"
    },
    {
      "end": 466480,
      "speaker": "Moritz Stefaner",
      "start": 464212,
      "text": "Yes, maybe somebody from Asia.",
      "id": "ep_42_ut_50"
    },
    {
      "end": 490376,
      "speaker": "Santiago Ortiz",
      "start": 467620,
      "text": "That will be awesome. You know why, why is not. There's no strong connection with people from Asian in data visualization. At least the people I know, the community I know, not a lot of people from Asia, from Japan for instance. It's strange and I will totally love to, I don't know, to work with people there and to have clients there, that will be awesome.",
      "id": "ep_42_ut_51"
    },
    {
      "end": 523560,
      "speaker": "Enrico Bertini",
      "start": 490568,
      "text": "So I really like the fact that you are defining lots of your work as experimentation. I think that's the reason why when people are shown your work, they are mostly blown away, because what you present is so different from what many of the other guys in data visualization are doing. So I'm just curious, how do you. I mean, so I know it's a very general question, but what is the goal for you? I mean, what is the data visualization goal that you have in mind? Assuming that it's one, right. How do you approach data visualization?",
      "id": "ep_42_ut_52"
    },
    {
      "end": 555550,
      "speaker": "Santiago Ortiz",
      "start": 524720,
      "text": "Well, in the case of what I call experimentation, I want to make the point that is not the same as data art. So because sometimes these two things could be confused. Obviously there is a lot of creative process and dependently of the context, you can present these results as art, but the aim and the goal is not doing art. And I'm going to try to explain the difference.",
      "id": "ep_42_ut_53"
    },
    {
      "end": 560270,
      "speaker": "Enrico Bertini",
      "start": 555720,
      "text": "So you won't define yourself as a. As a data artist?",
      "id": "ep_42_ut_54"
    },
    {
      "end": 564350,
      "speaker": "Santiago Ortiz",
      "start": 560970,
      "text": "Never. No, no, not at all.",
      "id": "ep_42_ut_55"
    },
    {
      "end": 567350,
      "speaker": "Moritz Stefaner",
      "start": 565130,
      "text": "Because I really see you as an artist.",
      "id": "ep_42_ut_56"
    },
    {
      "end": 695170,
      "speaker": "Santiago Ortiz",
      "start": 567690,
      "text": "Yeah, I understand you can say that, but it's not what I am seeking, because data art is about creating something that has aesthetical and creative value, right? But my experimentation is about cognition. It's about finding new ways to communicate information. So it's a pragmatic goal, but the methodology is very explorative. But again, the goal is completely pragmatic. And I always have in mind achieving results that could be useful for client projects. And when I say client projects, I think on organizations, companies, or people that have very clear needs, have questions, and have to make decisions, and need ways to take value out of the data they have in order to make better decisions and to answer those questions, or eventually to build a strategy around data, to start gathering data, whatever. It's very pragmatic. So not because it's research and experimental is less pragmatic, it's just that I want to offer very different solutions from what exists right now in the market. So my point of departure is what it exists right now in terms of visualization, at least the visualization and business intelligence and data analytics that companies are using. I think it's like 0.1 as a version of what will come. The future of visualization being actually used for totally pragmatic purposes will be totally different. I am sure of that. So I am trying to get there faster, and the only way to do that is by experimenting very, very fast. So doing research projects, like one per week or something like that.",
      "id": "ep_42_ut_57"
    },
    {
      "end": 704686,
      "speaker": "Enrico Bertini",
      "start": 695790,
      "text": "So your experimentation happens within the scope of the work you do for your clients, or out of that, I'm just.",
      "id": "ep_42_ut_58"
    },
    {
      "end": 756876,
      "speaker": "Santiago Ortiz",
      "start": 704718,
      "text": "Curious to hear out of the scope. But then it connects. So many of the solutions I create as a research project, many of them or not many, some of them are then eventually used in client projects. The ones that ended up being clearly useful. And by useful, I mean they have cognitive power. That means it communicates things, stories, structures, patterns, correlation, outliers, data missing, whatever. But they really succeeded somehow communicating something about the data and the information we have. So in those research projects, I came to different solutions, and I can actually name specific examples to make sure that would be great.",
      "id": "ep_42_ut_59"
    },
    {
      "end": 758980,
      "speaker": "Enrico Bertini",
      "start": 756988,
      "text": "Yes, please do this.",
      "id": "ep_42_ut_60"
    },
    {
      "end": 841780,
      "speaker": "Santiago Ortiz",
      "start": 759140,
      "text": "So, lost media. Lost media is about the lost series. It's based on the scripts. So the data is all the scripts of all the episodes of lost. So there 100 or more episodes. And then I create these different approaches to understand the relation between characters, how they change throughout time. This project, you could say it's a piece of art in a way. It's a research project. It's very experimental, it's very fun. So you can play with it. So it's very playful. Okay. But the thing is that what I was really exploring on beneath was ways to visualize human interactions throughout time. And right now I am actually applying some of those techniques to organizations, to actual conversations within companies. So this is one story about a project that starts as a research, but then many of the results are being used for client purposes, in this case, trying to help people understanding what's going on in the companies, how the conversation are changing, how the conversation are correlated with other metrics within a company, etcetera.",
      "id": "ep_42_ut_61"
    },
    {
      "end": 868010,
      "speaker": "Moritz Stefaner",
      "start": 842400,
      "text": "So Santiago, when you do that, transfer these explorations to a company context or a very applied context, do you also evaluate, maybe come back a year later or so and see how the tools have been used, or how the use shapes, like what happens with them? Or is it more like you plant it somewhere and then move on?",
      "id": "ep_42_ut_62"
    },
    {
      "end": 1026818,
      "speaker": "Santiago Ortiz",
      "start": 868170,
      "text": "No, it's part of what I want to build. With Moebio as a team, it's an extremely important part to keep a continual conversation with clients. We always offer a plan based on iterations. So we rarely propose to create a project, and that's it. We always say to the client, okay, let's start with the first iteration and then continue improving. So we follow something that is quite similar to the lean methodology, but apply to projects and based on very fast iterations. So each iteration is about one month and the first one being very explorative to better understand the data, to see what are the interesting structures. And we build very fast prototypes. We deliver to the client and we start immediately with, with evaluation. We ask, so the client uses it, share with certain stakeholders, gathers feedback. We talk a lot with the client, again in different sessions. We also test it from our side. And with that, the thing that happened with this first iteration result and then evaluation from both sides and conversation is that we have a great basis of understanding of what's in the data, what are the opportunities, etcetera, for the second iteration, generally speaking, we start addressing actual clients needs and questions. So very important in this methodology is that I and all the people involved, from my view in this project should learn a lot about the client, about the client's context, the client strategy, eventually about competition, etcetera. So we consume a lot of information about the client, we talk a lot with the client, and we start gaining some domain knowledge, and the conversation becomes more interesting and more related with the strategy. So for the second iteration, we start addressing some of those points. So the result of the second iteration should actually start giving answers to question, decline, hard and and the first iteration.",
      "id": "ep_42_ut_63"
    },
    {
      "end": 1033858,
      "speaker": "Moritz Stefaner",
      "start": 1026874,
      "text": "Is only based on like the data and what you think is important, no initial input coming from the client, also with conversation.",
      "id": "ep_42_ut_64"
    },
    {
      "end": 1136502,
      "speaker": "Santiago Ortiz",
      "start": 1033914,
      "text": "But at first, generally speaking, the client doesn't really know what's in the data, or maybe they know what are the features of the data, but not the interesting structures. So with the first iteration, we are actually helping them understand what's really, really possible with the data. It's not just that the first iteration, this process ends, it continues. So with certain client, we are already working in the third or fourth iteration, and every new iteration gets closer to decision making. And we always, always use clients feedback and stakeholder feedback, and we in some cases, and it depends on the evolution of the project, but in some cases, we can start actually measuring the return on investment, that is, start measuring how much the decision the client made using the entire project we created. So measuring the impact of this change in decisions so they can see really if the tool is being useful or not, and how much and which parts of the tool. So if we identify that a particular part of the project is really being helpful, is really being successful, because the decisions based on the use of that tool are leading to successful outcomes, then we strength that part of the project, probably creating more modules around it or improving the visualization itself. It depends, but it's a learning process and we cooperate a lot with the client.",
      "id": "ep_42_ut_65"
    },
    {
      "end": 1169372,
      "speaker": "Enrico Bertini",
      "start": 1136646,
      "text": "So, Santiago, I'm curious to hear, so you mostly create interactive visualizations. Right? At the beginning you said that you create interactive visualizations. And I'm curious, does this allow you, when you work with your client, to basically offload some of the data analysis to your clients or the data analysis itself? The discovery is something that you do with the tools that you develop. I'm just curious to hear that at.",
      "id": "ep_42_ut_66"
    },
    {
      "end": 1211558,
      "speaker": "Santiago Ortiz",
      "start": 1169396,
      "text": "This point, I will say that what, what we do with our team is much more than data visualization, and I will call that data strategy because we are working in many areas and addressing different problems, and visualization will be one of the tools. So it's really about keeping a quality conversation with client, understanding the needs. And the talk is more about this strategy and then visualization, data science, infrastructure for data, all these other things, or even strategies to gather new data, etcetera.",
      "id": "ep_42_ut_67"
    },
    {
      "end": 1230170,
      "speaker": "Enrico Bertini",
      "start": 1211694,
      "text": "Yeah, but if I interrupt you, but I'm curious to understand, so do you develop visualizations that then you give to your clients and they end up discovering something? Or it's more like you use the tool, you discover some interesting patterns, and then you go back to them and say, oh, this is what I found.",
      "id": "ep_42_ut_68"
    },
    {
      "end": 1265980,
      "speaker": "Santiago Ortiz",
      "start": 1230950,
      "text": "Okay. It's both because every time I find something and I communicate to the client, I sort of open a door for the client to discover new things. These new things the client will share with me, and that will open different doors to. For me to start new discoveries or new start new analysis. So it's the conversation that contains that knowledge. It's both sides, discovering things and communicating the discoveries. And in the conversation, the project evolves.",
      "id": "ep_42_ut_69"
    },
    {
      "end": 1320510,
      "speaker": "Enrico Bertini",
      "start": 1267360,
      "text": "Very interesting. And so, of course, so you mentioned the fact that one of the phases that you have is understanding the. The domain knowledge, the domain and the language. Probably. Right. So myself, when I collaborate with people, normally scientists or researchers, I have a very hard time at the beginning understanding their language, and it's a very steep learning curve. So how do you deal with that? I don't know. For instance, in the past I've been working with biochemists. It's very hard to understand their language, right. So, I mean, it took me probably between seven, eight months just to be able to talk to them. Right. So how do you deal with that? Do you have a strategy? Or now you just get used to it or bagel fish? I'm curious.",
      "id": "ep_42_ut_70"
    },
    {
      "end": 1321866,
      "speaker": "Santiago Ortiz",
      "start": 1321010,
      "text": "Okay.",
      "id": "ep_42_ut_71"
    },
    {
      "end": 1323590,
      "speaker": "Moritz Stefaner",
      "start": 1322018,
      "text": "In episode 42.",
      "id": "ep_42_ut_72"
    },
    {
      "end": 1340514,
      "speaker": "Santiago Ortiz",
      "start": 1325330,
      "text": "So first a comment like very. You say that it's a very step learning curve. Yeah, that, that's good. That means you learn fast. It's a problem. I want the metaphor of the learning.",
      "id": "ep_42_ut_73"
    },
    {
      "end": 1342162,
      "speaker": "Moritz Stefaner",
      "start": 1340602,
      "text": "Okay, that's another language.",
      "id": "ep_42_ut_74"
    },
    {
      "end": 1344466,
      "speaker": "Santiago Ortiz",
      "start": 1342226,
      "text": "Learning language. But I got it.",
      "id": "ep_42_ut_75"
    },
    {
      "end": 1348030,
      "speaker": "Moritz Stefaner",
      "start": 1344538,
      "text": "It's a steep, a steep mountain to climb. I think that's what you.",
      "id": "ep_42_ut_76"
    },
    {
      "end": 1576862,
      "speaker": "Santiago Ortiz",
      "start": 1351170,
      "text": "Okay, what I do, first of all, for me, I don't see that exactly as a problem, because at least in my case, and that that could be very personal, this is exactly what I want to do. So I am not really interested in data visualization. I am interested in the context and culture and information about data. And visualization for me is like the window. So whenever I have a challenge, to start working with a client that has its own culture, language and corpus of knowledge for me is like an awesome challenge. I have to learn a lot, as you say, it's hard and it requires a lot of your energy. Well, that's part of what I like of this work, actually, to being able to enter new words, new mental words and new necessities, etcetera. So what I do, I read a lot. It's what I have to do, and I have to read a lot about many different subjects. Something I always tell to people that is starting learning data visualization is that for each book about data visualization, they read. They should read nine books about other things, because they should be prepared, they should be prepared to the domain of the data they will work with. And it's impossible to know in advance. So what can you do? You have to read about biology, you have to read about energy, you have to read about development, you have to read, etcetera. So the more you read, the more you expand your general culture, especially things that are connected, that are close to information and data, the better you can react, the faster you can react. Whenever a new universe arrives to you with new knowledge, and especially, as you mentioned, language in similar cases. I've been kind of lucky, I think, because I connected with people inside those particular universes that were very good, communicated with the external world. So it was super helpful for me, and I learned a lot. So, one example of this is Alfonso Valencia, from an amazing research team at Madrid in biotechnology. And Alfonso was like an incredibly good bridge between the super complex universe of data they managed on a daily basis, and what I wanted to build at the time. So I've been lucky. But also, it is true, I have some sort of knowledge already, some very basic, very shallow knowledge on biology, biotechnology, that allows me to at least start learning a little bit more and have some sort of intelligent conversation with these people. So I don't think a data visualization person should have a very profound knowledge on the data she or he's working, but some basis, right, in order to at least understand the elements of the data and how they could be struggled. And finally, an interesting point. Something that I've discovered is ignorance sometimes is super good, because you see, you see, you have fresh, fresh eyes. Imagine you don't know anything about genetics, and someone throws to you the information about the gene.",
      "id": "ep_42_ut_77"
    },
    {
      "end": 1577150,
      "speaker": "Enrico Bertini",
      "start": 1576926,
      "text": "Sure.",
      "id": "ep_42_ut_78"
    },
    {
      "end": 1655970,
      "speaker": "Santiago Ortiz",
      "start": 1577190,
      "text": "Okay. What you see is just four letters in a sequence. You don't know more than that. Maybe you will have a fresh approach to that problem. Maybe you will see different structures, maybe not. It's very difficult, but in some cases, ignorance really works. For instance, now I am working with marketing teams, and they already have built on certain structures about how to address certain problems. And I am bringing kind of fresh ideas to the. To the field. So, one very specific problem is how to segment ages in populations. And from my more data science approach, and without domain knowledge, I just wanted to apply or find interesting algorithms to segment population in a really good way. And that's something new for them. They never do that. They use like an already conventional, established methodology to find segments that comes from an era in which they didn't have enough data to actually build a good segments algorithm for them. So you can sometimes provide fresh ideas when you are ignorant.",
      "id": "ep_42_ut_79"
    },
    {
      "end": 1662094,
      "speaker": "Moritz Stefaner",
      "start": 1656710,
      "text": "Yeah, I mean if you hop across the domains, of course you can always take some techniques from one field.",
      "id": "ep_42_ut_80"
    },
    {
      "end": 1664526,
      "speaker": "Santiago Ortiz",
      "start": 1662262,
      "text": "Exactly. You are like, I agree, that can.",
      "id": "ep_42_ut_81"
    },
    {
      "end": 1673346,
      "speaker": "Moritz Stefaner",
      "start": 1664558,
      "text": "Be the greatest fun to learn. And yeah, often very simple things, if you apply them in a new context, it's suddenly sufficient.",
      "id": "ep_42_ut_82"
    },
    {
      "end": 1712260,
      "speaker": "Santiago Ortiz",
      "start": 1673378,
      "text": "It's super novel. Exactly. That's the other thing. When you start seeing common patterns. Let's continue with the two examples. Imagine you start seeing common necessities or patterns in the data or patterns in the methodology between teams in biochemistry or biotechnology, a marketing team. It's an opportunity to transfer knowledge or strategies or visualization methods, etcetera. So it's amazing indeed. And you will be operating like a sort of be pollinizing both teams.",
      "id": "ep_42_ut_83"
    },
    {
      "end": 1738420,
      "speaker": "Enrico Bertini",
      "start": 1712920,
      "text": "So this is a good time to stop for a moment and talk about our sponsor, Tableau software. Data stories is supported by Tableau software, helping people see and understand their data. Tableau lets people connect to any kind of data and visualize it on the fly. Databases, spreadsheets and even big data sources are easily combined into interactive visualizations, reports and dashboards. What is your data trying to tell you? So Moritz, how is your experience with Tableau?",
      "id": "ep_42_ut_84"
    },
    {
      "end": 1785350,
      "speaker": "Moritz Stefaner",
      "start": 1738920,
      "text": "Good. I mean, I can really say I work a lot with the software just this weekend actually, so I received a really big data dump, like around 40gb of CSV files from a big car manufacturer. And the task was really to find out what interesting things can be done with that data. And especially if you have CSV files, the first thing I always do is put it into Tableau and just quickly look, what are the big sums? What are the averages? Where are the gaps in the data? I had geospatial data, so I had coordinates, so I could quickly make maps. And although these were huge files and very technical, I was, I was seeing something within minutes, really. And I think that's amazing.",
      "id": "ep_42_ut_85"
    },
    {
      "end": 1803962,
      "speaker": "Enrico Bertini",
      "start": 1785770,
      "text": "Yeah, that's the same reason why I like it so much. I think this is pretty much one of the most advanced software that we have out there. When you want to start looking in a new data set, especially when it's new and you don't know exactly what is there, you can just load it and start, quote unquote, start playing with it, right?",
      "id": "ep_42_ut_86"
    },
    {
      "end": 1819540,
      "speaker": "Moritz Stefaner",
      "start": 1804066,
      "text": "And so you just open a new tab, a new worksheet for every new perspective you want to have. Then often I will share specific results, make little annotations. You can add annotations to data points, say, oh, this is looking funny to me. Or look at that peak. How can we explain it?",
      "id": "ep_42_ut_87"
    },
    {
      "end": 1821480,
      "speaker": "Enrico Bertini",
      "start": 1820200,
      "text": "Lots of liars, right?",
      "id": "ep_42_ut_88"
    },
    {
      "end": 1853770,
      "speaker": "Moritz Stefaner",
      "start": 1821520,
      "text": "To the clients or to my collaborators. Sometimes I will build little dashboards so you can set some filters and see how the map changes. If you drill down to a part of the data, things like this, and all of this is, is super helpful to get to results real quick. Instead of first spending days of transforming your data, somehow coding custom scripts, I'm now much more for quickly looking at it in Tableau and then deciding what to do, because then we'll see.",
      "id": "ep_42_ut_89"
    },
    {
      "end": 1874050,
      "speaker": "Enrico Bertini",
      "start": 1854310,
      "text": "Sure. The good thing is that if you want to try Tableau for free, there is a free trial. For your free trial, visit Tableau software@Tableau Software.com. Datastories. Tableau software.com Datastories. Don't forget the data stories part. Thanks a lot.",
      "id": "ep_42_ut_90"
    },
    {
      "end": 1903404,
      "speaker": "Moritz Stefaner",
      "start": 1874210,
      "text": "Okay, let's continue with that. So you have a lot of different people approaching you. I guess, in your experience, what are the biggest, let's say, misconceptions people have because they often see, like, oh, you do interesting things with data, and we have data too. And, you know, then sometimes people expect the wrong things from data visualization or data science. Did you have an experience or do you have any recurring experiences where people expect the wrong stuff, or doesn't that happen at all?",
      "id": "ep_42_ut_91"
    },
    {
      "end": 1924920,
      "speaker": "Santiago Ortiz",
      "start": 1903452,
      "text": "I do not have that kind of experience. The only thing, the only pattern, I think is a little bit negative, is that sometimes people want to, they have data and they see a particular visualization. They believe or think you can apply that visualization to the data, and that is just that.",
      "id": "ep_42_ut_92"
    },
    {
      "end": 1926292,
      "speaker": "Moritz Stefaner",
      "start": 1925300,
      "text": "Because it's a network.",
      "id": "ep_42_ut_93"
    },
    {
      "end": 1927708,
      "speaker": "Santiago Ortiz",
      "start": 1926356,
      "text": "Yeah, because, exactly.",
      "id": "ep_42_ut_94"
    },
    {
      "end": 1928124,
      "speaker": "Enrico Bertini",
      "start": 1927804,
      "text": "Yeah.",
      "id": "ep_42_ut_95"
    },
    {
      "end": 1976250,
      "speaker": "Santiago Ortiz",
      "start": 1928172,
      "text": "But it's nothing so problematic because you can explain very easily, very fast that it probably won't work and that for that purpose, the first, so in the first iteration, the first approach we have with clients, our first proposal, we do not commit with any sort of outcome. What we do is we mention three possible ideas of how it will look. But we are very clear saying, but maybe what we will end up doing is completely different. We don't know. So that's the first message I send to clients. And normally clients are good with that. They are not anxious about the fact they are starting a project and we put a, with an important budget without knowing.",
      "id": "ep_42_ut_96"
    },
    {
      "end": 1996794,
      "speaker": "Moritz Stefaner",
      "start": 1976330,
      "text": "But don't you have, I mean, I have the situation often that the theme of the project is already defined by the title, like it's a dashboard, or, you know, it's, oh, man. Yeah, or it's a globe, you know, or, you know, that sort of, somebody comes up with this idea in some sort of meeting, and then there's this bullet point and sort of the. The outcome is already defined before you even start to.",
      "id": "ep_42_ut_97"
    },
    {
      "end": 1998002,
      "speaker": "Santiago Ortiz",
      "start": 1996842,
      "text": "No, I don't. I don't allow.",
      "id": "ep_42_ut_98"
    },
    {
      "end": 1998946,
      "speaker": "Moritz Stefaner",
      "start": 1998066,
      "text": "You don't have that.",
      "id": "ep_42_ut_99"
    },
    {
      "end": 2018510,
      "speaker": "Santiago Ortiz",
      "start": 1999058,
      "text": "Maybe I am. I am very tensive in the. In the message. And from the very, very beginning, I stress the fact that that's not the way things will happen. I don't know, open outcomes, but I haven't been involved in this kind of experience. It's like, I'm very clear.",
      "id": "ep_42_ut_100"
    },
    {
      "end": 2024216,
      "speaker": "Moritz Stefaner",
      "start": 2019850,
      "text": "Whenever it happened to me, the projects were always horrible. So it's good that you don't allow.",
      "id": "ep_42_ut_101"
    },
    {
      "end": 2038964,
      "speaker": "Santiago Ortiz",
      "start": 2024378,
      "text": "And it's never a good idea to accept that kind of situation. The data should tell you the way it will be represented, that you have to allow the data to speak by itself, and maybe you will.",
      "id": "ep_42_ut_102"
    },
    {
      "end": 2049960,
      "speaker": "Moritz Stefaner",
      "start": 2039012,
      "text": "And also, I assume you don't start without data, right? Or would you start the first iteration also just based on conceptual exploration? Would that be an option too? Or do you say no data, no project?",
      "id": "ep_42_ut_103"
    },
    {
      "end": 2062240,
      "speaker": "Santiago Ortiz",
      "start": 2050300,
      "text": "Maybe there are things that can be done, but it's very dangerous to try to start a project without data, because then the data will arrive and data will have a very different story to tell.",
      "id": "ep_42_ut_104"
    },
    {
      "end": 2099174,
      "speaker": "Enrico Bertini",
      "start": 2063700,
      "text": "That's, for me, a big no. So one thing that I keep saying is that I think one problem we have with data visualization is the name itself, because visualization communicates the idea that the work is only about the visual representation. Right? But it's much, much more than that. So I think the two areas where especially this is not captured is the fact that in order to do good visualization, you have to do a lot of data analysis or data pre processing. Right? As you said, you first need to understand the data.",
      "id": "ep_42_ut_105"
    },
    {
      "end": 2101150,
      "speaker": "Moritz Stefaner",
      "start": 2099302,
      "text": "So maybe we should call data just.",
      "id": "ep_42_ut_106"
    },
    {
      "end": 2125650,
      "speaker": "Enrico Bertini",
      "start": 2101190,
      "text": "Yeah, whatever. Another area is interaction, right? So in some cases, interaction is huge, but it's not captured by the word visualization. Visualization is basically the visual representation. And that's the reason why I think there are many people out there who pretend that the work is just mapping their data to whatever kind of representation they already have in mind.",
      "id": "ep_42_ut_107"
    },
    {
      "end": 2221630,
      "speaker": "Santiago Ortiz",
      "start": 2126870,
      "text": "Yes. And I think that's how things start. I can imagine a person starting working with data and with not a lot of experience. The first impulse will be, I will have to find a method that matches my data and then make the link. Because if not, you are like alone by yourself with the data, what to do? So that's another point. Only people that know how to code, I think, and are very fast coding could actually do good information exploration, especially trying to connect to visual approaches, to visual outcomes. So it's difficult. It's difficult. So I kind of understand that at the beginning you have to use some already existing platform that contains some visualization and you start connecting, and then from that process, and maybe for certain challenges and certain kind of data that could work. Okay. It's like the matches are already there, like if you have, because you know, the data structure, so you can, you know very well what's the structure of the data and the meaning of the data. So you match it with something that has exactly the same structure and meaning, and it kind of works. But in more complex projects, in which a client has a huge data set that contains features that are numerical dates.",
      "id": "ep_42_ut_108"
    },
    {
      "end": 2224550,
      "speaker": "Enrico Bertini",
      "start": 2221790,
      "text": "Geography, these are interesting projects, right?",
      "id": "ep_42_ut_109"
    },
    {
      "end": 2226046,
      "speaker": "Santiago Ortiz",
      "start": 2224670,
      "text": "Yeah, you can.",
      "id": "ep_42_ut_110"
    },
    {
      "end": 2227770,
      "speaker": "Enrico Bertini",
      "start": 2226078,
      "text": "That's the kind of work I want to do.",
      "id": "ep_42_ut_111"
    },
    {
      "end": 2352200,
      "speaker": "Santiago Ortiz",
      "start": 2228750,
      "text": "Yeah, exactly. It's much more interesting, and it requires a lot of exploration indeed, because if not, what you will do is to slice the table. So isolate two list of numbers here, two list of numbers there, a list of categories, so you can create a word cloud, et cetera. And then you build a dashboard that contains a scatter plot, a bar graph, etcetera. Because you slice the data, so you find ways to visualize pieces. And your approach could be valid, but completely insufficient. You will miss a lot of interesting things going on between different features. So how to explore all the correlations? So one approach is actually, if only thinking on numbers is combining all couples of lists of numbers and drawing all possible scatter plots, right? So you create a matrix of scatter. That's a very well known approach. But then you have a problem, that is, correlations sometimes happen between more than two features. In many cases, you can have three features, that one to one, they do not correlate a lot, but the three are correlated. So it's similar to the three bodies problems in physics, like if you have two, it works good, you have a formula, you have an equation that describes the relation between two bodies, where you have three bodies. Something magic happened there, and you can't use simple analytics to solve the problem. The same happens with data. So, slicing a table in different pieces, which is actually what happens normally in business intelligence, it gives you a very poor view of the data. So a real data science data visualization project should explore in a more deeper and diverse ways what it's contained in the date.",
      "id": "ep_42_ut_112"
    },
    {
      "end": 2374360,
      "speaker": "Enrico Bertini",
      "start": 2353420,
      "text": "So when you said, I'm really curious to dig deeper into. So a few minutes ago, you said, I'm not interested in visualization so I really like this sentence because you've been quite successful in this area. So what do you exactly mean when you say I'm not interested in visualization? I think I know what you mean, but I'm curious to hear it from you.",
      "id": "ep_42_ut_113"
    },
    {
      "end": 2496850,
      "speaker": "Santiago Ortiz",
      "start": 2374850,
      "text": "Well, it's sort of a way to speak. I am interested in visualization, but visualization is not my object of study. Visualization is what I use. The object of the study for me is data that comes from many different realities. And that's why I spent a lot of time studying those realities and not starting visualization. I do not read books about visualization and maybe I am missing a lot of interesting things, but I have to choose, I have to decide how to distribute my time and I am more interested on the things that I am trying to visualize, that on the visualization itself. And so far I think this strategy paid. It was good to spend that time studying more the object that the. The tool, I think, and also because I am not quite happy with what you can find in books about visualization, in blogs about visualization, is that I do not find answers there. So maybe I can, I navigate blocks as anyone in the field. Also I stimulate my eyes with different ways to draw connection between data, etcetera. But, but for me is the data that, that points the, the path of visualization, never some already existed methodology. And that way I am always open to new visualization approaches. Right? So visualization, it is interesting, but it is interesting because it's a communication tool, an analytical tool that works with awesome realities. And that's what is really, really interesting.",
      "id": "ep_42_ut_114"
    },
    {
      "end": 2511930,
      "speaker": "Moritz Stefaner",
      "start": 2498590,
      "text": "But don't you think there are some recurring problems in data visualization and some recurring things that work and things that don't work regardless of domain?",
      "id": "ep_42_ut_115"
    },
    {
      "end": 2560290,
      "speaker": "Santiago Ortiz",
      "start": 2512550,
      "text": "Yes, and that's, that's part of the beauty when you find connection between domains. It's something like mathematicians always enjoyed about different theories. They find isomorphisms and that's beautiful, that's amazing. But again, it's beautiful in the context of those domains. If you only point like not on structural match, it is interesting. But if you enrich this match in the two contexts you are connecting, is much more interesting. I totally agree that visualization contains sort of universal methodologies approach, but I don't see the good ones being explained in blocks and books also because.",
      "id": "ep_42_ut_116"
    },
    {
      "end": 2567194,
      "speaker": "Enrico Bertini",
      "start": 2560330,
      "text": "Can you give us an example, can you give us an example, an example.",
      "id": "ep_42_ut_117"
    },
    {
      "end": 2568178,
      "speaker": "Santiago Ortiz",
      "start": 2567282,
      "text": "Of something like that?",
      "id": "ep_42_ut_118"
    },
    {
      "end": 2574110,
      "speaker": "Enrico Bertini",
      "start": 2568194,
      "text": "What are the things that you would like to see appearing in blogs and you don't see there? I'm just curious to hear that.",
      "id": "ep_42_ut_119"
    },
    {
      "end": 2684760,
      "speaker": "Santiago Ortiz",
      "start": 2575730,
      "text": "Okay. I think that the main missing thing is that we don't have the stories of the people that use visualization. So whereas in data science, that's a great point. Any book, any book in data science contains stories about the success of a particular method because it provides solution and answer to particular question in particular industries, etcetera. In visualization, you don't see that, you don't have this voice. There is, there is only one book, as far as I know, that tried to address this situation by visiting people in companies that are, companies that are using visualization to ask them how they are using, what is the return of using it, etcetera. The book is called the visual organization is written by Phil Simon. It's the only book that I know, asks the real users. And without that feedback, it's impossible to, to improve our field because it's like, oh, sorry, it's us testing our own tools and by, by our own criteria, right? So we test it with the tools we have to test it. That is perceptual tools. In the best of the cases, in the most scientific method cases is we test visualization methods against perception and we ask questions about memory, about perception, et cetera. But this is not really how visualization should be tested. It should be tested in the real arena. Right? So that's, for me, what is missing the most in books and books?",
      "id": "ep_42_ut_120"
    },
    {
      "end": 2727540,
      "speaker": "Enrico Bertini",
      "start": 2684880,
      "text": "Yeah, let me tell you. So there are a couple of things I would like to mention here. First, I think that, so I think the reason why we have this situation is because I think most of the existing visualizations out there have a different purpose. So especially with the advent of data journalism and the use of visualization to basically create a portrait of some data and committing some pre digested information, most of the existing visualization work has been skewed towards presentation, right. Not necessarily understanding anything. And the second comment I have is that.",
      "id": "ep_42_ut_121"
    },
    {
      "end": 2729080,
      "speaker": "Moritz Stefaner",
      "start": 2727960,
      "text": "But not in the scientific.",
      "id": "ep_42_ut_122"
    },
    {
      "end": 2745860,
      "speaker": "Enrico Bertini",
      "start": 2729120,
      "text": "Yeah, that's what I'm saying. That's my second comment. So my second comment is that, honestly, I think this is an area where academic work has been much, is actually much more advanced than practitioners work, as far as I can tell, because.",
      "id": "ep_42_ut_123"
    },
    {
      "end": 2749160,
      "speaker": "Santiago Ortiz",
      "start": 2746600,
      "text": "Which is a total paradox. I totally agree with that.",
      "id": "ep_42_ut_124"
    },
    {
      "end": 2758552,
      "speaker": "Enrico Bertini",
      "start": 2749200,
      "text": "Yeah, yeah, it's a paradox. I mean, I think that academic research should actually, should actually come first.",
      "id": "ep_42_ut_125"
    },
    {
      "end": 2760408,
      "speaker": "Santiago Ortiz",
      "start": 2758616,
      "text": "Right, sorry, interruption.",
      "id": "ep_42_ut_126"
    },
    {
      "end": 2764864,
      "speaker": "Enrico Bertini",
      "start": 2760544,
      "text": "Oh, that's fine. We love babies and kids interruptions.",
      "id": "ep_42_ut_127"
    },
    {
      "end": 2767140,
      "speaker": "Santiago Ortiz",
      "start": 2764912,
      "text": "Sorry, give me complaints.",
      "id": "ep_42_ut_128"
    },
    {
      "end": 2879260,
      "speaker": "Enrico Bertini",
      "start": 2767520,
      "text": "Let me mention that because I think it's useful for our listeners. I think that. So I don't know how many how many people are aware of that? But in the context of the visualization conference, which has been, it's actually almost 20 years old now. There is one. So if you look into the guidelines on how to publish a paper there, you can see that there are different kind of papers. So there is, for instance, something that is called techniques evaluation. Sorry, I'm digressing, but I think it's useful. And there is one specific kind of paper that is called design study and design study. So if you look at the description of a design study, it doesn't really matter if you create a new visualization technique or whatever new. What is really interesting there is whether you learn something by deploying this system into a real world context. And I can point you to quite a good number of papers there where researchers have done exactly what you are discussing here. So, talking with a group of people, trying to understand what's going on, developing a visualization, iterating over and over again, trying to get something that works, and then what is really interesting, the very good ones, tell a story about what they learned through this process. So if you go. So, for instance, Tamara Munzner, professor from British Columbia, University of British Columbia, she has a webpage that I think is called something like design studies or something like that, where she collects example of very good design studies. I don't know, Santiago, if you are aware of that, but if you are not aware of that, I think you should go there and give a look to this list, because I think you should actually end up being very happy with what you find there. There are lots of papers that exactly address exactly the need that you are expressing here.",
      "id": "ep_42_ut_129"
    },
    {
      "end": 2880880,
      "speaker": "Santiago Ortiz",
      "start": 2879640,
      "text": "But I have some comments.",
      "id": "ep_42_ut_130"
    },
    {
      "end": 2883112,
      "speaker": "Enrico Bertini",
      "start": 2881000,
      "text": "Yeah, sure, go ahead on that.",
      "id": "ep_42_ut_131"
    },
    {
      "end": 2957050,
      "speaker": "Santiago Ortiz",
      "start": 2883216,
      "text": "First is not exactly the same, but it is super interesting. And I already knew that in academics, there is a culture of, in visualization academy, there is a culture of assessing, evaluating, etcetera. It's not exactly the same, because one thing is to ask questions to the people and to see what they understood, what they learned, etcetera. But the other, and that will happen in the industry side, will be to actually measure, impact. Something that in, in companies, they do all the time. They have KPI's, they have metrics, they are measuring return all the time. So it's a little bit different. And the second thing is, this is a paradox, because we will expect from industry, or practitioners in industry, to be more pragmatic in that sense, more than academics normally. In other cases, it's like that. Take, for instance, data science. Data science in the context of industry the way you approach learning data science, or the result, the papers, et cetera, or what you find in any blog is about successful cases all the time, or cases that fail, but it's always related with return.",
      "id": "ep_42_ut_132"
    },
    {
      "end": 2976472,
      "speaker": "Enrico Bertini",
      "start": 2957350,
      "text": "Okay, but I'm totally with you. I'm totally with you. But just to make it clear, I think that the kind of papers that I mentioned is not evaluation papers, where there are some sort of controlled experiments, where some. It's very different from that. So there is another whole category for that. It's called evaluation.",
      "id": "ep_42_ut_133"
    },
    {
      "end": 2978380,
      "speaker": "Santiago Ortiz",
      "start": 2976576,
      "text": "Okay, I'm gonna, I'm gonna.",
      "id": "ep_42_ut_134"
    },
    {
      "end": 2986128,
      "speaker": "Enrico Bertini",
      "start": 2978840,
      "text": "So, design studies is something completely different, is more measured. I think it's very much measured towards impact, as you said, like a home.",
      "id": "ep_42_ut_135"
    },
    {
      "end": 2996800,
      "speaker": "Moritz Stefaner",
      "start": 2986184,
      "text": "Like how a concrete system is built, and how it was, like, shaped by the user's input and things like. Yeah. Documenting the whole iterative approach that you sketched.",
      "id": "ep_42_ut_136"
    },
    {
      "end": 3017640,
      "speaker": "Enrico Bertini",
      "start": 2996920,
      "text": "Yes. I think if you are familiar with the work of Marae Meyer, she's another researcher who does that, and she's been publishing also interesting papers about what's the process to achieve good outcomes in this kind of context. So I would be happy to send you some links and to hear from you what you think about it. Yeah.",
      "id": "ep_42_ut_137"
    },
    {
      "end": 3020560,
      "speaker": "Moritz Stefaner",
      "start": 3018180,
      "text": "And we have two new good ideas.",
      "id": "ep_42_ut_138"
    },
    {
      "end": 3023948,
      "speaker": "Enrico Bertini",
      "start": 3022220,
      "text": "They are already awesome.",
      "id": "ep_42_ut_139"
    },
    {
      "end": 3028812,
      "speaker": "Santiago Ortiz",
      "start": 3024044,
      "text": "Yeah, that will be awesome. And I guess you will publish the links in the list of links.",
      "id": "ep_42_ut_140"
    },
    {
      "end": 3064074,
      "speaker": "Enrico Bertini",
      "start": 3028876,
      "text": "Sure, absolutely. But that said, I am totally with you. I think it's very, very important to publish case studies out there. And I think some time ago, I really liked. I think, Moritz, you published something about how many iterations you went through to create the final visualization of one of your projects. And I really, really liked that, because people need to see what's in between. Right. I mean, it's not just the final outcome, but that's actually design, sketching, case.",
      "id": "ep_42_ut_141"
    },
    {
      "end": 3091780,
      "speaker": "Moritz Stefaner",
      "start": 3064122,
      "text": "Studies, and how it all happens in my head. But I think what Santiago is aiming for, and it is sort of the elephant in the room, like, how can we actually prove that we are doing useful stuff? We change something. That's something I'm struggling with and actually, like, actually understanding myself, how much impact my work has. And I mean, let alone proving some impact.",
      "id": "ep_42_ut_142"
    },
    {
      "end": 3102572,
      "speaker": "Enrico Bertini",
      "start": 3091900,
      "text": "I'm wondering if this is due to the fact that maybe it's what Santiago said. Maybe the point is that it's not visualization that is important there. Visualization is a part of. Part of a process. Right.",
      "id": "ep_42_ut_143"
    },
    {
      "end": 3104600,
      "speaker": "Moritz Stefaner",
      "start": 3102676,
      "text": "It's hard to isolate. Exactly.",
      "id": "ep_42_ut_144"
    },
    {
      "end": 3138640,
      "speaker": "Enrico Bertini",
      "start": 3105450,
      "text": "So, Santiago, so I know that you are a big proponent of data science in general, and I'm curious to hear first if you consider visualization as one of the steps, one of the bricks that we available in data science or what I think you. So I just want to mention a sentence that you wrote to us, that is all visualization developers, creators should learn data science. So I think I kind of agree with you, but I would like to understand exactly what you mean.",
      "id": "ep_42_ut_145"
    },
    {
      "end": 3140404,
      "speaker": "Santiago Ortiz",
      "start": 3139500,
      "text": "Okay, yes.",
      "id": "ep_42_ut_146"
    },
    {
      "end": 3151668,
      "speaker": "Enrico Bertini",
      "start": 3140492,
      "text": "Oh, sorry. And I also want to mention that you said there's a culture in data science totally missing in database projects are made to help the client and they are constantly tested, which is exactly what you were mentioning before.",
      "id": "ep_42_ut_147"
    },
    {
      "end": 3212850,
      "speaker": "Santiago Ortiz",
      "start": 3151724,
      "text": "Yeah, yeah, good. This is one thing, the culture of data science, many of the things happening in the, in the data science methodology, or the attitude towards a problem or towards data, all the culture in the side of data visualization, I think we have a lot to learn about it. So only that is already interesting. But then there are specific things that happen in data science that could be also imported and to some extent should be important. It's that with data science, you have a certain very privileged view of the data that you can't have only by visualizing. So I believe data science should be incorporated into data visualization only because you can start understanding this more complex relation between the features in the data.",
      "id": "ep_42_ut_148"
    },
    {
      "end": 3224742,
      "speaker": "Enrico Bertini",
      "start": 3213510,
      "text": "Sorry for interrupting. When you say data science, do you mean machine learning, data mining, or something more than that? I just want to make sure I understand exactly how you are using the term.",
      "id": "ep_42_ut_149"
    },
    {
      "end": 3229782,
      "speaker": "Santiago Ortiz",
      "start": 3224926,
      "text": "We can, in this conversation, we can use it as a synonym of machine learning.",
      "id": "ep_42_ut_150"
    },
    {
      "end": 3230678,
      "speaker": "Enrico Bertini",
      "start": 3229846,
      "text": "Okay, good.",
      "id": "ep_42_ut_151"
    },
    {
      "end": 3295532,
      "speaker": "Santiago Ortiz",
      "start": 3230814,
      "text": "Because what you do is basically to try to predict things. Right. But something I've been working a lot is something that I, in the, in the mix, in the combination of visualization and machine learning, I discovered. Well, I am not the only one to have discovered that, but in the process I, it was clear for me that whereas visualization has been used a lot, it's a tool, as an intermediate tool for data science, the opposite could be true as well. So it's not just that visualization helps pointing interesting possible models, it's also that when you build a model, a predictive model, you can use it to generate insight. So it's not only that you can predict things, and that's it. If you visualize the model and you visualize the model working, you can use that as a tool for understanding.",
      "id": "ep_42_ut_152"
    },
    {
      "end": 3301640,
      "speaker": "Enrico Bertini",
      "start": 3295636,
      "text": "Can you give us a concrete example of that? I hear that some of the listeners might actually not understand that.",
      "id": "ep_42_ut_153"
    },
    {
      "end": 3330924,
      "speaker": "Santiago Ortiz",
      "start": 3302060,
      "text": "Yes. Let's see, I'm going to address a particular interesting model that I visualize, and that is given a lot of inside. This is okay. The model is a decision tree. I think it's a good example because the decision tree are models that can be understood by humans.",
      "id": "ep_42_ut_154"
    },
    {
      "end": 3339160,
      "speaker": "Enrico Bertini",
      "start": 3331012,
      "text": "Can you explain what it is? Sorry for interrupting again. I just want to make sure that people understand. Can you explain briefly what is a decision tree?",
      "id": "ep_42_ut_155"
    },
    {
      "end": 3583760,
      "speaker": "Santiago Ortiz",
      "start": 3339860,
      "text": "There are different ways to approach what a decision tree, but one good way is like this. You have a lot of features and you have data, and let's say you want to understand one of the features, and in particular you want to understand how the other features explain or has prediction capability to a particular feature. Let's say you have a list of people and you have a lot of data of each person. And let's say that you want to see how the gender of the people is in connection with the other features. Other way to express this is how much the other features can predict gender. That would be a way. So it's about prediction and it's about a classification, because about gender is male or female. And the first question that comes to your mind is which will be the most important feature in all these features I have in order to predict gender, which is the most correlated with gender. Right, we can find that. But then once you found this first correlate feature that is the most relevant to predict gender, you can start combining with other features. So for instance, you found that the country origin is the most important feature to predict gender. But then inside country you see that age is the second most important, etcetera. So you start building a tree that will actually allow you to eventually predict if this particular person that has this value in these features is a male or female. So the first question is which country this person belongs to or which is the origin country. And then you continue with the other features in the right order. That's the important thing. So going to having more information to having less information and arriving to a point in which the probability of this person being, let's say, female, is extremely high or extremely low. So you arrive to a sort of a good point to make a decision. It's something like that. And it looks like a tree because the structure is a tree. And in data science they used to visualize the tree, but in a very simple way, what I am doing is a tree. You can actually explore and dig and find interesting subpopulations of data that combine certain features and that have certain probability of being of a certain category you are exploring. The other interesting thing is that by interactive means, I allow the user to select which features she or he wants to explore. So it's very powerful because you attack one features against the other ones. So the interaction gives you these possibilities. So, and this is not about prediction. The client is not using this to predict, but it is, they are using this to better understand where are the more interesting subpopulation towards a certain feature they want to understand. This client, for instance, is very concerned about churn. That is the opposite of loyalty. So ways they are losing clients. So which are the features that better predict clients churn? This is one question. The three explores all the combination of features to give them the best way to find the most extreme cases. So the most loyal people and the opposite, the most charmed people. And they know exactly what combination of features these extremes are based on.",
      "id": "ep_42_ut_156"
    },
    {
      "end": 3590086,
      "speaker": "Moritz Stefaner",
      "start": 3584990,
      "text": "I think that's a great example because the decision trees really, they provide you already with a thinking model.",
      "id": "ep_42_ut_157"
    },
    {
      "end": 3592326,
      "speaker": "Santiago Ortiz",
      "start": 3590158,
      "text": "Exactly, exactly. It's very many and it can be.",
      "id": "ep_42_ut_158"
    },
    {
      "end": 3627146,
      "speaker": "Moritz Stefaner",
      "start": 3592358,
      "text": "Quite surprising, you know, what comes out of that. I mean, the problem I think is that most of the machine learning models are not as illustrative, like, you know, if you use, I don't know, support vector machines or neural networks or so, you know, you have a good idea of the general mechanism, but how it works in detail on a concrete problem is not so grasp, it's just weights and numbers and like complex and. Yeah, and I think that's a big challenge, like how, how to deal with these black boxes.",
      "id": "ep_42_ut_159"
    },
    {
      "end": 3709680,
      "speaker": "Santiago Ortiz",
      "start": 3627178,
      "text": "I have a sort of axis, I have a table in which I have all, a lot of prediction models, and I give a punctuation to each one. Exactly related with that. Some are very transparent and very close to mind, or human mind processing others, or language. Others are more obscure. So I have a punctuation. But I think many of the models that seem to be kind of obscure can be restructured or re narrated somehow to make them more visible. So the support vector machine, very geometrical, you have like two lines, two parallel lines, and you can sort of explain how the decision is made according to the position towards those borders. It's not impossible. Okay. And then you have interaction, and with interaction you have a lot of power to understand, like dynamic processes, and that way you can somehow make more transparent a process. But obviously, if I want to use data science methods for visualization, I will always prefer the ones that are more transparent, more close to human mind process, et cetera.",
      "id": "ep_42_ut_160"
    },
    {
      "end": 3732396,
      "speaker": "Moritz Stefaner",
      "start": 3710980,
      "text": "Yeah, I think, yeah, because suddenly you have two problems, like you want to explain the data and the algorithm and it's. Exactly, yeah, exactly. Do you have any good books or any good, like blogs or people coming from data visualization finding this interesting. And they say like, I'd like to learn more about this data science type thing or machine learning. What's a good starting point?",
      "id": "ep_42_ut_161"
    },
    {
      "end": 3816074,
      "speaker": "Santiago Ortiz",
      "start": 3732548,
      "text": "Well, the problem is that there is a chasm in the middle. I also try to organize a series of books that will help, because this could be useful for people working in our team, people that are very data savvy, but they do not know data science. So they are more like doing a lot of visualization and they understand data, but they haven't do this step towards data science. So I have a recommendation of books. They form a sort of ladder of complexity, but there is a sort of chasm. So in the first block there are several books that talk about statistics in general. Some of them are really good. You kind of understand this sort of problems, but they do not explain models. Of course. They give you a general overview of statistics on what data science is and how it can be used. Then there is a chasm, there is a hole there. And then the next book, the one I recommend to a lot of people, but it's not completely easy. It's easier than any other, but it's quite difficult nonetheless. It's a book called data science for business. And what is good about this book.",
      "id": "ep_42_ut_162"
    },
    {
      "end": 3816710,
      "speaker": "Enrico Bertini",
      "start": 3816122,
      "text": "Is.",
      "id": "ep_42_ut_163"
    },
    {
      "end": 3861022,
      "speaker": "Santiago Ortiz",
      "start": 3819050,
      "text": "That they connect the models with necessity. Super clear. So whoever is reading this book will understand the connection between the model that is being explained and how it actually helps a team within an organization make decisions or spend certain amount of money in certain campaign, etcetera. It's super clear, that part. So if you manage to also understand the model, it's fantastic. It becomes super clear for you what the model is, how it works, et cetera, and you can eventually reproduce it yourself or start using it. So data science for business is, for the time being, my recommendation.",
      "id": "ep_42_ut_164"
    },
    {
      "end": 3865090,
      "speaker": "Enrico Bertini",
      "start": 3861126,
      "text": "I agree. I have this book. It's really, really good. Yeah.",
      "id": "ep_42_ut_165"
    },
    {
      "end": 3881846,
      "speaker": "Moritz Stefaner",
      "start": 3868390,
      "text": "It's good. And I mean, a lot of the traditional machine learning literature is super math heavy, and that's. You basically have to study that. It's not. Yes. Yeah. I wouldn't either know, like what to recommend.",
      "id": "ep_42_ut_166"
    },
    {
      "end": 3882794,
      "speaker": "Santiago Ortiz",
      "start": 3881878,
      "text": "He's very hard.",
      "id": "ep_42_ut_167"
    },
    {
      "end": 3890002,
      "speaker": "Moritz Stefaner",
      "start": 3882982,
      "text": "There's a good Aureli book, but I can't remember the title. It's something with python and machine learning or data mining and python. I'll look at it.",
      "id": "ep_42_ut_168"
    },
    {
      "end": 3902546,
      "speaker": "Santiago Ortiz",
      "start": 3890026,
      "text": "Yeah, but it's about using panda. I mean, it's about using a library. So it also explains a lot, and it's a fantastic book, but it's for people that already code.",
      "id": "ep_42_ut_169"
    },
    {
      "end": 3912536,
      "speaker": "Moritz Stefaner",
      "start": 3902658,
      "text": "It's the collective intelligence ones. It's the programming collective intelligence or something like this. Because I mean, it works more with social media data, but I introduces all the data mining techniques you can use.",
      "id": "ep_42_ut_170"
    },
    {
      "end": 3915648,
      "speaker": "Santiago Ortiz",
      "start": 3912688,
      "text": "To make a different book. I'm talking about data science.",
      "id": "ep_42_ut_171"
    },
    {
      "end": 3919824,
      "speaker": "Moritz Stefaner",
      "start": 3915704,
      "text": "Yeah, you mean the pandas book. Yeah, we can mention that too. We'll provide a little list in the.",
      "id": "ep_42_ut_172"
    },
    {
      "end": 3937798,
      "speaker": "Santiago Ortiz",
      "start": 3919872,
      "text": "But you know, had I time, I will totally write a book about data science for people that are not necessarily very strong in mathematics, but because there are many, many methods that can be explained in a clear way, I think discuss my mention, Santiago.",
      "id": "ep_42_ut_173"
    },
    {
      "end": 3948374,
      "speaker": "Moritz Stefaner",
      "start": 3937854,
      "text": "Maybe that's your new calling. Maybe that's your new calling. Maybe you should teach people like complex math stuff with cool tools. I would appreciate that time.",
      "id": "ep_42_ut_174"
    },
    {
      "end": 3949694,
      "speaker": "Santiago Ortiz",
      "start": 3948422,
      "text": "I would totally do that.",
      "id": "ep_42_ut_175"
    },
    {
      "end": 3952446,
      "speaker": "Moritz Stefaner",
      "start": 3949742,
      "text": "Yes, we can make time. Come on.",
      "id": "ep_42_ut_176"
    },
    {
      "end": 3960450,
      "speaker": "Santiago Ortiz",
      "start": 3952478,
      "text": "I don't know, maybe what I will do is publish some blogs, giving some hints and helping people to make the job, little things.",
      "id": "ep_42_ut_177"
    },
    {
      "end": 3968888,
      "speaker": "Moritz Stefaner",
      "start": 3960830,
      "text": "I think it would help a lot. And many people are still scared off by like fancy terms. And often it's simple stuff if you.",
      "id": "ep_42_ut_178"
    },
    {
      "end": 3974792,
      "speaker": "Santiago Ortiz",
      "start": 3968944,
      "text": "It's super simple. Some of them are so close to our own mind processes.",
      "id": "ep_42_ut_179"
    },
    {
      "end": 3975904,
      "speaker": "Enrico Bertini",
      "start": 3974896,
      "text": "I agree, I agree.",
      "id": "ep_42_ut_180"
    },
    {
      "end": 4016866,
      "speaker": "Santiago Ortiz",
      "start": 3975992,
      "text": "Actually, I did an experiment with my five years old kid. I taught him hotel science. One more k nearest neighbors. And yeah, I have a video I want to publish at some moment. He actually drawing the. So I draw a point in the, in the scatter plot and he actually finds the decay nearest neighbor and he decides what is the classification result. So he totally got it. I mean, and knee is one of those examples of something that is super simple. Super simple.",
      "id": "ep_42_ut_181"
    },
    {
      "end": 4021226,
      "speaker": "Enrico Bertini",
      "start": 4016898,
      "text": "But I agree, there are many machine learning models that are super simple to understand.",
      "id": "ep_42_ut_182"
    },
    {
      "end": 4055760,
      "speaker": "Santiago Ortiz",
      "start": 4021418,
      "text": "And the other thing is, once you understand one model, you can then jump to understand some of the most important concepts in that data science, such as the problem of bias. How do you test so only one model to actually get the whole idea, I think. And so you understand, let's say you understand keynote and you understand decision trees only with these two, you can jump to super interesting concepts that are actually very useful for data visualization as well.",
      "id": "ep_42_ut_183"
    },
    {
      "end": 4103920,
      "speaker": "Enrico Bertini",
      "start": 4057100,
      "text": "So one interesting aspect of that, that you briefly mentioned is that I think that there is a long tradition in machine learning of creating models for prediction, but there are many of these models that can be actually used for exploration and explanation. I think this is where things get interesting, especially when you pair up machine learning with visualization. All those cases where machine learning models can be used to explain or explore something in your data. And I think there are many cases out there where probably you wouldn't easily find anything with visualization alone, but as soon as you apply some modeling on top of that, then you start getting something really interesting.",
      "id": "ep_42_ut_184"
    },
    {
      "end": 4105324,
      "speaker": "Santiago Ortiz",
      "start": 4104340,
      "text": "Absolutely.",
      "id": "ep_42_ut_185"
    },
    {
      "end": 4111120,
      "speaker": "Enrico Bertini",
      "start": 4105452,
      "text": "I totally agree with you that the combination of the two, in some cases, can actually be much, much more powerful.",
      "id": "ep_42_ut_186"
    },
    {
      "end": 4120200,
      "speaker": "Santiago Ortiz",
      "start": 4112100,
      "text": "Absolutely. And it's totally unexplored. So many possible combinations, which is great.",
      "id": "ep_42_ut_187"
    },
    {
      "end": 4143280,
      "speaker": "Enrico Bertini",
      "start": 4120500,
      "text": "Yeah. And I also have a feeling that, I mean, I hope. I'm not sure how true this is, but I guess that most of the machine learning people out there didn't really explore enough this aspect of machine learning, how to use machine learning, even the predictive models, more for exploratory purposes. I think there is a very interesting gap there.",
      "id": "ep_42_ut_188"
    },
    {
      "end": 4148280,
      "speaker": "Santiago Ortiz",
      "start": 4144180,
      "text": "There is so many things to do to explore. Yes, I think so.",
      "id": "ep_42_ut_189"
    },
    {
      "end": 4153530,
      "speaker": "Moritz Stefaner",
      "start": 4151470,
      "text": "Data is gonna stick around for a while.",
      "id": "ep_42_ut_190"
    },
    {
      "end": 4168510,
      "speaker": "Enrico Bertini",
      "start": 4156670,
      "text": "Yeah. So should we wrap it up? We've been talking for. Yeah, I think we have to. Unfortunately, we have to. I would keep talking with Santiago for another.",
      "id": "ep_42_ut_191"
    },
    {
      "end": 4170370,
      "speaker": "Moritz Stefaner",
      "start": 4168670,
      "text": "We'll invite him back next year.",
      "id": "ep_42_ut_192"
    },
    {
      "end": 4171366,
      "speaker": "Santiago Ortiz",
      "start": 4170870,
      "text": "Yes.",
      "id": "ep_42_ut_193"
    },
    {
      "end": 4174170,
      "speaker": "Enrico Bertini",
      "start": 4171438,
      "text": "It's been too long. You should come more often.",
      "id": "ep_42_ut_194"
    },
    {
      "end": 4177760,
      "speaker": "Santiago Ortiz",
      "start": 4176020,
      "text": "Where to New York or to.",
      "id": "ep_42_ut_195"
    },
    {
      "end": 4180360,
      "speaker": "Enrico Bertini",
      "start": 4178060,
      "text": "No, to data stories. And to New York.",
      "id": "ep_42_ut_196"
    },
    {
      "end": 4193080,
      "speaker": "Moritz Stefaner",
      "start": 4182060,
      "text": "And Germany. Are there any conferences you will be speaking at? Where can people see you? Do you have any travel plans yet?",
      "id": "ep_42_ut_197"
    },
    {
      "end": 4201970,
      "speaker": "Santiago Ortiz",
      "start": 4193460,
      "text": "Going to London in a couple of weeks. And for the time being, that's in January. Going to Czech Republic as well.",
      "id": "ep_42_ut_198"
    },
    {
      "end": 4203610,
      "speaker": "Moritz Stefaner",
      "start": 4202710,
      "text": "Excellent.",
      "id": "ep_42_ut_199"
    },
    {
      "end": 4204730,
      "speaker": "Enrico Bertini",
      "start": 4203990,
      "text": "Nice.",
      "id": "ep_42_ut_200"
    },
    {
      "end": 4216250,
      "speaker": "Moritz Stefaner",
      "start": 4206350,
      "text": "Cool, man. Great stuff, Santiago. I like the general direction. I'm really curious what comes out of that. And do write a few blog posts.",
      "id": "ep_42_ut_201"
    },
    {
      "end": 4217730,
      "speaker": "Enrico Bertini",
      "start": 4216670,
      "text": "That's what I was.",
      "id": "ep_42_ut_202"
    },
    {
      "end": 4219222,
      "speaker": "Moritz Stefaner",
      "start": 4218110,
      "text": "Write a medium post.",
      "id": "ep_42_ut_203"
    },
    {
      "end": 4224050,
      "speaker": "Enrico Bertini",
      "start": 4219286,
      "text": "This is what they should write more, Santiago. Interesting ideas.",
      "id": "ep_42_ut_204"
    },
    {
      "end": 4225726,
      "speaker": "Santiago Ortiz",
      "start": 4224350,
      "text": "Super bad writer.",
      "id": "ep_42_ut_205"
    },
    {
      "end": 4226838,
      "speaker": "Enrico Bertini",
      "start": 4225838,
      "text": "So super bad.",
      "id": "ep_42_ut_206"
    },
    {
      "end": 4230210,
      "speaker": "Santiago Ortiz",
      "start": 4226894,
      "text": "Very difficult for me to write. Super difficult, yes.",
      "id": "ep_42_ut_207"
    },
    {
      "end": 4232130,
      "speaker": "Moritz Stefaner",
      "start": 4231110,
      "text": "And record.",
      "id": "ep_42_ut_208"
    },
    {
      "end": 4249130,
      "speaker": "Enrico Bertini",
      "start": 4232550,
      "text": "But at least that's why you're good talking. From your conversation, we know that we have to write different blog posts. We need a few new books out there. So that's interesting input. So hopefully that's going to inspire some people listening.",
      "id": "ep_42_ut_209"
    },
    {
      "end": 4250490,
      "speaker": "Santiago Ortiz",
      "start": 4249510,
      "text": "Hopefully.",
      "id": "ep_42_ut_210"
    },
    {
      "end": 4253014,
      "speaker": "Enrico Bertini",
      "start": 4251350,
      "text": "Okay, man, thanks a lot.",
      "id": "ep_42_ut_211"
    },
    {
      "end": 4253630,
      "speaker": "Moritz Stefaner",
      "start": 4253102,
      "text": "Thanks so much.",
      "id": "ep_42_ut_212"
    },
    {
      "end": 4255650,
      "speaker": "Santiago Ortiz",
      "start": 4253670,
      "text": "Thank you very much. It was good.",
      "id": "ep_42_ut_213"
    },
    {
      "end": 4256890,
      "speaker": "Enrico Bertini",
      "start": 4255790,
      "text": "Thank you. Bye bye.",
      "id": "ep_42_ut_214"
    },
    {
      "end": 4257990,
      "speaker": "Santiago Ortiz",
      "start": 4256930,
      "text": "Bye bye bye.",
      "id": "ep_42_ut_215"
    },
    {
      "end": 4306380,
      "speaker": "Enrico Bertini",
      "start": 4263650,
      "text": "Hey, everyone. Enrico here. I really hope you enjoyed the episode with Santiago Ortiz. I think it was really, really nice. So once again, I'm here to talk about Tableau. As Moritz said at the beginning, we are so excited to have a sponsor. So datastory is supported by Tableau software, helping people see and understand their data. Get answers from interactive dashboards wherever you go for your free trial, visit Tableau software at Tableau. Once again, Tableau software.com Datastories. Don't forget to put data stories because it's very important that they know that you are coming from us. Thanks a lot for supporting us with this.",
      "id": "ep_42_ut_216"
    }
  ],
  "confidence": 0.91897473038738,
  "audio_duration": 4306,
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_status_code": null,
  "webhook_auth": false,
  "webhook_auth_header_name": null,
  "speed_boost": false,
  "auto_highlights_result": null,
  "auto_highlights": false,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_audio_quality": null,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "content_safety": false,
  "iab_categories": true,
  "content_safety_labels": {
    "status": "unavailable",
    "results": [],
    "summary": {}
  },
  "language_detection": false,
  "language_detection_threshold": null,
  "language_confidence": null,
  "custom_spelling": null,
  "throttled": false,
  "auto_chapters": true,
  "summarization": false,
  "summary_type": null,
  "summary_model": null,
  "custom_topics": false,
  "topics": [],
  "speech_threshold": null,
  "speech_model": "best",
  "chapters": [
    {
      "summary": " Tableau Software decided to sponsor data stories. This is, of course, great, great news for us and for everyone because we will be able to create more episodes. It puts the whole project also on a bit more solid feat. Maybe we should tell our listeners how this is gonna play out.",
      "gist": "Data Stories",
      "headline": "Tableau Software decided to sponsor data stories on our podcast",
      "start": 320,
      "end": 75454,
      "id": "ep_42_ch_0"
    },
    {
      "summary": "Enrico: Let's try and have a meetup or something in Paris. Moritz: We will be reporting from this, and by the way, we will be. At least we are planning to. Data stories number 42.",
      "gist": "Datastories: data stories #42",
      "headline": "Datastore is supported by Tableau software, helping people see and understand data",
      "start": 75582,
      "end": 222290,
      "id": "ep_42_ch_1"
    },
    {
      "summary": "Santiago Ortiz has been on the show already in the past, and we are very glad to have him with us again. That's going to be fun, I'm sure.",
      "gist": "Santiago Ortiz on the POD",
      "headline": "We have another special, special guest today and an old friend of ours",
      "start": 223710,
      "end": 246850,
      "id": "ep_42_ch_2"
    },
    {
      "summary": "Santiago Ortiz has been working on interactive information visualization for 15 years. Recently started working on more client based projects and introducing some data science into the projects. Is building a team of three people, and wants more people from around the world.",
      "gist": "Interactive Data visualization",
      "headline": "Santiago Ortiz has been working on interactive information visualization for 15 years",
      "start": 247950,
      "end": 490376,
      "id": "ep_42_ch_3"
    },
    {
      "summary": "Santiago Santiago: My experimentation is about cognition. It's about finding new ways to communicate information. The goal is to achieve results that could be useful for client projects. The future of visualization being used for totally pragmatic purposes will be totally different.",
      "gist": "Data Visualization: Experimentation",
      "headline": "Santiago defines lots of your work as experimentation",
      "start": 490568,
      "end": 1136502,
      "id": "ep_42_ch_4"
    },
    {
      "summary": "Santiago: What we do with our team is much more than data visualization. It's really about keeping a quality conversation with client, understanding the needs. And the talk is more about this strategy and then visualization, data science.",
      "gist": "How to Offload Data Visualization",
      "headline": "Santiago says you mostly create interactive visualizations for clients",
      "start": 1136646,
      "end": 1211558,
      "id": "ep_42_ch_5"
    },
    {
      "summary": "Do you develop visualizations that then you give to your clients and they end up discovering something? Or it's more like you use the tool, you discover some interesting patterns, and then you go back to them. It's both sides, discovering things and communicating the discoveries. In the conversation, the project evolves.",
      "gist": "Do You Develop Visualizations to Discover Patterns?",
      "headline": "Do you develop visualizations that then you give to clients and they end up discovering",
      "start": 1211694,
      "end": 1268580,
      "id": "ep_42_ch_6"
    },
    {
      "summary": "When working with scientists or researchers, I have a hard time understanding their language. How do you deal with that? I'm curious. Something that I've discovered is ignorance sometimes is super good. And visualization for me is like the window.",
      "gist": "Learning the language of data visualization",
      "headline": "Learning language is a steep learning curve when working with new clients",
      "start": 1269760,
      "end": 1712260,
      "id": "ep_42_ch_7"
    },
    {
      "summary": "Data stories is supported by Tableau software, helping people see and understand their data. Tableau lets people connect to any kind of data and visualize it on the fly. If you want to try Tableau for free, there is a free trial.",
      "gist": "Data visualization in Tableau Software",
      "headline": "Tableau lets you connect to any kind of data and visualize it instantly",
      "start": 1712920,
      "end": 1875402,
      "id": "ep_42_ch_8"
    },
    {
      "summary": "Sometimes people expect the wrong things from data visualization or data science. In the first iteration, the first approach we have with clients, our first proposal, we do not commit with any sort of outcome. It's very dangerous to start a project without data.",
      "gist": "What are the biggest misconceptions about data science and visualization?",
      "headline": "Sometimes people expect the wrong things from data visualization or data science",
      "start": 1875426,
      "end": 2066000,
      "id": "ep_42_ch_9"
    },
    {
      "summary": "In order to do good visualization, you have to do a lot of data analysis or data pre processing. Another area is interaction, right? In some cases, interaction is huge, but it's not captured by the word visualization. A real data science data visualization project should explore in a more deeper and diverse ways.",
      "gist": "Data Visualization: The Problem",
      "headline": "To do good data visualization, you first need to understand the data",
      "start": 2066620,
      "end": 2352200,
      "id": "ep_42_ch_10"
    },
    {
      "summary": "I am interested in visualization, but visualization is not my object of study. The object of the study for me is data that comes from many different realities. The main missing thing is that we don't have the stories of the people that use visualization. Without that feedback, it's impossible to improve our field.",
      "gist": "I'm not interested in visualization",
      "headline": "So a few minutes ago, you said, I'm not interested in visualization",
      "start": 2353420,
      "end": 2767140,
      "id": "ep_42_ch_11"
    },
    {
      "summary": "Santiago: In the context of the visualization conference, there are different kind of papers. Design studies is something completely different, is more measured towards impact. Industry will be more pragmatic in that sense, more than academics normally. We have two new ideas that will be awesome.",
      "gist": "Do we need design studies in the visualization world?",
      "headline": "Santiago: There are lots of papers that address exactly what you are discussing",
      "start": 2767520,
      "end": 3104600,
      "id": "ep_42_ch_12"
    },
    {
      "summary": "Santiago: All visualization developers, creators should learn data science. He says data science should be incorporated into data visualization only because you can start understanding this more complex relation between the features in the data. Santiago: We can use it as a synonym of machine learning.",
      "gist": "Data science and data visualization",
      "headline": "Santiago: All visualization developers should learn data science",
      "start": 3105450,
      "end": 3302880,
      "id": "ep_42_ch_13"
    },
    {
      "summary": "Decision trees are models that can be understood by humans. Can you explain briefly what is a decision tree? You can explore and dig and find interesting subpopulations of data that combine certain features. The problem is that most of the machine learning models are not as illustrative.",
      "gist": "Decision Tree",
      "headline": "The decision tree is a model that can be understood by humans",
      "start": 3304620,
      "end": 3719788,
      "id": "ep_42_ch_14"
    },
    {
      "summary": "Santiago: I try to organize a series of books that will help. People that are very data savvy, but they do not know data science. Data science for business is a book that connects the models with necessity. Maybe you should teach people like complex math stuff with cool tools.",
      "gist": "What's a good starting point for data science?",
      "headline": "Santiago: Many people do not know data science or machine learning",
      "start": 3719884,
      "end": 4055760,
      "id": "ep_42_ch_15"
    },
    {
      "summary": "Santiago: There are many cases where machine learning models can be used to explain or explore something in your data. He says the combination of the two can be much more powerful. Do you have any travel plans yet?",
      "gist": "Machine Learning for Exploring and Reasoning",
      "headline": "Santiago: Machine learning can be used for exploration and explanation",
      "start": 4057100,
      "end": 4257990,
      "id": "ep_42_ch_16"
    },
    {
      "summary": "Datastory is supported by Tableau software, helping people see and understand their data. Get answers from interactive dashboards wherever you go for a free trial. Don't forget to put data stories because it's very important that they know you are coming from us.",
      "gist": "Tableau Software",
      "headline": "Enrico Ortiz talks about Tableau with Santiago Ortiz",
      "start": 4263650,
      "end": 4306380,
      "id": "ep_42_ch_17"
    }
  ],
  "disfluencies": false,
  "entity_detection": false,
  "sentiment_analysis": false,
  "sentiment_analysis_results": null,
  "entities": null,
  "speakers_expected": null,
  "summary": null,
  "custom_topics_results": null,
  "is_deleted": null,
  "episode_num": "42",
  "episode_metadata": {
    "speakers": [
      "Enrico Bertini",
      "Moritz Stefaner",
      "Santiago Ortiz"
    ],
    "WPid": "217",
    "url": "https://datastori.es/podlove/file/478/s/feed/c/mp3/data-stories-42-with-santiago-ortiz.mp3",
    "episode_title": "Santiago Ortiz"
  }
}