{
  "id": "c8a309a8-e165-40a6-89ca-d4079952bfcf",
  "language_model": "assemblyai_default",
  "acoustic_model": "assemblyai_default",
  "language_code": "en_us",
  "status": "completed",
  "audio_url": "https://datastori.es/podlove/file/4191/s/feed/c/mp3/103-explorable-explanations-with-nicky-case.mp3",
  "utterances": [
    {
      "end": 5874,
      "speaker": "Nicky Case",
      "start": 200,
      "text": "With play, you can get too much, much deeper and much faster than you can with just words and pictures alone.",
      "id": "ep_103_ut_0"
    },
    {
      "end": 28914,
      "speaker": "Enrico Bertini",
      "start": 10414,
      "text": "Are you missing out on meaningful relationships hidden in your data? Unlock the whole story with Qlik sense through personalized visualizations and dynamic dashboards, which you can download for free at Qlik Datastories. That's Qlik Datastories.",
      "id": "ep_103_ut_1"
    },
    {
      "end": 52452,
      "speaker": "Moritz Stefaner",
      "start": 48284,
      "text": "Hey, everyone. Welcome to a new episode of data stories. Hey, Moritz.",
      "id": "ep_103_ut_2"
    },
    {
      "end": 53244,
      "speaker": "Enrico Bertini",
      "start": 52508,
      "text": "Hey, Enrico.",
      "id": "ep_103_ut_3"
    },
    {
      "end": 53956,
      "speaker": "Moritz Stefaner",
      "start": 53324,
      "text": "How are you?",
      "id": "ep_103_ut_4"
    },
    {
      "end": 59844,
      "speaker": "Enrico Bertini",
      "start": 54020,
      "text": "Good, good. I just came back from vacations on this beautiful island of Spiekeroog in the north of Germany.",
      "id": "ep_103_ut_5"
    },
    {
      "end": 61762,
      "speaker": "Moritz Stefaner",
      "start": 59924,
      "text": "Wow, sounds great.",
      "id": "ep_103_ut_6"
    },
    {
      "end": 64082,
      "speaker": "Enrico Bertini",
      "start": 61818,
      "text": "Camping. Camping for ten days.",
      "id": "ep_103_ut_7"
    },
    {
      "end": 66762,
      "speaker": "Moritz Stefaner",
      "start": 64178,
      "text": "Yeah. That's perfect. Yeah, yeah.",
      "id": "ep_103_ut_8"
    },
    {
      "end": 72226,
      "speaker": "Enrico Bertini",
      "start": 66818,
      "text": "Vacation's the hard way. It was good.",
      "id": "ep_103_ut_9"
    },
    {
      "end": 76586,
      "speaker": "Moritz Stefaner",
      "start": 72330,
      "text": "Yeah, yeah, yeah, yeah. I'm going on vacation soon as well. Yeah, I'm thrilled.",
      "id": "ep_103_ut_10"
    },
    {
      "end": 78834,
      "speaker": "Enrico Bertini",
      "start": 76650,
      "text": "Sweet, sweet. You should.",
      "id": "ep_103_ut_11"
    },
    {
      "end": 123904,
      "speaker": "Moritz Stefaner",
      "start": 78994,
      "text": "Perfect. We need that sometime. Yeah. So before we start, I want to mention very quickly our Patreon campaign. So I want to, first of all, thank all the people who already pledged something. We are a little bit over halfway. And, yeah, as we've been saying for a while, if you enjoy listening to the show, please consider pledging. So to do that, you have to go to patreon.com Datastories, where we describe exactly why we do that, how we do that, and once we will reach our goal, we will be able to switch to a show without advertising. Right, Moritz?",
      "id": "ep_103_ut_12"
    },
    {
      "end": 128104,
      "speaker": "Enrico Bertini",
      "start": 123984,
      "text": "That's right. And there's 64 of you already contributing. That's amazing. Thanks so much.",
      "id": "ep_103_ut_13"
    },
    {
      "end": 163404,
      "speaker": "Moritz Stefaner",
      "start": 128144,
      "text": "Yeah. And that's typically for a price of coffee or latte every two weeks. So consider helping out and supporting us so that we can continue making the show. Okay, let's dive right in with our guest today. Today we have a new guest. The guest is Nicki Case. So Niki is a designer and game developer who creates these really interesting and beautiful interactive simulations on the web and trying to help people understand complex issues. Hi, Nicky. Welcome on the show.",
      "id": "ep_103_ut_14"
    },
    {
      "end": 166464,
      "speaker": "Nicky Case",
      "start": 163524,
      "text": "Hi. Yeah, you did that intro better than I could.",
      "id": "ep_103_ut_15"
    },
    {
      "end": 170108,
      "speaker": "Enrico Bertini",
      "start": 168484,
      "text": "Great to have you on, Nicky.",
      "id": "ep_103_ut_16"
    },
    {
      "end": 177674,
      "speaker": "Moritz Stefaner",
      "start": 170236,
      "text": "So can you tell us a little bit about your work? What is your background, what you are doing, how you started?",
      "id": "ep_103_ut_17"
    },
    {
      "end": 334454,
      "speaker": "Nicky Case",
      "start": 177804,
      "text": "Yeah. So what I do, the way I describe it, is I tell stories about systems. I take the systems to the world around us, you know, social systems, physical systems, political, economic, environmental systems. And I try to explain them through the systems of simulations, playable, interactive games. I try to make the complex simple through the power of play or something like that. I don't know. That's my elevator pitch. I need to work on that. But, yeah, I guess the real core reason for what I for why I feel like this is powerful is because learning is not passive, it's an active process. Learning is about actually interacting with something, your curiosity, your creation, your prodding at what the thing is. So I feel like we should reflect that active process in the things we actually create. So, you know, if learning is active, then the things we make should also be interactive, you know, or something like that. Yeah. How did I get started? So I started off making games because, you know, I was a kid and I loved playing games, so I decided to make some. And just by coincidence, making games required that I had to learn how to do programming, which turned out to be a valuable skill. Like that was not my plan at all. Like it was just a really nice side effect. I just wanted to make games and I really love puzzle games. So puzzle games like Portal, Braid, these kind of games that teach you, the player really, really, really complicated systems. So portal, if you don't know, it's about a game where you have to manipulate a space, manipulate, traverse a non euclidean space, create wormholes. And braid is a game where you manipulate time. So these are really complicated things and they teach it in such a way that is challenging and also, but also fun. And it's almost a shame that so many games don't actually apply this to teaching about the real world. They teach about systems that are really interesting and fun, but, you know, have no effect on, you know, your own daily life or the world around you. So that's why I'm really interested in making explorable explanations which our games, you can't see me do, the air quotes in the air, but games that teach about the complex systems of the world using what we know from game design, how to teach it in a way that is fun and compelling and challenging and actually resonates and sticks with you.",
      "id": "ep_103_ut_18"
    },
    {
      "end": 380434,
      "speaker": "Enrico Bertini",
      "start": 334574,
      "text": "Yeah, it's really interesting. And I feel there's a whole class of projects now that fall into this nice label of explorable explanations that it seems like a whole new genre to me. I don't know, maybe I just wasn't aware before or there is a lot of stuff happening right now in this space, but it seems to be exploding, at least in my view. And there has been this like this niche of gaming that's called serious games, I guess, or serious gaming. Are you familiar with that? Yeah, yeah. And. But I think it's a bit different. Right. So would you say explorable explanations, is it similar spirits or serious games, games that try to teach you like how maybe how war works or how economy works or something like this, versus explorable explanations.",
      "id": "ep_103_ut_19"
    },
    {
      "end": 452072,
      "speaker": "Nicky Case",
      "start": 380514,
      "text": "Yeah, I feel like explorable explanations is more, I guess it has its roots more in journalism and in, or, like, textbooks or teaching stuff. So the explorable explanations I've seen tend to be more based in text. So, like, you know, the New York Times, you draw it, or my own work with parable of the polygons or to build a better ballot. It's more text heavy. And I feel like serious games, you know, they have their roots more in games, so they have more of the conventions of games. You know, it's visual. There's characters, there's win states, lose states. And I feel like they're very similar in that they have the same goal, they have the same, you know, value of, like, trying to teach these, like, important and complicated things, but in a way that actually resonates with human beings, with people. But they're coming from different routes. So explorable explanations comes from more of the tradition of, you know, text journalism education, and serious games comes from more of the tradition of, you know, regular video games. So, yeah, it's the same goal, different routes. So I really like that. It's like, converging on the, maybe you.",
      "id": "ep_103_ut_20"
    },
    {
      "end": 468714,
      "speaker": "Enrico Bertini",
      "start": 452088,
      "text": "Can meet in the middle. Let's talk about some of your projects, because I think on the example, it's always people get best what the whole idea of explorable explanations is. So one of, I think, probably your best known project, is that fair to say, is probably the parable of the polygons.",
      "id": "ep_103_ut_21"
    },
    {
      "end": 479374,
      "speaker": "Nicky Case",
      "start": 468754,
      "text": "Yep. Because I had Vi hart on that, and Viheart's fame just rubbed off on me. So that's the way to get famous. Just work with famous people.",
      "id": "ep_103_ut_22"
    },
    {
      "end": 482202,
      "speaker": "Enrico Bertini",
      "start": 481314,
      "text": "Piggybacking.",
      "id": "ep_103_ut_23"
    },
    {
      "end": 482894,
      "speaker": "Nicky Case",
      "start": 482258,
      "text": "Yeah.",
      "id": "ep_103_ut_24"
    },
    {
      "end": 488474,
      "speaker": "Enrico Bertini",
      "start": 484714,
      "text": "That's a good trick. So can you tell us a bit about the project?",
      "id": "ep_103_ut_25"
    },
    {
      "end": 746846,
      "speaker": "Nicky Case",
      "start": 488894,
      "text": "So the kind of ironic thing about trying to talk about these explore explanations is that I just spent nine minutes saying about how you really need the interaction to get the sense of it, and now I'm trying to describe it through words alone. So I'll try to give him my best shot. Parable of the polygons is a story about a social system, about how, how we divide ourselves from the bottom up, like, without any malice or bad intentions, but just from the bottom up, just small, little, seemingly harmless choices can create a harmful world. So it's based off Thomas Schellings. Well, now the late Thomas Schellings work. So Thomas Schelling was a Nobel Prize winning economist, and in the 1970. So there's actually a really great story behind how he created this model. He was on an airplane in the 1970s, and he was thinking about how did New York City, that's where he lived at the time. How did New York City get so segregated, or why so many major cities are also segregated, even though Jim Crow has been abolished a couple decades previously? And so he created this model. So this is interesting. So he just, like, pulled out a checkerboard on a flight, and he put down some nickels and dimes to represent people of color and white people and with a simple bottom up rule. So the bottom up rule was each coin represented a person, and each coin was living on this checkerboard grid of, like, you know, a grid, like neighborhood. And each coin, you know, coin thought to itself, if less than a third of my neighbors are like me, I'll move to a random empty spot. And, you know, that seems like, you know, not that bad. Like, every coin would be okay, you know, being next to another coin of a different type. But Thomas Schelling found, like, on this little flight of his, like, you know, on a plane, like, prototyping this simulation with a checkerboard and coins in his pocket, that these coins would divide themselves from the bottom up. So, yeah, it creates, like, a really, at least, like, you know, he wasn't saying that, you know, this is how it happens. Like, there's obviously, like, a lot of, like, top down forces in play at a time, you know, with public housing policies and all that. But he at least showed that, you know, it is at least plausible that some part of it is bottom up, that we divide ourselves from the bottom up. And I feel like, at least right now, this is really applicable to, yeah, not just race, but also the urban rural divide that's happening in America and also, I guess, in a lot of parts in Europe. Billy Bishop wrote a really great book called the Big Sort, and it's about how people, from the bottom up, you know, there's no top down force here at play. They just move to, you know, people move to areas where people are more ideologically like themselves. So from the bottom up, people have been kind of segregating, kind of separating themselves into. I don't like using this phrase, but, you know, echo chambers, you know, their own bubbles completely from the bottom up. And, like, you know, no malice whatsoever. You know, it's a complete human thing. Why wouldn't you want to hang out with like minded people? But the problem with that is that if everybody does this, this kind of accumulates, and then we all end up dividing ourselves. So anyway, that's like three minutes of backstory. Anyway, parable, the polygons, it's about that. So you play with that same simulation that Thomas Schelling played with on that little plane he just created, like five decades ago or so. So, yeah, so it's like that, except instead of coins, it's a world of triangle people and square people, and they all live on the grid and they live in shape, land. And so, you know, on and on. Anyway, you can drag and drop them. And I already gave away the. The plot twist here, like that. They'll separate themselves from the bottom up, but I have now given away how they can reunify themselves, how they can unite themselves in the end from the bottom up as well. So go actually play with it. Yeah. That's parallel to polygons.",
      "id": "ep_103_ut_26"
    },
    {
      "end": 747518,
      "speaker": "Moritz Stefaner",
      "start": 746950,
      "text": "Yeah.",
      "id": "ep_103_ut_27"
    },
    {
      "end": 789878,
      "speaker": "Enrico Bertini",
      "start": 747646,
      "text": "And it's really, the structure is so nice because the same way you describe the problem now, you first present this problem and these simple mechanisms that seem inevitable, but then, yeah, you can learn to figure something out, maybe to counteract these forces or to, I don't know, regulate a bit the problem and so on and so. And you get walked through this sequence of insights, and some of them you discover yourself, some you discover in the text, and afterwards you maybe understood the problem with better and possible solutions. So I totally encourage everybody to just go to the page and check it out and play a bit with the simulations to get the whole idea. As Nicky said, it's really hard to, to describe.",
      "id": "ep_103_ut_28"
    },
    {
      "end": 842444,
      "speaker": "Nicky Case",
      "start": 789926,
      "text": "And at the end there's like a sandbox, and at the end there's a sandbox simulation mode. So actually, I don't know if this is like. So in games, sandbox mode means you can just play around with the rules, with the specific variables, and see what if for different scenarios, what if for different solutions. And so you might be able to come up with, you might be able to discover things that we, the original authors, didn't even think about. And I think that's like one of many really powerful things about explanations is that if done really well, the reader could play with a model or play with something and discover things for themselves that the original authors didn't even think about. And that's something that we try to create in parable, the polygons and what I keep trying to make in my own future work as well.",
      "id": "ep_103_ut_29"
    },
    {
      "end": 904424,
      "speaker": "Moritz Stefaner",
      "start": 842564,
      "text": "Yeah, that's what I really like of your simulations. So yesterday I spent a considerable amount of time replaying many of your simulations, and it's a lot of fun oh, thanks. Yes. And I have to say that's what makes simulations really interesting, because as you start playing with them, you understand the problem much better, but you kind of like, understand the problem more at a visceral level. Right. It's not necessarily always explicit. Right. I think we tend to explain things using exclusively our rationality. And when we explain them using text, we also try to walk people through the rational process. Right. But when you can interact with the simulation, I think there is another part of your brain that is working at a more experiential level. And this makes it really, really, really powerful because you are actually experiencing the effect. And I think that's what makes it really, really powerful.",
      "id": "ep_103_ut_30"
    },
    {
      "end": 1022114,
      "speaker": "Nicky Case",
      "start": 904504,
      "text": "Yeah. Like one analogy I like to use, I know it's not a perfect analogy, but it's like riding a bike. You can study as much as you want about angular momentum and gyroscopes and balancing and all the physical of biking, and you wouldn't actually know how to ride a bike, but, you know, what you have to do is just like actually, you know, play around with the bike, you know, try and fail and try and fail, and eventually you get it. And eventually your intuition for the bike will be even deeper than your, like, conscious understanding of it. Like, I wouldn't be able to, like, consciously explain to someone else how to ride a bike. And even if I could, you know, that wouldn't help. So, you know, it's not a perfect analogy, but that's what I think. Hopefully explorable explanations can tap into is helping people get a deeper intuition for something. And just like a little side notes, like when people talk about, you know, we have to make this idea intuitive. That's good. That's really good. But it kind of ignores the fact that you don't have to just like, yes, make something intuitive, like changing the project. So that's intuitive. But the fact is you can also change someone's intuition over time. That's what learning a byte is. Like with enough, like play, with enough practice, it actually changes your own intuition. And I feel like hopefully with explore by explanations, if you play with a simulation long enough, it also actually changes your intuition for how feedback loops work or how bottom up processes work or how humans work or how systems work because, you know, you can study it, you know, with just text and diagrams and, you know, that's not, that's not bad. You know, that's how I had to learn it before I was able to create interactive stuff for myself. Like, you know, someone had to teach me with it just using text and pictures. But I feel like, you know, with play, you can get too much, much deeper and much faster than you can with just words and pictures alone.",
      "id": "ep_103_ut_31"
    },
    {
      "end": 1023166,
      "speaker": "Enrico Bertini",
      "start": 1022494,
      "text": "Yeah, yeah.",
      "id": "ep_103_ut_32"
    },
    {
      "end": 1039574,
      "speaker": "Nicky Case",
      "start": 1023190,
      "text": "I feel like what I had to learn, you know, through reading, like, dozens of books over a few years, like, I feel like I can communicate that a lot faster and a lot, you know, deeper through like a half hour game rather than several books over several years.",
      "id": "ep_103_ut_33"
    },
    {
      "end": 1072432,
      "speaker": "Moritz Stefaner",
      "start": 1039874,
      "text": "Yeah, yeah, yeah. So that's, that's very evident also in this second project that we wanted to discuss, which I think addresses an even more complex problem, which is the one on building a better ballot. And that's fascinating. I've been reading it and playing with the simulations, and it's like, wow, such a complex, complex problem out there and lots of counterintuitive states of the simulation. So can you briefly describe what the project is about?",
      "id": "ep_103_ut_34"
    },
    {
      "end": 1076944,
      "speaker": "Nicky Case",
      "start": 1072568,
      "text": "Okay, so I'm going to try to start with the why of the project.",
      "id": "ep_103_ut_35"
    },
    {
      "end": 1077584,
      "speaker": "Moritz Stefaner",
      "start": 1077024,
      "text": "Oh, yeah, sure.",
      "id": "ep_103_ut_36"
    },
    {
      "end": 1251712,
      "speaker": "Nicky Case",
      "start": 1077624,
      "text": "So voting systems, they're complicated. And so I guess for, like, context. All right, so I'm going to use a US example because I'm living in the states right now. But, you know, I understand the audience is pretty worldwide. And so in 2000, there were three, you know, there were the two main candidates, George Bush and Al Gore, but there's also this, like, really popular third party candidate, Ralph Nader of the Green Party. And so just like the problem with the US. Well, one problem with the US voting system. So the US voting system is something called first past oppose, which is confusing name. Basically what it means is that you can only vote for one candidate on your ballot. So even if you really like Ralph Nader, but you also like Al Gore, you can't say that on the ballot, you can only pick Ralph Nader or Al Gore. And a lot of nations also have this voting system. But the problem with this is Ralph Nader is closer politically to Al Gore than George Bush. So George Bush is a Republican, right wing Republican. Al Gore was a left wing Democrat, and Ralph Nader was a very, very left wing Green Party candidate, and Ralph Nader was very popular. But because you cannot vote for more than one person on the ballot, what happened is Ralph Nader stole, and I'm using air quotes again that you can't see in audio, stole votes from Al Gore. And so as a result, Ralph Nader stole sufficiently enough votes from Al Gore that Al Gore tied to George Bush. And then the Supreme Court picked George Bush. And so this is called the spoiler effect. When you have a very popular third party that can steal, again, steal votes from another party. And, you know, this is just. Yeah. One example of the spoiler effect. Another one, arguably, was when Ross Perot, who was like an independent, stole votes from Bush Sr. Letting Clinton win. So I'm using, like another example from the other side where an independent third party stole votes from a Republican instead of a Democrat this time. So, you know, it's hooked both major parties in the US before. So you would think we would change it at some point, but no, no, we have not. So to build a ballot is about this to explain not just a spoiler effect, because that's just like the first one fifth of the interactive explanation, but to also explain visually and interactively not just the problem, but all the solutions that people have come up with in the last couple centuries, because people have known about this problem for a century and a half, and we have had solutions for a century and a half, but we just haven't gotten around to implementing them for some reason.",
      "id": "ep_103_ut_37"
    },
    {
      "end": 1255984,
      "speaker": "Enrico Bertini",
      "start": 1251848,
      "text": "Yeah, to be fair, maybe because nobody explained them well to politicians.",
      "id": "ep_103_ut_38"
    },
    {
      "end": 1289902,
      "speaker": "Nicky Case",
      "start": 1256064,
      "text": "Maybe that could be the thing. Because when I looked this up before I made this interactive, I've only seen one visual explanation of it. Like, everything else has been, like, in text and mathematics and really complicated equations and game theory. And I've seen one visual and, like, not even interactive. It's just, it's just a visual. It's just a visualization of it. And it was in like, 2007 and one visualization in 2007, like several, like a century and a half after these problems have been recognized.",
      "id": "ep_103_ut_39"
    },
    {
      "end": 1290694,
      "speaker": "Enrico Bertini",
      "start": 1290078,
      "text": "Yeah.",
      "id": "ep_103_ut_40"
    },
    {
      "end": 1431136,
      "speaker": "Nicky Case",
      "start": 1290814,
      "text": "Yeah. So I'm kind of proud to say this. As far as I can tell, my work is the first or maybe, you know, maybe second. I don't know. There's probably another one out there. But, you know, one of the first hedging here, interactive explanations of this problem, not just a problem, but also its solutions. So the most popular alternative solution is instant runoff voting, which I know that Australia uses for its parliament. So there's instant runoff voting, but it's also a board account Condorcet method, and then these two other methods, which I really like, but no government actually uses them right now, approval voting and score voting. So these are like five different alternatives that I explain through simulations that you can play with in this simulation. And at the end, there's another sandbox where you can play with the parameters. You can move around the candidates, you can choose the voting system, you can choose how many voters there are and, like, how they're distributed and see how that interacts with the different voting systems. Yeah. And I think that with the simulation, it shows stuff that I haven't seen in other simulations, like, what if the voters are polarized? Because most simulations, and again, these simulations are explained in text and in mathematics and in really unreadable, to be honest, words and jargon, but with, you can just visualize it. What if, instead of just a regular bell curve of gaussian distribution or whatever is distributed polarized? Or what if candidates are really close together or far apart? Or what if there's five candidates, you can just drag them around? What if there's two political axes, not just left and right, but also, I don't know, insurrectionist versus institutionalists, you know, someone who's more populist versus someone who's more establishment, which was a really big deal in the 2016 US election. You know, to put it lightly. That was, that was a thing that happened in the 2016 US election. But, yeah, so you can play with all these complex parameters and. But because it's visual and because you can actually play with it, it's a lot more, you know, actually understandable. You can actually grasp it. You can actually, you know, touch it because, you know, you can actually touch it. You know, it sort of works on the touchscreen. It's not very good on touchscreen, but, you know, you can actually drag and drop them. You know, it's actually tangible. Yeah.",
      "id": "ep_103_ut_41"
    },
    {
      "end": 1483712,
      "speaker": "Enrico Bertini",
      "start": 1431160,
      "text": "Maybe we should explain. So the basic model you use to explain all these different systems of voting is that there's sort of a space, like cartesian space, there's a plane, and the candidates are placed on that plane and the voters, too. And you might be closer to a candidate or further away. And I think this is the main trick you came up here with that you say is like, oh, actually, it's not binary. There's complex arrangements of people. Some are closer, some are further away. And then the question is, how is that influence spread in that space, right. Or what are the effects of different algorithms, how to divide that space? Or something like this. So I think this mental model is probably the biggest achievement here. Right. To come up with this basic idea of, I could talk about voting in terms of a space, right? Is that fair to say?",
      "id": "ep_103_ut_42"
    },
    {
      "end": 1530316,
      "speaker": "Nicky Case",
      "start": 1483768,
      "text": "Yeah. Yeah, you can talk about voting in terms of a space. And also, like, another thing that I was hoping for in the interactive. So at the end, you can create your own simulation and you can actually share your own simulation. So I was hoping that people would be able to, like, create counter arguments against me or, like, create additional arguments using the sandbox mode, you know, in the end, like only a couple people did. But, you know, still that's pretty impressive that like someone could use the simulation and like create their own simulation and like, like build off on my argument or build an argument against my arguments using the same model. So yeah, people created their own like miniature explorable explanations in response to my explorable explanation thanks to the tool that I put at the end of the, at the end of the interactive.",
      "id": "ep_103_ut_43"
    },
    {
      "end": 1544396,
      "speaker": "Enrico Bertini",
      "start": 1530380,
      "text": "Yeah, that's nice. How did you come up with this basic, the model itself? Did you try out many alternatives or was it to you immediately clear it should be like a two dimensional space and candidates are arranged?",
      "id": "ep_103_ut_44"
    },
    {
      "end": 1737204,
      "speaker": "Nicky Case",
      "start": 1544580,
      "text": "So, yeah, I have to really give credit to Ka-Ping Yee, who I mentioned earlier, he created this visualization of voting systems. The only visualization I've seen of voting systems in 2013 five, not 2007, created this visualization that brought forth, as you mentioned, that two dimensional axis. So that's where I got that idea. And I mean, you know, people have talked about the political spectrum as a multi dimensional thing before. You know, a lot of people have already known that. You know, it's not just a left right spectrum, there's also a zillion other dimensions. So, yeah, like at least having two dimensions, it seems like, you know, a bare minimum. But yeah, Kaeperny's visualization is the first one I saw that actually really showed how different voting systems like, you know, how, how, how they fare, um, in this visualization. And, and I actually really learned something really important from his visualization. So before, uh, I really knew that instant run off voting was not really that good. Uh, because, um, in the 1960, Kenneth Arrow, a game theorist, proved that any voting system that involves ranking choices, uh, will be flawed in some way. However, his, uh, his analysis, analysis does not apply to approval voting and score voting because in those voting systems, you don't rank it. But anyway, the point is, beforehand I already knew that instant rental voting was not that good. But only with ka Pingyi's visualization did I see how absolutely terrible instant random voting actually is and is the most popular alternative. Australia uses it for their parliament. I'm in Boston right now and I think, sorry, not Boston, but Cambridge. Their local city council uses instant random voting for the mayor. And a few years ago, the UK ran a referendum on whether they wanted to switch over to instant rat off voting for their parliament. And the people rejected it partially because, yeah, instant random voting is really, really complicated and it doesn't really provide that much of a benefit over first pass to post. I mean, you know, it provides benefits like it's more expressive and it's at least slightly immune to the spoiler effect. But it's, it's, I don't think it's a good system and a lot of people disagree with me on this, but yeah, only with this visualization and with, I think what I added to this is with the interaction is showing, you know, with Ka Pngyi's visualization, it's only in a few specific case scenarios. So you could think, oh, maybe he's just cherry picking. But with interacting you can actually choose the different scenarios. You can see that. No, this is true in like a lot of scenarios that alternatives like approval or score would be better than first past the post, but also instant runoff. I also wanted to mention something I need to update in my explore by explanation. Is that in the explore by explanation at the time of writing, Justin Trudeau of Canada, where I'm originally from, I'm originally from Canada, he promised he was going to change Canada over to a new alternative voting system, but he since backed down on that promise. So I need to go back and edit. I need to edit that. I need to like cross out everything I said about that.",
      "id": "ep_103_ut_45"
    },
    {
      "end": 1762538,
      "speaker": "Enrico Bertini",
      "start": 1737704,
      "text": "The world keeps changing. It's horrible, I know. Yeah, that's great. I mean, it's, I think many people are not even aware that there are alternatives to just simple who's your favorite? And then winner takes it all. So I think alone, the fact that there's this variety of voting systems out there is probably for many people already a mind blowing insight.",
      "id": "ep_103_ut_46"
    },
    {
      "end": 1764114,
      "speaker": "Nicky Case",
      "start": 1762706,
      "text": "Yeah, hopefully. Yeah.",
      "id": "ep_103_ut_47"
    },
    {
      "end": 1821604,
      "speaker": "Moritz Stefaner",
      "start": 1764234,
      "text": "Yeah. So, Nicky, one thing I'm curious about is what's your opinion on how the elements that you use in your projects could be used more often in data visualization? I think what happens is that in visualization often you have, first of all, in most of the cases, people create visualizations out of existing data rather than simulations, which is already a big difference from some of the work that you do. And I also really like the way you are using interaction and this idea of playability as a way to learn to discover things and better understand the complexity behind the problem and so on. So how do you think visualization designers and professionals can use some of these elements more often and better in their own projects?",
      "id": "ep_103_ut_48"
    },
    {
      "end": 1838800,
      "speaker": "Nicky Case",
      "start": 1823104,
      "text": "The first thing I want to say is that I find it really weird that I keep getting invited to data vis stuff like this podcast or conferences because I've never actually visualized any real data. It's all been simulated.",
      "id": "ep_103_ut_49"
    },
    {
      "end": 1843024,
      "speaker": "Moritz Stefaner",
      "start": 1838992,
      "text": "Well, that's fine. Doesn't make it not visualization.",
      "id": "ep_103_ut_50"
    },
    {
      "end": 1851180,
      "speaker": "Nicky Case",
      "start": 1845644,
      "text": "It's visualization. It's just, I like to call the stuff I do system visualization.",
      "id": "ep_103_ut_51"
    },
    {
      "end": 1893008,
      "speaker": "Enrico Bertini",
      "start": 1851332,
      "text": "Yeah, right. Yeah. But I think that that's what people find so fascinating. Yeah. Because the original idea of data visualization is to amplify cognition. Like, really give us tools for thinking. And we've had so much focus on just making pictures of data, you know, that this whole idea of let's actively think and figure something out using a visual, like, you know, these manual calculators or sketching as tools for thinking has been totally, like, buried in just, like, cool chart types and so on. And so I think that's why people are so fascinated with your work is because it reintroduces this idea of amplifying cognition.",
      "id": "ep_103_ut_52"
    },
    {
      "end": 2049296,
      "speaker": "Nicky Case",
      "start": 1893096,
      "text": "Yeah, tools for thought. I just love that so much. And, like, thinking about, like, how, like, even, like, you know, like, data visualization. Like, you know, charts and Venn diagrams have been, like, so embedded into our culture and our cultural consciousness that we don't even think about anymore. Like, we say, oh, the stock market went up, and it's like, before, before charts were a thing, the idea of numbers going up never made any sense. Like, you know, numbers could be bigger or smaller, but numbers going upwards, like. Like, actually going in a vertical direction. Like, that made no sense. But it's just so natural to us now. The idea of a chart is so natural to us now that, yeah, we can say, oh, yeah, the number went up, and it's like, a few centuries ago, that would have made no sense whatsoever. So, yeah, like, it is really a tool for thought. And it's not just like, a tool for thought. Like, it actually, it's embedded into our brains. Now, as I mentioned before, as I went on a huge rant about before, learning is not passive. It is an active process. Even if it's just someone is just reading something, they still have to actively construct it back in their own heads. It's not like your neurons in your brain fly out of your mouth and into someone else's ear, and then the neurons, you know, and then your neurons, like, stick into their brain, you know, you don't transmit information like that. Like, people have to actually reconstruct what you've been saying, you know, in their own brains, like, constructing it, you know, rebuilding it, using the assumptions they already have, using the experiences they already know and the stuff already, you know, they have to rebuild stuff not just using the words you said, but also their own background knowledge. And yeah, I feel like, you know, that's why people are really bad at communication, because, you know, they know what they mean. They already have all the background information they have, but, you know, the recipient does not. So, yeah, like, even in, like, a quote unquote passive medium, like text or video or a podcast, you still have to reconstruct it in your head. It's still interactive. So why not bring out this interaction out from your head and into your hands, like, into actually interacting with the thing itself, asking questions. And, I mean, like, this podcast right now, this conversation, like, this is a lot better than me just, like, having a monologue, and it's, like, me rambling, like, a bullet point list of what I feel like your audience should know. Like, we're actually having a conversation. Like, you're asking questions that you did not send me on this list. So I'm. This is actually. This is actually improvised right now. Like, I'm actually improvising this. This was not on the list before. So, yeah, like, with a conversation, it is a lot deeper.",
      "id": "ep_103_ut_53"
    },
    {
      "end": 2051584,
      "speaker": "Enrico Bertini",
      "start": 2049320,
      "text": "It's all along explorable explanation.",
      "id": "ep_103_ut_54"
    },
    {
      "end": 2174112,
      "speaker": "Nicky Case",
      "start": 2051704,
      "text": "This is exploration. We're actually exploring each other right now. So, yeah, like a conversation, I feel like a dialogue is better than the monologue. So that's if I had to, like, have, like, one quote, like, just, like, to sum up my philosophy, a dialogue is better than a monologue. And, yeah, learning is interactive already, so why not bring that out from your head into your hands? So I feel like, yeah, game design is basically applied psychology, so why not use more of that in data visualization or visualizing anything, and I guess, like, to give more concrete examples. The New York Times has done a really great a series called you draw it, where instead of just giving you a graph, it asks you to draw the graph first to put down your expectations on the table, and then it shows you the real data, and it compares your understanding of reality to what reality actually is. One of my favorite examples, they did a huge riot about different epidemics in America, and I knew the opioid epidemic was bad, but I did not know that the opioid epidemic is now killing more people than the AIDS epidemic did at its peak. Like, that was horrifying. And if I were just shown the graph, you know, I probably wouldn't have noticed that. I wouldn't have made a connection in my mind. But by actually having to draw it and having my expectations disrupted, I was in a more heightened state of mind. When you're surprised, when you're expectations are violated, then you're like, your ears are perked up, your eyes actually dilate, you're more attentive, and it actually sinks in deeper. There's this quote I really like from Dan Mayer, who's talked about this idea called expectation failure, which is this idea from educational psychology, where if you want to teach someone, you have to surprise them first. And the way he phrases it, this is a quote I really like. First you have to give someone the headache, then you can sell them the aspirin. That's perfect.",
      "id": "ep_103_ut_55"
    },
    {
      "end": 2174968,
      "speaker": "Moritz Stefaner",
      "start": 2174248,
      "text": "Yeah.",
      "id": "ep_103_ut_56"
    },
    {
      "end": 2204094,
      "speaker": "Nicky Case",
      "start": 2175136,
      "text": "So, yeah, there's lots of things you could do with interactive visualization. You could do like, yeah, they could have a dialogue, they could have the expectations violated. They could ask what if questions. They could create their own solutions. They could create counter examples that the author didn't think of. There's so many possible functions you can actually do. That. Yeah. Just does not really exist in the space right now that I feel like would be really beneficial if we actually did this.",
      "id": "ep_103_ut_57"
    },
    {
      "end": 2275884,
      "speaker": "Enrico Bertini",
      "start": 2204754,
      "text": "I have a practical question because I find this format so fascinating, and a lot of people love it, and I think, especially in journalism, since snowfall, the prototype for the very long page with lots of different interactive elements and text done by the New York Times, I guess five years ago or something, it has become a genre. But from a practical point of view, what I find so hard is how to design that narrative flow, like how to make sure people are drawn into the piece and then sort of engage with the individual sections in a good way, but also continue to read, but also take away the more subtle and nuanced points. How do you design that journey for the user? And also, do you, do you track, for instance, if most of the people just get stuck on the first simulation and never see the second one or something like this? Do you track user behavior? And also, what are your tricks there? Or what are techniques you feel have proven useful to make sure people keep going and get what you try to get across?",
      "id": "ep_103_ut_58"
    },
    {
      "end": 2454664,
      "speaker": "Nicky Case",
      "start": 2276784,
      "text": "Yeah. Thank you for this question, because now this is the part that can be actually practically useful to you, the listener. Yes, yes. Actual practical tips. So the way I go about it, at least this is for me personally, is I act like a tour guide, for example, like, there's this really great, you know, system or simulation or idea that I want to show off, but I want, you know, to show it off in a more or less linear ish way, but with small areas for exploration. I'm not against linear passive, quote unquote passive, you know, stuff. You know, I use text all the time, but I feel like you know, there's a pros and cons, strengths and weaknesses to both interactives and to text. And I feel like what explorable explanations can really, really do is like combine the two so that where text has its weakness and the weakness of text is that you can't explore it, interactives can step in, but where there's the weakness of interactives, which is, you know, it's unguided and, you know, you need at least some structure to be able to actually understand what you're doing, might get lost. Yeah. And, like, sometimes you just have to use text. You can't visualize everything. Like, I don't know, how would you visualize a concept like historical dialecticism or. I don't know. That's the most obscure thing I can think of, but, yeah, so, like, yeah, by switching back and forth between text and interaction, you can have the best of both worlds. So the way I go about it, you know, practical tip number one is act like you're a tour guide. And another practical tip is I try to start with a simulation as quickly as possible. I need to use like some text to like set up what the simulation is. But I try to like start with a simulation as quickly as possible so that one people that sort of immediately, you know, people have never seen an explore by explanation before that they know, oh, this is interactive. So like, you know, this is not going to be like a normal. So I need to be more engaged so that, you know, that sets the expectations up front. But also, you know, it's a good taste of like, what's to come. So, you know, act like a tour guide, show them the interactive thing first and then like give them like some context and like show them another part of the interactive thing and then give them more context. So, yeah, well, what I do in my interactive explore by explanations is that it's really usually only one simulation, but each instance of the simulation is a different part of the simulation or it's a different, you know, it uses different variables. So, yeah, I would like to think that, you know, most of my work is it's just one simulation or like one system. Yeah, one system I'm trying to tell a story about. Yeah, it's a story about systems. So, yeah, it's once, it's only one system I'm trying to teach to tell you a story about, but I only show you one part of the system at a time. And by the end, I usually have a sandbox mode where you can play with the entire system because by, by that point you already understand all the parts and also how the parts actually interact with each other.",
      "id": "ep_103_ut_59"
    },
    {
      "end": 2465684,
      "speaker": "Enrico Bertini",
      "start": 2454824,
      "text": "But you built the sandbox mode first, more or less to figure out what the best basic model is, and then you strip it down for the beginning of the piece. Is that right?",
      "id": "ep_103_ut_60"
    },
    {
      "end": 2467360,
      "speaker": "Nicky Case",
      "start": 2466544,
      "text": "Come think about it.",
      "id": "ep_103_ut_61"
    },
    {
      "end": 2470120,
      "speaker": "Enrico Bertini",
      "start": 2467392,
      "text": "Yeah, it sounded a bit like that.",
      "id": "ep_103_ut_62"
    },
    {
      "end": 2534594,
      "speaker": "Nicky Case",
      "start": 2470232,
      "text": "That sounds sort of how I go about it. It is very hard. Creating an entire sandbox is really hard. So I tend not to do that first. I guess what I do is kind of go, I think I start in the middle, in the very beginning. It's a very simple simulation and the very end is the full sandbox. I think my first prototype is usually something that's right in the middle, and then I prototype that and see how people like that. And then when I want to create a story about that, first I have to find the small part, the subsection of this simulation that might be the best, like introductory part, and then also like trying to think, you know, you know, once people have played the simulation, oh, what else do they want to see? What other variables do they want, what other rules did they want to apply? Like how else do they want to explore the system? And then I built that up into the, into the sandbox mode. So, yeah, that's a good point. I never thought about this before. I kind of start in the middle and then I work downwards to like what is the simplest part that's the most interesting? And then I work upwards to what other stuff can I add to this that people might want to know about and play with?",
      "id": "ep_103_ut_63"
    },
    {
      "end": 2559058,
      "speaker": "Moritz Stefaner",
      "start": 2534694,
      "text": "Yeah, and maybe you can also briefly comment on what kind of technologies and methods you used to do that. I know that some of our listeners like the geeky stuff behind the projects that we described. So do you have any favorite tools or programming languages? And how does the process work typically?",
      "id": "ep_103_ut_64"
    },
    {
      "end": 2596142,
      "speaker": "Nicky Case",
      "start": 2559226,
      "text": "So for this question, my answer is disappointing because it's incredibly simple. I just use JavaScript and HTML five. I don't actually even use libraries that often because the simulations I do have to be really custom. So I don't even use D3. I don't even use jquery. Like I just write it all myself. Mostly like once in a while I use a very small like 0.3 kb library because I don't feel like writing my own messaging framework. Yeah, but other than that, yeah, like specific tools, sublime text, Google Chrome. That's it.",
      "id": "ep_103_ut_65"
    },
    {
      "end": 2597278,
      "speaker": "Moritz Stefaner",
      "start": 2596318,
      "text": "Yeah, that's great.",
      "id": "ep_103_ut_66"
    },
    {
      "end": 2605314,
      "speaker": "Nicky Case",
      "start": 2597406,
      "text": "Yeah. Oh, actually I guess I also do draw my art in Adobe Flash ironically.",
      "id": "ep_103_ut_67"
    },
    {
      "end": 2606394,
      "speaker": "Enrico Bertini",
      "start": 2605614,
      "text": "Wow.",
      "id": "ep_103_ut_68"
    },
    {
      "end": 2635454,
      "speaker": "Nicky Case",
      "start": 2607254,
      "text": "That's how I got into making games. I started off in Flash, and so for some reason, Adobe Flash's keyboard shortcuts and interface is completely different from, for Adobe Flash than all of its other products. So I can't transfer, I can't easily go over to illustrator. I have to keep using Flash because I'm kind of locked in now. Even though my stuff is all HTML five, I still make my art in Flash.",
      "id": "ep_103_ut_69"
    },
    {
      "end": 2646210,
      "speaker": "Enrico Bertini",
      "start": 2635794,
      "text": "And it was made to do like interactive animations. It's sort of actually, it's one of the only tools that was actually conceived for that purpose.",
      "id": "ep_103_ut_70"
    },
    {
      "end": 2680250,
      "speaker": "Nicky Case",
      "start": 2646322,
      "text": "Yeah, this is kind of sad, but I feel like Flash is still, it's a really good tool and like, I cannot, there is no, like even HTML five space. I can't think of any, yeah, there's no tool like, Flash was really great. You could just like jump in, draw something, put in some code, and you can make your own, choose your own adventure game. Like that was really simple. Like, there is no such equivalence for HTML five. What, seven years later, there is still nothing as like accessible as flash for HTML five. There really isn't.",
      "id": "ep_103_ut_71"
    },
    {
      "end": 2695794,
      "speaker": "Enrico Bertini",
      "start": 2680402,
      "text": "And that makes it really hard. I feel for people who just have a cool idea and just want to get started quickly. To get over the threshold and understand how to do cool stuff on the web today, you have to know about 20 different libraries, or at least it feels like.",
      "id": "ep_103_ut_72"
    },
    {
      "end": 2696010,
      "speaker": "Nicky Case",
      "start": 2695834,
      "text": "Right?",
      "id": "ep_103_ut_73"
    },
    {
      "end": 2697974,
      "speaker": "Enrico Bertini",
      "start": 2696042,
      "text": "And development tools.",
      "id": "ep_103_ut_74"
    },
    {
      "end": 2703874,
      "speaker": "Nicky Case",
      "start": 2698994,
      "text": "That's also partially why I don't use libraries, because there's a new one every.",
      "id": "ep_103_ut_75"
    },
    {
      "end": 2706654,
      "speaker": "Enrico Bertini",
      "start": 2704034,
      "text": "Always around the corner every few months.",
      "id": "ep_103_ut_76"
    },
    {
      "end": 2723856,
      "speaker": "Nicky Case",
      "start": 2707904,
      "text": "Okay. To be fair, there's like a few libraries I use over and over again. Min pub sub, which is that messaging publish subscribe framework. And also for the more graphic intensive visualizations I use. I use Pixie Js because optimizing graphics is hard.",
      "id": "ep_103_ut_77"
    },
    {
      "end": 2727184,
      "speaker": "Enrico Bertini",
      "start": 2724000,
      "text": "Yeah. And the code is just like flash. And so I love pixie.",
      "id": "ep_103_ut_78"
    },
    {
      "end": 2727352,
      "speaker": "Moritz Stefaner",
      "start": 2727224,
      "text": "Yeah.",
      "id": "ep_103_ut_79"
    },
    {
      "end": 2749564,
      "speaker": "Nicky Case",
      "start": 2727368,
      "text": "So Pixie Js is just like flash. I think maybe that's why I love it, because it's like maybe I'm just like lying to myself. It's like, oh, it's much more efficient. No, maybe it's just nostalgia value that I'm just using this library. I mean, it is very efficient, but maybe it also is partially just nostalgia. You know, dot go to and stop frame. It's like ah, my childhood.",
      "id": "ep_103_ut_80"
    },
    {
      "end": 2766806,
      "speaker": "Moritz Stefaner",
      "start": 2751544,
      "text": "Okay, so maybe we can talk a little bit about the future. So do you, do you have any, any projects you're working on right now? So what's gonna coming up next? We are curious to hear what your plans are.",
      "id": "ep_103_ut_81"
    },
    {
      "end": 2867246,
      "speaker": "Nicky Case",
      "start": 2766990,
      "text": "Future for me or future for explorer by explanations, both you choose. All right. Yeah, because I was thinking I'm going to start with the future for explore by explanations because we were talking about tools just now and how this complete lack of them. I feel like the biggest hurdle right now is that there are basically no good tools. And I've made a couple tools, like, they're very, very limited. So, yeah, there are no good tools right now for making, like, these kind of interactive things. And maybe there won't ever be a general purpose explore by explanation tool. Like, maybe there'll be a tool for making you draw it. I've made tools for specifically simulate, creating simulations about cellular automata and also creating simulations of feedback loops. So maybe in the future there'll just be a whole bunch of very domain specific tools that people can then, like, mix and match. Because, like, the nice thing about explore by explanations is that, you know, you can just embed a simulation from anywhere. So maybe you can embed a simulation. That's one of them. It's a feedback loop. Another one is a cellular automata. Another one is a socratic dialogue. Another one is you draw it. Like, maybe that. Yeah, maybe that. Maybe that would be the future. Like a whole bunch of, like, specific domains, specific tools, because the. Nice. So there's a trade off between, you know, how accessible something is and how domain general it is. And the domain general tool is just programming. So maybe in the future there'll be more domain specific tools for different kinds of interactions, like playing with feedback loops or you draw it playing with graphs.",
      "id": "ep_103_ut_82"
    },
    {
      "end": 2890692,
      "speaker": "Enrico Bertini",
      "start": 2867310,
      "text": "I mean, there is different genres of simulations or different types of things. And so, yeah, probably, like, if something is more like forces and particle based, or more like, I know, zero sum games. So there's these types of systems. So probably if you had one great environment to work on one of those, that would be pretty cool.",
      "id": "ep_103_ut_83"
    },
    {
      "end": 2895436,
      "speaker": "Nicky Case",
      "start": 2890748,
      "text": "Yeah. Kind of like a swiss army knife. Swiss army knife of a whole bunch of different tools that you just carry around.",
      "id": "ep_103_ut_84"
    },
    {
      "end": 2898724,
      "speaker": "Enrico Bertini",
      "start": 2895500,
      "text": "Yeah. Did you follow Mike Bostock's work on D3 express?",
      "id": "ep_103_ut_85"
    },
    {
      "end": 2908424,
      "speaker": "Nicky Case",
      "start": 2898844,
      "text": "Yeah. Yeah. Like, oh, it's like so cool. And I'm looking, I mean, like, he showed off this amazing thing and at the end he says, well, it's not out yet.",
      "id": "ep_103_ut_86"
    },
    {
      "end": 2912228,
      "speaker": "Enrico Bertini",
      "start": 2909564,
      "text": "Here's your headache. No aspirin for you.",
      "id": "ep_103_ut_87"
    },
    {
      "end": 2915818,
      "speaker": "Nicky Case",
      "start": 2912356,
      "text": "Yeah, nothing for you yet. But, yeah, I'm so excited for it.",
      "id": "ep_103_ut_88"
    },
    {
      "end": 2967704,
      "speaker": "Enrico Bertini",
      "start": 2915866,
      "text": "Yeah, no, but he's working on it. And there is a beta, I think, already in the works, and some people have been using it. And the idea is maybe for the listeners is to have an interactive page more or less an interactive environment. And basically you have little code lines and you define variables as you would do in programming, but everything's connected in a reactive way in the sense that if you define when something depends on something else, this dependency will stay. And if you change the value of the origin, it will propagate through your network of dependencies, basically. So it sounds perfect for building really cool interactive simulations and explorable explanations and so on. So I would be quite interested to see what you would be doing with a playground like this.",
      "id": "ep_103_ut_89"
    },
    {
      "end": 3005512,
      "speaker": "Nicky Case",
      "start": 2968824,
      "text": "Okay, so, yeah, that's one barrier is the lack of tools. Another one is, I guess, I guess more meta is like, how do you make money doing this? Because it's a lot, because, you know, if you're just writing text, that's like, you know, you can be a hobbyist, blogger and, you know, right, I mean, you still need money, or at least you can just do it as a hobby. But, you know, even if you're doing it as a job, you know, it's less costly than programming an entire simulation. So. So yeah, that's another thing that's kind of a missing, like, you know, like actual economics here. So the tools, the economics, what else?",
      "id": "ep_103_ut_90"
    },
    {
      "end": 3012944,
      "speaker": "Enrico Bertini",
      "start": 3005648,
      "text": "Also, I feel like, how do you do it currently? Maybe? Like how do you, how do you finance all this work that you, that you put into your pieces?",
      "id": "ep_103_ut_91"
    },
    {
      "end": 3052796,
      "speaker": "Nicky Case",
      "start": 3013024,
      "text": "Thanks for asking me again, because you asked this earlier, but now this is a good opportunity for me to plug in my Patreon. I am https://www.patreon.com/ncase. That's the letter n and encased as in the word Nicki Case. Yeah. So that's how I'm mostly financing myself. I'm not quite breakeven yet, but yeah, it is really helping me not plummet to my doom as quickly. So, yeah, Patreon is a real lifesaver for me right now. So that's how I'm financing myself right now. Thank you for asking. It's a good plug. Patreon.com n case.",
      "id": "ep_103_ut_92"
    },
    {
      "end": 3054524,
      "speaker": "Enrico Bertini",
      "start": 3052860,
      "text": "Totally go there immediately.",
      "id": "ep_103_ut_93"
    },
    {
      "end": 3059452,
      "speaker": "Nicky Case",
      "start": 3054564,
      "text": "Stop listening. If you back me $5, you can get a little polygon drawn of you.",
      "id": "ep_103_ut_94"
    },
    {
      "end": 3060396,
      "speaker": "Enrico Bertini",
      "start": 3059588,
      "text": "Look at that.",
      "id": "ep_103_ut_95"
    },
    {
      "end": 3066024,
      "speaker": "Nicky Case",
      "start": 3060500,
      "text": "If you back me $10 per month, you can get a little peep character drawn of you.",
      "id": "ep_103_ut_96"
    },
    {
      "end": 3096302,
      "speaker": "Enrico Bertini",
      "start": 3067404,
      "text": "Yeah, but I think it's a really interesting question because, I mean, you obviously do work that's super valuable, that's super interesting to lots of people. But how can we, yeah, how can we create environments where I think you should naturally be able to live off that? It should be a no brainer in my world, but the question is still like, how can that work? And Patreon is one way, and it's great to see you're really successful there, but maybe it's not the only thing.",
      "id": "ep_103_ut_97"
    },
    {
      "end": 3096878,
      "speaker": "Nicky Case",
      "start": 3096358,
      "text": "Maybe.",
      "id": "ep_103_ut_98"
    },
    {
      "end": 3108312,
      "speaker": "Enrico Bertini",
      "start": 3097006,
      "text": "Yeah, maybe grant or like some foundations can step in. I don't know. I think this, you should be able to live off that, obviously, right? Yeah.",
      "id": "ep_103_ut_99"
    },
    {
      "end": 3154044,
      "speaker": "Nicky Case",
      "start": 3108328,
      "text": "And you brought up environment and that's, I guess, the third thing. So tools like economics, but also like a community and environment because right now it's like a herd of cats. You know, we're a herd of cats. We all do our own thing because, you know, this is what happens when you have a bunch of like independent introverts working on the same idea, is that it's not really a community right now. We follow each other on Twitter and we talk to each other once in a while, but there isn't really a community. I did set up a slack a while back and yeah, there's a small community there, but how can this scale up? I also have a website, explorables, and the ES is es. Yeah, I finally got that good domain, thanks to a friend of a friend.",
      "id": "ep_103_ut_100"
    },
    {
      "end": 3156468,
      "speaker": "Enrico Bertini",
      "start": 3154204,
      "text": "We do the same trick with data story domain.",
      "id": "ep_103_ut_101"
    },
    {
      "end": 3157344,
      "speaker": "Moritz Stefaner",
      "start": 3156516,
      "text": "Exactly.",
      "id": "ep_103_ut_102"
    },
    {
      "end": 3161144,
      "speaker": "Enrico Bertini",
      "start": 3159124,
      "text": "The Spanish domains are popular.",
      "id": "ep_103_ut_103"
    },
    {
      "end": 3172074,
      "speaker": "Nicky Case",
      "start": 3161874,
      "text": "Good. It's a good domain, so. But yeah, I really need to update a website. I haven't updated it in a year, so I need to update it so that, you know, I can actually be little nucleus points for.",
      "id": "ep_103_ut_104"
    },
    {
      "end": 3177114,
      "speaker": "Enrico Bertini",
      "start": 3172114,
      "text": "But it's really cool. There's a lot of projects and a lot of explanations how to do explorable.",
      "id": "ep_103_ut_105"
    },
    {
      "end": 3213956,
      "speaker": "Nicky Case",
      "start": 3177194,
      "text": "And like, this is tutorials, that's the other thing. There are no, there are very few tutorials on how to actually make an exploitable explanation. And it's actually, this is the kind of thing I really feel bummed out about, like, about the new, like blogging platforms. Like, I mean, like maybe, maybe again, it's just nostalgia and I'm just whining about, oh, the good old days where everyone had RSS feeds. Actually, no, I feel like RSS feeds are still a good thing. You know, they're still a good thing, but, um, it's really hard. You know, you can't embed iframes in medium or in Tumblr, so. Yeah, like you can't do explore by explanations on those.",
      "id": "ep_103_ut_106"
    },
    {
      "end": 3214804,
      "speaker": "Enrico Bertini",
      "start": 3214120,
      "text": "That's true.",
      "id": "ep_103_ut_107"
    },
    {
      "end": 3263022,
      "speaker": "Nicky Case",
      "start": 3214884,
      "text": "But you know, compared to like, say, you know, a WordPress, you can do whatever you want on a WordPress. Yeah, like short of like WordPress, there aren't really any blogging platforms that let you embed interactives like Facebook lets you embed videos and so does Twitter, but you can't really embed a game, you know, so I mean, maybe it's just me again, being nostalgic for Web 1.0 with, you know, with WordPress and setting up your own drupal instance and RSS feeds, you could actually modify stuff. If you wanted to embed a game in your own blog, you could do that. But, you know, you can't really do that nowadays. So I don't know, like, yeah, first of all, we need like a tutorial. How do you make your own explorable explanations given that none of the mainstream platforms actually allow you to do this?",
      "id": "ep_103_ut_108"
    },
    {
      "end": 3274892,
      "speaker": "Moritz Stefaner",
      "start": 3263158,
      "text": "So maybe there will be even more people in the future creating this kind of explorables. So if any of our listeners is interested in that, maybe you can briefly comment on how one could get started with this.",
      "id": "ep_103_ut_109"
    },
    {
      "end": 3276492,
      "speaker": "Nicky Case",
      "start": 3274988,
      "text": "Yes, we explore explanations.",
      "id": "ep_103_ut_110"
    },
    {
      "end": 3277852,
      "speaker": "Moritz Stefaner",
      "start": 3276628,
      "text": "Yeah, yeah.",
      "id": "ep_103_ut_111"
    },
    {
      "end": 3278156,
      "speaker": "Nicky Case",
      "start": 3277908,
      "text": "Okay.",
      "id": "ep_103_ut_112"
    },
    {
      "end": 3284796,
      "speaker": "Moritz Stefaner",
      "start": 3278180,
      "text": "Okay, so say that one of our listeners is interested in starting never tried before. What would be the first steps?",
      "id": "ep_103_ut_113"
    },
    {
      "end": 3466746,
      "speaker": "Nicky Case",
      "start": 3284860,
      "text": "Yeah, okay, good. More pragmatic, practical advice. All right, so, all right, first step is, all right, given that there are no blogging platforms where you can actually embed iframes, GitHub pages has been really, really good to me. It's, you know, it's free, which is awesome, and it's really relatively easy to set up. So go to GitHub, learn how to do GitHub pages. So what you do is just, you create your own HTML files and you can just, you can embed whatever you want. It's not, you know, it's not as simple as having a WordPress, actually. If you have a WordPress, use that. And that might actually be simpler if you have an iframe and all that. But actually, no, even if you have an iframe, yeah, you still want to have it linked to a simulation and you would want to host that simulation somewhere. So, you know, GitHub pages is a really great way to host simulations or interactive stuff for free. So yeah, use GitHub pages. You can use GitHub pages entirely, which I do, or you can use WordPress and a GitHub page. So that's the first step. And I guess that's a technical step. And I guess in terms of like practical or at least like in terms of design, as I mentioned earlier, like going for the tour guide method, like really works for me. And I've seen other methods done, like New York Times is a more of a surprising expectation failure, give you the headache and then give you the aspirin kind of a design pattern. So yeah, I guess just like look at a lot of explorer explanations and see what design patterns and what story patterns stand out to you. So my story pattern that I go to as a default is the tour guide story pattern. New York Times goes for that kind of surprise, you, story pattern. Some other explorables I've seen are more game like. They're more traditionally quote unquote game like, yeah, so, like, yeah, so that's the other step, like figuring out what patterns work for you. And I guess, like, the third step is also like actually figuring out what you want to talk about, at least for me, because I do a lot of, like, simulation based stuff. The stuff that works best for me is science related stuff. Like there, are there, people have already built simulations. So in epidemiology, people, the CDC already uses simulations to help predict and prevent epidemics. So all I need to do is just like, take that simulation, strip out the complicated, like stuff, and just get the, like, boil it down to its gist and then present that. But, you know, it doesn't have to be science stuff or hard science stuff. You can explain, like the New York Times, like, explains data using the you draw it method. I've seen, I can't remember where, but I saw this philosophy explorable explanation where it's basically a socratic dialogue. It has a dialogue with you about the nature of knowledge and stuff. And actually, there's one that was pretty recent. The MIT media lab did another kind of philosophy explorable about the trolley problem, but with soft.",
      "id": "ep_103_ut_114"
    },
    {
      "end": 3468346,
      "speaker": "Moritz Stefaner",
      "start": 3466810,
      "text": "Oh, yeah, I remember that one.",
      "id": "ep_103_ut_115"
    },
    {
      "end": 3588064,
      "speaker": "Nicky Case",
      "start": 3468450,
      "text": "Yeah, it's like, like, you know, self driving cars will have to decide, quote unquote, decide who gets to live or die in a, in a very edge case scenarios like, like that. So we're going to have to code our morality. We're going to have to explicitly put down our morality into code. So how are we going to do that? So, yeah, so it's not just like science stuff or math stuff. I've seen a lot of explorables about math, but, you know, you can also do stuff about, like, real world data, which in the New York Times says you can do stuff about philosophy or, like, other strange news events. Oh, there's this one I love from the BBC. I would say it had a little bit of a promise of execution, but it was a choose your own adventure about being a syrian refugee. And I actually learned a lot about what choices and trade offs do I have to make? Do I want to go directly across the ocean, which is more direct, which means I have to cross fewer borders, but there's a higher chance of me dying at sea. Alternatively, do I want to, you know, try to go through turkey or like, you know, go through other countries, which, you know, again, has the trade off is, you know, I could be rejected at the border, I could be sent back, but at least, you know, I probably won't drown. And that's, I learned a lot about from that, from that explorable. So, yeah, so, like, yeah, it's not just science or math, which I think are awesome, but, you know, you can also explain data. You can explore real world events and news stories. You can explore and explain philosophy, and, yeah, you can explore and explain psychology, your own stories. This field of explorables is still in such an early state that I can't even give you that specific of advice because we don't know what works and what doesn't. It's still really experimental. So you, dear listener, might be able to find out a new field or a new application for explorables that no one has even tried yet. So good luck.",
      "id": "ep_103_ut_116"
    },
    {
      "end": 3605528,
      "speaker": "Enrico Bertini",
      "start": 3589844,
      "text": "I'm sure there's loads of people out there and it is an amazing field. And I think take some time when you go to explorable ds because you will spend a good hour at least just playing with all these different simulations and interesting.",
      "id": "ep_103_ut_117"
    },
    {
      "end": 3606736,
      "speaker": "Nicky Case",
      "start": 3605576,
      "text": "Oh, come think about it, I've never.",
      "id": "ep_103_ut_118"
    },
    {
      "end": 3608088,
      "speaker": "Enrico Bertini",
      "start": 3606760,
      "text": "Seen an, it just sucks you in.",
      "id": "ep_103_ut_119"
    },
    {
      "end": 3610352,
      "speaker": "Nicky Case",
      "start": 3608136,
      "text": "I've never seen an explorable about art.",
      "id": "ep_103_ut_120"
    },
    {
      "end": 3610936,
      "speaker": "Enrico Bertini",
      "start": 3610528,
      "text": "See?",
      "id": "ep_103_ut_121"
    },
    {
      "end": 3612664,
      "speaker": "Nicky Case",
      "start": 3611000,
      "text": "Yeah, see? So that's a good one.",
      "id": "ep_103_ut_122"
    },
    {
      "end": 3612992,
      "speaker": "Enrico Bertini",
      "start": 3612704,
      "text": "Yeah.",
      "id": "ep_103_ut_123"
    },
    {
      "end": 3688798,
      "speaker": "Nicky Case",
      "start": 3613048,
      "text": "Like, I don't know, like maybe art styles. Yeah, different, like, different art styles. Like, ooh, an explorable by composition. Like, you could try out different compositions and see how crappy a non composed painting looks. Or, or maybe animation. Like, what if, you know, different animation? Like, you know, actually, I guess it would be pretty useful for web designers, like, seeing different animation styles. Ease in, ease out. Disney was all about, not Walt Disney. Will Eisner talked about the twelve principles of animation. There's follow through, there's ease in and ease out, there's anticipation. So what if you change all the parameters of that? What if you got rid of different rules? What if you broke the rules? Because some animators, like, I don't know, John Kricfalusi, totally break those rules. Their animation does not look anything like Disney. It's all twitchy and creepy. And how would that play out? So I've never seen an explorable about art. Or actually, I have seen an explorer about music. So there's another application. Yeah, you could do. Yeah. So the sky is the limit. And even that's probably not the limit. So, you know, art, science, philosophy, stories, news, data, you know, do whatever.",
      "id": "ep_103_ut_124"
    },
    {
      "end": 3689758,
      "speaker": "Moritz Stefaner",
      "start": 3688846,
      "text": "Pretty much anything.",
      "id": "ep_103_ut_125"
    },
    {
      "end": 3710014,
      "speaker": "Nicky Case",
      "start": 3689846,
      "text": "It's so unexplored. So do anything. I don't know if I would say anything quite yet because, you know, how would I make a game about historical dialecticism? I don't know. You probably could. You probably actually could. Again, going for the. I just keep picking on historical dialecticism for some reason. But, uh, yeah, so try whatever.",
      "id": "ep_103_ut_126"
    },
    {
      "end": 3712674,
      "speaker": "Enrico Bertini",
      "start": 3710054,
      "text": "In six weeks, you will have a website up on it.",
      "id": "ep_103_ut_127"
    },
    {
      "end": 3716034,
      "speaker": "Nicky Case",
      "start": 3713934,
      "text": "Historical dialectic talents accepted the game.",
      "id": "ep_103_ut_128"
    },
    {
      "end": 3733974,
      "speaker": "Enrico Bertini",
      "start": 3716174,
      "text": "Yeah. Sorry, I think we have to wrap it up soon. We're already quite past our usual time. But it's been amazing chatting with you. I'm sure our listeners will directly go to your page and try out all the cool things you have produced. And, yeah, maybe chip in on Patreon if you.",
      "id": "ep_103_ut_129"
    },
    {
      "end": 3747756,
      "speaker": "Nicky Case",
      "start": 3737994,
      "text": "And that's Patreon. Patreon. And while you're at it, go to patreon.com Datastories unplugged.",
      "id": "ep_103_ut_130"
    },
    {
      "end": 3749324,
      "speaker": "Enrico Bertini",
      "start": 3747780,
      "text": "That's a good one too. Yeah.",
      "id": "ep_103_ut_131"
    },
    {
      "end": 3754252,
      "speaker": "Nicky Case",
      "start": 3749404,
      "text": "Go to patreon.com Datastories and throwcoins.",
      "id": "ep_103_ut_132"
    },
    {
      "end": 3755636,
      "speaker": "Moritz Stefaner",
      "start": 3754308,
      "text": "That's a nice combo.",
      "id": "ep_103_ut_133"
    },
    {
      "end": 3761876,
      "speaker": "Enrico Bertini",
      "start": 3755780,
      "text": "It's perfect karma combo. Excellent. Thanks so much, Nicky.",
      "id": "ep_103_ut_134"
    },
    {
      "end": 3762764,
      "speaker": "Moritz Stefaner",
      "start": 3761940,
      "text": "Great work.",
      "id": "ep_103_ut_135"
    },
    {
      "end": 3767076,
      "speaker": "Enrico Bertini",
      "start": 3762884,
      "text": "We can't wait to see what you come up with next. And, yeah, yeah.",
      "id": "ep_103_ut_136"
    },
    {
      "end": 3767868,
      "speaker": "Nicky Case",
      "start": 3767100,
      "text": "Thanks for having me.",
      "id": "ep_103_ut_137"
    },
    {
      "end": 3770344,
      "speaker": "Enrico Bertini",
      "start": 3767916,
      "text": "Really interesting thoughts and. Yeah, thanks so much.",
      "id": "ep_103_ut_138"
    },
    {
      "end": 3772456,
      "speaker": "Moritz Stefaner",
      "start": 3770384,
      "text": "Thank you. Bye bye. Bye bye.",
      "id": "ep_103_ut_139"
    },
    {
      "end": 3773324,
      "speaker": "Nicky Case",
      "start": 3772480,
      "text": "Bye bye.",
      "id": "ep_103_ut_140"
    },
    {
      "end": 3797944,
      "speaker": "Enrico Bertini",
      "start": 3779944,
      "text": "Are you missing out on meaningful relationships hidden in your data? Unlock the whole story with Qlik sense through personalized visualizations and dynamic dashboards which you can download for free at Qlik dedastories. That's Qlik Datastories.",
      "id": "ep_103_ut_141"
    }
  ],
  "confidence": 0.921119872411239,
  "audio_duration": 3798,
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_status_code": null,
  "webhook_auth": false,
  "webhook_auth_header_name": null,
  "speed_boost": false,
  "auto_highlights_result": null,
  "auto_highlights": false,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_audio_quality": null,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "content_safety": false,
  "iab_categories": true,
  "content_safety_labels": {
    "status": "unavailable",
    "results": [],
    "summary": {}
  },
  "language_detection": false,
  "language_detection_threshold": null,
  "language_confidence": null,
  "custom_spelling": null,
  "throttled": false,
  "auto_chapters": true,
  "summarization": false,
  "summary_type": null,
  "summary_model": null,
  "custom_topics": false,
  "topics": [],
  "speech_threshold": null,
  "speech_model": "best",
  "chapters": [
    {
      "summary": "Are you missing out on meaningful relationships hidden in your data? Unlock the whole story with Qlik sense through personalized visualizations and dynamic dashboards. Welcome to a new episode of data stories.",
      "gist": "Data Stories",
      "headline": "Are you missing out on meaningful relationships hidden in your data",
      "start": 200,
      "end": 81614,
      "id": "ep_103_ch_0"
    },
    {
      "summary": "Moritz: If you enjoy listening to the show, please consider pledging. There's 64 of you already contributing. Once we will reach our goal, we will be able to switch to a show without advertising. So consider helping out and supporting us.",
      "gist": "Patreon Campaign",
      "headline": "If you enjoy listening to the show, please consider pledging to our Patreon campaign",
      "start": 83314,
      "end": 145964,
      "id": "ep_103_ch_1"
    },
    {
      "summary": "Nicki Case is a designer and game developer who creates these really interesting and beautiful interactive simulations on the web. She wants to make games that teach about the complex systems of the world using what we know from game design. She says there's a whole class of projects now that fall into this nice label of explorable explanations.",
      "gist": "What is Explored Explanations?",
      "headline": "Niki is a designer and game developer who helps people understand complex issues",
      "start": 146544,
      "end": 453204,
      "id": "ep_103_ch_2"
    },
    {
      "summary": "Parable of the polygons is a story about how we divide ourselves from the bottom up. Just small, little, seemingly harmless choices can create a harmful world. The project is based off economist Thomas Schellings. It's applicable to urban rural divide in America and Europe.",
      "gist": "Parable of the Polyphons",
      "headline": "Let's talk about some of your projects that explore explorable explanations",
      "start": 453904,
      "end": 704966,
      "id": "ep_103_ch_3"
    },
    {
      "summary": "In parable, the polygons, it's about that. You play with that same simulation that Thomas Schelling played with on that little plane he just created. If done really well, the reader could play with a model or play with something and discover things for themselves. That's what makes simulations really interesting.",
      "gist": "Parable, the polygons and simulations",
      "headline": "Nicky says simulations can help people understand problems at a deeper level",
      "start": 705070,
      "end": 1041178,
      "id": "ep_103_ch_4"
    },
    {
      "summary": "The project aims to explain not just a spoiler effect, but to also explain visually and interactively all the solutions to the problem. People have known about this problem for a century and a half, but we just haven't gotten around to implementing them.",
      "gist": "Building a Better Ballot",
      "headline": "Second project addresses even more complex problem of building a better ballot",
      "start": 1041346,
      "end": 1531844,
      "id": "ep_103_ch_5"
    },
    {
      "summary": "How did you come up with this basic, the model itself? Did you try out many alternatives or was it to you immediately clear it should be like a two dimensional space and candidates are arranged? Only with ka Pingyi's visualization did I see how absolutely terrible instant random voting actually is.",
      "gist": "Comparison of Voting Systems in 2013",
      "headline": "The only visualization I've seen of voting systems in 2013 five, not 2007",
      "start": 1531964,
      "end": 1764530,
      "id": "ep_103_ch_6"
    },
    {
      "summary": "Nicky: The original idea of data visualization is to amplify cognition. And I also like the way you are using interaction and this idea of playability. How do you think visualization designers and professionals can use some of these elements more often and better in their own projects?",
      "gist": "Data Visualization: More Inquiry and Conversation",
      "headline": "Nicky: The original idea of data visualization was to amplify cognition",
      "start": 1764562,
      "end": 2204094,
      "id": "ep_103_ch_7"
    },
    {
      "summary": "How do you design that journey for the user? Do you track user behavior? What are techniques you feel have proven useful to make sure people keep going. By switching back and forth between text and interaction, you can have the best of both worlds.",
      "gist": "Interactive Journalism: The Long Page",
      "headline": "How do you design narrative flow for an interactive explore by explanation",
      "start": 2204754,
      "end": 2543234,
      "id": "ep_103_ch_8"
    },
    {
      "summary": "I just use JavaScript and HTML five. I don't actually even use libraries that often because the simulations I do have to be really custom. Even though my stuff is all HTML five, I still make my art in Flash. To get over the threshold and understand how to do cool stuff on the web, you have to know about 20 different libraries.",
      "gist": "Mixed feelings about coding in HTML 5 and Flash",
      "headline": "Do you have any favorite tools or programming languages",
      "start": 2543354,
      "end": 2749564,
      "id": "ep_103_ch_9"
    },
    {
      "summary": "Future for me or future for explorer by explanations? We are curious to hear what your plans are. The biggest hurdle right now is that there are basically no good tools. Maybe in the future there'll be more domain specific tools. How do you make money doing this?",
      "gist": "Exploring the Future of Explorations by Explanations",
      "headline": "There are no good tools right now for making interactive simulations or explorable explanations",
      "start": 2751544,
      "end": 3108160,
      "id": "ep_103_ch_10"
    },
    {
      "summary": "There aren't really any blogging platforms that let you embed interactives. How do you make your own explorable explanations given that none of the mainstream platforms actually allow you to do this? If any of our listeners is interested in that, maybe you can briefly comment on how one could get started with this.",
      "gist": "What would be the first steps to creating an explorable blog?",
      "headline": "How do you make your own explorable explanations given that none mainstream platforms allow it",
      "start": 3108192,
      "end": 3287380,
      "id": "ep_103_ch_11"
    },
    {
      "summary": "Use GitHub pages to host simulations or interactive stuff for free. You can use GitHub pages entirely, or you can use WordPress and a GitHub page. Figure out what design patterns work for you.",
      "gist": "3 Step Design: Starting with a Simulation",
      "headline": "Use GitHub pages to host simulations or interactive stuff for free",
      "start": 3287452,
      "end": 3396912,
      "id": "ep_103_ch_12"
    },
    {
      "summary": "The stuff that works best for me is science related stuff. You can explore and explain philosophy and psychology. Take some time when you go to explorable ds because you will spend a good hour at least just playing with all these different simulations. This field of explorables is still in such an early state.",
      "gist": "Exploring the Discourse of Explorables",
      "headline": "The first step is figuring out what you want to talk about",
      "start": 3397048,
      "end": 3765372,
      "id": "ep_103_ch_13"
    },
    {
      "summary": "Are you missing out on meaningful relationships hidden in your data? Unlock the whole story with Qlik sense through personalized visualizations and dynamic dashboards. Download for free at Qlik dedastories.",
      "gist": "Qlik Deata Stories",
      "headline": "Are you missing out on meaningful relationships hidden in your data",
      "start": 3765428,
      "end": 3797944,
      "id": "ep_103_ch_14"
    }
  ],
  "disfluencies": false,
  "entity_detection": false,
  "sentiment_analysis": false,
  "sentiment_analysis_results": null,
  "entities": null,
  "speakers_expected": null,
  "summary": null,
  "custom_topics_results": null,
  "episode_num": 103,
  "episode_metadata": {
    "speakers": [
      "Nicky Case",
      "Enrico Bertini",
      "Moritz Stefaner"
    ],
    "WPid": "989",
    "url": "https://datastori.es/podlove/file/4191/s/feed/c/mp3/103-explorable-explanations-with-nicky-case.mp3",
    "episode_title": "Explorable Explanations with Nicky Case"
  }
}