{
  "id": "ded5bab9-280f-47dc-b249-977bd2b7cecd",
  "language_model": "assemblyai_default",
  "acoustic_model": "assemblyai_default",
  "language_code": "en_us",
  "status": "completed",
  "audio_url": "https://datastori.es/podlove/file/3422/s/feed/c/mp3/89-datavis-around-the-world-in-2016.mp3",
  "utterances": [
    {
      "end": 44260,
      "speaker": "Moritz Stefaner",
      "start": 200,
      "text": "Data stories is brought to you by Qlik, who allows you to explore the hidden relationships within your data that lead to meaningful insights. Let your instincts lead the way to create personalized visualizations and dynamic dashboards with Qlik sense, which you can download for free at Qlik Datastories. That's Q l I K. Deatastories. Hey, everyone, it's a new data stories. Hi, Enrico.",
      "id": "ep_89_ut_0"
    },
    {
      "end": 46424,
      "speaker": "Enrico Bertini",
      "start": 44372,
      "text": "Hey. I'm so excited.",
      "id": "ep_89_ut_1"
    },
    {
      "end": 52084,
      "speaker": "Moritz Stefaner",
      "start": 47164,
      "text": "Yes, it's the legendary year review episode once again.",
      "id": "ep_89_ut_2"
    },
    {
      "end": 53620,
      "speaker": "Enrico Bertini",
      "start": 52164,
      "text": "Yeah, yeah.",
      "id": "ep_89_ut_3"
    },
    {
      "end": 58660,
      "speaker": "Moritz Stefaner",
      "start": 53732,
      "text": "And usually we used to have British and an Austrian guy on the show, as you might remember.",
      "id": "ep_89_ut_4"
    },
    {
      "end": 59812,
      "speaker": "Enrico Bertini",
      "start": 58772,
      "text": "Yeah, yeah.",
      "id": "ep_89_ut_5"
    },
    {
      "end": 63664,
      "speaker": "Moritz Stefaner",
      "start": 59868,
      "text": "We thought that was pretty exotic. But this year we want to step it up a bit.",
      "id": "ep_89_ut_6"
    },
    {
      "end": 78622,
      "speaker": "Enrico Bertini",
      "start": 65254,
      "text": "Yeah. So we decided to go around the world for the first time. So we have been talking with a total of six people from many different countries. Right, Moritz?",
      "id": "ep_89_ut_7"
    },
    {
      "end": 99176,
      "speaker": "Moritz Stefaner",
      "start": 78758,
      "text": "Yeah, and I mean, in the past, we've always been very euro and us centric, which is, you know, sort of natural. This is where we're based. This is what we're looking at. But we would just like to learn a bit more about the rest of the world. So, yeah, we talked to six different people. We have Christina from Hungary. We have blaise from Nigeria. We have Simone from Brazil.",
      "id": "ep_89_ut_8"
    },
    {
      "end": 110244,
      "speaker": "Enrico Bertini",
      "start": 99360,
      "text": "And we have Nikita from western Siberia, Simon from Australia, and Jane from Hong Kong. So it's quite a trip.",
      "id": "ep_89_ut_9"
    },
    {
      "end": 145382,
      "speaker": "Moritz Stefaner",
      "start": 111584,
      "text": "Lots of miles. We are doing it all for the miles. And, yeah, we also asked all of them what their local scenes look like, what they thought were the most significant developments. And, yeah, we were super curious to hear what they'll have to say. And I hope you are curious, too. And we'll just play the short interviews with them, and at the end, we'll come back and sort of wrap it up together. So first up is Christina. And here we have Christina. Christina, can you tell us who you are and where you live?",
      "id": "ep_89_ut_10"
    },
    {
      "end": 169110,
      "speaker": "Krisztina Szűcs",
      "start": 145518,
      "text": "Hi. I live in Budapest, Hungary, and I'm a data visualization designer. I graduated as a graphic designer, and I just started to work at Ericsson R and D center in Budapest, and I'm creating data visualization for dashboards. I also teach data visualization course at the Central European University here in Budapest.",
      "id": "ep_89_ut_11"
    },
    {
      "end": 178894,
      "speaker": "Moritz Stefaner",
      "start": 169222,
      "text": "Yeah, and we should also mention Christina is also well known for her very original and crafty data visualizations. You might have seen the Little Red Riding Hood visualization, I recall.",
      "id": "ep_89_ut_12"
    },
    {
      "end": 179674,
      "speaker": "Krisztina Szűcs",
      "start": 178974,
      "text": "Thanks.",
      "id": "ep_89_ut_13"
    },
    {
      "end": 189784,
      "speaker": "Moritz Stefaner",
      "start": 180094,
      "text": "It was a really nice one about the intercultural difference of how the same fairy tale is interpreted in different cultures. Right. Or in different language versions.",
      "id": "ep_89_ut_14"
    },
    {
      "end": 206744,
      "speaker": "Krisztina Szűcs",
      "start": 190164,
      "text": "Yeah, different language versions. So maybe it's the different origins, because I think maybe a few of them were from France, but in the end it was maybe more like back in time than in different countries.",
      "id": "ep_89_ut_15"
    },
    {
      "end": 221738,
      "speaker": "Moritz Stefaner",
      "start": 207044,
      "text": "Exactly. Yeah, it's a very nice one. So Christina, how is the data visualization seen where you live in Budapest and in Hungary in general, what's your perception? How does it compare to the other countries around or the rest of the world?",
      "id": "ep_89_ut_16"
    },
    {
      "end": 294460,
      "speaker": "Krisztina Szűcs",
      "start": 221826,
      "text": "Well, most data visualizations here are on nonprofit news sites, and they are creating visualizations about the work of the government. They are investigating the work of the government. So corruption is a big problem here in Hungary, and they usually create visualizations about maybe the relationships of the representatives of the parliament, or just about spending of the public money. So this is one thing that is really big, and the other one is that I found interesting is because I used to go to an art and design university, and I know that this generative graphic design is very popular right now. So some of the designers use real data and the output starts to look like a data visualization, a real data visualization. So there are explanations behind them, and I think sooner or later some of them will become data visualization designers. I can give an example for this, because I have a very interesting one.",
      "id": "ep_89_ut_17"
    },
    {
      "end": 296184,
      "speaker": "Enrico Bertini",
      "start": 294532,
      "text": "Yeah, please go ahead.",
      "id": "ep_89_ut_18"
    },
    {
      "end": 322300,
      "speaker": "Krisztina Szűcs",
      "start": 297444,
      "text": "I remember that there was a brand identity design, and it contained a logo, which was a house and shadow of the house, and it was about solar energy, and the shadow changed based on what time and what date. You looked at the logo on the side. So I think it was really, it was a great example for this.",
      "id": "ep_89_ut_19"
    },
    {
      "end": 332560,
      "speaker": "Enrico Bertini",
      "start": 322372,
      "text": "So what do you think are the major developments or projects in this year in Budapest, or even in general around the world?",
      "id": "ep_89_ut_20"
    },
    {
      "end": 345376,
      "speaker": "Krisztina Szűcs",
      "start": 332712,
      "text": "Well, in Budapest I wouldn't say we have big projects, but the biggest thing for data visualization here in Budapest is that finally we started a data visualization meetup.",
      "id": "ep_89_ut_21"
    },
    {
      "end": 346144,
      "speaker": "Enrico Bertini",
      "start": 345520,
      "text": "Oh, that's great.",
      "id": "ep_89_ut_22"
    },
    {
      "end": 378234,
      "speaker": "Krisztina Szűcs",
      "start": 346184,
      "text": "And it was advertised as a data visualization meetup. But in the end there were so many other people coming to this event from so many other fields, like data scientists, infographic designers, data journalists. So the room was full, there was not enough seat for the audience. I think around maybe 80 people were there. And it was really good, because finally designers and analysts could finally meet with you each other.",
      "id": "ep_89_ut_23"
    },
    {
      "end": 381486,
      "speaker": "Enrico Bertini",
      "start": 378394,
      "text": "Nice. Are you involved in the organization?",
      "id": "ep_89_ut_24"
    },
    {
      "end": 397246,
      "speaker": "Krisztina Szűcs",
      "start": 381670,
      "text": "Not so much. I usually recommend people, so I don't organize. I was part of the first one, I gave a presentation, but nowadays I just recommend other people who they should invite to the next one.",
      "id": "ep_89_ut_25"
    },
    {
      "end": 399190,
      "speaker": "Enrico Bertini",
      "start": 397350,
      "text": "Nice. Anything else?",
      "id": "ep_89_ut_26"
    },
    {
      "end": 488988,
      "speaker": "Krisztina Szűcs",
      "start": 399342,
      "text": "Yeah, about other things in Hungary that we don't have big projects that are public. But we had three big data visualization, three big data visualization challenges, like competitions. And it was surprising because it was really good. They had a really big databases, like the usage of the public bike system in the capital city. Or there was another one with a full database of the real estate advertisements in the world country. Two days ago was this 24 hours data visualization hackathon that was using data from T Mobile Hungary. And I wondered before that, why are there so many competitions here in Hungary, by many, if you consider the size of the country. And I talked to some people and they told me that they have a huge amount of data and they don't know what to make. They have the data there and they don't know how to use it, how the business can profit from it. So instead of hiding a group of specialists, they want ideas, and they want as many ideas as they could have. So.",
      "id": "ep_89_ut_27"
    },
    {
      "end": 493584,
      "speaker": "Enrico Bertini",
      "start": 489156,
      "text": "Well, I suspect it's the same everywhere. It's not only in hungary like that.",
      "id": "ep_89_ut_28"
    },
    {
      "end": 508500,
      "speaker": "Moritz Stefaner",
      "start": 494084,
      "text": "Yeah. But I think the observation is totally right, that if people don't real, they feel there might be something interesting, but they don't know what exactly that. Yeah. The impulse is often to make a hackathon or a competition, and if you see too many of them, you're like.",
      "id": "ep_89_ut_29"
    },
    {
      "end": 512532,
      "speaker": "Enrico Bertini",
      "start": 508532,
      "text": "Ah, can't they, like, there is a threshold somewhere. Right.",
      "id": "ep_89_ut_30"
    },
    {
      "end": 522868,
      "speaker": "Moritz Stefaner",
      "start": 512588,
      "text": "But I think at the same time, it can be a stepping stone, and it can maybe next year or in a few years, you know, they will hopefully commission, let's say professionals as well, right?",
      "id": "ep_89_ut_31"
    },
    {
      "end": 539124,
      "speaker": "Krisztina Szűcs",
      "start": 522916,
      "text": "Yeah. They will be more daring, I think, because now they are kind of cautious about publishing or hiring someone, and they just want to see if it's possible to do something big with this data or not.",
      "id": "ep_89_ut_32"
    },
    {
      "end": 539500,
      "speaker": "Moritz Stefaner",
      "start": 539244,
      "text": "Yeah.",
      "id": "ep_89_ut_33"
    },
    {
      "end": 551722,
      "speaker": "Enrico Bertini",
      "start": 539532,
      "text": "So all these challenges, all these challenges come from private companies or there are things like nonprofit organizations, all of them from private companies. From private companies. Okay. Yeah.",
      "id": "ep_89_ut_34"
    },
    {
      "end": 552654,
      "speaker": "Moritz Stefaner",
      "start": 551818,
      "text": "Interesting.",
      "id": "ep_89_ut_35"
    },
    {
      "end": 560914,
      "speaker": "Krisztina Szűcs",
      "start": 552994,
      "text": "But this hackathon this weekend was really good because I think around 90 people participated.",
      "id": "ep_89_ut_36"
    },
    {
      "end": 561634,
      "speaker": "Enrico Bertini",
      "start": 560994,
      "text": "Wow.",
      "id": "ep_89_ut_37"
    },
    {
      "end": 569054,
      "speaker": "Krisztina Szűcs",
      "start": 561794,
      "text": "And. But only ten of them were women. So that was the interesting part.",
      "id": "ep_89_ut_38"
    },
    {
      "end": 576254,
      "speaker": "Enrico Bertini",
      "start": 571954,
      "text": "So is there anything else you want to highlight from this past year?",
      "id": "ep_89_ut_39"
    },
    {
      "end": 602334,
      "speaker": "Krisztina Szűcs",
      "start": 577634,
      "text": "Globally? I found that in Hungary, almost many people knows their data. So I met many people and I knew they are not so interested in data visualization. But later on, I found out that they bought their data book, and even developers were interested in that book in my company.",
      "id": "ep_89_ut_40"
    },
    {
      "end": 610696,
      "speaker": "Moritz Stefaner",
      "start": 602634,
      "text": "That's great, dear. Data has been such an amazing success story. Tempted to do another episode on the radar?",
      "id": "ep_89_ut_41"
    },
    {
      "end": 615104,
      "speaker": "Enrico Bertini",
      "start": 610880,
      "text": "You know, I was about to say the same thing. Yeah.",
      "id": "ep_89_ut_42"
    },
    {
      "end": 637108,
      "speaker": "Moritz Stefaner",
      "start": 615264,
      "text": "Maybe we should when the movie comes out, we will invite them back. Exactly. So, Christina, we have to wrap up soon, but is there something you hope for for next year? And which types of projects are you hoping to see for next year? If you can make a wish, what would it be?",
      "id": "ep_89_ut_43"
    },
    {
      "end": 729922,
      "speaker": "Krisztina Szűcs",
      "start": 637256,
      "text": "Well, my wish is that I hope to see more data visualization from all the new sites and not just from the nonprofit ones. And what happened is that Google Digital News initiative founded a Hungarian project and it is about tracking public money. I call it that one. And this project plans to track state funded organizations and that public interest data. And they track if they publish them, because they are required by law. And of course they want to create an accessible database for it. So I'm very, very interested in that project and I hope it will be published next year. And the other thing I'm interested in that there is some collaboration between telecom innovation laboratories. It is called T-Labs and they are at TU Berlin. And there is this Hungarian university, Alta. And this university has. This university just had a new data science department. So there will be collaboration between the two organizations. And I think there will be room for data visualizations too. I just met some of them and we started to talk. I showed show some of my works to them and then they suddenly realized that, oh, this is what we are missing and we should work together on these projects.",
      "id": "ep_89_ut_44"
    },
    {
      "end": 730434,
      "speaker": "Enrico Bertini",
      "start": 730018,
      "text": "Cool.",
      "id": "ep_89_ut_45"
    },
    {
      "end": 744170,
      "speaker": "Moritz Stefaner",
      "start": 730514,
      "text": "Yeah, this sounds all amazing. I think everything you said sounds really like there's something in the works there and something's doing, something is brewing there and I can't wait to see what comes out of Budapest the next few years. Thanks so much, Christina. It was great having you. Thank you.",
      "id": "ep_89_ut_46"
    },
    {
      "end": 745874,
      "speaker": "Krisztina Szűcs",
      "start": 744202,
      "text": "Yeah, it was great. Thanks for having me.",
      "id": "ep_89_ut_47"
    },
    {
      "end": 747428,
      "speaker": "Enrico Bertini",
      "start": 745954,
      "text": "Thank you. Thanks a lot.",
      "id": "ep_89_ut_48"
    },
    {
      "end": 747856,
      "speaker": "Moritz Stefaner",
      "start": 747506,
      "text": "Thank you.",
      "id": "ep_89_ut_49"
    },
    {
      "end": 757680,
      "speaker": "Enrico Bertini",
      "start": 747880,
      "text": "Bye bye bye. And we have Blaise Appo on the show. Welcome, Blaise. How are you?",
      "id": "ep_89_ut_50"
    },
    {
      "end": 760232,
      "speaker": "Blaise Aboh",
      "start": 757752,
      "text": "I'm fine, Enrico, thank you very much for having me on the show.",
      "id": "ep_89_ut_51"
    },
    {
      "end": 765176,
      "speaker": "Enrico Bertini",
      "start": 760328,
      "text": "Can you briefly introduce yourself, tell us where you're located and what you're doing?",
      "id": "ep_89_ut_52"
    },
    {
      "end": 833804,
      "speaker": "Blaise Aboh",
      "start": 765280,
      "text": "Okay. Like I, like he said, Enrico said, my name is Blaise Aboh. I live in Lagos State, Nigeria, one of the biggest states in the country. Yeah. And I am the co founder of a company called Orodata Science. Yeah. So we try to use data visualizations to simplify public information so as to make the citizens more interested in the information, to make them active citizens and of course, make them consume the information in ways that they can be able to ask the government questions. Yeah. So I think it's a pretty good thing we are trying to do in Nigeria here. Because we have a lot of information right here in the government sector, in the public sector. And these informations, we are trying to see how we can open them up. But of course, we want to use data visualization to make them more interesting and more simple to consume and of course make them shareable on the numerous social media platforms we have in the country.",
      "id": "ep_89_ut_53"
    },
    {
      "end": 846656,
      "speaker": "Moritz Stefaner",
      "start": 834424,
      "text": "And how would you say, is the data visualization seen in Lagos or Nigeria in general as compared to the rest of the region or maybe the whole world as far as you can tell? What are they interested in?",
      "id": "ep_89_ut_54"
    },
    {
      "end": 1018924,
      "speaker": "Blaise Aboh",
      "start": 846720,
      "text": "Yeah, thank you, Moritz. That's a good question. The thing is, I am going to say that compared to the whole world, we are still pretty much backwards in terms of data visualization because I mean, I mean, we have a few players here. I can count maybe three or four players. Yeah. And I think we are probably the second to emerge in the industry. And I think, I mean, the first guys we emerge were probably, probably started maybe in 2012 and they didn't get traction till around 2014. And we presently we started around 2014. And I think our traction came a bit 2015 because we were working around data visualizations in elections. We were using data visualization to tell stories about data in elections. So it's pretty, pretty interesting here because, I mean, so when you go online, for example, and you try to, let's say for some, for example, a person who is still trying to learn how to visualize data, and you are from Nigeria, so when you go online, for example, you can find really fine courses that teach you, that probably teach you data visualization just like that. I mean, you may just find one or two, and the second guys you're going to find is us. But when you go to, let's say you go Google and you search again and you probably find a lot of courses on edX, you probably find a lot of courses on coursera. And these people, they use, they teach data visualization using hadroup, using Python and the whole other programmer programming languages. But down here we still do a bit, a few things or a lot of things. Let me use the word manually in the where. So we don't use the software that they use like in the rest of the world because they are advanced. And why we started our data is because we tried to understand what was happening and the importance of data and where data was going to. But of course we, we couldn't just jump to where the rest of the world was. We had to use the simple tools, we had to try to communicate in the simple ways for the ordinary nigerian to actually know what data visualization is. I mean, we can wake up one day and start talking about Hadoop or strata or python languages. I mean, people don't even know what open data is. People don't even know what data visualization is in simple terms, you know. So I think we just started by using the simple tools we could find to at least just show them the idea of how data can look like, of how beautiful information could look like, you know. So presently there are just about maybe three or four of us and it's still a very small, and it's still a very small sector. But I mean, it's still, it's still very open, too.",
      "id": "ep_89_ut_55"
    },
    {
      "end": 1029782,
      "speaker": "Moritz Stefaner",
      "start": 1019304,
      "text": "Yeah, I think that's the big opportunity. Right. So the space is wide open. So what types of projects have you been done in the past? Can you give us, us a little overview of what types of things you've been working on?",
      "id": "ep_89_ut_56"
    },
    {
      "end": 1287394,
      "speaker": "Blaise Aboh",
      "start": 1029918,
      "text": "Okay, so a bit of. In 2014, we started walking around. Okay, so we, a couple of friends, we started looking around, looking at what the world was talking about. The world was talking about big data and analytics and the future of data revolution. And we started studying these things and to understand it even more and how we could impact the nigerian society. And so when we got to the end of our research, we decided we were going to do, we were going to tell stories using visual data visualizations. But then we asked ourselves a question, what story should we tell? And we looked for the next biggest thing in Nigeria then. And that was the nigerian elections. Yes. So we had our elections in 2015, but before 2014, we decided to do to resell stories using data visualizations. But then these were going to be data elections, data related to Nigeria elections. So we looked at the history, we looked at history of violence in Nigeria. We looked at history of data, election data in Nigeria. Election polling units, election accounts, polling counts, and of course, voters registration card distribution. So we understood that these were something people will want to look at. These were something that people will probably be interested in. But we also understood that the last time there was an election in Nigeria was in 2011. And then social media, for example, Twitter, for example, was not that popular in Nigeria yet. People probably had just signed up. I signed up in 2009, but I didn't become active until 2011. And it's happened like that for so many, so many people. And even around that time, people didn't know what Twitter was. We weren't using Twitter, you know, so it hasn't been used before. So we thought about the fact that data visualization and infographics have not been used on nigerian Twitter before to drive engagement and citizen inclusion towards the election. So we figured it was something we could do. So we tried to mine data. We tried to. We, of course, we had a few programs that we worked with, open source programs that we worked with to get some sentiment analysis and social trends on how the Nigerians were thinking and what they wanted. Because the truth was, we wanted to create infographics, we wanted to create visual data. But the truth was we needed to understand what they wanted. We needed to understand what the problem was, what the information the people needed. And of course, we came up with a lot of things and we produced a lot of information products that were centered around the elections, from. From election violence to voting procedures in 60 seconds, to the types of, sorry, what would I call it? The candidates. The election candidates. People who wanted to vote didn't even know who their candidates was. They didn't even know, for example, the House of Representative, as we call it in the United States, the Congress, for example. People didn't know who their candidates were and who to vote for. So we use data visualization to try to portray that. And of course, we understood that people were on Twitter and they were tweeting that they used Twitter as a key point of accessing information. So we didn't want to take them away from Twitter, but rather to bring information to them on Twitter. So we used every information we were publishing on Twitter was simply an infographics. And it was, yeah, it was data visualization. And for everyone we published, they went viral. Everyone published, they all went viral. And for us, it gave us one simple understanding, that people wanted infographics, people wanted data visualization, even though they didn't know what it was. But when they saw it, they saw the beautiful information, they loved it. And so we said, yeah. And so we started with elections. Elections. And then between December 12 and April, December 12, 2014 and April 11, 2015, that was around when the election had relapsed. The general election has elapsed. We had reached a total of about 926,000 people online using infographics.",
      "id": "ep_89_ut_57"
    },
    {
      "end": 1298366,
      "speaker": "Enrico Bertini",
      "start": 1288014,
      "text": "Wow. So, Blaise, is there any other specific projects you want to highlight from 2016, maybe even globally?",
      "id": "ep_89_ut_58"
    },
    {
      "end": 1369148,
      "speaker": "Blaise Aboh",
      "start": 1298550,
      "text": "Okay, well, let me give a simple example, I think. Yeah, so we have, we've been trying to tell a lot of stories using infographics. We've worked on government spending, we've worked on government budgets using infographics as well. Also, most importantly, we've tried to focus on crisis. For example, we know that the internally displaced persons issues. It's a global issue in Nigeria. Here we have our own problems, too, which is as a result of the Boko Haram crisis we have in Nigeria today. Yes. So we have started telling stories using data visualization as well to try to highlight the plight of the internal displaced persons we have in Nigeria to try to tell stories, to show the gaps, the funding gaps, to also try to show a lot of issues. For example, that was one of the things we did. If you can google it online, it was called child trafficking in IDP's camp. So if you google it, I'm sure the first four or five websites you see will probably have our infographics on top of it.",
      "id": "ep_89_ut_59"
    },
    {
      "end": 1388734,
      "speaker": "Moritz Stefaner",
      "start": 1369276,
      "text": "Yeah, we will definitely put them in the blog post so people can study it in detail. Looking forward, looking at 2017, what would you hope for? If you can make a wish for the data visualization scene in Nigeria, what are you hoping for? What are the types of projects you would like to see or you would like to tackle yourself? What are your thoughts?",
      "id": "ep_89_ut_60"
    },
    {
      "end": 1396874,
      "speaker": "Blaise Aboh",
      "start": 1388774,
      "text": "Okay, well, well, my thought is, I think it's a whole lot to wish, a lot for 2017. So I am going to make a wish.",
      "id": "ep_89_ut_61"
    },
    {
      "end": 1401398,
      "speaker": "Enrico Bertini",
      "start": 1400734,
      "text": "I like that.",
      "id": "ep_89_ut_62"
    },
    {
      "end": 1515656,
      "speaker": "Blaise Aboh",
      "start": 1401446,
      "text": "So the industry presently is very young and a few of us are here playing and trying to understand what it is. I'm not going to lie to you, we are still trying to understand. And the truth is, we are not where the world is. The whole rest of the world, for example, is. I mean, in terms of people like, let's say United States, for example, and London, for example, what they do with is amazing because of all these amazing softwares and amazing programming languages. They used to, you know, to read these things and read data and all that. And then here in Nigeria, we are still doing things, I call it the manual way, using a little bit of the photo editing tools and the other analytical tools like power Bi and the rest of them. But I think in 2017, I'm looking at the possibility whereby the big guns in the United States, for example, let me say the top data visualizing companies in Nigeria, in us, for example, can probably take a look at what we are doing here in Nigeria and see how they can perhaps partner with one of us, perhaps with our data for us, for example, and see how we can use or leverage their biggest tool to do and of course push up the work we are doing here in Nigeria. Because of course, the truth about thing about this thing is building the software locally is a big headache. But of course, getting a major partnership, for example, with a big data visualization company in New York City, for example, is going to be a big win for us, you know, in 2017. So I look at opportunities whereby in 2017 World New York City companies in New York City are seeing what is happening in Nigeria today and picking out the big guys, the players, and saying, okay, how can we do this, how can we work together and how can we partner to even move data visualization further to the next level in Nigeria? So that's what I'm looking at.",
      "id": "ep_89_ut_63"
    },
    {
      "end": 1539938,
      "speaker": "Enrico Bertini",
      "start": 1515840,
      "text": "Well, sounds good. I really hope some of these wishes can become true. Well, thanks so much, Blaise, for coming on the show. It's very interesting to hear what is happening in your part of the globe and we wish you happy new year and happy holidays.",
      "id": "ep_89_ut_64"
    },
    {
      "end": 1540818,
      "speaker": "Moritz Stefaner",
      "start": 1540026,
      "text": "Thanks so much.",
      "id": "ep_89_ut_65"
    },
    {
      "end": 1542018,
      "speaker": "Blaise Aboh",
      "start": 1540906,
      "text": "Yeah, thank you very much.",
      "id": "ep_89_ut_66"
    },
    {
      "end": 1542642,
      "speaker": "Moritz Stefaner",
      "start": 1542066,
      "text": "Bye bye.",
      "id": "ep_89_ut_67"
    },
    {
      "end": 1543814,
      "speaker": "Blaise Aboh",
      "start": 1542738,
      "text": "All right, bye bye.",
      "id": "ep_89_ut_68"
    },
    {
      "end": 1550364,
      "speaker": "Moritz Stefaner",
      "start": 1547874,
      "text": "And next up is Simone. Hi, Simone.",
      "id": "ep_89_ut_69"
    },
    {
      "end": 1551000,
      "speaker": "Enrico Bertini",
      "start": 1550434,
      "text": "Hey, Simone.",
      "id": "ep_89_ut_70"
    },
    {
      "end": 1553600,
      "speaker": "Simon Ducroquet",
      "start": 1551072,
      "text": "Hi, Moritz. How are you doing? Hi, Enrico.",
      "id": "ep_89_ut_71"
    },
    {
      "end": 1560528,
      "speaker": "Moritz Stefaner",
      "start": 1553712,
      "text": "Great to have you on. I'm great, thanks. So, Simone, who are you, where are you based and what are you doing?",
      "id": "ep_89_ut_72"
    },
    {
      "end": 1687914,
      "speaker": "Simon Ducroquet",
      "start": 1560576,
      "text": "Currently, I'm based in Sao Paulo, Brazil. I've been working as an art editor for most of the year since 2015, at a new project here that's called NEXO ( https://www.nexojornal.com.br/ ). I was there since the very beginning, before it was launched. So I happened to build the graphics and visuals theme, and to build the department and to shape the website. That was until two months ago. And now I'm working. I'm back, actually, to folate. So, Paulo, it's a place, a newspaper. I've worked for five years, two years ago, and I'm working there as a collaborator, doing specific special projects, sometimes from inside the newsroom, but sometimes outside in the newsroom. And in general, my background is in news for infographics. So I've been doing a lot of animations, 3d animations, and data visualizations, also for both print and the web. So I came from a print background, and then I started to migrate to the web. And I always done some research in doing experimental projects with game engines, for instance, and with virtual reality. So those are things that I try to explore and, well, working on newspapers and we always have to do a lot of things. So I've also been have a big foot into the cartography and tried to do it sometimes some experimentations, mixing video with cartography and things like that.",
      "id": "ep_89_ut_73"
    },
    {
      "end": 1696914,
      "speaker": "Enrico Bertini",
      "start": 1688074,
      "text": "So, Simone, so what is going on in Sao Paulo and maybe even in Brazil in general, or even South America?",
      "id": "ep_89_ut_74"
    },
    {
      "end": 1837440,
      "speaker": "Simon Ducroquet",
      "start": 1697294,
      "text": "Yeah, well, I think in Brazil and I think in South America in general also, we have like a big tradition on more traditional infographics so doing narratives with illustrations and cutouts and things like that. And there are good projects in Dataviz, but I think there is still a lot of place to grow on that field. I think on the last years we have seen in Brazil, we have some newspapers doing a good job on that field. For instance, we call it Istadong. They have doing a good job, a solid job. I think on the last five years they built a data team and then they had developers. So they have done solid work. I think we have some. We have projects, also good projects outside the newsrooms. We have info Amazonia, which is a very good job on cartography surveillance on the Amazon forest. So they gather data about deforestations and fire and the cattle productions and their polys, mapping and updating it. And I think that's a good example also on Datavis. And we have some new stuff coming on that I think we're going to talk about a little later, but I think those are good projects. Talking more about South America, I've seen La Nation in Argentina, which did a very good job in 2015 as they had national elections. So they did very good visualizations on the results, but also analyzing the candidates speech. I think they are ahead of on this data we've seen on the continent. They're doing very good.",
      "id": "ep_89_ut_75"
    },
    {
      "end": 1851192,
      "speaker": "Moritz Stefaner",
      "start": 1837552,
      "text": "So looking back over the last year, if you had to pick really cool major developments or projects you would like to mention, what would they be, for instance, in your city or country or maybe even globally?",
      "id": "ep_89_ut_76"
    },
    {
      "end": 1860604,
      "speaker": "Simon Ducroquet",
      "start": 1851368,
      "text": "Yeah. Well, I know I'm suspicious to talk, but I think the project I was involved for most part of the year. NEXO ( https://www.nexojornal.com.br/ ).",
      "id": "ep_89_ut_77"
    },
    {
      "end": 1868914,
      "speaker": "Moritz Stefaner",
      "start": 1862414,
      "text": "Why not? If it's really good, we'll check it out. So what is it? What is NEXO ( https://www.nexojornal.com.br/ )?",
      "id": "ep_89_ut_78"
    },
    {
      "end": 2130362,
      "speaker": "Simon Ducroquet",
      "start": 1869254,
      "text": "Yeah, so it's a small project. It's maybe like 30 people on total. I mean it's a medium size, maybe we could say for news. So it's a project that's already going. It's still going on, just I'm not there anymore. But it was a project that had a bigger focus on database investigations. So since the beginning they hired people like me with infographics, visual background, but also a data scientist who's Danyel Mariani, who works with r and has a good experience on that, doing jobs on for academic projects. And they built the newsroom in a way that the graphics department was quite independent to do its own stories. So that was kind of a new thing. Here in Brazil we don't see too many editorial with giving that attention to data and to visualization. So I think that's something that it's worth mentioning. So I think we achieved good things there. And another project that. Another thing that I would like to mention here in Brazil, I think the global newspaper, it's based at Rio de Janeiro, they also did some good projects. They already had some sort of tradition doing infographics. They have Alessandro Wien, who is quite known for doing visual stories, more illustrated stories, and doing his own investigations on the subjects and doing long form stories and. But like, maybe two years ago, they hired some people from Stadan, for instance, and they. They started to build a more solid, more solid department for visuals, putting together, like, developers, designers, journalists. And as we had, like this year, national elections, for like, local elections, actually, but being done, like, on the whole country. And they did, like, very good cartography, visualizations, graphics, both print and web. So I hope they keep doing like, this kind of things. Well, speaking more like, globally, I think that we have a good year for cartography. Yeah, definitely. I see that the approach to maps is getting more mature. It's not that we had, maybe we also had, but something that took my attention was not like the very innovative projects, but is the level of discussion that maps are getting and how it's getting more. The discussion on maps, it's getting more closer to the readers. So we had, like, for instance, New York Times, on the upshot, they wrote a post talking about their history on cartography and how they use it, cartograms and choroplets in their history. And this is for the readers. I think it shows that people are getting more interested in thinking about how maps are done and how journalistic ethics applies. Yeah. Two maps.",
      "id": "ep_89_ut_79"
    },
    {
      "end": 2144042,
      "speaker": "Moritz Stefaner",
      "start": 2130498,
      "text": "Yeah. By now, people discuss which types of cartograms they use rather than, you know, just like, look, we made a fancy cartogram with funny shapes, you know, there you can see already how much it has matured, as you say.",
      "id": "ep_89_ut_80"
    },
    {
      "end": 2145450,
      "speaker": "Simon Ducroquet",
      "start": 2144138,
      "text": "Yeah, yeah, that is.",
      "id": "ep_89_ut_81"
    },
    {
      "end": 2145754,
      "speaker": "Enrico Bertini",
      "start": 2145522,
      "text": "Yeah.",
      "id": "ep_89_ut_82"
    },
    {
      "end": 2155282,
      "speaker": "Simon Ducroquet",
      "start": 2145794,
      "text": "And for instance, Vox, they do like a superb job with videos and, like, motion graphics.",
      "id": "ep_89_ut_83"
    },
    {
      "end": 2155610,
      "speaker": "Nikita Rokotyan",
      "start": 2155338,
      "text": "Videos.",
      "id": "ep_89_ut_84"
    },
    {
      "end": 2178284,
      "speaker": "Simon Ducroquet",
      "start": 2155642,
      "text": "And they release it, I think, at least two videos discussing maps, like projections. Very, very funny videos. And I think that shows also that people are very interested and they want to talk about maps or projections. So I think that's good.",
      "id": "ep_89_ut_85"
    },
    {
      "end": 2181444,
      "speaker": "Moritz Stefaner",
      "start": 2178904,
      "text": "The nerds are winning. The map nerds are winning.",
      "id": "ep_89_ut_86"
    },
    {
      "end": 2193320,
      "speaker": "Enrico Bertini",
      "start": 2182304,
      "text": "Cartography is always big. I think people just have of feel like they have a very natural connection with geographical space. Right. It's more direct. I don't know.",
      "id": "ep_89_ut_87"
    },
    {
      "end": 2194284,
      "speaker": "Simon Elvery",
      "start": 2193512,
      "text": "Yeah.",
      "id": "ep_89_ut_88"
    },
    {
      "end": 2203896,
      "speaker": "Enrico Bertini",
      "start": 2194904,
      "text": "So, Simone, what are your big hopes for next year? What do you want? What do you want? To see happening in 2017.",
      "id": "ep_89_ut_89"
    },
    {
      "end": 2291210,
      "speaker": "Simon Ducroquet",
      "start": 2204080,
      "text": "Yeah, well, speaking more, like about Brazil, but I think it applies to many places. Like, one thing that we have one big challenge here for data journalism and data visualizations is the lack of good public data or organized and usable data from public administrations, for instance. But we have some local administration. Sao Paulo, for instance, the last years, they started to build and to open platforms for, to share their data. And like, they have, like, they build a website, it's called GeoSampa, where you can download shape files and all kinds of data about where hospitals, schools are and, you know, like traffic information. So that's something that I hope we see more and more and that will definitely help us doing our job and ultimately helping everybody like the readers and the whole population. So that's something I'm expecting to happen as we are shifting local administrations here. So that's a moment to see that happen.",
      "id": "ep_89_ut_90"
    },
    {
      "end": 2297482,
      "speaker": "Enrico Bertini",
      "start": 2291402,
      "text": "Yeah, there's a lot going on in the political spectrum right now in Brazil, right?",
      "id": "ep_89_ut_91"
    },
    {
      "end": 2310058,
      "speaker": "Simon Ducroquet",
      "start": 2297578,
      "text": "Yeah. Yeah. So that's something I was, I would like to mention also we have, like, politics in Brazil. It's quite complex. Like, we have more than 30 parties.",
      "id": "ep_89_ut_92"
    },
    {
      "end": 2310610,
      "speaker": "Moritz Stefaner",
      "start": 2310186,
      "text": "Wow.",
      "id": "ep_89_ut_93"
    },
    {
      "end": 2313734,
      "speaker": "Simon Ducroquet",
      "start": 2310682,
      "text": "And, yeah, it's a big mess.",
      "id": "ep_89_ut_94"
    },
    {
      "end": 2318094,
      "speaker": "Enrico Bertini",
      "start": 2315474,
      "text": "I thought Italy was the worst one.",
      "id": "ep_89_ut_95"
    },
    {
      "end": 2363784,
      "speaker": "Simon Ducroquet",
      "start": 2321154,
      "text": "Well, we are doing a good job there. So we have 30 parties. Like, none of them is like a very, like, major party. Like maybe we have like three, like, big parties, but we have like, all types of sizes and, and, and they're, they're not very clear on their political orientations and people don't really understand, like, what is going on. Like, it's, it's very hard. There was a project called Basil Metro that is still going on that, that is like tracking at least which of these parties are on the opposition side and which are like, situation and so trying to track all their behavior.",
      "id": "ep_89_ut_96"
    },
    {
      "end": 2371776,
      "speaker": "Moritz Stefaner",
      "start": 2363824,
      "text": "And so you need data analysis just to understand who's actually in the opposition. Yeah, that's a new level.",
      "id": "ep_89_ut_97"
    },
    {
      "end": 2374688,
      "speaker": "Enrico Bertini",
      "start": 2371840,
      "text": "Yeah, that's a new level. Yeah.",
      "id": "ep_89_ut_98"
    },
    {
      "end": 2387030,
      "speaker": "Simon Ducroquet",
      "start": 2374736,
      "text": "That's crazy. That's crazy. So I think that there's fields there to do data analysis and data visualizations to show and explain what is going on.",
      "id": "ep_89_ut_99"
    },
    {
      "end": 2388154,
      "speaker": "Moritz Stefaner",
      "start": 2387062,
      "text": "Yeah, definitely.",
      "id": "ep_89_ut_100"
    },
    {
      "end": 2691794,
      "speaker": "Simon Ducroquet",
      "start": 2389254,
      "text": "Also, we are in a moment, like, we have like, this impeachment here and then the government that is, took place after that is making a lot of big changes in terms of Social Security, for instance, on the budget law. So those are things also that are very, very hard to understand. Like, those are like big numbers for budget and then you have, like, for Social Security, you have so many things that are playing some role on how to calculate how it's going to affect people that are going to retire, like in five years or in ten years or 40 years. So all this, those subjects, I think they're very important and they are very hard to deal with. So I think those are places where we should aim and focus. Talking about, at least here in Brazil, we also have like the Zika disease that is still spreading like it got. We have less cases, but we used to have a lot of cases of baby born with, how do you call it, bad formations on their bodies, on their brains. And it's gonna, I hope it doesn't grow more as a public disease, but it can happen as we are getting into a hotter period here on the south, we're gonna into summer, and that's when the mosquito starts to spread more. And so those are things that are very like, they concern a lot of people. Everybody that, I mean, just everybody is concerned. And people are like making, planning if they are going to have kids or not, based on that, for instance. And there is not a lot of information, it's still blurry data on that side. So we don't have a lot to work with. But I think that we are going to see more and more information coming, I hope. And then I think there is something that we should also focus and expect to see also good visual storytelling on that. And then speaking more globally. I think there is, I think, a general concern in terms of format when we doing, when we're doing visual storytelling and dealing with visual data. And that's mostly like working with mobile devices, for instance. And I think that's a big concern because when we're working with print, for instance, you can do like very interesting big poster visualizations, but doing that on mobile, it's very tricky and it's very costly. And we haven't seen, we haven't seen some good stuff, but they're usually very expensive on the coding side. So something I would like to see, and I think I would invest too. And I think that's one way trying to get on the back to the, to the roots of like, just using these limitations as something that can lead us to some creativity. So doing like static, vertical stories and developing this language and not seeing this as a problem or, and seeing is more like it's, it's the way we have to do. People are using cell phones. So let's try to, to research and do things that are not so costly and that can still be very compelling as visual stories on that format. I think that we have tools for that. We have AI to HTML that is very user friendly for people coming from the design side. We can build stories, I think, using more aesthetic and more classic tools and don't limitate ourselves by the device limitations.",
      "id": "ep_89_ut_101"
    },
    {
      "end": 2704314,
      "speaker": "Enrico Bertini",
      "start": 2691914,
      "text": "Yeah. Mobile is such a big challenge. Of course everyone is using mobile devices and it's a very important problem.",
      "id": "ep_89_ut_102"
    },
    {
      "end": 2730442,
      "speaker": "Moritz Stefaner",
      "start": 2704474,
      "text": "Yeah, but the nut has not been cracked yet. I agree. Everybody's struggling, so it should be interesting next year. I also really appreciate you mentioning the political and the open data potential and also sica because I think these are really areas where database can make a huge difference. I hope somebody will tackle that next year in Brazil and looking forward to hearing maybe an update to see if it happened. Thanks so much for coming on, Simone. That was great.",
      "id": "ep_89_ut_103"
    },
    {
      "end": 2731418,
      "speaker": "Enrico Bertini",
      "start": 2730498,
      "text": "Thanks Simon.",
      "id": "ep_89_ut_104"
    },
    {
      "end": 2742280,
      "speaker": "Simon Ducroquet",
      "start": 2731586,
      "text": "Yeah, thank you for the invitation and I'm very pleased to to have this opportunity to contribute to this great project. Data stories.",
      "id": "ep_89_ut_105"
    },
    {
      "end": 2744008,
      "speaker": "Enrico Bertini",
      "start": 2742352,
      "text": "Thank you so much. Thank you.",
      "id": "ep_89_ut_106"
    },
    {
      "end": 2744736,
      "speaker": "Moritz Stefaner",
      "start": 2744096,
      "text": "Thank you.",
      "id": "ep_89_ut_107"
    },
    {
      "end": 2745360,
      "speaker": "Simon Ducroquet",
      "start": 2744840,
      "text": "Thank you.",
      "id": "ep_89_ut_108"
    },
    {
      "end": 2864772,
      "speaker": "Enrico Bertini",
      "start": 2745432,
      "text": "Bye bye bye. This is a good time to take a little break and talk about our sponsor, Qlik. Qlik allows you to explore the hidden relationships within your data that lead to meaningful insights. Let your instincts lead the way to create personalized visualizations and dynamic dashboards with Qlik sense, which you can download for free at www.Qlik.de/Datastories . So Qlik is organizing for the end of the year a very interesting webinar on the top bi trends for 2017. And this is going to happen on January 11. So if you're interested in participating, look for this episode's blog post and you'll find the link to the registration webpage. Don't miss out and reserve your spot today. So in the past we have witnessed it to a lot of trends, an explosion of data, an increase in processing, and a move towards information activism. But is the gap widening between the data and our ability to consume it? How will these patterns impact the bi industry in the coming year? So if you want to hear answers to these questions, join Qlik senior director and former Gartner analyst Dan Sommer for his top ten predictions for 2017, and you'll hear about how the digital and physical worlds will begin to meet in analytics, how the two sides of personal analytics will change the industry, how the rise of modern bi will affect the self service model, and find out whether you've missed any of the signals and where your focus should be in the coming months. So join the Qlik seminar on the top bi trends for 2017. And now back to the show. We have Nikita (Rokotyan) on the show. Welcome. How are you?",
      "id": "ep_89_ut_109"
    },
    {
      "end": 2866484,
      "speaker": "Nikita Rokotyan",
      "start": 2864828,
      "text": "Hey, I'm good. How are you?",
      "id": "ep_89_ut_110"
    },
    {
      "end": 2874220,
      "speaker": "Enrico Bertini",
      "start": 2866564,
      "text": "I'm very good. So, can you briefly introduce yourself, tell us who you are, where are you located and what you're doing?",
      "id": "ep_89_ut_111"
    },
    {
      "end": 2874984,
      "speaker": "Blaise Aboh",
      "start": 2874332,
      "text": "Sure.",
      "id": "ep_89_ut_112"
    },
    {
      "end": 2918084,
      "speaker": "Nikita Rokotyan",
      "start": 2875324,
      "text": "My name is Nikita. I am located in Russia. The name of the city is Yekaterinburg, and it's exactly the border between Europe and Asia. It's about 2000 km from Moscow to the east, and it's the most western part of western Siberia. Myself, I am partially data visualization engineer, partially scientist. And as a scientist I developed techniques to retrieve atmospheric composition from sunlight using ground based and satellite based instruments. And as a data visualization engineer, I'm doing data visualizations.",
      "id": "ep_89_ut_113"
    },
    {
      "end": 2923844,
      "speaker": "Enrico Bertini",
      "start": 2919904,
      "text": "Can I try to say jekytherinburg?",
      "id": "ep_89_ut_114"
    },
    {
      "end": 2930240,
      "speaker": "Nikita Rokotyan",
      "start": 2925104,
      "text": "That's exactly correct. Let me say it with Russian accent - Yekaterinburg.",
      "id": "ep_89_ut_115"
    },
    {
      "end": 2931204,
      "speaker": "Enrico Bertini",
      "start": 2930392,
      "text": "Okay.",
      "id": "ep_89_ut_116"
    },
    {
      "end": 2943192,
      "speaker": "Nikita Rokotyan",
      "start": 2932944,
      "text": "It's made up from two words. First word is Yekaterin. It's Catherine the queen. And the second word is burg. It's the city.",
      "id": "ep_89_ut_117"
    },
    {
      "end": 2944044,
      "speaker": "Enrico Bertini",
      "start": 2943328,
      "text": "Yeah.",
      "id": "ep_89_ut_118"
    },
    {
      "end": 2947484,
      "speaker": "Nikita Rokotyan",
      "start": 2944544,
      "text": "So it's actually pretty simple, but it sounds confusing.",
      "id": "ep_89_ut_119"
    },
    {
      "end": 2951284,
      "speaker": "Enrico Bertini",
      "start": 2948664,
      "text": "Yeah. Sorry for interrupting.",
      "id": "ep_89_ut_120"
    },
    {
      "end": 2957272,
      "speaker": "Nikita Rokotyan",
      "start": 2952344,
      "text": "No problem. So I can briefly tell what brought me to data visualization world.",
      "id": "ep_89_ut_121"
    },
    {
      "end": 2958844,
      "speaker": "Enrico Bertini",
      "start": 2957408,
      "text": "Sure, please go ahead.",
      "id": "ep_89_ut_122"
    },
    {
      "end": 3062644,
      "speaker": "Nikita Rokotyan",
      "start": 2961184,
      "text": "I was a huge fan of demo scene when I was a child, and I was really interested in doing some creative coding and interactive art. So while I was a student and I studied physics, I started doing some creative coding, generative art. I built some interactive installations using computer vision and all that. Things that are now very popular in creative technology. But I always felt that my defi would like somehow to combine and one of my background is science and my another background is, let's say, creative technology and design. And it turned out to be that data visualization is a perfect fit for my background and grounds that my interests and I have started to dig more into it. And being a scientist, I did a lot of data visualizations, but they were all static. Most of packages for science there are static data visualization things. You just draw a picture. And I really felt that there is a lack of nice visualizations in scientific world. And I wanted to go beyond and build some tools that will allow me and people around me to understand more what I'm doing and different phenomena around the world. So I have started doing data visualizations and I really enjoyed it. And now it turned out to be that I'm more and more into data visualization.",
      "id": "ep_89_ut_123"
    },
    {
      "end": 3088998,
      "speaker": "Moritz Stefaner",
      "start": 3063544,
      "text": "Yeah, that makes sense. And I love how everybody comes from a different background, but still we end up at the same spot. What would you say, like, you being interested in data visualization is like in Yekaterinburg, is it very specific? Are there more people, are there more people in western Siberia who do similar stuff? And how is the situation in Russia as a whole, as far as you can oversee it? I know it's a huge country, of course.",
      "id": "ep_89_ut_124"
    },
    {
      "end": 3182344,
      "speaker": "Nikita Rokotyan",
      "start": 3089086,
      "text": "Yeah, it's a huge country. And I have to say that it's still very specific. When I started doing this, I felt like I'm. I'm alone now. There are more and more people who are starting doing this, usually in Moscow for sure. In Moscow you can find some people, even some companies, but it's still a very new world. And what I see, I have a lot of friends who are journalists, and I see a huge interest to data journalism. So I really think that there is a big future for data visualization in Russia. And it's very exciting that right now the field is fairly developed, but more and more people are interested in it. So I'm really looking forward what's going to happen next year and year after that, because big companies are starting small teams who are doing, currently, they're doing data analysis and data visualization at the same time. But I think that one day we will have data visualization departments and studios. I did some research, actually. I tried to find a job as a data visualization engineer in Russia, and I found only one job posting. As you see, it's quite a new thing here.",
      "id": "ep_89_ut_125"
    },
    {
      "end": 3184060,
      "speaker": "Simon Elvery",
      "start": 3183724,
      "text": "Yeah.",
      "id": "ep_89_ut_126"
    },
    {
      "end": 3207824,
      "speaker": "Moritz Stefaner",
      "start": 3184092,
      "text": "But I heard from a few really interesting developments in data journalism and visual data journalism. But as you say, it's mostly coming from Moscow. So, yeah, it might have to spread out to other places too. Can you still thinking back over the year, are there some projects or some developments that you would mention where you say, yeah, this is going in an interesting direction.",
      "id": "ep_89_ut_127"
    },
    {
      "end": 3212062,
      "speaker": "Nikita Rokotyan",
      "start": 3209574,
      "text": "You mean worldwide or Russian projects?",
      "id": "ep_89_ut_128"
    },
    {
      "end": 3213314,
      "speaker": "Moritz Stefaner",
      "start": 3212118,
      "text": "Both, as you like.",
      "id": "ep_89_ut_129"
    },
    {
      "end": 3271710,
      "speaker": "Nikita Rokotyan",
      "start": 3214454,
      "text": "Okay, so let's start with our Russian projects. I would like to admit that we had two quite nice visualizations. One was on Russian news website. It was about visualizing Nobel Prize winners, like the history where you can interact and see people from different countries and see the dynamics of Nobel Prize. And another visualization, which is, it was not really popular, but I liked it a lot. It's about Moscow Marathon, and it was created by a studio in Russia, a small studio, which is doing data visualization in Moscow. And in that visualization, you can see the flow of people during the marathon. It actually looks like a river that is flowing around the city, and you can see a spread of people that.",
      "id": "ep_89_ut_130"
    },
    {
      "end": 3272314,
      "speaker": "Simon Elvery",
      "start": 3271742,
      "text": "Are.",
      "id": "ep_89_ut_131"
    },
    {
      "end": 3284474,
      "speaker": "Nikita Rokotyan",
      "start": 3274334,
      "text": "Running through the city. And you have some metrics and some data, some graphs, but it's really visually appealing.",
      "id": "ep_89_ut_132"
    },
    {
      "end": 3289392,
      "speaker": "Moritz Stefaner",
      "start": 3284814,
      "text": "That sounds amazing. So we'll put a link in the show notes and then people can take a look.",
      "id": "ep_89_ut_133"
    },
    {
      "end": 3291344,
      "speaker": "Nikita Rokotyan",
      "start": 3289518,
      "text": "Sure, it's in Russian, but I think.",
      "id": "ep_89_ut_134"
    },
    {
      "end": 3303264,
      "speaker": "Moritz Stefaner",
      "start": 3293324,
      "text": "Anybody can relate to flowing particles. That's a universal thing. And globally, are there any things globally you would mention from your perspective?",
      "id": "ep_89_ut_135"
    },
    {
      "end": 3313012,
      "speaker": "Nikita Rokotyan",
      "start": 3304124,
      "text": "Globally? I really like that visualization of machine learning. I don't remember the name right now of that project, but I think, you.",
      "id": "ep_89_ut_136"
    },
    {
      "end": 3315328,
      "speaker": "Moritz Stefaner",
      "start": 3313028,
      "text": "Know what, I am from Google, but.",
      "id": "ep_89_ut_137"
    },
    {
      "end": 3317536,
      "speaker": "Enrico Bertini",
      "start": 3315416,
      "text": "Yeah, Google has been helping quite a.",
      "id": "ep_89_ut_138"
    },
    {
      "end": 3351734,
      "speaker": "Nikita Rokotyan",
      "start": 3317560,
      "text": "Bit, and it's more like a tool. It's even not like a visualization, but it's like a tool that helps you to understand. And partially, being a scientist, I really like to see such kind of tools because they can tell you and show you how the thing works and you can spend hours trying to understand, but once you see it, it's like click and you understand, which is very nice. And actually, I really liked the project. The rhythm of food.",
      "id": "ep_89_ut_139"
    },
    {
      "end": 3356782,
      "speaker": "Moritz Stefaner",
      "start": 3351894,
      "text": "Aha. Yeah, I mean, I can talk about that, of course.",
      "id": "ep_89_ut_140"
    },
    {
      "end": 3362550,
      "speaker": "Nikita Rokotyan",
      "start": 3356918,
      "text": "It's really beautiful. And all the pictures, they're really nice. So very good job.",
      "id": "ep_89_ut_141"
    },
    {
      "end": 3364154,
      "speaker": "Moritz Stefaner",
      "start": 3362702,
      "text": "Thanks. That's very nice.",
      "id": "ep_89_ut_142"
    },
    {
      "end": 3367994,
      "speaker": "Enrico Bertini",
      "start": 3366254,
      "text": "The best of the year.",
      "id": "ep_89_ut_143"
    },
    {
      "end": 3372444,
      "speaker": "Moritz Stefaner",
      "start": 3369664,
      "text": "Totally unsolicited. We didn't plan for this at all.",
      "id": "ep_89_ut_144"
    },
    {
      "end": 3388004,
      "speaker": "Enrico Bertini",
      "start": 3376544,
      "text": "Not prepared? Not at all. So, Nikita, what are your big hopes for next year? What type of projects do you want to see happening?",
      "id": "ep_89_ut_145"
    },
    {
      "end": 3470314,
      "speaker": "Nikita Rokotyan",
      "start": 3390024,
      "text": "So I really hope to see more data visualization activities here in Russia and myself, I want to start pushing more into that field. I want to run to create a couple projects that will visualize data around Russia. It's a huge country and there is a lot of data, and it's quite difficult to find interactive images of that. So it will be very interesting to see and show people, the whole country, but visually, I mean, data behind the country. And personally, I really want to explore more 3d technologies in data visualization because I came from a background of creative developer, and for me it was naturally to work with libraries like cinder processing, and it was all 3d based. And now in data visualization, I think 95% people are using D3, which is great. I love that tool. But at the same time, there are quite a few projects where I would like to have this high performance 3d abilities.",
      "id": "ep_89_ut_146"
    },
    {
      "end": 3475460,
      "speaker": "Enrico Bertini",
      "start": 3470894,
      "text": "Yeah, and with virtual reality is also an interesting direction there, right?",
      "id": "ep_89_ut_147"
    },
    {
      "end": 3490164,
      "speaker": "Nikita Rokotyan",
      "start": 3475582,
      "text": "Exactly, exactly. So personally, I would like to explore more 3d rendering libraries that can be used for data visualization in web environment. So basically, using webgl.",
      "id": "ep_89_ut_148"
    },
    {
      "end": 3492484,
      "speaker": "Moritz Stefaner",
      "start": 3491224,
      "text": "Very interesting.",
      "id": "ep_89_ut_149"
    },
    {
      "end": 3560610,
      "speaker": "Nikita Rokotyan",
      "start": 3492864,
      "text": "And probably another third thing, that it would be really great that if we had more data visualizations using scientific data, because we have a lot of data in science, but only scientists know how to deal with the data, and people, they just don't have access to it. And at the same time, I really see that if we just create a website and visualize the data somehow so everybody can just go there and look at it, and it can be a huge breakthrough in terms of making science more popular and making people understand science more and even kids to inspire kids to do science, engineering, technology and all that. I think data visualization can play a huge role in popularizing and making more accessible all the areas of scientific and technological knowledge.",
      "id": "ep_89_ut_150"
    },
    {
      "end": 3580706,
      "speaker": "Enrico Bertini",
      "start": 3560802,
      "text": "Yeah, yeah. I fully agree with you. Science is always fascinating. There's so much data going on there and huge, huge opportunities. Well, Nikita, thanks so much for coming on the show. It's really interesting to see what is happening on your side of the world. Thanks for being on the show.",
      "id": "ep_89_ut_151"
    },
    {
      "end": 3582482,
      "speaker": "Nikita Rokotyan",
      "start": 3580850,
      "text": "Thanks a lot for having me.",
      "id": "ep_89_ut_152"
    },
    {
      "end": 3584302,
      "speaker": "Moritz Stefaner",
      "start": 3582578,
      "text": "Thanks, Nikita. Bye bye.",
      "id": "ep_89_ut_153"
    },
    {
      "end": 3593590,
      "speaker": "Enrico Bertini",
      "start": 3584398,
      "text": "Bye. Bye bye. And we have Simon on the show. Hey, Simon, how are you?",
      "id": "ep_89_ut_154"
    },
    {
      "end": 3595510,
      "speaker": "Simon Elvery",
      "start": 3593662,
      "text": "Hi. I'm well, thank you. Thanks for having me.",
      "id": "ep_89_ut_155"
    },
    {
      "end": 3603614,
      "speaker": "Enrico Bertini",
      "start": 3595582,
      "text": "Thank you. So can you briefly introduce yourself, tell us who you are, where you are located, and what you're doing?",
      "id": "ep_89_ut_156"
    },
    {
      "end": 3636330,
      "speaker": "Simon Elvery",
      "start": 3603734,
      "text": "Sure. My name is Simon Elvery, and I'm a. I guess I'm a data visual interactive journalist. I have a fair bit of trouble describing exactly what it is I do, depending on the audience. But, yeah, I'm a journalist working for the Australian Broadcaster Corporation. I'll probably abbreviate that to the ABC if I mention it again and don't get confused with the American version. But we work out of Brisbane in Australia, on the eastern coast of Australia, and it's pretty sunny and hot here at the moment.",
      "id": "ep_89_ut_157"
    },
    {
      "end": 3652704,
      "speaker": "Enrico Bertini",
      "start": 3636482,
      "text": "Sounds great. So what's going on in Australia? We're really curious to hear. How is the data visualization seen over there? I mean, it's a big country, so it's hard to say Australia in general, but at least in Brisbane.",
      "id": "ep_89_ut_158"
    },
    {
      "end": 3725442,
      "speaker": "Simon Elvery",
      "start": 3653244,
      "text": "Yeah, absolutely, it is a big country. But, I mean, I think it's a big country with a fairly small population in the scheme of things. And the data visualization scene here is quite small in a lot of ways, but also quite diverse, I think. You know, I find that I sort of know a handful of people who are doing this sort of work inside news organizations like I am, but there are all sorts of people doing similar work in private companies and in academia, and it doesn't often have as much visibility as the work that I do, or at least it doesn't. It doesn't pop up in my filter bubble all that often. I've been running the Brisbane chapter of hacks, hackers for the last year. And just over the past year, the diversity of people who've been showing up to talk and talk about this stuff and to even present their work has really surprised me in a lot of ways for what is quite a small place, Brisbane. I think there's only about a million people live in the Brisbane metropolitan area, so it's a pretty small place.",
      "id": "ep_89_ut_159"
    },
    {
      "end": 3725802,
      "speaker": "Blaise Aboh",
      "start": 3725558,
      "text": "Yeah.",
      "id": "ep_89_ut_160"
    },
    {
      "end": 3736306,
      "speaker": "Moritz Stefaner",
      "start": 3725818,
      "text": "And I also felt there's quite a bit of things going on. So I'm a guest in a slack channel you run. It's called stories with data. So very similar name to our podcast.",
      "id": "ep_89_ut_161"
    },
    {
      "end": 3736962,
      "speaker": "Enrico Bertini",
      "start": 3736330,
      "text": "There we go.",
      "id": "ep_89_ut_162"
    },
    {
      "end": 3738714,
      "speaker": "Simon Elvery",
      "start": 3737098,
      "text": "Yeah, that's right.",
      "id": "ep_89_ut_163"
    },
    {
      "end": 3740362,
      "speaker": "Enrico Bertini",
      "start": 3738754,
      "text": "Just scrambling the word.",
      "id": "ep_89_ut_164"
    },
    {
      "end": 3768964,
      "speaker": "Moritz Stefaner",
      "start": 3740418,
      "text": "At least a good name. It's just a good name. What can you do? But I was also surprised, like, how many people are there and how much discussion is going on. And so if you're interested in the scene, I would definitely recommend to check out that Slack channel. For me, it was a good look into the scene. So, Simon, looking over the year from your perspective, what were the major developments or the big projects this year in Australia specifically and maybe also globally, if you want to touch on that.",
      "id": "ep_89_ut_165"
    },
    {
      "end": 3842922,
      "speaker": "Simon Elvery",
      "start": 3769044,
      "text": "Yeah, sure. So I think I'll call out a couple of Australian projects. First up, and as I said, I work for a news organization, so that's sort of my area. Two of the bigger organizations doing work in this area in Australia are probably the Guardian and the ABC, who I work for. And the first one I'd call out is one from the Guardian, which I really quite liked. It was in some ways quite a simple thing, but it's a project about whether your personal viewpoint is reflected in the new parliament. We had an election in the middle of this year, and so we've got a whole new set of politicians. And the Guardian did this great little interactive where you could select sort of personal attributes, you could select your gender and your age range, things like sexual orientation and education levels, and it would filter the representatives in the new federal parliament to a list that kind of matched those same attributes and just see how, really see how few parliamentarians kind of line up with your demographic.",
      "id": "ep_89_ut_166"
    },
    {
      "end": 3848490,
      "speaker": "Moritz Stefaner",
      "start": 3843018,
      "text": "That's a fresh taste, fresh take on that. Yeah, I didn't see anything like that before. It's nice. Yeah.",
      "id": "ep_89_ut_167"
    },
    {
      "end": 3869404,
      "speaker": "Simon Elvery",
      "start": 3848642,
      "text": "Yeah. In a lot of ways, as I said, it's sort of a simple little thing, but they've also done a really great kind of more detailed breakdown after that initial little piece of personal interaction. They personalized it right up front. And as you scroll down you can see a lot more detail about the breakdown, breakdown of the federal parliament.",
      "id": "ep_89_ut_168"
    },
    {
      "end": 3873464,
      "speaker": "Moritz Stefaner",
      "start": 3869984,
      "text": "Smart. Anything else? Any other projects?",
      "id": "ep_89_ut_169"
    },
    {
      "end": 3995614,
      "speaker": "Simon Elvery",
      "start": 3873584,
      "text": "Yeah, so I guess another one I'd point to is one that we did. I didn't personally work on this one, but one of the other guys in our team did most of the visualisation on it. And it's, again, about the politics and about the new parliament we've got here. And one of the issues that the new parliament has is our Senate, is the government doesn't have a majority in the Senate, so they're going to have to deal with a bunch of crossbenchers in order to get legislation through. And so there's quite a mix of funny voting blocks in the new parliament, in the Senate. And so we just wanted to really explain to people what the government's going to have to do and who they're going to have to negotiate with in order to get various pieces of their legislative agenda through the parliament. And this one, I think, actually ties in quite well to what I see as one of the trends of 2016, which is a change away from kind of these big, sprawling, undirected, exploratory data visualizations to a more focused, narrative driven visualization where you're telling a story but using visualization to kind of aid the telling of that rather than kind of be the telling of that. So as you scroll down this page, I'll just describe it a little bit. It's essentially what is Malcolm Turnbull up against in the new Senate. And as you scroll down, there's a number of scenarios that we sort of explain. And as you scroll through each of the different scenarios, these little dots that represent individual parliamentarians kind of move across the screen and stack up either to the left or the right. And it shows clearly if the votes fall that way for a particular piece of legislation, whether the legislation will pass or be blocked.",
      "id": "ep_89_ut_170"
    },
    {
      "end": 4002298,
      "speaker": "Moritz Stefaner",
      "start": 3996194,
      "text": "So very minimal integration of small data graphics that are tightly connected to the text scrolling.",
      "id": "ep_89_ut_171"
    },
    {
      "end": 4008810,
      "speaker": "Enrico Bertini",
      "start": 4002426,
      "text": "So are there any other trends that you want to highlight or maybe something globally?",
      "id": "ep_89_ut_172"
    },
    {
      "end": 4070114,
      "speaker": "Simon Elvery",
      "start": 4008882,
      "text": "Yeah, I think one of the other trends this year, which I'm really excited about actually is a move towards some more figurative visualizations. One of my favorite little visualizations for the year, I say little. It probably wasn't really when it was being built, but the New York Times did a baseball feature on Derek Jeter. I'm not a huge baseball fan, but he's a big hitter who's retired recently, and it sort of visualized his 342,000 swings of his career and used a little video of him doing a swing to visualize just how enormous that is and how his career went. And that kind of integration of a figurative element into visualization, I think, has sort of started to grow a little bit this year, and I'd expect that to take off a bit more over the coming year.",
      "id": "ep_89_ut_173"
    },
    {
      "end": 4080738,
      "speaker": "Moritz Stefaner",
      "start": 4071354,
      "text": "Absolutely. Yeah. And this opens the door to a lot of, like, very concrete experiences and not so much the super abstract, just displaying the numbers.",
      "id": "ep_89_ut_174"
    },
    {
      "end": 4152770,
      "speaker": "Simon Elvery",
      "start": 4080786,
      "text": "That's right, yeah. Other trends. So I think one of the other trends which I've sort of touched on with the smaller narrative stuff is around mobile. And I think that it's kind of a chicken and an egg thing in a lot of ways. I think mobile's sort of driving move to smaller infographics in some ways, smaller visualizations, but also I think it's forcing us to think about the usability of these sorts of things we're building and think about how people are experiencing them. And that actually might have better outcomes even for people on bigger screens. And I expect that to continue just because the take up of mobile is continuing to grow, as you'd expect. And the last trend I'd probably really be interested in seeing how it goes over the next year is I think there's been some huge changes in the tools we use this year, and especially around tools encouraging best practice for visualizations and charts and graphics in a way that they haven't been great at previously.",
      "id": "ep_89_ut_175"
    },
    {
      "end": 4155170,
      "speaker": "Enrico Bertini",
      "start": 4152882,
      "text": "Okay, can you give us some examples?",
      "id": "ep_89_ut_176"
    },
    {
      "end": 4160426,
      "speaker": "Simon Elvery",
      "start": 4155322,
      "text": "I think a good example is the way Tableau's been moving over the past year.",
      "id": "ep_89_ut_177"
    },
    {
      "end": 4163498,
      "speaker": "Enrico Bertini",
      "start": 4160570,
      "text": "Oh, yeah. You know, Tableau does a lot of that.",
      "id": "ep_89_ut_178"
    },
    {
      "end": 4170854,
      "speaker": "Simon Elvery",
      "start": 4163546,
      "text": "Yeah, absolutely. And they're making it. They're making the good stuff easier and the not so good stuff harder, and.",
      "id": "ep_89_ut_179"
    },
    {
      "end": 4178214,
      "speaker": "Enrico Bertini",
      "start": 4174274,
      "text": "Just a big bias towards good stuff, which is really good.",
      "id": "ep_89_ut_180"
    },
    {
      "end": 4187104,
      "speaker": "Simon Elvery",
      "start": 4179984,
      "text": "I listened with great interest to your podcast earlier in the year about GGplot two and just.",
      "id": "ep_89_ut_181"
    },
    {
      "end": 4190048,
      "speaker": "Enrico Bertini",
      "start": 4187224,
      "text": "Oh, yeah, it's true for Ggplot two as well.",
      "id": "ep_89_ut_182"
    },
    {
      "end": 4197044,
      "speaker": "Simon Elvery",
      "start": 4190136,
      "text": "Yeah, yeah, absolutely. How that's been deliberately designed to encourage good practices.",
      "id": "ep_89_ut_183"
    },
    {
      "end": 4220404,
      "speaker": "Moritz Stefaner",
      "start": 4198464,
      "text": "Yeah, it's true. Yeah. So looking forward, this was all 2016. Hopefully we can put a lid on that one soon, not far away. What are you hoping for next year? What types of projects would you like to see? Which of the trends would you hope to play out in which ways? If you can make a wish?",
      "id": "ep_89_ut_184"
    },
    {
      "end": 4284450,
      "speaker": "Simon Elvery",
      "start": 4221904,
      "text": "My big wish. I think from a personal perspective, because I work in the newsroom, I love to see a boost in the data literacy within newsrooms. It's getting better and better all the time, but still I run into a bit of data illiteracy around user rooms and actually around government as well. Doing an FOI request for data is a fairly painful process most of the time because your first point of contact doesn't know the basic lingo. They don't understand what a record layout is, for example, oftentimes. So it'd be great to see a bit more data literacy filtering out into more parts of my world. And along with that, improved access to data sets, to government datasets especially. But that's a trend that's already well established and I'd expect to see it continue and hope to see it continue.",
      "id": "ep_89_ut_185"
    },
    {
      "end": 4298688,
      "speaker": "Moritz Stefaner",
      "start": 4284602,
      "text": "Yeah, good wishes. That's what they come true. Thanks so much, Simon. This was a great overview. Again, if you're interested in the Australian scene, sign up for the Slack channel. How do you get there, Simon? Do you need an invite?",
      "id": "ep_89_ut_186"
    },
    {
      "end": 4311680,
      "speaker": "Simon Elvery",
      "start": 4298736,
      "text": "Probably you can get yourself an invite very easily. Just storieswithdata.com munity and put your email address in there and you're welcome to an invite. The more the merrier.",
      "id": "ep_89_ut_187"
    },
    {
      "end": 4314728,
      "speaker": "Moritz Stefaner",
      "start": 4311752,
      "text": "Perfect. That's very nice. So thanks so much for joining us.",
      "id": "ep_89_ut_188"
    },
    {
      "end": 4316928,
      "speaker": "Simon Elvery",
      "start": 4314776,
      "text": "Absolute pleasure. Thank you very much for having me.",
      "id": "ep_89_ut_189"
    },
    {
      "end": 4318568,
      "speaker": "Enrico Bertini",
      "start": 4316976,
      "text": "Thank you, Simon. Bye bye.",
      "id": "ep_89_ut_190"
    },
    {
      "end": 4319120,
      "speaker": "Moritz Stefaner",
      "start": 4318616,
      "text": "Thanks, Simon.",
      "id": "ep_89_ut_191"
    },
    {
      "end": 4319764,
      "speaker": "Simon Elvery",
      "start": 4319152,
      "text": "Cheers.",
      "id": "ep_89_ut_192"
    },
    {
      "end": 4321244,
      "speaker": "Nikita Rokotyan",
      "start": 4320064,
      "text": "Bye bye.",
      "id": "ep_89_ut_193"
    },
    {
      "end": 4329648,
      "speaker": "Moritz Stefaner",
      "start": 4325944,
      "text": "And here we have Jane on the show. Hi, Jane. Good to have you.",
      "id": "ep_89_ut_194"
    },
    {
      "end": 4330248,
      "speaker": "Enrico Bertini",
      "start": 4329696,
      "text": "Hey, Jane.",
      "id": "ep_89_ut_195"
    },
    {
      "end": 4331592,
      "speaker": "H",
      "start": 4330296,
      "text": "Hi Moritz. Hi Enrico.",
      "id": "ep_89_ut_196"
    },
    {
      "end": 4339248,
      "speaker": "Moritz Stefaner",
      "start": 4331688,
      "text": "Hey, Jane. So, Jane, can you introduce yourself briefly? Who are you, where are you located and yeah, what are you working on?",
      "id": "ep_89_ut_197"
    },
    {
      "end": 4365236,
      "speaker": "H",
      "start": 4339296,
      "text": "Okay, so I'm Jane and I'm a freelance data visualization designer based here in Hong Kong. So before I turned freelance, I was a graphics editor at South China Morning Post, which is the main english language newspaper here in Hong Kong. And then after that I moved to Singapore and worked at Thomson Reuters as part of the graphics team there. And I covered breaking news in Asia at Reuters.",
      "id": "ep_89_ut_198"
    },
    {
      "end": 4373048,
      "speaker": "Moritz Stefaner",
      "start": 4365380,
      "text": "Yeah. And now you work as a freelance designer for news graphics or what types of, of designs that you do?",
      "id": "ep_89_ut_199"
    },
    {
      "end": 4386296,
      "speaker": "H",
      "start": 4373096,
      "text": "A bit of everything, actually. So magazines, businesses, who wants dashboard designs? Yeah. Marketing material, anything, infographics?",
      "id": "ep_89_ut_200"
    },
    {
      "end": 4386856,
      "speaker": "Blaise Aboh",
      "start": 4386440,
      "text": "Yeah.",
      "id": "ep_89_ut_201"
    },
    {
      "end": 4402086,
      "speaker": "Moritz Stefaner",
      "start": 4386920,
      "text": "Nice. Very good. So you've seen a bit of the data visualization scene in Hong Kong and maybe also Singapore. How would you say? How is this scene like? Is there a lot going on? Is it different from the rest of the world? What's your perspective?",
      "id": "ep_89_ut_202"
    },
    {
      "end": 4440644,
      "speaker": "H",
      "start": 4402280,
      "text": "In my opinion, I don't think data visualization is mainstream quite just yet in Hong Kong and greater China. So the Dataviz community right now revolves mostly around news still. And there are some really great graphics teams within the local newspapers like SCMP in Hong Kong and Tsinghua in China. And then there are also a lot of international media organizations who have set up Asia offices in Hong Kong. So companies like FT and Bloomberg and Reuters in Singapore.",
      "id": "ep_89_ut_203"
    },
    {
      "end": 4449312,
      "speaker": "Moritz Stefaner",
      "start": 4442024,
      "text": "But you would say it's still an emerging scene. It's maybe not so far ahead as in other regions.",
      "id": "ep_89_ut_204"
    },
    {
      "end": 4463094,
      "speaker": "H",
      "start": 4449368,
      "text": "Yeah, I think it hasn't gone quite as popular as in the US and European just yet, but hopefully. Well, I hope selfishly that it's going to come very soon.",
      "id": "ep_89_ut_205"
    },
    {
      "end": 4485574,
      "speaker": "Moritz Stefaner",
      "start": 4465474,
      "text": "And in terms of approach and style, is it different from what you see, let's say, coming out of Europe or the US, or would you say it's fairly similar? I know, for instance, your work, it always struck me as fairly original and fairly creative. Is that more an outlier, or will you say there's also different visual language?",
      "id": "ep_89_ut_206"
    },
    {
      "end": 4537954,
      "speaker": "H",
      "start": 4485954,
      "text": "Definitely a different visual language. From the few years that I've been in Asia, I've been learning a lot about very unique behaviors that chinese audiences have online and offline. And that's something that I really want there to be more discussions of these cultural differences because, for example, one thing that stands out is just the, the characters in Chinese are not like English, so they're very block like, kind of just blocky characters. And that has huge kind of impact on how you design things because we don't get to use things like italics as much. And typography is totally different. Yeah. So it's very interesting.",
      "id": "ep_89_ut_207"
    },
    {
      "end": 4558150,
      "speaker": "Enrico Bertini",
      "start": 4538114,
      "text": "Yeah. And typography is a big component in visual, right? Yeah. Yeah. So it's very interesting to hear what is happening on that side of the world. I mean, there's so much going on in China and I think it's. I'm sure there is a lot of this happening there as well.",
      "id": "ep_89_ut_208"
    },
    {
      "end": 4573370,
      "speaker": "H",
      "start": 4558222,
      "text": "Yeah, I'm trying to kind of tap into it. It's not very widespread, but I'm quite sure there are kind of agencies doing it, but the work are just not public.",
      "id": "ep_89_ut_209"
    },
    {
      "end": 4585946,
      "speaker": "Enrico Bertini",
      "start": 4573522,
      "text": "So talking about the major developments in 2016, are there any projects that you particularly liked and you want to highlight, especially from the Asian region?",
      "id": "ep_89_ut_210"
    },
    {
      "end": 4666668,
      "speaker": "H",
      "start": 4586130,
      "text": "I haven't really seen. I come from a news background, so I haven't really seen huge projects coming out of Asia that to do with Dataviz. But another area that I've kind of noticed that data is happening quite a lot is the art scene. So there are quite a lot of these kind of new media art projects that kind of uses data as a basis. And one of these projects is called radiance, and it's from a local new media art studio called XEX in Hong Kong. And it's kind of like an audio visual piece that uses live radiation data. And so the idea came from the earthquake in Japan and where the nuclear thing happened, and they were collecting a lot of radiation data. And I think the project is use that to kind of generate, actually generate a cityscape where you can kind of go through the city and have these different levels of radiation represent different things in the cityscape. It's really quite nice. I can send you guys the link to have a look.",
      "id": "ep_89_ut_211"
    },
    {
      "end": 4671196,
      "speaker": "Moritz Stefaner",
      "start": 4666796,
      "text": "We will definitely put it in the blog post. Yeah. Any other trends you want to mention?",
      "id": "ep_89_ut_212"
    },
    {
      "end": 4701172,
      "speaker": "H",
      "start": 4671300,
      "text": "Well, going back to news, I think I'm seeing quite a lot of local media starting to do visual and data journalism. And most recently this year, Hong Kong. There's been quite a lot of coverage about the legislative council elections. And I'm actually seeing a lot of data driven journalism, which I've never seen before because traditionally, I think Chinese is quite text based. It's brilliant.",
      "id": "ep_89_ut_213"
    },
    {
      "end": 4702596,
      "speaker": "Enrico Bertini",
      "start": 4701228,
      "text": "Yeah, politics is big.",
      "id": "ep_89_ut_214"
    },
    {
      "end": 4704052,
      "speaker": "H",
      "start": 4702660,
      "text": "I know it's a huge.",
      "id": "ep_89_ut_215"
    },
    {
      "end": 4705332,
      "speaker": "Enrico Bertini",
      "start": 4704108,
      "text": "That's what we are noticing.",
      "id": "ep_89_ut_216"
    },
    {
      "end": 4707084,
      "speaker": "H",
      "start": 4705428,
      "text": "I think it's a huge year for databases.",
      "id": "ep_89_ut_217"
    },
    {
      "end": 4725076,
      "speaker": "Enrico Bertini",
      "start": 4707124,
      "text": "The common thread is politics. It's a constant variable across the globe. So anything else? Maybe more on the global side of this? Any major projects that you want to highlight?",
      "id": "ep_89_ut_218"
    },
    {
      "end": 4758274,
      "speaker": "H",
      "start": 4725220,
      "text": "Something I've noticed, and I'm really liking the direction this is taking, is that following Stephanie and George's D data project, I'm seeing a lot more visualizations that focuses on cultural data and kind of personal, manually collected data. And I think it's. I love it. There's so much interesting work happening around topics like music and sports and popular culture. Just really fun. A counterbalance to all that politics, I guess.",
      "id": "ep_89_ut_219"
    },
    {
      "end": 4767474,
      "speaker": "Enrico Bertini",
      "start": 4761094,
      "text": "Let's take it easy. Easier. Anything else?",
      "id": "ep_89_ut_220"
    },
    {
      "end": 4831970,
      "speaker": "H",
      "start": 4768694,
      "text": "Oh, well, yeah, just going back to news again, I think Archie's kind of talk at Malofiej this year has kind of garnered a lot of attention as to what, when it's appropriate to do interactive storytelling in news. And there's a great series of FT articles that talks about that as well. And I think it's a really good conversation and discussion to have in the newsroom because it's so easy to just get caught up in doing very fancy, nice, interactive, but the resources that it takes to do those projects and also the time, sometimes it's just better, I think, in terms of. In kind of like a breaking news context to do more kind of straightforward graphics that tell a lot more. And it's less about decoration.",
      "id": "ep_89_ut_221"
    },
    {
      "end": 4853734,
      "speaker": "Moritz Stefaner",
      "start": 4832082,
      "text": "Yeah, that's a general thing we hear is that this towards a focus on much more simple, but much more targeted visualizations has been huge for many people this year. So, looking forward, what do you hope for for next year? What are the types of projects you would be hoping to see and. Yeah, what are you hoping for?",
      "id": "ep_89_ut_222"
    },
    {
      "end": 4891646,
      "speaker": "H",
      "start": 4853774,
      "text": "Well, I'm definitely hoping for more projects to come out of the Asian region and for them to have a more kind of a public platform so other people can know about them also, I think, yeah, as I mentioned before, I'd love to see more kind of discussions around the topic of cross cultural considerations when designing data visualizations or just kind of design in general. Yeah, I think that would be a great direction to take next year or just in the future.",
      "id": "ep_89_ut_223"
    },
    {
      "end": 4903194,
      "speaker": "Moritz Stefaner",
      "start": 4891790,
      "text": "Yeah, we are hoping for that, too. We would love to see more coming from across the world and maybe we can find somehow a platform to make more of this diversity available. I think that would be great.",
      "id": "ep_89_ut_224"
    },
    {
      "end": 4906594,
      "speaker": "Enrico Bertini",
      "start": 4905414,
      "text": "That's crucial.",
      "id": "ep_89_ut_225"
    },
    {
      "end": 4913434,
      "speaker": "Moritz Stefaner",
      "start": 4907094,
      "text": "Thanks so much, Jane. This has been great and we're much looking forward to see what's happening next year. Thank you.",
      "id": "ep_89_ut_226"
    },
    {
      "end": 4915048,
      "speaker": "Enrico Bertini",
      "start": 4914224,
      "text": "Thanks, Jane.",
      "id": "ep_89_ut_227"
    },
    {
      "end": 4915512,
      "speaker": "H",
      "start": 4915096,
      "text": "Thank you.",
      "id": "ep_89_ut_228"
    },
    {
      "end": 4916048,
      "speaker": "Moritz Stefaner",
      "start": 4915568,
      "text": "Thank you.",
      "id": "ep_89_ut_229"
    },
    {
      "end": 4925984,
      "speaker": "Enrico Bertini",
      "start": 4916096,
      "text": "Bye bye bye. Okay, that's been quite a nice trip around the world, Moritz, huh?",
      "id": "ep_89_ut_230"
    },
    {
      "end": 4929896,
      "speaker": "Moritz Stefaner",
      "start": 4926064,
      "text": "Yeah, yeah, super nice. We really enjoyed doing this and.",
      "id": "ep_89_ut_231"
    },
    {
      "end": 4931816,
      "speaker": "Enrico Bertini",
      "start": 4930080,
      "text": "Yeah, it's been amazing. I loved it.",
      "id": "ep_89_ut_232"
    },
    {
      "end": 4935204,
      "speaker": "Moritz Stefaner",
      "start": 4931880,
      "text": "Yeah. Thanks for all of our guests to showing us a bit around.",
      "id": "ep_89_ut_233"
    },
    {
      "end": 4944804,
      "speaker": "Enrico Bertini",
      "start": 4936384,
      "text": "Yeah. And spending quite some time with us, not just recording, but also preparing for the recording, which is not that easy.",
      "id": "ep_89_ut_234"
    },
    {
      "end": 4946752,
      "speaker": "Moritz Stefaner",
      "start": 4945944,
      "text": "That's true.",
      "id": "ep_89_ut_235"
    },
    {
      "end": 4959824,
      "speaker": "Enrico Bertini",
      "start": 4946848,
      "text": "So I think we want to conclude by kind of like, summarizing what we have heard from all these different people. And there are a few trends that we have identified. Right, Moritz?",
      "id": "ep_89_ut_236"
    },
    {
      "end": 4995868,
      "speaker": "Moritz Stefaner",
      "start": 4959904,
      "text": "Yeah, absolutely. So I think it was also interesting that everybody had their unique perspective, but some things connected all of the different conversations we had. And, I mean, one of them was surely this whole idea of using data visualization to understand your government better, to work with open data to improve society, to maybe combat corruption, you know, and really use visualization as a force for good, for society. Basically. I think this is something that, in a way, everybody touched on. Right. And this seems to be one of the big topics right now that's such a common thread.",
      "id": "ep_89_ut_237"
    },
    {
      "end": 5001302,
      "speaker": "Enrico Bertini",
      "start": 4995956,
      "text": "Every, everyone. I mean, politics is a major, major, right?",
      "id": "ep_89_ut_238"
    },
    {
      "end": 5001838,
      "speaker": "Moritz Stefaner",
      "start": 5001398,
      "text": "Yeah.",
      "id": "ep_89_ut_239"
    },
    {
      "end": 5003294,
      "speaker": "Enrico Bertini",
      "start": 5001926,
      "text": "And there were also a lot of.",
      "id": "ep_89_ut_240"
    },
    {
      "end": 5019678,
      "speaker": "Moritz Stefaner",
      "start": 5003334,
      "text": "Elections this year, lots of political decisions. Yeah. And I think what also puzzled us quite a bit is this whole question of what can we actually achieve with data and exactly how do we deal with this? Like how to data visit a post factual world. This is one of the questions I had online.",
      "id": "ep_89_ut_241"
    },
    {
      "end": 5027232,
      "speaker": "Enrico Bertini",
      "start": 5019806,
      "text": "Yeah. Can we make a difference? Can we make a difference. That's always the constant underlying question. Right?",
      "id": "ep_89_ut_242"
    },
    {
      "end": 5062044,
      "speaker": "Moritz Stefaner",
      "start": 5027358,
      "text": "Yeah. And how do you communicate with data? And how do you deal or treat data the right way? Because, you know, on the one hand, some people are totally immune to fact based and data based arguments, and you need to find other strategies, and other people are maybe believing too much in data. You know, we've seen the polling errors, and people were, like, totally hung up on these percentages and forgot that these percentages are super fuzzy probability estimates, you know? And so I think it's been very interesting this year in terms of how we relate to numbers.",
      "id": "ep_89_ut_243"
    },
    {
      "end": 5063056,
      "speaker": "Nikita Rokotyan",
      "start": 5062744,
      "text": "Yeah.",
      "id": "ep_89_ut_244"
    },
    {
      "end": 5085294,
      "speaker": "Enrico Bertini",
      "start": 5063080,
      "text": "And have you heard this sentence, past fact politics or past fact era? It seems to go exactly in the opposite direction we are trying to go here. So it's so. I don't know. I think in a way, it can be depressing, but I think it should also be exciting. Let's go out there and show that we can reason with data. That's very important. Right. It's up to us to do that.",
      "id": "ep_89_ut_245"
    },
    {
      "end": 5122924,
      "speaker": "Moritz Stefaner",
      "start": 5086674,
      "text": "Yeah. And that maybe ties into the next bigger theme. Like, we heard a lot of people talk about that things are moving more into a more narrative, much more focused direction in terms of data visualization. Like, do smaller things, but in a smarter way. Think about what it actually communicates, how it fits into a narrative. And also, just being lean and reduced obviously works well on mobile, which has been the third big thing is like, yeah, we move away from desktop computing, and this also means moving away from a few of the formats we are used to, like huge websites with lots of options.",
      "id": "ep_89_ut_246"
    },
    {
      "end": 5134994,
      "speaker": "Enrico Bertini",
      "start": 5124464,
      "text": "I think that's inevitable. Right? I mean, all the eyes are there. Most of our eyes are on mobile devices. Right. So it makes a lot of sense.",
      "id": "ep_89_ut_247"
    },
    {
      "end": 5192652,
      "speaker": "Moritz Stefaner",
      "start": 5135494,
      "text": "Two things I also found interesting, or what two of our guests mentioned, Nikita and Jane at the end, that they said their local data visualization scenes have lots of interesting exchange with the art scene and the experimental media design scene and generative design. And this is something I really like, and I think this is a huge opportunity of these more local scenes. Even if you say data visualization is maybe not that developed in a certain area, but I think there's a huge quality in then maybe working together with other related scenes. And this can totally result in totally new ways to look at the field. I think this can actually be a big plus. If you actually work somewhere where there's not that clearly defined data visualization scene, maybe it's a huge opportunity, and I'm really curious of what comes out of there.",
      "id": "ep_89_ut_248"
    },
    {
      "end": 5217136,
      "speaker": "Enrico Bertini",
      "start": 5192788,
      "text": "Absolutely. I think if there is one great thing of data. Visualization is always trying, people trying to cross this line between, I don't know, the very formal and rigid and the very artistic and creative. That's what makes this field, I don't know, at least for me, fantastic. We are all attracted by this dichotomy in a way. I hope to see more of that.",
      "id": "ep_89_ut_249"
    },
    {
      "end": 5218312,
      "speaker": "Moritz Stefaner",
      "start": 5217300,
      "text": "That's true. Yeah.",
      "id": "ep_89_ut_250"
    },
    {
      "end": 5227688,
      "speaker": "Enrico Bertini",
      "start": 5218368,
      "text": "What I have not seen is a lot of interesting projects on VR devices. This is still to come.",
      "id": "ep_89_ut_251"
    },
    {
      "end": 5228800,
      "speaker": "Moritz Stefaner",
      "start": 5227816,
      "text": "3D is still.",
      "id": "ep_89_ut_252"
    },
    {
      "end": 5238728,
      "speaker": "Enrico Bertini",
      "start": 5228872,
      "text": "I think that's what we mentioned last year. We said that maybe VR would be one of the major trends of 2016. It didn't really happen. Right?",
      "id": "ep_89_ut_253"
    },
    {
      "end": 5239368,
      "speaker": "Moritz Stefaner",
      "start": 5238776,
      "text": "Predictions?",
      "id": "ep_89_ut_254"
    },
    {
      "end": 5242004,
      "speaker": "Enrico Bertini",
      "start": 5239456,
      "text": "Predictions, yeah, of course.",
      "id": "ep_89_ut_255"
    },
    {
      "end": 5253340,
      "speaker": "Moritz Stefaner",
      "start": 5242964,
      "text": "That's a really interesting question. I'm sort of on the fence there, so I'm not even sure if you are trend is as big as some people thought. But I mean, there could be.",
      "id": "ep_89_ut_256"
    },
    {
      "end": 5301364,
      "speaker": "Enrico Bertini",
      "start": 5253532,
      "text": "That's what makes it interesting. We are skeptical. Makes it interesting. So you guys listening blow our mind by creating some amazing, amazing VR bass? Yeah, yeah, we'll see. Yeah, yeah. So, yeah, I have to say that that's been an amazing experience talking with so many people from all over the world. Of course, there are quite a few countries that we couldn't cover, but it's pretty well spread out. So I'm really happy for being able to cover quite a bit of the world with this first experiment and it's been amazing. I don't know, I think it's been very enriching for me to hear what people are doing around the world, and I hope we can do more of that in the future. Right?",
      "id": "ep_89_ut_257"
    },
    {
      "end": 5327772,
      "speaker": "Moritz Stefaner",
      "start": 5301984,
      "text": "Yeah. I mean, living in a bubble has been another information bubbles, and I hope we can maybe burst some of them a bit or join some of them to make a bigger bubble at least. So I hope we can continue this and sort of maybe move a bit beyond our very euro and us centric perspectives. That's my hope for the podcast in general. I think there's a lot we can learn from everybody, and the world is.",
      "id": "ep_89_ut_258"
    },
    {
      "end": 5349274,
      "speaker": "Enrico Bertini",
      "start": 5327788,
      "text": "Big and amazing people. Amazing people. There are amazing people out there. Right. So I think it's very important to keep our eyes open and just look around. We are so, as you said, us and eurocentric, and I don't think it's a good thing. I think we really need to look around. That's one thing that I learned at the end of 2020 2016.",
      "id": "ep_89_ut_259"
    },
    {
      "end": 5358598,
      "speaker": "Moritz Stefaner",
      "start": 5351574,
      "text": "Yeah. So looking forward, we also have a few changes coming up for the podcast. Nothing major, but yeah, we're still nothing.",
      "id": "ep_89_ut_260"
    },
    {
      "end": 5361838,
      "speaker": "Enrico Bertini",
      "start": 5358646,
      "text": "Major trying to, but we're constantly evolving.",
      "id": "ep_89_ut_261"
    },
    {
      "end": 5366354,
      "speaker": "Moritz Stefaner",
      "start": 5361966,
      "text": "Yeah, exactly. So we have great ideas for guests, but we won't tell you who.",
      "id": "ep_89_ut_262"
    },
    {
      "end": 5367758,
      "speaker": "Enrico Bertini",
      "start": 5366694,
      "text": "We won't spoil it.",
      "id": "ep_89_ut_263"
    },
    {
      "end": 5400314,
      "speaker": "Moritz Stefaner",
      "start": 5367806,
      "text": "No, no. But there's good stuff coming up. And what we're also trying is to change the model a bit. So right now, we used to have ads at the beginning and the middle and the end, as you know. And, yeah, we need some income to just keep the show running. We have costs. We have people working on the show. There's Destry, who does an amazing job of organizing a lot behind the scenes, you know, all the logistics and the production side. And we have Florian, who does the audio editing. And as you can imagine, that's not always easy.",
      "id": "ep_89_ut_264"
    },
    {
      "end": 5404514,
      "speaker": "Enrico Bertini",
      "start": 5403074,
      "text": "It's bumpy.",
      "id": "ep_89_ut_265"
    },
    {
      "end": 5424586,
      "speaker": "Moritz Stefaner",
      "start": 5404674,
      "text": "So we do need some money. But one thing we figured out is that if we can change the ad format to just have small ads at the beginning and the end and still get by fine, which is great. So this is what we will do now for the next six months. And in parallel, we're also trying something new. Right, Enrico?",
      "id": "ep_89_ut_266"
    },
    {
      "end": 5488258,
      "speaker": "Enrico Bertini",
      "start": 5424730,
      "text": "Yeah. So one thing we would love to do is to transition to having the show completely crowdfunded. And we are looking into Patreon. If you're not familiar with, Patreon is a new platform, and it's becoming incredibly, incredibly successful. There are lots of people out there who are financing their show or other endeavors to Patreon. So the way Patreon works is that you subscribe to Patreon and you commit to paying a small fee. You can choose among a range of amounts. And every time we publish a new episode, you would pay this fee. Okay. And so what we want to do is say if this is to see if this is possible. So we want to slowly transition to this new model. And that would mean that if we manage to completely transition, then we will be able to remove our ads completely, which I think it's a good thing. But it's not just that. It's also the fact that the show would be supported by you, by our community. And I think that would be amazing. Right, Moritz?",
      "id": "ep_89_ut_267"
    },
    {
      "end": 5536774,
      "speaker": "Moritz Stefaner",
      "start": 5488346,
      "text": "Yeah, I think that would just be nice. And I think if everybody chips in with a few dollars per month, then we can quickly have all the money together that we need. So we set up the Patreon page already so you can go on our website, and there's a link on the start page. There will also be a link in the blog post, of course, and you can think about, do you want to maybe chip in with a few dollars or euros or yen, whatever your local currency is. And I think the way we will do it is so we have a fixed cost per episode. And once we reach that cost in terms of budget, we can do one ad free show, basically. And the more we collect, the more ad free shows we can do. And maybe at some point we can switch over to totally ad free podcast, which would be nice. Nice.",
      "id": "ep_89_ut_268"
    },
    {
      "end": 5537850,
      "speaker": "Enrico Bertini",
      "start": 5537234,
      "text": "Yeah.",
      "id": "ep_89_ut_269"
    },
    {
      "end": 5550298,
      "speaker": "Moritz Stefaner",
      "start": 5537962,
      "text": "But the ads are fine, too. So you can, you know, you can pick it yourself. But if you want to support us in that way to being fully crowdfunded, it would be amazing and we would be very happy. So check it out. Yeah.",
      "id": "ep_89_ut_270"
    },
    {
      "end": 5559042,
      "speaker": "Enrico Bertini",
      "start": 5550426,
      "text": "So that said, I think that's our last episode for 2016. So I really want to thank Destry and Florian for their amazing work.",
      "id": "ep_89_ut_271"
    },
    {
      "end": 5559578,
      "speaker": "Moritz Stefaner",
      "start": 5559098,
      "text": "Absolutely.",
      "id": "ep_89_ut_272"
    },
    {
      "end": 5571742,
      "speaker": "Enrico Bertini",
      "start": 5559626,
      "text": "I mean, we are at the stage where without them, the show just cannot happen. So huge, huge, huge thank yous to Florian and Destry. Thanks a lot. It's been amazing working.",
      "id": "ep_89_ut_273"
    },
    {
      "end": 5572238,
      "speaker": "Moritz Stefaner",
      "start": 5571798,
      "text": "Absolutely.",
      "id": "ep_89_ut_274"
    },
    {
      "end": 5572942,
      "speaker": "Blaise Aboh",
      "start": 5572286,
      "text": "Throughout the year.",
      "id": "ep_89_ut_275"
    },
    {
      "end": 5573470,
      "speaker": "Enrico Bertini",
      "start": 5572958,
      "text": "Absolutely.",
      "id": "ep_89_ut_276"
    },
    {
      "end": 5575286,
      "speaker": "Moritz Stefaner",
      "start": 5573622,
      "text": "And thanks to you for listening.",
      "id": "ep_89_ut_277"
    },
    {
      "end": 5576422,
      "speaker": "Enrico Bertini",
      "start": 5575430,
      "text": "Yeah, exactly.",
      "id": "ep_89_ut_278"
    },
    {
      "end": 5577726,
      "speaker": "Moritz Stefaner",
      "start": 5576518,
      "text": "Without listeners.",
      "id": "ep_89_ut_279"
    },
    {
      "end": 5598460,
      "speaker": "Enrico Bertini",
      "start": 5577910,
      "text": "Without listeners, it doesn't make any sense doing this. So it's been another amazing year. I'm really happy that we've been covering so many different things. That's such an enriching experience for us in the first place. Even. I mean, even just creating the show is such an enriching experience. So I'm really happy.",
      "id": "ep_89_ut_280"
    },
    {
      "end": 5599220,
      "speaker": "Moritz Stefaner",
      "start": 5598572,
      "text": "Yeah.",
      "id": "ep_89_ut_281"
    },
    {
      "end": 5602604,
      "speaker": "Enrico Bertini",
      "start": 5599372,
      "text": "I think we can close it here. Happy new year.",
      "id": "ep_89_ut_282"
    },
    {
      "end": 5604284,
      "speaker": "Moritz Stefaner",
      "start": 5602644,
      "text": "It's been a good year. Partly.",
      "id": "ep_89_ut_283"
    },
    {
      "end": 5609412,
      "speaker": "Enrico Bertini",
      "start": 5604324,
      "text": "Yeah. Partly. Well, let's talk about the positive stuff.",
      "id": "ep_89_ut_284"
    },
    {
      "end": 5618864,
      "speaker": "Moritz Stefaner",
      "start": 5609508,
      "text": "Exactly. Yeah. And 2017 might be even better. We'll see. Yeah. So see you on the other side.",
      "id": "ep_89_ut_285"
    },
    {
      "end": 5621844,
      "speaker": "Enrico Bertini",
      "start": 5619244,
      "text": "See you on the other side. Happy holidays.",
      "id": "ep_89_ut_286"
    },
    {
      "end": 5622804,
      "speaker": "Moritz Stefaner",
      "start": 5622004,
      "text": "Bye bye.",
      "id": "ep_89_ut_287"
    },
    {
      "end": 5623984,
      "speaker": "Enrico Bertini",
      "start": 5622924,
      "text": "Bye bye, everyone.",
      "id": "ep_89_ut_288"
    },
    {
      "end": 5632076,
      "speaker": "Simon Elvery",
      "start": 5631444,
      "text": "Hey, guys.",
      "id": "ep_89_ut_289"
    },
    {
      "end": 5641112,
      "speaker": "Enrico Bertini",
      "start": 5632140,
      "text": "Thanks for listening to data stories again. Before you leave, we have a request if you can spend a couple of minutes rating us on iTunes, that would be extremely helpful for the show.",
      "id": "ep_89_ut_290"
    },
    {
      "end": 5671892,
      "speaker": "Moritz Stefaner",
      "start": 5641228,
      "text": "And here's also some information on the many ways you can get news directly from us. We're, of course, on twitter@twitter.com. Datastories. We have a Facebook page@Facebook.com, datastoriespodcast. All in one word. And we also have an email newsletter. So if you want to get news directly into your inbox and be notified whenever we publish an episode, you can go to our homepage, datastory.com dot, and look for the link that you find on the bottom in the footer.",
      "id": "ep_89_ut_291"
    },
    {
      "end": 5683996,
      "speaker": "Enrico Bertini",
      "start": 5671988,
      "text": "So one last thing that we want to tell you is that we love to get in touch with our listeners, especially if you want to suggest a way to improve the show or amazing people you want us to invite or even projects you want us to talk about.",
      "id": "ep_89_ut_292"
    },
    {
      "end": 5717334,
      "speaker": "Moritz Stefaner",
      "start": 5684100,
      "text": "Yeah, absolutely. So don't hesitate to get in touch with us. It's always a great thing for us. And that's all for now. See you next time, and thanks for listening today. Data stories data stories is brought to you by Qlik, who allows you to explore the hidden relationships within your data that lead to meaningful insights. Let your instincts lead the way to create personalized visualizations and dynamic dashboards with Qlik sense, which you can download for free at Qlik deries. That's Qlik de.",
      "id": "ep_89_ut_293"
    }
  ],
  "confidence": 0.921005822980218,
  "audio_duration": 5718,
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_status_code": null,
  "webhook_auth": false,
  "webhook_auth_header_name": null,
  "speed_boost": false,
  "auto_highlights_result": null,
  "auto_highlights": false,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_audio_quality": null,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "content_safety": false,
  "iab_categories": true,
  "content_safety_labels": {
    "status": "unavailable",
    "results": [],
    "summary": {}
  },
  "language_detection": false,
  "language_detection_threshold": null,
  "language_confidence": null,
  "custom_spelling": null,
  "throttled": false,
  "auto_chapters": true,
  "summarization": false,
  "summary_type": null,
  "summary_model": null,
  "custom_topics": false,
  "topics": [],
  "speech_threshold": null,
  "speech_model": "best",
  "chapters": [
    {
      "summary": "Enrico: We decided to go around the world for the first time. We have been talking with a total of six people from many different countries. We also asked all of them what their local scenes look like. What they thought were the most significant developments.",
      "gist": "Around the World",
      "headline": "Data stories is brought to you by Qlik, who allows you to explore hidden relationships",
      "start": 200,
      "end": 133430,
      "id": "ep_89_ch_0"
    },
    {
      "summary": "Christina is a data visualization designer. She works at Ericsson R and D center in Budapest. She also teaches data visualization course at Central European University. Christina is also well known for her very original and crafty data visualizations.",
      "gist": "Data Visualization in 60 Seconds",
      "headline": "Christina is a data visualization designer based in Hungary",
      "start": 133622,
      "end": 209460,
      "id": "ep_89_ch_1"
    },
    {
      "summary": "Most data visualizations here are on nonprofit news sites. They are creating visualizations about the work of the government. Some of the designers use real data and the output starts to look like a data visualization. I think sooner or later some of them will become data visualization designers.",
      "gist": "How is data visualization seen in Hungary?",
      "headline": "Most data visualizations in Hungary are on nonprofit news sites",
      "start": 209572,
      "end": 322300,
      "id": "ep_89_ch_2"
    },
    {
      "summary": "The biggest thing for data visualization here in Budapest is that finally we started a data visualization meetup. Are you involved in the organization? Not so much. I usually recommend people, so I don't organize.",
      "gist": "What's happening in the world of data visualization in 2019?",
      "headline": "Budapest finally started a data visualization meetup this year",
      "start": 322372,
      "end": 399190,
      "id": "ep_89_ch_3"
    },
    {
      "summary": "Two days ago was this 24 hours data visualization hackathon that was using data from T Mobile Hungary. Why are there so many competitions here in Hungary, by many, if you consider the size of the country. The impulse is often to make a hackathon or a competition. But I think it can be a stepping stone.",
      "gist": "Hungary's big data visualization competitions",
      "headline": "There are many data visualization competitions in Hungary, by many",
      "start": 399342,
      "end": 569054,
      "id": "ep_89_ch_4"
    },
    {
      "summary": "In Hungary, almost many people knows their data. Even developers were interested in that book in my company. Data has been such an amazing success story. Maybe we should do another episode on the radar.",
      "gist": "A Year in the Life of Data",
      "headline": "In Hungary, almost many people knows their data",
      "start": 571954,
      "end": 626176,
      "id": "ep_89_ch_5"
    },
    {
      "summary": " Christina: I hope to see more data visualization from all the new sites and not just from the nonprofit ones. Other thing I'm interested in is some collaboration between telecom innovation laboratories and Hungarian universities. I can't wait to see what comes out of Budapest the next few years.",
      "gist": "Top 10 Tech Projects of 2015",
      "headline": "So, Christina, is there something you hope for for next year",
      "start": 626320,
      "end": 749004,
      "id": "ep_89_ch_6"
    },
    {
      "summary": "Blaise Appo is the co founder of a company called Orodata Science. The company uses data visualizations to simplify public information. Says Nigeria is still pretty much backwards in terms of data visualization. Says the space is still very open, too.",
      "gist": "How data visualization is being taught in Nigeria",
      "headline": "Blaise Aboh is the co founder of Orodata Science",
      "start": 753304,
      "end": 1023080,
      "id": "ep_89_ch_7"
    },
    {
      "summary": "Data visualization and infographics have not been used on nigerian Twitter before to drive engagement and citizen inclusion towards the election. We produced a lot of information products centered around the elections. For everyone we published, they all went viral.",
      "gist": "How Data Visualization impacted the Nigeria election",
      "headline": "Data visualization was used to help Nigerians prepare for the 2015 elections",
      "start": 1023192,
      "end": 1288794,
      "id": "ep_89_ch_8"
    },
    {
      "summary": "Blaise: We've been trying to tell a lot of stories using infographics. Most importantly, we've tried to focus on crisis. We have started telling stories using data visualization as well. We will definitely put them in the blog post so people can study it in detail.",
      "gist": "2016: Storytelling through infographics",
      "headline": "Blaise: We've been trying to tell stories using infographics",
      "start": 1289694,
      "end": 1373384,
      "id": "ep_89_ch_9"
    },
    {
      "summary": "Looking forward, looking at 2017, what would you hope for? If you can make a wish for the data visualization scene in Nigeria, what are you hoping for?",
      "gist": "Data Visualization in Nigeria:",
      "headline": "Looking forward, looking at 2017, what would you hope for the data visualization scene in Nigeria",
      "start": 1374284,
      "end": 1543814,
      "id": "ep_89_ch_10"
    },
    {
      "summary": "Next up is Simone. Hi, Simone. How are you doing? Hi, Enrico. Great to have you on. I'm great, thanks.",
      "gist": "Democracy on TV",
      "headline": "Next up is Simone. Hi, Simone. How are you doing",
      "start": 1547874,
      "end": 1556084,
      "id": "ep_89_ch_11"
    },
    {
      "summary": "Simone is based in Sao Paulo, Brazil. She has been working as an art editor for most of the year since 2015. Her background is in news for infographics, also for both print and the web. Has experimented with game engines and virtual reality.",
      "gist": "Simone Follate",
      "headline": "Simone Folate is an art editor at a Brazilian newspaper",
      "start": 1556784,
      "end": 1687914,
      "id": "ep_89_ch_12"
    },
    {
      "summary": "In Brazil and I think in South America in general also, we have like a big tradition on more traditional infographics. There are good projects in Dataviz, but I think there is still a lot of place to grow on that field.",
      "gist": "What is the role of infographics in newsrooms?",
      "headline": "Simone: I think there is still room to grow in infographics",
      "start": 1688074,
      "end": 1837440,
      "id": "ep_89_ch_13"
    },
    {
      "summary": "Brazil has had a good year for cartography. The approach to maps is getting more mature. The discussion on maps, it's getting more closer to the readers. The map nerds are winning.",
      "gist": "2016: A year in the world of maps",
      "headline": "So looking back over the last year, if you had to pick really cool major developments",
      "start": 1837552,
      "end": 2194284,
      "id": "ep_89_ch_14"
    },
    {
      "summary": "Brazil has a lack of good public data or organized and usable data from public administrations. Sao Paulo has started to build and to open platforms for, to share their data. That's something I'm expecting to happen as we are shifting local administrations here.",
      "gist": "2016: Big Hopes for 2017",
      "headline": "One big challenge for data journalism is lack of good public data",
      "start": 2194904,
      "end": 2291210,
      "id": "ep_89_ch_15"
    },
    {
      "summary": "Brazil has more than 30 parties. You need data analysis just to understand who's actually in the opposition. There's fields there to do data analysis and data visualizations to show and explain what is going on.",
      "gist": "Brazil's political landscape",
      "headline": "Brazil has more than 30 political parties, which is crazy",
      "start": 2291402,
      "end": 2456578,
      "id": "ep_89_ch_16"
    },
    {
      "summary": "Simon: I think there is a general concern in terms of format when we doing visual storytelling and dealing with visual data. Mobile is such a big challenge. I hope somebody will tackle that next year in Brazil. And I also appreciate you mentioning the political and the open data potential.",
      "gist": "Storytelling from data",
      "headline": "Simone: There is a concern about format when dealing with visual data",
      "start": 2456746,
      "end": 2747444,
      "id": "ep_89_ch_17"
    },
    {
      "summary": "CLIC is organizing a webinar on the top bi trends for 2017. Join Qlik senior director and former Gartner analyst Dan Sommer for his top ten predictions. Don't miss out and reserve your spot today.",
      "gist": "Top 10 Analytics Trends for 2017",
      "headline": "CLIC is organizing a webinar on the top bi trends for 2017",
      "start": 2752024,
      "end": 2849088,
      "id": "ep_89_ch_18"
    },
    {
      "summary": "Nikita (Rokotyan) is partially data visualization engineer, partially scientist. His background is science and another is creative technology and design. Join the clic seminar on the top bi trends for 2017.",
      "gist": "Top 3 data visualization trends for 2017",
      "headline": "Nikita is partially data visualization engineer, partially scientist",
      "start": 2849216,
      "end": 3070924,
      "id": "ep_89_ch_19"
    },
    {
      "summary": "There are more and more people who are starting doing this, usually in Moscow for sure. I really think that there is a big future for data visualization in Russia. But as you say, it's mostly coming from Moscow. It might have to spread out to other places too.",
      "gist": "What is the situation in Russia around data visualization?",
      "headline": "I think there is a big future for data visualization in Russia",
      "start": 3071854,
      "end": 3197224,
      "id": "ep_89_ch_20"
    },
    {
      "summary": "Google executive: Are there some projects or some developments that you would mention where you say, yeah, this is going in an interesting direction? Both, as you like. Let's start with our Russian projects. And globally, are there any things globally you would mentioning from your perspective?",
      "gist": "A Year in Data Visualization",
      "headline": "Can you still thinking back over the year, are there some projects or some developments",
      "start": 3197844,
      "end": 3380176,
      "id": "ep_89_ch_21"
    },
    {
      "summary": "Nikita: I really hope to see more data visualization activities here in Russia. He wants to explore more 3d rendering libraries that can be used for data visualization in web environment. Nikita: Data visualization can play a huge role in popularizing and making more accessible all the areas of scientific and technological knowledge.",
      "gist": "Data Visualization in 2019",
      "headline": "Nikita hopes to see more data visualization activities in Russia next year",
      "start": 3380360,
      "end": 3585954,
      "id": "ep_89_ch_22"
    },
    {
      "summary": "Simon Elvery is a data visual interactive journalist working for the Australian Broadcaster Corporation. He is a guest in a slack channel you run called stories with data. The data visualization scene in Brisbane is quite small in a lot of ways, but also quite diverse.",
      "gist": "Interview",
      "headline": "Simon Elvery is a data visual interactive journalist working for the ABC",
      "start": 3590214,
      "end": 3755836,
      "id": "ep_89_ch_23"
    },
    {
      "summary": "Simon: What were the major developments or the big projects this year in Australia specifically and maybe also globally? The Guardian did a project about whether your personal viewpoint is reflected in the new parliament. As you scroll down you can see a lot more detail about the breakdown of the federal parliament.",
      "gist": "Australia's major developments in 2017",
      "headline": "Simon: What were the big projects this year in Australia and globally",
      "start": 3755980,
      "end": 3870804,
      "id": "ep_89_ch_24"
    },
    {
      "summary": "Another visualisation is about the politics of the new parliament. It shows what Malcolm Turnbull is up against in the new Senate. It's a more focused, narrative driven visualization. It ties in to one of the trends of 2016.",
      "gist": "No More Data Visualisations",
      "headline": "One of our projects is about the new parliament and its Senate",
      "start": 3871544,
      "end": 4002298,
      "id": "ep_89_ch_25"
    },
    {
      "summary": "One of the other trends this year is a move towards some more figurative visualizations. This opens the door to a lot of, like, very concrete experiences. Are there any other trends that you want to highlight?",
      "gist": "Top 10 Visualization Trends of 2017",
      "headline": "Another trend this year is a move towards more figurative visualizations",
      "start": 4002426,
      "end": 4083530,
      "id": "ep_89_ch_26"
    },
    {
      "summary": "Mobile's driving move to smaller infographics in some ways, smaller visualizations. Also forcing us to think about the usability of these sorts of things we're building. Tools encouraging best practice for visualizations in a way that they haven't been great at previously.",
      "gist": "Top 10 trends in infographics in 2016",
      "headline": "I think mobile is driving move to smaller infographics",
      "start": 4083562,
      "end": 4208564,
      "id": "ep_89_ch_27"
    },
    {
      "summary": "Simon: What are you hoping for next year? I love to see a boost in the data literacy within newsrooms. And along with that, improved access to data sets. If you're interested in the Australian scene, sign up for the Slack channel.",
      "gist": "Top Data Scientists' predictions for 2019",
      "headline": "Simon Robertson: What are you hoping for next year in data journalism",
      "start": 4209144,
      "end": 4321244,
      "id": "ep_89_ch_28"
    },
    {
      "summary": "Jane is a freelance data visualization designer based in Hong Kong. Previously worked at South China Morning Post and Thomson Reuters. Works for magazines, businesses, who wants dashboard designs?",
      "gist": "Freelance Data Visualization Designer",
      "headline": "Jane is a freelance data visualization designer based in Hong Kong",
      "start": 4325944,
      "end": 4388724,
      "id": "ep_89_ch_29"
    },
    {
      "summary": "In my opinion, I don't think data visualization is mainstream quite just yet in Hong Kong and greater China. The characters in Chinese are not like English, so they're very block like. And typography is totally different. I hope selfishly that it's going to come very soon.",
      "gist": "Hong Kong and China's data visualization scene",
      "headline": "I don't think data visualization is mainstream in Hong Kong and greater China",
      "start": 4389464,
      "end": 4573370,
      "id": "ep_89_ch_30"
    },
    {
      "summary": "New media art projects that use data as a basis. One of these projects is called radiance, and it's from a local new media art studio called XEX in Hong Kong. It's kind of like an audio visual piece that uses live radiation data. Are there any projects that you want to highlight from the Asian region?",
      "gist": "Top 10 Asian Projects of 2016",
      "headline": "Art projects using data from Dataviz are making waves in the Asian region",
      "start": 4573522,
      "end": 4669236,
      "id": "ep_89_ch_31"
    },
    {
      "summary": "I'm seeing a lot of local media starting to do visual and data journalism. The common thread is politics. I think it's a huge year for databases. There's so much interesting work happening around topics like music and sports and popular culture.",
      "gist": "Top trends in data journalism",
      "headline": "I'm seeing more local media starting to do visual and data journalism",
      "start": 4669340,
      "end": 4763474,
      "id": "ep_89_ch_32"
    },
    {
      "summary": "Looking forward, what do you hope for for next year? What are the types of projects you would be hoping to see and. What are you hoping for? I'm definitely hoping for more projects to come out of the Asian region. We would love to see more coming from across the world.",
      "gist": "Top News Visualizations in 2019",
      "headline": "Jane: Looking forward, what do you hope for for next year",
      "start": 4766374,
      "end": 4917604,
      "id": "ep_89_ch_33"
    },
    {
      "summary": "Okay, that's been quite a nice trip around the world, Moritz. We really enjoyed doing this and. Yeah, it's been amazing. Thanks for all of our guests to showing us a bit around.",
      "gist": "A Taste of the Trip Around the World",
      "headline": "Okay, that's been quite a nice trip around the world, Moritz",
      "start": 4921704,
      "end": 4946752,
      "id": "ep_89_ch_34"
    },
    {
      "summary": "Use data visualization to understand your government better, to work with open data to improve society. How to data visit a post factual world. Can we make a difference? That's always the constant underlying question. Let's go out there and show that we can reason with data.",
      "gist": "Top Data Scientists talk",
      "headline": "This year has been very interesting in terms of how we relate to numbers",
      "start": 4946848,
      "end": 5086986,
      "id": "ep_89_ch_35"
    },
    {
      "summary": "Things are moving more into a more narrative, much more focused direction in terms of data visualization. Think about what it actually communicates, how it fits into a narrative. And also, just being lean and reduced obviously works well on mobile.",
      "gist": "Data visualization: The future of storytelling",
      "headline": "Being lean and reduced obviously works well on mobile devices",
      "start": 5087010,
      "end": 5134994,
      "id": "ep_89_ch_36"
    },
    {
      "summary": "Local data visualization scenes have lots of interesting exchange with the art scene and the experimental media design scene and generative design. What I have not seen is a lot of interesting projects on VR devices. This is still to come.",
      "gist": "Data visualization and the art world",
      "headline": "I think local data visualization scenes have lots of interesting exchange with other scenes",
      "start": 5135494,
      "end": 5258428,
      "id": "ep_89_ch_37"
    },
    {
      "summary": "\"We are so, as you said, us and eurocentric, and I don't think it's a good thing. I think there's a lot we can learn from everybody, and the world is. Big and amazing people. There are amazing people out there \" Looking forward, there are a few changes coming up for the podcast.",
      "gist": "A Taste of the World Podcast",
      "headline": "Enrico: Looking forward, we have some changes coming up for podcast",
      "start": 5258556,
      "end": 5424586,
      "id": "ep_89_ch_38"
    },
    {
      "summary": "One thing we would love to do is to transition to having the show completely crowdfunded. We are looking into Patreon. If we manage to completely transition, then we will be able to remove our ads completely. And maybe at some point we can switch over to totally ad free podcast.",
      "gist": "Want to support the show? Here you come!",
      "headline": "Moritz would love to transition to having the show completely crowdfunded",
      "start": 5424730,
      "end": 5550298,
      "id": "ep_89_ch_39"
    },
    {
      "summary": "This is the last episode for 2016. I want to thank Destry and Florian for their amazing work. Without listeners, it doesn't make any sense doing this. It's been a good year. 2017 might be even better.",
      "gist": "A Very Special Thank You for 2016",
      "headline": "So that said, I think that's our last episode for 2016",
      "start": 5550426,
      "end": 5634252,
      "id": "ep_89_ch_40"
    },
    {
      "summary": "Before you leave, we have a request if you can spend a couple of minutes rating us on iTunes. Here's some information on the many ways you can get news directly from us. We love to get in touch with our listeners, especially if you want to suggest a way to improve the show.",
      "gist": "Data Stories",
      "headline": "Before you leave, we have a request if you can spend a few minutes rating us on iTunes",
      "start": 5634388,
      "end": 5717334,
      "id": "ep_89_ch_41"
    }
  ],
  "disfluencies": false,
  "entity_detection": false,
  "sentiment_analysis": false,
  "sentiment_analysis_results": null,
  "entities": null,
  "speakers_expected": null,
  "summary": null,
  "custom_topics_results": null,
  "episode_num": 89,
  "episode_metadata": {
    "speakers": [
      "Moritz Stefaner",
      "Enrico Bertini",
      "Krisztina Szűcs",
      "Blaise Aboh",
      "Simon Ducroquet",
      "Nikita Rokotyan",
      "Simon Elvery",
      "Jane Pong"
    ],
    "WPid": "834",
    "url": "https://datastori.es/podlove/file/3422/s/feed/c/mp3/89-datavis-around-the-world-in-2016.mp3",
    "episode_title": "Data Vis Around the World in 2016"
  }
}