{
  "id": "151d4a42-35c3-4ef1-a935-cf292ef31e85",
  "language_model": "assemblyai_default",
  "acoustic_model": "assemblyai_default",
  "language_code": "en_us",
  "status": "completed",
  "audio_url": "https://datastori.es/podlove/file/4077/s/feed/c/mp3/100-data-stories-100.mp3",
  "utterances": [
    {
      "end": 3718,
      "speaker": "Enrico Bertini",
      "start": 240,
      "text": "Hi, everyone, this is Enrico and I'm here together with Moritz.",
      "id": "ep_100_ut_0"
    },
    {
      "end": 5814,
      "speaker": "Moritz Stefaner",
      "start": 3886,
      "text": "Hi, everyone. This is Moritz.",
      "id": "ep_100_ut_1"
    },
    {
      "end": 10754,
      "speaker": "Enrico Bertini",
      "start": 5974,
      "text": "And here is our first episode of the Data Stories podcast.",
      "id": "ep_100_ut_2"
    },
    {
      "end": 36534,
      "speaker": "Moritz Stefaner",
      "start": 30394,
      "text": "Hey, everyone, it's a new data stories. Hi, Enrico. Hey, how you doing?",
      "id": "ep_100_ut_3"
    },
    {
      "end": 40978,
      "speaker": "Enrico Bertini",
      "start": 37874,
      "text": "That's not just another episode of data stories.",
      "id": "ep_100_ut_4"
    },
    {
      "end": 43094,
      "speaker": "Moritz Stefaner",
      "start": 41106,
      "text": "It's a very special episode.",
      "id": "ep_100_ut_5"
    },
    {
      "end": 49474,
      "speaker": "Enrico Bertini",
      "start": 44074,
      "text": "It's the 100th episode of Dada stories. Congratulations.",
      "id": "ep_100_ut_6"
    },
    {
      "end": 51774,
      "speaker": "Moritz Stefaner",
      "start": 49554,
      "text": "Yeah. Three digit club.",
      "id": "ep_100_ut_7"
    },
    {
      "end": 53290,
      "speaker": "Enrico Bertini",
      "start": 52074,
      "text": "Oh, my God.",
      "id": "ep_100_ut_8"
    },
    {
      "end": 54130,
      "speaker": "Moritz Stefaner",
      "start": 53442,
      "text": "It's crazy.",
      "id": "ep_100_ut_9"
    },
    {
      "end": 58186,
      "speaker": "Enrico Bertini",
      "start": 54162,
      "text": "No, how did we get to. Yeah, here?",
      "id": "ep_100_ut_10"
    },
    {
      "end": 60890,
      "speaker": "Moritz Stefaner",
      "start": 58370,
      "text": "Yeah, I don't know. I think we just kept going.",
      "id": "ep_100_ut_11"
    },
    {
      "end": 61986,
      "speaker": "Enrico Bertini",
      "start": 61002,
      "text": "We just kept going.",
      "id": "ep_100_ut_12"
    },
    {
      "end": 63522,
      "speaker": "Moritz Stefaner",
      "start": 62050,
      "text": "Yeah, I think that's the secret.",
      "id": "ep_100_ut_13"
    },
    {
      "end": 71770,
      "speaker": "Enrico Bertini",
      "start": 63658,
      "text": "It seems almost like who did it? I don't remember having done all this stuff together.",
      "id": "ep_100_ut_14"
    },
    {
      "end": 80882,
      "speaker": "Moritz Stefaner",
      "start": 71962,
      "text": "Yeah, yeah. I think we both probably at some point thought about, like, shall we really continue doing this? It's so much work, right? I mean, I did for sure.",
      "id": "ep_100_ut_15"
    },
    {
      "end": 81842,
      "speaker": "Enrico Bertini",
      "start": 80978,
      "text": "Of course.",
      "id": "ep_100_ut_16"
    },
    {
      "end": 84714,
      "speaker": "Moritz Stefaner",
      "start": 82018,
      "text": "Yeah. But somehow we kept going. It's amazing. It's nice.",
      "id": "ep_100_ut_17"
    },
    {
      "end": 87738,
      "speaker": "Enrico Bertini",
      "start": 84754,
      "text": "Yeah, it's like a whole couple, you know?",
      "id": "ep_100_ut_18"
    },
    {
      "end": 92714,
      "speaker": "Moritz Stefaner",
      "start": 87906,
      "text": "Exactly. Can't live with or without each other, so what can you do?",
      "id": "ep_100_ut_19"
    },
    {
      "end": 94466,
      "speaker": "Enrico Bertini",
      "start": 92874,
      "text": "Yeah, yeah, yeah, yeah.",
      "id": "ep_100_ut_20"
    },
    {
      "end": 124022,
      "speaker": "Moritz Stefaner",
      "start": 94530,
      "text": "No, but it's amazing. 100 is like. Is such a huge number, and I think now it just becomes even more interesting now that we have this mass of, you know, previous conversations and all the people we met and all the new things we learned and. Yeah, it's just building up this rich collection of stuff. I really enjoy it. Yeah, yeah, and, yeah. So we just passed also 10,000 Twitter followers. Yay. A few days ago. Really nice.",
      "id": "ep_100_ut_21"
    },
    {
      "end": 124502,
      "speaker": "Enrico Bertini",
      "start": 124038,
      "text": "Not bad.",
      "id": "ep_100_ut_22"
    },
    {
      "end": 129870,
      "speaker": "Moritz Stefaner",
      "start": 124598,
      "text": "Yeah, yeah, yeah. And so, yeah, it's nice. It's. People seem to be interested, so that's.",
      "id": "ep_100_ut_23"
    },
    {
      "end": 131238,
      "speaker": "Enrico Bertini",
      "start": 129902,
      "text": "Good to some extent.",
      "id": "ep_100_ut_24"
    },
    {
      "end": 155494,
      "speaker": "Moritz Stefaner",
      "start": 131326,
      "text": "Yeah, yeah. We had more effects and figures, of course. We had data podcasts, so we had, up to now, 528,387 downloads of all episodes total. I think 60,000 of those are, like, for a missing file that doesn't exist on our server, we should maybe say that, which is always annoying.",
      "id": "ep_100_ut_25"
    },
    {
      "end": 156830,
      "speaker": "Enrico Bertini",
      "start": 155574,
      "text": "Most popular one.",
      "id": "ep_100_ut_26"
    },
    {
      "end": 167282,
      "speaker": "Moritz Stefaner",
      "start": 156942,
      "text": "Yeah. So that's a technical glitch, but no, it's a really decent amount of downloads last month. 24,000 downloads. Good stuff.",
      "id": "ep_100_ut_27"
    },
    {
      "end": 168586,
      "speaker": "Enrico Bertini",
      "start": 167458,
      "text": "Yeah, yeah.",
      "id": "ep_100_ut_28"
    },
    {
      "end": 170442,
      "speaker": "Moritz Stefaner",
      "start": 168690,
      "text": "Thanks for listening, dear listeners.",
      "id": "ep_100_ut_29"
    },
    {
      "end": 174834,
      "speaker": "Enrico Bertini",
      "start": 170538,
      "text": "Thanks so much. Yeah. So I have a question for you, Moritz.",
      "id": "ep_100_ut_30"
    },
    {
      "end": 175314,
      "speaker": "Moritz Stefaner",
      "start": 174914,
      "text": "Yes.",
      "id": "ep_100_ut_31"
    },
    {
      "end": 179018,
      "speaker": "Enrico Bertini",
      "start": 175394,
      "text": "Do you know when we published our first episode?",
      "id": "ep_100_ut_32"
    },
    {
      "end": 182214,
      "speaker": "Moritz Stefaner",
      "start": 179146,
      "text": "First ever. Must have been in the nineties.",
      "id": "ep_100_ut_33"
    },
    {
      "end": 187094,
      "speaker": "Enrico Bertini",
      "start": 186314,
      "text": "Yeah.",
      "id": "ep_100_ut_34"
    },
    {
      "end": 192910,
      "speaker": "Moritz Stefaner",
      "start": 187834,
      "text": "Five years ago or something like more than five, I guess. Right? I mean, let's look it up. Let me see.",
      "id": "ep_100_ut_35"
    },
    {
      "end": 193366,
      "speaker": "Enrico Bertini",
      "start": 193082,
      "text": "Yeah.",
      "id": "ep_100_ut_36"
    },
    {
      "end": 199014,
      "speaker": "Moritz Stefaner",
      "start": 193390,
      "text": "I ever had exuberant animated data kitsch, I would still. That's still the best title ever, hearing about that.",
      "id": "ep_100_ut_37"
    },
    {
      "end": 201838,
      "speaker": "Enrico Bertini",
      "start": 199054,
      "text": "Yeah, that's the best title ever.",
      "id": "ep_100_ut_38"
    },
    {
      "end": 206734,
      "speaker": "Moritz Stefaner",
      "start": 202006,
      "text": "Yeah. And. Yeah, it must. Yeah. February 2012. Yeah.",
      "id": "ep_100_ut_39"
    },
    {
      "end": 215474,
      "speaker": "Enrico Bertini",
      "start": 206774,
      "text": "Yes. Yeah. 14th. That was Valentine's Day. Wow. I don't know if it means anything.",
      "id": "ep_100_ut_40"
    },
    {
      "end": 221110,
      "speaker": "Moritz Stefaner",
      "start": 216574,
      "text": "Yeah, yeah, yeah, yeah. Lots of things have changed in the past.",
      "id": "ep_100_ut_41"
    },
    {
      "end": 221914,
      "speaker": "Enrico Bertini",
      "start": 221142,
      "text": "My God.",
      "id": "ep_100_ut_42"
    },
    {
      "end": 223070,
      "speaker": "Moritz Stefaner",
      "start": 222734,
      "text": "Yeah.",
      "id": "ep_100_ut_43"
    },
    {
      "end": 232248,
      "speaker": "Enrico Bertini",
      "start": 223102,
      "text": "Yeah. So I think one of the first things we want to do today is to go through our top ten episodes and briefly comment on them. Right.",
      "id": "ep_100_ut_44"
    },
    {
      "end": 237472,
      "speaker": "Moritz Stefaner",
      "start": 232336,
      "text": "We should mention we have no special guest. It's just the two of us. You're stuck with us.",
      "id": "ep_100_ut_45"
    },
    {
      "end": 238764,
      "speaker": "Enrico Bertini",
      "start": 237608,
      "text": "You're stuck with us.",
      "id": "ep_100_ut_46"
    },
    {
      "end": 245204,
      "speaker": "Moritz Stefaner",
      "start": 239264,
      "text": "Although later on, we bring in two very special guests. Yeah, it's sort of.",
      "id": "ep_100_ut_47"
    },
    {
      "end": 247264,
      "speaker": "Enrico Bertini",
      "start": 245864,
      "text": "Yeah, let's wait for that.",
      "id": "ep_100_ut_48"
    },
    {
      "end": 247896,
      "speaker": "Moritz Stefaner",
      "start": 247304,
      "text": "A surprise.",
      "id": "ep_100_ut_49"
    },
    {
      "end": 258688,
      "speaker": "Enrico Bertini",
      "start": 247960,
      "text": "Yeah, it's a surprise. It's a little bit of a surprise. Yeah. So, Moritz, do we want to go through the top ten? So that's top ten in terms of downloads, right?",
      "id": "ep_100_ut_50"
    },
    {
      "end": 260808,
      "speaker": "Moritz Stefaner",
      "start": 258816,
      "text": "Yeah, yeah. Most popular episodes.",
      "id": "ep_100_ut_51"
    },
    {
      "end": 262724,
      "speaker": "Enrico Bertini",
      "start": 260896,
      "text": "Most popular episodes, yeah.",
      "id": "ep_100_ut_52"
    },
    {
      "end": 270120,
      "speaker": "Moritz Stefaner",
      "start": 263024,
      "text": "I'm wondering if that favors basically more the older ones or the younger ones. I'm not sure. There might be a sort of a bias there.",
      "id": "ep_100_ut_53"
    },
    {
      "end": 274048,
      "speaker": "Enrico Bertini",
      "start": 270152,
      "text": "Not necessarily, because we do have some recent ones there, so that's.",
      "id": "ep_100_ut_54"
    },
    {
      "end": 284784,
      "speaker": "Moritz Stefaner",
      "start": 274096,
      "text": "Yeah, yeah, yeah. I'm not even sure, because, like, our listenership has been growing, but also the older ones had more chances to be downloaded. I'm not sure. Yeah, whatever. So don't take it too seriously.",
      "id": "ep_100_ut_55"
    },
    {
      "end": 285824,
      "speaker": "Enrico Bertini",
      "start": 284824,
      "text": "Don't take it too seriously.",
      "id": "ep_100_ut_56"
    },
    {
      "end": 318056,
      "speaker": "Moritz Stefaner",
      "start": 285864,
      "text": "Yeah, yeah. Number one was Br. The one on data visualization literacy with Jeremy Boy, Helen Kennedy and Andy Kirk, which to me was sort of surprising. It was like a complicated topic and, like, three different guests, and it was also a difficult recording, if I remember, we were sitting in my hotel room also partly, and it was a tricky recording, like, technology wise, but super popular. So data visualization literacy seems to be a big topic, huh?",
      "id": "ep_100_ut_57"
    },
    {
      "end": 322552,
      "speaker": "Enrico Bertini",
      "start": 318120,
      "text": "Yeah. And it's still a very big topic, so I'm glad to see that happening.",
      "id": "ep_100_ut_58"
    },
    {
      "end": 340672,
      "speaker": "Moritz Stefaner",
      "start": 322728,
      "text": "Yeah. And I think this whole topic of learning and teaching and getting started with data visualization and how to improve and how to make the next step and so on, this has been a recurring theme for us. Right. And I guess also to many of our listeners is like the main interest also in the podcast.",
      "id": "ep_100_ut_59"
    },
    {
      "end": 349704,
      "speaker": "Enrico Bertini",
      "start": 340768,
      "text": "Yeah, absolutely. Yeah. The second one is ggplot two R and data tool making with Hadley Wickham.",
      "id": "ep_100_ut_60"
    },
    {
      "end": 350368,
      "speaker": "Moritz Stefaner",
      "start": 349864,
      "text": "Yeah.",
      "id": "ep_100_ut_61"
    },
    {
      "end": 378142,
      "speaker": "Enrico Bertini",
      "start": 350456,
      "text": "And, yeah, I'm not too surprised. That's been a very popular one. Of course, Hadley has a huge following and he had a lot of impact with his tools, and he's still. Yeah. Having a lot of success. So it was great having him on the show and talk a little bit about. Yeah. How he got there. And what's his philosophy behind generating tools for people to create data visualizations?",
      "id": "ep_100_ut_62"
    },
    {
      "end": 400970,
      "speaker": "Moritz Stefaner",
      "start": 378158,
      "text": "It's very interesting. He's such a clear thinker and he seems to think about this whole process and also what tool making actually means and even like the naming. So he's really smart about the naming of his tools. Yeah. But, you know, all of this is important and I think this was a really. Yeah. Really interesting one. And he's. Yeah, I think he's, to many people, like a sort of a guiding figure in many ways and.",
      "id": "ep_100_ut_63"
    },
    {
      "end": 402010,
      "speaker": "Enrico Bertini",
      "start": 401162,
      "text": "Yeah, yeah.",
      "id": "ep_100_ut_64"
    },
    {
      "end": 403254,
      "speaker": "Moritz Stefaner",
      "start": 402082,
      "text": "And great to have him.",
      "id": "ep_100_ut_65"
    },
    {
      "end": 411018,
      "speaker": "Enrico Bertini",
      "start": 403754,
      "text": "Very big practical contribution. If I had to name like ten people in this, he would certainly be there. Right?",
      "id": "ep_100_ut_66"
    },
    {
      "end": 424694,
      "speaker": "Moritz Stefaner",
      "start": 411066,
      "text": "Yeah. Yeah. Really productive guy. Yeah. Third one, Amanda Cox. The one and only Amanda Cox. She's the best. I mean, on working with our NYT projects and her favorite data.",
      "id": "ep_100_ut_67"
    },
    {
      "end": 435318,
      "speaker": "Enrico Bertini",
      "start": 424794,
      "text": "Yeah. That's another case, I think, where, I mean, she's so popular and she's done so much good work. I'm not surprised we have her in the top three, right?",
      "id": "ep_100_ut_68"
    },
    {
      "end": 452458,
      "speaker": "Moritz Stefaner",
      "start": 435486,
      "text": "Yeah, yeah. And she's great. She, like, always on point, always funny, always like a fresh perspective also on things you might have heard before you thought you have heard before. But she always brings in an interesting new spin on these recurring themes and it's. Yeah, she's great.",
      "id": "ep_100_ut_69"
    },
    {
      "end": 458226,
      "speaker": "Enrico Bertini",
      "start": 452566,
      "text": "I think she gave a talk recently. Right. That was Openvis conf, something like that. Yeah.",
      "id": "ep_100_ut_70"
    },
    {
      "end": 488850,
      "speaker": "Moritz Stefaner",
      "start": 458330,
      "text": "And that's a great follow up. If you, if you enjoyed our podcast with Alberto Cairo on Uncertainty and the role of media today, I think that's a great follow up because she reports really well on their election coverage and they got a lot of, like, beating basically for their last year's election coverage. And she explains a bit on the, like, the thinking behind it and the general challenges of communicating uncertainty. Really good talk and really inspiring and interesting. Yeah.",
      "id": "ep_100_ut_71"
    },
    {
      "end": 533128,
      "speaker": "Enrico Bertini",
      "start": 488962,
      "text": "Yeah. So the next one is what happened in Viz in 2015, a review with Andy Kirk and Robert Kosara. And if you've been listening to data stories for a while, you know that that's kind of like a classic combo, having Andy and Robert together. And also the year review has been a classic for us since many years. I'm not sure whether we, we did it every single year, but we have done it for a few years. So it's, yeah. I don't know exactly why this one has been so popular, but it's always been fun to go through the whole year and figure out what were the main highlights and we would certainly keep doing that. Right?",
      "id": "ep_100_ut_72"
    },
    {
      "end": 589664,
      "speaker": "Moritz Stefaner",
      "start": 533256,
      "text": "Yeah. Yeah. Yeah, no, we did one every year, actually, so there's five of them. I think this could also make a fun, like, binge listening, like, you know, series of episodes, because you could basically fast forward your way through time, cover five years in like 5 hours or something, and see how the conversation has changed and how the field has changed. I also really liked our last year once, which is actually on position number six. So it's not that far away where we said, okay, so before, we always had like a small group of people, and I think mostly Andy and Robert talking about the review stuff. So we said we want to mix it up a bit. And so we took five or six different people from around the world and talk to them. And I think that was nice. And I would love to continue more showcasing a bit more work from people around the world, different types of people, than just the usual suspects.",
      "id": "ep_100_ut_73"
    },
    {
      "end": 648954,
      "speaker": "Enrico Bertini",
      "start": 589744,
      "text": "Yeah. And I have to say that for me, that's been one of the main highlights for the year and probably even for the entire show ever. I think doing the data visa around the world has been a lot of work, much, much more than a huge logistical challenge. You listening to it, I don't know how much you realize that, but it's been a few weeks of hard work and I'm really happy that we managed to reach people in very remote places and basically figure out what's going on there. And the biggest revelation was, hey, there are a lot of amazing people doing Dataviz in other countries. Right. And that's a constant challenge, trying to find a way to be more inclusive. It's a big, big, big challenge and something that we're always trying to improve. So I think that this episode has been one of the main highlights for me.",
      "id": "ep_100_ut_74"
    },
    {
      "end": 682058,
      "speaker": "Moritz Stefaner",
      "start": 649074,
      "text": "Yeah, yeah, it was a fun one, for sure. Yeah. Number five is Bocoup and Openviz conference. That was a great one too, both because Bocoup is a cool company and of course because Openvis is a great conference. So it's like a double take here. And yeah, I think opened this conference this year also. The program was really great again, and I haven't watched all the talks, but a couple of them, and I think it's quite great what they were able to put together there. So good stuff.",
      "id": "ep_100_ut_75"
    },
    {
      "end": 731536,
      "speaker": "Enrico Bertini",
      "start": 682106,
      "text": "Yeah. So the 7th position we have I quant New York, finding surprising stories in New York City. Open data with Ben Wellington. That's been an awesome, awesome episode. We had so much fun recording it. Ben is a natural. And I can, I think one interesting thing that he did, it kind of like started up kind of style of new style of blog, blogging about data and data visualization. So I think later on we saw more people doing similar stuff, but it's been one of the first people saying, hey, let me analyze this dataset, figure out what interesting story I can say about that, and just publish a blog post on it. And he also had a huge impact with some of the stories.",
      "id": "ep_100_ut_76"
    },
    {
      "end": 793304,
      "speaker": "Moritz Stefaner",
      "start": 731600,
      "text": "So it's been awesome and it's just so nice. So he takes publicly available data, simple tools, or like, I mean, he also uses like advanced tools, but often it's stuff you can do basically with freely available or simple tools, and then publishes it and like gives it a good story and actually reaches something with it. Right. And has an impact. And I think that was so, so good to see that if you just bring these basic ingredients together in a smart way, there's so much you can do. And I think the episode we had with Lisa Charlotte rost, it was similar in a way, because she took Google search data you can download and simple tools, but then found all these really interesting things about her own search behavior. And I always loved that when it's one thing to hear from crazy data artists doing six figure projects or something like, wow, that's amazing. But I think it's even more amazing if somebody can do something cool with just a basic tools.",
      "id": "ep_100_ut_77"
    },
    {
      "end": 802264,
      "speaker": "Enrico Bertini",
      "start": 796524,
      "text": "There's no limit to the amount of cool stuff you can do from home. Right? This is getting better and better.",
      "id": "ep_100_ut_78"
    },
    {
      "end": 848584,
      "speaker": "Moritz Stefaner",
      "start": 804724,
      "text": "Number eight, also one of my personal favorites, statistical numbing with Paul Slovic. Really good, challenging recording. Like technically, hugely challenging. And also, I think it was slow. It was a really slow episode in a way that we talked for a really long time until we came to the point where we were actually trying to get to. So during the recording, I felt like, oh, I'm not sure if this is going well, but somehow he has so much knowledge and was able also to drive it all home so well. And the point he makes is so deep and interesting and also counterintuitive and so. Yeah, it was really good.",
      "id": "ep_100_ut_79"
    },
    {
      "end": 928304,
      "speaker": "Enrico Bertini",
      "start": 848664,
      "text": "Yeah, no, I have to say it's one of the main highlights for me as well. I have the same feeling. It's. I was really. Yeah, I didn't know how people would receive this episode and I was really surprised by the reaction. I'm surprised that this episode is in the top ten list. And I have to say that probably stroke a chord because, I mean, talking about this issue of the fact that numbers and statistics just cannot communicate emotions very well has been something I don't know, I think people just needed to hear the science behind that. And I have to say that after the episode has been published, a few people started talking about this idea much more often. There have been a few presentations. I think Lisa Charlotte Muth (formerly Lisa Rost) as well had one or two presentations touching upon this point. I guess Alberto Cairo also talked about some of these things. I can remember Stephen Few publishing a blog post. So holiness had. Then this kind of like became. Yeah. Some important knowledge available out there, right. Not just in the academic circles. And I think it's great to see this happening.",
      "id": "ep_100_ut_80"
    },
    {
      "end": 1003424,
      "speaker": "Moritz Stefaner",
      "start": 928384,
      "text": "Yeah, I think this is always great when we manage to take something from one area and transplant it into another one, and then suddenly you see the parallel or you see the relevance and you realize, oh, my God, I should maybe look at really also research from other fields to understand what I'm doing. And in a similar way, in episode top, number nine, like the 9th most popular one was with a physicist, and it was about listening to data from space. It's such a crazy episode. I think that might actually be my favorite one because it's so out there. So Scott Hughes sonifies the sound of gravitational waves, and he's been working on it for a long time. And then finally they were actually discovered. So before he was just simulating it and sort of playing how they could sound like, and then there were actual measurements so he could sonify how they actually sounded like. And we had, like, a lot of sound bites, obviously, in the episode. Again, huge logistical challenge, like, oh, my God, you know, like, to get all these sound snippets together and to have everybody hear them but also record them and whatnot. Crazy, but it totally paid off. I love this one.",
      "id": "ep_100_ut_81"
    },
    {
      "end": 1045542,
      "speaker": "Enrico Bertini",
      "start": 1003764,
      "text": "Yeah. Yeah, I agree. That's another one where we went out of our comfort zone and it almost always, like, pays out. And Scott also is another one of those guys who, he starts talking and you love the way he talks and the stories he tells is also the classic physics professor who can tell a lot of interesting stories. I loved recording this episode. Yeah. As you said, it's been a huge, huge challenge from the technical standpoint, trying to play the sounds while we were recording, but it's been a lot of fun. Yeah, I loved it. It's another one of my favorite ones.",
      "id": "ep_100_ut_82"
    },
    {
      "end": 1054526,
      "speaker": "Moritz Stefaner",
      "start": 1045678,
      "text": "Yeah. And I'm still thinking about sonification. At some point, I need to do a sonification project. It's gonna happen. Yeah.",
      "id": "ep_100_ut_83"
    },
    {
      "end": 1058234,
      "speaker": "Enrico Bertini",
      "start": 1054590,
      "text": "Yeah. It's a little bit on the fringes still, but. Totally.",
      "id": "ep_100_ut_84"
    },
    {
      "end": 1072490,
      "speaker": "Moritz Stefaner",
      "start": 1058274,
      "text": "And it's so hard to get right, but it's I feel like. I don't know. I'd like to get it right. And it sort of also fits to the 10th most popular episode because it's also about science.",
      "id": "ep_100_ut_85"
    },
    {
      "end": 1073266,
      "speaker": "Enrico Bertini",
      "start": 1072602,
      "text": "Yep.",
      "id": "ep_100_ut_86"
    },
    {
      "end": 1078386,
      "speaker": "Moritz Stefaner",
      "start": 1073410,
      "text": "And this one was about science communication with Jen Christensen from Scientific American.",
      "id": "ep_100_ut_87"
    },
    {
      "end": 1082426,
      "speaker": "Enrico Bertini",
      "start": 1078490,
      "text": "Yeah, that was a great one as well. Yeah, yeah.",
      "id": "ep_100_ut_88"
    },
    {
      "end": 1100416,
      "speaker": "Moritz Stefaner",
      "start": 1082570,
      "text": "And. But to me, it was shocking how little science communication we had in the end, like, in the 100 episodes, maybe there's two or three maximum, which is sort of. It seems like such a natural thing to do because I'm super interested in it. I do a lot of it, actually. Yeah, you are a scientist. I don't know. Yeah.",
      "id": "ep_100_ut_89"
    },
    {
      "end": 1143262,
      "speaker": "Enrico Bertini",
      "start": 1100440,
      "text": "We should do more of that. Yeah. But I have to say, it's also like, Jen is another one of those persons who's very eloquent and very clear when she speaks. And I love listening to her. I think that's another huge privilege of doing this show. We have awesome people on the show and just listening to them is amazing. We don't know before recording what they're gonna say. Right. And just the only thing we can do is trying to ask the best questions and, yeah. Provoke the most interesting thoughts and some people are just awesome. And Jen is definitely one of those people who just start talking as very interesting ideas. So, yeah, it's been great.",
      "id": "ep_100_ut_90"
    },
    {
      "end": 1145222,
      "speaker": "Moritz Stefaner",
      "start": 1143438,
      "text": "Maybe we just invite her back.",
      "id": "ep_100_ut_91"
    },
    {
      "end": 1146302,
      "speaker": "Enrico Bertini",
      "start": 1145398,
      "text": "Yeah, we should.",
      "id": "ep_100_ut_92"
    },
    {
      "end": 1153738,
      "speaker": "Moritz Stefaner",
      "start": 1146398,
      "text": "Yeah. So shall we share a few, like, funny stories from the past now?",
      "id": "ep_100_ut_93"
    },
    {
      "end": 1173774,
      "speaker": "Enrico Bertini",
      "start": 1153906,
      "text": "We already in memory lane. Let's do that. So I think I would start from probably the first memorable thing moment I can recall is when for the first time, somebody decided to call us exotic eurovoices.",
      "id": "ep_100_ut_94"
    },
    {
      "end": 1177534,
      "speaker": "Moritz Stefaner",
      "start": 1175714,
      "text": "And it was a guy from Australia.",
      "id": "ep_100_ut_95"
    },
    {
      "end": 1183434,
      "speaker": "Enrico Bertini",
      "start": 1177834,
      "text": "Exactly. That was so much fun.",
      "id": "ep_100_ut_96"
    },
    {
      "end": 1214484,
      "speaker": "Moritz Stefaner",
      "start": 1184134,
      "text": "It was like, for a long while, it was like a running gag, you know, the exotic Eurovis thing. We were just debating who else to invite who also has an interesting accent. So the first 1020 episodes, I think we mentioned it at least once per episode, sort of died down after that a bit. But if you're new to the show, listen to the early ones and have maybe a laugh or a cringe, I don't know, but we had some fun there.",
      "id": "ep_100_ut_97"
    },
    {
      "end": 1218976,
      "speaker": "Enrico Bertini",
      "start": 1214904,
      "text": "Yeah, yeah, exactly. That was Ben Hoskin from Flinklabs.",
      "id": "ep_100_ut_98"
    },
    {
      "end": 1219608,
      "speaker": "Moritz Stefaner",
      "start": 1219000,
      "text": "Yeah.",
      "id": "ep_100_ut_99"
    },
    {
      "end": 1225168,
      "speaker": "Enrico Bertini",
      "start": 1219776,
      "text": "Hey, Ben, thanks so much. Ben, if you're listening to this. Yeah, we're still using it.",
      "id": "ep_100_ut_100"
    },
    {
      "end": 1226784,
      "speaker": "Moritz Stefaner",
      "start": 1225256,
      "text": "You created a meme. Exactly.",
      "id": "ep_100_ut_101"
    },
    {
      "end": 1228064,
      "speaker": "Enrico Bertini",
      "start": 1226824,
      "text": "We created a meme. Yeah.",
      "id": "ep_100_ut_102"
    },
    {
      "end": 1229804,
      "speaker": "Moritz Stefaner",
      "start": 1228144,
      "text": "You're Internet famous now.",
      "id": "ep_100_ut_103"
    },
    {
      "end": 1232088,
      "speaker": "Enrico Bertini",
      "start": 1231664,
      "text": "Yeah.",
      "id": "ep_100_ut_104"
    },
    {
      "end": 1238284,
      "speaker": "Moritz Stefaner",
      "start": 1232136,
      "text": "What else? You were kicked out of a room once. Like, we had like a sort of a recording on the run, more or less.",
      "id": "ep_100_ut_105"
    },
    {
      "end": 1311350,
      "speaker": "Enrico Bertini",
      "start": 1240004,
      "text": "Yeah. I don't know how much. Yeah, sometimes probably in the recording, people don't realize what happens behind the curtains. But there was a time when I think we were interviewing. Oh, yeah, Mike Bostock. Yeah, exactly. And from my side, I was recording from while attending a conference. So I was looking for an empty room somewhere and started recording. Right. And then, as one does in the meantime, what happens? That the conference was over and people started cleaning all the rooms. And I started hearing this huge machine coming from behind me like. Like this. And they kicked me out. And I had to run out of the building because I was also afraid that the building would just close and it was stuck inside and I had to run away. So basically, I think in that episode, you can hear my voice only at the beginning and at the very end of the episode. And, yeah, it was so much fun. It was so much fun. I just had to run with my laptop on my hands and run very fast. So that was hilarious.",
      "id": "ep_100_ut_106"
    },
    {
      "end": 1319714,
      "speaker": "Moritz Stefaner",
      "start": 1311462,
      "text": "Yeah. We just had a recently, a similar situation where I think I finished off an episode without you because the Internet dropped or whatever.",
      "id": "ep_100_ut_107"
    },
    {
      "end": 1323502,
      "speaker": "Enrico Bertini",
      "start": 1320054,
      "text": "Yeah. And when I came back, you just said, don't worry, we're done.",
      "id": "ep_100_ut_108"
    },
    {
      "end": 1400792,
      "speaker": "Moritz Stefaner",
      "start": 1323598,
      "text": "And Florian, our sound engineer, just edited in some byes and thank yous from you. At the end, I think nobody really noticed anything can happen. I mean, we record remotely, so. And, you know, anything can happen. Like, we have four people or three or four in different rooms across the world connected via Internet, trying to record live audio recordings. So you can imagine anything happens. With Jeff here, we have a funny thing going on. So we had him three or four times on the show. We have a curse every single time. We were not able to actually hear more than 5 seconds in one piece of. It's this sort of really funky wifi setup or the router or whatever. But it's always he starts saying, like, yes. And the amazing thing is actually nothing. And you just then hear, and this is how we did it. And then you're like, oh, man. Okay, Jeff, can you repeat that just for us so we know what you're talking about? And he's like, yeah, sure, no problem. Amazing thing is, it's gone again. Like, ah. And then at some point, we just assumed what he might have said roughly, like, thematically, and just asked the next question where we thought it could fit.",
      "id": "ep_100_ut_109"
    },
    {
      "end": 1406192,
      "speaker": "Enrico Bertini",
      "start": 1400888,
      "text": "Yeah, that's a good example of mind reading. So, yeah, we did our son's.",
      "id": "ep_100_ut_110"
    },
    {
      "end": 1418644,
      "speaker": "Moritz Stefaner",
      "start": 1406208,
      "text": "So many things people can say in this context. So it must be one of those. Yeah, yeah. So for some of the Jeff hair episodes. We only understood them once we listened to the final cut.",
      "id": "ep_100_ut_111"
    },
    {
      "end": 1461594,
      "speaker": "Enrico Bertini",
      "start": 1421744,
      "text": "Yeah, there are all sorts of crazy situations and, yeah, there is also all the. During the post processing, people just do a lot of different kind of things, some weird things we have. People just forget to use a proper mic or people who have been sharing their whole Dropbox with us or whatever. So, fortunately, by now, we have some redundancy in the way we produce the episodes. So it's. It's been more robust than in the past, but all sorts of crazy things happen. So if something can happen, it does happen sooner or later.",
      "id": "ep_100_ut_112"
    },
    {
      "end": 1464686,
      "speaker": "Moritz Stefaner",
      "start": 1463454,
      "text": "Usually. Yes.",
      "id": "ep_100_ut_113"
    },
    {
      "end": 1466086,
      "speaker": "Enrico Bertini",
      "start": 1464830,
      "text": "Usually it does. Yeah.",
      "id": "ep_100_ut_114"
    },
    {
      "end": 1512750,
      "speaker": "Moritz Stefaner",
      "start": 1466110,
      "text": "This is also how we developed our process. So we are not professional podcasters as guest, and so we just, in the beginning, started recording stuff and putting it on the Internet then. Yeah. Over like. Yeah. Dozens of episodes only figured out. Okay, this happens in this order and. Yeah. So it's insane. Yeah. What else? So we had the. We had a little feud between Andy and Robert going on for a while. I think it's sort of. It has relaxed a bit, the situation, but there were tense times, so they sort of tried to be more on the show than the other one. Always have the last word. So there was a little interesting blogger rivalry going on there, but I think things are good now. Right. Or have they just given up?",
      "id": "ep_100_ut_115"
    },
    {
      "end": 1530420,
      "speaker": "Enrico Bertini",
      "start": 1512782,
      "text": "From time to time? I see some tweets coming from Andy Kirk or Robert Kosara. Just. Yeah. Having fun with each other. So it's a nice thing. It's been a while. When is the last time we had Andy or Robert? Yeah, it's been a while.",
      "id": "ep_100_ut_116"
    },
    {
      "end": 1534036,
      "speaker": "Moritz Stefaner",
      "start": 1530492,
      "text": "Yeah, yeah. So, yeah, maybe we need a new.",
      "id": "ep_100_ut_117"
    },
    {
      "end": 1534652,
      "speaker": "Enrico Bertini",
      "start": 1534100,
      "text": "A new.",
      "id": "ep_100_ut_118"
    },
    {
      "end": 1538292,
      "speaker": "Moritz Stefaner",
      "start": 1534748,
      "text": "A new couple for another with celebrity deathmatch.",
      "id": "ep_100_ut_119"
    },
    {
      "end": 1539132,
      "speaker": "Enrico Bertini",
      "start": 1538348,
      "text": "Yeah, exactly.",
      "id": "ep_100_ut_120"
    },
    {
      "end": 1550360,
      "speaker": "Moritz Stefaner",
      "start": 1539188,
      "text": "Yeah, yeah. But I mean, actually, it is nice if there's a little bit of fighting and bickering going on also, for instance, the storytelling episode with we had Robert and Alberto.",
      "id": "ep_100_ut_121"
    },
    {
      "end": 1552904,
      "speaker": "Enrico Bertini",
      "start": 1550392,
      "text": "I think that was a fun one, right? Yeah, yeah.",
      "id": "ep_100_ut_122"
    },
    {
      "end": 1573524,
      "speaker": "Moritz Stefaner",
      "start": 1552944,
      "text": "Because there was actually, like, a difference in opinion, and we had sort of fun in sort of battling it out a bit. And actually, that's good. I mean, there's so many things where we all, basically, everybody's interested, everybody has the same opinion, but it's always nicer if you have something to actually fight about. I think often makes better conversations.",
      "id": "ep_100_ut_123"
    },
    {
      "end": 1585272,
      "speaker": "Enrico Bertini",
      "start": 1574744,
      "text": "What was that? During that episode? Somebody said the name of the show is data stories, but there's. Someone doesn't like stories at all. Something like that.",
      "id": "ep_100_ut_124"
    },
    {
      "end": 1585808,
      "speaker": "Moritz Stefaner",
      "start": 1585328,
      "text": "Exactly.",
      "id": "ep_100_ut_125"
    },
    {
      "end": 1586344,
      "speaker": "Enrico Bertini",
      "start": 1585856,
      "text": "Yeah.",
      "id": "ep_100_ut_126"
    },
    {
      "end": 1597074,
      "speaker": "Moritz Stefaner",
      "start": 1586464,
      "text": "We recently had a tweet about that, like, oh, that's strange. Yeah, it's a bit complicated. I have a complicated relationship with that name.",
      "id": "ep_100_ut_127"
    },
    {
      "end": 1601254,
      "speaker": "Enrico Bertini",
      "start": 1599574,
      "text": "Yeah, yeah.",
      "id": "ep_100_ut_128"
    },
    {
      "end": 1705502,
      "speaker": "Moritz Stefaner",
      "start": 1601294,
      "text": "Anyways, it's been fun and we've been looking back a bit now, going through the archives, we want to put together really comprehensive data sets, like of all the episodes with all the metadata, all the audio files, all the images. It's actually not so easy because WordPress is originally not made for podcasts. And then you use a plugin and, and everything is spread across different tables with five different identifiers. So we are sort of working on that, but we could also use some help. So if somebody of you is in a mood for data cleaning or helping us structure all this back archive information a bit, that would be amazing because I just started doing a bit of network visualizations with all the related episodes. We've also been tagging episodes and now we come up with new categories, like just from looking back over the 100 episodes. And I think for many people it could be great if they had, let's say somebody's really interested in data journalism. It would be nice to see just the data journalism episodes and being able to catch up on all of those. And so we'd like to improve access to the archive a bit more. And maybe also you can do interesting things with just the data and give it some interesting shape and see if we can visualize. The data storage is archive in interesting ways. But first step is data cleaning. As you have learned probably from listening on the show, 80% of data visualization is actually data cleaning. And so we can use any help there. So if you'd like to help us there, that would be amazing. And please ping us on Slack in the Slack channel because we're doing it right now, basically. Or maybe we have done it when you're listening already. But feel free to ping us, there's always more to do.",
      "id": "ep_100_ut_129"
    },
    {
      "end": 1726234,
      "speaker": "Enrico Bertini",
      "start": 1705598,
      "text": "Yeah, and I think once we have some properly formatted data out there, all sorts of creative stuff can be done out of it. So I think the limit is the sky here. I think what would be really nice to do is to be able to download all the audio files and do something with it.",
      "id": "ep_100_ut_130"
    },
    {
      "end": 1733834,
      "speaker": "Moritz Stefaner",
      "start": 1726774,
      "text": "That would be awesome. Trying to extract data metadata a hundred times 1 hour. Exactly.",
      "id": "ep_100_ut_131"
    },
    {
      "end": 1745594,
      "speaker": "Enrico Bertini",
      "start": 1734254,
      "text": "It's big, right? But if you guys are listening to this and have any idea on how to do this properly without spending too much. Yeah, let us know. That would be really cool.",
      "id": "ep_100_ut_132"
    },
    {
      "end": 1785248,
      "speaker": "Moritz Stefaner",
      "start": 1747254,
      "text": "So, yeah, we went through the archives and we just thought about what were actually the main themes we were covering. So a huge one is of course, art and design. So we always try to have interesting practitioners on the show, people doing interesting stuff with data. And I think one of the really typical data stories episodes is somebody who did an interesting project, telling about how they did it, why they do it, stuff like this. So I always enjoy those. Yeah, so there's a lot of those in the archives, and I think we might just put a list of all these categories, maybe in the blog post so you can, if you're interested in one of these themes.",
      "id": "ep_100_ut_133"
    },
    {
      "end": 1786568,
      "speaker": "Enrico Bertini",
      "start": 1785376,
      "text": "Yeah, absolutely.",
      "id": "ep_100_ut_134"
    },
    {
      "end": 1788416,
      "speaker": "Moritz Stefaner",
      "start": 1786696,
      "text": "Just check out all these episodes.",
      "id": "ep_100_ut_135"
    },
    {
      "end": 1836704,
      "speaker": "Enrico Bertini",
      "start": 1788520,
      "text": "Yeah, art and design is definitely one of the biggest ones, and we have lots of awesome people, I think. I'm not even sure if I should name anyone in particular, because they are also so interesting. And. Yeah, some of them are really mind blowing. Yeah. Maybe I'll just mention one. I think data sculpture. It's definitely one of those ones where I think, Moritz, you've been proposing it, and I didn't know much about it. And when I actually started researching for the episode, then having them on the show, I was like, wow, my God, these guys are awesome. These whole ideas of having data sculptures and the way they look and the process behind them, it was just unbelievable. Unbelievable.",
      "id": "ep_100_ut_136"
    },
    {
      "end": 1840208,
      "speaker": "Moritz Stefaner",
      "start": 1836784,
      "text": "So you mean the one with domestic data streamers number 58?",
      "id": "ep_100_ut_137"
    },
    {
      "end": 1840744,
      "speaker": "Enrico Bertini",
      "start": 1840296,
      "text": "Exactly.",
      "id": "ep_100_ut_138"
    },
    {
      "end": 1860496,
      "speaker": "Moritz Stefaner",
      "start": 1840784,
      "text": "Yeah. Really good one. Yeah. And they do amazing work. Yeah. Dear data was also really. It was a really influential episode, so we linked back to it very often, and the whole project has been so seminal. That goes without saying. It's been a huge inspiration for everybody.",
      "id": "ep_100_ut_139"
    },
    {
      "end": 1861512,
      "speaker": "Enrico Bertini",
      "start": 1860680,
      "text": "Absolutely.",
      "id": "ep_100_ut_140"
    },
    {
      "end": 1903956,
      "speaker": "Moritz Stefaner",
      "start": 1861608,
      "text": "Second big chunk of episodes is about conferences. So we had one from Malofiej, we always do one from viz conference. We had tapestry conference reviews, Openviz conference. We actually also produced, with the help of Destry, I produce an information plus summary conference. Summary episode, which was amazing, I think, where we actually took snippets from the different talks or a couple of talks and then commented on them. Really nice format. Again, logistically a huge challenge, but some of the good stuff always seems to take work. But I like that doing conference coverage is a really nice niche.",
      "id": "ep_100_ut_141"
    },
    {
      "end": 1930018,
      "speaker": "Enrico Bertini",
      "start": 1904100,
      "text": "Yeah. It's been another one of those experiments that we have done during the last year or so. And yeah, I think we want to do more of that if possible. Of course, it's a lot more work than usual, but it's definitely an interesting format. Trying to take snippets from conferences, from the talks and propose them on our show. And I think there is a lot of interest.",
      "id": "ep_100_ut_142"
    },
    {
      "end": 1932602,
      "speaker": "Moritz Stefaner",
      "start": 1930066,
      "text": "We even did a tv episode once. Do you remember that?",
      "id": "ep_100_ut_143"
    },
    {
      "end": 1935454,
      "speaker": "Enrico Bertini",
      "start": 1932618,
      "text": "We did, yeah, with Gregory, there was a video.",
      "id": "ep_100_ut_144"
    },
    {
      "end": 1961966,
      "speaker": "Moritz Stefaner",
      "start": 1936354,
      "text": "Yeah. Crazy. But I think that was really good, actually. So the main reason why we didn't continue doing that, it's a lot of work, and we felt a break with our normal formats. Like, you have to sort of produce it totally differently, but in principle, somebody like having a screencast running and explaining a visualization like Gregor did really great. So if you haven't seen that one, check it out. It's really nice.",
      "id": "ep_100_ut_145"
    },
    {
      "end": 2020120,
      "speaker": "Enrico Bertini",
      "start": 1962030,
      "text": "Yeah, yeah. And I'm really pleased to see probably that's the first time I realized that we've been doing the IEEE vis conference from the very beginning. We didn't skip one. I think that's a good service. I think one of the things that I really do care about since the beginning is trying to take information coming from academia and make it more available to practitioners. And I'm really happy to see this happening on data stories. I hope that's been useful to people. Yeah. Get a better sense of what academics do. And I think we academics have a weird way of talking about our work or not talking about our work, actually outside of academia. So I think it's very important to see this happening and, yeah, I hope there will be even more opportunities to do that.",
      "id": "ep_100_ut_146"
    },
    {
      "end": 2068688,
      "speaker": "Moritz Stefaner",
      "start": 2020192,
      "text": "Yeah, no, and I think a few of the past episodes have proven that there's huge interest in that also from practitioners. Yeah, for sure. Yeah. Another big chunk is data journalism. So we had great people there. We talked about Amanda Cox already, but we also had a couple of times, folks from ProPublica, which are amazing. We had Matt Daniels from polygraph. We had Alberto Cairo a couple of times. I mean, Robert Kosara. Yeah. You know, really, really good people in that track. Simon Rogers. Yeah. It's like, wow, really good. And I think that's also because to me, data journalism in the last five years, if you talk about the big arcs, has been one of the most exciting fields. And a lot of the real practical innovation came actually from journals.",
      "id": "ep_100_ut_147"
    },
    {
      "end": 2085630,
      "speaker": "Enrico Bertini",
      "start": 2068736,
      "text": "Absolutely. Yeah. I think if there is a reason why visualization became so popular, I would say data journalism is probably the reason, number one. Right, sure. A lot more people have been exposed to visualization through journalism. It's been huge.",
      "id": "ep_100_ut_148"
    },
    {
      "end": 2086258,
      "speaker": "Moritz Stefaner",
      "start": 2085712,
      "text": "Yep.",
      "id": "ep_100_ut_149"
    },
    {
      "end": 2121794,
      "speaker": "Enrico Bertini",
      "start": 2086386,
      "text": "And if I remember correctly, kind of like almost started a little leader earlier than when we started data stories. So it's almost like the two things went in parallel. So having people from data journalism on the show has been just a natural progression. Right? Yeah, yeah. And I'm curious to see what is going to happen next. Right. Maybe. I think, as you said before, journalism had a little bit of a blow with the last elections. Right. And I wouldn't, I wouldn't.",
      "id": "ep_100_ut_150"
    },
    {
      "end": 2132058,
      "speaker": "Moritz Stefaner",
      "start": 2121874,
      "text": "I mean, the election thing is mostly about predictions. Right. I mean, I think that does not touch any other form of data journalism. I think this conflation is pretty stupid.",
      "id": "ep_100_ut_151"
    },
    {
      "end": 2157664,
      "speaker": "Enrico Bertini",
      "start": 2132146,
      "text": "Yeah. But I think we have also seen, we have also seen people from New York Times kind of like changing format and looking a little bit more inward and trying to change the way they do some things. So I think it's been, for a while, it's been mostly an upward trajectory and now there is a little bit more of a reflection on what's next in the journalism. So that's also very interesting, which is good.",
      "id": "ep_100_ut_152"
    },
    {
      "end": 2201310,
      "speaker": "Moritz Stefaner",
      "start": 2159124,
      "text": "But I wouldn't throw out the baby with, oh no, absolutely not at all. Just making sure. Yeah. Then we had a lot of folks from industry, like applied fields, also a lot of people actually from research in industry. I think that's also a recurring theme for us, like really how to do innovative stuff in corporate context or how to bring academic stuff to applied situations. And I always enjoy those episodes and also the ones where people just report a bit on how it's actually like to the data visualization. Right. And so, yeah, we had a couple of really good episodes there, I think, as well.",
      "id": "ep_100_ut_153"
    },
    {
      "end": 2270976,
      "speaker": "Enrico Bertini",
      "start": 2201502,
      "text": "Yeah. And I think industry, I think that's another one of those areas where I feel like things are getting better and better and we are trying to cover more of what is happening in industry on the show. Like our last episode has been on what is happening at Capital one with Kim Reese, recently hired as head of data visualization, which is really cool to see this happening. Right. So having a person having a position called head of data visualization in an industry that is so big. So something is definitely happening out there. And we had a few conversations. We had the very interesting one with Elijah Mix on what is happening in industry. And I believe we're probably going to do more of that in the future. And of course there is a lot of interest because people who are learning visualization or investing in visualization, they want to have a job eventually. So knowing what your chances are in the future, which markets and industry are going to be available for you as a professional, I think it's a very important topic.",
      "id": "ep_100_ut_154"
    },
    {
      "end": 2315764,
      "speaker": "Moritz Stefaner",
      "start": 2271080,
      "text": "Yeah. Another huge topic we mentioned about the year reviews already. I mean this is sort of a tradition as well, just like the viz reviews. These are fun. Always nice and always good point to reflect. Another huge topic is learning and teaching. I think that's something we keep coming back to, like how do you actually learn data visualization? How can you teach knowledge there? What is the necessary skill sets and all these things? And I think that's. Yeah, that's a hugely important topic. Also, visual literacy. How much can we expect from our audiences? How do you design for different audiences? I think this is all super interesting. Yeah. We could have just a whole podcast series. Just that, I guess, because she wide field.",
      "id": "ep_100_ut_155"
    },
    {
      "end": 2369424,
      "speaker": "Enrico Bertini",
      "start": 2316104,
      "text": "That's what I was about to say. I think most of the feedback that we get from listeners, the way when they contact us via, via email or Twitter or other channels, is mostly about people who want to enter the field and don't know how to do it. So imagine a person who's just, just doesn't know anything about this, is attracted by it, wants to start learning. It's still not very clear what the best path is. And so that's a big gap. And I think we as a podcast can cover some of it, but there's definitely a huge need. So if you're listening to this and you think you can do something in this direction, please do it, because learning this is still a little bit of a challenge. Right. So I hope that in future years we are seeing more initiatives in this, in this direction.",
      "id": "ep_100_ut_156"
    },
    {
      "end": 2372804,
      "speaker": "Moritz Stefaner",
      "start": 2369504,
      "text": "Maybe we should start a data stories, university.",
      "id": "ep_100_ut_157"
    },
    {
      "end": 2376004,
      "speaker": "Enrico Bertini",
      "start": 2374824,
      "text": "Diplomas.",
      "id": "ep_100_ut_158"
    },
    {
      "end": 2381048,
      "speaker": "Moritz Stefaner",
      "start": 2376664,
      "text": "Yeah, at some point, think about that. Like, we should offer tutorials.",
      "id": "ep_100_ut_159"
    },
    {
      "end": 2410170,
      "speaker": "Enrico Bertini",
      "start": 2381136,
      "text": "We had these ideas for a while, but we're just too scared by the amount of work. Right. I mean, we still have our day job and so. Yeah, launching a new initiative wouldn't be easy. Right. And by now we know that, I mean, at the beginning when you have a new idea, you're very excited, but when you actually have to do the actual work is so much harder. Yeah, but that's definitely a big.",
      "id": "ep_100_ut_160"
    },
    {
      "end": 2413410,
      "speaker": "Moritz Stefaner",
      "start": 2410242,
      "text": "Well, it's a great topic. And I mean, you keep experimenting in teaching.",
      "id": "ep_100_ut_161"
    },
    {
      "end": 2414694,
      "speaker": "Enrico Bertini",
      "start": 2413442,
      "text": "Of course I do that.",
      "id": "ep_100_ut_162"
    },
    {
      "end": 2426038,
      "speaker": "Moritz Stefaner",
      "start": 2415414,
      "text": "And also on your blog, there's a few good articles from what you tried out over the last semester. So if you're interested listeners in learning about teaching and.",
      "id": "ep_100_ut_163"
    },
    {
      "end": 2448890,
      "speaker": "Enrico Bertini",
      "start": 2426206,
      "text": "Yeah, that's a big thing for me, I think what I notice is that as a professor, I can probably provide a lot of support and help. So one of the ideas that I have for the future is how to. How to make this teaching and learning material more available to. Yeah. Much more people.",
      "id": "ep_100_ut_164"
    },
    {
      "end": 2500558,
      "speaker": "Moritz Stefaner",
      "start": 2448962,
      "text": "Yeah. And then we cover a lot of like, techniques and tools. I think in the beginning also, we had a lot of episodes on. Okay, this is how you can visualize networks. This is how you use color or, you know, we had one on mobile and touch devices with Dominikus Baur, who I work with a lot still to this point, nicely. And I think that's super interesting too. But I think at some point we sort of covered the basic ground there. And now the last, I think, 20, 30, 40 episodes, we became much more interested in more, let's say, big picture stuff like what are these social issues? What's the dark side of data? And how can we actually achieve something with data? More the actual impact and less the details of how, if bubbles or lines are more effective. Stuff like this.",
      "id": "ep_100_ut_165"
    },
    {
      "end": 2541606,
      "speaker": "Enrico Bertini",
      "start": 2500606,
      "text": "Right, yeah, no, social issues and critique and impact has been definitely a big theme of the show, and I'm glad to see that over the years we've been touching upon many, many important topics. Sometimes we call this the dark side of this. I think it's important. It's very important because it's easy to fall into the trap of always say, hey, everything is great here. Right? Yes, awesome. I think it's important to be. Yeah. Self. To have some self reflection. Right, right. And. Yeah. Figure out that there are also some problems. Right.",
      "id": "ep_100_ut_166"
    },
    {
      "end": 2542278,
      "speaker": "Moritz Stefaner",
      "start": 2541710,
      "text": "Yeah.",
      "id": "ep_100_ut_167"
    },
    {
      "end": 2546454,
      "speaker": "Enrico Bertini",
      "start": 2542406,
      "text": "One of the recent ones that's been so much fun is the calling bullshit one.",
      "id": "ep_100_ut_168"
    },
    {
      "end": 2548074,
      "speaker": "Moritz Stefaner",
      "start": 2546574,
      "text": "Yeah, that was a good one.",
      "id": "ep_100_ut_169"
    },
    {
      "end": 2550594,
      "speaker": "Enrico Bertini",
      "start": 2549814,
      "text": "Yeah.",
      "id": "ep_100_ut_170"
    },
    {
      "end": 2577380,
      "speaker": "Moritz Stefaner",
      "start": 2550934,
      "text": "But it is important. And if you think about communicating with data and data visualization, you have to think about in which context this happens and how it can be interpreted and who you're actually reaching and what this all means. Or also if you do random data projects, some of them might be actually quite harmful in the long run. And so I think it is important to think about what's going on. On.",
      "id": "ep_100_ut_171"
    },
    {
      "end": 2595984,
      "speaker": "Enrico Bertini",
      "start": 2577532,
      "text": "Yeah. And I have to say it's still quite hard to synthesize all this information into something, say, self contained and homogeneous. I've been trying to do this for a recent course that I designed, and all this information is pretty scattered.",
      "id": "ep_100_ut_172"
    },
    {
      "end": 2608508,
      "speaker": "Moritz Stefaner",
      "start": 2598004,
      "text": "And it's also difficult to talk about data as such or talk about machine learning as such. You know, it's often. It's very much more complicated what's actually going on.",
      "id": "ep_100_ut_173"
    },
    {
      "end": 2610664,
      "speaker": "Enrico Bertini",
      "start": 2608556,
      "text": "Yeah, yeah, exactly.",
      "id": "ep_100_ut_174"
    },
    {
      "end": 2670520,
      "speaker": "Moritz Stefaner",
      "start": 2611044,
      "text": "Yeah. So these are the big themes again. We're trying to sort of a bit structure our archives and we'll put what we have, like, up in the show notes, and we'll maybe provide also some pointers of how you could help or contribute. But now we want to take another look behind the curtains. So we prepared a little segment already. It's pre recorded, so there's a little break now. And then we will bring Destry and Florian on, who work behind the scenes. On data stories, and they will tell you what needs to happen to actually get an episode out and all the actual work that goes into this. So enjoy. So one thing we wanted to talk about as well is how our episodes actually get. And I'm sure that's something everybody has been wondering all the time. How is the sausage being made? The German Italian sausage?",
      "id": "ep_100_ut_175"
    },
    {
      "end": 2672272,
      "speaker": "Enrico Bertini",
      "start": 2670672,
      "text": "The behind the scenes?",
      "id": "ep_100_ut_176"
    },
    {
      "end": 2689284,
      "speaker": "Moritz Stefaner",
      "start": 2672368,
      "text": "Yeah, yeah, yeah. And actually, it's quite a process to get such an episode out. And to tell you a bit more about how that works, we have two very special guests. We have Destry and Florian, who help us with the production of the show, and they can tell you all the details.",
      "id": "ep_100_ut_177"
    },
    {
      "end": 2691924,
      "speaker": "Enrico Bertini",
      "start": 2690544,
      "text": "Our weeds are.",
      "id": "ep_100_ut_178"
    },
    {
      "end": 2693018,
      "speaker": "Destry Sibley",
      "start": 2692394,
      "text": "Hey there.",
      "id": "ep_100_ut_179"
    },
    {
      "end": 2693618,
      "speaker": "Moritz Stefaner",
      "start": 2693066,
      "text": "Exactly.",
      "id": "ep_100_ut_180"
    },
    {
      "end": 2694490,
      "speaker": "Florian Woehrl",
      "start": 2693706,
      "text": "Hello.",
      "id": "ep_100_ut_181"
    },
    {
      "end": 2700938,
      "speaker": "Moritz Stefaner",
      "start": 2694682,
      "text": "Hey there. Good to have you on. So can you tell us a bit about yourself, Destry?",
      "id": "ep_100_ut_182"
    },
    {
      "end": 2713178,
      "speaker": "Florian Woehrl",
      "start": 2701066,
      "text": "So, I live in New York and I produce podcasts, and I also study data visualization, although I think my heart is really in audio. What else? That's it.",
      "id": "ep_100_ut_183"
    },
    {
      "end": 2716754,
      "speaker": "Moritz Stefaner",
      "start": 2713306,
      "text": "And what do you do on the show? What do you do with. For data stories?",
      "id": "ep_100_ut_184"
    },
    {
      "end": 2733214,
      "speaker": "Florian Woehrl",
      "start": 2716914,
      "text": "So mostly I help with the pre production. Right. So booking the guests, getting everything set up ahead of time, taking notes during the interviews, and then helping Florian to get the episode edited and then promoting it, publishing it and promoting it afterwards.",
      "id": "ep_100_ut_185"
    },
    {
      "end": 2735690,
      "speaker": "Moritz Stefaner",
      "start": 2734394,
      "text": "Florian, how about you?",
      "id": "ep_100_ut_186"
    },
    {
      "end": 2789624,
      "speaker": "Destry Sibley",
      "start": 2735762,
      "text": "Yes, I'm living in Berlin, and I know Moritz for a long time, because we are from the same area in south Germany. And I studied media arts in Weimar at the Bauhaus. Bauhaus University. And there they have a chair which is called experimental radio. And yes, it was there where I discovered my love for audio. And it never faded since. Yes, and now I'm mostly. How do you say this in English? Directly for dubbing for computer games. So I direct the voice actors for the German versions of computer games.",
      "id": "ep_100_ut_187"
    },
    {
      "end": 2795064,
      "speaker": "Moritz Stefaner",
      "start": 2790164,
      "text": "So the last few weeks you have been surrounded by orcs and giants and so on, right?",
      "id": "ep_100_ut_188"
    },
    {
      "end": 2837154,
      "speaker": "Destry Sibley",
      "start": 2795804,
      "text": "Mostly orcs, yes, was the past half year, actually. And I missed them already, to be honest. I missed them already. And yes, for data stories, I'm editing all the files you sent me and make sure that no bad sounds are aired. And yes, I'm doing the chapter marks and the ads and all the segments, the catchphrase and stitch it all together so that the listeners have a final episode in the end.",
      "id": "ep_100_ut_189"
    },
    {
      "end": 2853510,
      "speaker": "Moritz Stefaner",
      "start": 2838814,
      "text": "That's true. So what we wanted to do is like, go through from beginning to end, all the little steps that need to happen. And it's quite many, actually, that we realize until an episode goes out. So, Destry, how does it usually start?",
      "id": "ep_100_ut_190"
    },
    {
      "end": 2948026,
      "speaker": "Florian Woehrl",
      "start": 2853622,
      "text": "Like, it starts with a brainstorm rate about who to invite on the show. And that comes from internal conversations, but also comes from guests or listener suggestions of guests. Right. So on the Slack channel, on Twitter, mostly, those are the ways that people suggest. And I think we try to think about having a mix of geographic diversity and gender diversity, although that can be hard in tech sometimes, and then reach out to people and invite them. And some. Sometimes they've heard of the show and sometimes they haven't. So sometimes we have to give them a little context about what the show is about and try to persuade them to come. We don't pay anyone to come on the show, so we have to persuade them that somehow it'll be good for them or at least a good time, a good conversation. And most times people say yes. Our response rate is really good. It's very infrequent, actually, that someone just doesn't respond or says no, and then it just becomes a process of prepping them for the interview. We share notes with them ahead of time, and it's very collaborative. So whatever they want to talk about, we're also open to hearing. And then we record over Skype or sometimes Google Hangouts, which is probably the most fraught part of the production process. We were saying before that we want this to be a call for someone to please develop better web based calling software.",
      "id": "ep_100_ut_191"
    },
    {
      "end": 2948894,
      "speaker": "Enrico Bertini",
      "start": 2948170,
      "text": "Yeah.",
      "id": "ep_100_ut_192"
    },
    {
      "end": 2970496,
      "speaker": "Moritz Stefaner",
      "start": 2951434,
      "text": "Such a huge problem. Yeah. So to the listeners, probably, you don't know, but there's no real software out there that allows you to record multiple people over the Internet in individual tracks that are synchronized. It sounds like a very basic thing for, like, a podcast. And this is what you need to do. Proper audio treatment.",
      "id": "ep_100_ut_193"
    },
    {
      "end": 2971568,
      "speaker": "Enrico Bertini",
      "start": 2970680,
      "text": "That's the biggest.",
      "id": "ep_100_ut_194"
    },
    {
      "end": 2978080,
      "speaker": "Moritz Stefaner",
      "start": 2971616,
      "text": "That would be really great. Yeah. But there's no good software for that. It's amazing, at least not any that.",
      "id": "ep_100_ut_195"
    },
    {
      "end": 2979324,
      "speaker": "Florian Woehrl",
      "start": 2978112,
      "text": "You don't have to pay.",
      "id": "ep_100_ut_196"
    },
    {
      "end": 3010844,
      "speaker": "Moritz Stefaner",
      "start": 2980424,
      "text": "Exactly. Yeah. It's like, okay. And even then, it's not that easy. So what we end up doing is we have a Skype call, or we try to have a Skype call, more or less, which is already a challenge, as some of you might know. And then everybody records locally, so everybody on their computer records their audio, and then we hope all goes well. Usually it doesn't.",
      "id": "ep_100_ut_197"
    },
    {
      "end": 3017368,
      "speaker": "Enrico Bertini",
      "start": 3012304,
      "text": "I think one thing that people don't know is the famous clap that we have to do.",
      "id": "ep_100_ut_198"
    },
    {
      "end": 3020186,
      "speaker": "Moritz Stefaner",
      "start": 3017416,
      "text": "Oh, yeah. Can you explain the clap?",
      "id": "ep_100_ut_199"
    },
    {
      "end": 3061994,
      "speaker": "Enrico Bertini",
      "start": 3020360,
      "text": "Yeah. So basically, since everyone. So we are talking via Skype, but everyone is recording individually, locally. So in order to make sure that the audio tracks are synchronized and that Florian is not pulling too much hair in his head. We have to create a synchronization point. So what we do is that the guest typically has to count three, two, one and clap. And we record this clap from our headphones, putting our headphones next to our mics. So it turns out, since every time we have to do that, we have a large collection of claps. So if you have any ideas on.",
      "id": "ep_100_ut_200"
    },
    {
      "end": 3067286,
      "speaker": "Moritz Stefaner",
      "start": 3063294,
      "text": "What we are electrode and want to have a really cool clap for your.",
      "id": "ep_100_ut_201"
    },
    {
      "end": 3082876,
      "speaker": "Enrico Bertini",
      "start": 3067310,
      "text": "Next track, we should make it open source, an open source library of cloud. And of course, we have all sorts of weird stuff recorded before we start recording the actual show. That would be fun as well.",
      "id": "ep_100_ut_202"
    },
    {
      "end": 3096796,
      "speaker": "Moritz Stefaner",
      "start": 3082940,
      "text": "Yeah. It would be a shame if somebody would publish all these private conversations. Who would do that? Yeah. I mean, unless they were threatened, maybe.",
      "id": "ep_100_ut_203"
    },
    {
      "end": 3103604,
      "speaker": "Enrico Bertini",
      "start": 3096980,
      "text": "Well, we're not planning to become politicians anytime soon, so we're on the same safe side, I guess.",
      "id": "ep_100_ut_204"
    },
    {
      "end": 3128284,
      "speaker": "Florian Woehrl",
      "start": 3104544,
      "text": "But yes, it's worth mentioning, too, that I don't know if most people know this, but a lot of conversations that happen in podcasts happen remotely. So a lot of the famous podcast radio interviewers that you think of, maybe Terry Gross and fresh air, most of those conversations happen not in person. So we also rely on the generosity of our guests to provide their own microphone.",
      "id": "ep_100_ut_205"
    },
    {
      "end": 3129052,
      "speaker": "Moritz Stefaner",
      "start": 3128464,
      "text": "Yep.",
      "id": "ep_100_ut_206"
    },
    {
      "end": 3136628,
      "speaker": "Florian Woehrl",
      "start": 3129148,
      "text": "And headphones. So we asked them to do that, and they are very generous in doing that, too. And that's what assures better sound quality, too.",
      "id": "ep_100_ut_207"
    },
    {
      "end": 3138984,
      "speaker": "Enrico Bertini",
      "start": 3136796,
      "text": "So what happens next? Destry?",
      "id": "ep_100_ut_208"
    },
    {
      "end": 3141860,
      "speaker": "Florian Woehrl",
      "start": 3139324,
      "text": "Take a lot of notes during the conversation.",
      "id": "ep_100_ut_209"
    },
    {
      "end": 3143340,
      "speaker": "Enrico Bertini",
      "start": 3141972,
      "text": "That's so identify.",
      "id": "ep_100_ut_210"
    },
    {
      "end": 3158144,
      "speaker": "Florian Woehrl",
      "start": 3143452,
      "text": "Yeah, yeah. I try to identify where we can post links or share certain images because we're podcasting an audio format about a visual medium.",
      "id": "ep_100_ut_211"
    },
    {
      "end": 3162412,
      "speaker": "Moritz Stefaner",
      "start": 3159724,
      "text": "So this is where the problem starts. Yeah.",
      "id": "ep_100_ut_212"
    },
    {
      "end": 3181936,
      "speaker": "Florian Woehrl",
      "start": 3162508,
      "text": "Yeah. I think if our listeners are not referring to the blog post or the website while they listen, I think I would really encourage them to do so because it'll make for a much richer listening experience. So then we sync all the audio once we've gotten the audio and we send it off to Florian, and then he starts working his magic.",
      "id": "ep_100_ut_213"
    },
    {
      "end": 3188096,
      "speaker": "Enrico Bertini",
      "start": 3182040,
      "text": "Florian, so how does your magic works, our wizard?",
      "id": "ep_100_ut_214"
    },
    {
      "end": 3189920,
      "speaker": "Destry Sibley",
      "start": 3188240,
      "text": "It's not so much magic.",
      "id": "ep_100_ut_215"
    },
    {
      "end": 3194964,
      "speaker": "Enrico Bertini",
      "start": 3190032,
      "text": "I think people have no idea what kind of files you receive and how much work you have to do.",
      "id": "ep_100_ut_216"
    },
    {
      "end": 3197024,
      "speaker": "Moritz Stefaner",
      "start": 3196384,
      "text": "Yeah.",
      "id": "ep_100_ut_217"
    },
    {
      "end": 3200960,
      "speaker": "Destry Sibley",
      "start": 3197144,
      "text": "The thing is, every time it's different, so you can't.",
      "id": "ep_100_ut_218"
    },
    {
      "end": 3206816,
      "speaker": "Enrico Bertini",
      "start": 3201072,
      "text": "We have very different ways of screwing. Right. Very creative. Unscrewing up.",
      "id": "ep_100_ut_219"
    },
    {
      "end": 3207232,
      "speaker": "Moritz Stefaner",
      "start": 3206920,
      "text": "Yes.",
      "id": "ep_100_ut_220"
    },
    {
      "end": 3271634,
      "speaker": "Destry Sibley",
      "start": 3207288,
      "text": "You can't establish a process on which you can rely all the time because it's every time different. But that makes it also very interesting. Honestly, I've learned a lot in audio editing. Over the past two years. And, yeah, typically I check the Dropbox and download all the files there and import it. In my program. I'm using samplitube for editing. Yes. And then first thing I do, I export every stereo file to a mono file because audio typically only needs mono panning and no stereo, especially for the podcast format, because you don't want to wobble the voice from left to right. That's only irritating. And, yeah, then I search for the famous and already mentioned clap.",
      "id": "ep_100_ut_221"
    },
    {
      "end": 3274430,
      "speaker": "Moritz Stefaner",
      "start": 3272974,
      "text": "Where is the clap?",
      "id": "ep_100_ut_222"
    },
    {
      "end": 3351588,
      "speaker": "Destry Sibley",
      "start": 3274542,
      "text": "Where is the clap? That's really interesting because I had everything from the perfect clap, and on every track, it was more or less the same volume from. Okay, was this the clap or was it another sound? I speculating now and then I'm set. And then I just go through the whole episode and cut things out, like the airs and the sounds or the p sounds, explosive sounds. And when that. It's when. And while I'm editing, I'm also setting the chapter marks already because I learned it's way more faster to do it on the fly than afterwards because you have to go through the whole file again and again. Yeah. In the end, I cut out the catchphrase and then comes the second part, which is the mastering and eqing. So I adjust the volumes of all audio files that they are equally.",
      "id": "ep_100_ut_223"
    },
    {
      "end": 3357114,
      "speaker": "Moritz Stefaner",
      "start": 3351756,
      "text": "And it can be very irritating if you have multiple people and one is always louder than the others. Right.",
      "id": "ep_100_ut_224"
    },
    {
      "end": 3422384,
      "speaker": "Destry Sibley",
      "start": 3357734,
      "text": "Yeah. The aim is that in the end, everybody has the same volume. So I typically use a compressor first, so it compresses everything on a certain band of volumes because you need some room for heavy laughter, which occurs quite often in the show. And also, typically, every person starts very loud in the beginning of the sentence, and in the end, it gets very soft. Yeah. Then a little bit of eqing denoising and. Yeah. Then I uploaded to our WordPress site, and there's a cool online tool called Euphonic, which also does some limiting and compressing, and the rest is automatic, more or less.",
      "id": "ep_100_ut_225"
    },
    {
      "end": 3437304,
      "speaker": "Moritz Stefaner",
      "start": 3423004,
      "text": "Yeah, euphonic is really cool. That's also a good tip if you want to do, like, a simple way to just clean up a sound recording, like a voice recording. It does a lot of things out of the box. It's not as good as having a Florian, but it's a start.",
      "id": "ep_100_ut_226"
    },
    {
      "end": 3443652,
      "speaker": "Enrico Bertini",
      "start": 3438764,
      "text": "Yeah. I think what Florian described is when things go particularly well.",
      "id": "ep_100_ut_227"
    },
    {
      "end": 3445804,
      "speaker": "Moritz Stefaner",
      "start": 3443788,
      "text": "Yeah. That never happens like this.",
      "id": "ep_100_ut_228"
    },
    {
      "end": 3448024,
      "speaker": "Enrico Bertini",
      "start": 3445844,
      "text": "That's the best case scenario.",
      "id": "ep_100_ut_229"
    },
    {
      "end": 3456624,
      "speaker": "Moritz Stefaner",
      "start": 3450564,
      "text": "What are some of the things you have encountered? Florian?? And what are some of the. Some of the sticks we throw.",
      "id": "ep_100_ut_230"
    },
    {
      "end": 3459956,
      "speaker": "Enrico Bertini",
      "start": 3457324,
      "text": "What kind of monsters did we throw at you?",
      "id": "ep_100_ut_231"
    },
    {
      "end": 3472596,
      "speaker": "Destry Sibley",
      "start": 3460100,
      "text": "Oh, countless. Beginning from air conditioning in the room. And not so good microphones from guests.",
      "id": "ep_100_ut_232"
    },
    {
      "end": 3480360,
      "speaker": "Moritz Stefaner",
      "start": 3472660,
      "text": "Or multiple audio files are great too, right? If it's like, if the recording stops and restarts again at random points, that's.",
      "id": "ep_100_ut_233"
    },
    {
      "end": 3504644,
      "speaker": "Destry Sibley",
      "start": 3480392,
      "text": "Amazing, then Destry's notes are helping quite a lot. Or typically, if the guest only has some cheap earplugs and has the volume of the skype called so high so that the earplugs, the sound of the earplugs is also recorded on his microphone.",
      "id": "ep_100_ut_234"
    },
    {
      "end": 3515700,
      "speaker": "Moritz Stefaner",
      "start": 3505644,
      "text": "So you have all the recordings bleeding into each other, basically, and creating this sort of incomprehensible noise. And it's hard to fix. Right?",
      "id": "ep_100_ut_235"
    },
    {
      "end": 3536936,
      "speaker": "Destry Sibley",
      "start": 3515852,
      "text": "It's hard to fix. Or basically, you cannot fix it. And what happens then is you can't just push around the audio files. If you say, okay, this pause is too long, I want to shorten it a little bit because you always hear the other ones talking out of the microphone. This is typically the.",
      "id": "ep_100_ut_236"
    },
    {
      "end": 3541584,
      "speaker": "Moritz Stefaner",
      "start": 3537060,
      "text": "The worst case scenario, which somehow happens every two weeks.",
      "id": "ep_100_ut_237"
    },
    {
      "end": 3571338,
      "speaker": "Enrico Bertini",
      "start": 3541624,
      "text": "Yeah. But sometimes you do some kind of like cut and pasting. That looks just unbelievable to me. When I hear it back and I hear what you did, it's like, how did you do that? It's like you take pieces from that we recorded later on and put them at the beginning and it sounds like as. As if we actually recorded it this way. That's some of the most amazing stuff that I've seen happening on the audio side.",
      "id": "ep_100_ut_238"
    },
    {
      "end": 3584282,
      "speaker": "Destry Sibley",
      "start": 3571466,
      "text": "One funny thing, at one point, the episode, at one episode, Enrico was thrown out of the Skype call or your recording stopped somehow, I don't know. And there was.",
      "id": "ep_100_ut_239"
    },
    {
      "end": 3585586,
      "speaker": "Moritz Stefaner",
      "start": 3584338,
      "text": "He just disappeared.",
      "id": "ep_100_ut_240"
    },
    {
      "end": 3601844,
      "speaker": "Destry Sibley",
      "start": 3585730,
      "text": "There was no Enrico at the end. And yeah, I thought it would be really nice and polite for Enrico to say goodbye, at least. So I took a goodbye from an earlier episode and tasted it.",
      "id": "ep_100_ut_241"
    },
    {
      "end": 3604484,
      "speaker": "Moritz Stefaner",
      "start": 3603704,
      "text": "Nice.",
      "id": "ep_100_ut_242"
    },
    {
      "end": 3606884,
      "speaker": "Enrico Bertini",
      "start": 3605744,
      "text": "I love that.",
      "id": "ep_100_ut_243"
    },
    {
      "end": 3614904,
      "speaker": "Moritz Stefaner",
      "start": 3609104,
      "text": "Cool. And so Florian sends the edited files. Destry, what happens then?",
      "id": "ep_100_ut_244"
    },
    {
      "end": 3637818,
      "speaker": "Florian Woehrl",
      "start": 3614984,
      "text": "Then we prepare the post. Prepare the episode. And Enrico typically writes it, it does the images. And then I edit everything and make sure everything's there most of the time and then publish it out to the world. Then we promote it on Twitter and in slack on Facebook and try to.",
      "id": "ep_100_ut_245"
    },
    {
      "end": 3642802,
      "speaker": "Moritz Stefaner",
      "start": 3637946,
      "text": "Do little movie animations keynote. Right. That's a nice hack.",
      "id": "ep_100_ut_246"
    },
    {
      "end": 3666050,
      "speaker": "Florian Woehrl",
      "start": 3642858,
      "text": "Yeah, yeah. Make little visuals, because Twitter still isn't a very audio friendly form and neither is Facebook. So both of those social media platforms are much friendlier to video, so it's easier to use those and try to just generate attention and let our guests know, of course. Watch the conversation around it.",
      "id": "ep_100_ut_247"
    },
    {
      "end": 3686766,
      "speaker": "Moritz Stefaner",
      "start": 3666082,
      "text": "Yeah. Lots of little steps. And it really took a while until we found, like, a good process. We're still tweaking it. Right. So it's still. Yeah. But it's a long checklist and we use a Trello board, which has proven really, like, useful. So there's a long list of potential guests and a shorter list of. Yeah, a short list of guests.",
      "id": "ep_100_ut_248"
    },
    {
      "end": 3688598,
      "speaker": "Enrico Bertini",
      "start": 3686950,
      "text": "We have an interesting workflow.",
      "id": "ep_100_ut_249"
    },
    {
      "end": 3700630,
      "speaker": "Moritz Stefaner",
      "start": 3688686,
      "text": "Every recording moves from, like, left to right on the board, basically from planned to scheduled, recorded, edited and so on. So that works quite well considering we're.",
      "id": "ep_100_ut_250"
    },
    {
      "end": 3703166,
      "speaker": "Florian Woehrl",
      "start": 3700702,
      "text": "Four people in three countries. Is that right?",
      "id": "ep_100_ut_251"
    },
    {
      "end": 3705822,
      "speaker": "Moritz Stefaner",
      "start": 3703310,
      "text": "Across times and across time zones.",
      "id": "ep_100_ut_252"
    },
    {
      "end": 3708794,
      "speaker": "Florian Woehrl",
      "start": 3705878,
      "text": "And often in interviewing people in completely different time zones.",
      "id": "ep_100_ut_253"
    },
    {
      "end": 3718238,
      "speaker": "Moritz Stefaner",
      "start": 3710534,
      "text": "That's true. Did we ever have a total disaster? Did we ever, like. I think we always managed to somehow produce something.",
      "id": "ep_100_ut_254"
    },
    {
      "end": 3721430,
      "speaker": "Enrico Bertini",
      "start": 3718406,
      "text": "I think we had a couple of times where we had to re record.",
      "id": "ep_100_ut_255"
    },
    {
      "end": 3722926,
      "speaker": "Florian Woehrl",
      "start": 3721582,
      "text": "I can think of one.",
      "id": "ep_100_ut_256"
    },
    {
      "end": 3726630,
      "speaker": "Moritz Stefaner",
      "start": 3723070,
      "text": "Yeah. Parts. Yeah. Did we have, like, a total.",
      "id": "ep_100_ut_257"
    },
    {
      "end": 3728034,
      "speaker": "Enrico Bertini",
      "start": 3726822,
      "text": "Total failure?",
      "id": "ep_100_ut_258"
    },
    {
      "end": 3730094,
      "speaker": "Florian Woehrl",
      "start": 3728814,
      "text": "I don't want to say who it was.",
      "id": "ep_100_ut_259"
    },
    {
      "end": 3731118,
      "speaker": "Moritz Stefaner",
      "start": 3730134,
      "text": "We don't talk about that.",
      "id": "ep_100_ut_260"
    },
    {
      "end": 3732830,
      "speaker": "Enrico Bertini",
      "start": 3731166,
      "text": "But we did.",
      "id": "ep_100_ut_261"
    },
    {
      "end": 3742690,
      "speaker": "Moritz Stefaner",
      "start": 3732862,
      "text": "Oh, yes. There was whole second recording of a full episode. Yeah. Not talking up. No. Not gonna say who. I think the second one was amazing and really successful. I say that.",
      "id": "ep_100_ut_262"
    },
    {
      "end": 3745914,
      "speaker": "Enrico Bertini",
      "start": 3742722,
      "text": "Yeah, exactly. So it was really worth it. Yeah.",
      "id": "ep_100_ut_263"
    },
    {
      "end": 3755346,
      "speaker": "Florian Woehrl",
      "start": 3745994,
      "text": "The first recording, I think, was after a conference, and everyone was a little exhausted and brain dead. And when we listened back to the recording, it sounded like nonsense. So.",
      "id": "ep_100_ut_264"
    },
    {
      "end": 3758014,
      "speaker": "Enrico Bertini",
      "start": 3755450,
      "text": "So we have some control here.",
      "id": "ep_100_ut_265"
    },
    {
      "end": 3763934,
      "speaker": "Moritz Stefaner",
      "start": 3759634,
      "text": "It hasn't stopped us in the past. Why suddenly care about nonsense?",
      "id": "ep_100_ut_266"
    },
    {
      "end": 3791044,
      "speaker": "Enrico Bertini",
      "start": 3765864,
      "text": "So, in case this is not clear from the description, without these two guys, the show couldn't exist, basically. So it's a huge amount of work and. Yeah. I want to take this opportunity to thank you. I think it's awesome. Data stories couldn't exist without you at this point. It's a really complex process and. Yeah. Thanks.",
      "id": "ep_100_ut_267"
    },
    {
      "end": 3796934,
      "speaker": "Destry Sibley",
      "start": 3791554,
      "text": "Yes. Thank you for making this amazing podcast happening and possible.",
      "id": "ep_100_ut_268"
    },
    {
      "end": 3810122,
      "speaker": "Moritz Stefaner",
      "start": 3799314,
      "text": "Did you learn interesting things about data visualization? So the interesting thing is Florian is really like an audio and media guy. So for you, the whole Dataviz thing is totally a different world, right?",
      "id": "ep_100_ut_269"
    },
    {
      "end": 3811094,
      "speaker": "Destry Sibley",
      "start": 3810298,
      "text": "Yes.",
      "id": "ep_100_ut_270"
    },
    {
      "end": 3817934,
      "speaker": "Moritz Stefaner",
      "start": 3811874,
      "text": "What were the main things you found interesting or that you stumbled over, maybe, or that you found cures?",
      "id": "ep_100_ut_271"
    },
    {
      "end": 3825926,
      "speaker": "Destry Sibley",
      "start": 3818654,
      "text": "So I started to work with you on episode 52. That was March 2015.",
      "id": "ep_100_ut_272"
    },
    {
      "end": 3827086,
      "speaker": "Moritz Stefaner",
      "start": 3826110,
      "text": "Long time ago.",
      "id": "ep_100_ut_273"
    },
    {
      "end": 3842342,
      "speaker": "Destry Sibley",
      "start": 3827190,
      "text": "Long time ago. And just before the recording, I skipped through the episode list, and there was this episode 58 with data installations, with domestic data streamers.",
      "id": "ep_100_ut_274"
    },
    {
      "end": 3843990,
      "speaker": "Enrico Bertini",
      "start": 3842398,
      "text": "Yeah, yeah.",
      "id": "ep_100_ut_275"
    },
    {
      "end": 3845078,
      "speaker": "Moritz Stefaner",
      "start": 3844102,
      "text": "A good one.",
      "id": "ep_100_ut_276"
    },
    {
      "end": 3909884,
      "speaker": "Destry Sibley",
      "start": 3845206,
      "text": "Like a melting pot between visualization and art. And I like art and also like modern art, meaning computer art or programmed art. So this was really a nice episode to listen to. And I catched myself while editing, more listening than editing. And after five minutes, oh, I should go back and edit the last five minutes, not just listen to it. And another episode I found quite interesting was, of course, the Hans Rosling tribute, because I think he's a guy who made the work of visualization accessible for non professionals in the field. There are a bunch of others I could mention, but I think these two stand out like the most of it.",
      "id": "ep_100_ut_277"
    },
    {
      "end": 3913204,
      "speaker": "Moritz Stefaner",
      "start": 3910344,
      "text": "Interesting. Destry, how about you?",
      "id": "ep_100_ut_278"
    },
    {
      "end": 3921444,
      "speaker": "Florian Woehrl",
      "start": 3913944,
      "text": "The Hans Rosling episode, for sure. And I think I loved the year in review around the world.",
      "id": "ep_100_ut_279"
    },
    {
      "end": 3923040,
      "speaker": "Moritz Stefaner",
      "start": 3922304,
      "text": "That was nice.",
      "id": "ep_100_ut_280"
    },
    {
      "end": 3926560,
      "speaker": "Enrico Bertini",
      "start": 3923112,
      "text": "That was something. Oh, my God, so much work around the world.",
      "id": "ep_100_ut_281"
    },
    {
      "end": 3968714,
      "speaker": "Florian Woehrl",
      "start": 3926712,
      "text": "Yeah, it was a lot of work, but I think it was a great opportunity to show that this is an industry that is global and is not just euro or north American centric. So I liked that. And because it's so much rooted in the web, there is an opportunity for people to contribute to it all around the world. So that felt like an exciting opportunity to showcase that. And I think when we had the data, ethics and privacy episode, but also has stayed with me a lot, maybe just because it's especially terrifying all the questions that got raised by Ellen Arceda.",
      "id": "ep_100_ut_282"
    },
    {
      "end": 3971238,
      "speaker": "Moritz Stefaner",
      "start": 3970654,
      "text": "Yeah.",
      "id": "ep_100_ut_283"
    },
    {
      "end": 3972474,
      "speaker": "Florian Woehrl",
      "start": 3971326,
      "text": "What about you guys?",
      "id": "ep_100_ut_284"
    },
    {
      "end": 4007154,
      "speaker": "Moritz Stefaner",
      "start": 3973774,
      "text": "Yeah, good question. I mean, but I agree, it's sort of we, it's something I observed is that in the beginning, we were mostly about, like, techniques and it's cool to do data visualization. How do we do it best? Yeah. And now much more to. Yeah, exactly. Like, oh, there might be problems and how, you know, how will all this play out? And what does it mean in the big picture? And so I totally enjoy that, but it's something I realized afterwards, like, oh, wow. A few years ago, we were much more, like, maybe naive, but also maybe more, I don't know, optimistic about everything.",
      "id": "ep_100_ut_285"
    },
    {
      "end": 4010230,
      "speaker": "Enrico Bertini",
      "start": 4009614,
      "text": "Yeah.",
      "id": "ep_100_ut_286"
    },
    {
      "end": 4024356,
      "speaker": "Moritz Stefaner",
      "start": 4010342,
      "text": "But I still think it's super fascinating. So for us, it's mostly a way to just talk to people we want to talk to. Right, Enrico? It's like a very complicated way to have a conversation with somebody, but, yeah.",
      "id": "ep_100_ut_287"
    },
    {
      "end": 4046240,
      "speaker": "Enrico Bertini",
      "start": 4024380,
      "text": "But at the same time, there is a little bit of balancing there. Right. Trying to cover. I mean, we really try not. Not to have a variety. Right. Of kind of like different. Trying to cover different topics, different styles, different kind of people. So try to make it lively in this sense.",
      "id": "ep_100_ut_288"
    },
    {
      "end": 4070414,
      "speaker": "Moritz Stefaner",
      "start": 4046432,
      "text": "Yeah. But I think that's also still our biggest struggle is to really make it, like, varied and not fall into the same sort of repetitive loops of, yeah, we invite the people we know and we talk about the things we know how to talk about. And so it's something we constantly try to like, you know, expand our horizon, but it's also constantly struggle in a way. Right.",
      "id": "ep_100_ut_289"
    },
    {
      "end": 4140314,
      "speaker": "Enrico Bertini",
      "start": 4070534,
      "text": "That's one of the biggest challenge because you're always pulled by the latest things. Right. You see something cool or a new person rising and you want to have this person on the show as soon as possible before somebody else does it. And so there's a little bit of struggle there. But at the same time, there are lots of interesting other topics and people that should be covered. And that's why I agree with Destry. I think the end of year episode trying to go around the world has been one of my main highlights from last year. I'm really happy that we did that and it was very, very revealing for myself going through the process of figuring out so who is actually out there in other countries, we spent literally weeks just trying to figure out who is there. Right. And then it turns out that there are amazing people around the world. Of course. Right. So trying to keep our view wide enough and not focus only on what is shiny, I think it's something that can always be improved and. Yeah, it's really important.",
      "id": "ep_100_ut_290"
    },
    {
      "end": 4148886,
      "speaker": "Destry Sibley",
      "start": 4140654,
      "text": "Yeah, maybe that's something for this year or next year to concentrate more on other continents or.",
      "id": "ep_100_ut_291"
    },
    {
      "end": 4149646,
      "speaker": "Enrico Bertini",
      "start": 4148950,
      "text": "Yeah.",
      "id": "ep_100_ut_292"
    },
    {
      "end": 4157510,
      "speaker": "Destry Sibley",
      "start": 4149830,
      "text": "Every now and then to have someone from Asia or South America or Africa in the show would be nice.",
      "id": "ep_100_ut_293"
    },
    {
      "end": 4158614,
      "speaker": "Enrico Bertini",
      "start": 4157662,
      "text": "Yeah, exactly.",
      "id": "ep_100_ut_294"
    },
    {
      "end": 4210004,
      "speaker": "Moritz Stefaner",
      "start": 4158694,
      "text": "Definitely agree. Yeah. So if you have good suggestions, we are always open for good suggestions. Yeah, we don't know what we don't know, so let us know. Cool. Thanks so much. This is, I mean, we know how it works behind the scenes, but I hope our listeners found it interesting, too. And if you have any questions on the production, let us know. Maybe you want to start a podcast as well and need some basic tips or basic traps to avoid. It's a lot of detailed knowledge you have to just acquire by making all the mistakes. And we have done a few. So let us know if you have any questions. Yeah, yeah. Thanks, Destry. Thanks, Florian. It's great to work with you and let's hope we can do another 100 together. I wouldn't mind. So.",
      "id": "ep_100_ut_295"
    },
    {
      "end": 4236984,
      "speaker": "Destry Sibley",
      "start": 4210464,
      "text": "Me neither. Thanks to you guys. Thanks, Dastri. I think. I think the team is super cool and the communication is always so warm and welcoming and yeah, it's fun and I'm learning a lot, so. And I get paid a little bit for it. So what else do you want to.",
      "id": "ep_100_ut_296"
    },
    {
      "end": 4238964,
      "speaker": "Moritz Stefaner",
      "start": 4237024,
      "text": "Learning a lot, getting paid a little bit.",
      "id": "ep_100_ut_297"
    },
    {
      "end": 4247954,
      "speaker": "Florian Woehrl",
      "start": 4240894,
      "text": "That's what we should put on the team page of the website. The team is super cool and I get paid a little bit for it.",
      "id": "ep_100_ut_298"
    },
    {
      "end": 4251234,
      "speaker": "Moritz Stefaner",
      "start": 4249614,
      "text": "Yeah, that's how it works.",
      "id": "ep_100_ut_299"
    },
    {
      "end": 4285406,
      "speaker": "Enrico Bertini",
      "start": 4253214,
      "text": "Yeah. By the way, I think that's a good opportunity to mention the fact that when we ask you listeners to help us and donate some little sum using Patreon, it's because, yeah, we want these two amazing guys to keep working for us and just get paid a little bit because they do amazing, amazing work for us. So I guess now you have a little bit more details of what happens behind the scenes. It's a lot of work.",
      "id": "ep_100_ut_300"
    },
    {
      "end": 4290874,
      "speaker": "Moritz Stefaner",
      "start": 4285510,
      "text": "True, true. So thank you and hope to have you back at some point.",
      "id": "ep_100_ut_301"
    },
    {
      "end": 4293982,
      "speaker": "Enrico Bertini",
      "start": 4293254,
      "text": "Thank you.",
      "id": "ep_100_ut_302"
    },
    {
      "end": 4294942,
      "speaker": "Florian Woehrl",
      "start": 4294078,
      "text": "Thank you.",
      "id": "ep_100_ut_303"
    },
    {
      "end": 4295590,
      "speaker": "Moritz Stefaner",
      "start": 4295078,
      "text": "Bye bye.",
      "id": "ep_100_ut_304"
    },
    {
      "end": 4297714,
      "speaker": "Destry Sibley",
      "start": 4295622,
      "text": "I think I'll be hearing you.",
      "id": "ep_100_ut_305"
    },
    {
      "end": 4301274,
      "speaker": "Moritz Stefaner",
      "start": 4299414,
      "text": "Way more than you intend.",
      "id": "ep_100_ut_306"
    },
    {
      "end": 4339004,
      "speaker": "Enrico Bertini",
      "start": 4308894,
      "text": "Okay, so now we want to briefly cover what has changed during the last five years. Kind of like a little bit of a reflection of what were the main themes. And so me and Moritz have been thinking about what happened. Right. It's been five years. Five long years. Can we identify any major trends? Some of them I think we already mentioned, but, yeah, we have a few notes on that. So, Moritz, maybe you want to start with your first one.",
      "id": "ep_100_ut_307"
    },
    {
      "end": 4354162,
      "speaker": "Moritz Stefaner",
      "start": 4339124,
      "text": "Sure. I mean, we just listened to the start of episode one and we both said, like, wow, we sound so young. And everything was different then. It's like, in many ways also the same, but it's a lot has happened in these five years, for sure.",
      "id": "ep_100_ut_308"
    },
    {
      "end": 4354926,
      "speaker": "Enrico Bertini",
      "start": 4354308,
      "text": "Oh, my God.",
      "id": "ep_100_ut_309"
    },
    {
      "end": 4416304,
      "speaker": "Moritz Stefaner",
      "start": 4354990,
      "text": "I mean, I've been doing data visualizations professionally for commissions, maybe like 1012 years now. So I think I've seen sort of a few really long arcs of developments. But these five years also, the last three years even seem so much has changed and so much has been going on in terms of how the field has matured, how much it has split up also in all these little sub disciplines. So I thought data visualization is a niche, and to the outside it is, but now I see all the niches in the niches. It's like, it's crazy. But, I mean, thinking back at the beginning, I think I was mostly fascinated just by giving data an interesting shape and just making beautiful visualization pieces. Right. So I really loved Ben Fry stuff and Jonathan Harris and Martin Wattenberg's work, where they just managed to give, like a unique, really on the point, interesting aesthetic shape to a dataset.",
      "id": "ep_100_ut_310"
    },
    {
      "end": 4417088,
      "speaker": "Enrico Bertini",
      "start": 4416384,
      "text": "Yeah.",
      "id": "ep_100_ut_311"
    },
    {
      "end": 4542362,
      "speaker": "Moritz Stefaner",
      "start": 4417256,
      "text": "And also just keep it a bit mysterious and make it this unique thing. Yeah. And not explain too much. And not talk about it too much, but just, you know, produce a thing, put it out there and that's it. Yeah. And so that, I think that was in the beginning also my approach in many ways. And I did work a bit in tools or software components or also like enterprise tools. But to me, the real interest in data visualization came more actually from this design artistic approach. Right. And then also over the last five years, I think I learned much more about everything that needs to go around such a nice data piece to actually make it a successful tool or to actually make it a successful communication piece. Like all the user interface design, all the user experience aspects, the web design aspect, the social components, the sharing, the text, the wording, the communication. So I think that's one of the big things I learned only over the last few years, like what needs to go around the chart to make it successful. And I did a presentation with Dominicus, I think two or three years ago, or like a tutorial at viz that was called everything except the chart. And I think it summarizes a couple of things that we learned in that area, at least what you need to think of. And this has been one of the big learnings to me. And of course also in some form, some, let's say, lightweight storytelling, narration, communication aspects. I'm not going to deny that. So I think I have become more interested it also telling stories. I'll put it out there on the record. Yeah, but not always. Not always. I don't think everything needs to be a story. Yeah. And I mean, we discussed it a bit already. I've become much more skeptical of data as such. So like just by working with lots of different data sets and seeing how bad they are, I have to tell.",
      "id": "ep_100_ut_312"
    },
    {
      "end": 4544074,
      "speaker": "Enrico Bertini",
      "start": 4542378,
      "text": "The same for me. Yeah, yeah.",
      "id": "ep_100_ut_313"
    },
    {
      "end": 4586714,
      "speaker": "Moritz Stefaner",
      "start": 4544114,
      "text": "And like how, how many of them just failed to capture what they were intended to capture, like the huge biases in data sets and then you get scared because many people are not aware of these biases and the problems and just interpret the end results. Right. And so I've grown much more skeptical about whole profession in many ways, which I think is good, but. And I think it also shows we need good, smart, educated, critical professionals working on data issues. Right. It's like we can't leave that to just like data enthusiasts, let's say, who will do anything that sounds like technologically interesting.",
      "id": "ep_100_ut_314"
    },
    {
      "end": 4588354,
      "speaker": "Enrico Bertini",
      "start": 4587574,
      "text": "Yeah.",
      "id": "ep_100_ut_315"
    },
    {
      "end": 4703766,
      "speaker": "Moritz Stefaner",
      "start": 4588694,
      "text": "And I mean, yeah, lots of these things. And I mean, for me everything has changed. I keep changing directions in my own works. So I did a lot of communications projects and I did a lot of more cultural analytics projects and art like projects and like Selfie City and on Broadway with my collaborators, Lev Manovich and others. And now I'm sort of circling back a bit more. So in the beginning I did a lot of code myself and did various self contained works. And I'm sort of, I get back to enjoying that quite a bit. And yeah, so maybe I'm going back to my roots. And so right now I have really interesting projects. So there's one where we visualize the election. So in Germany we have big elections coming up and we visualize the search interest for the candidates together with Google, so we can track which keywords are being associated with which people. Super interesting. I built a really applied tool for the German railway company, like internally, so they can plan the heavy load days a bit better. So super applied. So I'm trying to prove that there is a need for bespoke and a good use for bespoke data visualization in the enterprise. And I also like have a more playful and more communications heavy project, basically visualizing the ecosystem that is a company, like all the people, all the relations, all the different fluid dynamics that go on for a German startup. It's a nice mix of projects. Much more, again, in my original ballpark, let's say, but a lot has happened. How about you, Enrico? What's your take on the big arcs?",
      "id": "ep_100_ut_316"
    },
    {
      "end": 4813404,
      "speaker": "Enrico Bertini",
      "start": 4703830,
      "text": "Yeah, I think reflecting on what happened during the last five years, I think the thing that stands out for me is that what is really interesting personally, is that we basically started data stories a little earlier than I moved to the US and became a professor. Right, that's true. So when I think of data stories, for me, it perfectly aligns with this big transition for me. Right. And I think one of the main characteristics of becoming a professor is that all in a sudden you have to figure out what you really want to do, right. Before becoming a professor, you always have someone who is in one way or another guiding you. Right. But when you become a professor, you have to figure out what you want to do. And definitely I can say that data stories has been a huge influence in the way I decided to steer my work and my research. So I can clearly remember that as a researcher in visualization, I used to be much, much more focused on data analysis. And I was not aware of the fact that visualization was becoming so popular in terms of being used as a presentation or communication tool. Right. So one of the first thing that happened was that I thought about, how can I do research that actually is more on the communication side of this. Right. Today, it sounds weird, but if you look at the body of research developed until, say, the early two thousands. Right. It's been mostly about having this assumption that visualization is mostly a tool for data analysis.",
      "id": "ep_100_ut_317"
    },
    {
      "end": 4822508,
      "speaker": "Moritz Stefaner",
      "start": 4813564,
      "text": "I think that's been sitting alone at a desktop computer thinking hard, concentrating on a heat map.",
      "id": "ep_100_ut_318"
    },
    {
      "end": 5069196,
      "speaker": "Enrico Bertini",
      "start": 4822676,
      "text": "Exactly. So the influence on my work has been huge, and that's the reason why. So looking back, when I became a professor here at NYU, I started doing research more on science, some experimental research, more on the communication side of this. So, for instance, I've been working on visualization and persuasion. Right. Or visualization and deception. Can we deceive people with charts? And it's been a lot of fun running experiments on trying to figure out what happens when you expose people to this kind of information. Right. Actually very challenging. I have to confess that many times I felt totally inadequate. So I've been learning myself a lot of these things. And another thing that I kind of like mentioned earlier, for me, it's been very important to see, I think, data stories as a vehicle to communicate things happening in academia to practitioners and the other way around. So it's been always surprising and delightful for me to see. So, say, when I go to the, I try police conference that is mostly an academic conference, knowing that people are listening to it. Right. Having students stopping me on the corridor and saying, hey, I listened to daily stories. It's awesome. Thanks for doing it. Right. It's not just the pleasure of getting some compliments. It's more like knowing that there are people in academia who are actually listening to the amazing things that people that practitioners are doing and the other way around. I think that's always been one of the main motives behind doing the show for me. And. Yeah, and I think now it's much more established than before. Now you can. I remember, so we had a few academics on the show, and I know from their stories that they've been extremely happy to be invited as guests. Right. I remember, I don't know, some people saying, hey, my students are so excited that you've been talking about our project on the show. So they see it as a way to kind of, like, sponsor, advertise their work. So that's. That's something really, really important. And I have to say that academics have become so much better at communicating their work. Every year I see more and more people publishing, creating web pages, describing their work repositories. That's one of the major trends I've seen in academia. And, yeah, kudos to all of you. That's been great. Right. And what else? I think another big thing is teaching. I used to think of teaching mostly as well. That's another one of those things that I need to do as a professor. Professor, right. And then listening to what is happening on the show and our guests and how much people are kind of like have a thirst for knowledge and learning and teaching learning material. Kind of like been reconsidering how important teaching is in this field, in this space. I think, as I said before, teaching is huge. And it's definitely one of those things that I want to spend much more time thinking about. And it's mostly, this idea mostly comes from receiving so much feedback from our listeners saying, hey, how can I do that? How can I start? I really love this field. Please tell me, where do I start? Which tools should I use? Which books are the best? Right. Are there any courses out there? There. Should I go to a design school or an engineering school? We should actually create an faq somewhere. Some of these questions are kind of like classics by now.",
      "id": "ep_100_ut_319"
    },
    {
      "end": 5070744,
      "speaker": "Moritz Stefaner",
      "start": 5069380,
      "text": "That's true. Yeah.",
      "id": "ep_100_ut_320"
    },
    {
      "end": 5145032,
      "speaker": "Enrico Bertini",
      "start": 5071044,
      "text": "And, yeah, that's mostly it. I have to say another couple of things. As I said, I'm really, really happy to see industry kind of like becoming more of a thing in visualization. I think there's always been some industry, but it's kind of like getting better. Right? There are more companies and there are more positions within companies for people who want to do visualization. This has been a source of reflection for me as a researcher, thinking, how can I actually do research that serves people right? So listening to our episodes and figuring out that there are people who are doing visualization in many different ways, one of the questions that I've been developing over the years is how does my work connect to what they are doing? And this is still an ongoing struggle for me. I definitely, I am one of those people who believe that what we do as researchers should actually serve practitioners and students, and I'm still struggling myself how to do that properly.",
      "id": "ep_100_ut_321"
    },
    {
      "end": 5227622,
      "speaker": "Moritz Stefaner",
      "start": 5145088,
      "text": "So, yeah, I agree that there's much more positions and teams being formed and people find their roles by now. One thing I'm still sort of looking for, and it's something I was actually debating already, like 1015 years ago with Boris Muller, my professor in Potsdam. When I was, like, studying, is there's really not enough adoption of data visualization, like techniques in product, you know, like there. And at the time, we were looking at, like, visual designs for operating systems, you know, for computers. So we thought like, that's the next big thing, obviously, you know, everything will be like Venn diagrams and force layouts, you know, on the file system and stuff like that. This, but. And I think this is still, still not happening. I was sort of still waiting. Like, you know, like there has been a little bit of a push with all the quantified self and the sports apps and stuff like this. Like a lot of the people serious about like training and sports are also serious about data, but I think there could be much more. Also data visualization inspired user interface design, let's say. Right, but, yeah, we'll see, we'll see. Yeah, yeah. And you forgot to mention, podcasting has become a big thing. It was also crazy.",
      "id": "ep_100_ut_322"
    },
    {
      "end": 5246166,
      "speaker": "Enrico Bertini",
      "start": 5227798,
      "text": "That has changed considerably. Right. I used to have, what, two podcasts? And my list, one was data stories, and that's kind of like I'm always making new ones and removing some old ones. It's huge. Podcasting is huge. Yeah, yeah.",
      "id": "ep_100_ut_323"
    },
    {
      "end": 5252194,
      "speaker": "Moritz Stefaner",
      "start": 5246350,
      "text": "And that was also fun to sort of follow that and be a part of that. Like the podcast hype. It's kind of nice.",
      "id": "ep_100_ut_324"
    },
    {
      "end": 5270634,
      "speaker": "Enrico Bertini",
      "start": 5252934,
      "text": "Yeah. We've been just lucky to start at the right time. And I also want to mention that, yeah, that's something that has changed considerably. There are quite a few data related podcasts out there. So kind of like, for a few years we've been like solitary journey.",
      "id": "ep_100_ut_325"
    },
    {
      "end": 5271774,
      "speaker": "Moritz Stefaner",
      "start": 5271054,
      "text": "Right, right.",
      "id": "ep_100_ut_326"
    },
    {
      "end": 5292530,
      "speaker": "Enrico Bertini",
      "start": 5271854,
      "text": "And now there are quite a few ones. Right. And some of them are related to visualization. Some are more on machine learning, some are more on data in general, data analytics. But it's great to see this kind of like ecology of data related podcasts happening. That's definitely a good thing.",
      "id": "ep_100_ut_327"
    },
    {
      "end": 5297410,
      "speaker": "Moritz Stefaner",
      "start": 5292642,
      "text": "I want to see a few shout outs to. What do you listen to?",
      "id": "ep_100_ut_328"
    },
    {
      "end": 5313644,
      "speaker": "Enrico Bertini",
      "start": 5297522,
      "text": "Well, we have policy vis. It's clearly the closest thing to what we do. So John has done a great, great, great job. I'm really happy to see that there is at least another one great data visualization podcast, and he has great.",
      "id": "ep_100_ut_329"
    },
    {
      "end": 5318988,
      "speaker": "Moritz Stefaner",
      "start": 5313684,
      "text": "It's been a little bit of. A lot of the guests we have on our list have been on his show already and vice versa.",
      "id": "ep_100_ut_330"
    },
    {
      "end": 5331352,
      "speaker": "Enrico Bertini",
      "start": 5319076,
      "text": "Yeah. Right. The more of these podcasts there are out there, the harder it is for us to catch one person, one for John.",
      "id": "ep_100_ut_331"
    },
    {
      "end": 5333136,
      "speaker": "Moritz Stefaner",
      "start": 5331488,
      "text": "Yeah, but it's great.",
      "id": "ep_100_ut_332"
    },
    {
      "end": 5334880,
      "speaker": "Enrico Bertini",
      "start": 5333200,
      "text": "I think it's great to see this happen.",
      "id": "ep_100_ut_333"
    },
    {
      "end": 5343848,
      "speaker": "Moritz Stefaner",
      "start": 5334992,
      "text": "And I also enjoy the 538 podcast. It's a really good one. So they've done a lot on the election coverage and keep going. Really good.",
      "id": "ep_100_ut_334"
    },
    {
      "end": 5345044,
      "speaker": "Enrico Bertini",
      "start": 5343896,
      "text": "Yeah, yeah.",
      "id": "ep_100_ut_335"
    },
    {
      "end": 5353856,
      "speaker": "Moritz Stefaner",
      "start": 5345344,
      "text": "There's also more data science oriented ones, like, what do you listen to? Like partially derivatives.",
      "id": "ep_100_ut_336"
    },
    {
      "end": 5414154,
      "speaker": "Enrico Bertini",
      "start": 5353960,
      "text": "I really like data skeptic. Data skeptic is really my favorite one. The other ones tend to be a little bit too technical for my taste. I tend to listen to podcasts when I want to relax or just don't think too much. I found some of the core machine learning ones tend to be a little too technical for my taste, but it's just me. But data skeptic is a very nice blend of, of, I don't know. I think that it's a very nice blend of telling some stories, but also giving a little bit of technical information, but never too hard that you cannot follow. And they also have this very nice format where they have mini episodes where they explain one specific concept in a few minutes without any jargon or anything. And so it's very well designed. It's definitely one of my favorites.",
      "id": "ep_100_ut_337"
    },
    {
      "end": 5418522,
      "speaker": "Moritz Stefaner",
      "start": 5414274,
      "text": "Sounds good, listeners. If you have good suggestions for this, let us know.",
      "id": "ep_100_ut_338"
    },
    {
      "end": 5426054,
      "speaker": "Enrico Bertini",
      "start": 5418618,
      "text": "Or if you want to start your own podcast, do it. The best way to start the podcast, just do it.",
      "id": "ep_100_ut_339"
    },
    {
      "end": 5432226,
      "speaker": "Moritz Stefaner",
      "start": 5428674,
      "text": "Proven method. Step one, start doing it.",
      "id": "ep_100_ut_340"
    },
    {
      "end": 5442190,
      "speaker": "Enrico Bertini",
      "start": 5432330,
      "text": "Don't overthink it, just do it. It's never been so easy. Right. Grab a mic and start talking.",
      "id": "ep_100_ut_341"
    },
    {
      "end": 5451870,
      "speaker": "Moritz Stefaner",
      "start": 5442302,
      "text": "Cool. I think we need to stop talking at some point. It's one of the classic chatty Moritz and Enrico episodes.",
      "id": "ep_100_ut_342"
    },
    {
      "end": 5455794,
      "speaker": "Enrico Bertini",
      "start": 5451902,
      "text": "Yeah, we haven't had a good one for some time.",
      "id": "ep_100_ut_343"
    },
    {
      "end": 5460618,
      "speaker": "Moritz Stefaner",
      "start": 5456254,
      "text": "Yeah, we never get to talk to each other, just with other people. So what can you do?",
      "id": "ep_100_ut_344"
    },
    {
      "end": 5465218,
      "speaker": "Enrico Bertini",
      "start": 5460806,
      "text": "So maybe we can briefly talk about the future, what we intend to do.",
      "id": "ep_100_ut_345"
    },
    {
      "end": 5467650,
      "speaker": "Moritz Stefaner",
      "start": 5465346,
      "text": "Yeah. Make bold predictions.",
      "id": "ep_100_ut_346"
    },
    {
      "end": 5468854,
      "speaker": "Enrico Bertini",
      "start": 5467842,
      "text": "Predictions.",
      "id": "ep_100_ut_347"
    },
    {
      "end": 5497844,
      "speaker": "Moritz Stefaner",
      "start": 5470914,
      "text": "I was wondering, what do you think? Where is data visualization? In the gardener hype cycle. Right. Do you know the gardener hype cycle? So there's a theory. There's like a new technology or a new idea technique. Then it gets hyped to the peak of inflated expectations so it quickly reaches maximum interest. And everybody thinks it's gonna be awesome. It goes through this trial of disillusionment, basically, when people realize it's not that awesome.",
      "id": "ep_100_ut_348"
    },
    {
      "end": 5499940,
      "speaker": "Enrico Bertini",
      "start": 5497964,
      "text": "Yeah, I think we're getting slowly, has.",
      "id": "ep_100_ut_349"
    },
    {
      "end": 5516884,
      "speaker": "Moritz Stefaner",
      "start": 5499972,
      "text": "To crawl back up. Yeah. Slowly on the slope of enlightenment. And then at some point it just gets adopted in reality. Right. And it's sort of not on the same level as everybody thought, but, yeah, things find their role. Like, where do you think? Where are we there?",
      "id": "ep_100_ut_350"
    },
    {
      "end": 5518108,
      "speaker": "Enrico Bertini",
      "start": 5517044,
      "text": "I think we're getting close.",
      "id": "ep_100_ut_351"
    },
    {
      "end": 5520084,
      "speaker": "Moritz Stefaner",
      "start": 5518156,
      "text": "Not the podcast data visualization as a whole.",
      "id": "ep_100_ut_352"
    },
    {
      "end": 5525384,
      "speaker": "Enrico Bertini",
      "start": 5520124,
      "text": "Yeah, I think we're getting closer to the disillusionment. We had a few.",
      "id": "ep_100_ut_353"
    },
    {
      "end": 5527352,
      "speaker": "Moritz Stefaner",
      "start": 5525424,
      "text": "Oh, you think we're still downwards?",
      "id": "ep_100_ut_354"
    },
    {
      "end": 5530656,
      "speaker": "Enrico Bertini",
      "start": 5527408,
      "text": "Yeah, I think we're still, we are getting downwards.",
      "id": "ep_100_ut_355"
    },
    {
      "end": 5536992,
      "speaker": "Moritz Stefaner",
      "start": 5530840,
      "text": "Oh, okay. Yeah, yeah, I saw on the slope of enlightenment already. Damn it.",
      "id": "ep_100_ut_356"
    },
    {
      "end": 5537488,
      "speaker": "Enrico Bertini",
      "start": 5537048,
      "text": "Okay.",
      "id": "ep_100_ut_357"
    },
    {
      "end": 5541324,
      "speaker": "Moritz Stefaner",
      "start": 5537536,
      "text": "That's too bad, man. Well, okay, yeah, yeah, we'll see.",
      "id": "ep_100_ut_358"
    },
    {
      "end": 5544084,
      "speaker": "Enrico Bertini",
      "start": 5541904,
      "text": "But the future can only be brighter.",
      "id": "ep_100_ut_359"
    },
    {
      "end": 5548296,
      "speaker": "Moritz Stefaner",
      "start": 5544984,
      "text": "But we both think we're beyond the peak of inflated expectations.",
      "id": "ep_100_ut_360"
    },
    {
      "end": 5549454,
      "speaker": "Enrico Bertini",
      "start": 5548360,
      "text": "I think so, yeah.",
      "id": "ep_100_ut_361"
    },
    {
      "end": 5551074,
      "speaker": "Moritz Stefaner",
      "start": 5549534,
      "text": "I think that's safe to say.",
      "id": "ep_100_ut_362"
    },
    {
      "end": 5555474,
      "speaker": "Enrico Bertini",
      "start": 5553014,
      "text": "That's what we agree upon. Yeah.",
      "id": "ep_100_ut_363"
    },
    {
      "end": 5563234,
      "speaker": "Moritz Stefaner",
      "start": 5556534,
      "text": "So any other things for the future, like podcast wise or database wise?",
      "id": "ep_100_ut_364"
    },
    {
      "end": 5600718,
      "speaker": "Enrico Bertini",
      "start": 5563974,
      "text": "From the podcast side of things, we will certainly keep doing what we have done in the past. As you might have seen if you followed the podcast for a while, we've been experimenting quite a bit and so I think we enjoy that. And sometimes it works, sometimes it doesn't. But we definitely want to. We don't want to keep the show static from time to time. We have some classic formats, but we also want to try, we want to experiment with new ones. So if you have any ideas, if you want to suggest something, let us know. Right? Yeah, but for sure we will keep experimenting.",
      "id": "ep_100_ut_365"
    },
    {
      "end": 5654326,
      "speaker": "Moritz Stefaner",
      "start": 5600806,
      "text": "Yeah. Also, if you have interesting guests, we always take suggestions, and especially if these are sort of non standard demographics or from interesting parts of the world, you know, or. Yeah, like interesting people. So if you have any, anyone doing interesting stuff, let us know. We're always happy for suggestions. We cannot like actually bring everybody on the show that you suggest. So we do get a lot of them, but we really love to hear hear them. And also in general, if you want to reflect a bit, like what has your journey in data visualization looked like up to now, or has this podcast maybe taught you something interesting? What stood out to you? We would love to hear a bit about your personal data stories, so please let us know via email or in the Slack channel or on Twitter. Always good to hear from from you.",
      "id": "ep_100_ut_366"
    },
    {
      "end": 5701974,
      "speaker": "Enrico Bertini",
      "start": 5654430,
      "text": "Yeah, so I think it's time to wrap it up. Before we do that, we also need to talk about our Patreon initiative. Yeah, we've been talking about it sporadically during our few last shows, but basically what is happening is that. So I think it's worth repeating what we are trying to do here and how it works. But the basic idea is this. So data stories has been supported throughout the years by several sponsors. That's been great, and I think that's another opportunity for us to thank our sponsors. Without them, we should especially thank click.",
      "id": "ep_100_ut_367"
    },
    {
      "end": 5713094,
      "speaker": "Moritz Stefaner",
      "start": 5702014,
      "text": "Who have been supporting us all these years. Like really amazingly. I think it's great stuff, but many other sponsors as well. Yeah, but click has been especially supportive.",
      "id": "ep_100_ut_368"
    },
    {
      "end": 5732470,
      "speaker": "Enrico Bertini",
      "start": 5713214,
      "text": "So as you may know by listening to this episode, there is a lot going on behind the core things. So we have two people working with for us. And so in order to produce a good quality, high quality episode, you need some people to work on it.",
      "id": "ep_100_ut_369"
    },
    {
      "end": 5732646,
      "speaker": "Moritz Stefaner",
      "start": 5732502,
      "text": "Right.",
      "id": "ep_100_ut_370"
    },
    {
      "end": 5803432,
      "speaker": "Enrico Bertini",
      "start": 5732670,
      "text": "This is just not possible to do it without many hours of work. Hours of work. And this translates into needing some money to do it. So, so far, we've been doing it through our sponsors, and we decided that we want to experiment with a new format. The format is having a crowdfunding sponsorship format where the show is sponsored directly by our listeners rather than, say, an industry sponsor or. Or something similar to that. So it's important to clarify that we don't want to do that because we have anything against industry or any of the sponsors that we had in the past. I think it would be much, much nicer to have a show that is sponsored directly by our listeners, and also partially because we can basically reduce the amount that is spent on dealing with sponsorship, and this time can be used to produce our show. Right? Yeah, totally. Moritz, maybe you want to describe how Patreon works more in details.",
      "id": "ep_100_ut_371"
    },
    {
      "end": 5876404,
      "speaker": "Moritz Stefaner",
      "start": 5803568,
      "text": "Sure. So, in a way, it's like a mixture of a subscription and a donation or something like this. In principle, you become a patron for the show, and that means you chip in. And for every episode that we produce, there will be a certain fee that you give us, like $2, $3, $5, and that keeps the show running. And this all works automatically. You just basically log in on the site, you become a Patron for us, and then, yeah, Patreon manages all this process that we get the money from you and so on. It's quite simple and painless. It's kind of nice. There's a little community side around it. We will post a few things just on Patreon, like special announcements, special questions. So, yeah, it's a way for you also to become part of the data Stories club, more or less, which is kind of nice. And also for us, a way to have, like, a certain community and be in touch with, with you guys and run this thing together. I think that's. That's all of our goal. So Enrico and I, we don't make any money with this. It's really just for supporting the show and making it a self sustained.",
      "id": "ep_100_ut_372"
    },
    {
      "end": 5942312,
      "speaker": "Enrico Bertini",
      "start": 5877724,
      "text": "Yeah, you can see that. So if you go on www.patreon.com Datastories, you'll find a lot of additional information on why we want to do that and how it works. I think it's important to mention that we already have 47 patrons, and I want to thank them. Thanks so much for every single one being early adopters. And maybe another source of confusion for some of these people has been that they haven't been charged so far a single dollar. So the reason is because basically, we start charging our patrons only when we reach our goal. Okay. So right now, we are. So our goal is to have $600 per episode plus. And right now, with 47 patterns, we are at 278. So it's. We are almost halfway. So please consider signing up because we are not too far. Right?",
      "id": "ep_100_ut_373"
    },
    {
      "end": 5942872,
      "speaker": "Moritz Stefaner",
      "start": 5942408,
      "text": "Yeah.",
      "id": "ep_100_ut_374"
    },
    {
      "end": 5951204,
      "speaker": "Enrico Bertini",
      "start": 5942968,
      "text": "And as soon as we reach our goal, we will switch to having the show completely supported by you.",
      "id": "ep_100_ut_375"
    },
    {
      "end": 5952764,
      "speaker": "Moritz Stefaner",
      "start": 5952024,
      "text": "Right.",
      "id": "ep_100_ut_376"
    },
    {
      "end": 5957056,
      "speaker": "Enrico Bertini",
      "start": 5954264,
      "text": "What else? Is there anything else we have to say about pitch?",
      "id": "ep_100_ut_377"
    },
    {
      "end": 6002634,
      "speaker": "Moritz Stefaner",
      "start": 5957200,
      "text": "No, but except now is the best time, because either way, it's now and ever. We said we want to do this by June 2017. I think it is June, checking my calendar. So. And in a way, for us is, well, we want to do this, but it only works if enough people, like, join and, you know, do it. And so if you're sort of toying with the idea of, yeah, maybe, maybe not do it now, because, a, we don't. We don't take any money right now. We only do it if we reach the goal. And then you can still decide not to, like to unsubscribe, basically, at any time. And if now not enough people do it, I think we might not do it at all, which would be sad. And so, yeah, now is a good time.",
      "id": "ep_100_ut_378"
    },
    {
      "end": 6065374,
      "speaker": "Enrico Bertini",
      "start": 6003654,
      "text": "No, seriously, if you're listening to this, we are. Now is the time to do it. If you don't do it, and if we don't reach our goal, we just have to revert back to the. To the old model. I just want to say that Patreon gives an amazing service to everyone, and it's very easy to sign up. Everything is super clear. You will see that in our Patreon page on the right hand side, there are several levels of pledging, and for each one, you get different kind of benefits. And, yeah. So I strongly suggest you just to go on the website and see how it looks. Looks like. And, you know, as Moritz said, you can try for a couple of episodes, and if you don't like it, you can just revert back. Right. And I think another thing that I really like of the way Patreon works is that you get charged only for episodes that are published. Right. If we don't publish, you don't get charged. So that's another reason why I really like this model.",
      "id": "ep_100_ut_379"
    },
    {
      "end": 6076440,
      "speaker": "Moritz Stefaner",
      "start": 6066554,
      "text": "Okay, so join the club, and thanks for listening. So far, it's been a very, very long episode. That's also nice, kind of fun.",
      "id": "ep_100_ut_380"
    },
    {
      "end": 6077204,
      "speaker": "Enrico Bertini",
      "start": 6076512,
      "text": "Yeah.",
      "id": "ep_100_ut_381"
    },
    {
      "end": 6081992,
      "speaker": "Moritz Stefaner",
      "start": 6077624,
      "text": "And to another 100, Enrico, right?",
      "id": "ep_100_ut_382"
    },
    {
      "end": 6084896,
      "speaker": "Enrico Bertini",
      "start": 6082088,
      "text": "Yeah. Wow. Thank you. Moritz.",
      "id": "ep_100_ut_383"
    },
    {
      "end": 6088072,
      "speaker": "Moritz Stefaner",
      "start": 6085000,
      "text": "Next big party is the episode 1000. Of course.",
      "id": "ep_100_ut_384"
    },
    {
      "end": 6088800,
      "speaker": "Enrico Bertini",
      "start": 6088168,
      "text": "Yeah.",
      "id": "ep_100_ut_385"
    },
    {
      "end": 6090272,
      "speaker": "Moritz Stefaner",
      "start": 6088952,
      "text": "It's been massive.",
      "id": "ep_100_ut_386"
    },
    {
      "end": 6094404,
      "speaker": "Enrico Bertini",
      "start": 6090328,
      "text": "It's been great to share this with you. We went through so many things.",
      "id": "ep_100_ut_387"
    },
    {
      "end": 6115252,
      "speaker": "Moritz Stefaner",
      "start": 6094864,
      "text": "Absolutely. It's sort of. I mean, we also got to know each other, right? I mean, in a way, we sort of just started it and didn't know each other that well, so. Yeah, it's nice to. To get to know each other through. Through such a shared interest.",
      "id": "ep_100_ut_388"
    },
    {
      "end": 6116104,
      "speaker": "Enrico Bertini",
      "start": 6115388,
      "text": "Yeah.",
      "id": "ep_100_ut_389"
    },
    {
      "end": 6117264,
      "speaker": "Moritz Stefaner",
      "start": 6116444,
      "text": "Yeah.",
      "id": "ep_100_ut_390"
    },
    {
      "end": 6120628,
      "speaker": "Enrico Bertini",
      "start": 6117644,
      "text": "Okay, well, good. Cool.",
      "id": "ep_100_ut_391"
    },
    {
      "end": 6124372,
      "speaker": "Moritz Stefaner",
      "start": 6120676,
      "text": "Thanks so much, and, yeah, next time. Talk to you soon.",
      "id": "ep_100_ut_392"
    },
    {
      "end": 6125372,
      "speaker": "Enrico Bertini",
      "start": 6124468,
      "text": "Bye bye.",
      "id": "ep_100_ut_393"
    },
    {
      "end": 6126380,
      "speaker": "Moritz Stefaner",
      "start": 6125548,
      "text": "See ya. Bye.",
      "id": "ep_100_ut_394"
    }
  ],
  "confidence": 0.921924651147787,
  "audio_duration": 6170,
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_status_code": null,
  "webhook_auth": false,
  "webhook_auth_header_name": null,
  "speed_boost": false,
  "auto_highlights_result": null,
  "auto_highlights": false,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_audio_quality": null,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "content_safety": false,
  "iab_categories": true,
  "content_safety_labels": {
    "status": "unavailable",
    "results": [],
    "summary": {}
  },
  "language_detection": false,
  "language_detection_threshold": null,
  "language_confidence": null,
  "custom_spelling": null,
  "throttled": false,
  "auto_chapters": true,
  "summarization": false,
  "summary_type": null,
  "summary_model": null,
  "custom_topics": false,
  "topics": [],
  "speech_threshold": null,
  "speech_model": "best",
  "chapters": [
    {
      "summary": "This is the 100th episode of the Data Stories podcast. We just passed 10,000 Twitter followers. How did we get to this milestone? I think we just kept going.",
      "gist": "Dada Stories",
      "headline": "This is the 100th episode of Dada stories podcast",
      "start": 240,
      "end": 132182,
      "id": "ep_100_ch_0"
    },
    {
      "summary": "There were 528,387 downloads of all episodes total. 60,000 of those are for a missing file that doesn't exist on our server. 24,000 downloads. Good stuff. Thanks for listening, dear listeners.",
      "gist": "March 24,000 downloads!",
      "headline": "Last month we had 24,000 downloads of our data podcasts",
      "start": 132278,
      "end": 172334,
      "id": "ep_100_ch_1"
    },
    {
      "summary": "Do you know when we published our first episode? First ever. Must have been in the nineties. February 2012. That was Valentine's Day. Lots of things have changed in the past.",
      "gist": "\"The Best Title Ever\"",
      "headline": "Do you know when we published our first episode? First ever",
      "start": 172754,
      "end": 223674,
      "id": "ep_100_ch_2"
    },
    {
      "summary": "So I think one of the first things we want to do today is to go through our top ten episodes. We should mention we have no special guest. Although later on, we bring in two very special guests. It's a little bit of a surprise.",
      "gist": "Top 10 Episodes",
      "headline": "We should mention we have no special guest. Right. It's just the two of us",
      "start": 224184,
      "end": 251004,
      "id": "ep_100_ch_3"
    },
    {
      "summary": "Most popular episodes. Number one was Br. The one on data visualization literacy with Jeremy Boy, Helen Kennedy and Andy Kirk. I'm wondering if that favors more the older ones or the younger ones.",
      "gist": "Top 10 Podcasts in the US",
      "headline": "Most popular episodes favor older ones or younger ones, I'm not sure",
      "start": 252344,
      "end": 342604,
      "id": "ep_100_ch_4"
    },
    {
      "summary": "The second one is ggplot two R and data tool making with Hadley Wickham. Third one, Amanda Cox on working with our NYT projects and her favorite data. If you enjoyed our podcast with Alberto Cairo on Uncertainty and the role of media today, that's a great follow up.",
      "gist": "The Top 3 Data Visualization Artists",
      "headline": "Hadley Wickham talks about ggplot two and data tool making",
      "start": 343504,
      "end": 489654,
      "id": "ep_100_ch_5"
    },
    {
      "summary": "The year review has been a classic for us since many years. I think this could also make a fun, like, binge listening series of episodes. Number five is Bocoup and Openviz conference. I would love to continue showcasing a bit more work from people around the world.",
      "gist": "Year Review with Andy Kirk and Robert Kosara",
      "headline": "The year review has been a classic for us since many years",
      "start": 490314,
      "end": 682578,
      "id": "ep_100_ch_6"
    },
    {
      "summary": "Ben Wellington started a blog about data and data visualization. He takes publicly available data, simple tools, and publishes it. There's no limit to the amount of cool stuff you can do from home. This is getting better and better.",
      "gist": "Open Data: Finding surprising stories in NYC",
      "headline": "Ben Wellington takes publicly available data, simple tools, and publishes stories",
      "start": 682706,
      "end": 802264,
      "id": "ep_100_ch_7"
    },
    {
      "summary": "Number eight, also one of my personal favorites, statistical numbing with Paul Slovic. Really good, challenging recording. I'm surprised that this episode is in the top ten list. After the episode has been published, a few people started talking about this idea much more often.",
      "gist": "Top 10 statistical numbing with Paul Slovic",
      "headline": "Number eight, also one of my personal favorites, statistical numbing with Paul Slovic",
      "start": 804724,
      "end": 946354,
      "id": "ep_100_ch_8"
    },
    {
      "summary": "The 9th most popular episode was about listening to data from space. The 10th was about science communication with Jen Christensen from Scientific American. I'm still thinking about sonification. At some point, I need to do a sonification project.",
      "gist": "The Top 10 Science Episodes",
      "headline": "The 10th most popular episode was about gravitational waves with Scott Hughes",
      "start": 947614,
      "end": 1147074,
      "id": "ep_100_ch_9"
    },
    {
      "summary": "Jeff: The first memorable thing moment I can recall is when for the first time, somebody decided to call us exotic eurovoices. You were kicked out of a room once. There are all sorts of crazy situations and crazy things that can happen. It's been more robust than the past.",
      "gist": "We Were Kicked Out of a Room Once",
      "headline": "Jeff: Let's share some funny stories from the past now",
      "start": 1149274,
      "end": 1484838,
      "id": "ep_100_ch_10"
    },
    {
      "summary": "We had a little feud between Andy and Robert going on for a while. We'd like to improve access to the archive a bit more. If somebody of you is in a mood for data cleaning or helping us structure all this back archive information a bit, that would be amazing.",
      "gist": "Data Stories: A Year in the Life",
      "headline": "We'd like to improve access to the archive a bit more",
      "start": 1484926,
      "end": 1745594,
      "id": "ep_100_ch_11"
    },
    {
      "summary": "Art and design is definitely one of the biggest ones. Second big chunk of episodes is about conferences. Trying to take information coming from academia and make it more available to practitioners. I'm really happy to see this happening on data stories.",
      "gist": "Data Stories: The Story of the Show",
      "headline": "We always try to have interesting practitioners on the show, people doing interesting data",
      "start": 1747254,
      "end": 2106202,
      "id": "ep_100_ch_12"
    },
    {
      "summary": "Journalism had a little bit of a blow with the last elections. We are trying to cover more of what is happening in industry on the show. Knowing what your chances are in the future, which markets and industry are going to be available for you as a professional is important.",
      "gist": "Data Visualization: The Year in Review",
      "headline": "I think journalism had a blow with the last elections",
      "start": 2106298,
      "end": 2283154,
      "id": "ep_100_ch_13"
    },
    {
      "summary": "Another huge topic is learning and teaching. How do you actually learn data visualization? How can you teach knowledge there? There's definitely a huge need. Maybe we should start a data stories, university. Diplomas. We had these ideas for a while, but we're just too scared by the amount of work.",
      "gist": "Data visualization: Learning and Teaching",
      "headline": "Another huge topic is learning and teaching. How do you actually learn data visualization",
      "start": 2284214,
      "end": 2410170,
      "id": "ep_100_ch_14"
    },
    {
      "summary": "We want to make teaching and learning material more available to more people. Social issues and critique and impact has been a big theme of the show. Now we want to take another look behind the curtains. Destry and Florian will tell you what needs to happen to actually get an episode out.",
      "gist": "A little intro to the show",
      "headline": "How to make teaching and learning material more available to more people",
      "start": 2410242,
      "end": 2650614,
      "id": "ep_100_ch_15"
    },
    {
      "summary": "Destry and Florian help us with the production of the show. Destry lives in New York and produces podcasts, Florian lives in Berlin. Both help with the pre production. It's quite a process to get such an episode out.",
      "gist": "The Behind the Scenes of Data Stories",
      "headline": "Destry and Florian help us with the production of the show",
      "start": 2657594,
      "end": 2851358,
      "id": "ep_100_ch_16"
    },
    {
      "summary": "Destry: It starts with a brainstorm rate about who to invite on the show. A lot of conversations that happen in podcasts happen remotely. There's no real software out there that allows you to record multiple people over the Internet in individual tracks that are synchronized.",
      "gist": "How Do You Invite a Guest on Your Podcast?",
      "headline": "Destry: How do you decide on who to interview for a podcast",
      "start": 2851406,
      "end": 3181936,
      "id": "ep_100_ch_17"
    },
    {
      "summary": "Florian: I've learned a lot in audio editing over the past two years. The thing is, every time it's different, so you can't. establish a process on which you can rely all the time. The worst case scenario somehow happens every two weeks.",
      "gist": "How To Edit a Podcast Audio File",
      "headline": "Florian has learned a lot in audio editing over the past two years",
      "start": 3182040,
      "end": 3571338,
      "id": "ep_100_ch_18"
    },
    {
      "summary": "Without these two guys, the show couldn't exist, basically. We have an interesting workflow. Every recording moves from, like, left to right on the board, basically from planned to scheduled, recorded, edited and so on. It's a really complex process.",
      "gist": "How it's Made: The Data Stories Podcast",
      "headline": "Destry: Without Enrico and Florian, this podcast wouldn't exist",
      "start": 3571466,
      "end": 3796934,
      "id": "ep_100_ch_19"
    },
    {
      "summary": "Enrico: What were the main things you found interesting or that you stumbled over? Destry: The Hans Rosling episode, for sure. The year in review around the world. Trying to cover different topics, different styles, different kind of people. Their biggest struggle is to make it varied.",
      "gist": "2016: A Year in the Life of Data Visualization",
      "headline": "Did you learn interesting things about data visualization this year on Dataviz",
      "start": 3799314,
      "end": 4173054,
      "id": "ep_100_ch_20"
    },
    {
      "summary": "Thanks so much. This is, I mean, we know how it works behind the scenes, but I hope our listeners found it interesting, too. If you have any questions on the production, let us know.",
      "gist": "A Taste of PODCAST",
      "headline": "Dastri: I hope our listeners found this interesting",
      "start": 4173134,
      "end": 4301274,
      "id": "ep_100_ch_21"
    },
    {
      "summary": "It's been five years. Can we identify any major trends? Some of them I think we already mentioned. Kind of like a little bit of a reflection of what were the main themes.",
      "gist": "Five Years of the European economy",
      "headline": "We want to briefly cover what has changed during the last five years",
      "start": 4308894,
      "end": 4335852,
      "id": "ep_100_ch_22"
    },
    {
      "summary": "Moritz: I've been doing data visualizations professionally for commissions for 1012 years. In the last five years, I've learned much more about everything that needs to go around such a nice data piece to make it a successful tool. He says he has become more interested in telling stories.",
      "gist": "Five years in the world of data visualization",
      "headline": "Moritz has been doing data visualization professionally for commissions for 1012 years",
      "start": 4335908,
      "end": 4625934,
      "id": "ep_100_ch_23"
    },
    {
      "summary": "Enrico: Data stories has been a huge influence in the way I decided to steer my work and my research. He says visualization is becoming so popular in terms of being used as a presentation or communication tool. Enrico sees data stories as a vehicle to communicate things happening in academia to practitioners and the other way around.",
      "gist": "Data stories: The future of visualization",
      "headline": "Enrico Giannini says data stories have influenced his research",
      "start": 4626354,
      "end": 4987058,
      "id": "ep_100_ch_24"
    },
    {
      "summary": "There are more companies and there are more positions within companies for people who want to do visualization. Another big thing is teaching. I am one of those people who believe that what we do as researchers should actually serve practitioners and students. Podcasting is huge.",
      "gist": "Big Things in Data Visualization",
      "headline": "Another big thing is teaching. I think, as I said before, teaching is huge",
      "start": 4987186,
      "end": 5379394,
      "id": "ep_100_ch_25"
    },
    {
      "summary": "But data skeptic is a very nice blend of telling some stories, but also giving a little bit of technical information. The best way to start the podcast, just do it. Grab a mic and start talking.",
      "gist": "Data Skeptic: The Best Podcast",
      "headline": "Data skeptic is a very nice blend of storytelling and technical information",
      "start": 5380014,
      "end": 5460618,
      "id": "ep_100_ch_26"
    },
    {
      "summary": "Where is data visualization? In the gardener hype cycle. We both think we're beyond the peak of inflated expectations. But the future can only be brighter.",
      "gist": "Data visualization: The Gardener Hype Cycle",
      "headline": "Where do you think data visualization is headed in the future",
      "start": 5460806,
      "end": 5555474,
      "id": "ep_100_ch_27"
    },
    {
      "summary": "We will certainly keep doing what we have done in the past. If you have interesting guests, we always take suggestions. We have some classic formats, but we also want to try, we want to experiment with new ones. We would love to hear a bit about your personal data stories.",
      "gist": "Future of Data Visualization Podcast",
      "headline": "From the podcast side of things, we will certainly keep experimenting",
      "start": 5556534,
      "end": 5654326,
      "id": "ep_100_ch_28"
    },
    {
      "summary": "We also need to talk about our Patreon initiative. The format is having a crowdfunding sponsorship format where the show is sponsored directly by our listeners. Without them, we should especially thank click. Who have been supporting us all these years.",
      "gist": "A message about our Patreon initiative",
      "headline": "Data stories has been supported throughout the years by several sponsors",
      "start": 5654430,
      "end": 5799008,
      "id": "ep_100_ch_29"
    },
    {
      "summary": "Moritz: In principle, you become a patron for the show, and that means you chip in. For every episode that we produce, there will be a certain fee that you give us. It's really just for supporting the show and making it a self sustained.",
      "gist": "Data Stories",
      "headline": "Patreon allows you to become a patron for the show",
      "start": 5799176,
      "end": 5891396,
      "id": "ep_100_ch_30"
    },
    {
      "summary": "Enrico: We already have 47 patrons, and I want to thank them. As soon as we reach our goal, we will switch to having the show completely supported by you. Now is the time to sign up. If not, we might not do it at all.",
      "gist": "Patreon",
      "headline": "Enrico: Patreon only works if enough people join",
      "start": 5891540,
      "end": 6126380,
      "id": "ep_100_ch_31"
    }
  ],
  "disfluencies": false,
  "entity_detection": false,
  "sentiment_analysis": false,
  "sentiment_analysis_results": null,
  "entities": null,
  "speakers_expected": null,
  "summary": null,
  "custom_topics_results": null,
  "episode_num": 100,
  "episode_metadata": {
    "speakers": [
      "Enrico Bertini",
      "Moritz Stefaner",
      "Destry Sibley",
      "Florian Woehrl"
    ],
    "WPid": "966",
    "url": "https://datastori.es/podlove/file/4077/s/feed/c/mp3/100-data-stories-100.mp3",
    "episode_title": "Data Stories 100!!!"
  }
}