{
  "id": "a8e30ab4-8793-4e01-89dc-90e02cb3655c",
  "language_model": "assemblyai_default",
  "acoustic_model": "assemblyai_default",
  "language_code": "en_us",
  "status": "completed",
  "audio_url": "https://datastori.es/podlove/file/4565/s/feed/c/mp3/109-feminist-data-visualization-with-catherine-dignazio.mp3",
  "utterances": [
    {
      "end": 4954,
      "speaker": "Catherine D’Ignazio",
      "start": 200,
      "text": "Even when you think that you're communicating neutrality, you're actually communicating all of these other things.",
      "id": "ep_109_ut_0"
    },
    {
      "end": 31688,
      "speaker": "Moritz Stefaner",
      "start": 24134,
      "text": "Hi, everyone. Welcome to a new episode of Data stories. My name is Moritz Stefaner. I'm an independent designer of data visualizations.",
      "id": "ep_109_ut_1"
    },
    {
      "end": 38204,
      "speaker": "Enrico Bertini",
      "start": 31846,
      "text": "I am Enrico Bertini, a professor at NYU in New York City, and I do research in data visualization.",
      "id": "ep_109_ut_2"
    },
    {
      "end": 46204,
      "speaker": "Moritz Stefaner",
      "start": 38364,
      "text": "Exactly. And together here on this podcast, we talk about data visualization, data analysis, and generally which role data plays in our lives.",
      "id": "ep_109_ut_3"
    },
    {
      "end": 60644,
      "speaker": "Enrico Bertini",
      "start": 46324,
      "text": "Yeah. And usually we do that together with a guest that we invite on the show. But before announcing the special guest for today, we have an important update. We are finally switching to crowdfunding.",
      "id": "ep_109_ut_4"
    },
    {
      "end": 80820,
      "speaker": "Moritz Stefaner",
      "start": 60804,
      "text": "Yay. That's awesome. It took us a while. We started asking for your pledges beginning of the year already, I think, right? Or when did we start, Enrico? Yeah. And now we finally reached over $400 per episode in contributions from you all. That's fantastic. We have 83 patrons backing the show.",
      "id": "ep_109_ut_5"
    },
    {
      "end": 81664,
      "speaker": "Enrico Bertini",
      "start": 80932,
      "text": "Yes.",
      "id": "ep_109_ut_6"
    },
    {
      "end": 125304,
      "speaker": "Moritz Stefaner",
      "start": 82044,
      "text": "And it's enough to finance the show now. So we will start to switch over. We should say a big thanks to our sponsors so far. I mean, thinking back, you know, especially click has supported us many years. Tableau. And I think if they hadn't, like, supported us this way, I'm not sure if the podcast had actually been around still, because only the sponsorship really enabled us to get support from Destry, who helps us with the production of the show, from Florian, who does all the audio editing, which is also quite a big part of the invisible work going into this podcast. And honestly, I'm not sure if we would have been able to keep going this long. So thanks so much for our sponsor so far.",
      "id": "ep_109_ut_7"
    },
    {
      "end": 132352,
      "speaker": "Enrico Bertini",
      "start": 125424,
      "text": "Yeah, yeah. Really. Thanks so much. And we are really curious to see what is going to happen. Yeah.",
      "id": "ep_109_ut_8"
    },
    {
      "end": 137404,
      "speaker": "Moritz Stefaner",
      "start": 132368,
      "text": "And how that maybe changes the dynamic, or maybe it doesn't change anything at all. We don't know either.",
      "id": "ep_109_ut_9"
    },
    {
      "end": 165878,
      "speaker": "Enrico Bertini",
      "start": 138024,
      "text": "Yeah. And of course, we are thinking about some special perks for our patrons. We don't want to disclose anything, but you'll see there will be some things happening. We have a few ideas and. Yeah, and also we're trying, we will probably try to set up something for people who want to do just one time donations. So stay tuned for that. And. Yeah, I think that's all to say for now, right?",
      "id": "ep_109_ut_10"
    },
    {
      "end": 218304,
      "speaker": "Moritz Stefaner",
      "start": 165966,
      "text": "Yeah. Maybe we can briefly explain how it works so you can sign up on patreon.com Datastories. So we have a page there. Patreon is a service that manages all this subscription and, you know, crowdfunding of projects like this. And you can say you like data stories so much. You pay like $2 per episode, maybe $3, maybe $5. And then we basically, once we publish an episode, we can press a button and collect that money from all the contributors. And you can join or leave at any time. It's a totally voluntary thing and do keep the contributions coming. I mean, we should mention our original goal was a bit higher, so we will still need your ongoing support. But we are super grateful for anybody who has pledged already. And if you have not, maybe think about it. Could be good.",
      "id": "ep_109_ut_11"
    },
    {
      "end": 224584,
      "speaker": "Enrico Bertini",
      "start": 218764,
      "text": "Yeah, it's like just, what? Like price for a. For a coffee or cappuccino every two weeks.",
      "id": "ep_109_ut_12"
    },
    {
      "end": 227504,
      "speaker": "Moritz Stefaner",
      "start": 224924,
      "text": "It's such a good podcast, honestly. I mean.",
      "id": "ep_109_ut_13"
    },
    {
      "end": 231884,
      "speaker": "Enrico Bertini",
      "start": 230684,
      "text": "We are brewing stuff.",
      "id": "ep_109_ut_14"
    },
    {
      "end": 244574,
      "speaker": "Moritz Stefaner",
      "start": 231924,
      "text": "We'll see how this goes. We're also figuring out ourselves. We haven't done this before, so also, if you have any, like, questions about the process or any complaints or whatnot, just let us know. We're in this together now, especially.",
      "id": "ep_109_ut_15"
    },
    {
      "end": 247654,
      "speaker": "Enrico Bertini",
      "start": 246714,
      "text": "Literally.",
      "id": "ep_109_ut_16"
    },
    {
      "end": 257202,
      "speaker": "Moritz Stefaner",
      "start": 248514,
      "text": "Exactly. Anyways, that's great. So that's very exciting. I think it's a new chapter and. Yeah, we'll see how it goes.",
      "id": "ep_109_ut_17"
    },
    {
      "end": 257738,
      "speaker": "Enrico Bertini",
      "start": 257298,
      "text": "Yeah.",
      "id": "ep_109_ut_18"
    },
    {
      "end": 268218,
      "speaker": "Moritz Stefaner",
      "start": 257826,
      "text": "Moving on. Enough about us today we have a special guest again, as usual, and her name is Catherine D'Ignazio. Great to have you on. Hi, Catherine.",
      "id": "ep_109_ut_19"
    },
    {
      "end": 269174,
      "speaker": "Enrico Bertini",
      "start": 268266,
      "text": "Hey, Catherine.",
      "id": "ep_109_ut_20"
    },
    {
      "end": 272194,
      "speaker": "Catherine D’Ignazio",
      "start": 269314,
      "text": "Hi. Great to be here. I'm so excited.",
      "id": "ep_109_ut_21"
    },
    {
      "end": 274062,
      "speaker": "Enrico Bertini",
      "start": 273054,
      "text": "Welcome on the show.",
      "id": "ep_109_ut_22"
    },
    {
      "end": 287118,
      "speaker": "Moritz Stefaner",
      "start": 274118,
      "text": "Good to talk to you. Yeah, it's fantastic. We wanted to have you on for a long time, and we're happy it finally worked out. And you're an assistant professor for data visualization and civic media. Great combination at Emerson College.",
      "id": "ep_109_ut_23"
    },
    {
      "end": 288270,
      "speaker": "Catherine D’Ignazio",
      "start": 287246,
      "text": "That's right, yep.",
      "id": "ep_109_ut_24"
    },
    {
      "end": 297082,
      "speaker": "Moritz Stefaner",
      "start": 288342,
      "text": "And can you tell us a bit about what you're interested in and maybe what your background is, how you ended up doing what you do now and so on?",
      "id": "ep_109_ut_25"
    },
    {
      "end": 300574,
      "speaker": "Catherine D’Ignazio",
      "start": 297178,
      "text": "Sure. Well, how far back do you want me to go?",
      "id": "ep_109_ut_26"
    },
    {
      "end": 304014,
      "speaker": "Enrico Bertini",
      "start": 301994,
      "text": "As much as you wish.",
      "id": "ep_109_ut_27"
    },
    {
      "end": 559964,
      "speaker": "Catherine D’Ignazio",
      "start": 306754,
      "text": "So, let's see. Well, so currently, as you said, I'm an assistant professor of data visualization and civic media. And those are two kind of weird things to be a professor of because they're both sort of new. And so these are kind of these titles where you say that to your family and they're like, I have no idea what you're talking about on both, but I guess the way that I ended up here makes the position make sense. So I. In undergrad? Well, no, I should. Okay, so I'm gonna start really far back, but I promise this will be short. So I grew up around computers and computer programming and robots because my dad was a science fiction writer and also worked in educational technology. And he was a really big early proponent of using computers in the classroom with kids. Okay, very cool. I was super nerdy, but not knowing that I was a nerd because it was just, like, very normal for me. I went to computer camp when I was in elementary school. And this is back before. This is back when computer camp was really weird. Like, nobody went to computer camp, but I grew up programming computers, basically. And so then when I went to college, I studied liberal arts. I did not study anything. Like, I didn't study computer science or anything like that because I was like, oh, I know how to do that stuff. Which of course I didn't, but I thought I did. But then when I was graduating from. So my major was international relations, which was basically just the major I took. So I could take the most variety of classes from all the different disciplines. But whereas my friends in undergrad all went on to be, like, investment bankers and lawyers and things like this, this was the height when I graduated, the height of the.com, the first dot boom. And so this was this kind of crazy job market where, like, if you knew the least bit of computer skills, you could get hired as, like, any kind of programmer. They're like, whatever. Just like, come, like, fill our, like, staff, our things or whatever. So I got hired as a programmer, like, straight out of undergrad and proceeded to work for, I don't know, five or six years in different kinds of, like, a startup environment. I worked at a research, as a technical project manager for a research project and oversaw developers and things like this. And then I kind of, this is where I ended up going into the arts because I was like, well, what else can you do, though, with, you know, I don't want to just build, like, enterprise project management software for Raytheon. There's got to be other options out there. And so this is where I ended up going to art and design school. So I went and got an MFA and was trying through that to combine my interests in sort of art and technology and creative expression and then with programming and things, and then, like, I guess I'll sort of fast forward. And then I spent basically, like, ten years trying to do all those things at the same time. So I was like, a freelance software programmer, an independent artist, and an adjunct professor, and I taught at places like RISD and the museum school here in Boston. And then I had kids, and then I was like, oh, my God, I have three careers. I have to not have three careers. This is totally not working, like, three freelance careers and children just, that's a disaster. And so that's where I ended up going back to school for civic media at the MIT media lab. And so that seemed to be this place where you could combine all of these things. So for me, it's like the intersection of technology, art, and design, and then also, like, social justice or sort of a kind of civic engagement and investment in, like, how do we use technology and creative expression for the public good and think about all the complexities of who's public good and what public good, and what are we talking about when we say those things? And so that's kind of how I ended up here. And so now I'm teaching data visualization. When they were hiring for this position, I looked back at a lot of my projects, and I said, oh, actually, that's data visualization. That's data. I was like, oh, yeah, I do do data visualization. This makes a lot of sense.",
      "id": "ep_109_ut_28"
    },
    {
      "end": 567644,
      "speaker": "Moritz Stefaner",
      "start": 561584,
      "text": "It's great. It's one of these biographies that totally make sense. Looking back but forward looking, only looking back.",
      "id": "ep_109_ut_29"
    },
    {
      "end": 578136,
      "speaker": "Catherine D’Ignazio",
      "start": 568184,
      "text": "It's a total disaster. And if you asked me 15 years ago what I was going to be doing, I would have said probably something completely different. Yeah, exactly.",
      "id": "ep_109_ut_30"
    },
    {
      "end": 667994,
      "speaker": "Moritz Stefaner",
      "start": 578200,
      "text": "That's great. Great that, I mean, that, you know, you're an academic and you're teaching and so on. You're writing papers and books, but you also do have some, some life and some practical experience and can bring that to the table there. And I think that's, that's great. And so on your website, it says your main topics are data literacy, feminist tech, and civic art. And, yeah, it sounds so broad, but in a way, I think for you, it all comes together in this theme of feminist data visualization. I think that's also the main topic we wanted to discuss with you because it's. I first came across your blog post. What would feminist data visualization look like? I think it was published two, three years ago. I think it sort of made the rounds. It was like a very short article, but sort of a provocative idea. And also, when I read the title, I was a bit irritated in sense, like, well, what does feminism please have to do with data visualization? Right? I think this is the response. A lot of people who maybe are not so well versed in feminism and or data visualization, that's my thing. And I think many people have this first reacts like, well, do we need to bring everything in this, you know, or see it under the feminist like perspective? But then when you read the article, it totally makes sense. And I think we should talk a bit about, like, what you write there and how your position has further developed. You published a publication around the topic, and I know you're working on a book as well, so.",
      "id": "ep_109_ut_31"
    },
    {
      "end": 668706,
      "speaker": "Catherine D’Ignazio",
      "start": 668074,
      "text": "That's right.",
      "id": "ep_109_ut_32"
    },
    {
      "end": 671014,
      "speaker": "Moritz Stefaner",
      "start": 668770,
      "text": "You invested some thought into these topics.",
      "id": "ep_109_ut_33"
    },
    {
      "end": 672244,
      "speaker": "Catherine D’Ignazio",
      "start": 671564,
      "text": "Yeah.",
      "id": "ep_109_ut_34"
    },
    {
      "end": 681544,
      "speaker": "Moritz Stefaner",
      "start": 672364,
      "text": "Yeah. Maybe coming back to the question, like, what do you think? What would a feminist perspective on data visualization look like? What's your perspective there?",
      "id": "ep_109_ut_35"
    },
    {
      "end": 733584,
      "speaker": "Catherine D’Ignazio",
      "start": 682084,
      "text": "Sure. Yeah. I mean, it might be helpful just as kind of a primer for folks to think about, because I've gotten this question a lot when I've done talks, and particularly for different audiences, depending on whatever you think of feminism and whatever you think that means. So maybe just, like, some clarity around what is feminism? And so there's, like, kind of two things. So one is that feminism is sort of just purely a belief. So feminism is the belief in the social, political, and economic equality of the sexes. So that's a dictionary definition, and that's also Beyonce's definition of feminism. She literally has a statement where she has said that. So that makes it real. But then, so there's, like, the belief in equality, which I think, like most people.",
      "id": "ep_109_ut_36"
    },
    {
      "end": 735820,
      "speaker": "Moritz Stefaner",
      "start": 734524,
      "text": "How could you not before that?",
      "id": "ep_109_ut_37"
    },
    {
      "end": 737700,
      "speaker": "Catherine D’Ignazio",
      "start": 735852,
      "text": "I mean, exactly.",
      "id": "ep_109_ut_38"
    },
    {
      "end": 739584,
      "speaker": "Moritz Stefaner",
      "start": 737772,
      "text": "If you think it's true, like, hello.",
      "id": "ep_109_ut_39"
    },
    {
      "end": 850764,
      "speaker": "Catherine D’Ignazio",
      "start": 740004,
      "text": "It's fairly uncontroversial, I would say, in some. Most circles. But then. And then there's also feminist thinking and scholarship. And so that's. And so we're trying to bring that work. So there's this very long history of feminist intellectual thought and feminist scholarship in a wide variety of fields. And what that looks at is taking this belief as a starting point. How do we look at the current world and see places where it falls short and also see ways where we can basically make it better? And a lot of feminist thinking is not only about gender. And I just want to say this real explicitly, because this also becomes a confusion point sometimes for people. Like, when I start showing examples of things that are not just women specifically, only about gender. Like, it does take gender as a starting point, I would say, but it takes gender as a starting point for looking across various aspects of the world and looking at power differentials. So power imbalances, basically. Like, who has power and who doesn't have power. And often those are. It's like social power. So we could be talking about gender, but we could also be talking about race, or we could be talking about ability or sexuality or gender identity, or, you know, a whole sort of different things. But it's meaning more, like, in tune to these considerations of power and how various identity factors sort of flow into that and out of that. So I just want to clarify that because it's been interesting to give these talks in different situations and have people be like, well, like what? I don't get it. Like, what is feminism and what is this? So that's like, that's the basic starting point.",
      "id": "ep_109_ut_40"
    },
    {
      "end": 869866,
      "speaker": "Moritz Stefaner",
      "start": 850804,
      "text": "No, but that's a super crucial point. And this is one I realized when I read your writings. Like, yeah, it's about much more. And we can take a lot of inspiration from what these feminists who have while working on, sure, gender and equality issues, but it transfers also, and I think this is the interesting point. Really.",
      "id": "ep_109_ut_41"
    },
    {
      "end": 1077834,
      "speaker": "Catherine D’Ignazio",
      "start": 869930,
      "text": "Yeah, exactly. And this is why also it applies to things broader than just say, if you're looking at something where you're looking at gender data or something like that. So it applies more like across the board. So when we're talking about data visualization and feminist thought, then that's where that original blog post was basically trying to really just being provocative, not deliberately trying to provoke people, but more just saying, putting it out on the table and saying, well, what would this look like? And for me, there's two main things. It's really looking at where is power located data visualization. And one of the things that we've realized actually in the process of writing this book is that there's power not just in the, you know, the data visualization is like a product of a particular process, but one of the things the book has started to do is take on all the different aspects of the process as well. From the beginning point where you're like framing the research question that you're going to somehow use data to answer or interrogate or something like that. But specifically in visualization, like, I think there's like a couple main things to kind of think about. So a lot of times visualizations have a what Donna Haraway, the feminist theorist, very well known, wrote, writing from the 1980s onward, what Donna Haraway would call a view from nowhere. And so that's in terms of just very specifically speaking about, like the kind of default view of visualizations is that they are a view from a disembodied perspective and this is part of their power. So I want to make that really clear. One of the reasons we love data visualizations is because they are like the view from above. It's kind of like when you're flying in the plane and you see the landscape below and you're like, I can see it all right. It's amazing. And so that's why they're dazzling in the same way maps. Maps are like this as well, right? Where it's like, oh, I see the whole thing right now. And so there's something very seductive about that. And I think we need to acknowledge the seductiveness of it. And that also can be something that you work with and intentionally sort of manipulate as material, but then also thinking about how it sort of removed the perspective from a body and really kind of positioned it as, like a God's eye view of the world. And so that's where, like, a strong claim of feminist thought would be around situated knowledge. This idea that knowledge is situated, I think it's Johanna Drucker says, knowledge is partial, knowledge is situated, and knowledge is historical. And so what that means is knowledge comes from human bodies. It's partial in the sense that no one of us ever truly has that God's eye view, even though we love to imagine that we could through our dashboards and all of our things. And so, in some sense, and this is sort of like where Mushon Zer-Aviv work goes as well, in some sense, like, data visualizations sort of lie a little bit, like this premise that we are seeing the whole picture. Like, what they seem to communicate is clarity, insight. You're seeing the whole picture when, in fact, there's a little bit of a sleight of hand going on. Because, of course, that the truth that they present is partial.",
      "id": "ep_109_ut_42"
    },
    {
      "end": 1087614,
      "speaker": "Moritz Stefaner",
      "start": 1078174,
      "text": "And there's just like, an objective mechanism that is detached from human judgment, really. It's like science y stuff, right?",
      "id": "ep_109_ut_43"
    },
    {
      "end": 1208966,
      "speaker": "Catherine D’Ignazio",
      "start": 1087774,
      "text": "Exactly, exactly. And it goes along with that thing of, like, oh, the data speak for themselves. Like, oh, look, this is objective, this is neutral. And so a lot of, like, I would say what feminist did at visualization would try to do would be to untangle that and show the ways that it's not neutral. But then also think about, like, what, what strategies might we use in the visualization itself to also communicate that as well? And so I think there's various strategies one could use and design strategies that you can make use of, and we start to try to outline some of those. But then, on the other hand, so there's that. So there's a kind of, what I would call the kind of perspective from the epistemology of data visualization. There's an epistemological critique. There's. But then, on the other side of it, feminist thought also pays close attention to how things get made and to labor. So there's a whole history of feminist scholarship looking at how, for many years, work done in the home like care, work and reproductive labor. It's all very sort of undervalued. It's invisible. It doesn't rise to the surface. It's not remunerated. And so in this sense, too, we felt obligated to look kind of at the whole process of the data visualization and then also to look at literally just like, who are the people producing the data visualizations as well. And so this is then like the perspective you get to of, like, who's included, who's making data visualizations, who's framing the research questions, who's designing the things. And so I think there's also these kind of issues of diversity and inclusion and equity in just the nuts and bolts of actually making the things as well. And so that's a whole place where there's whole populations missing from that world. So, yeah, I don't know if that really answers the question.",
      "id": "ep_109_ut_44"
    },
    {
      "end": 1210230,
      "speaker": "Moritz Stefaner",
      "start": 1209070,
      "text": "No, totally.",
      "id": "ep_109_ut_45"
    },
    {
      "end": 1212514,
      "speaker": "Catherine D’Ignazio",
      "start": 1210422,
      "text": "Those are like some starting points, I guess.",
      "id": "ep_109_ut_46"
    },
    {
      "end": 1274318,
      "speaker": "Moritz Stefaner",
      "start": 1213294,
      "text": "Yeah, I think it's two really interesting and quite profound points. I think what's so interesting is you can end up at these conclusions through different paths as well. Like, for instance, like just last week we talked about Georgia Lupi's capstone at IEEE vis, and she, like the last year or so coined that term. Or the notion of data humanism. And I think that goes in a very similar direction in a sense that she talks about, like the. Yeah, like not making that mistake of thinking just because something is quantified, it's like objective or has no real haptics to it anymore. And she tries to bring back also this like, notion of an explicit author and carer and so on. I think that's sort of interesting. Like that you can end up at what seems to be in the air right now and you can sort of characterize the same phenomenon from many different angles. But I hadn't heard this feminist framing before, and I think that's super interesting.",
      "id": "ep_109_ut_47"
    },
    {
      "end": 1309884,
      "speaker": "Catherine D’Ignazio",
      "start": 1274446,
      "text": "Yeah, yeah, I think the stuff around data humanism, I think it's very sort of in parallel. And I've also been following that and I think it's great because I think, again, pushing back on some of the, I think there's some, like, received wisdom in these various fields that we call data visualization. So, you know, like one of the things being, you know, like, so we have the grandfather of Edward Tufte who's saying things like Data Inc. Ratio and, you know, makes a case for very, very minimalist type of charts and, you know, charts that.",
      "id": "ep_109_ut_48"
    },
    {
      "end": 1316374,
      "speaker": "Moritz Stefaner",
      "start": 1310004,
      "text": "What do you say? He has like a patriarchic approach he's like, he's a bit of patriot, totally.",
      "id": "ep_109_ut_49"
    },
    {
      "end": 1456796,
      "speaker": "Catherine D’Ignazio",
      "start": 1316874,
      "text": "I would say, patriarchal modernist positivist, which is not to, like, detract from the beautiful books. And I think the really amazing history that he has sort of written of data visualization. I mean, kind of made this thing happen in, like, the eighties, you know, where it wasn't happening. But at the same time, it's a very sort of, like, modernist viewpoint. It's also like this viewpoint of missing the fact that data visualizations are communication objects. And so in the same way that, like, a photograph isn't neutral, and we now understand that, like, especially with the age of Photoshop and where everybody's taking so many pictures and everybody has access to doing filters on Instagram and things like this, I think there's widespread literacy about how photos are not neutral. They're not these one to one representations of the world. That's just, it's just not how they function. There's framing. There's a kind of communicative act that goes into the shooting of the photo, the framing of the photo, the processing of the photo, the deploying of the photo out into the world. That's something that I think we're just starting to talk about in data visualization, how it's a, it is a rhetorical act, no matter how neutral or scientific you might think that it is, it is a communicative act. And so, like, even when you think it's, like, the most neutral, I mean, I think my co author of the book, Lauren Klein, and I would claim that it's actually the least objective because what it's communicating is neutrality. And that has so much power, you know, so you cannot avoid communicating. And so, like, even when you think that you're communicating neutrality, you're actually communicating all of these other things. So, yeah, so I think so. So, yeah, I would say, like, we're moving out of a modernist phase of data visualization. And it's, but it's getting very interesting. And I think that that's what's kind of exciting. And then even some of the research from the more scientific side, from the information visualization community specifically, is upholding some of these things as well. So I'm thinking of the research of Michelle Borkin and folks like this who are showing that, well, actually, when visualizations are novel, people remember them more. And actually when, and they are cultural.",
      "id": "ep_109_ut_50"
    },
    {
      "end": 1462024,
      "speaker": "Moritz Stefaner",
      "start": 1456860,
      "text": "Artifacts, I think there's something that is just dawning on people right now.",
      "id": "ep_109_ut_51"
    },
    {
      "end": 1479814,
      "speaker": "Catherine D’Ignazio",
      "start": 1462484,
      "text": "Exactly. Exactly. They're like all these other forms of communication, which means they're both subject to the biases of those things, but then they also have many other expressive possibilities that might be opened up once we consider them as objects of communication and culture.",
      "id": "ep_109_ut_52"
    },
    {
      "end": 1558064,
      "speaker": "Enrico Bertini",
      "start": 1480114,
      "text": "Yeah. So I think that's very interesting because listening to you and reading to reading about your work, for me it's been a little bit like rediscovering some of the steps that have been going through myself and kind of like suffering through some of these steps. Because of course I come, I come from the academic world, right? And I've been reading lots of scientific stuff and I like to think that there is one proper way of doing things and there is a bad way of doing things, right. And also that one of the major goals of visualization is to communicate information as objectively as possible, right? So now that's what I believe for a very long time. Then I went through some experiences that challenged some of this view and now I'm confused, right. So I'm not sure anymore what I'm really sold. Because on the one hand, so I've been doing research myself that shows that, as you said, right? So visualization is just very strong persuasion tool mechanism. You can basically throw to some extent bullshit at people and they would just believe it because there is a chart there, right?",
      "id": "ep_109_ut_53"
    },
    {
      "end": 1558448,
      "speaker": "Catherine D’Ignazio",
      "start": 1558104,
      "text": "Totally.",
      "id": "ep_109_ut_54"
    },
    {
      "end": 1580722,
      "speaker": "Enrico Bertini",
      "start": 1558496,
      "text": "So part of me is completely sold. Not even just sold. I think I've experienced myself that this problem exists. That's a really important issue, right. On the other hand, part of me is like, wait a minute, some things are better than others, right? So some things are truer than others, right?",
      "id": "ep_109_ut_55"
    },
    {
      "end": 1584922,
      "speaker": "Moritz Stefaner",
      "start": 1580818,
      "text": "And not everything's relative or not everything is relative.",
      "id": "ep_109_ut_56"
    },
    {
      "end": 1591094,
      "speaker": "Catherine D’Ignazio",
      "start": 1585098,
      "text": "Not everything. I'm totally on board with that. I do not want to live in the post truth society.",
      "id": "ep_109_ut_57"
    },
    {
      "end": 1605034,
      "speaker": "Enrico Bertini",
      "start": 1593074,
      "text": "It looks to me you seem to have the right knowledge to explain to people like me, how do we draw the line there? It's really hard. I've been trying myself and I'm struggling. Right?",
      "id": "ep_109_ut_58"
    },
    {
      "end": 1606038,
      "speaker": "Catherine D’Ignazio",
      "start": 1605534,
      "text": "Sure.",
      "id": "ep_109_ut_59"
    },
    {
      "end": 1612030,
      "speaker": "Enrico Bertini",
      "start": 1606126,
      "text": "I don't know. Do you have any ideas on how to deal with this problem? Maybe it's a false dichotomy, I don't know.",
      "id": "ep_109_ut_60"
    },
    {
      "end": 1811784,
      "speaker": "Catherine D’Ignazio",
      "start": 1612182,
      "text": "No, I totally get it. And I think it's an easy position to slip into. It's like, oh, okay, well, if everything is persuasive, then you go into total relativism and some of the feminist theory and some of the deconstructionist theory from postmodernism type of era goes there. And that is not, I think that's actually super unhelpful. And it leaves us in a position of never being able to do anything except maybe write down music. And, I mean, this is actually kind of the project. This is kind of like why I think Lauren and I wanted to try to connect feminist theory to data visualization, something that is like a practice, and also, in particular, to data visualization that aspires to do good in the world. So, like, the public data visualizations, like in data journalism or the arts or in the nonprofit sector or libraries, is precisely like, people need to move forward. And so I think a lot of the ending point of theory is just like, oh, you made these theories, and you've deconstructed everything, and you've left us with nothing in return. And those are not usually helpful starting points for moving forward. So I think everything is relative, is not the. I mean, it's also not like where the feminist theorists that we're drawing on, at least like Donna Haraway and Sandra Harding and folks like this would say that this does not mean that there's no truth, you know? And actually, in Donna Haraway's essay, where she coins this term, the God trick, where she's talking about that, like, view from nowhere, in that same essay, she's talking about something she calls feminist objectivity, which is this idea that we are limited and we are, by just necessity, limit. We are partial humans. Like, I will never be a man. I will never be a different race. I will never be born in Bangalore versus Boston. I have these things that are part of my history and my identity that I've experienced that I cannot change. And they shape how I view the world. They shape the kinds of questions that I ask, and it's always going to be that way. But at the same time, this doesn't preclude us from being as objective as possible and knowing that we have those kinds of biases, but then also combining that with other situated perspectives. And this is why there's also a real emphasis in feminist theory on collaboration as well, and collaboration and plurality. And so that's one of the things we actually put in our paper. I think that's. What is it? I think we said embracing pluralism is a design principle. And so that would come out of this idea that though we are limited and partial in our knowledge, by pairing with others and learning what they learn and having them point out to us some of our blind spots, this is how we can move forward. I would never say that all knowledge is relative. I think all of these fields are these set of emerging practices, and we argue over them, and ultimately, hopefully, we get somewhere that are good and practical. Places, or we have people who come in and point out our own blind spots.",
      "id": "ep_109_ut_61"
    },
    {
      "end": 1828252,
      "speaker": "Moritz Stefaner",
      "start": 1812244,
      "text": "No, but that's a great point. Like by disclosing your, and embracing your own biases, they're like, yeah, that's who I am as a person. And, you know, this is where I'm arguing from, but then still present a strong argument and have an opinion and being able to present evidence, but.",
      "id": "ep_109_ut_62"
    },
    {
      "end": 1828924,
      "speaker": "Catherine D’Ignazio",
      "start": 1828348,
      "text": "Exactly.",
      "id": "ep_109_ut_63"
    },
    {
      "end": 1839424,
      "speaker": "Moritz Stefaner",
      "start": 1829004,
      "text": "You know, you are a person who has biases and. And you disclose it to others as well, and then it becomes fair and you can still make a strong statement, maybe.",
      "id": "ep_109_ut_64"
    },
    {
      "end": 1896274,
      "speaker": "Catherine D’Ignazio",
      "start": 1839784,
      "text": "Exactly. And that's actually why I think feminist thought is quite aligned with these trends in data visualization and even in science, around reproducibility of research and knowledge. And so this is a practice that's also happening in data journalism, where a lot of times when folks are doing a more complicated data analysis piece, they'll write the story, they'll show the charts, but then they will also have the post or the story that's about how they did it. And they'll say, I actually do this with my students. I make them do this as well, where they disclose. Here's where I downloaded the data. Here's how I transformed it. Here's what I did with it. Here's the claim that I made with it as a way of, because I do think transparency and sort of self reflexivity, sort of disclosing oneself and disclosing one's own position can go a long way forward again towards with that idea of, like, furthering the conversation. So then somebody can come along and be like, oh, you made a mistake.",
      "id": "ep_109_ut_65"
    },
    {
      "end": 1917836,
      "speaker": "Moritz Stefaner",
      "start": 1898014,
      "text": "But that's okay, too. Like, also, we need to get rid of this. Also, when I started, there was often much more, I think, still, and it's still around this idea that all the projects are awesome, and everybody who does an awesome project is a hero. And, you know, and you just want to hear the story of how the hero made this awesome project, you know.",
      "id": "ep_109_ut_66"
    },
    {
      "end": 1920148,
      "speaker": "Catherine D’Ignazio",
      "start": 1917860,
      "text": "And totally, if we give up this.",
      "id": "ep_109_ut_67"
    },
    {
      "end": 1936058,
      "speaker": "Moritz Stefaner",
      "start": 1920196,
      "text": "As the, like, the driving maxim and more talk about failure and imperfections, you know, then it can become much more, much richer and much more truthful in the end than if we always strive towards that perfection totally isn't there in the first place. Right?",
      "id": "ep_109_ut_68"
    },
    {
      "end": 2005554,
      "speaker": "Catherine D’Ignazio",
      "start": 1936146,
      "text": "Yeah, totally. Yeah. And I think, again, that's kind of like the, this is sort of what something that the art and design world suffers from as well, where it's like, you have this idea of artists are the genius or the designers is the genius, you know, and we kind of, I think there is a little bit of that, like, that floats in the air with data visualization. And, I mean, I certainly have a little bit of, like, fangirl stuff. When I see people, I'm like, oh, I love your thing. You know, I'm embarrassed to talk to them. But, but, yeah, even in the language, like, we have a chapter in our book where we're talking about the language we use to describe the work of people that do data visualization or work with data. So it's like we have janitors, ninjas, rock stars and unicorns. And if you think about all four of those, those are very solitary, very solitary creatures in general. Those are not collaborative things. It's like you go and you do your amazing magic in a box. Kind of like the box I'm in right now. I'm in the voiceover box. You do it in the box and then you come out and you're like, look at my genius stuff that I just made.",
      "id": "ep_109_ut_69"
    },
    {
      "end": 2007846,
      "speaker": "Moritz Stefaner",
      "start": 2005974,
      "text": "Or the wizard, the date of wizard.",
      "id": "ep_109_ut_70"
    },
    {
      "end": 2010550,
      "speaker": "Catherine D’Ignazio",
      "start": 2007910,
      "text": "The wizard. That's another one. Exactly.",
      "id": "ep_109_ut_71"
    },
    {
      "end": 2029092,
      "speaker": "Moritz Stefaner",
      "start": 2010622,
      "text": "And these things, they sound innocent, but I mean, in the end, they shape how we think. Or, I mean, maybe they reflect how we think, but they can also shape how we think. You're 16, and this is the thing you keep hearing. You sort of tend to think this is how it works, at least roughly. Right. And I think it's good to have an eye on that.",
      "id": "ep_109_ut_72"
    },
    {
      "end": 2041500,
      "speaker": "Enrico Bertini",
      "start": 2029108,
      "text": "And I have to say, I really like the trend in visualization of seeing couples of people doing things together. And now that they're talking about it, it's looked like it's been a women kind of thing. Right.",
      "id": "ep_109_ut_73"
    },
    {
      "end": 2043772,
      "speaker": "Catherine D’Ignazio",
      "start": 2041612,
      "text": "Which is. Right.",
      "id": "ep_109_ut_74"
    },
    {
      "end": 2044862,
      "speaker": "Enrico Bertini",
      "start": 2043868,
      "text": "I mean, think about, about.",
      "id": "ep_109_ut_75"
    },
    {
      "end": 2048726,
      "speaker": "Moritz Stefaner",
      "start": 2044958,
      "text": "So we have George, Nadieh and Charlie.",
      "id": "ep_109_ut_76"
    },
    {
      "end": 2054794,
      "speaker": "Enrico Bertini",
      "start": 2048870,
      "text": "I haven't seen a male couple yet. Right. Maybe me and you say the stories, right?",
      "id": "ep_109_ut_77"
    },
    {
      "end": 2058194,
      "speaker": "Catherine D’Ignazio",
      "start": 2055374,
      "text": "Yeah, I think you guys count. Yeah.",
      "id": "ep_109_ut_78"
    },
    {
      "end": 2061314,
      "speaker": "Enrico Bertini",
      "start": 2058654,
      "text": "Maybe we are the only male couple around.",
      "id": "ep_109_ut_79"
    },
    {
      "end": 2062714,
      "speaker": "Catherine D’Ignazio",
      "start": 2061854,
      "text": "Yes.",
      "id": "ep_109_ut_80"
    },
    {
      "end": 2064834,
      "speaker": "Enrico Bertini",
      "start": 2063134,
      "text": "I didn't anticipate that.",
      "id": "ep_109_ut_81"
    },
    {
      "end": 2069914,
      "speaker": "Catherine D’Ignazio",
      "start": 2066054,
      "text": "That's hilarious. No, I, that's very feminist of you. That's great.",
      "id": "ep_109_ut_82"
    },
    {
      "end": 2073370,
      "speaker": "Enrico Bertini",
      "start": 2071154,
      "text": "Yeah, yeah, yeah, yeah.",
      "id": "ep_109_ut_83"
    },
    {
      "end": 2146164,
      "speaker": "Catherine D’Ignazio",
      "start": 2073562,
      "text": "No, I think that's totally true. And, yeah, in terms of, like, the collaboration as well, I think that's, it's a really good point. And we also like, what we've been starting to look into and talk about as well is, like, how you involve multiple voices throughout the whole process. So not even just in the making of the visualization, but also in the, I mean, even in the selecting of the research question, even in the analysis. Like, there's actually, I've been trying to track a lot of projects. They mainly seem to be happening more in either kind of community based art and the arts, or they're happening through public engagement processes with the city. But there's some really interesting projects that are going on where they involve members of the public or like, sort of non experts in analysis of the data. So sort of not the visualization necessarily, but in sort of going through a public conversation and dialogue about, like, what does this data mean? And so I think those are all super interesting and exciting. And again, a way to sort of undermine this idea of, like, if you work with data, you're this, you're the wizard or you're the unicorn or something like that. Although maybe that would be sad for people if they're not a unicorn anymore.",
      "id": "ep_109_ut_84"
    },
    {
      "end": 2148816,
      "speaker": "Moritz Stefaner",
      "start": 2146584,
      "text": "Some can still be a unicorn, right?",
      "id": "ep_109_ut_85"
    },
    {
      "end": 2150816,
      "speaker": "Catherine D’Ignazio",
      "start": 2148920,
      "text": "Yeah, it just gets boring if it's.",
      "id": "ep_109_ut_86"
    },
    {
      "end": 2152688,
      "speaker": "Moritz Stefaner",
      "start": 2150840,
      "text": "Just ninjas and rockstar.",
      "id": "ep_109_ut_87"
    },
    {
      "end": 2188084,
      "speaker": "Catherine D’Ignazio",
      "start": 2152736,
      "text": "Right. But, like, I would say, I think this does have to do back to, like, more like, the inclusion issue. Like, I think it does have to do with who we welcome into fields like this, because if you're a person who likes to collaborate and likes to work with other people, but you're trained into this model of, like, oh, you're a wizard now. You're this data analyst wizard person that goes into the box and makes the thing that might just not be as attractive of a proposition for people as a career choice.",
      "id": "ep_109_ut_88"
    },
    {
      "end": 2218732,
      "speaker": "Moritz Stefaner",
      "start": 2189404,
      "text": "Yeah. So what are some of the things like when working on a data related project people might have an eye on? I mean, I think we discussed a lot, like, already not to falling into the trap of wrong objectivity and maybe thinking more about where data comes from, how it might be biased already, your own biases. Are there more things? Like maybe also smaller things people might just want to have an eye on in terms of how they work?",
      "id": "ep_109_ut_89"
    },
    {
      "end": 2222372,
      "speaker": "Catherine D’Ignazio",
      "start": 2218868,
      "text": "Yeah, let's see. Yeah. You mean for, like, practitioners?",
      "id": "ep_109_ut_90"
    },
    {
      "end": 2235020,
      "speaker": "Moritz Stefaner",
      "start": 2222468,
      "text": "Like, so in your paper, you have a few principles. For instance, like some of these, like, maybe worth illustrating with a few examples of what types of thinking could be helpful.",
      "id": "ep_109_ut_91"
    },
    {
      "end": 2344232,
      "speaker": "Catherine D’Ignazio",
      "start": 2235172,
      "text": "Sure. Yeah. I mean, maybe one that I'll talk about, which I think is instructive, particularly because I think particularly for people who are making data visualizations now in a variety of different contexts. Context. One of the principles is consider context. And what we mean by that is. So there's this complicated situation right now in which we have all these data sets that are being released into the world. We have the open data movement. We have APIs that one can contact and download data from them. So we have a situation where there would appear to be this environment of plenty, in a sense, for. For data that one can gather. But what happens a lot, and I'm sure you all are familiar with this, is that when you download these data sets from the web, in my classes, for example, we work with lots of open data from cities and states and countries and stuff. The context has been completely stripped. So there's very bad metadata, and it's often very unclear where does this data fit. So why was this data collected? How does it fit within the organizational context in which it exists? How does it unfold? Just even, what are the column names mean? Often there's no data dictionary or whatever. And so that's one where it's like you're particularly ripe for making even just basic errors. You're literally just, like, wrong about what does this data represent? And it's, again, where like, a little bit of backtracking. So looking back, I actually have my students do things like write data biographies where they download data, but then they go back in the process and be like, yeah, that's a great idea. Where does this thing come from? And paint a little bit of a picture of it. Yeah.",
      "id": "ep_109_ut_92"
    },
    {
      "end": 2371816,
      "speaker": "Moritz Stefaner",
      "start": 2344248,
      "text": "Also, Tariq Khokhar, he once from the World bank, he just gave a talk once where he just traced one number like this unemployment rate in Nigeria in 2015. Like, who? How did that come into that spreadsheet? Right. It's like chain of events and people with notepads on markets and passing it on and faxing it somewhere else, and you suddenly get this respect for all the messiness behind the simple numbers.",
      "id": "ep_109_ut_93"
    },
    {
      "end": 2455924,
      "speaker": "Catherine D’Ignazio",
      "start": 2371840,
      "text": "Right, exactly. And that's exactly it. It's like there's all this messiness, and it doesn't mean we can't use it. Right. It doesn't preclude us doing something with it, but it does mean just be a little more careful when you are doing things with it. So I think that's fascinating. And it's like every sort of data point in a spreadsheet is that story. It's like somebody scribbled a number on a form and somebody else translated that number into some database, and then somebody else used it to do this particular analysis in this way. So there's this history that is there that's not always immediately apparent. And so that's what this consider context thing means, is how do we sort of understand that our current data environment, especially sort of downloading data from the web and stuff like that, is really not ideal. There's a lot that is lacking both in terms of accessibility and then context and metadata. And so how do we kind of trace that back and understand before we jump in and just kind of move into the future and make some nice chart or graph? How do we understand? Sort of like, where that comes from? And so I actually have my students do interviews with people and things like this. And so that's also just a way, I think, just to do better data visualization and just not to make really bad mistakes. And there are cases of where journalists have made sort of embarrassing mistakes because they think the data is one thing, but then actually it's some wholly other thing that they're representing.",
      "id": "ep_109_ut_94"
    },
    {
      "end": 2496656,
      "speaker": "Enrico Bertini",
      "start": 2456514,
      "text": "Yeah, that's such an important point. And I think it's also related to the problem of uncertainty that I think you do talk about. Right. And, I mean, as you said, I think one thing that I've been thinking a lot lately, and I've been realizing through my work over the years, is that we, as a community, tend to think of visualization as the art of creating a graphical format out of sound something. Right. And the quality of this something, it's 100% dependent on how good the graphics is. Right. It's x. It's definitely not the case.",
      "id": "ep_109_ut_95"
    },
    {
      "end": 2498512,
      "speaker": "Moritz Stefaner",
      "start": 2496760,
      "text": "You can separate it from what.",
      "id": "ep_109_ut_96"
    },
    {
      "end": 2522008,
      "speaker": "Enrico Bertini",
      "start": 2498528,
      "text": "You can separate it from the data. Right. In a myriad of ways that I don't have time to cover here. But you gave, you gave a really good examples here. If the actual information that has been collected is not good enough, or you for are not careful enough, if you don't understand it enough, what you are communicating is garbage. And whatever the graphical format you are using doesn't matter at all.",
      "id": "ep_109_ut_97"
    },
    {
      "end": 2523804,
      "speaker": "Catherine D’Ignazio",
      "start": 2522176,
      "text": "At all. Exactly.",
      "id": "ep_109_ut_98"
    },
    {
      "end": 2533884,
      "speaker": "Moritz Stefaner",
      "start": 2524224,
      "text": "And conversely, if your data is really well crafted and collected and super good, a bar chart is fine.",
      "id": "ep_109_ut_99"
    },
    {
      "end": 2539684,
      "speaker": "Catherine D’Ignazio",
      "start": 2536344,
      "text": "Then go for the bar chart or even a pie chart. That'd be crazy.",
      "id": "ep_109_ut_100"
    },
    {
      "end": 2542012,
      "speaker": "Moritz Stefaner",
      "start": 2540764,
      "text": "But don't tell anyone.",
      "id": "ep_109_ut_101"
    },
    {
      "end": 2591154,
      "speaker": "Catherine D’Ignazio",
      "start": 2542068,
      "text": "Don't tell anyone, right? Yeah, totally. And actually, another good example of this is one that my students did a story about, and this is one that I think kind of directly relates to some of these feminist concerns, is, again, why the considering context is very important. And this idea that the data doesn't speak for itself. So just because you get a spreadsheet doesn't mean it's true. Right. And so they did this project on sexual assault on college campuses, and they collected all the data and they were looking just at Massachusetts, and then they found this very weird thing where, like, the schools that had the least amount of sexual assault cases were actually the places that had the least supportive environment for survivors to come forward. And so this is a very interesting thing.",
      "id": "ep_109_ut_102"
    },
    {
      "end": 2593534,
      "speaker": "Moritz Stefaner",
      "start": 2591274,
      "text": "They look good, but in fact, they were the worst.",
      "id": "ep_109_ut_103"
    },
    {
      "end": 2678664,
      "speaker": "Catherine D’Ignazio",
      "start": 2593914,
      "text": "Exactly. And so, and then the ones that looked the worst, so they had high numbers. And so on paper, like, if you were just like, oh, the data is gonna speak for itself, you would have said something like, oh, oh, Williams College is doing really bad, and they have all of these cases of sexual assault. And that would have been like, if you're just like, whipping it up, that would be your bar chart or whatever. But when, in fact, when they, like, did interviews and they talked to people and they learned more about the data and how it's reported. So it's reported through, it's a national database. It's called the Clery report and the institution's self report. So there's many incentives for institutions to, you know, no institution wants to look like it has high levels of sexual assault. And then, of course, with actual survivors, there's strong incentives not to come forward, especially in a hostile environment where they wouldn't be supported. And so that was their ultimate conclusion, is that actually the data was the inverse of the truth. And the places that look the worst actually have this very supportive environment. They have staff, time and resources devoted to the issue. They have support groups. And so this is a very interesting finding and where, again, if you don't understand the context, you're both going to get it wrong. But also, there are some sort of, there are, like, gender and identity issues that go on here as well, because often the voices that are the most silenced are those voices of, say, women, marginalized groups, minorities and others who are not necessarily comfortable coming forward in a particular kind of climate. Right.",
      "id": "ep_109_ut_104"
    },
    {
      "end": 2686192,
      "speaker": "Moritz Stefaner",
      "start": 2679164,
      "text": "So in any case, dominated environment, maybe people don't even notice because they are not subject to this.",
      "id": "ep_109_ut_105"
    },
    {
      "end": 2688136,
      "speaker": "Catherine D’Ignazio",
      "start": 2686328,
      "text": "Exactly. Yeah, exactly.",
      "id": "ep_109_ut_106"
    },
    {
      "end": 2691808,
      "speaker": "Moritz Stefaner",
      "start": 2688240,
      "text": "And that sort of closes the loop again. And here we are back at.",
      "id": "ep_109_ut_107"
    },
    {
      "end": 2692484,
      "speaker": "Catherine D’Ignazio",
      "start": 2691856,
      "text": "Yeah.",
      "id": "ep_109_ut_108"
    },
    {
      "end": 2718626,
      "speaker": "Moritz Stefaner",
      "start": 2694264,
      "text": "We need to wrap up soon, but I'd like to close also with some of your applied work because I think the theory is one thing, but you also have a lot of really interesting projects where you try to, I would say you try to break a bit also the standards of how we communicate data, probably maybe from understanding that, you know, certain irritation can be good at understanding that something else is going on.",
      "id": "ep_109_ut_109"
    },
    {
      "end": 2718850,
      "speaker": "Catherine D’Ignazio",
      "start": 2718650,
      "text": "Maybe.",
      "id": "ep_109_ut_110"
    },
    {
      "end": 2729698,
      "speaker": "Moritz Stefaner",
      "start": 2718882,
      "text": "So you have a few really cool non standard data visualization projects. One I really liked is a walking data visualization in Boston. Can you tell us a bit about this one?",
      "id": "ep_109_ut_111"
    },
    {
      "end": 2870604,
      "speaker": "Catherine D’Ignazio",
      "start": 2729866,
      "text": "Sure. Yeah. Yeah. So this is called Boston coastline future past. And a quick plug if you're in the Boston area, it's on exhibit right now at the MIT museum. Yeah. Called Big Bang data, but, yeah. So my artist friend Andy Sutton and I, we did a collaborative piece where we notice, and we now have a map, actually, that we're going to publish, but that the coastline of Boston in 1788, basically, before it was all filled in, it's a very human made landscape. The coastline from 1788 is very, very similar to the coastline projected for 2100. And so there's this alignment. It's scary, actually, because the sea level rise is predicted to be so high in Boston, both due to climate change and to some erosion as well, that we thought, well, this is a really interesting opportunity to talk about this. The fact that we're returning. When we go into the future, we're returning to this past view of what Boston was like. And so we basically led a tour. So we walked part of the future and the past coastline at a place where they overlap with each other. And we had a little what we called micro lectures along the way. So we had, like, the head of the environment for the city of Boston spoke about landscape design and zoning codes and how we need to adjust zoning codes to deal with climate change. We had a woman from the Boston Harbor association who's done some of the most forefront modeling and data collection on the sea level rise. So she spoke about that process. And then we had a media scholar talk about coastlines, sort of in the cultural imagination as well. And then we ended by all stenciling messages on the Boston common in this sort of participatory art project. So our goal was, like, to bring the data to the level of the body. So, again, this kind of emphasis on embodiment and situating it in the body and having people feel like we're walking this line where literally there's nowhere where you can see the river or the ocean or anything like that and feel like, oh, this is gonna be underwater. Like, this is where the water line will be in the future. And there's something very visceral about that. That as opposed to when you just kind of see it in that top down view, where you see it in the situated view. So, yeah, so that was our walking data visualization.",
      "id": "ep_109_ut_112"
    },
    {
      "end": 2888278,
      "speaker": "Moritz Stefaner",
      "start": 2872384,
      "text": "Yeah, but I think that's great. Like, how these thoughts can also, like, end up in really intriguing, intriguing projects, right? Yeah, yeah. And, yeah. And I think we would like to end with one that can actually be played on the podcast as well. So we always love data sonification. Of course.",
      "id": "ep_109_ut_113"
    },
    {
      "end": 2889034,
      "speaker": "Catherine D’Ignazio",
      "start": 2888366,
      "text": "Yes.",
      "id": "ep_109_ut_114"
    },
    {
      "end": 2895694,
      "speaker": "Moritz Stefaner",
      "start": 2889694,
      "text": "Working on a playful data sonification project. Can you tell us a bit about this that we will hear in a minute?",
      "id": "ep_109_ut_115"
    },
    {
      "end": 2973254,
      "speaker": "Catherine D’Ignazio",
      "start": 2895734,
      "text": "Also, yes, this is like my favorite project that is never, I don't know when I'm going to completely finish this, but it's called the Babylon Brook. And so the form of it that it takes is it's a large plastic flower. It's very clearly fake flower. It's red, and you stick it in a body of water, like a creek or a river or something like this. It has a number of sensors on the bottom of it, so it can sense a variety of water quality parameters, such as, like turbidity and conductivity and temperature and things like this. And then it actually senses those. And then in real time, it makes really bad jokes about the water quality. So it's like a stand up comedian flower that then talks in the robot voice, and then it laughs at its own, like, really terrible jokes. So I have this idea, like, one of the things I want to do in the future is like, I have this idea that I want to make environmental data comedy because environmental data is so terribly boring and it's usually so depressing. And so, like, I want to have, like, kids write some stand up joke material for the flower. How do we make some jokes about this thing that's like, I mean, it's serious, but it's like, we can't have so much doom and gloom about this.",
      "id": "ep_109_ut_116"
    },
    {
      "end": 2980364,
      "speaker": "Moritz Stefaner",
      "start": 2976824,
      "text": "It's like a talking flower that makes jokes about the water quality.",
      "id": "ep_109_ut_117"
    },
    {
      "end": 2984444,
      "speaker": "Catherine D’Ignazio",
      "start": 2981104,
      "text": "You can go down in flames of talking robots.",
      "id": "ep_109_ut_118"
    },
    {
      "end": 3018046,
      "speaker": "Moritz Stefaner",
      "start": 2986144,
      "text": "That's wonderful. So, yeah, just to close this podcast, you will hear a few of the best, worst jokes from a talking why not? So thanks so much for joining us. This was amazing. Also, dear listeners, make sure to read the paper and the blog post we link. I think there's much we were not able to, to touch on in this short conversation, and there's lots of interesting stuff to discover. And also, look at catherine's website at http://www.kanarinka.com/.",
      "id": "ep_109_ut_119"
    },
    {
      "end": 3018638,
      "speaker": "Catherine D’Ignazio",
      "start": 3018150,
      "text": "Correct.",
      "id": "ep_109_ut_120"
    },
    {
      "end": 3019594,
      "speaker": "Moritz Stefaner",
      "start": 3018726,
      "text": "Very good.",
      "id": "ep_109_ut_121"
    },
    {
      "end": 3023718,
      "speaker": "Catherine D’Ignazio",
      "start": 3020534,
      "text": "Thank you so much. No, it's a huge pleasure. It's great.",
      "id": "ep_109_ut_122"
    },
    {
      "end": 3024262,
      "speaker": "Enrico Bertini",
      "start": 3023806,
      "text": "Thanks so much.",
      "id": "ep_109_ut_123"
    },
    {
      "end": 3025310,
      "speaker": "Moritz Stefaner",
      "start": 3024278,
      "text": "It's been a pleasure having you.",
      "id": "ep_109_ut_124"
    },
    {
      "end": 3027366,
      "speaker": "Enrico Bertini",
      "start": 3025382,
      "text": "Yeah, thank you. Bye bye.",
      "id": "ep_109_ut_125"
    },
    {
      "end": 3028470,
      "speaker": "Moritz Stefaner",
      "start": 3027390,
      "text": "Bye bye bye.",
      "id": "ep_109_ut_126"
    },
    {
      "end": 3081554,
      "speaker": "D",
      "start": 3028662,
      "text": "Good morning, friends. I'm 5.25 inches deep and my temperature is 48 degrees fahrenheit. Feel and groove groovy da da da da da da da feeling groovy. Knock knock. Who's there? Water. Water who? What are you doing in my creek? Ha ha ha. I am rolling on the floor laughing out loud at kanaranka. Here's a good one. What do snowmen eat for lunch? Ice burgers. Hahahahaha. Rolling on the floor laughing out. Etinette, what are you doing right now? I'm going with the flow. Hahahahaha. Get it? I'm a creek. If you are getting bored, you should check out my website at http://www.kanarinka.com/project/the-babbling-brook/.",
      "id": "ep_109_ut_127"
    }
  ],
  "confidence": 0.925475760782057,
  "audio_duration": 3091,
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_status_code": null,
  "webhook_auth": false,
  "webhook_auth_header_name": null,
  "speed_boost": false,
  "auto_highlights_result": null,
  "auto_highlights": false,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_audio_quality": null,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "content_safety": false,
  "iab_categories": true,
  "content_safety_labels": {
    "status": "unavailable",
    "results": [],
    "summary": {}
  },
  "language_detection": false,
  "language_detection_threshold": null,
  "language_confidence": null,
  "custom_spelling": null,
  "throttled": false,
  "auto_chapters": true,
  "summarization": false,
  "summary_type": null,
  "summary_model": null,
  "custom_topics": false,
  "topics": [],
  "speech_threshold": null,
  "speech_model": "best",
  "chapters": [
    {
      "summary": "Moritz Stefaner is an independent designer of data visualizations. Enrico Bertini is a professor at NYU in New York City. Together they talk about data visualization, data analysis, and generally which role data plays in our lives.",
      "gist": "Data Stories",
      "headline": "Data stories podcast talks about data visualization, data analysis, and more",
      "start": 200,
      "end": 51100,
      "id": "ep_109_ch_0"
    },
    {
      "summary": "We are finally switching to crowdfunding. We have 83 patrons backing the show. We should say a big thanks to our sponsors so far. And of course, we are thinking about some special perks for our patrons.",
      "gist": "Data Stories: Going to Crowdfunding",
      "headline": "We are finally switching to crowdfunding. We have 83 patrons backing the show",
      "start": 51292,
      "end": 257738,
      "id": "ep_109_ch_1"
    },
    {
      "summary": "Catherine D'Ignazio is an assistant professor for data visualization and civic media at Emerson College. She grew up around computers and computer programming and robots. She tried three careers before landing at Emerson. She talks about the intersection of technology, art and design.",
      "gist": "Catherine D'Ignazio on How She Found Her Career",
      "headline": "Catherine D'Ignazio is an assistant professor at Emerson College",
      "start": 257826,
      "end": 593446,
      "id": "ep_109_ch_2"
    },
    {
      "summary": "A lot of feminist thinking is not only about gender. What would a feminist perspective on data visualization look like? What's your perspective there?",
      "gist": "What Would Feminist Data visualization look like?",
      "headline": "What does feminism have to do with data visualization? I first came across post",
      "start": 593590,
      "end": 940014,
      "id": "ep_109_ch_3"
    },
    {
      "summary": "A strong claim of feminist thought would be around situated knowledge. One of the reasons we love data visualizations is because they are like the view from above. But feminist thought also pays close attention to how things get made and to labor.",
      "gist": "Data Visualizations and Feminist Theory",
      "headline": "Georgia Lupi: One of the reasons we love data visualizations is",
      "start": 940354,
      "end": 1279534,
      "id": "ep_109_ch_4"
    },
    {
      "summary": "We're moving out of a modernist phase of data visualization. No matter how neutral or scientific you might think that it is, it is a communicative act. Research shows that visualization is a very strong persuasion tool.",
      "gist": "Data Visualization: A Modernist Perspective",
      "headline": "I think there's widespread literacy about how photos are not neutral",
      "start": 1279574,
      "end": 1839424,
      "id": "ep_109_ch_5"
    },
    {
      "summary": "Feminist thought is quite aligned with these trends in data visualization and even in science, around reproducibility of research and knowledge. I think transparency and sort of self reflexivity, disclosing oneself and disclosing one's own position can go a long way forward.",
      "gist": "The role of collaboration in data visualization",
      "headline": "Feminist thought is aligned with trends in data visualization and science",
      "start": 1839784,
      "end": 2190184,
      "id": "ep_109_ch_6"
    },
    {
      "summary": "One of the principles is consider context. When you download these data sets from the web, the context has been completely stripped. There's very bad metadata, and it's often very unclear where does this data fit. Be a little more careful when you are doing things with it.",
      "gist": "Five Rules for Data Visualization",
      "headline": "So what are some of the things like when working on a data related project",
      "start": 2190484,
      "end": 2591154,
      "id": "ep_109_ch_7"
    },
    {
      "summary": "They look good, but in fact, they were the worst. The places that look the worst actually have this very supportive environment. With actual survivors, there's strong incentives not to come forward. Often the voices that are the most silenced are those of marginalized groups.",
      "gist": "The Study of Sexual Assault",
      "headline": "Williams College had the worst number of sexual assault cases, according to study",
      "start": 2591274,
      "end": 2692484,
      "id": "ep_109_ch_8"
    },
    {
      "summary": "A walking data visualization in Boston. The coastline from 1788 is very, very similar to the coastline projected for 2100. The goal was to bring the data to the level of the body. How these thoughts can also end up in really intriguing, intriguing projects.",
      "gist": "Walking Through the Data",
      "headline": "You have some interesting non standard data visualization projects in Boston",
      "start": 2694264,
      "end": 2884896,
      "id": "ep_109_ch_9"
    },
    {
      "summary": "Catherine is working on a playful data sonification project. It's like a talking flower that makes jokes about the water quality. Catherine: I want to make environmental data comedy. There's lots of interesting stuff to discover.",
      "gist": "The Babylon Brook: a playful data sonification project",
      "headline": "Catherine is working on a playful data sonification project",
      "start": 2885040,
      "end": 3028470,
      "id": "ep_109_ch_10"
    },
    {
      "summary": "Good morning, friends. I'm 5.25 inches deep and my temperature is 48 degrees fahrenheit. What do snowmen eat for lunch? Ice burgers. If you are getting bored, you should check out my website@www. thebabblingbrook. com.",
      "gist": "Babbling Brook: Feeling Groovy",
      "headline": "Good morning, friends. Here's a good one. Feel and groove groovy",
      "start": 3028662,
      "end": 3081554,
      "id": "ep_109_ch_11"
    }
  ],
  "disfluencies": false,
  "entity_detection": false,
  "sentiment_analysis": false,
  "sentiment_analysis_results": null,
  "entities": null,
  "speakers_expected": null,
  "summary": null,
  "custom_topics_results": null,
  "episode_num": 109,
  "episode_metadata": {
    "speakers": [
      "Catherine D’Ignazio",
      "Moritz Stefaner",
      "Enrico Bertini"
    ],
    "WPid": "1065",
    "url": "https://datastori.es/podlove/file/4565/s/feed/c/mp3/109-feminist-data-visualization-with-catherine-dignazio.mp3",
    "episode_title": "Feminist Data Visualization with Catherine D’Ignazio"
  }
}