{
  "id": "c75020fc-995b-48cc-83cd-847a81228e8e",
  "language_model": "assemblyai_default",
  "acoustic_model": "assemblyai_default",
  "language_code": "en_us",
  "status": "completed",
  "audio_url": "https://datastori.es/podlove/file/417/s/feed/c/mp3/Datastories-37.mp3",
  "utterances": [
    {
      "end": 22712,
      "speaker": "Moritz Stefaner",
      "start": 22160,
      "text": "Hey, everyone.",
      "id": "ep_37_ut_0"
    },
    {
      "end": 27632,
      "speaker": "Enrico Bertini",
      "start": 22798,
      "text": "Datastore is number 37. Hi, Enrico. How are you doing?",
      "id": "ep_37_ut_1"
    },
    {
      "end": 28632,
      "speaker": "Scott Murray",
      "start": 27776,
      "text": "How's it going?",
      "id": "ep_37_ut_2"
    },
    {
      "end": 30216,
      "speaker": "Enrico Bertini",
      "start": 28736,
      "text": "Good. How is life?",
      "id": "ep_37_ut_3"
    },
    {
      "end": 34600,
      "speaker": "Scott Murray",
      "start": 30408,
      "text": "It's great. Summer is here, apparently. Yeah, I love it.",
      "id": "ep_37_ut_4"
    },
    {
      "end": 35232,
      "speaker": "Enrico Bertini",
      "start": 34760,
      "text": "That's a sad.",
      "id": "ep_37_ut_5"
    },
    {
      "end": 39168,
      "speaker": "Scott Murray",
      "start": 35256,
      "text": "Nobody else can stand it but me. I love it. I love the heat.",
      "id": "ep_37_ut_6"
    },
    {
      "end": 40800,
      "speaker": "Enrico Bertini",
      "start": 39264,
      "text": "The Italian jeans are.",
      "id": "ep_37_ut_7"
    },
    {
      "end": 44580,
      "speaker": "Scott Murray",
      "start": 40960,
      "text": "Yeah, the Italian jeans are still there, kicking hard.",
      "id": "ep_37_ut_8"
    },
    {
      "end": 48060,
      "speaker": "Enrico Bertini",
      "start": 46360,
      "text": "I can totally imagine.",
      "id": "ep_37_ut_9"
    },
    {
      "end": 49672,
      "speaker": "Scott Murray",
      "start": 48560,
      "text": "How about you?",
      "id": "ep_37_ut_10"
    },
    {
      "end": 57754,
      "speaker": "Enrico Bertini",
      "start": 49816,
      "text": "Yeah, it's good here in Germany. It's nice, too. And I just came back from a week of Barcelona, so I won't complain.",
      "id": "ep_37_ut_11"
    },
    {
      "end": 60466,
      "speaker": "Scott Murray",
      "start": 57922,
      "text": "Oh, you're treating man. You're treating yourself quite.",
      "id": "ep_37_ut_12"
    },
    {
      "end": 63218,
      "speaker": "Enrico Bertini",
      "start": 60538,
      "text": "Yeah. Oh, I was working. Of course.",
      "id": "ep_37_ut_13"
    },
    {
      "end": 63842,
      "speaker": "Scott Murray",
      "start": 63394,
      "text": "Yeah.",
      "id": "ep_37_ut_14"
    },
    {
      "end": 71642,
      "speaker": "Enrico Bertini",
      "start": 63906,
      "text": "Working hard. No, we had another edition of the data cuisine workshop. Finally, after like two years of trying to make it happen again, we.",
      "id": "ep_37_ut_15"
    },
    {
      "end": 72514,
      "speaker": "Scott Murray",
      "start": 71786,
      "text": "Totally cool.",
      "id": "ep_37_ut_16"
    },
    {
      "end": 81852,
      "speaker": "Enrico Bertini",
      "start": 72562,
      "text": "Or mostly our Barcelona partners, the CCCB and sonar festival, they made it happen and we did it four days, 4 hours a day.",
      "id": "ep_37_ut_17"
    },
    {
      "end": 86992,
      "speaker": "Scott Murray",
      "start": 82026,
      "text": "So did you make the show? The fiesta? Did you have the fiesta kind of thing?",
      "id": "ep_37_ut_18"
    },
    {
      "end": 88720,
      "speaker": "Enrico Bertini",
      "start": 87136,
      "text": "You meant like partying or.",
      "id": "ep_37_ut_19"
    },
    {
      "end": 91944,
      "speaker": "Scott Murray",
      "start": 88840,
      "text": "Yeah, kind of like drinking all the time and hanging.",
      "id": "ep_37_ut_20"
    },
    {
      "end": 106992,
      "speaker": "Enrico Bertini",
      "start": 92032,
      "text": "Yeah. There was Sauna festival, which is a big, big music festival. And that was in the last few days, our evening program too, so that's cool. And on Wednesday, I met Ferran Adria, who was like one of the most legendary chefs worldwide.",
      "id": "ep_37_ut_21"
    },
    {
      "end": 107744,
      "speaker": "Scott Murray",
      "start": 107176,
      "text": "Wow.",
      "id": "ep_37_ut_22"
    },
    {
      "end": 108096,
      "speaker": "Moritz Stefaner",
      "start": 107832,
      "text": "Yeah.",
      "id": "ep_37_ut_23"
    },
    {
      "end": 119970,
      "speaker": "Enrico Bertini",
      "start": 108128,
      "text": "And he gave us a tour through his new exhibition. And I explained us why our workshop was a bad idea. Overall. That was fantastic. That was really good. Yeah. Yeah.",
      "id": "ep_37_ut_24"
    },
    {
      "end": 122050,
      "speaker": "Scott Murray",
      "start": 120430,
      "text": "Did you record something?",
      "id": "ep_37_ut_25"
    },
    {
      "end": 158990,
      "speaker": "Enrico Bertini",
      "start": 122510,
      "text": "No. Recordings? No, we didn't. We weren't allowed to take photos. Super secret, just for friends. You know how it is. But the documentation for the workshop is forthcoming. I think it will be out when you listen to that. So cool. Good stuff. We even have had a food printer. So it's a 3d printer that can print food like cream cheese or honey or chocolate. You can print pretty well and build sculptures. You mean really edible food that comes out of a machine controlled syringe, basically.",
      "id": "ep_37_ut_26"
    },
    {
      "end": 160194,
      "speaker": "Scott Murray",
      "start": 159490,
      "text": "Oh, my God.",
      "id": "ep_37_ut_27"
    },
    {
      "end": 164230,
      "speaker": "Enrico Bertini",
      "start": 160242,
      "text": "Yeah. And you can like, print patterns and sculptures and all kinds of crazy shit.",
      "id": "ep_37_ut_28"
    },
    {
      "end": 168414,
      "speaker": "Scott Murray",
      "start": 164650,
      "text": "Oh, that's. That's cool. Really cool. Did you take some pictures?",
      "id": "ep_37_ut_29"
    },
    {
      "end": 173574,
      "speaker": "Enrico Bertini",
      "start": 168562,
      "text": "Yeah, lots of them. So. Okay. It will all be up on data cuisine.net dot. We'll put it in the post.",
      "id": "ep_37_ut_30"
    },
    {
      "end": 175478,
      "speaker": "Scott Murray",
      "start": 173742,
      "text": "Oh, that's cool. Yeah, great.",
      "id": "ep_37_ut_31"
    },
    {
      "end": 178330,
      "speaker": "Enrico Bertini",
      "start": 175574,
      "text": "And I had a great week. Very refreshing.",
      "id": "ep_37_ut_32"
    },
    {
      "end": 182390,
      "speaker": "Scott Murray",
      "start": 178910,
      "text": "Yeah. Yeah, summer is good. We are happy.",
      "id": "ep_37_ut_33"
    },
    {
      "end": 187286,
      "speaker": "Enrico Bertini",
      "start": 182470,
      "text": "Yeah. Now back to doing like, boring stuff. Like recording data stories.",
      "id": "ep_37_ut_34"
    },
    {
      "end": 196404,
      "speaker": "Scott Murray",
      "start": 187398,
      "text": "Yeah, boring stuff like recording. Yeah. We are so miserable. So should we start?",
      "id": "ep_37_ut_35"
    },
    {
      "end": 197340,
      "speaker": "Enrico Bertini",
      "start": 196542,
      "text": "Totally.",
      "id": "ep_37_ut_36"
    },
    {
      "end": 201112,
      "speaker": "Scott Murray",
      "start": 198000,
      "text": "You want to introduce the episode and guest?",
      "id": "ep_37_ut_37"
    },
    {
      "end": 216024,
      "speaker": "Enrico Bertini",
      "start": 201216,
      "text": "We have a topic we have been discussing I think for a year now that we need to. Yeah, exactly. Because it's one of the things that we really want to improve on. And so we thought we invite some pros and the topic is how do you actually teach data visualization?",
      "id": "ep_37_ut_38"
    },
    {
      "end": 216896,
      "speaker": "Scott Murray",
      "start": 216152,
      "text": "Oh my God.",
      "id": "ep_37_ut_39"
    },
    {
      "end": 218880,
      "speaker": "Enrico Bertini",
      "start": 216968,
      "text": "Yeah. And it's the hardest thing, right?",
      "id": "ep_37_ut_40"
    },
    {
      "end": 219816,
      "speaker": "Scott Murray",
      "start": 219040,
      "text": "That's huge.",
      "id": "ep_37_ut_41"
    },
    {
      "end": 220512,
      "speaker": "Enrico Bertini",
      "start": 219888,
      "text": "Yeah. Yeah.",
      "id": "ep_37_ut_42"
    },
    {
      "end": 224696,
      "speaker": "Scott Murray",
      "start": 220576,
      "text": "And it's so important to me. I mean I'm struggling all the time.",
      "id": "ep_37_ut_43"
    },
    {
      "end": 229812,
      "speaker": "Enrico Bertini",
      "start": 224848,
      "text": "So I think at some point you need to sort of figure it out, right? Yeah.",
      "id": "ep_37_ut_44"
    },
    {
      "end": 243204,
      "speaker": "Scott Murray",
      "start": 229836,
      "text": "The funny thing is that people believe when they, when they talk to professors, they believe that once you. Once the semester ends, you are done with your job. Right. Which is actually the opposite. Now you can finally do your. Your job, the actual job.",
      "id": "ep_37_ut_45"
    },
    {
      "end": 247772,
      "speaker": "Enrico Bertini",
      "start": 243292,
      "text": "The actual job, which you find more important. But yeah, sure.",
      "id": "ep_37_ut_46"
    },
    {
      "end": 248316,
      "speaker": "Scott Murray",
      "start": 247836,
      "text": "Yeah.",
      "id": "ep_37_ut_47"
    },
    {
      "end": 252036,
      "speaker": "Enrico Bertini",
      "start": 248428,
      "text": "And nobody tells you how to teach, right? Like you become a professor, but actually.",
      "id": "ep_37_ut_48"
    },
    {
      "end": 253460,
      "speaker": "Scott Murray",
      "start": 252108,
      "text": "That's the weird thing you become.",
      "id": "ep_37_ut_49"
    },
    {
      "end": 256468,
      "speaker": "Enrico Bertini",
      "start": 253540,
      "text": "There's no theory about like how to teach stuff.",
      "id": "ep_37_ut_50"
    },
    {
      "end": 258780,
      "speaker": "Scott Murray",
      "start": 256644,
      "text": "At least not here. I don't know if there are other.",
      "id": "ep_37_ut_51"
    },
    {
      "end": 270812,
      "speaker": "Enrico Bertini",
      "start": 258820,
      "text": "Universities where everybody's winging it. And so we invited two people who are winging it pretty professionally. So what is. Andy Kirk. Hey Andy.",
      "id": "ep_37_ut_52"
    },
    {
      "end": 273280,
      "speaker": "Moritz Stefaner",
      "start": 270996,
      "text": "Good afternoon. Good evening. How are you all doing?",
      "id": "ep_37_ut_53"
    },
    {
      "end": 276436,
      "speaker": "Scott Murray",
      "start": 273780,
      "text": "Yeah, excellent. We are doing great.",
      "id": "ep_37_ut_54"
    },
    {
      "end": 278916,
      "speaker": "Moritz Stefaner",
      "start": 276588,
      "text": "Pleasure to be back for number five.",
      "id": "ep_37_ut_55"
    },
    {
      "end": 285200,
      "speaker": "Enrico Bertini",
      "start": 279068,
      "text": "Yeah, something like that. Definitely one more than Mister Kosara at least. Yeah, that's what counts.",
      "id": "ep_37_ut_56"
    },
    {
      "end": 287720,
      "speaker": "Moritz Stefaner",
      "start": 285940,
      "text": "Thank you, Sir Robert out there.",
      "id": "ep_37_ut_57"
    },
    {
      "end": 293900,
      "speaker": "Scott Murray",
      "start": 289760,
      "text": "I was just about to say, if you're wondering it's the same end Kirk, as ever.",
      "id": "ep_37_ut_58"
    },
    {
      "end": 301024,
      "speaker": "Moritz Stefaner",
      "start": 294600,
      "text": "Sorry. 1.0. Yeah, yeah.",
      "id": "ep_37_ut_59"
    },
    {
      "end": 305696,
      "speaker": "Enrico Bertini",
      "start": 301072,
      "text": "What can you do? And we have Scott Murray here. Hey Scott.",
      "id": "ep_37_ut_60"
    },
    {
      "end": 307168,
      "speaker": "Andy Kirk",
      "start": 305888,
      "text": "Yeah, hey, good morning.",
      "id": "ep_37_ut_61"
    },
    {
      "end": 308260,
      "speaker": "Enrico Bertini",
      "start": 307304,
      "text": "How are you doing?",
      "id": "ep_37_ut_62"
    },
    {
      "end": 317104,
      "speaker": "Andy Kirk",
      "start": 308600,
      "text": "I'm doing really well. Excited to be here. 1st. 1st time caller, many time listener, something like that. Yeah. However it goes.",
      "id": "ep_37_ut_63"
    },
    {
      "end": 326990,
      "speaker": "Enrico Bertini",
      "start": 317152,
      "text": "Yeah. But we met already on visualizing Q and A and for a moment I thought you have been on data stories already. But actually you haven't been, right?",
      "id": "ep_37_ut_64"
    },
    {
      "end": 342114,
      "speaker": "Andy Kirk",
      "start": 327850,
      "text": "No, I'm just a constant presence in everyone's lives. It just feels like I've been here before. No, yeah, no, I'm excited to be here before because every, you know, it seems every episode this kind of conversation comes up and I'm excited to be part of the conversation.",
      "id": "ep_37_ut_65"
    },
    {
      "end": 342634,
      "speaker": "Enrico Bertini",
      "start": 342162,
      "text": "That's cool.",
      "id": "ep_37_ut_66"
    },
    {
      "end": 344104,
      "speaker": "Andy Kirk",
      "start": 342682,
      "text": "There's so many challenges.",
      "id": "ep_37_ut_67"
    },
    {
      "end": 347480,
      "speaker": "Enrico Bertini",
      "start": 344202,
      "text": "Yeah. So tell us a little what you do for the listeners.",
      "id": "ep_37_ut_68"
    },
    {
      "end": 464120,
      "speaker": "Andy Kirk",
      "start": 348980,
      "text": "Should I go first? Okay, yeah, sure. So I teach, my sort of full time day job is I teach in the design program at the University of San Francisco. That's an undergraduate program. So my sort of context for working here is I work primarily with, well, entirely with undergraduate students. And they, let's see, I teach a number of courses. The one we're probably interested in is our information visualization course. And one thing I think is really interesting, I have colleagues in other departments, like in the computer science department. My colleague Sophie Engel, my colleague Alark Joshi also teach like in various, well, a different information visualization course, but it's to a totally different, not totally different. It's still undergraduate students, but it's computer science students. Right. So one thing we talk a lot about is this, addressing these different audiences and how we can collaborate, but we have different assumptions of background knowledge. So anyway, I teach at USF also. I'm a code artist, so I sort of do a lot of work with D3. People may recognize my name as I have a book out about D3. And that's obviously a fantastic tool that gets mentioned a lot on here. I also contribute to processing. I use processing for a lot of my own work. So if you haven't heard of that, it's a free open source language for artists and designers. What else? Yeah. And I guess I do various workshops and things here and there, just always trying to sort of get people involved. And essentially, really I'm interested in reaching out to the beginner level, people who either aren't in the field yet or are in the field but don't have the technical skills that they want yet and trying to sort of bring them up to speed, mostly because I think this stuff isn't as scary as a lot of people think it is. I was just sort of trying to do a little hand holding in that respect.",
      "id": "ep_37_ut_69"
    },
    {
      "end": 482480,
      "speaker": "Scott Murray",
      "start": 464860,
      "text": "So, Scott, let me take this opportunity to say thank you for your book. I mean, it's so useful. No, seriously, I think it's, I mean, I think you really had an impact with this book. Thank you. Thanks a lot. My students love it.",
      "id": "ep_37_ut_70"
    },
    {
      "end": 492760,
      "speaker": "Andy Kirk",
      "start": 483220,
      "text": "Nice. No, that is great. We should have a whole other episode where we just talk about the book. Actually, that would be really helpful for me.",
      "id": "ep_37_ut_71"
    },
    {
      "end": 496520,
      "speaker": "Enrico Bertini",
      "start": 493940,
      "text": "Lectures out, too, right? At O'Reilly?",
      "id": "ep_37_ut_72"
    },
    {
      "end": 575130,
      "speaker": "Andy Kirk",
      "start": 497020,
      "text": "Yeah, we just published a new video course. So O'Reilly does books. They're mostly known for. They also organize conference and do these video courses and a bunch of other things. So we just released a video course, which is basically, I mean, one thing, I'm glad you brought it up because I sort of want to talk about it today. I'm interested in experimenting with these sort of new models for education. So certainly there's enormous value in the traditional university model. But there's a lot of people around the world who can't travel to San Francisco or can't travel to London or wherever. And New York. Don't want to leave New York out of that list, offend somebody. Yeah. So we did this video course, which was essentially like me trying to translate what I would normally do as sort of a four hour intro workshop in person into a three hour video course. And it's only 3 hours because you don't get to ask questions and there's no time for the projector to malfunction or anything like that. And you can also pause whenever you need a break. Right. So we don't have to schedule in time for. But yeah, it's been really interesting to get feedback on that and sort of see how these different models work. Because the book serves kind of the same audience as the video, but it's a different learning style, it's a different approach.",
      "id": "ep_37_ut_73"
    },
    {
      "end": 583970,
      "speaker": "Scott Murray",
      "start": 576430,
      "text": "So Andy, you want to say a few words about yourself, even if you did it at least five times already or four times already?",
      "id": "ep_37_ut_74"
    },
    {
      "end": 663006,
      "speaker": "Moritz Stefaner",
      "start": 584790,
      "text": "Yeah, well, I suppose. In summary, I've been to data visualization freelancer since October 2012. Now the primary time that I spend is on data visualization training courses. Typically one day courses, either in a public setting around the world in different locations, or also increasingly for corporate clients who are looking for on site bespoke event. I also teach on the infovis master's degree at Mica Maryland Institute College of Art. That is a module that actually, I've just recently finished, actually. So that is kind of an online tuition model. So I teach from the UK, streaming back to the states, which is obviously a very different setting and a very different experience. And we'll come on to some of the nuances of that experience later on. I'm also doing consultancy work, design work. I've also written a book, scope. And just this last week, by the way, just this last week I've been approved for book number two as well, which is both exciting and terrifying in equal measures.",
      "id": "ep_37_ut_75"
    },
    {
      "end": 664686,
      "speaker": "Andy Kirk",
      "start": 663198,
      "text": "Congratulations. That's awesome.",
      "id": "ep_37_ut_76"
    },
    {
      "end": 731170,
      "speaker": "Moritz Stefaner",
      "start": 664758,
      "text": "Thank you very much. This is the book that I wanted to write in the first place, but it'll give me more chance to breathe, to also introduce some colour, which will be pleasant for those who buy the print version. But I think also which is relevant to this session today I'm also on a research project at the University of Leeds looking at visualization literacy. So we're doing a study on how the general public, everyday people, for want of a better term, which is a horrible term, but we're looking at how well equipped people are at consuming and making sense of visualizations. Because as you just said at the start, we don't get taught how to teach visualization, but we don't really get taught how to consume and read and make sense of at any stage of education. We just get by for exposure. And that's something we're looking to try and get a sense of where people are in the general public and what we can do to address the gaps that people need, because you can't get away from this in the modern society. So in a nutshell, that's me. Oh, I run the website visualisingdata.com as well. Check it out.",
      "id": "ep_37_ut_77"
    },
    {
      "end": 772536,
      "speaker": "Scott Murray",
      "start": 733070,
      "text": "Okay, fantastic. And so I think it's pretty, what is pretty interesting here is that each of us has at least some experience teaching visualization. And by talking with you guys before, I know that everyone is struggling one way or another. So I am myself teaching to computer science students. Andy is teaching to have all spectrum of different people with these workshops. Scott is teaching mainly to design students. Right, Scott. And Moritz is also teaching from time to time. Right, Moritz?",
      "id": "ep_37_ut_78"
    },
    {
      "end": 794680,
      "speaker": "Enrico Bertini",
      "start": 772608,
      "text": "Sometimes, yeah. So I do. So the format I like the most are actually three day or two day workshops. But I also taught a few hours or one day or sometimes even a whole semester sometimes the scientists, artists, designers, professionals, it depends a bit, but I'm an amateur at teaching.",
      "id": "ep_37_ut_79"
    },
    {
      "end": 827462,
      "speaker": "Scott Murray",
      "start": 797100,
      "text": "Okay, I'm wondering, how about each of us starts with giving a little bit of, I don't know, comments about what are you struggling with? Right. So when you teach visualization, how is it to teach visualization in your experience? Not only the struggle, but also, I mean, in general, what's the experience of teaching this in your, in your classes? I'm really curious to hear that. I have all sorts of stories myself. Andy, you want to start with that?",
      "id": "ep_37_ut_80"
    },
    {
      "end": 953304,
      "speaker": "Moritz Stefaner",
      "start": 827526,
      "text": "Yeah, yeah, sure. I think the great struggle from experience is what to leave out. Typically, my courses are one day workshops, although some of tomorrow I'm looking forward towards creating a more kind of formal two to three day offering, which I think will give it the true room to breathe. But what can you fit into a day that really captures the essence of visualization gets the balance between the craft versus instruction, theory versus practice. I mean, having constructed the materials for the information visualization master's degree at Mica, I've got around 24 hours worth of material there. So how do I squeeze that into what comes down to maybe a 7 hours period of contact? So it's a great challenge. And what I'm trying to do, I guess. And I suppose this is where I see my role in the field in general, is trying to find a way to bridge the gap between the top people. Three of you are lined up in front of me right now, the illuminati of the field, pushing the boundaries of what we should do, what we could do creatively and theoretically. And then, and it's an unfortunate term again, the everyday person out there who's working with data in their day jobs, but it's not necessarily their, their vocation or their professional training. So how do you translate that to the, to the kind of the lower end of the, of the pyramid in, in the day? So it's a challenge, and it's something that I was just doing some sums before the session. I've reached my 102nd workshop in two and a half years, and I would imagine that there's been 101 different versions of the course, not just to reflect increasing knowledge on my own behalf, but also just that constant tweaking to try and optimize it towards what I think is the best balance. And it's not easy. And I would have thought that by maybe five or six, I would have nailed it and cut to a level playing field. But now it's.",
      "id": "ep_37_ut_81"
    },
    {
      "end": 955760,
      "speaker": "Enrico Bertini",
      "start": 953352,
      "text": "That was the plane and the plan, probably, right? Exactly.",
      "id": "ep_37_ut_82"
    },
    {
      "end": 963408,
      "speaker": "Moritz Stefaner",
      "start": 955800,
      "text": "Yeah. Spend a lot of time up front getting the materials ready, but no, it's an ongoing battle, but it's fun.",
      "id": "ep_37_ut_83"
    },
    {
      "end": 974990,
      "speaker": "Enrico Bertini",
      "start": 963464,
      "text": "Is also changing so fast. Like, if I give the same slides, like a year later, I feel like, wow, the project. I mean, so much has happened in the meantime. I should update this. Also, my focus is shifting all the time.",
      "id": "ep_37_ut_84"
    },
    {
      "end": 988398,
      "speaker": "Moritz Stefaner",
      "start": 975110,
      "text": "I also think as well, if the slides are the same from last year, then you've not really done a service to the people being trained. You've not stayed up to date, and you've not developed or matured yourself because that's an ongoing process, of course, but.",
      "id": "ep_37_ut_85"
    },
    {
      "end": 1001870,
      "speaker": "Enrico Bertini",
      "start": 988414,
      "text": "So what are the constants? Let's say, when you teach, like, are there a few things that are always there? Because you say, like, okay, if I teach somebody, they should at least go home with these five facts or something like this. Is there something like that? Or.",
      "id": "ep_37_ut_86"
    },
    {
      "end": 1056380,
      "speaker": "Moritz Stefaner",
      "start": 1001990,
      "text": "Well, I mean, I guess my constant is the structure in the sense that teaching critical thinking wrapped up in a workflow. And so in a sense, everyone leaves with a sense of what I believe is the most effective and efficient way forward in any data visualization challenge, big or small, complex or simple, this is the kind of structure that you can wrap around all your options and all your convictions to develop the best solution. But also I bang the drone incessantly for it depends for context. And, you know, I try. And you've got to embrace, obviously, principles and the, and the black and white of the subject. But I do try and stay clear of too much dogmatic approach, because you might teach someone how to great world class bar chart, but can they move beyond that single kind of cookie cutter approach? So I guess that would be the main constant.",
      "id": "ep_37_ut_87"
    },
    {
      "end": 1059180,
      "speaker": "Enrico Bertini",
      "start": 1056920,
      "text": "I'm an ativist. I see.",
      "id": "ep_37_ut_88"
    },
    {
      "end": 1137652,
      "speaker": "Scott Murray",
      "start": 1065220,
      "text": "No, but I see, I think that's a struggle for myself, because we all know that the kind of principles that we teach, they are not necessarily black and white, right? So sometimes I even try to teach something that I call the theory. The visualization. The visualization theory, right? Assuming that there is some kind of theory out there and pretending that we. Pretending there is one. But, you know, I think it's a constant struggle, because from the one hand, if you make everything relative, you also run the risk that students just walk away with nothing. Right. So I'm wondering if it's better to give some clear cut rules and principles and then let them discover when I mean, and get it right 90% of the times, or 80 or even 75, whatever, and then let them discover that there are cases where this just doesn't work, or going through these over and over again, saying, oh, yes, that's a rule, but it's not a rule. Right? That's a theory, but it doesn't hold. Or I really don't know what's the best formula there because I see a risk in both sides. Right?",
      "id": "ep_37_ut_89"
    },
    {
      "end": 1193750,
      "speaker": "Moritz Stefaner",
      "start": 1137676,
      "text": "Of course. And to a degree, I might structure it around the audience. If it's complete beginners, then, you know, that may be approach number one. If it's people got some degree of knowledge, it may be approach number two. But I mean, sure, there are things that you can hang your hat off. You know, we know about best practice in color theory. We know about some of the do's and don'ts, about encoding. But what I found, and this is perhaps reflecting my. My own journey, I guess, not going too deep, too soon in data stories 37, but my own journey, I guess, trying to embrace more and more creativity and the embracing of instinct. Sometimes we still need to allow for that. Otherwise we will end up with dot plots for every single, every single output. So it is absolutely the balance. My thought is the crap.",
      "id": "ep_37_ut_90"
    },
    {
      "end": 1198730,
      "speaker": "Enrico Bertini",
      "start": 1193790,
      "text": "Teach us more a general perspective rather than a tool. Right?",
      "id": "ep_37_ut_91"
    },
    {
      "end": 1243594,
      "speaker": "Moritz Stefaner",
      "start": 1199160,
      "text": "Yeah. So I stay clear, certainly. One day, classes of tools, I do discuss tools. I will profile people, give them a sense of the 1020 most relevant tools in the field right now and when to use them on what projects. You may have seen examples using those tools, but in a given class that I'm facing with, let's say, a class size of 25, you'll have such a blend of people. Some of those people who are excel people, Tableau people, business objects people, and then a few who are illustrator or D3. So if you commit to a certain direction, you'll alienate four fifths of the class for that period.",
      "id": "ep_37_ut_92"
    },
    {
      "end": 1258850,
      "speaker": "Enrico Bertini",
      "start": 1243722,
      "text": "It's just interesting because I think Scott has the exact opposite approach, like starting with a certain tool and then probably trying to make more general points on the concrete examples you work on. Or at least that's how I've always experienced your teaching.",
      "id": "ep_37_ut_93"
    },
    {
      "end": 1304350,
      "speaker": "Andy Kirk",
      "start": 1259150,
      "text": "Yeah, yeah. I was gonna say during Andy talk, I feel in a position of such luxury of getting a whole semester to work with the same group of students and not 7 hours in one day. Yeah, but that tension, that's my biggest ongoing challenge, is this tension between tools and process, principles and history sort of on one side and then the technology on the other side, because the technology can just eat up so much time. So, so much time. And I'm sure, Andy, like, that's part of why you're just excluding it altogether. But, yeah, you could spend days on that.",
      "id": "ep_37_ut_94"
    },
    {
      "end": 1313852,
      "speaker": "Enrico Bertini",
      "start": 1305220,
      "text": "That's often when my workshops go south, is when I say, okay, let's try this together in, like, giphy or Tableau, or let's fire up a text editor.",
      "id": "ep_37_ut_95"
    },
    {
      "end": 1315440,
      "speaker": "Andy Kirk",
      "start": 1313956,
      "text": "It's easy, right?",
      "id": "ep_37_ut_96"
    },
    {
      "end": 1317680,
      "speaker": "Enrico Bertini",
      "start": 1316420,
      "text": "Crash, burn.",
      "id": "ep_37_ut_97"
    },
    {
      "end": 1511120,
      "speaker": "Andy Kirk",
      "start": 1318140,
      "text": "Yeah. Well, yeah, it's so hard. So, I mean, I guess just summarize in my classes. Like, well, I've taught this course at USF three times. I guess next year will be my fourth time. The first time I taught it, it was not technology specific, and I focused entirely on the principles. And all of our classes are project based. Right. So students have to produce some sort of work and design programs. We have critiques, and sometimes we'll be able to exhibit the work at the end of the semester. The first time I taught it, it was not tool specific. I said, use whatever you want. Most people used illustrator because that's where a lot of students were comfortable and because we were doing, like, poster size, that was sort of the output. Second time I taught it, we started out that way, but then I introduced processing because I wanted them to be able to work with a dataset that was larger than, say, 50 data points. So we started working with public data from the city of San Francisco. Make me a graphic or a map or something that tells me about the city, something we couldn't have seen about the city. And so for that we use processing, not in depth, but just to be able to load data in and encode it in some way and spit it out into a PDF and then they can bring it back to illustrator. Last year did an experiment and I tried using D3 from the beginning, and the students were real troopers. I told them it was an experiment in the beginning, but it was quite advanced and they made some fantastic projects in the end. But we ate up so much time on that that we had less time for some of the more important stuff. Because if, you know, you can understand the technology, anybody can figure out the technology. You buy a book, hint, hint or something else and you can figure it out on your own. Right? But it's much harder, I think, to get that one on one feedback and input around the principles and sort of the visual design process. So all that is to say, I think this coming year I'm going to be switching it up again and do a mix of leaving the tools open. So students will probably use illustrator, but coming back to processing for one or two projects just when they're dealing with larger data sets. And I'm even going to go. I mean, I love processing. I love teaching processing. It's so much fun to see students eyes light up when they figure out what they can do with it. But I think I'm just going to hand them some code that I've already written that does the hard part of, like, loading the data in and then all they have to learn is the part that spits it out in some visual form. So I don't know. That's going to be sort of my approach for this next year of not exactly lowering the bar, but sort of limiting the amount of time that gets sucked into the technical discussion. So I think it's really important. That's not why they're there. I mean, we want our students to be able to leave and be able to work in the whatever tool is relevant at the time and pick those things up as quickly as they can. So it's not worth spending a whole semester on.",
      "id": "ep_37_ut_98"
    },
    {
      "end": 1515840,
      "speaker": "Moritz Stefaner",
      "start": 1512140,
      "text": "Scott, do they have any prerequisites coming onto that class?",
      "id": "ep_37_ut_99"
    },
    {
      "end": 1583970,
      "speaker": "Andy Kirk",
      "start": 1516420,
      "text": "Yeah. Yeah. So I should have mentioned, so this class is an upper division elective, so they would all be juniors or seniors. And for the most part, they're choosing to take the class because they actually have other options. So that's usually good news for me. Sometimes people will be in it because it's the only thing that worked for their schedule. But certainly by the time they get to this point, they will have had a number of introductory and kind of intermediate design courses. They would have studied typography, publication design, web design, interactive design. So that's another, I don't know, I guess, hurdle I don't have to deal with is because we know everyone's going to have at least some baseline understanding of design terminology and practice and they're already familiar with how a critique can be structured. So that's really great. I think, like Andy, in your situation, you have people coming in from a variety of professional contexts and I would see that as being much more challenging because you sort of have to, in the first few minutes, establish your baseline terminology. Like, what does it mean when I say this?",
      "id": "ep_37_ut_100"
    },
    {
      "end": 1584430,
      "speaker": "Moritz Stefaner",
      "start": 1584120,
      "text": "Yeah.",
      "id": "ep_37_ut_101"
    },
    {
      "end": 1585862,
      "speaker": "Andy Kirk",
      "start": 1584470,
      "text": "And then we can talk about this.",
      "id": "ep_37_ut_102"
    },
    {
      "end": 1632830,
      "speaker": "Moritz Stefaner",
      "start": 1585966,
      "text": "Yeah. And I think a key part of that is managing expectations before the session in terms of the material, the information about the class, because if you don't manage the sense that we will do this, we won't do that, and this is how it will run. People come on board and they'll just be very quickly, oh, well, this is great, but where's the D3 workshop? And there is a, you know, and certainly in the UK there's a, there's a big demand for visualization training with D3, so stick around after you've finished at the graphical web, Scott. And there'll be plenty of people looking to be kind of swept up on that because I don't know if there are many people in place to actually deliver that in the UK, actually. So, yeah, so it is a challenge.",
      "id": "ep_37_ut_103"
    },
    {
      "end": 1689548,
      "speaker": "Andy Kirk",
      "start": 1633290,
      "text": "Yeah, I mean, it's something like in, like in my book in particular, I deliberately do not address, I mean, except only very briefly, like any of sort of the visual principles of design. It's purely about, here's how to use the technology. And you either sort of understand the principles already of sort of creating good design and good interaction, or you're going to learn that from somewhere else. And so that's why, like Indy, and I'm super excited about your next book. So I've seen like the outline and really excited about that because that addresses sort of the other side. It's like the design principles, but also this process in a tool independent way, which I think is. I mean, this is why this conversation comes up all the time for me, because you can't actually separate the tools from the process. They're an essential part of the process. Talk about painting without the paint press.",
      "id": "ep_37_ut_104"
    },
    {
      "end": 1691652,
      "speaker": "Enrico Bertini",
      "start": 1689684,
      "text": "For certain pieces. Absolutely.",
      "id": "ep_37_ut_105"
    },
    {
      "end": 1711602,
      "speaker": "Andy Kirk",
      "start": 1691716,
      "text": "Yeah, absolutely. But I think, you know, Andy, what I hope you will do is give us some sort of structure framework. Yeah, no pressure. Some sort of framework for thinking about this process, regardless of what we're doing. What tools were you thinking about?",
      "id": "ep_37_ut_106"
    },
    {
      "end": 1746390,
      "speaker": "Enrico Bertini",
      "start": 1711626,
      "text": "But coming back to the interaction point, that's also something in my experience. I love to do interactive visualizations, but what I'm teaching now, I try to force people to rather do one static graphic that is fairly complex, annotated, has a certain depth to it, and when they master that, maybe add like a filter or researching or something like this. But I've seen it also so often that people spend hours and days on a simple dropdown or figuring out when the data has loaded and all that stuff.",
      "id": "ep_37_ut_107"
    },
    {
      "end": 1755580,
      "speaker": "Andy Kirk",
      "start": 1746470,
      "text": "That was me, actually. You probably saw me doing that. I remember that lens flare, right? A couple of times.",
      "id": "ep_37_ut_108"
    },
    {
      "end": 1765720,
      "speaker": "Enrico Bertini",
      "start": 1755700,
      "text": "And it can be much, and the most important thing is really figuring out the story and what you want to do with the data. And that can often work much better in a static graphic.",
      "id": "ep_37_ut_109"
    },
    {
      "end": 1783000,
      "speaker": "Scott Murray",
      "start": 1766020,
      "text": "But I have to say that in my case, I have the luxury to work with students that come from the computer science degree. And of course, I can to some extent assume that they have at least basic knowledge.",
      "id": "ep_37_ut_110"
    },
    {
      "end": 1790564,
      "speaker": "Enrico Bertini",
      "start": 1783740,
      "text": "But even for them, I think I would teach them first to do like a magazine style graphic, because this teaches like.",
      "id": "ep_37_ut_111"
    },
    {
      "end": 1793044,
      "speaker": "Scott Murray",
      "start": 1790652,
      "text": "Yeah, yeah, absolutely. And that's what I do with them.",
      "id": "ep_37_ut_112"
    },
    {
      "end": 1801964,
      "speaker": "Enrico Bertini",
      "start": 1793092,
      "text": "Goes in the tooltip, you know, or. Yeah, there will be a track down for that. Yeah, absolutely. Make a good design decision in order to bring that graphic together. And I think that's the first thing.",
      "id": "ep_37_ut_113"
    },
    {
      "end": 2014306,
      "speaker": "Scott Murray",
      "start": 1802012,
      "text": "Yeah, yeah, but I think so. I think this whole idea of theory versus practice is very important to me because this is one of the things I've been struggling the most in my own course as well. And I have to say, I think my story is similar to Scott's. The first time, I think I gave this course three times already, and the first time I gave it, I went all the way down to the academic side and gave a lot of theory, a lot of principles, all the encoding stuff, lots of perceptual issues and all the rest. And I just. I mean, my student just got lost, honestly. And what I noticed over and over and over again is that all this knowledge doesn't transfer, doesn't transform or turn into being able to build effective visualization. It just doesn't translate. So I think this is a fact that we have to accept. It doesn't matter how many principles you provide, how much theory, how many times you explain this thing. You need to have practice. You need to have your students practicing this theory. Otherwise it's just not going to work. They're not going to absorb these things. And so I think, similarly, I changed my course several times and introduced much, much more practice. And I have to say that for the first time in my last course, I introduced D3 and I didn't let my students choose other languages or frameworks. And this works just perfect, much, much better than I expected. And I think one of the reason is that the students managed to help each other a lot. They mastered the language in a few weeks. I had a student teaching them a D3 seminar that went on for a few weeks, and the feedback from them was great, just great. What I wanted to say is that it's not just a matter of learning the language itself or the technology. I think the advantage of having one single effective tool or language like D3 is the fact that students can very quickly realize something. Rather than doing exclusively on paper, they can quickly sketch something that you can see on a web page. And then I have the opportunity to give them a lot of feedback. And what I found this year is that giving a lot of feedback has a lot of educational impact in them, because rather than. So every time I meet them and they show me an example, or they have shown me what they have done so far, and the thing that they show is on a screen, this gives me the opportunity to give a lot of feedback and a lot of input that is very detailed. And all these details help them making things better. I think there is a lot of value there. So I don't know if you have any similar experience in your courses, but in my case, this worked extremely well because, of course, then when I am in front of an example like this one, I can. Of course, I have many. I found myself restating some theory pieces that are applied to the specific case that they're showing to me through their project. Okay. And this happens over and over again, and I think one on one consultation.",
      "id": "ep_37_ut_114"
    },
    {
      "end": 2018270,
      "speaker": "Enrico Bertini",
      "start": 2014378,
      "text": "Or does that happen like, so my students have in the class?",
      "id": "ep_37_ut_115"
    },
    {
      "end": 2035746,
      "speaker": "Scott Murray",
      "start": 2018570,
      "text": "No, I have groups. So I have groups of students that group together for a project. So normally I have projects with two or maximum three people and I give feedback to the group and this works well.",
      "id": "ep_37_ut_116"
    },
    {
      "end": 2044110,
      "speaker": "Enrico Bertini",
      "start": 2035898,
      "text": "But then they have very patchy knowledge. So if they don't, I don't know. If they don't do a network project, they will learn nothing about networks. Right?",
      "id": "ep_37_ut_117"
    },
    {
      "end": 2064054,
      "speaker": "Scott Murray",
      "start": 2044990,
      "text": "Yeah. But, you know, I think it's much better to do one thing well rather than right. I mean, and of course, I show, I. That's another thing. I try to have some kind of little workshops or seminars where every student has the chance to see the examples, all the other projects.",
      "id": "ep_37_ut_118"
    },
    {
      "end": 2064974,
      "speaker": "Enrico Bertini",
      "start": 2064142,
      "text": "Right, right.",
      "id": "ep_37_ut_119"
    },
    {
      "end": 2075036,
      "speaker": "Scott Murray",
      "start": 2065102,
      "text": "So I think at least twice or three times during the old course, students have a chance to get a chance to see what other students are doing.",
      "id": "ep_37_ut_120"
    },
    {
      "end": 2079092,
      "speaker": "Enrico Bertini",
      "start": 2075148,
      "text": "And do you teach, like, in the beginning, a few hours of basics, or do you just dive right in?",
      "id": "ep_37_ut_121"
    },
    {
      "end": 2130390,
      "speaker": "Scott Murray",
      "start": 2079116,
      "text": "Oh, this is another big change I made because. So this is what I notice is that it takes a long time for students to conceptualize complex visualizations. Okay. And I think this is connected to the literacy problem that Andy was mentioning at the beginning. So I think I. You have to assume that your students are totally illiterate in terms of visualization. Right. And one thing that frustrated me over and over again before this last version of the course is that you teach this whole bunch of theory. You go through lots and lots of examples. Then the first time they try to design something on their own, they come up with a couple of bar charts. They are bar charting everything. Right. But even worse than that. So I have nothing against bar charts, Stephen.",
      "id": "ep_37_ut_122"
    },
    {
      "end": 2132230,
      "speaker": "Andy Kirk",
      "start": 2130810,
      "text": "Kind of sounds like you do.",
      "id": "ep_37_ut_123"
    },
    {
      "end": 2162514,
      "speaker": "Scott Murray",
      "start": 2134330,
      "text": "No, absolutely. I am a big fan of basic charts. I think you have to start from that all the time. But the thing that worries me the most and that I try to address this here, is that actually the bar chart is not the cause, but is an effect of the fact that people start with this mindset that data analysis is about aggregation. Right. So they are aggregating and ranking.",
      "id": "ep_37_ut_124"
    },
    {
      "end": 2162794,
      "speaker": "Enrico Bertini",
      "start": 2162562,
      "text": "Right.",
      "id": "ep_37_ut_125"
    },
    {
      "end": 2238070,
      "speaker": "Scott Murray",
      "start": 2162842,
      "text": "They are aggregating data all the time. So I don't know why exactly, but the way students come to my class is data analysis is done through statistical aggregation. Okay. I think that the real power of visualization, you start seeing it where you disaggregate all these aggregates, and then it starts working really, really well. But it takes a very long time for them to get into this whole concept that you have to show as many details as you can without overwhelming people. Right. And that's pretty hard. That's pretty hard. And that's the way I changed my course at the beginning. So I'm saying that because that was a major change I made in the, the beginning of my course this year. And I provided a lot of examples of visualizations that have lots of details and even invented this whole idea of aggregation twitch. That is basically every time you are confronted with a new data analysis problem, you start by the idea of let's aggregate everything and come up with four numbers. So I don't know if you have anything similar in your courses. I would be curious to hear that.",
      "id": "ep_37_ut_126"
    },
    {
      "end": 2385760,
      "speaker": "Andy Kirk",
      "start": 2238150,
      "text": "But I would say, I mean, I agree with this aggregation twitch term, but I think it's actually not such a bad idea for students to start out with a bar chart. I think it's great to start with tons and tons of examples. Like in my course, usually the first assignment is a super, super short assignment, but just sort of go out into the world and find a handful of infographics, statistical charts, whatever, and find ones you think are interesting or ones you think are successful and ones you think are unsuccessful, and then write about them, critique them, and then sort of tell us about it. So to me, the first step is absolutely sort of building up this library in your head of what the possibilities are, these different visual forms. The second thing in what im going to try this next year is the opposite of what you just said. What I'm going to start with is have the first project be called something like the perfect chart. And we're going to do a very simple, very straightforward chart, but it has to be ultra, ultra precise. Like Stephen Few would approve, Edward Tufte would approve. It's going to be very simple. So this could be a bar chart, a line chart, or something like that. I'm not sure what the format will take. Sort of in order to make it more accessible, I'll start by providing the data set or a couple of possible data sets. They choose. What's most interesting, because that's another thing we haven't talked about yet, is just dealing with data is like this massive learning curve for a lot of people who aren't used to it. So I'll provide the data. It's all clean and everything. And then we can spend the first few weeks of class working on, okay, making a chart by hand in illustrator in very manual fashion, but really getting into the precision. Something that I'm sure my students hate in my classes is I am super. I don't know, what's the word, what's a nice way. I want everything to be there for a reason, right? And if something's there not for a reason, or if something is inconsistent, I'm going to point it out and it's going to be a major problem. Because consistency to me is if you use the wrong color, there are no wrong colors, right? There are bad colors and good colors. If you use bad colors, at least be consistent with those bad colors so that I know what they mean if you're inconsistent with them. Yeah, even if they're really, you know.",
      "id": "ep_37_ut_127"
    },
    {
      "end": 2392756,
      "speaker": "Moritz Stefaner",
      "start": 2386540,
      "text": "It's just removing arbitrary decisions and making everything justified, even if it's bad. You do.",
      "id": "ep_37_ut_128"
    },
    {
      "end": 2394300,
      "speaker": "Andy Kirk",
      "start": 2392788,
      "text": "Yeah, yeah, exactly.",
      "id": "ep_37_ut_129"
    },
    {
      "end": 2396882,
      "speaker": "Moritz Stefaner",
      "start": 2394380,
      "text": "Orange, purple and green. Because dot, dot, dot.",
      "id": "ep_37_ut_130"
    },
    {
      "end": 2397770,
      "speaker": "Andy Kirk",
      "start": 2397036,
      "text": "Yeah.",
      "id": "ep_37_ut_131"
    },
    {
      "end": 2409810,
      "speaker": "Enrico Bertini",
      "start": 2398190,
      "text": "I don't know if this is that you read charts and look for clarity and look like, what's hindering clarity and. Yeah. Like, how do you get it to the point? I think that's one of the things.",
      "id": "ep_37_ut_132"
    },
    {
      "end": 2431258,
      "speaker": "Scott Murray",
      "start": 2410230,
      "text": "I do have the same, actually, but I struggle myself, so it's not clear to me how to explain in detail. No, no. I think I am quite satisfied with the way I'm teaching the basics, the basic charts. But then I think there is a huge gap going from there to the next step.",
      "id": "ep_37_ut_133"
    },
    {
      "end": 2441110,
      "speaker": "Enrico Bertini",
      "start": 2431434,
      "text": "No, but honestly, if you understand visual variables and if you understand visual clarity and, you know, have sort of trained a few muscles there, the principle, then you can do any charge. Right?",
      "id": "ep_37_ut_134"
    },
    {
      "end": 2465214,
      "speaker": "Scott Murray",
      "start": 2441450,
      "text": "I'm not sure. I think the problem that students have, at least in my class, is that they just cannot think of anything that is more complex than that. Right. They don't have the vocabulary that is needed to think about it. Right. So I think this vocabulary building is still a big challenge for me. I don't know how. What's the most effective way to build a vocabulary?",
      "id": "ep_37_ut_135"
    },
    {
      "end": 2472110,
      "speaker": "Enrico Bertini",
      "start": 2465262,
      "text": "So more examples, like, isn't vocabulary something you acquire through exposure to lots of different examples?",
      "id": "ep_37_ut_136"
    },
    {
      "end": 2477894,
      "speaker": "Scott Murray",
      "start": 2472190,
      "text": "Maybe, yeah, but you have limited time also. So what's the best way? What are the best examples for that?",
      "id": "ep_37_ut_137"
    },
    {
      "end": 2606110,
      "speaker": "Moritz Stefaner",
      "start": 2477942,
      "text": "But I think there's two forms of. To me, there's two forms of vocab. The first is, in terms of my sequencing, this is what I cover. First, the vocabulary to express the question that you're trying to answer visually. So in actual words, what interrogations of the data are you trying to facilitate through a graphic? What questions do you want people to be able to answer through a graphic? And I find that, actually, that's a surprisingly large skill gap, that kind of instinctive capability to be an analyst, to think about. What's the interesting nuance of this data, all these different variables. What would be the real insight? And then I create a bridge between the data questions and then a broad gallery of different chart types, obviously demonstrating different encodings, different visual variables, and I give them a structure that will give them a sense of, if I've got this question to answer, let's say I want to show something over time, there is a group of chart types that will do that. And so by showing them, by giving them an awareness of. I think there's about 130 different chart types in this gallery, I'm trying to force them to broaden their visual vocabulary, the different ways that they could tell and show and portray these stories. But the first anchor point is expressing words, what you're trying to show. I want to show people how this ranks compared to that. Okay, well, these chart types may be the way to visually express that. So in a sense, whilst it does tip the hat towards encodings and visual variables, as a concept, it actually takes it in a one day course at least. It actually positions it more at the chart type level rather than as the kind of the real kind of nuts and bolts of the chart device itself, which for my audience, at least in the one day workshops, give them a more immediate, tangible sense of what the game is rather than perhaps a real long term theoretical sense of the task of visual encodings and the kind of balancing acts that goes with that.",
      "id": "ep_37_ut_138"
    },
    {
      "end": 2640398,
      "speaker": "Enrico Bertini",
      "start": 2606890,
      "text": "Yeah. And back we are to the. What do you leave out? I have one question. We also had a tweet from Claire at reliefmap and I was interested in that too. And she asks, are there any tried and tested examples of beginner data with exercises that help to engage and empower? And I think that's somehow the. Yeah, that's key. Like to have really effective exercise. Do you have any exercise you repeatedly do which are effective in your reviews?",
      "id": "ep_37_ut_139"
    },
    {
      "end": 2794550,
      "speaker": "Moritz Stefaner",
      "start": 2640574,
      "text": "Well, there are two that I'll mention for now. I think in a one day session we cover seven different exercises. Okay. But the first one, which I think is similar to Scott in its scope, is we look at three deliberately chosen graphics and they get them to work in groups of threes and fours and say, in the first five or 10 seconds, articulate a word that captures your reaction. Is it good, bad, horrible, ugly, colourful, whatever. And then kind of between that 1st 10 seconds and the next minute, subjectively, do you like it? If it was in the magazine, on the web, would you stick around to engage with it? And then we move the discussion more towards do you feel it adds value to the data? Would it have been better left as a table of numbers and categories? And do you feel it helps you understand the subject? So we're trying to get in this very first exercise a kind of baseline assessment of where they are in terms of their perceptions of form and function. Do they like colorful, trashy infographics? For the first minute, they're kind of seduced by the look of it. And then when you say, well, yeah, okay, but does it help you understand? Oh, no, no, but it's very cool to look at so we're trying to challenge their existing perceptions about what they believe is good and bad. And then the second exercise I'll mention now is this, which takes quite a while to run across a number of sessions in the afternoon, which is kind of forensic design analysis in some respects, kind of semiotic analysis. But I teach five layers of design. So data representation for the chart types, color, interactive, animate, interactivity and animation, annotation and arrangement. And I teach them the concepts of each one individually. And then we look at two graphics as a theme running throughout all the afternoon. And we get them to look through the lens of just that particular theme, one by one, and say, how well have they used colour, for example? What could they have done? In an ideal world, if it's a static, what could they have done for interactive? If it's interactive, how does that work? So, layer by layer, this kind of forensic detail analysis really build this sophistication of a language of critique, which, in a sense, helps them develop their convictions about good and bad. And whilst they're not actually building anything, it gives them this kind of free means beyond the session to look at any visualization and learn from it and have that kind of critical evaluation. So they're two exercises that I feel work really well in terms of the reaction from the people in the group, but also to embed what I've just taught them.",
      "id": "ep_37_ut_140"
    },
    {
      "end": 2802994,
      "speaker": "Enrico Bertini",
      "start": 2794930,
      "text": "Yeah. And often people are really surprised how much you can. Like, once you start dissecting a chart, like how it unfolds, it becomes more and more, instead of less and less.",
      "id": "ep_37_ut_141"
    },
    {
      "end": 2806640,
      "speaker": "Moritz Stefaner",
      "start": 2803122,
      "text": "Absolutely. You have to tick mark pixel resolution. Yeah.",
      "id": "ep_37_ut_142"
    },
    {
      "end": 2848000,
      "speaker": "Enrico Bertini",
      "start": 2807260,
      "text": "I have two more, like, exercises I like to do, or a couple of them, but two that were really quite effective. And I often start with the 45 ways that Santiago Ortiz put together. It's just about visualizing a dataset consisting of two numbers, like 37, 75, something like this. And he came up with 45 ways, and there's even more. And I like to have people, five minutes, come up with as many ways as possible to visualize these two numbers. And people have crazy ideas, you know? And you come up with this as a group of 20 people, easily with 40, usually with more ways of visualizing these numbers.",
      "id": "ep_37_ut_143"
    },
    {
      "end": 2850588,
      "speaker": "Andy Kirk",
      "start": 2849020,
      "text": "Do you give them like a time limit?",
      "id": "ep_37_ut_144"
    },
    {
      "end": 2883674,
      "speaker": "Enrico Bertini",
      "start": 2850644,
      "text": "Yeah. And then I play the jeopardy music and it's big fun. Yeah. Usually we do it on post its and so we can sort them and talk about them. See here we have ten charts and three scatter plots, things like that. And then always the big question is, yeah, but some of them are better than others, right? Or. Yeah, it depends. Maybe if the data set is like, actually represents this and that this one might actually be better, in other cases, not. And you're easily into that discussion of how much is theoretically possible and what's the best solution in a given context.",
      "id": "ep_37_ut_145"
    },
    {
      "end": 2884738,
      "speaker": "Moritz Stefaner",
      "start": 2883802,
      "text": "Yeah, yeah.",
      "id": "ep_37_ut_146"
    },
    {
      "end": 2926210,
      "speaker": "Enrico Bertini",
      "start": 2884874,
      "text": "So I like to do that to get started. And the other one is similar to yours, I think, is to use the same, or to discuss different visualizations of the same data set and give one group. So I did that on the exoplanets dataset because basically everybody has visualized it at some point. There's really good and very different visualizations of the exoplanets dataset out there. And so you might give one group, I don't know, the J. Thorpe one and the Jan Willem Tulp one, and they analyze it independently, but then when they see what the other group says about their work, they suddenly see different stuff because they're already experts, maybe. So that works well, too.",
      "id": "ep_37_ut_147"
    },
    {
      "end": 3065400,
      "speaker": "Andy Kirk",
      "start": 2927070,
      "text": "I'm not sure this is a tried and tested example, but one thing I like to do in my class is do at least one project that is based on personal data where the students like, I love this project of making a map of your social network, and that's not like your Facebook friends, that's your actual social network of people that you've met in real life. So as part of that, they need to create a spreadsheet. Yeah, well, you need some friends to start. So that's the fun part. Like you go out and meet a bunch of people, right? And then you come back and you write down all their names. Yeah, yeah. Years later. Yeah. This course takes a long time. No, but it's like an opportunity to sort of collect information about people and think about. For me, before we even get to the visualization side, this addresses the data side is thinking about how to structure data. Like, okay, well, I have say the requirement is we have to collect 20 to 50 people in your data set. Well, how do I set up that spreadsheet? Okay, I probably have a column with their name and some basic information. Okay, I'm gonna give them their age and where they live and what country they're from or whatever, stuff like that. But I think it's really, I was surprised last semester in particular how into excel my students got, because to me that's sort of like the tedious part is like, okay, you collect the data and you type it up and you clean it up and get it in the right format. But they got really into it doing all kinds of sort of like analysis and getting into formulas and going way beyond what I was expecting. So to me, I think that process of collecting a dataset yourself, whatever it is, is really important. If you're dealing with exoplanet data, well, you didn't collect that yourself, and that's great, but you have to have some sort of understanding that this information came from somewhere. Somebody put a lot of time and energy and money and resources into collecting that information, and hopefully it's accurate or reflective of something that's really going on in the world. So I think it's really nice to start small and then collect your own data that's personally meaningful to you and then start visualizing it and expressing it. And the best projects are the ones where the students get really excited because they actually discovered something about their network that maybe they didn't know before.",
      "id": "ep_37_ut_148"
    },
    {
      "end": 3114620,
      "speaker": "Moritz Stefaner",
      "start": 3065900,
      "text": "I think what's nice about that, Scott, as well, is one of the things I try and cover is the idea that I think actually on the last episode of data stories, Jay Thor particularly, very well, data is not the thing. Data is about the thing. And I think when you, when you get the students, therefore, to collect their own data, there's a, there's an implied greater emotional connection to it. There's a greater meaning. They, they recognize it's not just ones and zeros and data points. It's something. And I guess throughout the training that I do, I'm trying to give people a sense that you, you've always got to have at the back of your mind just design almost like a mood board, a sense of what this thing looks like physically, because when you get to the design stage, you can exploit those cues or clues.",
      "id": "ep_37_ut_149"
    },
    {
      "end": 3116552,
      "speaker": "Andy Kirk",
      "start": 3115400,
      "text": "Pinterest for data.",
      "id": "ep_37_ut_150"
    },
    {
      "end": 3136540,
      "speaker": "Moritz Stefaner",
      "start": 3116656,
      "text": "Pinterest for data, exactly. And I think by getting them to have that kind of personal investment in the data, it just gives them that greater connection, rather than just some bland, let's say, financial data or something that even if it's not bland about the city around them, they might not just immediately connect it, whereas that's a really nice way to go forward, I think.",
      "id": "ep_37_ut_151"
    },
    {
      "end": 3220606,
      "speaker": "Scott Murray",
      "start": 3136660,
      "text": "So this resonates very well with some of the stuff I do in my course as well. So I think this year I implemented a couple of new things. One is so in general, when I assign projects to my student, if I can, I try to have some sort of client for them, which normally works, really. Of course, it's an additional challenge and responsibility, but this gives much more, I think gives a lot more experience in terms of practical experience in terms of how this kind of job looks like when you do it for real, right? So you have a client, this person is providing you data and hopefully some, some big questions, right? Yeah, I think the big question part is really important there because data, I think we discussed this thing many times here. You can do whatever you want with data, right? You can give it as much shape as you want, right? You can torture a data set as much as you like, but what really matters is actually, are you actually providing value to another, to some people? So this person can be yourself if this is personal data, but most likely is somebody else. So I try to do that. Of course, it's not feasible to do it for every single project, but most of my projects look like that. And it's great to have feedback from these people afterwards.",
      "id": "ep_37_ut_152"
    },
    {
      "end": 3221290,
      "speaker": "Moritz Stefaner",
      "start": 3220678,
      "text": "Right?",
      "id": "ep_37_ut_153"
    },
    {
      "end": 3303832,
      "speaker": "Scott Murray",
      "start": 3221830,
      "text": "And another thing I did in my course this year, I had a person. So this was, it just happened, basically. So this person contacted me, she's a lawyer, and told me, hey, look, I have this data set, I'm trying to pursue this specific cause and I need help in looking into this data, okay? And at that time I was, I was teaching, I was, I think, in the middle of my course, and I decided to let these people come in class, show the data set, and say, look, I have this problem. And I assigned this problem as an exercise because the data set was pretty small and trivial, right? So I use this opportunity to let students use and learn Tableau and come up with solutions with Tableau. And it's pretty amazing what they did. I think this whole idea of letting them experience the pain of analyzing data through visualization gives them a sense of what visualization is for. Right? Because regardless whether you are developing visualization tools for data analysis or you are using visualization to communicate for storytelling or similar purposes, you always have to go through some degree of data analysis. Right? And data analysis is really painful to some extent.",
      "id": "ep_37_ut_154"
    },
    {
      "end": 3370610,
      "speaker": "Moritz Stefaner",
      "start": 3303896,
      "text": "Right? I think that's a great point, Enrico. And once again, going back to the previous episode, I thought this was a wonderful way of describing the different perspectives of visualization that Joe mentioned, which was visualisation is both the verb and the noun. And it's not just about visualization as an end product, as a something that you give to people, but it's that process of discovery, process of getting intimately familiar with this raw material that you've got to work with. And I think that's a very important stage that once again, I think is a skill gap out there, being able to tease out the nuggets of wisdom that exist in the data that you've got, if there are any, of course, but also just picking up on the thing you mentioned there about having a kind of client. So my mica class, which is eight weeks, 16 lectures, we had a client in the most recent delivery of the module. And one of the things that I think is very important, which we don't really have a chance to cover in the one day class that I gave, but it's such an important attribute, is the ability to communicate with people and ask questions and interrogate them about the data they've got.",
      "id": "ep_37_ut_155"
    },
    {
      "end": 3372130,
      "speaker": "Scott Murray",
      "start": 3370650,
      "text": "That's huge. That's huge.",
      "id": "ep_37_ut_156"
    },
    {
      "end": 3408080,
      "speaker": "Moritz Stefaner",
      "start": 3372210,
      "text": "And present ideas and get feedback and take on board feedback, and not be precious about the ideas that you've come up with, and translate your ideas into something that is, in layman's terms, accessible to a client. And it's something that I do try and stress on the longer form class I'm doing for Micah. But it's one of the hidden attributes of a good visualization design that I think is very important to get across, that you can have the very best design, a developer who just sits in front of a screen because that's where they're confident, but can't quite engage with a normal person.",
      "id": "ep_37_ut_157"
    },
    {
      "end": 3434300,
      "speaker": "Enrico Bertini",
      "start": 3408540,
      "text": "In my science workshops, this is often the bottom line. Like, get your colors right, for Christ's sake. And let's talk about general communications. Like, how do you, like, how do you fit something into a headline, you know, or like, yeah, why is a chart at a certain place in a paper? And what role does it have in that communication context? And then the details, who cares? You know, it's often like that.",
      "id": "ep_37_ut_158"
    },
    {
      "end": 3487178,
      "speaker": "Scott Murray",
      "start": 3434380,
      "text": "No, this is especially true with scientists, Moritz, because you are totally right here. I have a little experience with a research project we did with a group of climate scientists analyzing a fairly large set of pictures, images coming from their publications. And one thing we notice is that scientists, just most scientists, don't seem to distinguish enough between visualization when they use visualization for their own data analysis purposes, and how to report these results in a paper or presentation to third parties. Right? So they assume that this visual representation is the same or should be the same. Right, which is the worst case, because if you want to go, right. I mean, of course it's the worst case, right? And so they just end up taking screenshots.",
      "id": "ep_37_ut_159"
    },
    {
      "end": 3491722,
      "speaker": "Enrico Bertini",
      "start": 3487234,
      "text": "It's just the last exploratory graphic that it becomes an explanatory one.",
      "id": "ep_37_ut_160"
    },
    {
      "end": 3496770,
      "speaker": "Scott Murray",
      "start": 3491906,
      "text": "And normally, I mean, 99.9% of the time, it's crap.",
      "id": "ep_37_ut_161"
    },
    {
      "end": 3500642,
      "speaker": "Moritz Stefaner",
      "start": 3496890,
      "text": "It's lovely. Excel rom column headers yeah.",
      "id": "ep_37_ut_162"
    },
    {
      "end": 3516150,
      "speaker": "Scott Murray",
      "start": 3500706,
      "text": "There's no curation. Right. Of these images. And I think it would be fantastic to have a course somewhere that is purely kind of like data visualization, whatever. Curation for scientists should be mandatory for any PhD.",
      "id": "ep_37_ut_163"
    },
    {
      "end": 3519850,
      "speaker": "Enrico Bertini",
      "start": 3519110,
      "text": "Please.",
      "id": "ep_37_ut_164"
    },
    {
      "end": 3524462,
      "speaker": "Scott Murray",
      "start": 3522790,
      "text": "And it's not easy at all. Right.",
      "id": "ep_37_ut_165"
    },
    {
      "end": 3555376,
      "speaker": "Enrico Bertini",
      "start": 3524526,
      "text": "Yeah, no, it's true. Yeah. Good stuff, man. I think we need to wrap it up soon. Do we have, is there anything, should we cover anything? Like, how do you do it? One interesting question is always like, how do you continue after you, let's say the bug has bitten you and you have a few basic, you know, enough to start to become dangerous. Like, what do you recommend people, like, which tools to continue with or how to. Yeah, after your course, like, how does it go on?",
      "id": "ep_37_ut_166"
    },
    {
      "end": 3652330,
      "speaker": "Moritz Stefaner",
      "start": 3555448,
      "text": "Well, I think this is where you switch from teaching to learning. And I think obviously there is so much stuff out there for someone to learn themselves. And it's. Obviously it's the blogs, it's the books, it's decorated papers. But I think first and foremost, it's practice. I mean, one of the key tips I give people who come on my public workshops is enter things like the visualizing.org contest. Good, because you've got the data set, you've got a brief, you've got a timeframe. So it's kind of an artificial constraint environment. You've got the potential to upload your work and see what others have done on the same data set. You might win a prize, you might get a special mention, who knows? But the idea that there are so many opportunities out there to practice, practice, practice, because there's always something new. Even in very similar data sets, there's always something new. The shape of data might be different, which just screws up the previous approach or idea. So practice, practice, practice, I think, is the most important thing to get people to develop. Look at other works, critique what they've been doing, do things like narratives online. I mean, it does take a certain amount of courage to put yourself out there on blogs and to say, here's my project, and then to wait for the onslaught of criticism and critique on Twitter. But it is a wonderful way to. Here's a little plug for our friend Jon Schwabish. Go to help me viz, put your work on there. Get feedback on what you've done developing in a non judgmental amnesty setting. So there's a lot of stuff that you can do off your own back. Get a data set, play with it.",
      "id": "ep_37_ut_167"
    },
    {
      "end": 3747014,
      "speaker": "Andy Kirk",
      "start": 3653510,
      "text": "Yeah, I think it's. I totally agree. And I would say, you know, practice is super important, but also that promotional aspect, not that you should be a 100% self promoter, but just getting the work out there. So you need to do the project and then you need to. It has to go on the web somewhere, and it has to be somewhere where people can see it or people will find it. And maybe I find Twitter super helpful for that. But there are a lot of other avenues, blogs and things you could use, and that's partly to engage other people in the conversation, but partly also for you as the person learning to gauge the response to the kind of the work that you're doing. Usually when I get that question more, it's like, well, what should I do now? Should I learn D3 or something? That's like, well, you know, D3 is great for a specific sort of use case, if that's what you're trying to do. But I think it's really more important to find, I don't know, come up with these questions that you want to answer or ideas that you want to explore. And I know that's, like, so unhelpful, right? For students to be like, oh, yeah, I want to find ideas to explore or whatever. It's so vague. But really, those are the most interesting projects. You know, like, and you eventually accumulate sort of this portfolio of these smaller projects, and maybe they get more and more complex over time, and then that sort of leads to you getting into the field in a more professional way, getting a job, whatever it is.",
      "id": "ep_37_ut_168"
    },
    {
      "end": 3776000,
      "speaker": "Enrico Bertini",
      "start": 3747102,
      "text": "Yeah, that's a good point. I mean, that sort of makes me think. So, a friend of mine, he wrote on Twitter, if teaching has changed or if learning about database has changed, maybe now it becomes much more popular. I'm wondering if now, with the mass of people interested in that, like, if it's so easy to get noticed at all at this point in time, because there's so much stuff happening. So if somebody puts out a D3 visualization, do people care? Question mark.",
      "id": "ep_37_ut_169"
    },
    {
      "end": 3786652,
      "speaker": "Moritz Stefaner",
      "start": 3776500,
      "text": "I think there's a lot of space, honestly. Yeah, I do. I think if you've done good work, it will find its way to the field at large, the bloggers, the twitterers amongst us.",
      "id": "ep_37_ut_170"
    },
    {
      "end": 3796422,
      "speaker": "Scott Murray",
      "start": 3786796,
      "text": "Yeah, but it's. It's tough. Andy, I'm not sure I agree with you, honestly. I mean, starting today is much, much tougher. Come on.",
      "id": "ep_37_ut_171"
    },
    {
      "end": 3819452,
      "speaker": "Moritz Stefaner",
      "start": 3796606,
      "text": "Oh, yeah, yeah, yeah. But I still think there is, you know, if you can put yourself out there with, you know, let's say, okay, let's not say in a one off situation, but two or three, if you start to develop a portfolio, it will get found and if you start to put yourself in front of, you know. Right. I mean I, as a blogger, I get a lot of emails saying, here's another project I've done, would you care.",
      "id": "ep_37_ut_172"
    },
    {
      "end": 3821564,
      "speaker": "Enrico Bertini",
      "start": 3819476,
      "text": "To take a look and hotel infographic?",
      "id": "ep_37_ut_173"
    },
    {
      "end": 3823400,
      "speaker": "Moritz Stefaner",
      "start": 3821692,
      "text": "Yeah, yeah.",
      "id": "ep_37_ut_174"
    },
    {
      "end": 3837680,
      "speaker": "Scott Murray",
      "start": 3823940,
      "text": "Let's be more specific. I think it's not hard to have a career in visualization right now because there is a lot of demand, but I think it's hard to become a hyped kind of designer.",
      "id": "ep_37_ut_175"
    },
    {
      "end": 3840288,
      "speaker": "Moritz Stefaner",
      "start": 3838100,
      "text": "Right. So. Yeah, yeah, that's the distinction. Yeah.",
      "id": "ep_37_ut_176"
    },
    {
      "end": 3850872,
      "speaker": "Scott Murray",
      "start": 3840364,
      "text": "There's not a lot of these places are taken already. Yeah. I mean it's not going away. I mean, becoming the next more it's the fanner is not easy at all.",
      "id": "ep_37_ut_177"
    },
    {
      "end": 3854744,
      "speaker": "Enrico Bertini",
      "start": 3850976,
      "text": "I guess it's going to take. There will be space again.",
      "id": "ep_37_ut_178"
    },
    {
      "end": 3950810,
      "speaker": "Andy Kirk",
      "start": 3854872,
      "text": "There are a couple kinds of projects that get people's attention. I think they're sort of like the tech demos that are really cool. Oh look, I invented a new way to create this kind of 3d globe mappy thing and I think a lot of those things have been taken on the web because like JavaScript's just been getting better or getting better and better and browsers have been getting better, D3 is getting better, a number of other rendering tools are getting better. So a lot of these just sort of eye candy. Is this even technically possible, that kind of visualization? I think that's harder to do, but I think in terms of developing these visual stories, loaded word stories, but developing these visual stories that connect with people, I think that's, that's not taken at all. I think Gregor Aisch, who's been on the show, has a really fantastic story. He wasn't coming from a journalism background, but he was just interested in, I think it was political issues, things that were going on in Germany at the time. And he said, hey, I have the skills to parse this data and make maps or make charts and figure out what's going on. And he just started publishing that on his own personal website. Led to this whole fantastic career in kind of what we call data journalism. So yeah, I think there's always new things. Maybe you can't just reproduce a graphic somebody else has already made, but with better colors, that maybe that doesn't count. But you can find some new story and there are new stories every day that could translate into visualizations.",
      "id": "ep_37_ut_179"
    },
    {
      "end": 3956302,
      "speaker": "Enrico Bertini",
      "start": 3952710,
      "text": "Have you seen that Boston underground graphic or the whole site?",
      "id": "ep_37_ut_180"
    },
    {
      "end": 3956782,
      "speaker": "Andy Kirk",
      "start": 3956366,
      "text": "No.",
      "id": "ep_37_ut_181"
    },
    {
      "end": 3964430,
      "speaker": "Enrico Bertini",
      "start": 3956886,
      "text": "Yeah, it's amazing. Yeah. And it's a student project, so that's a point in case maybe for that. There's still space.",
      "id": "ep_37_ut_182"
    },
    {
      "end": 3969430,
      "speaker": "Moritz Stefaner",
      "start": 3964510,
      "text": "Yeah, yeah. Okay, we've covered it.",
      "id": "ep_37_ut_183"
    },
    {
      "end": 3971210,
      "speaker": "Enrico Bertini",
      "start": 3969510,
      "text": "Accepted. Accepted.",
      "id": "ep_37_ut_184"
    },
    {
      "end": 3975158,
      "speaker": "Moritz Stefaner",
      "start": 3971550,
      "text": "That's fine. We've put the topic to bed.",
      "id": "ep_37_ut_185"
    },
    {
      "end": 3975918,
      "speaker": "Enrico Bertini",
      "start": 3975294,
      "text": "Yeah.",
      "id": "ep_37_ut_186"
    },
    {
      "end": 3978646,
      "speaker": "Moritz Stefaner",
      "start": 3976054,
      "text": "Do we have all the listeners?",
      "id": "ep_37_ut_187"
    },
    {
      "end": 3988530,
      "speaker": "Enrico Bertini",
      "start": 3978838,
      "text": "Excellent. Do we have more? Like, shall we. We have a few more questions on Twitter, but I don't have one handy. Does anybody have one they want to answer or how does it look?",
      "id": "ep_37_ut_188"
    },
    {
      "end": 4002810,
      "speaker": "Moritz Stefaner",
      "start": 3990710,
      "text": "Well, there's questions. What are the three most important things to remember when communicating this? I mean, this. I think most of the questions go beyond just the scope of this episode in general. But.",
      "id": "ep_37_ut_189"
    },
    {
      "end": 4016830,
      "speaker": "Scott Murray",
      "start": 4004990,
      "text": "I like that for some. For someone doesn't believe in database, how do we engage them? I am working. I'm working towards database adoption.",
      "id": "ep_37_ut_190"
    },
    {
      "end": 4019290,
      "speaker": "Moritz Stefaner",
      "start": 4017290,
      "text": "So it's evangelizing, I think.",
      "id": "ep_37_ut_191"
    },
    {
      "end": 4023578,
      "speaker": "Andy Kirk",
      "start": 4019410,
      "text": "I was gonna say, I think that. Enrico, you're always asking for success stories, right?",
      "id": "ep_37_ut_192"
    },
    {
      "end": 4023978,
      "speaker": "Scott Murray",
      "start": 4023674,
      "text": "Yeah.",
      "id": "ep_37_ut_193"
    },
    {
      "end": 4034856,
      "speaker": "Andy Kirk",
      "start": 4024034,
      "text": "We should just make like a compilation of success stories, visualizations that really. Yeah. That had some huge impact on the world or solved a particular problem. Like, that's how you can convert to people.",
      "id": "ep_37_ut_194"
    },
    {
      "end": 4041272,
      "speaker": "Scott Murray",
      "start": 4034968,
      "text": "Yeah, but you try that, right? Yeah. I think that I know what started.",
      "id": "ep_37_ut_195"
    },
    {
      "end": 4044288,
      "speaker": "Enrico Bertini",
      "start": 4041336,
      "text": "His foundation because of a chart.",
      "id": "ep_37_ut_196"
    },
    {
      "end": 4047416,
      "speaker": "Moritz Stefaner",
      "start": 4044464,
      "text": "Hans Rosling did this great presentation a few years ago.",
      "id": "ep_37_ut_197"
    },
    {
      "end": 4065274,
      "speaker": "Scott Murray",
      "start": 4047568,
      "text": "So one shortcut is to just don't work with these people. There are so many people who are interested in this. If the best solution is just eating, ignore people who are not interested in this, who cares? There are so many other clients out.",
      "id": "ep_37_ut_198"
    },
    {
      "end": 4066266,
      "speaker": "Moritz Stefaner",
      "start": 4065282,
      "text": "There that get to us.",
      "id": "ep_37_ut_199"
    },
    {
      "end": 4067322,
      "speaker": "Andy Kirk",
      "start": 4066378,
      "text": "That's wonderful.",
      "id": "ep_37_ut_200"
    },
    {
      "end": 4070026,
      "speaker": "Scott Murray",
      "start": 4067426,
      "text": "Right. But no, I mean, a few.",
      "id": "ep_37_ut_201"
    },
    {
      "end": 4071626,
      "speaker": "Andy Kirk",
      "start": 4070138,
      "text": "They have bigger problems. Right.",
      "id": "ep_37_ut_202"
    },
    {
      "end": 4115510,
      "speaker": "Scott Murray",
      "start": 4071698,
      "text": "A couple of months ago, I guess I gave a talk here at NYU at the center of data science, and in the middle of my talk, I started saying something along the line. We don't have lots of success stories out there, so we still have to demonstrate that visualization has lots of impacts. And I think the word that I use is, people didn't make major discoveries with this. Right. And then one of the professors raised his hand and said, no, that's not true. I mean, I work in biology, and I could give you, I don't know how many examples of discoveries that have been made in biology through visualization. So. And I. I think it's just a matter.",
      "id": "ep_37_ut_203"
    },
    {
      "end": 4121662,
      "speaker": "Enrico Bertini",
      "start": 4115550,
      "text": "Because Victor makes like ten discoveries a day. Like, you know, it's more just a.",
      "id": "ep_37_ut_204"
    },
    {
      "end": 4139170,
      "speaker": "Scott Murray",
      "start": 4121686,
      "text": "Matter of defining exactly what is. At what level we define discovery and success story, and also a matter of making sure that there is a place where these success stories are collected. And because I'm sure there are plenty of them. It's just.",
      "id": "ep_37_ut_205"
    },
    {
      "end": 4142553,
      "speaker": "Andy Kirk",
      "start": 4140329,
      "text": "Yeah, we need John to start. Helped me viz.",
      "id": "ep_37_ut_206"
    },
    {
      "end": 4146345,
      "speaker": "Scott Murray",
      "start": 4142601,
      "text": "Yeah, that's an excellent story.",
      "id": "ep_37_ut_207"
    },
    {
      "end": 4147433,
      "speaker": "Andy Kirk",
      "start": 4146377,
      "text": "It works really well.",
      "id": "ep_37_ut_208"
    },
    {
      "end": 4150057,
      "speaker": "Scott Murray",
      "start": 4147521,
      "text": "Yeah, yeah, yeah.",
      "id": "ep_37_ut_209"
    },
    {
      "end": 4206067,
      "speaker": "Moritz Stefaner",
      "start": 4150073,
      "text": "I mean, just one little story was I did a class at the start this year and a lady who came along to the class suffers from diabetes. And she was inspired just by the subject, not by me. You never know to stick it into a line chart. The readings every day that she took from the nuts and bolts. But yeah, she plotted the data into line chart and she saw this pattern that evidence why she felt so bad at certain times of day and after certain things like going to the gym or certain diets. It's a very small scale success story, but wouldn't have been articulated unless it was actually sought from her, which I did at the end of the class. So I think the problem is that there will inevitably be success stories. It's just that we're not there to witness it or to even get the person to realize that it is as a result of.",
      "id": "ep_37_ut_210"
    },
    {
      "end": 4220724,
      "speaker": "Enrico Bertini",
      "start": 4206163,
      "text": "Doesn't change the Enrico should make that webpage with the top ten life saving data visualization. Last night at Whiskey saved my life.",
      "id": "ep_37_ut_211"
    },
    {
      "end": 4224052,
      "speaker": "Moritz Stefaner",
      "start": 4220892,
      "text": "Yeah, there's a song to write there as well.",
      "id": "ep_37_ut_212"
    },
    {
      "end": 4231916,
      "speaker": "Enrico Bertini",
      "start": 4224156,
      "text": "Exactly. A whole bull group on the horizon. Ok, I think we need to wrap it up.",
      "id": "ep_37_ut_213"
    },
    {
      "end": 4233116,
      "speaker": "Moritz Stefaner",
      "start": 4232068,
      "text": "Yes, yes.",
      "id": "ep_37_ut_214"
    },
    {
      "end": 4241100,
      "speaker": "Enrico Bertini",
      "start": 4233268,
      "text": "Over time, our broadcast time has evaporated as usual. As usual. Thanks so much. Fantastic.",
      "id": "ep_37_ut_215"
    },
    {
      "end": 4241724,
      "speaker": "Andy Kirk",
      "start": 4241140,
      "text": "Thank you.",
      "id": "ep_37_ut_216"
    },
    {
      "end": 4252224,
      "speaker": "Enrico Bertini",
      "start": 4241852,
      "text": "I mean, we can do this once every year. I don't think the topic will go away and it will be a challenge, but I really appreciate it. Put good stuff.",
      "id": "ep_37_ut_217"
    },
    {
      "end": 4253104,
      "speaker": "Moritz Stefaner",
      "start": 4252352,
      "text": "Thank you.",
      "id": "ep_37_ut_218"
    },
    {
      "end": 4253840,
      "speaker": "Enrico Bertini",
      "start": 4253232,
      "text": "Thanks all.",
      "id": "ep_37_ut_219"
    },
    {
      "end": 4254600,
      "speaker": "Andy Kirk",
      "start": 4253880,
      "text": "Thank you so much.",
      "id": "ep_37_ut_220"
    },
    {
      "end": 4256288,
      "speaker": "Scott Murray",
      "start": 4254640,
      "text": "Bye guys. Thank you.",
      "id": "ep_37_ut_221"
    },
    {
      "end": 4257780,
      "speaker": "Moritz Stefaner",
      "start": 4256384,
      "text": "Goodbye. Bye guys.",
      "id": "ep_37_ut_222"
    }
  ],
  "confidence": 0.920575581923749,
  "audio_duration": 4266,
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_status_code": null,
  "webhook_auth": false,
  "webhook_auth_header_name": null,
  "speed_boost": false,
  "auto_highlights_result": null,
  "auto_highlights": false,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_audio_quality": null,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "content_safety": false,
  "iab_categories": true,
  "content_safety_labels": {
    "status": "unavailable",
    "results": [],
    "summary": {}
  },
  "language_detection": false,
  "language_detection_threshold": null,
  "language_confidence": null,
  "custom_spelling": null,
  "throttled": false,
  "auto_chapters": true,
  "summarization": false,
  "summary_type": null,
  "summary_model": null,
  "custom_topics": false,
  "topics": [],
  "speech_threshold": null,
  "speech_model": "best",
  "chapters": [
    {
      "summary": "Enrico: Summer is here, apparently. We had another edition of the data cuisine workshop. And I just came back from a week of Barcelona. The documentation for the workshop is forthcoming. It will all be up on data cuisine. net dot.",
      "gist": "Data cuisine workshop in Barcelona",
      "headline": "Enrico: Summer is here, apparently. I love it. How about you?",
      "start": 22160,
      "end": 192970,
      "id": "ep_37_ch_0"
    },
    {
      "summary": "How do you actually teach data visualization? It's the hardest thing, right? And it's so important to me. Nobody tells you how to teach. At least not here. So we invited two people who are winging it pretty professionally.",
      "gist": "How to teach data visualization 1.0",
      "headline": "How do you actually teach data visualization? That's huge question",
      "start": 195150,
      "end": 302152,
      "id": "ep_37_ch_1"
    },
    {
      "summary": "And we have Scott Murray here. 1st time caller, many time listener, something like that. We met already on visualizing Q and A. It just feels like I've been here before. There's so many challenges.",
      "gist": "Interview",
      "headline": "Scott Murray: Excited to be here, first time caller",
      "start": 302336,
      "end": 344836,
      "id": "ep_37_ch_2"
    },
    {
      "summary": "Scott Bennett teaches information visualization at the University of San Francisco. Bennett also has a book out about D3, a free open source language for artists and designers. Bennett is interested in experimenting with new models for education.",
      "gist": "Teaching in the Design Program",
      "headline": "Scott Miller teaches information visualization at the University of San Francisco",
      "start": 344988,
      "end": 575130,
      "id": "ep_37_ch_3"
    },
    {
      "summary": "Andy has been a data visualization freelancer since October 2012. His primary focus is on data visualization training courses. He is also doing consultancy work, design work and has written a book. Just last week he was approved for book number two.",
      "gist": "A Few Words About Data Visualization Freelancer",
      "headline": "Andy has been a data visualization freelancer since October 2012",
      "start": 576430,
      "end": 676200,
      "id": "ep_37_ch_4"
    },
    {
      "summary": "I'm also on a research project at the University of Leeds looking at visualization literacy. We're looking at how well equipped people are at consuming and making sense of visualizations. What we can do to address the gaps that people need.",
      "gist": "Vinational Literacy",
      "headline": "University of Leeds is looking at visualization literacy among everyday people",
      "start": 677500,
      "end": 734614,
      "id": "ep_37_ch_5"
    },
    {
      "summary": "Each of us has at least some experience teaching visualization. Andy is teaching to computer science students. Scott is teaching mainly to design students. Moritz is also teaching from time to time. The format I like the most are actually three day or two day workshops.",
      "gist": "Teaching Visualization",
      "headline": "Each of us has at least some experience teaching visualization",
      "start": 734702,
      "end": 794680,
      "id": "ep_37_ch_6"
    },
    {
      "summary": "The great struggle from experience is what to leave out. What can you fit into a day that really captures the essence of visualization. Trying to find a way to bridge the gap between the top people and everyday people. There have been 101 different versions of the course in two and a half years.",
      "gist": "The Struggle to Teach Visualization",
      "headline": "When you teach visualization, how is it to teach visualization in your experience",
      "start": 797100,
      "end": 988398,
      "id": "ep_37_ch_7"
    },
    {
      "summary": "Teaching critical thinking wrapped up in a workflow. My biggest ongoing challenge is this tension between tools and principles. Sometimes I even try to teach something that I call the theory. The visualization theory. But it's a constant struggle.",
      "gist": "What are the constants in data visualization classes?",
      "headline": "What are the constants when you teach data visualization? Andy: Structure and tools",
      "start": 988414,
      "end": 1459970,
      "id": "ep_37_ch_8"
    },
    {
      "summary": "I mean, I love processing. It's so much fun to see students eyes light up when they figure out what they can do with it. But I think I'm just going to hand them some code that I've already written that does the hard part of loading the data in. We want students to be able to leave and work in whatever tool is relevant at the time.",
      "gist": "Pushing the technical discussion",
      "headline": "I mean, I love processing. It's so much fun to see students eyes light up",
      "start": 1460990,
      "end": 1511120,
      "id": "ep_37_ch_9"
    },
    {
      "summary": "The class is an upper division elective. By the time they get to this point, they will have had a number of introductory and kind of intermediate design courses. A key part of that is managing expectations before the session. What I hope you will do is give us some sort of structure framework.",
      "gist": "The challenge of teaching d3",
      "headline": "Scott: Managing expectations before the session is key",
      "start": 1512140,
      "end": 1711602,
      "id": "ep_37_ch_10"
    },
    {
      "summary": "The most important thing is really figuring out the story and what you want to do with the data. That can often work much better in a static graphic. Make a good design decision in order to bring that graphic together.",
      "gist": "Interactivity in Graphic Design",
      "headline": "I love to do interactive visualizations, but what I'm teaching now",
      "start": 1711626,
      "end": 1805884,
      "id": "ep_37_ch_11"
    },
    {
      "summary": "I think this whole idea of theory versus practice is very important to me. It doesn't matter how many principles you provide, how much theory, you need to have practice. For the first time in my last course, I introduced D3 and I didn't let my students choose other languages or frameworks. This works much better than I expected.",
      "gist": "Ideas of theory vs practice in d3",
      "headline": "I think this whole idea of theory versus practice is very important to me",
      "start": 1806052,
      "end": 2323170,
      "id": "ep_37_ch_12"
    },
    {
      "summary": "Dealing with data is like this massive learning curve for a lot of people who aren't used to it. This vocabulary building is still a big challenge for me. What's the most effective way to build a vocabulary?",
      "gist": "Building a Chart Vocabulary",
      "headline": "Learning to deal with data is like a massive learning curve for many people",
      "start": 2323630,
      "end": 2607314,
      "id": "ep_37_ch_13"
    },
    {
      "summary": "In a one day session we cover seven different exercises. I teach five layers of design. I like to have people, five minutes, come up with as many ways as possible to visualize a dataset. And often people are really surprised how much you can.",
      "gist": "In the Elevator With",
      "headline": "Do you have any exercises you repeatedly do which are effective in your reviews",
      "start": 2607362,
      "end": 3065400,
      "id": "ep_37_ch_14"
    },
    {
      "summary": "Enrico: When you get students to collect their own data, there's an implied greater emotional connection to it. I think this whole idea of letting them experience the pain of analyzing data through visualization gives them a sense of what visualization is for.",
      "gist": "Data stories: Design for Data",
      "headline": "Getting students to collect their own data gives them a greater emotional connection",
      "start": 3065900,
      "end": 3345690,
      "id": "ep_37_ch_15"
    },
    {
      "summary": "Most scientists don't distinguish between visualization and how to report these results in a paper or presentation to third parties. Curation for scientists should be mandatory for any PhD. And it would be fantastic to have a course somewhere that is purely kind of like data visualization.",
      "gist": "In the Elevator With Scientists",
      "headline": "Moritz: Communication is key to good data visualization design",
      "start": 3346050,
      "end": 3535534,
      "id": "ep_37_ch_16"
    },
    {
      "summary": "There is so much stuff out there for someone to learn themselves. First and foremost, it's practice. Enter things like the visualizing. org contest. Look at other works, critique what they've been doing. Get feedback on what you've done developing in a non judgmental setting.",
      "gist": "What to do after your MATLAB course?",
      "headline": "One interesting question is always like, how do you continue after your course",
      "start": 3535622,
      "end": 3902428,
      "id": "ep_37_ch_17"
    },
    {
      "summary": "There are new stories every day that could translate into visualizations. Have you seen that Boston underground graphic or the whole site? No. There's still space.",
      "gist": "There's Still Space for Data Visualizations",
      "headline": "There are new stories every day that could translate into visualizations",
      "start": 3902484,
      "end": 3975158,
      "id": "ep_37_ch_18"
    },
    {
      "summary": "Enrico: We should just make like a compilation of success stories, visualizations that really. had some huge impact on the world or solved a particular problem. How do we engage people who don't believe in database adoption?",
      "gist": "Data Science: The 3 Key Things",
      "headline": "What are the three most important things to remember when communicating this topic",
      "start": 3975294,
      "end": 4257780,
      "id": "ep_37_ch_19"
    }
  ],
  "disfluencies": false,
  "entity_detection": false,
  "sentiment_analysis": false,
  "sentiment_analysis_results": null,
  "entities": null,
  "speakers_expected": null,
  "summary": null,
  "custom_topics_results": null,
  "is_deleted": null,
  "episode_num": "37",
  "episode_metadata": {
    "speakers": [
      "Moritz Stefaner",
      "Enrico Bertini",
      "Scott Murray",
      "Andy Kirk"
    ],
    "WPid": "192",
    "url": "https://datastori.es/podlove/file/417/s/feed/c/mp3/datastories-37.mp3",
    "episode_title": "The Challenge of Teaching Visualization w/ Scott Murray and Andy Kirk"
  }
}