{
  "id": "1ff19b94-eb4e-4cd9-afdd-8133013e3acc",
  "language_model": "assemblyai_default",
  "acoustic_model": "assemblyai_default",
  "language_code": "en_us",
  "status": "completed",
  "audio_url": "https://datastori.es/podlove/file/210/s/feed/c/mp3/Datastories-04.mp3",
  "utterances": [
    {
      "end": 10688,
      "speaker": "Enrico Bertini",
      "start": 10120,
      "text": "Hi everyone.",
      "id": "ep_4_ut_0"
    },
    {
      "end": 19970,
      "speaker": "Moritz Stefaner",
      "start": 10790,
      "text": "Enrico here from data stories together with Moritz. And we have Andy with us today. Hi, Andy and Moritz. How are you?",
      "id": "ep_4_ut_1"
    },
    {
      "end": 21406,
      "speaker": "Enrico Bertini",
      "start": 20270,
      "text": "Good evening.",
      "id": "ep_4_ut_2"
    },
    {
      "end": 22530,
      "speaker": "Andy Kirk",
      "start": 21598,
      "text": "Hi there.",
      "id": "ep_4_ut_3"
    },
    {
      "end": 28532,
      "speaker": "Moritz Stefaner",
      "start": 23910,
      "text": "Great to have you here. You are the first guest of data stories.",
      "id": "ep_4_ut_4"
    },
    {
      "end": 35012,
      "speaker": "Enrico Bertini",
      "start": 28716,
      "text": "Absolutely. It's a great privilege. I expect a tie as a mentor in the post this evening.",
      "id": "ep_4_ut_5"
    },
    {
      "end": 46320,
      "speaker": "Moritz Stefaner",
      "start": 35116,
      "text": "Yeah. So just for those of you who don't know who handy is, Andy Kirk from Visualizingdata.com. yeah.com.",
      "id": "ep_4_ut_6"
    },
    {
      "end": 49636,
      "speaker": "Andy Kirk",
      "start": 46900,
      "text": "And he's a man of many talents.",
      "id": "ep_4_ut_7"
    },
    {
      "end": 51388,
      "speaker": "Moritz Stefaner",
      "start": 49708,
      "text": "I would say of many talents.",
      "id": "ep_4_ut_8"
    },
    {
      "end": 55236,
      "speaker": "Andy Kirk",
      "start": 51484,
      "text": "Many talents. But what always stood out to me.",
      "id": "ep_4_ut_9"
    },
    {
      "end": 56004,
      "speaker": "Moritz Stefaner",
      "start": 55308,
      "text": "Yeah, yeah.",
      "id": "ep_4_ut_10"
    },
    {
      "end": 65080,
      "speaker": "Andy Kirk",
      "start": 56092,
      "text": "Many talents. But what stood out, he's from the UK and he's not David McCandless. And that's quite something if you think about it.",
      "id": "ep_4_ut_11"
    },
    {
      "end": 70576,
      "speaker": "Moritz Stefaner",
      "start": 65240,
      "text": "Okay, so we invited him. Not because he has one of the most famous blogs about visualization.",
      "id": "ep_4_ut_12"
    },
    {
      "end": 71448,
      "speaker": "Andy Kirk",
      "start": 70728,
      "text": "No, no, no.",
      "id": "ep_4_ut_13"
    },
    {
      "end": 79304,
      "speaker": "Moritz Stefaner",
      "start": 71504,
      "text": "Not because he is one of the few who is giving wonderful training about visualization. But only because.",
      "id": "ep_4_ut_14"
    },
    {
      "end": 81784,
      "speaker": "Andy Kirk",
      "start": 79352,
      "text": "Nor him being an animal on the dance floor.",
      "id": "ep_4_ut_15"
    },
    {
      "end": 86300,
      "speaker": "Enrico Bertini",
      "start": 81872,
      "text": "Yeah, but only for 1 minute.",
      "id": "ep_4_ut_16"
    },
    {
      "end": 95696,
      "speaker": "Moritz Stefaner",
      "start": 88640,
      "text": "But only because we wanted a more exotic voice than ours. So today we are.",
      "id": "ep_4_ut_17"
    },
    {
      "end": 97900,
      "speaker": "Enrico Bertini",
      "start": 95768,
      "text": "Here we are. This is my gift to the world.",
      "id": "ep_4_ut_18"
    },
    {
      "end": 101888,
      "speaker": "Moritz Stefaner",
      "start": 98560,
      "text": "So today we have a true British, exotic voice.",
      "id": "ep_4_ut_19"
    },
    {
      "end": 104928,
      "speaker": "Andy Kirk",
      "start": 101984,
      "text": "Yeah, you can stop it now with the accent. It's fine.",
      "id": "ep_4_ut_20"
    },
    {
      "end": 109980,
      "speaker": "Enrico Bertini",
      "start": 105104,
      "text": "I'll stop putting it on now. Yeah. I hope Ben Hoskin likes it.",
      "id": "ep_4_ut_21"
    },
    {
      "end": 144370,
      "speaker": "Moritz Stefaner",
      "start": 112080,
      "text": "Okay, so I think the episode will be pretty much about your experience at Malofiej 20. And I will basically take the part of the listener and trying to ask some questions to you guys because we didn't discuss about it so far. So I'm really curious to hear what you have to say. It looks like it was a wonderful, beautiful event. All the things I read around were really enthusiastic. So I'm really looking forward to hear what you have to say.",
      "id": "ep_4_ut_22"
    },
    {
      "end": 149590,
      "speaker": "Andy Kirk",
      "start": 146010,
      "text": "Yeah. So, Andy, you want to start?",
      "id": "ep_4_ut_23"
    },
    {
      "end": 222614,
      "speaker": "Enrico Bertini",
      "start": 150090,
      "text": "Yeah, sure. Well, I guess the first thing is for those who don't know, melofiege or Malofiej Malofiej. I came across it probably about three years ago, four years ago. And as I wrote in my blog post the other day, it was really through people like Chiki Esteban and Gert Nielsen who were often talking about the build up to it and then the reflections. And it all seemed like a really, really prestigious event and something that I guess in many ways the data of this field is missing. But given that it was such a parallel subject in many ways, parallel context of infographics and print online journalism, publishing world. So I kind of always just sort of paid attention when it came up, but not much more then obviously I think it was in 2009 when the famous string graph, the Ebon flow of movie takings, won the award. And that seemed to trigger quite a lot of debate, a lot of polarized opinions. I think that's when my awareness sort of moved on to a new level.",
      "id": "ep_4_ut_24"
    },
    {
      "end": 244970,
      "speaker": "Andy Kirk",
      "start": 222662,
      "text": "So I think that was always also when sort of the print and the online world clashed a bit. For the first time, I think before, it was like, yeah, everybody that does his thing. And there was like this very, let's say, generative design, coding inspired infographic that won the prestigious infographics award. I also remember these discussions around that.",
      "id": "ep_4_ut_25"
    },
    {
      "end": 269246,
      "speaker": "Enrico Bertini",
      "start": 245090,
      "text": "That's right. And so for me, when I got the invite from Javier before Christmas, it was a wonderful kind of honor and privilege to be invited. And I have to say it was just a thoroughly wonderful event. But what's your experience, Mauritsh, in terms of the build up to it? Obviously you mentioned that you've had some exposure through the ebb and flow diagram.",
      "id": "ep_4_ut_26"
    },
    {
      "end": 332878,
      "speaker": "Andy Kirk",
      "start": 269398,
      "text": "Yeah, but I think before I also wasn't really aware of what it is and what it's about. So it is basically a world summit for the infographics world, and everybody who has a big name comes there. And as you said, it's true, there is nothing like that in the database field. And it's a pity in the end, and they've been doing it now for 20 years. So there's this rich tradition of the whole event. They show us a lot of old photos and you know, how in the beginning they would, like, do the first presentation with actual, you know, photo slides, you know, of course, a real slideshow, not a metaphorical one. And of course, at that time, everything was hand drawn, hand illustrated. So the whole event carries this rich tradition of infographics that we really lack as the digital guys and I, it was very educating just to, you know, I mean, that's already now the summary, sort of. But for me, it was very educating to learn about this world. Before, I wasn't really aware that much of this rich tradition in infographics.",
      "id": "ep_4_ut_27"
    },
    {
      "end": 347550,
      "speaker": "Moritz Stefaner",
      "start": 332974,
      "text": "Can you, can you guys tell me a little bit about how it is organized? Is it basic? I know that there is this whole thing around judging a very large number of entries, but do you also have keynotes or anything similar there?",
      "id": "ep_4_ut_28"
    },
    {
      "end": 439350,
      "speaker": "Enrico Bertini",
      "start": 347670,
      "text": "Yeah, I mean, they're the. The organization is very much a voluntary process. Javier Herrier, I think that's how you pronounce his surname. He kind of leads on the organization, and he's got a couple of colleagues, Alvaro and Angela, who assist, and I think that kind of voluntary sort of family feel is something that permeates across the whole event. Really. It's very rooted and very welcoming and warm as an event. But the, the event kicks off on the Saturday evening where all the judges come for a dinner, kind of a welcome dinner, and Javier introduces the rules of the contest and the schedule for the week ahead. And then it kind of parts off into two routes. So on one hand you've got the judges working on the assessment of what were this year, 1500 entries, and then on the other track you've got four of the top infographics, guys. This year was Alberto Cairo, Jeff McGee, Juan Velasco and John Grimwade. And they take a group of about 20 students through a two day workshop and give them a really rich experience and education in how to maximize the work there. So then it all kind of comes back together when the judging is finished and where the, the show do tell, as it's called, workshop finishes, then the summit or the conference begins on the Wednesday evening and there's sort of two days of keynotes.",
      "id": "ep_4_ut_29"
    },
    {
      "end": 483536,
      "speaker": "Andy Kirk",
      "start": 441370,
      "text": "And then in the end there's a big celebration for the prizes. And there was also, because we had the 20th anniversary, some special prizes and some special speeches and so on. So the whole week was packed. You know, we were judging, we were. There was the workshop, there was the talks, there was the celebrations. And in between you have to eat like lots of meat because it's in Nevada, which is like a rich and very meat heavy area in Spain. And then, I mean, the advanced conditions are also that. I mean, you judge all day. I looked at, I think, almost 400 online entries and, you know, you have to judge all of them. So you can just briefly click, but you have to look at all of them.",
      "id": "ep_4_ut_30"
    },
    {
      "end": 484368,
      "speaker": "Enrico Bertini",
      "start": 483568,
      "text": "Immerse yourself.",
      "id": "ep_4_ut_31"
    },
    {
      "end": 504816,
      "speaker": "Andy Kirk",
      "start": 484504,
      "text": "Yeah, exactly. So you do that all day. You have lunch at two until four, you work until eight, and then you go for dinner at ten, eat heaps of meat, drink lots of wine, get lost in like, interesting but long discussions, come back totally destroyed. And next day you start again at eight.",
      "id": "ep_4_ut_32"
    },
    {
      "end": 511672,
      "speaker": "Enrico Bertini",
      "start": 504888,
      "text": "Well, no, you come back and then you do 2 hours on your own presentation because you realize you're not ready and there's no doubt.",
      "id": "ep_4_ut_33"
    },
    {
      "end": 521410,
      "speaker": "Andy Kirk",
      "start": 511696,
      "text": "And you answer emails and work on your presentation. Exactly. We did like three or four days in a row and we were totally destroyed afterwards, basically.",
      "id": "ep_4_ut_34"
    },
    {
      "end": 525450,
      "speaker": "Moritz Stefaner",
      "start": 522310,
      "text": "So every judge is invited also for a talk?",
      "id": "ep_4_ut_35"
    },
    {
      "end": 537610,
      "speaker": "Andy Kirk",
      "start": 527070,
      "text": "Yes, yes. That's the interesting thing. So every speaker is a judge? Every judge is a speaker. And that, I mean, that's interesting. I haven't seen a conference like that before, I must say. Yeah.",
      "id": "ep_4_ut_36"
    },
    {
      "end": 547070,
      "speaker": "Enrico Bertini",
      "start": 538110,
      "text": "You've also got this because all the judges are speakers. You've also built up this sort of week long camaraderie with people.",
      "id": "ep_4_ut_37"
    },
    {
      "end": 550194,
      "speaker": "Andy Kirk",
      "start": 547850,
      "text": "And so I call it Stockholm syndrome.",
      "id": "ep_4_ut_38"
    },
    {
      "end": 575280,
      "speaker": "Enrico Bertini",
      "start": 550362,
      "text": "Yes. You feel sympathy towards your kidnappers in ways that you wouldn't normally normally feel, but, yeah, you're all really, really interested in each other's work and backgrounds, and you genuinely want to stay there and listen to everybody's talks rather than arriving cold and going straight to a conference and perhaps picking the ones that you would have, perhaps skip. But this was, you know, it was something that built up a kind of crescendo of interest, really.",
      "id": "ep_4_ut_39"
    },
    {
      "end": 577776,
      "speaker": "Andy Kirk",
      "start": 575320,
      "text": "Yeah. And was very personal. Definitely. And.",
      "id": "ep_4_ut_40"
    },
    {
      "end": 578472,
      "speaker": "Enrico Bertini",
      "start": 577928,
      "text": "Go ahead.",
      "id": "ep_4_ut_41"
    },
    {
      "end": 590288,
      "speaker": "Andy Kirk",
      "start": 578536,
      "text": "Yeah. Usually you're, like, at a conference for two days and you just say hi and have a drink together, but here we had, like, four or five evenings together, and that really builds up real friendships, I think.",
      "id": "ep_4_ut_42"
    },
    {
      "end": 606916,
      "speaker": "Enrico Bertini",
      "start": 590344,
      "text": "That's right. And I have to say that everybody who was present, there were some really, really great people, very friendly, very interested in what you do more so than what they do. Just a really good, friendly group. And it really enriched the judging process.",
      "id": "ep_4_ut_43"
    },
    {
      "end": 632760,
      "speaker": "Andy Kirk",
      "start": 606988,
      "text": "I thought, yeah, we could go through the talks of all the judges and use that chance maybe to introduce briefly all of them. I think we can't really go in as much detail as everybody would deserve. We can just say a sentence or two so people get a sense of the scope. Yeah, that would be great. So the conference kicked off with. On Thursday with. In the morning with Gonzalo. I don't know.",
      "id": "ep_4_ut_44"
    },
    {
      "end": 634388,
      "speaker": "Enrico Bertini",
      "start": 633420,
      "text": "That's how you pronounce it.",
      "id": "ep_4_ut_45"
    },
    {
      "end": 635480,
      "speaker": "Andy Kirk",
      "start": 634404,
      "text": "Yeah. Pelser.",
      "id": "ep_4_ut_46"
    },
    {
      "end": 640680,
      "speaker": "Moritz Stefaner",
      "start": 636460,
      "text": "And if you say it's not exotic enough.",
      "id": "ep_4_ut_47"
    },
    {
      "end": 646280,
      "speaker": "Enrico Bertini",
      "start": 645020,
      "text": "Exotic scale.",
      "id": "ep_4_ut_48"
    },
    {
      "end": 650360,
      "speaker": "Moritz Stefaner",
      "start": 649180,
      "text": "Fantastic.",
      "id": "ep_4_ut_49"
    },
    {
      "end": 655290,
      "speaker": "Andy Kirk",
      "start": 652690,
      "text": "What did you talk about, Andy? I mean, it was somehow about.",
      "id": "ep_4_ut_50"
    },
    {
      "end": 664050,
      "speaker": "Enrico Bertini",
      "start": 655410,
      "text": "Well, listen, I. Because, I mean, the other thing about the conference was it was a mixture of Spanish and English. And you had these wonderful translators and this little bova at the back of the room.",
      "id": "ep_4_ut_51"
    },
    {
      "end": 664978,
      "speaker": "Andy Kirk",
      "start": 664090,
      "text": "Yeah, that was crazy.",
      "id": "ep_4_ut_52"
    },
    {
      "end": 692030,
      "speaker": "Enrico Bertini",
      "start": 665074,
      "text": "And you could obtain some headphones and listen to the translation. Unfortunately for Gonzalo's piece, I didn't have any headphones because I forgot to bring my passport to the conference. Silly me. So I couldn't get hold of. I watched it and I heard from others, and he was kind of remarking about the quality of print journalism, some of the headlines and stories that are shown and published.",
      "id": "ep_4_ut_53"
    },
    {
      "end": 723626,
      "speaker": "Andy Kirk",
      "start": 692070,
      "text": "And it was an opinion talk. He said, basically, it's all very superficial news. It's just reporting the obvious and not the surprising or not the analysis, but it's just the obvious crap. And that this whole. The whole business of reporting has become superficial. So it was a bit of a provocative general wake up call, I think. Yeah, he's a provocative person. So I think he is just having fun. Like throwing. Throwing extreme positions around. Exactly.",
      "id": "ep_4_ut_54"
    },
    {
      "end": 724058,
      "speaker": "Enrico Bertini",
      "start": 723658,
      "text": "Yeah.",
      "id": "ep_4_ut_55"
    },
    {
      "end": 744514,
      "speaker": "Andy Kirk",
      "start": 724154,
      "text": "But it was very entertaining and obviously a good start. If in the morning, you know, you start with something like that, everybody's like, alert and what the heck. Next we had Andrew van der, or AVM 500, as we like to call him, and he did an excellent speech.",
      "id": "ep_4_ut_56"
    },
    {
      "end": 747338,
      "speaker": "Enrico Bertini",
      "start": 744562,
      "text": "On the tyranny of the pixel.",
      "id": "ep_4_ut_57"
    },
    {
      "end": 755690,
      "speaker": "Andy Kirk",
      "start": 747474,
      "text": "Yeah, tyranny of the pixel. And how. I mean, basically, I would say, about situated and physical visualization forms. Can we say that?",
      "id": "ep_4_ut_58"
    },
    {
      "end": 756322,
      "speaker": "Enrico Bertini",
      "start": 755810,
      "text": "Yeah.",
      "id": "ep_4_ut_59"
    },
    {
      "end": 793284,
      "speaker": "Andy Kirk",
      "start": 756426,
      "text": "An accurate summary. Yeah. And that was interesting. And also the response was interesting because, I mean, you have a traditional print infographic crowd, and they were very skeptical of this whole idea that data. To bring data into the world in form of physical visualization, because everybody can see it and super transparent, and they immediately thought of big brother scenarios. So it was interesting. So there was a big deal of fear of too much transparency or too much. Too much. Yeah. Transparency in the end, is there.",
      "id": "ep_4_ut_60"
    },
    {
      "end": 797128,
      "speaker": "Moritz Stefaner",
      "start": 793462,
      "text": "What do you mean by physical visualization? Can you give me an example?",
      "id": "ep_4_ut_61"
    },
    {
      "end": 813728,
      "speaker": "Enrico Bertini",
      "start": 797184,
      "text": "Well, there's an example of one piece would have been, I guess the thing that sticks in my mind most is the. It's kind of a balloon that's stuck at the back of a car for its exhaust, and it's this huge inflated black cloud that represents kind of carbon emissions.",
      "id": "ep_4_ut_62"
    },
    {
      "end": 814696,
      "speaker": "Moritz Stefaner",
      "start": 813784,
      "text": "Okay. Yeah, yeah.",
      "id": "ep_4_ut_63"
    },
    {
      "end": 827610,
      "speaker": "Enrico Bertini",
      "start": 814728,
      "text": "So it's trying to use that kind of ambient shock and impact of. Wow. This is how much kind of consequence cabin footprint of this car is. But there are a lot of pieces that I've not seen before, which was really interesting.",
      "id": "ep_4_ut_64"
    },
    {
      "end": 828970,
      "speaker": "Moritz Stefaner",
      "start": 828230,
      "text": "Yeah.",
      "id": "ep_4_ut_65"
    },
    {
      "end": 842078,
      "speaker": "Andy Kirk",
      "start": 829270,
      "text": "And also some of his work or what he did with the students. I think it was a really nice talk and very adequate. So it was, in a way, from the future, I think, for. For many of the people. Yeah, yeah.",
      "id": "ep_4_ut_66"
    },
    {
      "end": 846428,
      "speaker": "Enrico Bertini",
      "start": 842214,
      "text": "And then we had Moritz Stefaner, if.",
      "id": "ep_4_ut_67"
    },
    {
      "end": 848480,
      "speaker": "Andy Kirk",
      "start": 846444,
      "text": "I've said that right, sea celebrity, I think.",
      "id": "ep_4_ut_68"
    },
    {
      "end": 850556,
      "speaker": "Moritz Stefaner",
      "start": 849820,
      "text": "Who's this guy?",
      "id": "ep_4_ut_69"
    },
    {
      "end": 853988,
      "speaker": "Andy Kirk",
      "start": 850588,
      "text": "I've never heard of him. Somewhere from Germany. I don't know.",
      "id": "ep_4_ut_70"
    },
    {
      "end": 867160,
      "speaker": "Enrico Bertini",
      "start": 854124,
      "text": "Strange guy with his sensational tone. Oh, my God. It's all connected. OMG. So, I mean, how did you feel when Moritz. It seemed to go down very well in the audience. There were some challenging questions from Professor Stoll.",
      "id": "ep_4_ut_71"
    },
    {
      "end": 880710,
      "speaker": "Andy Kirk",
      "start": 867500,
      "text": "Oh, yeah? What did he ask? I just remember that I felt a bit when he. When he. When he raised his hand, I was like, oh, damn, mister. He knows so much. Yeah, yeah. He will ask something smart, but now I don't recall the question, actually.",
      "id": "ep_4_ut_72"
    },
    {
      "end": 910122,
      "speaker": "Enrico Bertini",
      "start": 880790,
      "text": "I can't actually, when I think about it. But it was fun. I think it was a well received presentation. I mean, once again, I think just kind of stepping back a bit. I think the beauty of this event was that the real blend of mix of talks, there were so many different ones, whether it's journalism or Andrew's research work or ambient media network stuff. Within the first three sessions, you had such a nice mix of things that you weren't getting that relentless stream of, oh, here we go again. It's the same topic we've heard all day. So.",
      "id": "ep_4_ut_73"
    },
    {
      "end": 930966,
      "speaker": "Andy Kirk",
      "start": 910226,
      "text": "And it was far beyond just showing projects. I have done this and I have done that. You know, everybody prepared something, a message, you know, or something special. Yeah, yeah, yeah. So I talked about networks and just showed a few of my projects, but that dealt with interesting solutions for showing networks without creating a big mess of lines.",
      "id": "ep_4_ut_74"
    },
    {
      "end": 938422,
      "speaker": "Enrico Bertini",
      "start": 931158,
      "text": "And I think also it was helpful because certainly in the print category, there were a lot of static printed network.",
      "id": "ep_4_ut_75"
    },
    {
      "end": 940030,
      "speaker": "Andy Kirk",
      "start": 938486,
      "text": "Diagrams and it's hard to do.",
      "id": "ep_4_ut_76"
    },
    {
      "end": 950014,
      "speaker": "Enrico Bertini",
      "start": 940110,
      "text": "So there's clearly a lot of people out there trying these things and perhaps not quite pulling it off in the print media. But as the online side grows, it'll be definitely a route that people want to take.",
      "id": "ep_4_ut_77"
    },
    {
      "end": 953102,
      "speaker": "Moritz Stefaner",
      "start": 950182,
      "text": "And Moritz, are your slides available online?",
      "id": "ep_4_ut_78"
    },
    {
      "end": 961270,
      "speaker": "Andy Kirk",
      "start": 953286,
      "text": "Yes, we'll link them from the show notes, but they are not so self explaining. I'm always bad at that. But they have some text, like short motors.",
      "id": "ep_4_ut_79"
    },
    {
      "end": 966958,
      "speaker": "Enrico Bertini",
      "start": 961430,
      "text": "At the same time, they are visual prompts for the event. They're not really supposed to be documents either, so.",
      "id": "ep_4_ut_80"
    },
    {
      "end": 967686,
      "speaker": "Andy Kirk",
      "start": 967014,
      "text": "Exactly.",
      "id": "ep_4_ut_81"
    },
    {
      "end": 968478,
      "speaker": "Enrico Bertini",
      "start": 967798,
      "text": "There you go.",
      "id": "ep_4_ut_82"
    },
    {
      "end": 972726,
      "speaker": "Andy Kirk",
      "start": 968574,
      "text": "Yeah, but it's still, it's a reference, at least of the projects I mentioned that's on.",
      "id": "ep_4_ut_83"
    },
    {
      "end": 973454,
      "speaker": "Enrico Bertini",
      "start": 972918,
      "text": "Yeah.",
      "id": "ep_4_ut_84"
    },
    {
      "end": 1005530,
      "speaker": "Andy Kirk",
      "start": 973542,
      "text": "Next up was Andy. Andy, big data. Kirk talked about big data, incidentally. Yeah. But, yeah, it was a great overview of, like, the challenges of today's, like, data situation, how to tackle them. Lots of quotes from contemporary digital data people. I liked the mix, Andy. It was really a good presentation because you showed some principles, you showed some examples, you had some quotes.",
      "id": "ep_4_ut_85"
    },
    {
      "end": 1035420,
      "speaker": "Enrico Bertini",
      "start": 1006350,
      "text": "Yeah, well, the examples were important because I spoke to quite a few people beforehand and tried to get some sense of their process and tips and recommendations that they've been through. And I was really appreciative of their kind of support in building up the slides and the examples. My slides are up on my site as well, and there's a screen at the very end which thanks all those people individually. So I won't go through them now. But, yeah, I was quite content with the presentation, really.",
      "id": "ep_4_ut_86"
    },
    {
      "end": 1050340,
      "speaker": "Andy Kirk",
      "start": 1036880,
      "text": "And it is a really important topic and especially big data. I mean, we all know there's lots of people talking about that. I'm happy if somebody has at least some, some substance in that area.",
      "id": "ep_4_ut_87"
    },
    {
      "end": 1081640,
      "speaker": "Moritz Stefaner",
      "start": 1050680,
      "text": "I think that big data is really, is really important. I mean, I'm really curious to see what you, what you said there, Andy, because in a way, visualization is very limited with big data. Nobody is talking about it. And, yeah, and in academic circles this is a hot topic. I mean, there's, you can, you can tune visualization as much as you can, but in the end you can, the best you can do is to represent, I don't know, one data point with one pixel. Right?",
      "id": "ep_4_ut_88"
    },
    {
      "end": 1082448,
      "speaker": "Enrico Bertini",
      "start": 1081720,
      "text": "Yeah, yeah.",
      "id": "ep_4_ut_89"
    },
    {
      "end": 1092952,
      "speaker": "Moritz Stefaner",
      "start": 1082504,
      "text": "And this means that at maximum you can visualize 1 million pixels or so. And then interacting with it is going to be really complicated anyway. So.",
      "id": "ep_4_ut_90"
    },
    {
      "end": 1141728,
      "speaker": "Enrico Bertini",
      "start": 1093056,
      "text": "Yeah, yeah, I mean, the stuff that's mentioned in the slideshow talks about different kind of layers of rolling up, aggregation layers. And that was something that certainly Kim Reese, thanks to Kim Reese, mentioned in the work that she'd done for periscopic, had done for the yahoo. Core visualization and the mail as well. So, yeah, I mean, the purpose of the talk was to kind of avoid going too deep in the technology side and talk about the human factors, the decision points, the way of coping, really, because I guess in a journalistic sense, you've got these limited environments of time pressures and resource pressures, and it's just really to give people a way to cope in those environments, really. So, yeah, it was a good stuff.",
      "id": "ep_4_ut_91"
    },
    {
      "end": 1209334,
      "speaker": "Moritz Stefaner",
      "start": 1141864,
      "text": "What I think is interesting, I mean, recently I've been thinking about it quite a lot while preparing a presentation that I had to give. And in the end, what I think is really striking is that it's extremely easy today for any person working with data to end up dealing with quite big data sets. So, for instance, I have an initial collaboration with some people who collect this database was called aid data. So they basically collect data about every flow, money flow related to Aidan, from one country to another, or from organizations to other countries, or from organizations to other organizations. And they have been collecting this data for quite a while now. I think they have a database that goes from, I don't know, the fifties up to today, kind of, okay, crazy. And this is relational data, temporal data, at the same time.",
      "id": "ep_4_ut_92"
    },
    {
      "end": 1210702,
      "speaker": "Enrico Bertini",
      "start": 1209422,
      "text": "And it's huge.",
      "id": "ep_4_ut_93"
    },
    {
      "end": 1220518,
      "speaker": "Moritz Stefaner",
      "start": 1210886,
      "text": "If you try to visualize this data on a flow map, which we tried. Which we tried. No chance. There's no chance to do it right.",
      "id": "ep_4_ut_94"
    },
    {
      "end": 1247940,
      "speaker": "Andy Kirk",
      "start": 1220694,
      "text": "I also, on my hard drive is currently a ten gigabyte JSON file. I mean, yeah, sure. And the second thing that we haven't even really started to tackle is if this data is also constantly changing. And I think that's the, the big paradigm shift. I mean, a big data set. I can sample, I can chop into pieces, you know, I can extract aggregate. But if things are constantly moving, then you have a problem.",
      "id": "ep_4_ut_95"
    },
    {
      "end": 1250576,
      "speaker": "Enrico Bertini",
      "start": 1248240,
      "text": "And what's the point if you're not keeping up with that velocity?",
      "id": "ep_4_ut_96"
    },
    {
      "end": 1250848,
      "speaker": "Moritz Stefaner",
      "start": 1250648,
      "text": "Yeah.",
      "id": "ep_4_ut_97"
    },
    {
      "end": 1258700,
      "speaker": "Andy Kirk",
      "start": 1250864,
      "text": "And you have to change the aggregation all the time. You know, you have to sort of re aggregate and so on. And so that's, that's tough.",
      "id": "ep_4_ut_98"
    },
    {
      "end": 1273840,
      "speaker": "Moritz Stefaner",
      "start": 1259640,
      "text": "What I think is really striking is that, as I was saying at the beginning, is that these people are not data geeks or analysts or people who have been trained to do fancy stuff with data. These are political scientists.",
      "id": "ep_4_ut_99"
    },
    {
      "end": 1276812,
      "speaker": "Andy Kirk",
      "start": 1274700,
      "text": "And they end up with this huge data set.",
      "id": "ep_4_ut_100"
    },
    {
      "end": 1312820,
      "speaker": "Moritz Stefaner",
      "start": 1276916,
      "text": "Yeah. And all in Azad. And they have to deal with these huge data sets or, I don't know. I've been working with biologists and they are extremely clever in their own field, but some of them, they don't have the minimum clue about how to deal with a thousand records, and they do it with Excel. And they have machines that can very, very easily spit, I don't know, things in the order of 100,000 objects with tens of dimensions. And they can do that in a matter of hours.",
      "id": "ep_4_ut_101"
    },
    {
      "end": 1314140,
      "speaker": "Andy Kirk",
      "start": 1313400,
      "text": "Right.",
      "id": "ep_4_ut_102"
    },
    {
      "end": 1316980,
      "speaker": "Moritz Stefaner",
      "start": 1314680,
      "text": "So it's really impressive. I mean.",
      "id": "ep_4_ut_103"
    },
    {
      "end": 1323088,
      "speaker": "Andy Kirk",
      "start": 1318760,
      "text": "Yeah, yeah. We might have a special issue pictata. Huh? For Genesis.",
      "id": "ep_4_ut_104"
    },
    {
      "end": 1325650,
      "speaker": "Moritz Stefaner",
      "start": 1323144,
      "text": "Sure, sure, sure.",
      "id": "ep_4_ut_105"
    },
    {
      "end": 1326442,
      "speaker": "Enrico Bertini",
      "start": 1325770,
      "text": "Let's do it.",
      "id": "ep_4_ut_106"
    },
    {
      "end": 1327746,
      "speaker": "Andy Kirk",
      "start": 1326506,
      "text": "Yeah, absolutely.",
      "id": "ep_4_ut_107"
    },
    {
      "end": 1332070,
      "speaker": "Moritz Stefaner",
      "start": 1327898,
      "text": "Anyway, great topic, Andy. I would love to receive your slides.",
      "id": "ep_4_ut_108"
    },
    {
      "end": 1337150,
      "speaker": "Enrico Bertini",
      "start": 1332490,
      "text": "Well, visit my website, resizingdated.com. they're there. Right there. Yes.",
      "id": "ep_4_ut_109"
    },
    {
      "end": 1341338,
      "speaker": "Andy Kirk",
      "start": 1338210,
      "text": "And also, Andy will be touring the big data conference.",
      "id": "ep_4_ut_110"
    },
    {
      "end": 1343186,
      "speaker": "Enrico Bertini",
      "start": 1341434,
      "text": "I'm doing, I'm doing the circuit this year.",
      "id": "ep_4_ut_111"
    },
    {
      "end": 1343650,
      "speaker": "Andy Kirk",
      "start": 1343218,
      "text": "My word.",
      "id": "ep_4_ut_112"
    },
    {
      "end": 1344026,
      "speaker": "Enrico Bertini",
      "start": 1343690,
      "text": "Yes.",
      "id": "ep_4_ut_113"
    },
    {
      "end": 1346226,
      "speaker": "Andy Kirk",
      "start": 1344098,
      "text": "The Andy world tour. So.",
      "id": "ep_4_ut_114"
    },
    {
      "end": 1380912,
      "speaker": "Enrico Bertini",
      "start": 1346418,
      "text": "So Enrico, me, we're doing the event in the London in September. Yeah, big data world. And I'm also doing, excuse me, big data week on the 24 April in London. And that's a panel discussion event, I think so. It's certainly the topic on the list of all the event organizers this year. That's for sure. So back to the conference schedule. So following me was Sheelagh Pontis.",
      "id": "ep_4_ut_115"
    },
    {
      "end": 1385432,
      "speaker": "Andy Kirk",
      "start": 1380976,
      "text": "Yeah, no big data. No big data. In fact, no data at all.",
      "id": "ep_4_ut_116"
    },
    {
      "end": 1425526,
      "speaker": "Enrico Bertini",
      "start": 1385576,
      "text": "No. So Sheelagh talked about some research that she'd done on the kind of, the kind of design process and the difference between those who were kind of systematic and those who are much more kind of spontaneous and kind of unstructured. And I think the. From memory, the structure of the presentation was talking about how she'd used about five different people and done some real deep case studies with those people. And they were all quite experienced designers. Can you remember the exact design context they worked in? Moritz.",
      "id": "ep_4_ut_117"
    },
    {
      "end": 1430854,
      "speaker": "Andy Kirk",
      "start": 1425678,
      "text": "Yes. So she gave them the task to design a graphic on global warming.",
      "id": "ep_4_ut_118"
    },
    {
      "end": 1431750,
      "speaker": "Enrico Bertini",
      "start": 1430942,
      "text": "That's right, yeah.",
      "id": "ep_4_ut_119"
    },
    {
      "end": 1467532,
      "speaker": "Andy Kirk",
      "start": 1431790,
      "text": "Yeah. And about the key factors and what we can do about it, things like that. And then the designers started to work on that assignment and documented what they did, also handed in all the artifacts they produced and when they worked on what. And with this, she could both determine the parallels, but also the differences in working styles. And that was really interesting. I would have loved to see the full case studies of all the designers. Obviously, time didn't suffice for that, but I'll definitely try and get a hold of her PhD thesis once.",
      "id": "ep_4_ut_120"
    },
    {
      "end": 1482452,
      "speaker": "Enrico Bertini",
      "start": 1467596,
      "text": "That's right. Yeah. Yeah. And I think the interesting takeaway for me was also hearing about one of the participants dropping out because they couldn't operate in such a systematic way that they had to kind of withdraw.",
      "id": "ep_4_ut_121"
    },
    {
      "end": 1490614,
      "speaker": "Andy Kirk",
      "start": 1482596,
      "text": "I can see that. Because it's sort of always watched and then you second guess everything. So if you're, like, overly conscious of, you know, these things, I can see how that doesn't work.",
      "id": "ep_4_ut_122"
    },
    {
      "end": 1492006,
      "speaker": "Enrico Bertini",
      "start": 1490702,
      "text": "It's difficult. Yeah.",
      "id": "ep_4_ut_123"
    },
    {
      "end": 1501126,
      "speaker": "Andy Kirk",
      "start": 1492198,
      "text": "So it's hard to do an experiment without any disturbance there. But it sounded really interesting. So we should have an eye on when it comes out.",
      "id": "ep_4_ut_124"
    },
    {
      "end": 1507526,
      "speaker": "Enrico Bertini",
      "start": 1501238,
      "text": "Yeah. And once again, a tip of the heart to Sheelagh for her wonderful work during the week as the president.",
      "id": "ep_4_ut_125"
    },
    {
      "end": 1508710,
      "speaker": "Andy Kirk",
      "start": 1507718,
      "text": "She was fantastic.",
      "id": "ep_4_ut_126"
    },
    {
      "end": 1511702,
      "speaker": "Enrico Bertini",
      "start": 1508790,
      "text": "And also the translator for everything and the organizer.",
      "id": "ep_4_ut_127"
    },
    {
      "end": 1513734,
      "speaker": "Andy Kirk",
      "start": 1511726,
      "text": "So she had a big mediator also. She was always.",
      "id": "ep_4_ut_128"
    },
    {
      "end": 1518642,
      "speaker": "Enrico Bertini",
      "start": 1513782,
      "text": "Absolutely. Yeah. And then after Sheelagh, we had Brian Christie.",
      "id": "ep_4_ut_129"
    },
    {
      "end": 1519350,
      "speaker": "Andy Kirk",
      "start": 1518706,
      "text": "Yeah.",
      "id": "ep_4_ut_130"
    },
    {
      "end": 1526018,
      "speaker": "Enrico Bertini",
      "start": 1519930,
      "text": "And Brian is a. I mean, interesting. Brian's a very, very well known illustrator.",
      "id": "ep_4_ut_131"
    },
    {
      "end": 1527430,
      "speaker": "Andy Kirk",
      "start": 1526074,
      "text": "I didn't know him at all.",
      "id": "ep_4_ut_132"
    },
    {
      "end": 1550630,
      "speaker": "Enrico Bertini",
      "start": 1529810,
      "text": "This was a really interesting moment. And it kind of revealed the fact that we've kind of infiltrated this group of people because Brian asked the question, who doesn't know me? Who's not seen my work hands up? And they were kind of. Essentially, there would be me, Moritz, two of us, Andrew and Robert Cazaro.",
      "id": "ep_4_ut_133"
    },
    {
      "end": 1555550,
      "speaker": "Andy Kirk",
      "start": 1552530,
      "text": "And the rest was everybody. Yeah, Brian. He's so cool.",
      "id": "ep_4_ut_134"
    },
    {
      "end": 1575600,
      "speaker": "Enrico Bertini",
      "start": 1556050,
      "text": "And whilst we'd spent all week with Brian, and he's a smashing fellow. Really funny, really, really down to earth guy. He's an exceptional 3d illustrator and fine artist. And he does a lot of work for national geo and New York Times.",
      "id": "ep_4_ut_135"
    },
    {
      "end": 1587780,
      "speaker": "Andy Kirk",
      "start": 1576020,
      "text": "All kinds of magazines. I mean, I get to a German pharmacist, paper editor, and they also use this work. So he's definitely all over the place.",
      "id": "ep_4_ut_136"
    },
    {
      "end": 1619258,
      "speaker": "Enrico Bertini",
      "start": 1587940,
      "text": "The thing is, in this world, to me, it seems quite invisible. Who actually creates these works, because you don't always get the author or the artist at the bottom. But, yeah, Brian's. Brian's a real sort of frontline guy in this world. And he did a really. I really enjoyed his talk. It was very language, very sort of relaxed and just a kind of reflection on his. On his works and his process and the things that it was. I can't remember the name of his talk. Some like, desperation and inspiration. And desperation.",
      "id": "ep_4_ut_137"
    },
    {
      "end": 1640892,
      "speaker": "Andy Kirk",
      "start": 1619434,
      "text": "Desperation onwards. He's an artist type. He's an artist type, like, yeah, with all the emotion that comes with it and the whole. He's like the genius moment guy. And then I had it, you know, and it came from this statue that I saw by Michelangelo and then I knew how to do it, you know, like this type of thing.",
      "id": "ep_4_ut_138"
    },
    {
      "end": 1641348,
      "speaker": "Enrico Bertini",
      "start": 1640996,
      "text": "Yeah.",
      "id": "ep_4_ut_139"
    },
    {
      "end": 1656710,
      "speaker": "Andy Kirk",
      "start": 1641404,
      "text": "And that was really interesting. Big, you know, just think about the bandwidth again. So you had me and Andy, then you had Sheelagh, which, who did a, like a theoretical PhD on design processes, and then he is the artist, you know, so it was really interesting.",
      "id": "ep_4_ut_140"
    },
    {
      "end": 1666886,
      "speaker": "Enrico Bertini",
      "start": 1656830,
      "text": "Yeah. And then in the afternoon, we had Simon Rogers from the Guardian made a flying visit, literally, I think, flew in.",
      "id": "ep_4_ut_141"
    },
    {
      "end": 1687612,
      "speaker": "Andy Kirk",
      "start": 1666958,
      "text": "Talked like for an hour, like super fast, and delivered, I think, twice as much content as everybody else. I mean, both because he talked really long, but also talked really fast, and then flew off again. Like, his last question was, like, ended with, okay, it's now 30 minutes until the plane leaves, bye bye. So that's.",
      "id": "ep_4_ut_142"
    },
    {
      "end": 1749646,
      "speaker": "Enrico Bertini",
      "start": 1687636,
      "text": "The Guardian's got an air force two or something like that. But once again, you know, another great, interesting talk, rooted obviously in data journalism and about the work that the Guardian do and some of the projects they've worked on, like the sort of Twitter visualizations that they've worked on around the UK riots. And also one of the most interesting pieces, which was the. The contrast of where those riots took place and where the people who committed the riots came from, which was a real kind of interesting geographical plot. So, yeah, once again, another great talk. And that was followed by our friend Robert, Robert Kosara, who runs the website eager eyes. And this was the contrast, Moritz, wasn't it, with the, uh, the question that Brian asked about who doesn't know me, because Robert talked about, um, a number of things, but he showed the, um, the bikini plot, the bikini chart, the, um, from Obama.",
      "id": "ep_4_ut_143"
    },
    {
      "end": 1751038,
      "speaker": "Andy Kirk",
      "start": 1749718,
      "text": "Right. About Obama.",
      "id": "ep_4_ut_144"
    },
    {
      "end": 1777518,
      "speaker": "Enrico Bertini",
      "start": 1751214,
      "text": "That's right. Um, which he profiled on his blog a few weeks ago, and obviously we've all seen it. And Robert asked the question, who's seen this blog? And once again, there were very few hands. And it's. It's this kind of really rich experience that we all went through of being relative strangers in this infographics rich world. And that was. That was, once again, we jump into the reflection. But that was one of the most important things from the event, really, for me.",
      "id": "ep_4_ut_145"
    },
    {
      "end": 1787350,
      "speaker": "Andy Kirk",
      "start": 1777574,
      "text": "Yeah. That this. There's this whole world and they see us as sort of the weirdos. Right. So, I mean, well, yeah, we are.",
      "id": "ep_4_ut_146"
    },
    {
      "end": 1798384,
      "speaker": "Enrico Bertini",
      "start": 1787390,
      "text": "So. But, yeah. Robert's talk was, once again, very interesting. Much of it was talking about kind of things like weight of colour, which was an interesting concept. Moritz, wasn't it?",
      "id": "ep_4_ut_147"
    },
    {
      "end": 1844430,
      "speaker": "Andy Kirk",
      "start": 1798552,
      "text": "Yeah. Yeah. I read this paper. So it's interesting research he does there on the sort of the. What is read between the lines when you present the visualization? And that might depend on if you have a pie chart, simply how it is rotated. Right. So if you put a heavy color to the side, people will think the wheel will run away. You know, it's not stable or it's a very rigid structure or not. And, I mean, designers operate with that all the time, and researchers have ignored that for decades. So I think it's fantastic that Robert picks that up. I think that's really splendid. And I think more people should try and investigate this systematically. I know it's hard, but I think it would be great.",
      "id": "ep_4_ut_148"
    },
    {
      "end": 1880044,
      "speaker": "Enrico Bertini",
      "start": 1846240,
      "text": "And then we had Alberto, Alberto Cairo, that was at the end, and he was profiling a lot of things. I mean, he's got a book, a translated book due out in, I think it's August, which is the functional art. And there were many, many examples of the subjects that he covers in the book. And also from his work, I'm trying to remember the name of the publication. He's worked up until recently in Brazil, but I can't. It's escaped my mind, some of the projects that they did there.",
      "id": "ep_4_ut_149"
    },
    {
      "end": 1882900,
      "speaker": "Andy Kirk",
      "start": 1880172,
      "text": "I think he's a professor in Miami. I know that.",
      "id": "ep_4_ut_150"
    },
    {
      "end": 1904096,
      "speaker": "Enrico Bertini",
      "start": 1883060,
      "text": "Yeah. There was one project around the kind of inequality of schools, private public schools, and the marks that were being attained. So once again, just kind of brought an end to a really rich coverage today. Quite. I'd say Thursday was typically quite a visualization heavy day.",
      "id": "ep_4_ut_151"
    },
    {
      "end": 1904816,
      "speaker": "Andy Kirk",
      "start": 1904128,
      "text": "Oh, yeah, that's right.",
      "id": "ep_4_ut_152"
    },
    {
      "end": 1932044,
      "speaker": "Enrico Bertini",
      "start": 1904848,
      "text": "That was, that was the balance of the. Of the content. But moving into Friday, we kind of switched perhaps more into the. The true malofiage talks, I guess, the illustrators and the journalists. And it kicked off with Anna Gerdes from did site. Now I was little bit hungover and therefore missed this particular talk. It was the only one I missed. I believe you were there, Moritz.",
      "id": "ep_4_ut_153"
    },
    {
      "end": 1957760,
      "speaker": "Andy Kirk",
      "start": 1932092,
      "text": "I was there, of course, in the first row, taking notes as usual, looking all smart and so on. Yeah, fresh as a daisy. Absolutely. And they did something very German. And the very German thing was to perfectly prepare their talk, like, to the last minute because they had a complete movie, basically playing with an animated infographic narrating their story.",
      "id": "ep_4_ut_154"
    },
    {
      "end": 1958788,
      "speaker": "Enrico Bertini",
      "start": 1958260,
      "text": "Okay.",
      "id": "ep_4_ut_155"
    },
    {
      "end": 1988936,
      "speaker": "Andy Kirk",
      "start": 1958844,
      "text": "Yeah. With loads of effort went into that. So it was about their newspaper, how they work, the things they produce, what they like, what they don't like, who's working there, you know, all these things like a self presentation. But it was like really 40 minutes of animated infographics. I was pretty blown away. Yeah. But in the end, I mean, the downside might have been it was a bit rigid because they were actually like reading that hex from little paper cards, you know, in order to keep pace with the movie. But I mean, you absolutely have to respect the effort that went into the.",
      "id": "ep_4_ut_156"
    },
    {
      "end": 1989648,
      "speaker": "Enrico Bertini",
      "start": 1989008,
      "text": "Absolutely.",
      "id": "ep_4_ut_157"
    },
    {
      "end": 1991696,
      "speaker": "Moritz Stefaner",
      "start": 1989704,
      "text": "Yeah, that's very German.",
      "id": "ep_4_ut_158"
    },
    {
      "end": 1992600,
      "speaker": "Andy Kirk",
      "start": 1991848,
      "text": "It's very German.",
      "id": "ep_4_ut_159"
    },
    {
      "end": 1993384,
      "speaker": "Moritz Stefaner",
      "start": 1992640,
      "text": "That's what I thought.",
      "id": "ep_4_ut_160"
    },
    {
      "end": 2004300,
      "speaker": "Andy Kirk",
      "start": 1993432,
      "text": "It's like. Yes, that's the Germans. And, you know, like Brian Christie. He was standing there like. Yeah, I just changed my whole presentation ten minutes ago. Where are my slides? What did I want to say?",
      "id": "ep_4_ut_161"
    },
    {
      "end": 2005896,
      "speaker": "Enrico Bertini",
      "start": 2005040,
      "text": "You know?",
      "id": "ep_4_ut_162"
    },
    {
      "end": 2008420,
      "speaker": "Andy Kirk",
      "start": 2006048,
      "text": "And the Germans were like, paper cards.",
      "id": "ep_4_ut_163"
    },
    {
      "end": 2011712,
      "speaker": "Moritz Stefaner",
      "start": 2009440,
      "text": "Number one, number two, number three.",
      "id": "ep_4_ut_164"
    },
    {
      "end": 2019826,
      "speaker": "Andy Kirk",
      "start": 2011816,
      "text": "Yeah. But it was. It was still. It was a great talk and very sympathetic to. Or how do you say it was. It was nice. Simply. Yeah.",
      "id": "ep_4_ut_165"
    },
    {
      "end": 2024970,
      "speaker": "Enrico Bertini",
      "start": 2019898,
      "text": "Yeah, absolutely. And then we had Nigel. Nigel Holmes. Nigel blue.",
      "id": "ep_4_ut_166"
    },
    {
      "end": 2026602,
      "speaker": "Andy Kirk",
      "start": 2025050,
      "text": "Nigel blue. Yeah.",
      "id": "ep_4_ut_167"
    },
    {
      "end": 2027786,
      "speaker": "Enrico Bertini",
      "start": 2026746,
      "text": "What a wonderful guy.",
      "id": "ep_4_ut_168"
    },
    {
      "end": 2028634,
      "speaker": "Andy Kirk",
      "start": 2027858,
      "text": "He's amazing.",
      "id": "ep_4_ut_169"
    },
    {
      "end": 2039564,
      "speaker": "Enrico Bertini",
      "start": 2028722,
      "text": "Yeah. I mean, I guess. I mean, most people will probably know about Nigel's work. He's. I mean, he's. I think he started off in the.",
      "id": "ep_4_ut_170"
    },
    {
      "end": 2044184,
      "speaker": "Andy Kirk",
      "start": 2039682,
      "text": "I think he officially carries the title of greatest infographic artist alive. I think.",
      "id": "ep_4_ut_171"
    },
    {
      "end": 2044552,
      "speaker": "Enrico Bertini",
      "start": 2044232,
      "text": "Yeah.",
      "id": "ep_4_ut_172"
    },
    {
      "end": 2046496,
      "speaker": "Andy Kirk",
      "start": 2044616,
      "text": "I think that's pretty much an agreement.",
      "id": "ep_4_ut_173"
    },
    {
      "end": 2047940,
      "speaker": "Moritz Stefaner",
      "start": 2046608,
      "text": "Yeah. He's amazing.",
      "id": "ep_4_ut_174"
    },
    {
      "end": 2055780,
      "speaker": "Enrico Bertini",
      "start": 2049400,
      "text": "His website's the. I think it's explanation, graphics is the website he runs. But, I mean, he's been.",
      "id": "ep_4_ut_175"
    },
    {
      "end": 2059940,
      "speaker": "Andy Kirk",
      "start": 2056080,
      "text": "He said this was done eleven years ago by his nephew.",
      "id": "ep_4_ut_176"
    },
    {
      "end": 2061320,
      "speaker": "Enrico Bertini",
      "start": 2060560,
      "text": "Yeah.",
      "id": "ep_4_ut_177"
    },
    {
      "end": 2064416,
      "speaker": "Andy Kirk",
      "start": 2061480,
      "text": "And since then never updated. So it's not representative.",
      "id": "ep_4_ut_178"
    },
    {
      "end": 2131112,
      "speaker": "Enrico Bertini",
      "start": 2064528,
      "text": "But Nigel just gave a really entertaining talk, talking about his life and some of his works that he was happy with, some of the works he didn't like. I mean, his title was crimes and passion. Sorry, crimes and passions. And it was just, I mean, it was such a fluid narration of his career, really. And there were little interjections of kind of his collection of. Because those who don't know Nigel. Nigel's been wearing blue since the age of 17, clothes wise, and so he's obsessed with the color blue. And he showed this collection of all his blue glasses and his blue trains and shoes and it's wonderful. But, yeah, I mean, that was a real highlight for me, the talk that Nigel gave. I mean, it's kind of hard to describe it in a single sentence, but once again, it just added to the blend of the talks. And then following Nigel, we had Matthew, Matthew block from the New York Times. And once again, he just taught Moritz about his kind of portfolio of projects, really, didn't he?",
      "id": "ep_4_ut_179"
    },
    {
      "end": 2196990,
      "speaker": "Andy Kirk",
      "start": 2131136,
      "text": "Yeah, and a few. I appreciate that. He shows some inside tricks of how he created some, some of his maps. So he did a heat map visualization of where taxis were in New York at what time. It was quite stunning to see. I always thought it was precomputed, but he actually computes the heat map on the fly in the browser using flash, using image processing techniques. And he showed all the steps. First you draw the dots, then you blur them, then you apply this palette map thing to get the easeline type look and these types of things. Very helpful and great technique overall. He's also the guy behind the census maps, the New York Times, who use that dot technique, which is really a smart way of working with density and categories at the same time. If you want to express like, you know, they had this for racial distributions in America, and you both want to say, here's a lot of people, and you both want to make a statement about different categories of these people. That's an excellent technique. And again, he has this really smart way of doing that.",
      "id": "ep_4_ut_180"
    },
    {
      "end": 2212054,
      "speaker": "Enrico Bertini",
      "start": 2197030,
      "text": "And I think the other thing about Matthew's work and sort of preemptive discussion on New York Times is the speed at which they're turning these projects around is amazing. We're talking about within, within a day, some of these projects are produced, which is incredible.",
      "id": "ep_4_ut_181"
    },
    {
      "end": 2215534,
      "speaker": "Andy Kirk",
      "start": 2212142,
      "text": "But he also said that's because he spent six months working on the framework.",
      "id": "ep_4_ut_182"
    },
    {
      "end": 2216370,
      "speaker": "Enrico Bertini",
      "start": 2215582,
      "text": "That's right.",
      "id": "ep_4_ut_183"
    },
    {
      "end": 2226806,
      "speaker": "Andy Kirk",
      "start": 2218590,
      "text": "Lots of time for research, preparation, reporting also. But then you can create results real quick if you have that.",
      "id": "ep_4_ut_184"
    },
    {
      "end": 2227890,
      "speaker": "Enrico Bertini",
      "start": 2226958,
      "text": "That's right.",
      "id": "ep_4_ut_185"
    },
    {
      "end": 2234610,
      "speaker": "Andy Kirk",
      "start": 2229070,
      "text": "Yeah. Matthew is a splendid guy, too, and I found him very impressive overall. Yes, he's fantastic.",
      "id": "ep_4_ut_186"
    },
    {
      "end": 2298730,
      "speaker": "Enrico Bertini",
      "start": 2235240,
      "text": "And then we had Ginny Mason from Nat Geo, who talked about a number of kind of cartography projects that they've done over there. Oh, it's amazing, the Venice map, bloom. It's fantastic. And people should check that out. Interestingly, the interesting footnote to that project is that throughout the event, we had these wonderful students from the faculty of communications at Navarra, and I, they see this event, rightly so, as a real privilege to be invited to volunteer and support. And they go through an interviewing process. And one of the interview stages is they're asked to kind of explain and critique an infographic. And it was this Venice map that they were asked to do, which was kind of interesting. But, yeah, I mean, once again, I think the thing that stands out for me about the work that Ginny showed and what she's been involved in is the depth of research, the depth of accuracy that has to go into every single piece, the amount of checking.",
      "id": "ep_4_ut_187"
    },
    {
      "end": 2324602,
      "speaker": "Andy Kirk",
      "start": 2298810,
      "text": "Love of detail. Love to detail. Yeah. And they even, they have a real process for checking factual errors and also integrity of the mapping, you know, and I don't know anyone else who has that, honestly. And I do it, you know, sometimes I ask the client, like, oh, can you check if everything's correct? Just pick a few random values and look them up again, you know, stuff like that. Or I might do it when. But usually I forget. So usually I just trust.",
      "id": "ep_4_ut_188"
    },
    {
      "end": 2325746,
      "speaker": "Enrico Bertini",
      "start": 2324706,
      "text": "Yeah, yeah.",
      "id": "ep_4_ut_189"
    },
    {
      "end": 2339162,
      "speaker": "Andy Kirk",
      "start": 2325898,
      "text": "And I heard also from major publications that they basically just. They do that internally, but they don't have a big process around it. And that was really great to see that the National Geographic is so thorough about these things.",
      "id": "ep_4_ut_190"
    },
    {
      "end": 2382074,
      "speaker": "Enrico Bertini",
      "start": 2339226,
      "text": "Like, I mean, that kind of last, the last 5% that they go through before launching a product is amazing, the effort that goes into it. So that was, once again, another great talk and brought that new dimension of cartography and mapping. And then we had Carl, Carl de Torres, who's once again, I guess not Spanish, though. Carl, it makes. That makes that point. Carl's from San Francisco. And I guess, like Brian, he's just one of the top graphic designers in Cal's case. He does a lot of infographics work for magazines. He used to be the graphics editor at Wired. And he's, I mean, the kind of portfolio work that he's done for like.",
      "id": "ep_4_ut_191"
    },
    {
      "end": 2384794,
      "speaker": "Andy Kirk",
      "start": 2382122,
      "text": "IBM and stunning work.",
      "id": "ep_4_ut_192"
    },
    {
      "end": 2401586,
      "speaker": "Enrico Bertini",
      "start": 2384922,
      "text": "He's got a real deep, impressive portfolio. And his work is wonderful. I mean, it's. Once again, it's kind of pushing the boundaries of what we do in terms of the abstract nature of data representation. But it is still there. You can still see the representation presentation.",
      "id": "ep_4_ut_193"
    },
    {
      "end": 2428538,
      "speaker": "Andy Kirk",
      "start": 2401658,
      "text": "I found it interesting because he picks up all the aesthetics coming from data visualization and coming from generative design. But employs them in a graphic design context. So he will, you know, when he draws a network, he just draws a random network, but the look is like one that is computed. But he told us he was just clicking his mouse until his hand hurt so badly that he couldn't continue anymore, and then he knew it was done.",
      "id": "ep_4_ut_194"
    },
    {
      "end": 2429274,
      "speaker": "Enrico Bertini",
      "start": 2428674,
      "text": "Yeah.",
      "id": "ep_4_ut_195"
    },
    {
      "end": 2449206,
      "speaker": "Andy Kirk",
      "start": 2429402,
      "text": "So, basically. But it's interesting how he plays with these, these icons, you know, and these associations everybody has about these graphics. And he, he basically does infographics without info and without the labels and without the, the real insights. But he uses these to communicate on a whole different level, like more on.",
      "id": "ep_4_ut_196"
    },
    {
      "end": 2452982,
      "speaker": "Enrico Bertini",
      "start": 2449238,
      "text": "The, on the gut and everything's with a twist. So.",
      "id": "ep_4_ut_197"
    },
    {
      "end": 2455270,
      "speaker": "Andy Kirk",
      "start": 2453086,
      "text": "Yeah, yeah. It's all very thought out and smart.",
      "id": "ep_4_ut_198"
    },
    {
      "end": 2486750,
      "speaker": "Enrico Bertini",
      "start": 2455350,
      "text": "If someone's commissioned to do something about data. And this was the important thing, I think you mentioned, and it was this idea of, I mean, the title of the talk was visual presentation of invisible processes. So how do you visually represent things that are invisible, that aren't physically informed? And most people, when they're given a commission to do something about data, would do something derivative, like ones and zeros. But Kyle just kind of twists that or takes it in a new direction. And, yeah, I mean, his work's stunning. And everyone should have a look at his website for his portfolio because it's.",
      "id": "ep_4_ut_199"
    },
    {
      "end": 2493690,
      "speaker": "Andy Kirk",
      "start": 2486910,
      "text": "Really interesting, impressive work, best sense of color. Also, like, he's very good. Yeah.",
      "id": "ep_4_ut_200"
    },
    {
      "end": 2502400,
      "speaker": "Enrico Bertini",
      "start": 2495060,
      "text": "And then after Carl, we had Jaime. Jaime, Sarah. And this was a really interesting piece.",
      "id": "ep_4_ut_201"
    },
    {
      "end": 2523260,
      "speaker": "Andy Kirk",
      "start": 2502700,
      "text": "Again, somebody I didn't know, and everybody knew who he was, and he's like super famous. And he also, later he became like infographic artist of the decade or something like that. And I was like, oh, okay, wow, nice. Clap, clap. Sometimes he feels stupid.",
      "id": "ep_4_ut_202"
    },
    {
      "end": 2528100,
      "speaker": "Enrico Bertini",
      "start": 2524760,
      "text": "I mean, I don't know how to describe Moritz, other than to say it was a performance.",
      "id": "ep_4_ut_203"
    },
    {
      "end": 2571668,
      "speaker": "Andy Kirk",
      "start": 2528760,
      "text": "Yes. Because it was a wins alike. Yes. So what he does is these days. So he was a graphics editor for Clarine, and at that time, I know also clarine was really fantastic in infographics. And now he's at Vanguardia la Vangardia. It's a Catalan sort of independent newspaper, a smaller one, and he has an infographics column, which is interesting. It's like a weekly probably column. And he just makes one little infographics experiment with some little text to it, and the text and the graphics go hand in hand, and together they form a piece, you could say. And he performed these pieces by reading them and having a slide projection in.",
      "id": "ep_4_ut_204"
    },
    {
      "end": 2600116,
      "speaker": "Enrico Bertini",
      "start": 2571684,
      "text": "The background and music. And also, it was so atmospheric and he's got such an imposing physical presence as well. His voice is really deep and clear now, obviously it was in Spanish and I guess for those who were Spanish speakers, it was probably an even richer experience. But, I mean, I go back to the same point. It was just another different talk, a different type of talk, a different subject matter that just added so much to the event, really.",
      "id": "ep_4_ut_205"
    },
    {
      "end": 2616114,
      "speaker": "Andy Kirk",
      "start": 2600308,
      "text": "Yeah. And it's fascinating work. I don't have 100% access to it. Probably knowing Spanish would be good. And also the. The whole style is not directly something that resonates with me, but I totally. I totally see that there's something there.",
      "id": "ep_4_ut_206"
    },
    {
      "end": 2617674,
      "speaker": "Enrico Bertini",
      "start": 2616242,
      "text": "Yeah, yeah, absolutely.",
      "id": "ep_4_ut_207"
    },
    {
      "end": 2629362,
      "speaker": "Andy Kirk",
      "start": 2617802,
      "text": "Later they also. He won also prize for best infographic of the whatever and for La Baja franca and beautiful piece about. About a whale.",
      "id": "ep_4_ut_208"
    },
    {
      "end": 2630322,
      "speaker": "Enrico Bertini",
      "start": 2629426,
      "text": "The whale. I don't know.",
      "id": "ep_4_ut_209"
    },
    {
      "end": 2632322,
      "speaker": "Andy Kirk",
      "start": 2630346,
      "text": "Yeah. Some specific whale.",
      "id": "ep_4_ut_210"
    },
    {
      "end": 2632834,
      "speaker": "Enrico Bertini",
      "start": 2632466,
      "text": "Yeah.",
      "id": "ep_4_ut_211"
    },
    {
      "end": 2644042,
      "speaker": "Andy Kirk",
      "start": 2632882,
      "text": "And it's beautiful because he mixes like painting and these very. Let's straightforward graphics to this all together composition. It is very beautiful.",
      "id": "ep_4_ut_212"
    },
    {
      "end": 2646218,
      "speaker": "Enrico Bertini",
      "start": 2644146,
      "text": "You'd expect to see it in a gallery. I think that.",
      "id": "ep_4_ut_213"
    },
    {
      "end": 2647058,
      "speaker": "Andy Kirk",
      "start": 2646314,
      "text": "Exactly. Yeah.",
      "id": "ep_4_ut_214"
    },
    {
      "end": 2647370,
      "speaker": "Enrico Bertini",
      "start": 2647114,
      "text": "Yeah.",
      "id": "ep_4_ut_215"
    },
    {
      "end": 2656590,
      "speaker": "Andy Kirk",
      "start": 2647410,
      "text": "But still, it's a true infographic, you know, it's absolutely pretending to be an infographic. No, it's an infographic piece and it's really strong. So I have big respect.",
      "id": "ep_4_ut_216"
    },
    {
      "end": 2688630,
      "speaker": "Enrico Bertini",
      "start": 2657570,
      "text": "And then we had Sergio Pisania. Is that how you pronounce it? Yeah. Sergio's from the New York Times. He's the. I think he's the foreign graphics editor. Yeah. And he did, once again, he did a great talk about the projects that he's worked on. And I guess most recently he's been involved very much in the work around the arab uprising. So he talked about. It was really interesting talk. He talked not just about graphics, but also about the journalistic process.",
      "id": "ep_4_ut_217"
    },
    {
      "end": 2699488,
      "speaker": "Andy Kirk",
      "start": 2688750,
      "text": "He didn't talk about graphics. He really talked about the reporting. He was verifying your sources, how to get in touch with people over there, how to piece wise, construct reality, you know.",
      "id": "ep_4_ut_218"
    },
    {
      "end": 2707880,
      "speaker": "Enrico Bertini",
      "start": 2699624,
      "text": "Yeah, very interesting. And using things like photographic evidence of certain buildings in certain positions and landmarks.",
      "id": "ep_4_ut_219"
    },
    {
      "end": 2708488,
      "speaker": "Andy Kirk",
      "start": 2707960,
      "text": "Exactly.",
      "id": "ep_4_ut_220"
    },
    {
      "end": 2739520,
      "speaker": "Enrico Bertini",
      "start": 2708544,
      "text": "To verify what you see in perhaps in a YouTube report, to then verify that that contact is genuinely in that part of the world. So it was a really, really interesting talk about the process that the New York Times goes through about the verification of sources and obviously as the end product, the kind of graphics that have been employed to tell the stories about things like the clashes in Egypt, about the troops and the protesters and. Yeah, I mean, it was just lovely insight into how the New York Times.",
      "id": "ep_4_ut_221"
    },
    {
      "end": 2749488,
      "speaker": "Andy Kirk",
      "start": 2739560,
      "text": "Operates, for me, personal again, which is many of the presenters. There was an immediate personal connection also with the audience. And it wasn't different.",
      "id": "ep_4_ut_222"
    },
    {
      "end": 2809514,
      "speaker": "Enrico Bertini",
      "start": 2749664,
      "text": "Yeah. And I also got the same impression from the last talk, which was from Mario Tashon. Now, Mario kind of wraps things up, I thought, quite perfectly, with kind of a top ten list of trends of opportunities and challenges. And I mean, there was probably a lot of things that we can resonate with there in terms of the opportunities about Twitter and different tools and different developments. But it was a kind of a perfect conclusion, really, because had it been another talk about this is a project I've done, or if it was infographic illustrator, this is how I do my methods, that would have been covered. But once again, this was another unique piece in the sort of jigsaw of the two days. And it kind of brought an end to a wonderful two days of speeches, really. And then we kind of moved into this interesting process of the awards. And I guess at this point, Moritz, we need to talk about the judging process, probably.",
      "id": "ep_4_ut_223"
    },
    {
      "end": 2833810,
      "speaker": "Andy Kirk",
      "start": 2809602,
      "text": "Yeah, yeah. So this was all the conference part, but the second big part of the whole event is the prizes, really. And so you can win a gold medal, silver medal, bronze in different categories online or print and so on. And so this was what we were busy with the first few days, like determining who would win these medals. Right. And.",
      "id": "ep_4_ut_224"
    },
    {
      "end": 2851610,
      "speaker": "Moritz Stefaner",
      "start": 2833970,
      "text": "Yeah, and from what I read, it looks like there was quite a, a lot of discussion about a sort of monopoly from New York Times. I think that was the main, the main thing I've seen discussed on Twitter is basically that. Right.",
      "id": "ep_4_ut_225"
    },
    {
      "end": 2892490,
      "speaker": "Enrico Bertini",
      "start": 2852230,
      "text": "It is. I mean, there's some really important points about the context of the jury process here. We had three days to go through 1500 entries, of which about 1112 hundred were print and 3400 were online. And so the first round, which is about elimination, and it kind of roots out about 70% to 80% in terms of eliminated pieces because that's the only way you can cope in terms of the stages further down the line where you start to discuss things a bit more about potential medal winners. And so for that first round, it really is unfortunately quite an instinctive, impulsive process.",
      "id": "ep_4_ut_226"
    },
    {
      "end": 2899946,
      "speaker": "Andy Kirk",
      "start": 2893710,
      "text": "Also a quick one, I could imagine online was a bit different, but in print, I think you have to go quick in the future.",
      "id": "ep_4_ut_227"
    },
    {
      "end": 2951056,
      "speaker": "Enrico Bertini",
      "start": 2899978,
      "text": "That's right. And you don't really have a chance, unfortunately, to read all the annotations or the labels, all the kind of context information. You obviously don't know about the background of the organization that much, what kind of resources they've got, what kind of history of work they've got. So the first one is quite brutal, so you have to eliminate some. The second round is about switching the process into a selection of those pieces that could potentially merit Avro gold, silver or bronze award. And after each selection of these, we immediately debated and voted on the medals that would be awarded. And I think, going back to your point there, Enrico, about the discussion of monopoly, the most important thing here is the fact that a bronze medal is a really wonderful award. And it's.",
      "id": "ep_4_ut_228"
    },
    {
      "end": 2954060,
      "speaker": "Andy Kirk",
      "start": 2951248,
      "text": "We're talking about very small, quite something. Yeah.",
      "id": "ep_4_ut_229"
    },
    {
      "end": 3023732,
      "speaker": "Enrico Bertini",
      "start": 2954960,
      "text": "If you've got that, you've essentially convinced 70% of the jury that this is a worthy piece. Silver even more so, I guess it's a pyramid. And then obviously, gold is something that comes with a great responsibility for the jury. I mean, we're talking about the 20th anniversary. It kind of had that extra special feel that we had to really be quite unanimous about the voting for golds. But, I mean, ultimately from. I'll speak about the print before Moritz can speak about the online. But the print work, yes, it was dominated by the New York Times. No, I don't think there'll be any apologies for doing that, because this is just the best insurer of the entire submission population. It was just a set of really clear, powerful, informative and beautifully, elegantly designed pieces that you just couldn't argue with. And whilst there is and has been a lot of debate about the kind of sweeping of the board of awards from the New York Times, I mean.",
      "id": "ep_4_ut_230"
    },
    {
      "end": 3050632,
      "speaker": "Andy Kirk",
      "start": 3023756,
      "text": "Amanda Cox always says, good infographic is clear and compelling, and they nail that. You know, the clarity and the compellingness. They always have an interesting angle. You know, it's always like, ah, twist. But, yeah, at the same time, it's never gimmicky. It's always like dead, dead honest. I mean, in some. I found their put. I find their portfolio a bit safe in a sense, that they have. They have a formula.",
      "id": "ep_4_ut_231"
    },
    {
      "end": 3051296,
      "speaker": "Enrico Bertini",
      "start": 3050776,
      "text": "Yes.",
      "id": "ep_4_ut_232"
    },
    {
      "end": 3054260,
      "speaker": "Andy Kirk",
      "start": 3051408,
      "text": "Yeah, but this formula is so good. I mean.",
      "id": "ep_4_ut_233"
    },
    {
      "end": 3057624,
      "speaker": "Enrico Bertini",
      "start": 3056320,
      "text": "Why wouldn't you use it?",
      "id": "ep_4_ut_234"
    },
    {
      "end": 3075748,
      "speaker": "Andy Kirk",
      "start": 3057752,
      "text": "Exactly. So they, they should use it. And also, Sergio wrote something nice in email correspondence because he said, forget about all this. We have a readership to serve. This is what we think about. And, you know, and the readership of the New York Times loves the graphics and write, so, you know, so they do great.",
      "id": "ep_4_ut_235"
    },
    {
      "end": 3082132,
      "speaker": "Enrico Bertini",
      "start": 3075804,
      "text": "They submitted a lot of work and not everything got awarded. So there is a kind of proportion thing there as well.",
      "id": "ep_4_ut_236"
    },
    {
      "end": 3097146,
      "speaker": "Andy Kirk",
      "start": 3082276,
      "text": "But it is interesting, too, that this best of show piece, the Guantanamo prisoners, Enrico, probably you haven't seen it. It's a very simple line chart type thing where you see all prisoners in Guantanamo and how long they stayed and when they.",
      "id": "ep_4_ut_237"
    },
    {
      "end": 3097962,
      "speaker": "Enrico Bertini",
      "start": 3097298,
      "text": "Prisoners.",
      "id": "ep_4_ut_238"
    },
    {
      "end": 3141920,
      "speaker": "Andy Kirk",
      "start": 3098066,
      "text": "Yeah. And basically you can say one pixel. So left to right, you have the time. Top to bottom, you have all the prisoners arranged by countries or nationalities, and you can say one pixel in the graphic is one prisoner staying in Guantanamo for a certain time. You're nothing it. Right. And that's so powerful because it's so. It's. It's the absolute essence of information in there. You know, it's Tufte squared. And. But at the same time, it's. It's extreme. There's no. No illustrative aspect about it at all. You know, it's pure data. It's like the pure, brutal data and one best of show. And it was done in a day, by the way, or less than a day.",
      "id": "ep_4_ut_239"
    },
    {
      "end": 3152308,
      "speaker": "Enrico Bertini",
      "start": 3142300,
      "text": "And Jonathan Coram, who did the pieces, has wrote a really interesting blog post on his site about how he kind of constructed it and the kind of the evolution of that graphic.",
      "id": "ep_4_ut_240"
    },
    {
      "end": 3167440,
      "speaker": "Andy Kirk",
      "start": 3152364,
      "text": "Exactly. And the thing is, it wasn't also for nobody, it was a big graphic. It wasn't, you know, nobody would have called that the graphic of the year beforehand. But somehow, in this context of what we were judging, it just stood out for its brutal clarity.",
      "id": "ep_4_ut_241"
    },
    {
      "end": 3192850,
      "speaker": "Enrico Bertini",
      "start": 3167860,
      "text": "You've got this thing as well about when you see it in its raw, native format, with the story on the side and the headlines, it just works so beautifully. The balance of the graphic with the text on the side, it almost looks like text. It almost reads like a textual graphic. But, yeah, I mean, that was the best in show on the print side, which conveniently hands over to Moritz for the discussion about the online stuff.",
      "id": "ep_4_ut_242"
    },
    {
      "end": 3207814,
      "speaker": "Andy Kirk",
      "start": 3193230,
      "text": "Yes. And the funny part was that we had the same, best of the same gold medal for the interactive counter part of that graphic, which was online, much more narrative. So it had a play button where you could see the development over time.",
      "id": "ep_4_ut_243"
    },
    {
      "end": 3208774,
      "speaker": "Enrico Bertini",
      "start": 3207862,
      "text": "Completely different piece.",
      "id": "ep_4_ut_244"
    },
    {
      "end": 3227350,
      "speaker": "Andy Kirk",
      "start": 3208822,
      "text": "Completely different. Much more reduced to the. Much more easy to digest. So the print version was the big data version and the deep exploratory one. And the online version was, interestingly, the much more story focused one. I found that, yeah.",
      "id": "ep_4_ut_245"
    },
    {
      "end": 3228022,
      "speaker": "Enrico Bertini",
      "start": 3227390,
      "text": "Interesting twist.",
      "id": "ep_4_ut_246"
    },
    {
      "end": 3228430,
      "speaker": "Andy Kirk",
      "start": 3228086,
      "text": "Yeah.",
      "id": "ep_4_ut_247"
    },
    {
      "end": 3283828,
      "speaker": "Moritz Stefaner",
      "start": 3228510,
      "text": "So I wanted to ask a question to you guys regarding this sort of monopoly from the New York Times, and what do you think is the formula? I mean, I was reading the blog post about Malofiej in eager eyes by Robert, and he has a sentence where he says, let me see if I can find it. In fact, I'm convinced that the New York Times could easily be beaten up by a group of programmer journalists who spend a week researching tools available for their work. And I, on the one hand, it's not so. I tend to agree to some extent. I mean, my question is, is it because are they so powerful because they really have some special skills, or is it more the lack of these skills in the others?",
      "id": "ep_4_ut_248"
    },
    {
      "end": 3336840,
      "speaker": "Enrico Bertini",
      "start": 3283924,
      "text": "That is, I would say it's definitely not the latter. There's some really good work out there. But for me, I'm actually writing an article about the secrets of New York Times success at the moment, and by the time this podcast is out, it will publish. But for me, the key secret is the strength of the editorial process. The fact that the graphics team are so embedded in the journalist side of the business that they've got the real carved out storyline, the kind of carved out questions that they're trying to answer, and the graphics just respond to those prompts, that editorial context. Then you've got the visual identity, which is obviously an editorial process as well. This creates just a wonderful, consistent formula that kind of creates these really compelling and clear pieces, as Moritz said.",
      "id": "ep_4_ut_249"
    },
    {
      "end": 3378358,
      "speaker": "Andy Kirk",
      "start": 3338140,
      "text": "Yeah, but I think it's also not that easy in just saying, you know, they just need that hacker spirit. All the other, you know, agencies, I think they built up that culture over years, and you can see that, that there's so much consistency to their work and an effortlessness, you know, and it feels so light always there's no effort, and at the same time, you know, it's all the result of really hard work beforehand. Exactly. You know, as Matthew showed, so he can't do the taxi map in a day because he spent six months on building the framework for mapping or the election maps. Was that. Yes, and this is exactly the thing.",
      "id": "ep_4_ut_250"
    },
    {
      "end": 3415230,
      "speaker": "Enrico Bertini",
      "start": 3378494,
      "text": "And I think. I think it was. Linda Eckstein asked the question in the audience, you know, how come people beat the New York Times? Which was a kind of phrase that was coming up quite a lot. And I responded by saying, actually, that what they've done is it's actually easier to stay at the top because they've spent years and years crafting this wonderful winning formula. It's almost easier to stay at that level than it is to arrive at that level and get to that level. So it's not easy for others to attain these levels. But we did see some wonderful stuff, and it doesn't take much for silver to move up to a gold.",
      "id": "ep_4_ut_251"
    },
    {
      "end": 3489010,
      "speaker": "Andy Kirk",
      "start": 3415530,
      "text": "But I also have to say, generally, their work is very fit to such a competition where the judges have to agree, because it's easy to agree on the New York Times it's much harder to agree on something maybe more provocative or something more entertaining, you know, that might lack some depth or even something a different language, or if it's in a different language where not everybody gets the gist of the graphic straight away. And so it's not a fault of the competition, but I think their work also works well in that judging situation, I have to say. And we had much more, I would say much more entertaining or more provocative or more visually exciting work, I think, in the silvers and bronzes. But it's tough to convince like 8910 different, very different people. And they maybe they're more least common denominator in a sense. They make flawless work with an interesting journalistic twist and strong graphics. But sometimes they are too grown up, I think. So it's very serious what they do. And some people have just bring more rock and roll spirits, but it's hard to win the gold with rock and roll spirit.",
      "id": "ep_4_ut_252"
    },
    {
      "end": 3500942,
      "speaker": "Enrico Bertini",
      "start": 3490710,
      "text": "Yeah. And so the conclusion of the summit was the kind of firing squad announcement of the winners.",
      "id": "ep_4_ut_253"
    },
    {
      "end": 3523826,
      "speaker": "Andy Kirk",
      "start": 3501046,
      "text": "I love that. Yeah, there was a great moment. There was an Internet group though, Brazil, and they do lovely graphics, like vibrant colors and nice illustrations. It just warms your heart. They had this orange production piece I watched over and over again because I loved the animation so much. I mean, little content information wise, but it's so beautiful. The little trucks and the trees, they grow.",
      "id": "ep_4_ut_254"
    },
    {
      "end": 3524618,
      "speaker": "Enrico Bertini",
      "start": 3523938,
      "text": "That's right.",
      "id": "ep_4_ut_255"
    },
    {
      "end": 3528950,
      "speaker": "Andy Kirk",
      "start": 3524714,
      "text": "Yeah. So much fun and. Yeah, that's the other side, sort of. Yeah.",
      "id": "ep_4_ut_256"
    },
    {
      "end": 3534228,
      "speaker": "Enrico Bertini",
      "start": 3530770,
      "text": "And so that was, that was the. That was the conference, really.",
      "id": "ep_4_ut_257"
    },
    {
      "end": 3544040,
      "speaker": "Andy Kirk",
      "start": 3534324,
      "text": "Yeah, I mean, I just realized we learned so much, you know, it's crazy. So much things I wasn't aware of, and now they all there and confuse me.",
      "id": "ep_4_ut_258"
    },
    {
      "end": 3553692,
      "speaker": "Enrico Bertini",
      "start": 3545540,
      "text": "Yeah, I mean, we've both kind of independently said that it was probably the best conference we've been to in its own right.",
      "id": "ep_4_ut_259"
    },
    {
      "end": 3555244,
      "speaker": "Andy Kirk",
      "start": 3553796,
      "text": "It was one of the best, definitely.",
      "id": "ep_4_ut_260"
    },
    {
      "end": 3602004,
      "speaker": "Enrico Bertini",
      "start": 3555332,
      "text": "You know, I've already said on my blog it was one of the best weeks of my professional life. Just the. Every element of it, the judging, the people, the process, the place, the food, everything was just wonderful experience. But, yeah, I think for us, it's this interesting challenge of how do we recreate such an event in the visualization world? And is it something where actually you need to drop out of your own sphere into these other environments to learn and be influenced by new things that otherwise you're not quite tapping into? I mean, as we said, we didn't know about Brian's work before. Now we do, and we're kind of enriched by that. But how would we have otherwise come across that other than through some kind of serendipitous sort of discovery, really?",
      "id": "ep_4_ut_261"
    },
    {
      "end": 3610404,
      "speaker": "Moritz Stefaner",
      "start": 3602092,
      "text": "The problem is that there are so many communities, different communities around this organization. So I could mention cartographers if you don't work.",
      "id": "ep_4_ut_262"
    },
    {
      "end": 3611900,
      "speaker": "Andy Kirk",
      "start": 3610452,
      "text": "They have their own conferences, too.",
      "id": "ep_4_ut_263"
    },
    {
      "end": 3616326,
      "speaker": "Moritz Stefaner",
      "start": 3611940,
      "text": "They have their own conferences. They are world. And they have been doing this thing for ages.",
      "id": "ep_4_ut_264"
    },
    {
      "end": 3617110,
      "speaker": "Enrico Bertini",
      "start": 3616438,
      "text": "For ages.",
      "id": "ep_4_ut_265"
    },
    {
      "end": 3654596,
      "speaker": "Andy Kirk",
      "start": 3617150,
      "text": "Yeah, yeah, sure. They know everything. Yeah. So, and then, you know, I was at south by southwest and there were all the young web infographics people, and they don't know about the Malofiej scene as well, you know, so they have their own culture. I mean, it's only like two years old and pretty crappy, but they have their own culture, too. And so there's all these niches. That's. Yeah, I was struck by that over the last few weeks. How, and from the outside, you would think we are all doing the same or should at least be interested in what the other people are doing. Right. In the end. Yeah. I appreciate a lot that they invited us, Andy. Isn't that great?",
      "id": "ep_4_ut_266"
    },
    {
      "end": 3655228,
      "speaker": "Enrico Bertini",
      "start": 3654668,
      "text": "Absolutely.",
      "id": "ep_4_ut_267"
    },
    {
      "end": 3668580,
      "speaker": "Andy Kirk",
      "start": 3655284,
      "text": "You know, because for them, it was, it is sort of a stretch, like, oh, the data people. And should we really. But they went for it, and I think it was for everybody, for, for both sides. It was very enriching and.",
      "id": "ep_4_ut_268"
    },
    {
      "end": 3669060,
      "speaker": "Moritz Stefaner",
      "start": 3668660,
      "text": "Sorry.",
      "id": "ep_4_ut_269"
    },
    {
      "end": 3670092,
      "speaker": "Enrico Bertini",
      "start": 3669140,
      "text": "Go ahead, Mariko. Sorry.",
      "id": "ep_4_ut_270"
    },
    {
      "end": 3730960,
      "speaker": "Moritz Stefaner",
      "start": 3670116,
      "text": "I. I think we will have more and more of this kind of events where we try to merge people that come from different backgrounds because, as I said, it's so diverse. There are so many different sources and different communities. And I think this is a sign that visualization, as our whole field is growing. And necessarily, I think that's a natural development of the old field. Right. Visualization has been developed by so many different communities, and now these communities start understanding that there are other people who are doing the same thing or similar things. And, I mean, in a way, this is also happening in academia. So I am part of the organizing committee for this week, this year, and I've heard many discussions about the idea of, yeah, we have many people who are doing this out of academia, and some of them are pretty remarkable. Their work is pretty remarkable. How do we involve them in our conferences, our gatherings?",
      "id": "ep_4_ut_271"
    },
    {
      "end": 3731712,
      "speaker": "Enrico Bertini",
      "start": 3731120,
      "text": "That's right.",
      "id": "ep_4_ut_272"
    },
    {
      "end": 3739140,
      "speaker": "Moritz Stefaner",
      "start": 3731776,
      "text": "And I think this is going to happen a little bit everywhere. I don't know if this is. I don't know if this is going to happen with statisticians, but.",
      "id": "ep_4_ut_273"
    },
    {
      "end": 3780640,
      "speaker": "Enrico Bertini",
      "start": 3741120,
      "text": "Yeah, I mean, no one wants too many statisticians in a single conference. But I think, I mean, an example of how this worked so well on the judging process, for example, Washington. I mean, Robert was a wonderful judge. He was so forensic in his analysis of the pieces, but he was applying that also to information graphics, illustrations, and vice versa. Someone like Brian or Carl, when you explain to them from your perspective, a visualization piece, it illuminated their world as well. And we really need to find a way to kind of get this kind of cross fertilization of perspectives happening more often. Really?",
      "id": "ep_4_ut_274"
    },
    {
      "end": 3848746,
      "speaker": "Andy Kirk",
      "start": 3781700,
      "text": "Yeah. And it's interesting for me, it also, I had to rethink, again, what is visualization? What is information graphics? You know, just these basic questions which you don't really think about on a daily level. For instance, we had these graphics that were mostly annotated photographs. Also, New York Times stitched together photographs from a war scene or after a war event. Yeah, but annotated with what was there before or what the destroyed structures were. And Andrew was like, wow, that's brilliant. And I was like, yeah, it's really brilliant journalism. But listen, it's not information graphics, it's just a photo with labels. You know? Listen, you know, and we had similar discussions. And then the next day I woke up and I was like, of course, that's information graphics. What else? You know, so I was really confused. And then National Geographics does these things like reconstructing how, I don't know, ancient people looked like, or how the Titanic looked like, you know, is that an information graphic or is that just illustration just in quotation marks, or what is it afterwards? Is it science? You know?",
      "id": "ep_4_ut_275"
    },
    {
      "end": 3849590,
      "speaker": "Enrico Bertini",
      "start": 3848778,
      "text": "Well, that's it.",
      "id": "ep_4_ut_276"
    },
    {
      "end": 3851790,
      "speaker": "Andy Kirk",
      "start": 3849890,
      "text": "I'm totally confused now.",
      "id": "ep_4_ut_277"
    },
    {
      "end": 3911124,
      "speaker": "Enrico Bertini",
      "start": 3853490,
      "text": "Well, the thing about that project is that in its submission format, it was just an image of this. I think it's called hominid. Hominid face, this reconstruction. So it just looked like a face, an illustration. When you learned afterwards about the work that went into that, and it was built on millions of data points of research about bone structures, about muscle movements. You can't help but then start to think, oh, well, that is actually a visual representation of data, so maybe it is a visualization. So it is difficult. But, yeah, I guess we've come away with perhaps more questions than we have come away with answers, but I guess that's part of learning. I mean, for me, that's the wrap up of Malofiej, age 20, and what a great pleasure to be there and thanks to everybody who had any involvement in it. And I think Moritz would share that view. Really?",
      "id": "ep_4_ut_278"
    },
    {
      "end": 3981442,
      "speaker": "Andy Kirk",
      "start": 3911252,
      "text": "Yeah, I think it's going to stay with us for a long time. All these impressions and all the connections and so on. So if you have a chance to make it, I can definitely recommend. Definitely. Just go. Exactly. Don't think, just go. The other thing is, let's talk about. I haven't talked much about online, so I was an online judge. But I mean, it is traditionally very focused on newspapers, right. Or magazines. But as we all know, interesting stuff happens online also outside the traditional newspapers or traditional media publishers. And I had a sense of many of the things we appreciate in web visualization would have been appreciated too at the awards. And I think next year we should all hand in great stuff or ask others who we know have done great stuff. Hey, don't you want to hand that in? Because I think lots of projects that are around would qualify at good data journalism or good information graphics. Yeah, in that context too. And it would be great just to again, to bridge the worlds a bit more.",
      "id": "ep_4_ut_279"
    },
    {
      "end": 3985790,
      "speaker": "Enrico Bertini",
      "start": 3981546,
      "text": "Yeah, absolutely. So I think that's malaw fish for me.",
      "id": "ep_4_ut_280"
    },
    {
      "end": 3988430,
      "speaker": "Moritz Stefaner",
      "start": 3987530,
      "text": "Okay.",
      "id": "ep_4_ut_281"
    },
    {
      "end": 3993650,
      "speaker": "Andy Kirk",
      "start": 3988730,
      "text": "Over an hour. I mean, it's over an hour. And he talked so much. So I think it's okay.",
      "id": "ep_4_ut_282"
    },
    {
      "end": 3999270,
      "speaker": "Moritz Stefaner",
      "start": 3993730,
      "text": "Record for us. But it was really interesting. Thank you, guys.",
      "id": "ep_4_ut_283"
    },
    {
      "end": 4000740,
      "speaker": "Enrico Bertini",
      "start": 3999740,
      "text": "Thank you very much.",
      "id": "ep_4_ut_284"
    },
    {
      "end": 4002980,
      "speaker": "Moritz Stefaner",
      "start": 4000860,
      "text": "Now I want to go there next year.",
      "id": "ep_4_ut_285"
    },
    {
      "end": 4007080,
      "speaker": "Andy Kirk",
      "start": 4003140,
      "text": "Yeah, you should. I mean, you're still fresh and unspoiled and everything.",
      "id": "ep_4_ut_286"
    },
    {
      "end": 4010068,
      "speaker": "Enrico Bertini",
      "start": 4009020,
      "text": "Unbroken.",
      "id": "ep_4_ut_287"
    },
    {
      "end": 4014000,
      "speaker": "Moritz Stefaner",
      "start": 4010204,
      "text": "I have to find a way to get an invitation, actually. How did you make it?",
      "id": "ep_4_ut_288"
    },
    {
      "end": 4030760,
      "speaker": "Enrico Bertini",
      "start": 4015380,
      "text": "It costs a lot of money, a lot of bribes. And part of the punishment was this set of dance moves I was asked and commanded to produce on the Thursday evening, which I didn't want to do. But you know, you have to do something.",
      "id": "ep_4_ut_289"
    },
    {
      "end": 4035286,
      "speaker": "Andy Kirk",
      "start": 4031350,
      "text": "I hear you have to be nice to past judges and speakers. I think that's the key.",
      "id": "ep_4_ut_290"
    },
    {
      "end": 4045650,
      "speaker": "Enrico Bertini",
      "start": 4035318,
      "text": "Yeah, that's the key. So look through the Malofiej edge catalogue and see all the listen judges. People like Stephen Fu can be the first line of attack.",
      "id": "ep_4_ut_291"
    },
    {
      "end": 4049610,
      "speaker": "Moritz Stefaner",
      "start": 4046270,
      "text": "I know a few of the judges. Let's see what we can do.",
      "id": "ep_4_ut_292"
    },
    {
      "end": 4056222,
      "speaker": "Andy Kirk",
      "start": 4053310,
      "text": "Okay. Well, it's great having you, Andy. Fantastic.",
      "id": "ep_4_ut_293"
    },
    {
      "end": 4057222,
      "speaker": "Enrico Bertini",
      "start": 4056246,
      "text": "Thank you very much.",
      "id": "ep_4_ut_294"
    },
    {
      "end": 4071592,
      "speaker": "Andy Kirk",
      "start": 4057406,
      "text": "Actually, I mean, we first booked you, let's say, for, for a totally different data source on teaching and learning visualization because actually that's Andy's sort of home turf. So we might do that at a later stage, right?",
      "id": "ep_4_ut_295"
    },
    {
      "end": 4072608,
      "speaker": "Enrico Bertini",
      "start": 4071656,
      "text": "Oh, absolutely.",
      "id": "ep_4_ut_296"
    },
    {
      "end": 4074040,
      "speaker": "Moritz Stefaner",
      "start": 4072664,
      "text": "We definitely have to do it more.",
      "id": "ep_4_ut_297"
    },
    {
      "end": 4077536,
      "speaker": "Andy Kirk",
      "start": 4074080,
      "text": "So this one was more the breaking news. We came back from Spain.",
      "id": "ep_4_ut_298"
    },
    {
      "end": 4078208,
      "speaker": "Enrico Bertini",
      "start": 4077608,
      "text": "Sorry.",
      "id": "ep_4_ut_299"
    },
    {
      "end": 4081688,
      "speaker": "Andy Kirk",
      "start": 4078344,
      "text": "But we can do the other one too. I'd love to.",
      "id": "ep_4_ut_300"
    },
    {
      "end": 4083784,
      "speaker": "Enrico Bertini",
      "start": 4081744,
      "text": "Yeah, yeah. Cool. Absolutely.",
      "id": "ep_4_ut_301"
    },
    {
      "end": 4090736,
      "speaker": "Moritz Stefaner",
      "start": 4083832,
      "text": "Yeah, yeah, yeah. And it's one of the things that our listeners want to listen to the most other people.",
      "id": "ep_4_ut_302"
    },
    {
      "end": 4095100,
      "speaker": "Andy Kirk",
      "start": 4090808,
      "text": "So it was a common request. They want to listen to other people.",
      "id": "ep_4_ut_303"
    },
    {
      "end": 4098064,
      "speaker": "Moritz Stefaner",
      "start": 4096360,
      "text": "Yeah, I think we have to do it soon.",
      "id": "ep_4_ut_304"
    },
    {
      "end": 4108640,
      "speaker": "Andy Kirk",
      "start": 4098152,
      "text": "Fantastic. I love our listeners. Have I mentioned that I do as well? Of course. Good, good.",
      "id": "ep_4_ut_305"
    },
    {
      "end": 4128942,
      "speaker": "Enrico Bertini",
      "start": 4108800,
      "text": "I'd also like to hear from listeners of this particular podcast the most unusual places that people are listening to the podcast. So in a bath, in a helicopter, in prison, who knows? So send us in details of where you've listened to this particular podcast and let's see the most unusual.",
      "id": "ep_4_ut_306"
    },
    {
      "end": 4136798,
      "speaker": "Moritz Stefaner",
      "start": 4129046,
      "text": "I think you would notice a peek on the bathroom. If you have a bar chart, you.",
      "id": "ep_4_ut_307"
    },
    {
      "end": 4150970,
      "speaker": "Andy Kirk",
      "start": 4136814,
      "text": "Would have a long bar. We can do some statistics if we get people. Let's wrap it up guys, before we descend into nonsense. I mean, as if that happened.",
      "id": "ep_4_ut_308"
    },
    {
      "end": 4154270,
      "speaker": "Enrico Bertini",
      "start": 4152510,
      "text": "Gracias. Adios.",
      "id": "ep_4_ut_309"
    },
    {
      "end": 4162662,
      "speaker": "Andy Kirk",
      "start": 4154350,
      "text": "Hasta luego, amigo. Toast, beer, poffovo toster sauce.",
      "id": "ep_4_ut_310"
    },
    {
      "end": 4166958,
      "speaker": "Enrico Bertini",
      "start": 4162806,
      "text": "Oh, come on. All right, goodbye guys.",
      "id": "ep_4_ut_311"
    },
    {
      "end": 4169172,
      "speaker": "Andy Kirk",
      "start": 4167054,
      "text": "Goodbye was great. Bye.",
      "id": "ep_4_ut_312"
    }
  ],
  "confidence": 0.904485469691593,
  "audio_duration": 4177,
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_status_code": null,
  "webhook_auth": false,
  "webhook_auth_header_name": null,
  "speed_boost": false,
  "auto_highlights_result": null,
  "auto_highlights": false,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_audio_quality": null,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "content_safety": false,
  "iab_categories": true,
  "content_safety_labels": {
    "status": "unavailable",
    "results": [],
    "summary": {}
  },
  "language_detection": false,
  "language_detection_threshold": null,
  "language_confidence": null,
  "custom_spelling": null,
  "throttled": false,
  "auto_chapters": true,
  "summarization": false,
  "summary_type": null,
  "summary_model": null,
  "custom_topics": false,
  "topics": [],
  "speech_threshold": null,
  "speech_model": "best",
  "chapters": [
    {
      "summary": "Andy Kirk from Visualizingdata. com is the first guest of data stories. He's from the UK and he's not David McCandless. We wanted a more exotic voice than ours. Here we are. This is my gift to the world.",
      "gist": "The First Guest of Data Stories",
      "headline": "Data stories welcomes Andy Kirk from Visualizingdata. com",
      "start": 10120,
      "end": 109980,
      "id": "ep_4_ch_0"
    },
    {
      "summary": "The episode will be pretty much about your experience at Malofiej 20. It was a parallel subject in many ways, parallel context of infographics and print online journalism. So I'm really curious to hear what you have to say.",
      "gist": "Malofiej 20",
      "headline": "This episode will be about your experience at Malofiej 20",
      "start": 112080,
      "end": 260218,
      "id": "ep_4_ch_1"
    },
    {
      "summary": "It is basically a world summit for the infographics world, and everybody who has a big name comes there. The whole event carries this rich tradition of infographics. For me, it was very educating to learn about this world.",
      "gist": "The World Summit of Infographics",
      "headline": "Mauritsh attended the 20th annual Infographics Summit",
      "start": 260274,
      "end": 332878,
      "id": "ep_4_ch_2"
    },
    {
      "summary": "The organization is very much a voluntary process. Every judge is invited also for a talk. The whole week was packed. There was the workshop, there were the talks, there was the celebrations. And it really enriched the judging process.",
      "gist": "The World's Top Infographics Judge's Conference",
      "headline": "The organization is very much a voluntary process. Javier Herrier leads on the organization",
      "start": 332974,
      "end": 624000,
      "id": "ep_4_ch_3"
    },
    {
      "summary": "The conference kicked off with. In the morning with Gonzalo. Pelser. He said, basically, it's all very superficial news. The whole business of reporting has become superficial. It was a bit of a provocative general wake up call, I think.",
      "gist": "The First Day of the Conference",
      "headline": "So the conference kicked off with. In the morning with Gonzalo Pelser",
      "start": 624300,
      "end": 733070,
      "id": "ep_4_ch_4"
    },
    {
      "summary": "Next we had Andrew van der, or AVM 500, and he did an excellent speech on the tyranny of the pixel. And then we had Moritz Stefaner, if. I've said that right, sea celebrity. The beauty of this event was that the real blend of mix of talks.",
      "gist": "The Future of Networking",
      "headline": "Next we had Andrew van der on situated and physical visualization forms",
      "start": 735250,
      "end": 973454,
      "id": "ep_4_ch_5"
    },
    {
      "summary": "Next up was Andy. Kirk talked about big data, incidentally. Lots of quotes from contemporary digital data people. In a way, visualization is very limited with big data. The purpose of the talk was to avoid going too deep in the technology side and talk about human factors.",
      "gist": "The challenges of big data",
      "headline": "Next up was Andy. Andy, big data. It was really a good presentation",
      "start": 973542,
      "end": 1141728,
      "id": "ep_4_ch_6"
    },
    {
      "summary": "It's extremely easy today for any person working with data to end up dealing with quite big data sets. But if this data is also constantly changing, then you have a problem. Andy will be touring the big data conference circuit this year.",
      "gist": "Andy Cohen on Big Data",
      "headline": "Andy: It's easy today to deal with quite big data sets",
      "start": 1141864,
      "end": 1372500,
      "id": "ep_4_ch_7"
    },
    {
      "summary": "After Sheelagh Pontis, we had Brian Christie. Brian is a very, very well known illustrator and fine artist. His talk was very language, very sort of relaxed. On his works and his process. And then in the afternoon we had Simon Rogers from the Guardian. Talked for like an hour and a half.",
      "gist": "The design conference schedule",
      "headline": "So following me was Sheelagh Pontis on the design process",
      "start": 1374920,
      "end": 1725900,
      "id": "ep_4_ch_8"
    },
    {
      "summary": "And that was followed by our friend Robert, Robert Kosara, who runs the website eager eyes. It's this kind of really rich experience that we all went through of being relative strangers in this infographics rich world. That was one of the most important things from the event, really.",
      "gist": "Seems Like A Stranger Asked Who Knows Me",
      "headline": "Moritz: One of the most important things from the event was infographics",
      "start": 1726600,
      "end": 1789718,
      "id": "ep_4_ch_9"
    },
    {
      "summary": "Robert's talk was, once again, very interesting. Much of it was talking about kind of things like weight of colour. And I think more people should try and investigate this systematically. Once again, just kind of brought an end to a really rich coverage today.",
      "gist": "The Future of Illustration",
      "headline": "Robert's talk on weight of colour was very interesting",
      "start": 1789774,
      "end": 1918500,
      "id": "ep_4_ch_10"
    },
    {
      "summary": "The Germans prepared their talk to the last minute with a complete movie, basically playing with an animated infographic narrating their story. The downside might have been it was a bit rigid because they were actually like reading that hex from little paper cards. But it was still a great talk.",
      "gist": "The Germans",
      "headline": "The Germans did something very German at their talk. Yeah. Absolutely. And it kicked off with Anna Gerdes",
      "start": 1919280,
      "end": 2021310,
      "id": "ep_4_ch_11"
    },
    {
      "summary": "And then we had Nigel Holmes. Nigel Holmes officially carries the title of greatest infographic artist alive. Nigel's been wearing blue since the age of 17, clothes wise, and so he's obsessed with the color blue. That was a real highlight for me.",
      "gist": "A talk by Nigel Holmes",
      "headline": "Nigel Holmes is probably the greatest infographic artist alive",
      "start": 2021730,
      "end": 2118250,
      "id": "ep_4_ch_12"
    },
    {
      "summary": "Following Nigel, we had Matthew block from the New York Times. He shows some inside tricks of how he created some, some of his maps. And then we had Ginny Mason from Nat Geo, who talked about a number of kind of cartography projects.",
      "gist": "The New York Times' Map of the World",
      "headline": "Matthew block from the New York Times talks about some of his maps",
      "start": 2119670,
      "end": 2353810,
      "id": "ep_4_ch_13"
    },
    {
      "summary": "And then we had Carl, Carl de Torres, who's from San Francisco. He uses infographics to communicate on a whole different level, like more on the gut. Jaime, Sarah. And this was a really interesting piece. How do you visually represent things that are invisible?",
      "gist": "The infographics at the conference",
      "headline": "Carl de Torres is one of the top graphic designers in Cal",
      "start": 2354350,
      "end": 2656590,
      "id": "ep_4_ch_14"
    },
    {
      "summary": "And then we had Sergio Pisania. He's the. foreign graphics editor of the New York Times. He talked not just about graphics, but also about the journalistic process. And then we kind of moved into this interesting process of the awards.",
      "gist": "A Taste of the Festival",
      "headline": "Sergio Pisania talked about the journalistic process at the conference",
      "start": 2657570,
      "end": 2805396,
      "id": "ep_4_ch_15"
    },
    {
      "summary": "You can win a gold medal, silver medal, bronze in different categories online or print. We had three days to go through 1500 entries, of which about 1112 hundred were print and 3400 were online. The print work was dominated by the New York Times. Most important thing here is the fact that a bronze medal is a really wonderful award.",
      "gist": "The New York Times Magazine",
      "headline": "Moritz: We had 1500 entries, of which about 1112 were online",
      "start": 2805548,
      "end": 3082132,
      "id": "ep_4_ch_16"
    },
    {
      "summary": "Enrico: This best of show piece, the Guantanamo prisoners, Enrico, probably you haven't seen it. It's a very simple line chart type thing where you see all prisoners in Guantanamo and how long they stayed. The interactive counter part of that graphic, which was online, was much more narrative.",
      "gist": "The Guantanamo Prisoners",
      "headline": "Best of show graphic for Guantanamo prisoners stands out for its brutal clarity",
      "start": 3082276,
      "end": 3228430,
      "id": "ep_4_ch_17"
    },
    {
      "summary": "For me, the key secret is the strength of the editorial process. The fact that the graphics team are so embedded in the journalist side of the business. This creates just a wonderful, consistent formula that kind of creates these really compelling and clear pieces.",
      "gist": "What Is The Secret to The New York Times' Graphics",
      "headline": "What do you think is the formula behind the New York Times success",
      "start": 3228510,
      "end": 3381638,
      "id": "ep_4_ch_18"
    },
    {
      "summary": "Andy: How come people beat the New York Times? Andy: It's actually easier to stay at the top because they've spent years crafting this wonderful winning formula. He says the conference was one of the best of his professional life. Andy: How do we recreate such an event in the visualization world?",
      "gist": "The New York Times Visualization Competition",
      "headline": "Linda Eckstein asked the question in the audience, how come people beat the New York Times",
      "start": 3381654,
      "end": 3669060,
      "id": "ep_4_ch_19"
    },
    {
      "summary": "Malofiej: I think we will have more and more of this kind of events where we try to merge people that come from different backgrounds. He says this is a sign that visualization, as our whole field is growing. Malofiej: We need to find a way to get this cross fertilization of perspectives happening more often.",
      "gist": "The Future of Visualization",
      "headline": "Mariko: I think this is a sign that visualization is growing",
      "start": 3669140,
      "end": 3924410,
      "id": "ep_4_ch_20"
    },
    {
      "summary": "The other thing is, let's talk about. online, so I was an online judge. I had a sense of many of the things we appreciate in web visualization would have been appreciated too at the awards. Next year we should all hand in great stuff or ask others who we know have done great stuff.",
      "gist": "The Future of Web Data visualization",
      "headline": "Andy: We definitely need to do more web visualization awards. We definitely have to do it more",
      "start": 3925990,
      "end": 4108640,
      "id": "ep_4_ch_21"
    },
    {
      "summary": "I'd also like to hear from listeners of this particular podcast the most unusual places that people are listening to the podcast. So in a bath, in a helicopter, in prison, who knows? Send us in details of where you've listened to this podcast.",
      "gist": "The Most Unusual Places People Are Listening To Podcast",
      "headline": "Send us your most unusual places you've listened to this podcast",
      "start": 4108800,
      "end": 4169172,
      "id": "ep_4_ch_22"
    }
  ],
  "disfluencies": false,
  "entity_detection": false,
  "sentiment_analysis": false,
  "sentiment_analysis_results": null,
  "entities": null,
  "speakers_expected": null,
  "summary": null,
  "custom_topics_results": null,
  "episode_num": 4,
  "episode_metadata": {
    "speakers": [
      "Enrico Bertini",
      "Moritz Stefaner",
      "Andy Kirk"
    ],
    "WPid": "107",
    "url": "https://datastori.es/podlove/file/210/s/feed/c/mp3/datastories-04.mp3",
    "episode_title": "Malofiej 20 (with Andy Kirk)"
  }
}