{
  "id": "e28a279d-5807-4b42-a78a-e77e2c6ff554",
  "language_model": "assemblyai_default",
  "acoustic_model": "assemblyai_default",
  "language_code": "en_us",
  "status": "completed",
  "audio_url": "https://datastori.es/podlove/file/459/s/feed/c/mp3/Datastories-41.mp3",
  "utterances": [
    {
      "end": 14790,
      "speaker": "Enrico Bertini",
      "start": 10280,
      "text": "Hi everyone. Data stories number 41. I'm Moritz. How are you?",
      "id": "ep_41_ut_0"
    },
    {
      "end": 16302,
      "speaker": "Moritz Stefaner",
      "start": 14830,
      "text": "Enrico, how's life?",
      "id": "ep_41_ut_1"
    },
    {
      "end": 18490,
      "speaker": "Enrico Bertini",
      "start": 16446,
      "text": "It's great. Beautiful day today.",
      "id": "ep_41_ut_2"
    },
    {
      "end": 23766,
      "speaker": "Moritz Stefaner",
      "start": 19070,
      "text": "Very good. Good for you. I'm a bit stressed out. It's a busy time.",
      "id": "ep_41_ut_3"
    },
    {
      "end": 27730,
      "speaker": "Enrico Bertini",
      "start": 23798,
      "text": "Oh, I didn't say that I'm not stressed out. I just said that it's a beautiful day.",
      "id": "ep_41_ut_4"
    },
    {
      "end": 31610,
      "speaker": "Moritz Stefaner",
      "start": 29750,
      "text": "Other people seem to enjoy life.",
      "id": "ep_41_ut_5"
    },
    {
      "end": 34050,
      "speaker": "Enrico Bertini",
      "start": 31970,
      "text": "Stressed out at the end of September.",
      "id": "ep_41_ut_6"
    },
    {
      "end": 35778,
      "speaker": "Moritz Stefaner",
      "start": 34210,
      "text": "Yeah, it's always the worst.",
      "id": "ep_41_ut_7"
    },
    {
      "end": 39710,
      "speaker": "Enrico Bertini",
      "start": 35874,
      "text": "Yeah. We should start having vacation at the end of September, I guess.",
      "id": "ep_41_ut_8"
    },
    {
      "end": 42474,
      "speaker": "Moritz Stefaner",
      "start": 40930,
      "text": "Yeah, next year.",
      "id": "ep_41_ut_9"
    },
    {
      "end": 44090,
      "speaker": "Enrico Bertini",
      "start": 42562,
      "text": "Next year, yeah.",
      "id": "ep_41_ut_10"
    },
    {
      "end": 47362,
      "speaker": "Moritz Stefaner",
      "start": 44250,
      "text": "But we'll meet soon. I'm preparing for Paris already.",
      "id": "ep_41_ut_11"
    },
    {
      "end": 50386,
      "speaker": "Enrico Bertini",
      "start": 47546,
      "text": "Oh, yeah. So let's see then.",
      "id": "ep_41_ut_12"
    },
    {
      "end": 53242,
      "speaker": "Moritz Stefaner",
      "start": 50458,
      "text": "And I will be coming to New York in December, I think.",
      "id": "ep_41_ut_13"
    },
    {
      "end": 54090,
      "speaker": "Enrico Bertini",
      "start": 53386,
      "text": "Wow.",
      "id": "ep_41_ut_14"
    },
    {
      "end": 62282,
      "speaker": "Moritz Stefaner",
      "start": 54250,
      "text": "Yeah. So I have a follow up project with Lev and his team and we will show something at New York public Library. And the opening is in December.",
      "id": "ep_41_ut_15"
    },
    {
      "end": 66874,
      "speaker": "Enrico Bertini",
      "start": 62466,
      "text": "So we should organize some data stories, parties everywhere, meet up or something.",
      "id": "ep_41_ut_16"
    },
    {
      "end": 67458,
      "speaker": "Moritz Stefaner",
      "start": 66922,
      "text": "We could do that.",
      "id": "ep_41_ut_17"
    },
    {
      "end": 71858,
      "speaker": "Enrico Bertini",
      "start": 67474,
      "text": "Maybe some, maybe we should organize something at this or a dinner in a.",
      "id": "ep_41_ut_18"
    },
    {
      "end": 76026,
      "speaker": "Moritz Stefaner",
      "start": 71874,
      "text": "Nice restaurant for like 50 people. We'll see.",
      "id": "ep_41_ut_19"
    },
    {
      "end": 95264,
      "speaker": "Enrico Bertini",
      "start": 76098,
      "text": "Yeah, yeah, yeah. If you guys are listening to that and you are going to visit, let us know and we can maybe organize something, at least a beer or whatever. Right. So you know this as this kind of, it's called this kind of meetings. They are called birds of a feather.",
      "id": "ep_41_ut_20"
    },
    {
      "end": 95912,
      "speaker": "Moritz Stefaner",
      "start": 95432,
      "text": "Okay.",
      "id": "ep_41_ut_21"
    },
    {
      "end": 100540,
      "speaker": "Enrico Bertini",
      "start": 95976,
      "text": "Organize that on the fly. Maybe we can do one of that. That would be cool.",
      "id": "ep_41_ut_22"
    },
    {
      "end": 105420,
      "speaker": "Moritz Stefaner",
      "start": 101160,
      "text": "We definitely are two birds of a feather. So I think we qualify.",
      "id": "ep_41_ut_23"
    },
    {
      "end": 116060,
      "speaker": "Enrico Bertini",
      "start": 106160,
      "text": "Yeah. So we have a special guest as usual today, Lisa Strausfeld from Bloomberg. Hi, Lisa. How are you?",
      "id": "ep_41_ut_24"
    },
    {
      "end": 119960,
      "speaker": "Lisa Strausfeld",
      "start": 116820,
      "text": "Good, thanks. Nice to be here. How are you?",
      "id": "ep_41_ut_25"
    },
    {
      "end": 143880,
      "speaker": "Enrico Bertini",
      "start": 121460,
      "text": "We are great. Yeah. We are so happy here. So I don't know how much of an introduction you need because probably most of our listeners already know you, but we normally ask our guests to introduce themselves. So do you want to tell us a little bit who you are? What's your background, what you are doing at Bloomberg?",
      "id": "ep_41_ut_26"
    },
    {
      "end": 188090,
      "speaker": "Lisa Strausfeld",
      "start": 145490,
      "text": "Sure. I'm Lisa Strausfeld, as you know. And right now I am, I like to call myself a data visualization entrepreneur. I'm a designer. I have a technology background. Right now, my title, if I were to use one, is creative director at Bloomberg View. And I moved to view in June. I founded and created the Bloomberg visual data team, which is still running strong in the new media group at Bloomberg. That's what I'm doing now.",
      "id": "ep_41_ut_27"
    },
    {
      "end": 204810,
      "speaker": "Moritz Stefaner",
      "start": 189270,
      "text": "Right. And how did it all start? We like to ask our guests where they come from, how they got started in the whole, in the whole computer and database thing. So what was the beginning for you? Did you own a personal computer?",
      "id": "ep_41_ut_28"
    },
    {
      "end": 207454,
      "speaker": "Lisa Strausfeld",
      "start": 205510,
      "text": "Did I own a personal computer?",
      "id": "ep_41_ut_29"
    },
    {
      "end": 208822,
      "speaker": "Moritz Stefaner",
      "start": 207622,
      "text": "Yeah. Like in the eighties.",
      "id": "ep_41_ut_30"
    },
    {
      "end": 209814,
      "speaker": "Lisa Strausfeld",
      "start": 208886,
      "text": "In the eighties.",
      "id": "ep_41_ut_31"
    },
    {
      "end": 210966,
      "speaker": "Moritz Stefaner",
      "start": 209982,
      "text": "C 64?",
      "id": "ep_41_ut_32"
    },
    {
      "end": 211810,
      "speaker": "Enrico Bertini",
      "start": 211038,
      "text": "Atari.",
      "id": "ep_41_ut_33"
    },
    {
      "end": 242750,
      "speaker": "Lisa Strausfeld",
      "start": 214350,
      "text": "No, actually, I didn't grow up with a computer. I have a big birthday coming up, which I won't mention. Is the sound okay, by the way? Are you guys. Yeah, it is okay. So, yeah, I feel like. Well, actually, I am officially the last year of the baby boomer generation, so you can figure that out.",
      "id": "ep_41_ut_34"
    },
    {
      "end": 245666,
      "speaker": "Moritz Stefaner",
      "start": 243930,
      "text": "Totally. Wikipedia does.",
      "id": "ep_41_ut_35"
    },
    {
      "end": 266569,
      "speaker": "Lisa Strausfeld",
      "start": 245738,
      "text": "And it's interesting. It's interesting what that means relative to computing culture and digital culture, because my generation is, you know, on that line, basically. So, yeah, I started in college getting into computing.",
      "id": "ep_41_ut_36"
    },
    {
      "end": 268529,
      "speaker": "Moritz Stefaner",
      "start": 267229,
      "text": "And what did you study?",
      "id": "ep_41_ut_37"
    },
    {
      "end": 300720,
      "speaker": "Lisa Strausfeld",
      "start": 269669,
      "text": "I studied art history. From the age of five, I had planned to be an architect, and my mother was an urban planner and kind of always wanted to be an architect. And I was, you know, good at art and math. And so I had planned to be an architect. And then I went to. I went to Brown and I studied art history and discovered computer science kind of accidentally.",
      "id": "ep_41_ut_38"
    },
    {
      "end": 303080,
      "speaker": "Enrico Bertini",
      "start": 302300,
      "text": "Wow.",
      "id": "ep_41_ut_39"
    },
    {
      "end": 307044,
      "speaker": "Moritz Stefaner",
      "start": 304060,
      "text": "And you switched over, or did you finish both in parallel or.",
      "id": "ep_41_ut_40"
    },
    {
      "end": 332900,
      "speaker": "Lisa Strausfeld",
      "start": 307092,
      "text": "No, I mean, Brown has a really loose curriculum. I majored in art history. And you could say I had a minor in computer science, but really I had one. I was very goal oriented with computer science, which is that I wanted to take this computer graphics class with Andy Van Damme. And it was a graduate level class. And I took just the. I think it was like five courses I needed to get to that class.",
      "id": "ep_41_ut_41"
    },
    {
      "end": 334300,
      "speaker": "Enrico Bertini",
      "start": 333520,
      "text": "Wow.",
      "id": "ep_41_ut_42"
    },
    {
      "end": 339648,
      "speaker": "Moritz Stefaner",
      "start": 335280,
      "text": "Yeah. Just to be able to do it, like, from a skills level. Or was it.",
      "id": "ep_41_ut_43"
    },
    {
      "end": 414050,
      "speaker": "Lisa Strausfeld",
      "start": 339744,
      "text": "Yeah, I was just. I mean, I took this intro class for non majors and Pascal and just got really into it. And then was a ta for the class and took a bunch of other courses. I mean, I just loved it. And I loved the. Brown at that time, built this lab called Gould Lab with these workstations. It was really cool space, and I would spend a. I love that kind of studio environment. It was kind of like going to architecture school, which I did after Brown. And I worked late into the night with my classmates and did a lot of 3d computing kind of early on. I mean, it was the days of writing ray tracing algorithms, and I wrote like, a shadow algorithm. Anyway, it was great fun. And also, because I was focused on architecture, I was already thinking three dimensionally. And I think, yeah, something really came together about that. And then, of course, I was studying art history at the same time, so it was all very.",
      "id": "ep_41_ut_44"
    },
    {
      "end": 415934,
      "speaker": "Moritz Stefaner",
      "start": 414550,
      "text": "It's an amazing combination.",
      "id": "ep_41_ut_45"
    },
    {
      "end": 417770,
      "speaker": "Lisa Strausfeld",
      "start": 416062,
      "text": "Yeah, it was an amazing combination.",
      "id": "ep_41_ut_46"
    },
    {
      "end": 426710,
      "speaker": "Moritz Stefaner",
      "start": 418790,
      "text": "And how was it like to program graphics at that time? Like, was it very tedious? Lots of numbers? Did you have to memorize a lot or how.",
      "id": "ep_41_ut_47"
    },
    {
      "end": 427222,
      "speaker": "Lisa Strausfeld",
      "start": 426830,
      "text": "Yeah.",
      "id": "ep_41_ut_48"
    },
    {
      "end": 428414,
      "speaker": "Moritz Stefaner",
      "start": 427286,
      "text": "Was it very low level?",
      "id": "ep_41_ut_49"
    },
    {
      "end": 474950,
      "speaker": "Lisa Strausfeld",
      "start": 428462,
      "text": "Probably lots of it was. It was Gl. It was not open yet. No, wait. No, sorry. It wasn't Gl. I'm getting confused. When I was at the media lab. Oh, no, no. When I was at the media lab. Sorry. We were programming in OpenGL, but when I was at the lab. I'm sorry. When I was at Brown, it was like the first version of Gl. I mean, it was pretty low level in that there were, you know, matrices to push and pop, but. And it was. You know, there was. We were programming in C. It wasn't even ansi C at the time. It was just c. Yeah, but it was very. It seemed very natural to me somehow from. From the beginning.",
      "id": "ep_41_ut_50"
    },
    {
      "end": 500996,
      "speaker": "Enrico Bertini",
      "start": 475250,
      "text": "Yeah. That's really interesting, because one of the questions that we get most often is whether in order to become a visualization expert, you need to code or be able to code. And I think my answer, and I think Moritz says the same all the time, is that. Yes, well, of course, you can get away without coding, but if you code, it's so much better. Right. So I'm curious to hear, what's your opinion there?",
      "id": "ep_41_ut_51"
    },
    {
      "end": 619628,
      "speaker": "Lisa Strausfeld",
      "start": 501188,
      "text": "Well, Maya, it's interesting. This is a very good question right now. Two things to say about that. First, I think that in order to be a 21st century educated citizen, I think everyone needs to take one programming class. And that, which seems important, even if you don't do anything with it afterwards, and you go into business or retail or whatever you're going to do, it just seems like a core part of a liberal arts education these days, just to understand how the world works and how machines talk to each other and what the protocol. To understand the idea of a protocol, I think it's kind of essential. I actually, you know, I was coding in college, and then I went to architecture school, and I did my draw. My. I didn't really touch a computer for years until right before I went to the media lab at MIT. And then I was programming until about. I guess, until I started at Pentagram, which was basically until about 2000. 2001. Anyway, here we are 13 years later, and I have this crazy idea and need that I have to start programming again. And I haven't done any. I haven't really done any web development, per se. I was sort of used to a very proper programming environment with a debugger and with, you know, and when I first, like, JavaScript was so offensive to me when I first started looking at it, but now I feel like I, again, it's kind of crazy at this moment in my career, but I really am seriously thinking about getting back into it.",
      "id": "ep_41_ut_52"
    },
    {
      "end": 635732,
      "speaker": "Moritz Stefaner",
      "start": 619804,
      "text": "It has much improved. Like, yes, I mean, I was, you know, I was always a flash guy, so I know what you mean with like, it's nice to have like a coherent environment and a run time and. No, really, it's. Yeah, you have a sandbox you can work against, right?",
      "id": "ep_41_ut_53"
    },
    {
      "end": 636156,
      "speaker": "Lisa Strausfeld",
      "start": 635796,
      "text": "Yeah.",
      "id": "ep_41_ut_54"
    },
    {
      "end": 648348,
      "speaker": "Moritz Stefaner",
      "start": 636228,
      "text": "And the web used to be such a mess, but now the last two or three years, amazing, like new tools and technologies have really appeared and everything has become much, much more, I don't know, much more workable.",
      "id": "ep_41_ut_55"
    },
    {
      "end": 652600,
      "speaker": "Lisa Strausfeld",
      "start": 648444,
      "text": "So what is your tool of choice right now? What are you coding in?",
      "id": "ep_41_ut_56"
    },
    {
      "end": 691118,
      "speaker": "Moritz Stefaner",
      "start": 652980,
      "text": "Yeah, I mean the web based stuff is mostly svg graphics with D3, but I coded for instance in coffeescript instead of JavaScript, which is much more sane way of programming, much nicer, much closer to Python in the end. And then you don't use css anymore, but Sass, which is also like a reduced version of that, and you compile that to CSS and the Chrome browser gives you really nice debugging tools and you can really set breakpoints and things like that. All of that has changed. So I agree, it's a great time to start that now.",
      "id": "ep_41_ut_57"
    },
    {
      "end": 743730,
      "speaker": "Lisa Strausfeld",
      "start": 691214,
      "text": "Again, it seems kind of crazy, and this might be a theme that comes up in our conversation, I'll even just put it out there. But I know we're going to talk about data visualization, but just the idea of scale. I think about scale a lot. I think scale is kind of key to innovation. It also happens to be key to what I'm interested in. And I find that I go through these points in my career where I want to sort of scale it up, which means a lot of collaboration, you know, building a team, being part of a big organization like Bloomberg that has a lot of data and a broad reach. And then it gets to a point where I just feel like I need to get back to some kind of hands on making experience. But it kind of goes in these waves.",
      "id": "ep_41_ut_58"
    },
    {
      "end": 801380,
      "speaker": "Enrico Bertini",
      "start": 745430,
      "text": "I share exactly the same kind of experience because even I am a professor in the department of computer science and Engineering, and I can tell you I don't have much time for do any coding myself. And of course I have to think about. So when I. Yeah, I mean, the idea of scale is really important because I myself think about if I want to do these five projects at the same time, I need to have people who help me doing that. I just cannot afford doing it myself. But this also means that they end up doing no coding at all. And sometimes I have exactly the same feeling. I would like to go back to just being me and my computer and, I don't know, enjoy this kind of feeling that you have when you change a couple of lines of code and you see something changing on your screen and it's you. You've done it with your hands. It's fantastic. Right? I love this kind feeling, and I miss it a lot.",
      "id": "ep_41_ut_59"
    },
    {
      "end": 870640,
      "speaker": "Lisa Strausfeld",
      "start": 802880,
      "text": "Yeah, it's a big issue. And you have to think about the greatest sort of innovations in our, in our, I was gonna say in our lifetime, but just in our culture, you know, so many of them have come from a sort of, well, minimally, you know, a small team, sometimes just a single individual, even initially, and then they have to scale. And I think it's like, I really do admire the people who, you know, like Steve Jobs and Mark Zuckerberg, who can also, and Bill Gates, who can sort of scale with an organization and take that on and actually maintain the interest, you know, as it gets, you know, in those sort of mass proportions. That's hugely admirable and I think difficult like I am. Anyway, I Moritz, you're also one of the, you're a good case study of someone. I mean, it's amazing what you can do on your own and how much you can build on your own.",
      "id": "ep_41_ut_60"
    },
    {
      "end": 892650,
      "speaker": "Moritz Stefaner",
      "start": 871180,
      "text": "Yeah, I do work with people, too, but I sort of always feared that step of going beyond the three, four people teams, you know, towards the seven 8910, when suddenly, then you need to manage. And right now, at the point I have, like ten projects running, and, you know, half of them I'm somehow creatively involved, and the other half are mostly managing or consulting.",
      "id": "ep_41_ut_61"
    },
    {
      "end": 893346,
      "speaker": "Lisa Strausfeld",
      "start": 892690,
      "text": "Oh, really?",
      "id": "ep_41_ut_62"
    },
    {
      "end": 916942,
      "speaker": "Moritz Stefaner",
      "start": 893498,
      "text": "And, yeah, and so, yeah, and I have a few, like, long term clients, you know, who I mostly consult and where put together teams and other clients. I do the project myself. Really? And I constantly have to work with this balance. Like, how much, how much do I do myself? How much do I delegate in which part of the process do I want to be? It's. It's never right. Yeah, it's always something to complete.",
      "id": "ep_41_ut_63"
    },
    {
      "end": 918966,
      "speaker": "Lisa Strausfeld",
      "start": 917006,
      "text": "Yes. That is comforting.",
      "id": "ep_41_ut_64"
    },
    {
      "end": 943092,
      "speaker": "Moritz Stefaner",
      "start": 919038,
      "text": "I absolutely agree. And also for doing good data, I think in the end, sometimes you have to play with data yourself and build something out of it. It's just to stay grounded. I agree. Can we rewind? Because I just want to finish briefly your whole development I think it's so interesting. We have art history and computer science. And you said you studied architecture as well.",
      "id": "ep_41_ut_65"
    },
    {
      "end": 943980,
      "speaker": "Lisa Strausfeld",
      "start": 943246,
      "text": "Yeah.",
      "id": "ep_41_ut_66"
    },
    {
      "end": 946152,
      "speaker": "Moritz Stefaner",
      "start": 944520,
      "text": "And then you went to MIT media last year?",
      "id": "ep_41_ut_67"
    },
    {
      "end": 949336,
      "speaker": "Lisa Strausfeld",
      "start": 946176,
      "text": "Yes, yes. A lot of education.",
      "id": "ep_41_ut_68"
    },
    {
      "end": 951728,
      "speaker": "Moritz Stefaner",
      "start": 949448,
      "text": "Nineties. When is that, roughly. Yeah.",
      "id": "ep_41_ut_69"
    },
    {
      "end": 973160,
      "speaker": "Lisa Strausfeld",
      "start": 951784,
      "text": "Yeah. So I went to architecture school at Harvard. I finished in 91. Big recession time. And then I moved. And again, I had always planned to be an architect. I moved to, and I loved school. I moved to Austin, Texas right after.",
      "id": "ep_41_ut_70"
    },
    {
      "end": 982444,
      "speaker": "Moritz Stefaner",
      "start": 975140,
      "text": "And did you ever build a house? It's funny, that's what I like to ask architects.",
      "id": "ep_41_ut_71"
    },
    {
      "end": 1015258,
      "speaker": "Lisa Strausfeld",
      "start": 982532,
      "text": "No, my favorite question, I've designed a couple. And no, I didn't. And I worked all through college for architects. During my summers I worked for several years for architects. I moved to Austin. I worked for Charles Moore. And then I found out about this opportunity at Motorola. They were hiring architects to do layout design for memory chips.",
      "id": "ep_41_ut_72"
    },
    {
      "end": 1016310,
      "speaker": "Moritz Stefaner",
      "start": 1015434,
      "text": "Oh, wow.",
      "id": "ep_41_ut_73"
    },
    {
      "end": 1017470,
      "speaker": "Lisa Strausfeld",
      "start": 1016690,
      "text": "Yeah.",
      "id": "ep_41_ut_74"
    },
    {
      "end": 1019082,
      "speaker": "Enrico Bertini",
      "start": 1018010,
      "text": "That's crazy.",
      "id": "ep_41_ut_75"
    },
    {
      "end": 1023250,
      "speaker": "Moritz Stefaner",
      "start": 1019186,
      "text": "Well, that's pretty cool. That's a cool move from them as well, right?",
      "id": "ep_41_ut_76"
    },
    {
      "end": 1024670,
      "speaker": "Lisa Strausfeld",
      "start": 1023330,
      "text": "Yes. Yes, it was.",
      "id": "ep_41_ut_77"
    },
    {
      "end": 1026823,
      "speaker": "Moritz Stefaner",
      "start": 1025919,
      "text": "I like that.",
      "id": "ep_41_ut_78"
    },
    {
      "end": 1147648,
      "speaker": "Lisa Strausfeld",
      "start": 1026911,
      "text": "And it was a really hard decision because I knew if I took that job I would be leaving architecture because you have to really pay your dues in the field of architecture. And I just have this memory. I was working in this architecture office and the most advanced piece of technology they had, this was in 1990, let's say 1992. The most advanced piece of technology they had was an electric eraser. Have you ever seen this? And then I joined Motorola and they set me down on this HP workstation and it was pre web, but it was Internet. I was on net news alt rec books or whatever. Rec art books or whatever it was. Anyway, I was on newsgroups basically all day with people all over the world. It was amazing. And it was also the first time because I was really shy always and less so now. But it was the first time in a job that I felt like I could, I didn't have to talk to anyone. I could because all of the documentation was online. I remember when I started working in architecture, I would draw a line to represent a wall in plan for a wall section. And I couldn't draw another line until I went and asked an architect, what does this mean? Is this a piece of sheetrock? Is this like, where's the stud? Anyway, so there are a lot of questions, but somehow when I was at Motorola I could do the job which was basically taking logic specs from engineers and representing them as layers of, I forget what it was, you know, like layers of metal and layers of silicon, whatever. So we were drawing the circuitry. Anyway, all the documentation was online and.",
      "id": "ep_41_ut_79"
    },
    {
      "end": 1149272,
      "speaker": "Moritz Stefaner",
      "start": 1147704,
      "text": "But you drew it on a computer, right?",
      "id": "ep_41_ut_80"
    },
    {
      "end": 1149688,
      "speaker": "Lisa Strausfeld",
      "start": 1149296,
      "text": "We did.",
      "id": "ep_41_ut_81"
    },
    {
      "end": 1152128,
      "speaker": "Moritz Stefaner",
      "start": 1149744,
      "text": "So that was CAD already. And.",
      "id": "ep_41_ut_82"
    },
    {
      "end": 1219780,
      "speaker": "Lisa Strausfeld",
      "start": 1152264,
      "text": "Yes, no ink. And it was the job. It was kind of a dead end job. And it was, you know, I was wearing a badge. It was like, it was fascinating, but I knew that, like, it was unsustainable for me, but it was totally fascinating. And the work was very repetitive. And I discovered, because I was, you know, going through the documentation when everything was online, that I started writing scripts to automate the layout. At that time, these were fast, static rams. At that time, only the microprocessors were using automated layout systems. So I started writing scripts and I got back into programming again, and I loved it. And then that's when I started kind of coding on my own in the evenings. And. And then I found out about the media lab, and I applied to the media lab, and I started there in 93 at the visible language workshop.",
      "id": "ep_41_ut_83"
    },
    {
      "end": 1224192,
      "speaker": "Moritz Stefaner",
      "start": 1222360,
      "text": "Who was leading the lab at that time?",
      "id": "ep_41_ut_84"
    },
    {
      "end": 1262210,
      "speaker": "Lisa Strausfeld",
      "start": 1224296,
      "text": "Nicholas Negroponte was there, and my advisor was Muriel Cooper. And actually, I went back. I needed. It's been so many years. But I went back to Brown and got a recommendation from Andy van Dam. And then I, Bill Mitchell, who passed away a few years ago, was the head of the architecture school at MIT, and he had been a professor of mine at Harvard. Anyway, so I found a way. They all said, you should work with Muriel Cooper at the visible language workshop. And then I started there in 93, and it was free, which was important.",
      "id": "ep_41_ut_85"
    },
    {
      "end": 1267870,
      "speaker": "Moritz Stefaner",
      "start": 1264110,
      "text": "But did you do a. Was it like a PhD program or did you.",
      "id": "ep_41_ut_86"
    },
    {
      "end": 1269910,
      "speaker": "Lisa Strausfeld",
      "start": 1268030,
      "text": "I did a master. I was there for two years.",
      "id": "ep_41_ut_87"
    },
    {
      "end": 1270614,
      "speaker": "Moritz Stefaner",
      "start": 1270030,
      "text": "Yeah.",
      "id": "ep_41_ut_88"
    },
    {
      "end": 1289090,
      "speaker": "Lisa Strausfeld",
      "start": 1270742,
      "text": "Yeah. I would have stayed on, but Muriel Cooper passed away after about a year and a half of my time there. And she was amazing and, of course, a huge mentor influencer.",
      "id": "ep_41_ut_89"
    },
    {
      "end": 1294170,
      "speaker": "Moritz Stefaner",
      "start": 1289830,
      "text": "And what did you work on at the lab? What were the products like?",
      "id": "ep_41_ut_90"
    },
    {
      "end": 1340624,
      "speaker": "Lisa Strausfeld",
      "start": 1294530,
      "text": "Yeah, it was amazing. The timing was kind of amazing. Shortly after I arrived there, silicon graphics kind of dumped a shipment of workstations into the visible language workshop and including a reality engine. And so that was amazing. I had never. I never had really thought about graphic design or information design. I was coming from architecture, and, in fact, my application was about writing design systems for architecture. I was really into Christopher Alexander. And so that was my project.",
      "id": "ep_41_ut_91"
    },
    {
      "end": 1344736,
      "speaker": "Moritz Stefaner",
      "start": 1340672,
      "text": "Automating or, like, simulating kind of automating.",
      "id": "ep_41_ut_92"
    },
    {
      "end": 1361908,
      "speaker": "Lisa Strausfeld",
      "start": 1344888,
      "text": "Or maybe I was interested in, like, it's been a long time generating forms. Yeah. Or some kind of, like, grammars of typologies, maybe something about, like, architectural typology or, I don't know, something related to architecture because again, schools of architecture.",
      "id": "ep_41_ut_93"
    },
    {
      "end": 1362580,
      "speaker": "Moritz Stefaner",
      "start": 1361964,
      "text": "Something like this.",
      "id": "ep_41_ut_94"
    },
    {
      "end": 1379240,
      "speaker": "Lisa Strausfeld",
      "start": 1362620,
      "text": "Yeah, I really, because I had planned to be an architect my entire life, since childhood. It really has taken years and years and years to let go. In fact, I have never really let go and I just, I married an architect and now. So.",
      "id": "ep_41_ut_95"
    },
    {
      "end": 1383438,
      "speaker": "Moritz Stefaner",
      "start": 1380990,
      "text": "That's your big recurring theme, I see. Yeah.",
      "id": "ep_41_ut_96"
    },
    {
      "end": 1394810,
      "speaker": "Lisa Strausfeld",
      "start": 1383534,
      "text": "But then, but then when I got there, I mean, Muriel Cooper was a graphic designer, amazing graphic designer. Are you guys familiar with her work at all?",
      "id": "ep_41_ut_97"
    },
    {
      "end": 1396670,
      "speaker": "Enrico Bertini",
      "start": 1396030,
      "text": "I am not.",
      "id": "ep_41_ut_98"
    },
    {
      "end": 1399610,
      "speaker": "Moritz Stefaner",
      "start": 1396710,
      "text": "I heard the name, but I couldn't really pinpoint it.",
      "id": "ep_41_ut_99"
    },
    {
      "end": 1411974,
      "speaker": "Lisa Strausfeld",
      "start": 1400870,
      "text": "I guess she was in her sixties when I was there. But she had been the head designer for MIT books for many years. And she designed that great logo, which is incredible.",
      "id": "ep_41_ut_100"
    },
    {
      "end": 1413066,
      "speaker": "Enrico Bertini",
      "start": 1412022,
      "text": "Oh, the logo is awesome.",
      "id": "ep_41_ut_101"
    },
    {
      "end": 1415390,
      "speaker": "Moritz Stefaner",
      "start": 1413158,
      "text": "The stripes. Yeah, it's very good.",
      "id": "ep_41_ut_102"
    },
    {
      "end": 1441548,
      "speaker": "Lisa Strausfeld",
      "start": 1417850,
      "text": "And she. Yeah, she created this lab. There's also some really key people there, like Dave Small and Ron O'Neill. Anyway, it was. Oh, and Craig, it's funny because I overlapped with Craig Canarik. Do you know him from Razorfish? Anyway, it was just, it was.",
      "id": "ep_41_ut_103"
    },
    {
      "end": 1443132,
      "speaker": "Moritz Stefaner",
      "start": 1441604,
      "text": "Did he found Razorfish or was he.",
      "id": "ep_41_ut_104"
    },
    {
      "end": 1480080,
      "speaker": "Lisa Strausfeld",
      "start": 1443156,
      "text": "Yeah, he was one of the founders and he was the overlapped for a summer in this small group. There were only about eight. Eight students in the visible language workshop at that time. And it was really focused on visual communication, which I, you know, that was my first exposure to that and in information design. And it was helpful that these 3d workstations came in because I felt like I, it was, it was a good way for me to kind of enter this world of information design. And the first projects were indeed three dimensional.",
      "id": "ep_41_ut_105"
    },
    {
      "end": 1485332,
      "speaker": "Moritz Stefaner",
      "start": 1481180,
      "text": "So you picked up on the things you learned in the eighties.",
      "id": "ep_41_ut_106"
    },
    {
      "end": 1487620,
      "speaker": "Lisa Strausfeld",
      "start": 1485436,
      "text": "Yeah, absolutely. And then.",
      "id": "ep_41_ut_107"
    },
    {
      "end": 1489988,
      "speaker": "Moritz Stefaner",
      "start": 1487660,
      "text": "Yeah, suddenly with your architectural knowledge, of course.",
      "id": "ep_41_ut_108"
    },
    {
      "end": 1508670,
      "speaker": "Lisa Strausfeld",
      "start": 1490044,
      "text": "Yeah, yeah. So that, in fact, I remember the first project was to do was to rethink the newspaper again, this is like always, you know, still current. That was the first project. And I remember I did a model, like a 3d model, because that's how I mainly worked in architecture. That's what I thought.",
      "id": "ep_41_ut_109"
    },
    {
      "end": 1510978,
      "speaker": "Moritz Stefaner",
      "start": 1509170,
      "text": "You had this huge, bulky.",
      "id": "ep_41_ut_110"
    },
    {
      "end": 1515510,
      "speaker": "Lisa Strausfeld",
      "start": 1511114,
      "text": "It was like a plexiglass model with like threaded.",
      "id": "ep_41_ut_111"
    },
    {
      "end": 1523298,
      "speaker": "Moritz Stefaner",
      "start": 1516090,
      "text": "Awesome. Anyway, but this whole. Yeah, that's still happening. Like rethinking the newspaper stuff. It is totally going on.",
      "id": "ep_41_ut_112"
    },
    {
      "end": 1527910,
      "speaker": "Lisa Strausfeld",
      "start": 1523354,
      "text": "And in fact, it's kind of what I'm doing right now with Vue in so many ways.",
      "id": "ep_41_ut_113"
    },
    {
      "end": 1528810,
      "speaker": "Moritz Stefaner",
      "start": 1527950,
      "text": "Right, right.",
      "id": "ep_41_ut_114"
    },
    {
      "end": 1530278,
      "speaker": "Lisa Strausfeld",
      "start": 1529590,
      "text": "Yeah.",
      "id": "ep_41_ut_115"
    },
    {
      "end": 1550678,
      "speaker": "Moritz Stefaner",
      "start": 1530414,
      "text": "I think that's very comforting, too, that, you know, you always have that feeling, everything's changing so fast. But then at some point you realize, hold on. Like, a few things we've been thinking about for ten years, and we can see some progress and some certain directions, but it's nowhere as fast as we thought, you know, back then, everything would be like, revolutionized. And so I think that's good.",
      "id": "ep_41_ut_116"
    },
    {
      "end": 1552318,
      "speaker": "Lisa Strausfeld",
      "start": 1550734,
      "text": "Yeah, I mean, it's amazing.",
      "id": "ep_41_ut_117"
    },
    {
      "end": 1571470,
      "speaker": "Moritz Stefaner",
      "start": 1552334,
      "text": "And then, sorry, we have to speed up if we want to have your whole career halfway through, so. And then you went to Quokka, which I'm really interested in because I only, you know, I read a few blog posts about it and I saw a few screenshots. Yeah, well, actually there was, you know. Yeah. So tell us a bit about, well, before Quokka.",
      "id": "ep_41_ut_118"
    },
    {
      "end": 1635764,
      "speaker": "Lisa Strausfeld",
      "start": 1571770,
      "text": "Before Quokka, there was, I started a company from the media lab with two classmates called Perspecta and. Yeah, and that, I like the name. It's good. That was an amazing experience. And I still think about that. Basically, we were taking collections of news documents or any kind of digital documents, and we were tagging them, and we were building up these taxonomies basically from the documents themselves, and they were always changing. And I was writing the client code. That was Java. We were writing kind of beta Java code right on the heels of the Java developers. And we were creating these text spaces where you could sort of fly through the categories again, the sort of ever changing categories into subcategories and into the documents themselves.",
      "id": "ep_41_ut_119"
    },
    {
      "end": 1641292,
      "speaker": "Moritz Stefaner",
      "start": 1635932,
      "text": "So you could throw a bunch of documents at the system and it would try and order them in a meaningful way.",
      "id": "ep_41_ut_120"
    },
    {
      "end": 1654546,
      "speaker": "Lisa Strausfeld",
      "start": 1641396,
      "text": "Yes. Yeah, I, and of course it was, you know, ahead of its time, and, you know, and we moved to San Francisco and started this company and got funding, and there's a whole story there.",
      "id": "ep_41_ut_121"
    },
    {
      "end": 1655362,
      "speaker": "Moritz Stefaner",
      "start": 1654738,
      "text": "Yeah.",
      "id": "ep_41_ut_122"
    },
    {
      "end": 1665630,
      "speaker": "Lisa Strausfeld",
      "start": 1655466,
      "text": "And with the little tragedy involved, but anyway. And then it was sold to excited home. But I.",
      "id": "ep_41_ut_123"
    },
    {
      "end": 1669868,
      "speaker": "Moritz Stefaner",
      "start": 1668420,
      "text": "Does excite still exist?",
      "id": "ep_41_ut_124"
    },
    {
      "end": 1751230,
      "speaker": "Lisa Strausfeld",
      "start": 1669964,
      "text": "No, no. So that's why. Yeah, still working. But then I joined one of our clients, which was Quokka, and I joined Michael Goff was my client and became my boss, and he's still at Adobe. Really one of the most brilliant people I've ever worked with. Amazing thinker. We started, so Quinan. So Quokka was started by this Australian mathematician who ran the boat, basically for America's cup when it won the cup back, I guess, for Australia. And we had all these data assets from sports, from motorsports, from, sorry, vehicle sports like racing motorsports and America's cup, and started creating these race viewers. So I was running a little lab, we call it Quokka Labs, and I was working with still some of the most talented people working in data visualization today, including Eric Rodenbeck from Stamen, who founded Stamen, and Josh Ulm. I don't know where Josh is right now. But anyway, and there's still.",
      "id": "ep_41_ut_125"
    },
    {
      "end": 1774458,
      "speaker": "Moritz Stefaner",
      "start": 1752810,
      "text": "And I saw some screenshots and the work is really super interesting. Like you did. Really interesting, like, combined photos with overlaid information, graphics, everything. Very like a postmodern remix of everything. And it looked, I think. Yeah. Especially you wouldn't guess it from like late nineties or something. Very interesting to look at.",
      "id": "ep_41_ut_126"
    },
    {
      "end": 1789460,
      "speaker": "Lisa Strausfeld",
      "start": 1774514,
      "text": "It was. I mean, again, and Michael got. He hired a. A great group of people, and I think we should have some kind of alumni network because they're all doing really interesting things. I mean, like, really some of the most talented designers I've worked with.",
      "id": "ep_41_ut_127"
    },
    {
      "end": 1801696,
      "speaker": "Moritz Stefaner",
      "start": 1790960,
      "text": "No, it's amazing. And would you say that was, was it more like focused on real time interfaces or like data journalism as it was real time.",
      "id": "ep_41_ut_128"
    },
    {
      "end": 1804180,
      "speaker": "Lisa Strausfeld",
      "start": 1801728,
      "text": "And we called them race viewers. They were.",
      "id": "ep_41_ut_129"
    },
    {
      "end": 1809252,
      "speaker": "Moritz Stefaner",
      "start": 1805100,
      "text": "So as America's cup was running, you could always see what's going on.",
      "id": "ep_41_ut_130"
    },
    {
      "end": 1809828,
      "speaker": "Lisa Strausfeld",
      "start": 1809356,
      "text": "Yeah.",
      "id": "ep_41_ut_131"
    },
    {
      "end": 1810276,
      "speaker": "Moritz Stefaner",
      "start": 1809924,
      "text": "Right.",
      "id": "ep_41_ut_132"
    },
    {
      "end": 1832008,
      "speaker": "Lisa Strausfeld",
      "start": 1810348,
      "text": "And Eric, I think, and Josh did one for the Tour de France, which was amazing. And my team was working on something. We did something for cart motorsports. We were trying to get Formula one always, but we never, we did a lot of prototypes for Formula one, but.",
      "id": "ep_41_ut_133"
    },
    {
      "end": 1835944,
      "speaker": "Moritz Stefaner",
      "start": 1832024,
      "text": "It's a big licensing issue in sports. Who can do what. And.",
      "id": "ep_41_ut_134"
    },
    {
      "end": 1852220,
      "speaker": "Lisa Strausfeld",
      "start": 1835992,
      "text": "Yeah. Oh, and then there was the Olympics with NBC and. Yeah, those prices, I still think that work. And those products that we created, I still think are some of the most innovative. Still.",
      "id": "ep_41_ut_135"
    },
    {
      "end": 1855304,
      "speaker": "Moritz Stefaner",
      "start": 1853840,
      "text": "Are they preserved somewhere?",
      "id": "ep_41_ut_136"
    },
    {
      "end": 1856440,
      "speaker": "Lisa Strausfeld",
      "start": 1855432,
      "text": "I think so.",
      "id": "ep_41_ut_137"
    },
    {
      "end": 1859814,
      "speaker": "Moritz Stefaner",
      "start": 1856600,
      "text": "And then what was it anyways, director or how did you.",
      "id": "ep_41_ut_138"
    },
    {
      "end": 1865098,
      "speaker": "Lisa Strausfeld",
      "start": 1859952,
      "text": "They were. Yeah, they were mostly adobe products of some kind.",
      "id": "ep_41_ut_139"
    },
    {
      "end": 1867930,
      "speaker": "Moritz Stefaner",
      "start": 1865154,
      "text": "They were direct Macromedia at the time.",
      "id": "ep_41_ut_140"
    },
    {
      "end": 1890480,
      "speaker": "Lisa Strausfeld",
      "start": 1867970,
      "text": "Yeah. Oh, Macromedia. Sorry. Macromedia. Yeah. Which was right down the street, in fact, from Quinan. Yeah. And then, and then Michael Goff. Yeah. So then he went to Macromedia, and I think even the CEO of Quokka al Ramadan. I went to Macromedia and then Adobe, if I'm not mistaken.",
      "id": "ep_41_ut_141"
    },
    {
      "end": 1894364,
      "speaker": "Moritz Stefaner",
      "start": 1892020,
      "text": "So everything can be traced back to Quokka.",
      "id": "ep_41_ut_142"
    },
    {
      "end": 1895040,
      "speaker": "Lisa Strausfeld",
      "start": 1894412,
      "text": "Yeah.",
      "id": "ep_41_ut_143"
    },
    {
      "end": 1911080,
      "speaker": "Moritz Stefaner",
      "start": 1898180,
      "text": "Yeah. It's definitely worth reading up on. Do some googling on Quokka. It's worth it. And then you went to Pentagram, legendary design firm. I think you were, in fact, a partner.",
      "id": "ep_41_ut_144"
    },
    {
      "end": 1972742,
      "speaker": "Lisa Strausfeld",
      "start": 1912240,
      "text": "So I met. I was speaking about the work at Quokka at an AIGA conference, and I sat next to Michael Beirut at a speaker dinner. And at that time, for personal reasons, I really wanted to come back to New York. I was living in San Francisco, and I sat next to Michael and I was telling him about the things I wanted to do. I was really interested in doing work in physical space that combined, you know, like, with projection and large displays or, and Michael had a, he got me involved in some projects at Pentagram. So I started, I had a studio called information art, and I started working with Pentagram. And then I was asked to join as a partner. And I joined in January of 2002 and was there for a little over nine years, almost ten years.",
      "id": "ep_41_ut_145"
    },
    {
      "end": 1976294,
      "speaker": "Moritz Stefaner",
      "start": 1972886,
      "text": "So it's your longest career station, actually, right?",
      "id": "ep_41_ut_146"
    },
    {
      "end": 1976970,
      "speaker": "Lisa Strausfeld",
      "start": 1976342,
      "text": "Yeah.",
      "id": "ep_41_ut_147"
    },
    {
      "end": 1996730,
      "speaker": "Moritz Stefaner",
      "start": 1978990,
      "text": "And briefly, what types of things did you work on at Pentagram? I remember a lot of browsing interfaces. Like if you had, like, collections of stuff, you know, you would, like, make nice ways to browse most interesting collections of things. That's my, at least my recollection.",
      "id": "ep_41_ut_148"
    },
    {
      "end": 2069952,
      "speaker": "Lisa Strausfeld",
      "start": 1997030,
      "text": "So this will be interesting. You have to tell me what you were doing at this time. But it seemed that for me, data visualization, my awareness of it started at the media lab, and I was very aware of the work at Xerox PARC and kind of in the community chi, and then when I was in San Francisco through Quokka. But then in 2000, from my recollection, most of the data visualization work really went back into the lab. I mean, there was no kind of commercial work anymore, it seemed. I mean, sports data, even though I wasn't that into sports. But it was a great opportunity to do kind of consumer focused data visualization work. So I think it either went to kind of enterprise or back into, you know, academic institutions. But it was really hard to get any kind of client work to do data visualization in the early part of.",
      "id": "ep_41_ut_149"
    },
    {
      "end": 2070592,
      "speaker": "Moritz Stefaner",
      "start": 2070056,
      "text": "For a couple of years.",
      "id": "ep_41_ut_150"
    },
    {
      "end": 2072080,
      "speaker": "Lisa Strausfeld",
      "start": 2070616,
      "text": "The millennium. Yeah.",
      "id": "ep_41_ut_151"
    },
    {
      "end": 2100443,
      "speaker": "Moritz Stefaner",
      "start": 2072160,
      "text": "I mean, I couldn't tell you because I was still a baby at the time, but I also remember that I felt it really took off, like public facing data visualization. That is interesting. Like with stamen, the work with D Claire, we feel fine. And all these things, that was 2003, four or five maybe, and that was already. And that was ahead of the curve at that time. So you might be right that 2000 to 2005, it was more. Yeah. What came out of arts academies.",
      "id": "ep_41_ut_152"
    },
    {
      "end": 2101319,
      "speaker": "Lisa Strausfeld",
      "start": 2100531,
      "text": "Exactly.",
      "id": "ep_41_ut_153"
    },
    {
      "end": 2102387,
      "speaker": "Moritz Stefaner",
      "start": 2101859,
      "text": "Artists.",
      "id": "ep_41_ut_154"
    },
    {
      "end": 2161630,
      "speaker": "Lisa Strausfeld",
      "start": 2102443,
      "text": "Yeah. And, and I, you know, I always had to choose things based on, you know, what I was passionate about, what I wanted to do. But I also had this need to, you know, have some kind of stability that kind of drove a lot of the decisions, some kind of financial stability. So anyway, I was also just, you know, fascinated and taken by Pentagram. And I loved the work and the partners. I was kind of an aberration in a way I was, but I, so I joined and I, one of the things I'm actually most proud of about my relationship with Pentagram and I think that is that they, when I first started there, they, people thought I was kind of the interactive department or the, you know, the digital partner. And I knew that would be bad strategically for Pentagram and it would be bad for my career too. So.",
      "id": "ep_41_ut_155"
    },
    {
      "end": 2165514,
      "speaker": "Moritz Stefaner",
      "start": 2163330,
      "text": "You would have had to fix their printers.",
      "id": "ep_41_ut_156"
    },
    {
      "end": 2226982,
      "speaker": "Lisa Strausfeld",
      "start": 2165602,
      "text": "Exactly. So I really helped, I think I really helped the culture there evolve to what it is today. And all the partners, they already were doing identity work and signage and packaging and environments, exhibitions and so digital just naturally evolved into that. At first I was working collaborating with a lot of the partners doing the digital work for their clients, which was again, most of pentagrams work is really identity focused for all kinds of institutions. And anyway, it was amazing. It was a prolific time and I did any and all kind of website. I was doing some large digital displays, prototypes and mockups. Kind of ironically the only one that really. Well, that's not true. One of the key ones that got built was the one at Bloomberg where.",
      "id": "ep_41_ut_157"
    },
    {
      "end": 2229190,
      "speaker": "Moritz Stefaner",
      "start": 2227006,
      "text": "I work now, foreshadowing sort of.",
      "id": "ep_41_ut_158"
    },
    {
      "end": 2229930,
      "speaker": "Lisa Strausfeld",
      "start": 2229270,
      "text": "Yes.",
      "id": "ep_41_ut_159"
    },
    {
      "end": 2231870,
      "speaker": "Moritz Stefaner",
      "start": 2230250,
      "text": "Yeah, they got it.",
      "id": "ep_41_ut_160"
    },
    {
      "end": 2261396,
      "speaker": "Lisa Strausfeld",
      "start": 2232730,
      "text": "And then there were some big sort of museum installations. But then I have to confess, I got really, this a little side note, but I confess I got sort of really turned off by doing that kind of work. I don't know what like it maybe for to commercial or to environmental. I don't know. I just felt bombarded visually. Bye. All of these, the proliferation of like large displays and projections.",
      "id": "ep_41_ut_161"
    },
    {
      "end": 2264948,
      "speaker": "Moritz Stefaner",
      "start": 2261468,
      "text": "Okay, yeah. Media facades and I just another media.",
      "id": "ep_41_ut_162"
    },
    {
      "end": 2266540,
      "speaker": "Lisa Strausfeld",
      "start": 2265044,
      "text": "Exactly, exactly. So I.",
      "id": "ep_41_ut_163"
    },
    {
      "end": 2267760,
      "speaker": "Moritz Stefaner",
      "start": 2266620,
      "text": "What a good idea.",
      "id": "ep_41_ut_164"
    },
    {
      "end": 2272980,
      "speaker": "Lisa Strausfeld",
      "start": 2268380,
      "text": "I don't know exactly, but like, what.",
      "id": "ep_41_ut_165"
    },
    {
      "end": 2280268,
      "speaker": "Moritz Stefaner",
      "start": 2273060,
      "text": "Would you say, like from these nine years, what's the most, like, what's the thing you took away from the time at Pentagram, like, or.",
      "id": "ep_41_ut_166"
    },
    {
      "end": 2281124,
      "speaker": "Lisa Strausfeld",
      "start": 2280364,
      "text": "Well, I.",
      "id": "ep_41_ut_167"
    },
    {
      "end": 2285874,
      "speaker": "Moritz Stefaner",
      "start": 2281212,
      "text": "Was it just a different world and now you're back into actually home turf.",
      "id": "ep_41_ut_168"
    },
    {
      "end": 2396484,
      "speaker": "Lisa Strausfeld",
      "start": 2285962,
      "text": "I mean, it's funny I've said this and I think it still holds true that I feel like I in some ways went undercover as a, you know, my, I think I've always been a kind of information and interaction designer. Both of those things are key, actually. I'm interested in both of them together and neither of them that much apart. So I see. I'm interested in. Yeah. And where sort of information and interaction come together at Pentagram. I treated every project like that. Even if it wasn't part of the creative brief, I kind of made it part of the brief and I also really tried to make everything interesting from like a website for a law firm to any, you know, any kind of small, I don't. Installation project or, I mean, it just, and I had three teams actually. It was sort of how things worked there. There's a sort of natural cycle. You know, Pentagram hires really talented young designers sort of right out of school effectively, and they typically stay for three to five years or so. Anyway, I had a really nice cycle, really proud of the work there. And it was all client driven. And I left eventually because I saw that data visualization, I mean, I was aware of your work, Morads, and I was just in the field. I was aware that, okay, data visualization is back. I was kind of waiting for that moment. I could see it happening. I could see it.",
      "id": "ep_41_ut_169"
    },
    {
      "end": 2401316,
      "speaker": "Moritz Stefaner",
      "start": 2396492,
      "text": "Yeah, you were just like ten years ahead of the plan to catch up. Right.",
      "id": "ep_41_ut_170"
    },
    {
      "end": 2549306,
      "speaker": "Lisa Strausfeld",
      "start": 2401508,
      "text": "And I, again, I really feel like I did things. Like, I felt like I perfected different website typologies, like the catalog site. I got down, you know, and we, like, we made every, we had, you know, many portfolio sites, including the Pentagram portfolio site and Dillerscophidia, a lot of architect portfolio sites and eniadgest. And there was a kind of information architecture and a way of sorting and filtering and still doing that work, but it was nice to just, there was a lot of muscle flexing, like, let's do it this way this time. And that was amazing. But when I saw that all this data was available, I was especially interested after Quinan in visualizing government activity as a spectator sport. Then I felt like I had, it was just time to jump, which is what I did. And I left Pentagram and started major league politics. And when was that? That was a few years ago. And then just as I was working on that, I brought a designer and developer with me from Pentagram, Hilla Katke, who came with me also to Bloomberg. Just as I was starting that, Bloomberg came knocking about this opportunity to bring, to really focus on data visualization. And I'm sorry, I started major league politics. I said, well, I'm just starting this company. And Susan Kish, who I talked to at Bloomberg, who basically brought me in, said, well, we're very interested in whatever you're doing with major league politics. So I built up this kind of demo and prototype and I was really targeting Bloomberg because I, for years, I mean, since I had worked on, on the displays, I felt like Bloomberg was kind of the goldmine of news and data and I was seeking any opportunity to work with Bloomberg. I also really, it's one of the.",
      "id": "ep_41_ut_171"
    },
    {
      "end": 2550778,
      "speaker": "Moritz Stefaner",
      "start": 2549338,
      "text": "Data heaviest companies, right?",
      "id": "ep_41_ut_172"
    },
    {
      "end": 2550946,
      "speaker": "Lisa Strausfeld",
      "start": 2550794,
      "text": "Yeah.",
      "id": "ep_41_ut_173"
    },
    {
      "end": 2552190,
      "speaker": "Moritz Stefaner",
      "start": 2550978,
      "text": "I mean, yeah.",
      "id": "ep_41_ut_174"
    },
    {
      "end": 2616298,
      "speaker": "Lisa Strausfeld",
      "start": 2552930,
      "text": "And I also, I have to say that just Bloomberg the man, even though I'm a registered Democrat, I felt very aligned with, with his ethics. So I was interested and we developed a demo and a prototype and we pitched it to Bloomberg. And then we negotiated for a while. It turns out it wasn't really the right fit for Bloomberg government, which was a much different kind of product, and it's much more consumer focused. So I just put it aside and ended up joining Bloomberg. I felt like it was a great opportunity. I was also with major league politics. I was funding it personally, which was a bit unsustainable and part of why I moved to Portland, just to keep my overhead down. And I wasn't sure I had the appetite to go out and get it funded and suddenly Bloomberg.",
      "id": "ep_41_ut_175"
    },
    {
      "end": 2617282,
      "speaker": "Moritz Stefaner",
      "start": 2616474,
      "text": "And have a start.",
      "id": "ep_41_ut_176"
    },
    {
      "end": 2632952,
      "speaker": "Lisa Strausfeld",
      "start": 2617346,
      "text": "It was there. And I could do start, you know, create a startup basically inside Bloomberg to do data visualization. That's what I did. And that's really how it worked for a while. And. Yeah.",
      "id": "ep_41_ut_177"
    },
    {
      "end": 2648568,
      "speaker": "Moritz Stefaner",
      "start": 2633136,
      "text": "So you build up a team from scratch, basically. Right. So they just hired you to build up a team doing interesting things with data or what was the basic proposition they were after? Like, do interesting visual stuff.",
      "id": "ep_41_ut_178"
    },
    {
      "end": 2672780,
      "speaker": "Lisa Strausfeld",
      "start": 2648664,
      "text": "Yes. And it was focused on the consumer, meaning not for the core customer who subscribes to the terminal. It was really focused on the consumer, for the media properties, for Bloomberg.com at that time. And Bloomberg Vue was just beginning as well.",
      "id": "ep_41_ut_179"
    },
    {
      "end": 2696074,
      "speaker": "Moritz Stefaner",
      "start": 2675210,
      "text": "For me, it also opened up, like, I had a different view on Bloomberg afterwards, like, also with your work there, because I never felt Bloomberg is relevant to me personally. And then suddenly it became, you know, so suddenly it was something that seemed to address more people suddenly, or. Yeah. Acted like a media outlet, really. Not a specialist.",
      "id": "ep_41_ut_180"
    },
    {
      "end": 2696682,
      "speaker": "Lisa Strausfeld",
      "start": 2696162,
      "text": "Yes.",
      "id": "ep_41_ut_181"
    },
    {
      "end": 2698642,
      "speaker": "Moritz Stefaner",
      "start": 2696786,
      "text": "Data supplier or something like that.",
      "id": "ep_41_ut_182"
    },
    {
      "end": 2809322,
      "speaker": "Lisa Strausfeld",
      "start": 2698706,
      "text": "Yeah, exactly. And I was also. Exactly. I was also very influenced by Bloomberg's acquisition of Business Week and, you know, which I thought really had an amazing redesign by Richard Turley and great editorial. And, you know, I was, that, that meant a lot to me as I joined. So we had a pretty open, an open slate and, and charter and I established a strategy which really kind of initiated the group, which was about, this is where I sort of get into. So I saw this division in data visualization. I've talked about this before, but between explanatory and exploratory, data visualizations and explanatory, typically news driven, kind of small set snapshots of data, infographics exploratory are software based, usually based on live data feeds, and explanatory, the experience of the two is very different. Explanatory can be from a really engaging news headline to a story, to something represent evidence of that situation. And the exploratory data visualizations might start that way, but then they can be kind of overwhelming and often can be lacking in sort of editorial guideposts, if you will. So the whole idea, and I loved that Bloomberg was really a news and data organization.",
      "id": "ep_41_ut_183"
    },
    {
      "end": 2812462,
      "speaker": "Moritz Stefaner",
      "start": 2809466,
      "text": "And so it's all about expertise as well.",
      "id": "ep_41_ut_184"
    },
    {
      "end": 2924710,
      "speaker": "Lisa Strausfeld",
      "start": 2812526,
      "text": "Yeah. And I came with like, really the desire to kind of answer this question, which I feel like we asked in a very significant way, but didn't yet answer. And I feel like it's still an open question, which is, how do you marry these two things? And how. Because again, then the whole point for me is that I think the best experience of data in this sort of news context is that. But you kind of get engaged. There's a question, you get either pissed off or provoked or you can't believe something, and then you want to see evidence of it in the data, and then you ask more questions and you want to explore and you want to pivot and you want to find out what's happening now. So this is what we try to do. And the first team that we set up was partly because it's all I knew, which was a design and development team. And I assumed that I would treat editorial as my client because I was very familiar with client relationships. I mean, to be honest, I was sort of happy to get away from the client model, but as long as I was kind of initiating the projects. So we set up this sort of relationship as editorials, the client, and we started creating interactive data products. And that was the first team. And state by state was the first product, which was about economic health of the states. And I call it kind of the swiss army knife product. And it sort of highlights what the problems are. I mean, what was interesting about it is that it's a product that was designed to be headlined. So it has all these kind of, it has 20 data sets or so.",
      "id": "ep_41_ut_185"
    },
    {
      "end": 2943130,
      "speaker": "Moritz Stefaner",
      "start": 2925210,
      "text": "It's a crazy data in the beginning you see just 50 bars and you think, yeah, it's a bar chart. And then you click it and you expand them and they fold up and they fold up even more. And it's like an endless sequence of unfolding data. You can drill into any data point, basically.",
      "id": "ep_41_ut_186"
    },
    {
      "end": 3056410,
      "speaker": "Lisa Strausfeld",
      "start": 2943170,
      "text": "And it really, it worked best for the 2012 presidential election. We launched it a couple months before that election and that election. It's interesting because the jobs report came out today, below 6% was kind of amazing. Unemployment in the US. So the last presidential election was all about the economy and unemployment, basically. And so the view that we launched with, I mean, you could launch with any, but we launched with this view, which was, you know, unemployment, us unemployment and polling data from real clear politics for swing states and those states, those like, you know, eight states or so, eight or ten states in 2012 were going to decide the election. And what was amazing about it. And I would check this, because the polling data was updating daily, the unemployment data was updated twice a month, once, you know, once a month for the US and once a month for all the states. And what was amazing is I was checking that daily before the election and I saw, I mean, I thought, oh, my God, Obama. Could it really happen? Sorry, is that right? 2012? Yeah. And wait, am I totally off on this, on these dates? No, 2012. Anyway, I saw, I saw the data move, I saw the polling data move from red to blue, basically, and you could see that he was going to win the election. And that was just one view. And the idea was that every quarter or so, I mean, you can make any view you want and any journalist can create a view and headline it, but it didn't really work that way in the end. But that's how it was designed. And then billionaires followed.",
      "id": "ep_41_ut_187"
    },
    {
      "end": 3064602,
      "speaker": "Moritz Stefaner",
      "start": 3056450,
      "text": "The idea was, whenever there's an article about a specific aspect, the journalist should embed the right perspective or link to it.",
      "id": "ep_41_ut_188"
    },
    {
      "end": 3065470,
      "speaker": "Lisa Strausfeld",
      "start": 3064746,
      "text": "Yes.",
      "id": "ep_41_ut_189"
    },
    {
      "end": 3067154,
      "speaker": "Moritz Stefaner",
      "start": 3065850,
      "text": "Yeah, it's very nice.",
      "id": "ep_41_ut_190"
    },
    {
      "end": 3088960,
      "speaker": "Enrico Bertini",
      "start": 3067322,
      "text": "So I'm curious to hear, Lisa, for this kind of very interactive visualizations published on the web. I'm always curious to see how much time people spend on them and how much in depth they explore. So did you ever try to look into that? Maybe looking. Did you ever collect the logs of what they do and trying to understand.",
      "id": "ep_41_ut_191"
    },
    {
      "end": 3090840,
      "speaker": "Lisa Strausfeld",
      "start": 3089460,
      "text": "You mean the users?",
      "id": "ep_41_ut_192"
    },
    {
      "end": 3092480,
      "speaker": "Enrico Bertini",
      "start": 3091340,
      "text": "Yeah, the users.",
      "id": "ep_41_ut_193"
    },
    {
      "end": 3146650,
      "speaker": "Lisa Strausfeld",
      "start": 3095580,
      "text": "Yes. I mean, we had traffic reports and we could see for billionaires too. We can see spikes. Billionaires actually does integrate different views of the product with stories. And like, if there's a story about. Well, I mean, there are a lot of stories about the wealth of the Russian billionaires, given what's going on in Russia. And so there can be a story and then you can filter just for the Russian billionaires fortunes. So that's been used quite a bit. And actually the billionaires team does headline, they do create headlines for that tool. And then now there's a mobile version that the team has built which is pretty cool.",
      "id": "ep_41_ut_194"
    },
    {
      "end": 3149082,
      "speaker": "Moritz Stefaner",
      "start": 3146810,
      "text": "There's a billionaires team at Bloomberg.",
      "id": "ep_41_ut_195"
    },
    {
      "end": 3151230,
      "speaker": "Lisa Strausfeld",
      "start": 3149146,
      "text": "There's a billionaires editorial team. Yeah.",
      "id": "ep_41_ut_196"
    },
    {
      "end": 3156150,
      "speaker": "Moritz Stefaner",
      "start": 3154770,
      "text": "Jon, a nice job.",
      "id": "ep_41_ut_197"
    },
    {
      "end": 3165356,
      "speaker": "Lisa Strausfeld",
      "start": 3158370,
      "text": "It's interesting. It's a serious investigative journalistic team because.",
      "id": "ep_41_ut_198"
    },
    {
      "end": 3172604,
      "speaker": "Moritz Stefaner",
      "start": 3165428,
      "text": "I mean, these are billionaires. They're not very, they're a bit secretive, probably, about their precise earnings.",
      "id": "ep_41_ut_199"
    },
    {
      "end": 3185960,
      "speaker": "Lisa Strausfeld",
      "start": 3172692,
      "text": "And it's pretty important because these are the people who, you know, have the world's wealth and. Yeah. And a lot of them are pretty secretive. Exactly right.",
      "id": "ep_41_ut_200"
    },
    {
      "end": 3188572,
      "speaker": "Enrico Bertini",
      "start": 3187700,
      "text": "Yeah.",
      "id": "ep_41_ut_201"
    },
    {
      "end": 3205240,
      "speaker": "Moritz Stefaner",
      "start": 3188756,
      "text": "Interesting. So, and so this team took the tool you made and sort of developed it further or keeps filling it with content. So is that a good, is this what you had in mind, basically, like, this tight integration of tools with journalism, like these living platforms?",
      "id": "ep_41_ut_202"
    },
    {
      "end": 3239402,
      "speaker": "Lisa Strausfeld",
      "start": 3205700,
      "text": "It's getting there. I always felt that I really wanted to get my hands on this site. And I mean, that sort of in the general sense, like, where I was always concerned about where our content was going to live, basically. And when I first joined, you know, the attitude on the sort of web production side from Bloomberg.com was that, here's your box for data visualization.",
      "id": "ep_41_ut_203"
    },
    {
      "end": 3241346,
      "speaker": "Moritz Stefaner",
      "start": 3239506,
      "text": "Yeah. We have an iframe for you.",
      "id": "ep_41_ut_204"
    },
    {
      "end": 3251250,
      "speaker": "Lisa Strausfeld",
      "start": 3241378,
      "text": "Yeah. And I said, no, no, please, that's not going to work. And I wanted to really be able to work with.",
      "id": "ep_41_ut_205"
    },
    {
      "end": 3251794,
      "speaker": "Moritz Stefaner",
      "start": 3251290,
      "text": "Integrate.",
      "id": "ep_41_ut_206"
    },
    {
      "end": 3308480,
      "speaker": "Lisa Strausfeld",
      "start": 3251882,
      "text": "To integrate. And that has been very much a moving target for reasons that I don't think have anything to do with me. But the media team has had, Bloomery.com had one and a half redesigns already and is going through another one since I've been there in the last two and a half years. There's a new head of the media group. So it's just been a moving target, and it's been hard to integrate. And actually, I did get involved and led the redesign for Bloomberg View, which is another kind of catalog site, which will become more of a catalog site of opinion content. And there really have the opportunity to sort of find the most optimal ways of integrating data, data visualization. So that's a, a good reason why, you know, why I'm there now. I felt like I could really get my hands on the site itself.",
      "id": "ep_41_ut_207"
    },
    {
      "end": 3316188,
      "speaker": "Moritz Stefaner",
      "start": 3309180,
      "text": "And Bloomberg review is mostly opinion, is it? Opinion articles, like individual pieces of opinion pieces?",
      "id": "ep_41_ut_208"
    },
    {
      "end": 3318200,
      "speaker": "Lisa Strausfeld",
      "start": 3316244,
      "text": "Yes. Yeah. And they still do.",
      "id": "ep_41_ut_209"
    },
    {
      "end": 3332060,
      "speaker": "Moritz Stefaner",
      "start": 3318980,
      "text": "And I think it's super interesting how to, how to integrate that, because data is supposed to be super objective and opinion supposed to be, like, super subjective. And I think that's very, on a superficial level.",
      "id": "ep_41_ut_210"
    },
    {
      "end": 3332872,
      "speaker": "Lisa Strausfeld",
      "start": 3332560,
      "text": "Yeah.",
      "id": "ep_41_ut_211"
    },
    {
      "end": 3335824,
      "speaker": "Moritz Stefaner",
      "start": 3332896,
      "text": "The marriage, I think it's very interesting to bring that together. Right?",
      "id": "ep_41_ut_212"
    },
    {
      "end": 3371560,
      "speaker": "Lisa Strausfeld",
      "start": 3335872,
      "text": "Absolutely. I mean, I think it's, I've been saying this. It's kind of a winning combination. And actually we created a few data views on the visual data team. Jeremy diamond built them and been amazing interaction designer, and we did them in collaboration with view. And I loved how those are the ones like the jobs report and how, how Americans die. And they're basically, they're really simple kind of walkthroughs of data with very voicey notes.",
      "id": "ep_41_ut_213"
    },
    {
      "end": 3382548,
      "speaker": "Moritz Stefaner",
      "start": 3373300,
      "text": "And they present an argument too. Like it's. They build up a certain argumentation structure based on data. Right. And that could totally work for an opinion piece as well.",
      "id": "ep_41_ut_214"
    },
    {
      "end": 3404220,
      "speaker": "Lisa Strausfeld",
      "start": 3382604,
      "text": "Exactly. And I love those things. Were supposed to be very specific to time series. I also like sort of solving these very specific problems. And the idea of, I mean, there are a lot of metaphors we use in our speech about kind of going, you know, sort of drilling in, zooming out and getting the big picture and anyway, so that's what those pieces were about.",
      "id": "ep_41_ut_215"
    },
    {
      "end": 3413656,
      "speaker": "Moritz Stefaner",
      "start": 3405960,
      "text": "Cool. This will be interesting. Do you have an article out yet with the view people? You just started, so you're just.",
      "id": "ep_41_ut_216"
    },
    {
      "end": 3476860,
      "speaker": "Lisa Strausfeld",
      "start": 3413728,
      "text": "Yeah, we have. I've been working. I have a partner in crime there, David Harding, who has more of a kind of technology and product background. And we just presented a strategy for the next evolution of view, which I'm actually quite excited about and probably should not talk about yet, but I'll just say that it was really looking. I was kind of upset. Acknowledge that so much content, especially news and even opinion content, is really, is so ephemeral. I thought opinion, opinion content has a slightly longer shelf life than news. But still, even if it's the most beautifully written argument, the shelf life is still under two weeks, basically. And so we're looking at. But they're things that opinions leave behind and that last. And I.",
      "id": "ep_41_ut_217"
    },
    {
      "end": 3493416,
      "speaker": "Moritz Stefaner",
      "start": 3478640,
      "text": "Or you could even unfold big debates and shed light on all the pros and cons and make something really lasting. And many of the big issues are not going away in a week or two, but we'll stick with us a bit longer.",
      "id": "ep_41_ut_218"
    },
    {
      "end": 3493688,
      "speaker": "Enrico Bertini",
      "start": 3493448,
      "text": "Right?",
      "id": "ep_41_ut_219"
    },
    {
      "end": 3507092,
      "speaker": "Lisa Strausfeld",
      "start": 3493744,
      "text": "Yes. You hit on the keyword issues? Yes, yes, yes. Exactly. So we'll have to do an update sometime, or you'll see some of that work probably in the next six months or so. Yeah.",
      "id": "ep_41_ut_220"
    },
    {
      "end": 3511620,
      "speaker": "Moritz Stefaner",
      "start": 3507196,
      "text": "Cool. Yeah. Looking forward. We're almost.",
      "id": "ep_41_ut_221"
    },
    {
      "end": 3519960,
      "speaker": "Lisa Strausfeld",
      "start": 3511740,
      "text": "I know. The time just went. I thought, how am I going to. Okay. It went so fast.",
      "id": "ep_41_ut_222"
    },
    {
      "end": 3525876,
      "speaker": "Enrico Bertini",
      "start": 3520540,
      "text": "So should we go quickly through the questions that some of our listeners asked?",
      "id": "ep_41_ut_223"
    },
    {
      "end": 3527212,
      "speaker": "Moritz Stefaner",
      "start": 3525948,
      "text": "Yeah. At least.",
      "id": "ep_41_ut_224"
    },
    {
      "end": 3528156,
      "speaker": "Enrico Bertini",
      "start": 3527316,
      "text": "At least, right?",
      "id": "ep_41_ut_225"
    },
    {
      "end": 3528940,
      "speaker": "Moritz Stefaner",
      "start": 3528188,
      "text": "Yes, at least.",
      "id": "ep_41_ut_226"
    },
    {
      "end": 3529404,
      "speaker": "Enrico Bertini",
      "start": 3529060,
      "text": "Yeah.",
      "id": "ep_41_ut_227"
    },
    {
      "end": 3530080,
      "speaker": "Lisa Strausfeld",
      "start": 3529452,
      "text": "Yeah.",
      "id": "ep_41_ut_228"
    },
    {
      "end": 3536356,
      "speaker": "Enrico Bertini",
      "start": 3531220,
      "text": "You want to start? Yeah. So the first one, I think, is Andy Kirk from visualizing data.",
      "id": "ep_41_ut_229"
    },
    {
      "end": 3537280,
      "speaker": "Lisa Strausfeld",
      "start": 3536428,
      "text": "Oh, Andy.",
      "id": "ep_41_ut_230"
    },
    {
      "end": 3550320,
      "speaker": "Enrico Bertini",
      "start": 3537580,
      "text": "He said the Bloomberg visual identity is striking and consistently maintained. Does the back. No. What is that? Oh. Does the black background ever become restrictive for choices?",
      "id": "ep_41_ut_231"
    },
    {
      "end": 3563210,
      "speaker": "Lisa Strausfeld",
      "start": 3550650,
      "text": "It's funny. The team has debated that. And again, I still have a very close relationship with all those guys, but not officially on the team anymore. The black really came.",
      "id": "ep_41_ut_232"
    },
    {
      "end": 3572458,
      "speaker": "Enrico Bertini",
      "start": 3563290,
      "text": "So I just want to say that it's true that when you see Bloomberg visualization, it's clear that it comes from Bloomberg. So the brand is very strong font and colors.",
      "id": "ep_41_ut_233"
    },
    {
      "end": 3576990,
      "speaker": "Lisa Strausfeld",
      "start": 3572514,
      "text": "That's fantastic. That's good. That was the idea. And the black really comes from the terminal.",
      "id": "ep_41_ut_234"
    },
    {
      "end": 3579334,
      "speaker": "Enrico Bertini",
      "start": 3577950,
      "text": "Oh, yeah, sure.",
      "id": "ep_41_ut_235"
    },
    {
      "end": 3611230,
      "speaker": "Lisa Strausfeld",
      "start": 3579462,
      "text": "And then we. Yeah, we just wanted to brand it. Chris Cannon is the lead designer and sort of keeper of the visual standards for the visual data team. And he was really the first hire after Hilla and I joined Bloomberg, and we kind of established it together and took the typeface from. The typeface actually came from the work that pentagram did for the displays.",
      "id": "ep_41_ut_236"
    },
    {
      "end": 3612330,
      "speaker": "Moritz Stefaner",
      "start": 3611570,
      "text": "Oh, nice.",
      "id": "ep_41_ut_237"
    },
    {
      "end": 3655100,
      "speaker": "Lisa Strausfeld",
      "start": 3612450,
      "text": "Which is a kind of cut of Avenir and which came from the identity of Bloomberg, the logotype. Anyway, so that's what it's been. But it's starting to change and it really needs to be integrated into the media group. And as far as the question, it actually is hard to work on black. It started to drive me crazy. And, I mean, there's just like, there's a lot of subtlety. You know, it's nice to have all those grays to work with, you know, when you're working on a white background. Yeah, but I like, I mean, you know, I guess it did, it served its purpose, which is to sort of, you know, maintain the brand.",
      "id": "ep_41_ut_238"
    },
    {
      "end": 3662156,
      "speaker": "Moritz Stefaner",
      "start": 3655140,
      "text": "It's a strong statement for pro digital. So it, to me, a black background always says, okay, this is not a paper.",
      "id": "ep_41_ut_239"
    },
    {
      "end": 3663560,
      "speaker": "Lisa Strausfeld",
      "start": 3662268,
      "text": "Exactly, exactly.",
      "id": "ep_41_ut_240"
    },
    {
      "end": 3673888,
      "speaker": "Moritz Stefaner",
      "start": 3664260,
      "text": "And I think that's, that also between the lines. I think that's a big part of it. That's a purely digital product. This is not going to be printed.",
      "id": "ep_41_ut_241"
    },
    {
      "end": 3674968,
      "speaker": "Lisa Strausfeld",
      "start": 3673944,
      "text": "Exactly. Exactly.",
      "id": "ep_41_ut_242"
    },
    {
      "end": 3677080,
      "speaker": "Moritz Stefaner",
      "start": 3675064,
      "text": "Yeah. And I think that's kind of interesting.",
      "id": "ep_41_ut_243"
    },
    {
      "end": 3677704,
      "speaker": "Lisa Strausfeld",
      "start": 3677120,
      "text": "Yeah.",
      "id": "ep_41_ut_244"
    },
    {
      "end": 3686824,
      "speaker": "Moritz Stefaner",
      "start": 3677872,
      "text": "But I agree with you. I started so many projects on black background because I think, like, I want these colors, and then it's about a switch over again. It's hard.",
      "id": "ep_41_ut_245"
    },
    {
      "end": 3687784,
      "speaker": "Lisa Strausfeld",
      "start": 3686872,
      "text": "Yeah. Yes.",
      "id": "ep_41_ut_246"
    },
    {
      "end": 3688736,
      "speaker": "Moritz Stefaner",
      "start": 3687832,
      "text": "It's hard to make it work.",
      "id": "ep_41_ut_247"
    },
    {
      "end": 3689600,
      "speaker": "Lisa Strausfeld",
      "start": 3688768,
      "text": "It is, it is.",
      "id": "ep_41_ut_248"
    },
    {
      "end": 3696220,
      "speaker": "Enrico Bertini",
      "start": 3689680,
      "text": "So, Lisa, do you know by any chance, what's the reason why the original Bloomberg terminals are black background?",
      "id": "ep_41_ut_249"
    },
    {
      "end": 3700070,
      "speaker": "Lisa Strausfeld",
      "start": 3696570,
      "text": "Oh, my goodness. I'm black with amber text. I mean, I think.",
      "id": "ep_41_ut_250"
    },
    {
      "end": 3703690,
      "speaker": "Enrico Bertini",
      "start": 3701130,
      "text": "Is there any reason or the first computer screen.",
      "id": "ep_41_ut_251"
    },
    {
      "end": 3711722,
      "speaker": "Lisa Strausfeld",
      "start": 3703730,
      "text": "I mean, they were, you know, in the eighties, I mean, it was, it was like, it's, it's just a legacy thing.",
      "id": "ep_41_ut_252"
    },
    {
      "end": 3712434,
      "speaker": "Moritz Stefaner",
      "start": 3711906,
      "text": "Yeah.",
      "id": "ep_41_ut_253"
    },
    {
      "end": 3729820,
      "speaker": "Lisa Strausfeld",
      "start": 3712522,
      "text": "But, and I think people just got used to it. It's also a bit of a, it's a branding thing too, in some ways. I mean, it's a real, there's a real cache about having a Bloomberg criminal, I think, in the, you know, in the world of finance.",
      "id": "ep_41_ut_254"
    },
    {
      "end": 3731600,
      "speaker": "Enrico Bertini",
      "start": 3730840,
      "text": "Yeah.",
      "id": "ep_41_ut_255"
    },
    {
      "end": 3733020,
      "speaker": "Moritz Stefaner",
      "start": 3731760,
      "text": "Do you have one?",
      "id": "ep_41_ut_256"
    },
    {
      "end": 3734024,
      "speaker": "Lisa Strausfeld",
      "start": 3733360,
      "text": "Well, I.",
      "id": "ep_41_ut_257"
    },
    {
      "end": 3735544,
      "speaker": "Moritz Stefaner",
      "start": 3734072,
      "text": "Does every employee get one?",
      "id": "ep_41_ut_258"
    },
    {
      "end": 3738304,
      "speaker": "Lisa Strausfeld",
      "start": 3735592,
      "text": "Oh, yeah. I mean, we work on it all day, I guess.",
      "id": "ep_41_ut_259"
    },
    {
      "end": 3739140,
      "speaker": "Moritz Stefaner",
      "start": 3738432,
      "text": "Yeah.",
      "id": "ep_41_ut_260"
    },
    {
      "end": 3785676,
      "speaker": "Enrico Bertini",
      "start": 3740200,
      "text": "I think I remember reading, I think Stephen Few, many months ago published a blog post on whether there is any advantage from the perceptual point of view on having a black background over a white background. And I think there's, I think he explains that there's no advantage whatsoever. But once again, I'm intrigued by the fact that there are so many things that we cannot explain by just looking up at perception, but then there is a difference more on the emotional side or other related effects. Right. And I think that we tend to disregard this kind of factors that actually. And when in fact they do play a very, very strong role.",
      "id": "ep_41_ut_261"
    },
    {
      "end": 3786852,
      "speaker": "Lisa Strausfeld",
      "start": 3785788,
      "text": "Absolutely.",
      "id": "ep_41_ut_262"
    },
    {
      "end": 3794708,
      "speaker": "Enrico Bertini",
      "start": 3787036,
      "text": "Yeah. And I think that's a very important thing to take into account when designing visualizations in general.",
      "id": "ep_41_ut_263"
    },
    {
      "end": 3795920,
      "speaker": "Lisa Strausfeld",
      "start": 3794884,
      "text": "Absolutely.",
      "id": "ep_41_ut_264"
    },
    {
      "end": 3806960,
      "speaker": "Enrico Bertini",
      "start": 3798500,
      "text": "So there was another question from Lynn Cherney. How do you pick the stories? You cover an amazing array, not all very financial.",
      "id": "ep_41_ut_265"
    },
    {
      "end": 3972460,
      "speaker": "Lisa Strausfeld",
      "start": 3807320,
      "text": "Yeah. That was always the question. Again, when I started at Bloomberg and started the team, one of the big challenges and opportunities was how to connect with editorial, which is why I went there. And so we, the team had a lot of ideas, but we also sort of went around and I was reporting to Norman Pearlstine, who is kind of a legend in basically journalism, and he ended up leaving and going back to time, but so we got requests. Oh, I forgot to say that the team, this is kind of important. Whoops. The team started as this product team, kind of interactive product team. But then we brought in five graphic journalists. This was kind of material and important and we're running out of time to run. But we brought in five graphic journalists who had been working at Bloomberg and were really well trained. And the teams kind of worked side by side initially and then they started really collaborating. And I mean, it's really one team now, but the cultures, because the graphic journalists really are journalists and the data visualization team were basically like designers and developers. And the World cup project was the first real collaboration between the teams. And that has been really amazing. So anyway, the team takes requests from the newsroom, but we also, the team was also sort of proposing projects, basically big data products. And like the industry leaderboard was for a new franchise, as they call it, which is kind of like, you know, Bloomberg's version of the Fortune 500. It's the, it's 600 companies organized by industry. I hope that answers the question. So, but it was always, I would say that it was never exactly solved. I mean, there are requests from the newsroom, but they're very short cycle. It's harder to get longer term requests. And that's what I wanted, actually. I mean, the World cup was kind of an obvious one in the election. The team is working on something for the midterm election, but the news team, they work on a totally different cycle than most of us who create larger scale data visualizations.",
      "id": "ep_41_ut_266"
    },
    {
      "end": 3979866,
      "speaker": "Moritz Stefaner",
      "start": 3973330,
      "text": "So it would work best if then the data visualization people come up with interesting themes and approach the editorials is.",
      "id": "ep_41_ut_267"
    },
    {
      "end": 3992870,
      "speaker": "Lisa Strausfeld",
      "start": 3979898,
      "text": "That, I think it's a combination of the two and there are a lot of experiments and they're still kind of iterating on that and doing the same for Bloomberg View.",
      "id": "ep_41_ut_268"
    },
    {
      "end": 3999972,
      "speaker": "Moritz Stefaner",
      "start": 3994570,
      "text": "Nice. That sounds all really good. Now I'm really curious what you will do.",
      "id": "ep_41_ut_269"
    },
    {
      "end": 4003904,
      "speaker": "Lisa Strausfeld",
      "start": 4000106,
      "text": "Actually, I'm very excited about it and I'll keep you posted on that.",
      "id": "ep_41_ut_270"
    },
    {
      "end": 4009728,
      "speaker": "Moritz Stefaner",
      "start": 4003952,
      "text": "We'll see. We'll see it happening. We'll just watch you. And I think we have to wrap it up.",
      "id": "ep_41_ut_271"
    },
    {
      "end": 4010048,
      "speaker": "Lisa Strausfeld",
      "start": 4009784,
      "text": "Yes.",
      "id": "ep_41_ut_272"
    },
    {
      "end": 4012880,
      "speaker": "Moritz Stefaner",
      "start": 4010104,
      "text": "Because we are like stealing too much of your time already.",
      "id": "ep_41_ut_273"
    },
    {
      "end": 4015976,
      "speaker": "Lisa Strausfeld",
      "start": 4012960,
      "text": "Oh, it's such a pleasure. I could keep talking if I didn't have to go.",
      "id": "ep_41_ut_274"
    },
    {
      "end": 4017776,
      "speaker": "Enrico Bertini",
      "start": 4016048,
      "text": "Keep talking for a few hours.",
      "id": "ep_41_ut_275"
    },
    {
      "end": 4018920,
      "speaker": "Lisa Strausfeld",
      "start": 4017808,
      "text": "The school pickup.",
      "id": "ep_41_ut_276"
    },
    {
      "end": 4025978,
      "speaker": "Moritz Stefaner",
      "start": 4019080,
      "text": "Yeah, we'll continue. Maybe once your first new products out, we can continue.",
      "id": "ep_41_ut_277"
    },
    {
      "end": 4028630,
      "speaker": "Lisa Strausfeld",
      "start": 4026034,
      "text": "I would love that. So nice to meet you. Enrico.",
      "id": "ep_41_ut_278"
    },
    {
      "end": 4034778,
      "speaker": "Enrico Bertini",
      "start": 4030850,
      "text": "I have a question. Is it possible to come visiting you at Bloomberg? I would love to go.",
      "id": "ep_41_ut_279"
    },
    {
      "end": 4037354,
      "speaker": "Lisa Strausfeld",
      "start": 4034794,
      "text": "Of course. Yeah, that would be fantastic. Yeah.",
      "id": "ep_41_ut_280"
    },
    {
      "end": 4038418,
      "speaker": "Enrico Bertini",
      "start": 4037442,
      "text": "Okay, great.",
      "id": "ep_41_ut_281"
    },
    {
      "end": 4043154,
      "speaker": "Lisa Strausfeld",
      "start": 4038554,
      "text": "Yeah. And Moritz, I would love to see you when you come in December. We'll have to get together.",
      "id": "ep_41_ut_282"
    },
    {
      "end": 4047074,
      "speaker": "Moritz Stefaner",
      "start": 4043282,
      "text": "I'll let you know. I don't know exactly how it will play out, but there will be. Yeah.",
      "id": "ep_41_ut_283"
    },
    {
      "end": 4048210,
      "speaker": "Lisa Strausfeld",
      "start": 4047122,
      "text": "Okay, great.",
      "id": "ep_41_ut_284"
    },
    {
      "end": 4048786,
      "speaker": "Moritz Stefaner",
      "start": 4048290,
      "text": "Cool.",
      "id": "ep_41_ut_285"
    },
    {
      "end": 4049866,
      "speaker": "Enrico Bertini",
      "start": 4048898,
      "text": "Okay, great.",
      "id": "ep_41_ut_286"
    },
    {
      "end": 4050386,
      "speaker": "Moritz Stefaner",
      "start": 4049938,
      "text": "Thanks so much.",
      "id": "ep_41_ut_287"
    },
    {
      "end": 4052066,
      "speaker": "Lisa Strausfeld",
      "start": 4050418,
      "text": "Thank you so much. This is such a pleasure.",
      "id": "ep_41_ut_288"
    },
    {
      "end": 4053490,
      "speaker": "Moritz Stefaner",
      "start": 4052138,
      "text": "Now run, run to your meeting.",
      "id": "ep_41_ut_289"
    },
    {
      "end": 4056540,
      "speaker": "Lisa Strausfeld",
      "start": 4053530,
      "text": "Yes. Okay. Okay, bye. It.",
      "id": "ep_41_ut_290"
    }
  ],
  "confidence": 0.91951772485691,
  "audio_duration": 4064,
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_status_code": null,
  "webhook_auth": false,
  "webhook_auth_header_name": null,
  "speed_boost": false,
  "auto_highlights_result": null,
  "auto_highlights": false,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_audio_quality": null,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "content_safety": false,
  "iab_categories": true,
  "content_safety_labels": {
    "status": "unavailable",
    "results": [],
    "summary": {}
  },
  "language_detection": false,
  "language_detection_threshold": null,
  "language_confidence": null,
  "custom_spelling": null,
  "throttled": false,
  "auto_chapters": true,
  "summarization": false,
  "summary_type": null,
  "summary_model": null,
  "custom_topics": false,
  "topics": [],
  "speech_threshold": null,
  "speech_model": "best",
  "chapters": [
    {
      "summary": "I'm a bit stressed out at the end of September. I will be coming to New York in December, I think. We should organize some data stories, parties everywhere, meet up or something. If you are going to visit, let us know and we can maybe organize something.",
      "gist": "Data stories #41",
      "headline": "Enrico Moritz: I'm a bit stressed out right now",
      "start": 10280,
      "end": 106940,
      "id": "ep_41_ch_0"
    },
    {
      "summary": "So we have a special guest as usual today, Lisa Strausfeld from Bloomberg. How are you? We are great. We are so happy here.",
      "gist": "Interview with Lisa Strausfeld",
      "headline": "Lisa Strausfeld from Bloomberg joins us today to discuss economic news",
      "start": 108680,
      "end": 124800,
      "id": "ep_41_ch_1"
    },
    {
      "summary": "Lisa Strausfeld is creative director at Bloomberg View. She founded and created the Bloomberg visual data team, which is still running strong. Strasfeld studied art history and computer science in college. She says she is officially the last year of the baby boomer generation.",
      "gist": "Meet Lisa Strausfeld at Bloomberg View",
      "headline": "Lisa Strausfeld is creative director at Bloomberg View",
      "start": 127660,
      "end": 417770,
      "id": "ep_41_ch_2"
    },
    {
      "summary": "How was it like to program graphics at that time? Like, was it very tedious? Lots of numbers? Did you have to memorize a lot or how. Was it very low level? Probably lots of it was.",
      "gist": "Programming in C# at Brown",
      "headline": "Was it very low level at that time? Probably lots of it was",
      "start": 418790,
      "end": 475826,
      "id": "ep_41_ch_3"
    },
    {
      "summary": "Maya: In order to be a 21st century educated citizen, I think everyone needs to take one programming class. Maya: The web used to be such a mess, but now the last two or three years, amazing, like new tools and technologies have really appeared. She is seriously thinking about getting back into programming.",
      "gist": "Did You Need to Code to Become a Visualization Expert?",
      "headline": "Maya says in order to become a visualization expert, you need to code",
      "start": 475938,
      "end": 691118,
      "id": "ep_41_ch_4"
    },
    {
      "summary": "I think about scale a lot. I think scale is kind of key to innovation. And I find that I go through these points in my career where I want to scale it up. And then it gets to a point where I just feel like I need to get back to some kind of hands on making experience.",
      "gist": "The idea of scale in business",
      "headline": "Moritz: I think scale is key to innovation",
      "start": 691214,
      "end": 931850,
      "id": "ep_41_ch_5"
    },
    {
      "summary": "When he was at Motorola he did layout design for memory chips. He then went on to study at MIT media lab. Did you ever build a house? He's designed a couple.",
      "gist": "Coding as a student of architecture",
      "headline": "You studied architecture at Harvard and then went to MIT media last year",
      "start": 932230,
      "end": 1289090,
      "id": "ep_41_ch_6"
    },
    {
      "summary": "When he arrived at MIT, he never had really thought about graphic design or information design. The first projects he worked on were indeed three dimensional. It's kind of what he's doing right now with Vue in so many ways.",
      "gist": "The Design Lab at MIT",
      "headline": "Shortly after I arrived there, silicon graphics dumped a shipment of workstations",
      "start": 1289830,
      "end": 1558306,
      "id": "ep_41_ch_7"
    },
    {
      "summary": "Before Quokka, I started a company from the media lab called Perspecta. I was working with some of the most talented people working in data visualization today. And those products that we created, I still think are some of. the most innovative. Are they preserved?",
      "gist": "Peter Briscoe on Quokka",
      "headline": "Before Quokka, there was a company called Perspecta",
      "start": 1558338,
      "end": 1904080,
      "id": "ep_41_ch_8"
    },
    {
      "summary": "Michael Beirut was a partner at legendary design firm Pentagram for almost ten years. He says data visualization really took off in 2000, when most of the work went back into the lab. Beirut says he always chose his work based on what he was passionate about.",
      "gist": "Pentagram: The Art of Design",
      "headline": "You went to Pentagram, legendary design firm, starting in 2002",
      "start": 1904460,
      "end": 2266540,
      "id": "ep_41_ch_9"
    },
    {
      "summary": "Morads: I feel like I in some ways went undercover as a information and interaction designer. He left Pentagram and started major league politics. Just as he was starting that, Bloomberg came knocking about this opportunity to bring, to really focus on data visualization. Morads: It was a great opportunity.",
      "gist": "Moving From Pentagram to Bloomberg",
      "headline": "After nine years at Pentagram, you joined Bloomberg to focus on data visualization",
      "start": 2266620,
      "end": 2742440,
      "id": "ep_41_ch_10"
    },
    {
      "summary": "Between explanatory and exploratory, data visualizations and explanatory, typically news driven, small set snapshots of data. How do you marry these two things? And how.",
      "gist": "In the Elevator Between Exploratory and Explanatory Data Visual",
      "headline": "Between explanatory and exploratory, data visualizations and infographics are different",
      "start": 2742940,
      "end": 3067154,
      "id": "ep_41_ch_11"
    },
    {
      "summary": "Billionaires actually does integrate different views of the product with stories. And then now there's a mobile version that the team has built which is pretty cool. There's a billionaires team at Bloomberg. It's a serious investigative journalistic team. A lot of them are pretty secretive.",
      "gist": "Billionaires: The Secret Life of Business",
      "headline": "Billionaires actually does integrate different views of the product with stories",
      "start": 3067322,
      "end": 3189220,
      "id": "ep_41_ch_12"
    },
    {
      "summary": "Bloomberg review is mostly opinion, is it? Opinion articles, like individual pieces of opinion pieces. And there really have the opportunity to find the most optimal ways of integrating data, data visualization. We just presented a strategy for the next evolution of view, which I'm actually quite excited about.",
      "gist": "Bloomberg View's redesign and integration with data",
      "headline": "How do you integrate data with journalism, like these living platforms",
      "start": 3189260,
      "end": 3519960,
      "id": "ep_41_ch_13"
    },
    {
      "summary": "So should we go quickly through the questions that some of our listeners asked? At least. At least, right? Yes, at least. You want to start? Yeah.",
      "gist": "Questions for the Experts",
      "headline": "So should we go quickly through the questions that some of our listeners asked",
      "start": 3520540,
      "end": 3532980,
      "id": "ep_41_ch_14"
    },
    {
      "summary": "Bloomberg's visual identity is striking and consistently maintained. Does the black background ever become restrictive for choices? It's hard to work on black. It started to drive me crazy. But it's starting to change and it really needs to be integrated into the media group.",
      "gist": "The New Bloomberg's Visual Identity",
      "headline": "Andy Kirk says the Bloomberg visual identity is striking and consistently maintained",
      "start": 3533020,
      "end": 3689600,
      "id": "ep_41_ch_15"
    },
    {
      "summary": "The original Bloomberg terminals are black background. It's also a bit of a branding thing too, in some ways. And I think that's a very important thing to take into account when designing visualizations in general.",
      "gist": "Black Backgrounds on Bloomberg terminals",
      "headline": "Lisa: The original Bloomberg terminals were black with amber text",
      "start": 3689680,
      "end": 3795920,
      "id": "ep_41_ch_16"
    },
    {
      "summary": "When I started at Bloomberg and started the team, one of the big challenges and opportunities was how to connect with editorial. The World Cup project was the first real collaboration between the teams. They're still kind of iterating on that and doing the same for Bloomberg View.",
      "gist": "How Data Visualization Made its Way at Bloomberg",
      "headline": "When I started at Bloomberg, one of the challenges was how to connect editorial",
      "start": 3798500,
      "end": 4027778,
      "id": "ep_41_ch_17"
    },
    {
      "summary": "Enrico. Is it possible to come visiting you at Bloomberg? I would love to go. And Moritz, I wouldlove to see you when you come in December. We'll have to get together.",
      "gist": "Interview with Bloomberg's Enrico Ferrari",
      "headline": "Enrico: Is it possible to come visiting you at Bloomberg",
      "start": 4027794,
      "end": 4052066,
      "id": "ep_41_ch_18"
    },
    {
      "summary": "Now run, run to your meeting. Yes. Okay. Okay, bye.",
      "gist": "Oh, bye",
      "headline": "Now run, run to your meeting. Yes. Okay. Okay, bye",
      "start": 4052138,
      "end": 4056540,
      "id": "ep_41_ch_19"
    }
  ],
  "disfluencies": false,
  "entity_detection": false,
  "sentiment_analysis": false,
  "sentiment_analysis_results": null,
  "entities": null,
  "speakers_expected": null,
  "summary": null,
  "custom_topics_results": null,
  "is_deleted": null,
  "episode_num": "41",
  "episode_metadata": {
    "speakers": [
      "Enrico Bertini",
      "Moritz Stefaner",
      "Lisa Strausfeld"
    ],
    "WPid": "209",
    "url": "https://datastori.es/podlove/file/459/s/feed/c/mp3/datastories-41.mp3",
    "episode_title": "With Lisa Strausfeld"
  }
}