{
  "id": "223cbc75-77dd-4d38-b089-2bc81597fad3",
  "language_model": "assemblyai_default",
  "acoustic_model": "assemblyai_default",
  "language_code": "en_us",
  "status": "completed",
  "audio_url": "https://datastori.es/podlove/file/796/s/feed/c/mp3/data-stories-53-data-safari-w-benedikt-gros.mp3",
  "utterances": [
    {
      "end": 31904,
      "speaker": "Moritz Stefaner",
      "start": 520,
      "text": "Data stories is supported by Tableau software, helping people see and understand their data. Get answers from interactive dashboards. Wherever you go for your free trial, visit Tableau software@Tableau.com. Datastories. That's Tableau.com Datastories. Hey, everyone. Datastore is 53.",
      "id": "ep_53_ut_0"
    },
    {
      "end": 32264,
      "speaker": "Enrico Bertini",
      "start": 31992,
      "text": "53.",
      "id": "ep_53_ut_1"
    },
    {
      "end": 35744,
      "speaker": "Moritz Stefaner",
      "start": 32272,
      "text": "Hi, Enrico. 53. Good number.",
      "id": "ep_53_ut_2"
    },
    {
      "end": 36568,
      "speaker": "Enrico Bertini",
      "start": 35912,
      "text": "Yeah.",
      "id": "ep_53_ut_3"
    },
    {
      "end": 37820,
      "speaker": "Moritz Stefaner",
      "start": 36704,
      "text": "How you doing, man?",
      "id": "ep_53_ut_4"
    },
    {
      "end": 40500,
      "speaker": "Enrico Bertini",
      "start": 38120,
      "text": "Good, good. Spring is here.",
      "id": "ep_53_ut_5"
    },
    {
      "end": 43112,
      "speaker": "Moritz Stefaner",
      "start": 41120,
      "text": "Still not going away.",
      "id": "ep_53_ut_6"
    },
    {
      "end": 46328,
      "speaker": "Enrico Bertini",
      "start": 43256,
      "text": "Not going away. It's been crazy so far.",
      "id": "ep_53_ut_7"
    },
    {
      "end": 47072,
      "speaker": "Moritz Stefaner",
      "start": 46504,
      "text": "Yeah.",
      "id": "ep_53_ut_8"
    },
    {
      "end": 47864,
      "speaker": "Enrico Bertini",
      "start": 47176,
      "text": "Yeah.",
      "id": "ep_53_ut_9"
    },
    {
      "end": 52984,
      "speaker": "Moritz Stefaner",
      "start": 48032,
      "text": "I just came back from resonate festival in Belgrade, so I was there for a full week. That was good.",
      "id": "ep_53_ut_10"
    },
    {
      "end": 53860,
      "speaker": "Enrico Bertini",
      "start": 53112,
      "text": "Yeah.",
      "id": "ep_53_ut_11"
    },
    {
      "end": 56944,
      "speaker": "Moritz Stefaner",
      "start": 54320,
      "text": "I did the insect smarts workshop again.",
      "id": "ep_53_ut_12"
    },
    {
      "end": 57904,
      "speaker": "Enrico Bertini",
      "start": 57072,
      "text": "Oh, how was it?",
      "id": "ep_53_ut_13"
    },
    {
      "end": 76014,
      "speaker": "Moritz Stefaner",
      "start": 57952,
      "text": "Yeah, yeah, it was good. We looked at swarming behavior and collective intelligence, things like this. And Dominicos and I, we brought a few processing sketches and people could modify them and we would talk about the principles behind them. But then also how you can use these principles to, I don't know, make cooler graphics, I guess.",
      "id": "ep_53_ut_14"
    },
    {
      "end": 76542,
      "speaker": "Enrico Bertini",
      "start": 76142,
      "text": "Yeah.",
      "id": "ep_53_ut_15"
    },
    {
      "end": 77438,
      "speaker": "Moritz Stefaner",
      "start": 76606,
      "text": "So it was nice.",
      "id": "ep_53_ut_16"
    },
    {
      "end": 78690,
      "speaker": "Enrico Bertini",
      "start": 77534,
      "text": "How was Resonate?",
      "id": "ep_53_ut_17"
    },
    {
      "end": 103580,
      "speaker": "Moritz Stefaner",
      "start": 79270,
      "text": "Very good. It's a great town. It's very rough, but also very, like, lots of emerging stuff. And the festival is good, too. It's a good conference. J. Thorp once said it's the sexy European cousin of EYEO festival. I think that's totally true. Yeah, it was good stuff. Lots of partying, too. So now I have to. My voice has to recover, and I have to catch up with projects.",
      "id": "ep_53_ut_18"
    },
    {
      "end": 113360,
      "speaker": "Enrico Bertini",
      "start": 103620,
      "text": "Oh, I think I saw a picture of you at a rave party. Yes. Somebody sent it to me. I cannot say the rest.",
      "id": "ep_53_ut_19"
    },
    {
      "end": 116684,
      "speaker": "Moritz Stefaner",
      "start": 115380,
      "text": "What happens in Belgrade.",
      "id": "ep_53_ut_20"
    },
    {
      "end": 119140,
      "speaker": "Enrico Bertini",
      "start": 116772,
      "text": "Whatever happened stays in Belgrade.",
      "id": "ep_53_ut_21"
    },
    {
      "end": 129144,
      "speaker": "Moritz Stefaner",
      "start": 121320,
      "text": "Anyways, so we have a special guest today, as usual. And this time it's Benedikt. Gross. Hi, Benedikt.",
      "id": "ep_53_ut_22"
    },
    {
      "end": 129968,
      "speaker": "Enrico Bertini",
      "start": 129232,
      "text": "Hi, Benedikt.",
      "id": "ep_53_ut_23"
    },
    {
      "end": 131440,
      "speaker": "Benedikt Groß",
      "start": 130024,
      "text": "Hi, everyone. Hi, there.",
      "id": "ep_53_ut_24"
    },
    {
      "end": 133460,
      "speaker": "Moritz Stefaner",
      "start": 131520,
      "text": "Hey, how are you doing?",
      "id": "ep_53_ut_25"
    },
    {
      "end": 138912,
      "speaker": "Benedikt Groß",
      "start": 134120,
      "text": "Good. Good. I mean, I'm quite excited to be in the talk.",
      "id": "ep_53_ut_26"
    },
    {
      "end": 144340,
      "speaker": "Moritz Stefaner",
      "start": 139096,
      "text": "Excellent. Can you tell us a bit about yourself? People might not know who you are. So what are you doing?",
      "id": "ep_53_ut_27"
    },
    {
      "end": 183874,
      "speaker": "Benedikt Groß",
      "start": 144940,
      "text": "Actually, a lot of things. I think I'm kind of in between a lot of things. But I mean, basically, normally my work involves somehow data, computational design, and also often speculative design. And so it's kind of hard to define as well. For me, it's quite fuzzy still. And I kind of often struggle to define that. Besides that, I'm running a little studio in Stuttgart also for that kind of work. And I bit of teaching. And then I'm also a research associate at the upcoming movie lab, which kind of deals with the future of mobility maps and also data and so on.",
      "id": "ep_53_ut_28"
    },
    {
      "end": 185310,
      "speaker": "Moritz Stefaner",
      "start": 183962,
      "text": "And where is that located?",
      "id": "ep_53_ut_29"
    },
    {
      "end": 204704,
      "speaker": "Benedikt Groß",
      "start": 185610,
      "text": "That is also located in Stuttgart. But they. I mean, the movable or the most kind of known product is car two go and so on. And they operate on the. On two continents and like 30 cities and so on. It's quite big in a way.",
      "id": "ep_53_ut_30"
    },
    {
      "end": 215460,
      "speaker": "Moritz Stefaner",
      "start": 204792,
      "text": "Great. Sounds like a great initiative. And it fits well because we just had an episode with Dietmar often who were talking about smart cities and so on. So that's a great match there.",
      "id": "ep_53_ut_31"
    },
    {
      "end": 222340,
      "speaker": "Benedikt Groß",
      "start": 216480,
      "text": "It's a nice balance between industry projects and my own projects and a bit of teaching and everything.",
      "id": "ep_53_ut_32"
    },
    {
      "end": 238940,
      "speaker": "Moritz Stefaner",
      "start": 222920,
      "text": "Yeah. And you have that art, science, design borderline syndrome thing going on anyways. Yeah. So I think on my radar, you popped up with the generativiges book, generative design book six, seven years ago.",
      "id": "ep_53_ut_33"
    },
    {
      "end": 241320,
      "speaker": "Benedikt Groß",
      "start": 240400,
      "text": "Quite old now.",
      "id": "ep_53_ut_34"
    },
    {
      "end": 256208,
      "speaker": "Moritz Stefaner",
      "start": 241400,
      "text": "Yeah. Yeah. But it's a great book for. So if you're into learning, processing and generally doing interesting graphics through computation, I think it's a great book still. And it's pretty much still valid. Right. Or would you say. Would you call it outdated, your own book? No, you wouldn't.",
      "id": "ep_53_ut_35"
    },
    {
      "end": 259680,
      "speaker": "Benedikt Groß",
      "start": 256304,
      "text": "But of course I wouldn't do that.",
      "id": "ep_53_ut_36"
    },
    {
      "end": 262500,
      "speaker": "Enrico Bertini",
      "start": 259720,
      "text": "By the day it's finished, it's outdated.",
      "id": "ep_53_ut_37"
    },
    {
      "end": 269720,
      "speaker": "Moritz Stefaner",
      "start": 262900,
      "text": "I think it's. The principles are so universal. They will be. This will be up to date in ten years still.",
      "id": "ep_53_ut_38"
    },
    {
      "end": 302024,
      "speaker": "Benedikt Groß",
      "start": 270260,
      "text": "Yeah. I mean, it took us quite some time to put that content in that specific way together. The idea is basically to have a programming book, but also a programming book, a book which deals more with the principles of generative design or computational design. Yeah. And also it's a collaboration. So, I mean, it's not just my book, it's also with Julia from informative and hot mood and Claudius and so on. So we had quite a bit of brainpower behind that.",
      "id": "ep_53_ut_39"
    },
    {
      "end": 309416,
      "speaker": "Moritz Stefaner",
      "start": 302152,
      "text": "Yeah. I think it sort of came out of your diploma thesis in Taufge Mund, is that right?",
      "id": "ep_53_ut_40"
    },
    {
      "end": 364200,
      "speaker": "Benedikt Groß",
      "start": 309448,
      "text": "Yeah, exactly. Exactly. So, I mean, that was in 2007 and back in. Back in. Back then, there was not that much around. There was just the processing book by Casey Reas and a few others books, but more than from whether from the math sites or from the programming side of things. And. Yeah. So then the diploma was in a collaboration between Julia and myself and. Yeah, it was kind of the blueprint or the first iteration of that book. And, yeah, we spent then kind of an entire semester on it and also diploma semester. And back then we had a diploma, and then it took us one and a half years part time, to kind of come to a phase which was then publishable.",
      "id": "ep_53_ut_41"
    },
    {
      "end": 364784,
      "speaker": "Moritz Stefaner",
      "start": 364320,
      "text": "Wow.",
      "id": "ep_53_ut_42"
    },
    {
      "end": 365232,
      "speaker": "Enrico Bertini",
      "start": 364872,
      "text": "Yeah.",
      "id": "ep_53_ut_43"
    },
    {
      "end": 367640,
      "speaker": "Moritz Stefaner",
      "start": 365296,
      "text": "And it's four or five people actually involved, so.",
      "id": "ep_53_ut_44"
    },
    {
      "end": 368104,
      "speaker": "Benedikt Groß",
      "start": 367720,
      "text": "Yeah, yeah.",
      "id": "ep_53_ut_45"
    },
    {
      "end": 369960,
      "speaker": "Moritz Stefaner",
      "start": 368152,
      "text": "You can see the effort that went into that.",
      "id": "ep_53_ut_46"
    },
    {
      "end": 396920,
      "speaker": "Benedikt Groß",
      "start": 370040,
      "text": "Yeah, yeah. When we had this, when we had with our publisher, the meeting, kind of where we signed the contract, how much in minds, they said like, yeah, guys, now imagine how much work it will be. And we were like, yes, and now multiply it by three. We were like, oh, no, it's a bummer. Well, it was. Yeah, it's hard.",
      "id": "ep_53_ut_47"
    },
    {
      "end": 398284,
      "speaker": "Enrico Bertini",
      "start": 397700,
      "text": "So, Ben.",
      "id": "ep_53_ut_48"
    },
    {
      "end": 399372,
      "speaker": "Benedikt Groß",
      "start": 398332,
      "text": "But it's nice because.",
      "id": "ep_53_ut_49"
    },
    {
      "end": 409080,
      "speaker": "Enrico Bertini",
      "start": 399516,
      "text": "Sorry. Sorry for interrupting. Can you describe generative design in a few words? Just. I'm just wondering, maybe some of our listeners don't know exactly what it is.",
      "id": "ep_53_ut_50"
    },
    {
      "end": 437926,
      "speaker": "Benedikt Groß",
      "start": 410140,
      "text": "I mean, I think there are many, many definitions. I think it's basically creating things, often visual things, like images, with code. So I would say it's kind of straightforward. Some people design with pencil or with Photoshop or whatever, and others then with code. And of course, it has advantages and disadvantages.",
      "id": "ep_53_ut_51"
    },
    {
      "end": 438930,
      "speaker": "Enrico Bertini",
      "start": 438078,
      "text": "Of course.",
      "id": "ep_53_ut_52"
    },
    {
      "end": 457250,
      "speaker": "Benedikt Groß",
      "start": 442310,
      "text": "I mean, my definition is often just like computational design is, when you wouldn't be able to do it manually by hand. Sorry.",
      "id": "ep_53_ut_53"
    },
    {
      "end": 460830,
      "speaker": "Moritz Stefaner",
      "start": 459510,
      "text": "It's super nice.",
      "id": "ep_53_ut_54"
    },
    {
      "end": 512906,
      "speaker": "Benedikt Groß",
      "start": 460870,
      "text": "I mean, they're interesting. I mean, there are interesting implications, of course, because then once you accept that you design or sketch everything with code, then in between your idea and the actual outcome, there is this additional layer or this kind of additional thing. First, you have to be able, as a designer, to kind of translate your idea or your algorithm or whatever into code. And then you in an abstract form with parameters or with a system, and then you have to be able to kind of write it into a computer, in a computer language. And then at the very end, you have your piece or your visual output, which is obviously quite different from something very direct, like working with a pencil.",
      "id": "ep_53_ut_55"
    },
    {
      "end": 514030,
      "speaker": "Enrico Bertini",
      "start": 513018,
      "text": "Yeah, of course.",
      "id": "ep_53_ut_56"
    },
    {
      "end": 538570,
      "speaker": "Moritz Stefaner",
      "start": 515010,
      "text": "And I mean, as we are data visualization podcasts, there's lots of overlap. So maybe from this end, data visualization might be a subfield of generative design, if you see that wide. But I think, I guess the main difference is simply that in generative design, you don't need to be able to trace back what the initial data conditions were that led to a certain visual. So it doesn't have to be that readable.",
      "id": "ep_53_ut_57"
    },
    {
      "end": 548670,
      "speaker": "Benedikt Groß",
      "start": 539830,
      "text": "Yeah, I think, in a way, you could say computational design is maybe just a vehicle to create data visualizations.",
      "id": "ep_53_ut_58"
    },
    {
      "end": 557200,
      "speaker": "Moritz Stefaner",
      "start": 548710,
      "text": "Yeah. Or all other kinds of things, like buildings or I. Yeah, buildings or whatever. Animations to sell cars or things like that.",
      "id": "ep_53_ut_59"
    },
    {
      "end": 578108,
      "speaker": "Benedikt Groß",
      "start": 558100,
      "text": "Yeah, I mean, I think there are exceptions. Whatever. For instance, Stephanie Posavec. I mean, she's crazy. I mean, she does things which manually, often manually, which I. Which I would consider like generic design. I mean, generated design.",
      "id": "ep_53_ut_60"
    },
    {
      "end": 586454,
      "speaker": "Moritz Stefaner",
      "start": 578204,
      "text": "I mean, even so, it is done by hand. Have you seen the dear data postcard exchange? So that's genitive, but it's on my head.",
      "id": "ep_53_ut_61"
    },
    {
      "end": 587662,
      "speaker": "Benedikt Groß",
      "start": 586542,
      "text": "Yeah, yeah, yeah.",
      "id": "ep_53_ut_62"
    },
    {
      "end": 589110,
      "speaker": "Moritz Stefaner",
      "start": 587726,
      "text": "Oh, we should, we should have them on.",
      "id": "ep_53_ut_63"
    },
    {
      "end": 590810,
      "speaker": "Enrico Bertini",
      "start": 589150,
      "text": "We should have. Yeah, absolutely.",
      "id": "ep_53_ut_64"
    },
    {
      "end": 618010,
      "speaker": "Moritz Stefaner",
      "start": 592470,
      "text": "Anyhow, so that's. So 2009, then you went to RCA in the design interactions program, which is like real hardcore art program, actually. I found that really cool that you would do that because you have sort of came from this applied design school in Schwerisch Mund and you did a few really nice projects. Do you want to tell us a bit about what you did there and.",
      "id": "ep_53_ut_65"
    },
    {
      "end": 718990,
      "speaker": "Benedikt Groß",
      "start": 619150,
      "text": "Yeah, I mean, I. Yeah, exactly. I mean, my. My background was pretty much in industry as an, as an interaction designer and user experience designer, but with this kind of love for computational design. So it was already kind of weird for me. You know, I was in industry, but then I was like, also keen on the, on the computational design side for the aesthetics sake of things and. Yeah, and then I decided I really should try to open up my scope and see what kind of else is around there. And I quite like the RCA program, the design interactions program, because it's kind of. I mean, yes, it's a lot of art, but also it tries really to, to look into technologies from many ways and also this kind of notion of speculative design, so that you kind of come up with scenarios which kind of try to make technology debatable and maybe even sketch out a bit alternative ways or alternative paths into the future. I was quite intrigued by that, and I had a tough time there because, I mean, with my applied background, it was, it was really tough at the beginning, but then after a while, I just accepted all those influences and also the great diversity of design in a way. And I think that helped then, really to redefine maybe myself a bit.",
      "id": "ep_53_ut_66"
    },
    {
      "end": 787930,
      "speaker": "Moritz Stefaner",
      "start": 721650,
      "text": "Yeah, I think it's a great program, and many listeners might not be familiar, but unfortunately, Dun and Raby, who ran the program now for almost ten years, I guess just retired. But I think it has been super influential and the approach is quite unique. So maybe the basic idea is instead of designing for needs today, as you would learn at a normal design school, this program, you basically design things for the near or intermediate future, but very concrete pieces, more or less, that would sort of play with future scenarios and what the role of technology might be in a few years ahead. They're super nice. It's always a bit cynical, critical, dark, but also whimsical, often what comes out of these investigations. And it's just, it's been a crazy program. It's worth to go on the website and just browse through the past years like the projects that were done there. And one of the projects you did in this context was the atlas of LA Pools. It was quite a long investigation in a seemingly mundane topic.",
      "id": "ep_53_ut_67"
    },
    {
      "end": 789810,
      "speaker": "Benedikt Groß",
      "start": 788590,
      "text": "Absolutely.",
      "id": "ep_53_ut_68"
    },
    {
      "end": 791810,
      "speaker": "Moritz Stefaner",
      "start": 790430,
      "text": "How did that happen?",
      "id": "ep_53_ut_69"
    },
    {
      "end": 840886,
      "speaker": "Benedikt Groß",
      "start": 792630,
      "text": "I mean, basically it actually happened also during an excursion. So there's this tradition that the first year always goes to an excursion. And our excursion was to California. And when I was flying into LA, so the first stop was in LA, I saw all those kind of silly and swimming pools from the plane. And that made me really wonder, is that not a bit odd? I mean, is this not supposed to be the desert and a very dry landscape? And, yeah, as I'm a very tidy designer, of course, coming from Germany, I noted down this question in my notebook, how many swimming pools are in LA? And. Yeah, and that as a potential kind of interesting question. And then.",
      "id": "ep_53_ut_70"
    },
    {
      "end": 841838,
      "speaker": "Moritz Stefaner",
      "start": 840918,
      "text": "It's a good question.",
      "id": "ep_53_ut_71"
    },
    {
      "end": 1072498,
      "speaker": "Benedikt Groß",
      "start": 841974,
      "text": "It's a good question, yeah. And then, and then kind of six months, nothing happened. But then I was at that time I did an internship at MIT Sensible City lab, and I met there Joey Lee. The project is a collaboration with him, with Joey. And we had like a lunch conversation and I've told him this question and he's coming from LA or he spent quite some time in LA and he was immediately intrigued in that question and he said, like, you know, I have no idea, but let's check out where there's a data set for that. And it turned out that there is not really a data set available for it. But then he managed to come up with some high resolution satellite imagery for that area, like really, really high resolution and also with additional channels, not just RGB and so on. And back then also it was harder to get this kind of data and. Yeah, and then at the beginning we were quite naive. We were thinking, this will be a piece of cake. With this satellite imagery dataset, we just detect all the blue colors, like, you know, from the magic wand tool in Photoshop. Blob detection, da da. You go and then you have it. But of course, reality is tricky. We ended up just with glitch, basically. You know, with this kind of simple detection, it's really hard to distinguish between a blue roof, a blue car, a blue everything. But still, we were kind of really intrigued by that question and we didn't gave up back then and we had a hard time to think alternative ways of how to approach the thing. And then we stumbled accidentally kind of on those services in India. Clipping path services in India so for the ones who are not familiar with that, it's basically a service for online shops. So normally if you go to Amazon or any kind of online shop, you find all the product pictures in front of a white background or a white background is most common. And these services in India, you send just their product images and they kind of clip out or trace out the product and kind of separate it nicely from the background with a Photoshop file. So you get a Photoshop file back with a clipping path vector in it which you then can use to kind of clip out the product from the rest. And that made us then wonder, maybe these guys can help us. And then we started to experiment with those services and kind of did variations in the instructions and so on. But basically we asked the people to clip out in the satellite imagery, the swimming pools. And then after a few initial tests, we received then this massive dataset back, I think with 60, 65 or something, 68,000 nicely clipped busier path. And, and then we were like, we were just like, this is crazy. I mean, in so many ways because we didn't pay a fortune for it. So we had really a bad conscience. Like, you know, this is like, this is crazy. So then this made us really think, like, hey, from something cute like a swimming pool and a, suddenly you end up at cheap labor expectation in India. You were like, okay, this is interesting.",
      "id": "ep_53_ut_72"
    },
    {
      "end": 1074666,
      "speaker": "Moritz Stefaner",
      "start": 1072594,
      "text": "And you were in the middle of it, basically.",
      "id": "ep_53_ut_73"
    },
    {
      "end": 1090190,
      "speaker": "Benedikt Groß",
      "start": 1074858,
      "text": "Yeah. And, and then we, we just decided that we really should try to push it as far as possible somehow, kind of. Really. Now take this serious and try to push it as hard as possible. And then you know that. Yeah, sorry, go ahead.",
      "id": "ep_53_ut_74"
    },
    {
      "end": 1101560,
      "speaker": "Enrico Bertini",
      "start": 1090970,
      "text": "So, Benedikt, I'm just curious. How, how did you do it technically? So what did you send to the, to the. So was that a crowdsourcing service or what?",
      "id": "ep_53_ut_75"
    },
    {
      "end": 1116436,
      "speaker": "Benedikt Groß",
      "start": 1101940,
      "text": "No, it's, it's really just, it's, there are many companies. I think it's, there's even, it's, I mean, if you go to, probably. There's a whole industry actually. Okay. And, yeah, basically, I'm just curious to.",
      "id": "ep_53_ut_76"
    },
    {
      "end": 1122340,
      "speaker": "Enrico Bertini",
      "start": 1116468,
      "text": "Hear what do you send to them and what did they return in what kind of format?",
      "id": "ep_53_ut_77"
    },
    {
      "end": 1190352,
      "speaker": "Benedikt Groß",
      "start": 1122500,
      "text": "So that was the tricky bit. I think that is maybe also. That was also the trick. So, so, yeah, they just accept Photoshop files. And so we had, we first had to convert the satellite imagery into Photoshop files and then also kind of keep all the projections and kind of the georeferencing separately this information and asked him not to kind of whatever scale or I, or kind of crop the file and then they would kind of trace all those swimming pools. And then in Photoshop you have then an additional vector layer. And then I've written then a script which takes that vector layer and exports that to a JSON file. And then with an additional kind of tooling, you can then kind of reference that back to actual latitude and longitude with the right projection.",
      "id": "ep_53_ut_78"
    },
    {
      "end": 1191016,
      "speaker": "Moritz Stefaner",
      "start": 1190416,
      "text": "Wow.",
      "id": "ep_53_ut_79"
    },
    {
      "end": 1304816,
      "speaker": "Benedikt Groß",
      "start": 1191168,
      "text": "So it's, yeah, it's not crazy fast. As you can imagine. Photoshop is not supposed to do that kind of thing. But it's surprising actually that what kind of stuff is possible with descripting facilities in the adobe products. It's quite good. Quite okay. Just okay. I would say not good, but okay. Yeah. And then we had this kind of vectors, then georeferenced again, and then we applied quite a few gis things like, does that make sense? And we tried to eliminate doubles and these kind of things, but still it was not kind of good enough because we had like 60 something thousand. And the problem was that the people in India were a bit over motivated, so they traced also like blue roofs sometimes, or blue other things. And also, to be fair, the resolution which we had in those images is not like the one I think it was like one Pixel a meter or something, or a bit better, but it's whatever. If you go to Google Maps and then you zoom whatever to zoom level 20, which is I think the maximum zoom level currently Google has, or the other, the other image providers, then we get a lot more resolution. Again, as we treated then the question, serious, we thought that, okay, we have to cross check now all that things in the highest possible zoom level to validate whether it's really a swimming pool or not. So we did another database then and then.",
      "id": "ep_53_ut_80"
    },
    {
      "end": 1305704,
      "speaker": "Enrico Bertini",
      "start": 1305008,
      "text": "I love that.",
      "id": "ep_53_ut_81"
    },
    {
      "end": 1306540,
      "speaker": "Moritz Stefaner",
      "start": 1305752,
      "text": "Horrible.",
      "id": "ep_53_ut_82"
    },
    {
      "end": 1314768,
      "speaker": "Benedikt Groß",
      "start": 1307360,
      "text": "Yeah, it's super messy, but interesting. We outsourced it again to this time. I mean, of course we resubmit. So, yeah, the first thing what we.",
      "id": "ep_53_ut_83"
    },
    {
      "end": 1316688,
      "speaker": "Moritz Stefaner",
      "start": 1314784,
      "text": "Did was, I think it's a performance piece. Most.",
      "id": "ep_53_ut_84"
    },
    {
      "end": 1318904,
      "speaker": "Enrico Bertini",
      "start": 1316744,
      "text": "It's a performance piece.",
      "id": "ep_53_ut_85"
    },
    {
      "end": 1320100,
      "speaker": "Moritz Stefaner",
      "start": 1318952,
      "text": "That's my theory.",
      "id": "ep_53_ut_86"
    },
    {
      "end": 1380530,
      "speaker": "Benedikt Groß",
      "start": 1320760,
      "text": "Yeah. The process is really interesting. Yeah. So basically Joey and mine, we myself, we checked it then manually, we kind of, you know, like, and we used then the pencil tool, you know, here are pockets. You missed that. Please go over it again. So we did several times. But then, but then, yeah, it was still not good enough. So we did in a database, then outsourced it to Amazon Mechanical Turk, where people would get a snapshot of that location with the highest possible zoom level, which Bing provides Bing maps provides. And then people had to flag whether it's a swimming pool or not a swimming pool. And if two people agreed, then it was like valid, and if nothing and so on and so on. And in the end, we had. Then we settled down to 43 and something thousand swimming pools in the La basin. So we did not the entire La county, but like. Yeah, the entire of LA. Of the La basin. Yeah.",
      "id": "ep_53_ut_87"
    },
    {
      "end": 1382570,
      "speaker": "Moritz Stefaner",
      "start": 1380950,
      "text": "So question answered.",
      "id": "ep_53_ut_88"
    },
    {
      "end": 1496940,
      "speaker": "Benedikt Groß",
      "start": 1383030,
      "text": "Yeah, question answered. But then, of course, the next thing was now we have this crazy data set and also this, this super interesting process which touches so many things. How can you make that tangible and how can you tell that story? So we tried to visualize it or to make that tangible in many ways. One thing which we did is then first, what we did is then to enhance the dataset with additional things. So, for instance, as we had the vectors of the pools, we could calculate the water evaporation, or we could calculate the address, or like, I mean, in America, it's in general amazing what kind of data is available. We could calculate how much the properties or how much the property or how much the parcel is worth in a. Worth which the swimming pool sit on Orlando, the zoning code, like lots of stuff even. We managed to crawl a database with sex offenders or crazy stuff, basically. And then we had a really massive data set with a lot of interesting data points. And then we did a few things. So one was the Spikadlas of elliphels, which is a series of books with 74 books and 6000 pages. And you have, for every neighborhood, whatever, Hollywood or Santa Monica, an individual book. And you have the image and you have like all the related data. And it's then organized by addresses and so on and so on. It's basically a gigantic look up book of all the swimming pools in LA. And then. Yeah.",
      "id": "ep_53_ut_89"
    },
    {
      "end": 1499456,
      "speaker": "Enrico Bertini",
      "start": 1498120,
      "text": "Is the book available somewhere?",
      "id": "ep_53_ut_90"
    },
    {
      "end": 1543446,
      "speaker": "Benedikt Groß",
      "start": 1499488,
      "text": "No, it's not available. I mean, we never. Right, it's a one off. I mean, it was quite. In a lot of exhibitions and that was quite successful because that way the data set is really tangible. So, like, at the beginning, normally the initial reaction is like, oh, this is funny. You know, these guys are like crazy and so on. But then the more the people kind of engage with the books or the data set, the more scarier it becomes for them. Like, you know, then questions pop up normally, like, hey, how can a two man army, two design, or like a designer and a geographer can. How can they do that? I mean, this is, you know, then all this data privacy issues and so on.",
      "id": "ep_53_ut_91"
    },
    {
      "end": 1547326,
      "speaker": "Moritz Stefaner",
      "start": 1543598,
      "text": "You look into all the backyards, basically. Right. That's what you do. And so.",
      "id": "ep_53_ut_92"
    },
    {
      "end": 1554010,
      "speaker": "Benedikt Groß",
      "start": 1547438,
      "text": "Yeah, yeah, yeah, it's quite. I mean, the reactions were quite good.",
      "id": "ep_53_ut_93"
    },
    {
      "end": 1579200,
      "speaker": "Moritz Stefaner",
      "start": 1555020,
      "text": "Yeah, you had a lot of press. And I think it's so funny. And, I mean, it's so. One question I also get a lot for the selfie city project was, that's all very impressive, but why do you spend so much time on such a stupid topic? Like, how can you motivate yourself, you know, to spend so much time on such a topic? Do you get that too? And how do you usually answer that?",
      "id": "ep_53_ut_94"
    },
    {
      "end": 1622632,
      "speaker": "Benedikt Groß",
      "start": 1580350,
      "text": "Yeah, I mean, yes, we get that question, but I mean, I'm actually more surprised by that. People can find different kind of use cases in it. So, like, we got, of course, then a lot of press and then. And then whatever people from the. From the pool industry approached us. Yeah. Okay. I mean, this is kind of obvious, but. But then again, like, people. For instance, the laden county chief data officers approached us and asked us, hey, can we have the data set for fire brigades? Which is also, like an obvious one. But then, like, other people approached us.",
      "id": "ep_53_ut_95"
    },
    {
      "end": 1624072,
      "speaker": "Moritz Stefaner",
      "start": 1622656,
      "text": "Hey, but that's good thinking already.",
      "id": "ep_53_ut_96"
    },
    {
      "end": 1625672,
      "speaker": "Benedikt Groß",
      "start": 1624136,
      "text": "It's like, yeah, I mean, I was.",
      "id": "ep_53_ut_97"
    },
    {
      "end": 1627712,
      "speaker": "Moritz Stefaner",
      "start": 1625696,
      "text": "Quite like, hey, that's water. That's good.",
      "id": "ep_53_ut_98"
    },
    {
      "end": 1652740,
      "speaker": "Benedikt Groß",
      "start": 1627816,
      "text": "You know, but I mean, I was quite intrigued that it's kind of an. It's framed more or less as an art project and it's more like a gallery piece. But then. And still people kind of. I mean, they find it funny and creepy, but then often they still find a use case in it for them, kind of. They kind of manage to do a transfer for that project into their realm, which is. Which I find quite amazing.",
      "id": "ep_53_ut_99"
    },
    {
      "end": 1681654,
      "speaker": "Moritz Stefaner",
      "start": 1652860,
      "text": "Yeah, that's interesting. It's like you have this big network of mess of interconnected things and you just pull it out at one end. But all the other things you drag along, like the social questions, the data questions, as you say, the labor and social inequality and injustice questions. You know, like you can pick any topic and all these big questions are suddenly attached to it. And it doesn't matter that you start with such. Such a seemingly mundane topic. Right?",
      "id": "ep_53_ut_100"
    },
    {
      "end": 1693420,
      "speaker": "Benedikt Groß",
      "start": 1681742,
      "text": "Yeah, such a silly question. Yeah, I mean, I think it provides quite a lot of touch points and also raises a few questions, but of course, it doesn't answer really questions. Not really.",
      "id": "ep_53_ut_101"
    },
    {
      "end": 1696776,
      "speaker": "Moritz Stefaner",
      "start": 1693590,
      "text": "Yeah, there's one question, like, how many pools are there in.",
      "id": "ep_53_ut_102"
    },
    {
      "end": 1697976,
      "speaker": "Benedikt Groß",
      "start": 1696968,
      "text": "Okay, take.",
      "id": "ep_53_ut_103"
    },
    {
      "end": 1700376,
      "speaker": "Moritz Stefaner",
      "start": 1698128,
      "text": "Finally answered that one.",
      "id": "ep_53_ut_104"
    },
    {
      "end": 1702860,
      "speaker": "Benedikt Groß",
      "start": 1700408,
      "text": "Yeah, that one for sure.",
      "id": "ep_53_ut_105"
    },
    {
      "end": 1710944,
      "speaker": "Moritz Stefaner",
      "start": 1704360,
      "text": "In case anybody was wondering. Except you and you now also. Yeah, but you have a Enrico.",
      "id": "ep_53_ut_106"
    },
    {
      "end": 1718080,
      "speaker": "Enrico Bertini",
      "start": 1711072,
      "text": "No, I was just saying that I think it's important to have this kind of projects. Not everything necessarily has to start with a purpose.",
      "id": "ep_53_ut_107"
    },
    {
      "end": 1718416,
      "speaker": "Moritz Stefaner",
      "start": 1718120,
      "text": "Right.",
      "id": "ep_53_ut_108"
    },
    {
      "end": 1721540,
      "speaker": "Enrico Bertini",
      "start": 1718488,
      "text": "With a strong purpose. I think curiosity is a big driver.",
      "id": "ep_53_ut_109"
    },
    {
      "end": 1724842,
      "speaker": "Moritz Stefaner",
      "start": 1722050,
      "text": "Yeah, that's ideal. I absolutely agree.",
      "id": "ep_53_ut_110"
    },
    {
      "end": 1725458,
      "speaker": "Enrico Bertini",
      "start": 1724906,
      "text": "It's ideal.",
      "id": "ep_53_ut_111"
    },
    {
      "end": 1726110,
      "speaker": "Moritz Stefaner",
      "start": 1725514,
      "text": "Yeah.",
      "id": "ep_53_ut_112"
    },
    {
      "end": 1748188,
      "speaker": "Enrico Bertini",
      "start": 1728530,
      "text": "Data stories is supported by Tableau software, helping people see and understand their data. Tableau lets people connect to any kind of data and visualize it on the fly. Databases, spreadsheets and even big data sources are easily combined into interactive visualizations, reports and dashboards. Hey Moritz.",
      "id": "ep_53_ut_113"
    },
    {
      "end": 1748964,
      "speaker": "Moritz Stefaner",
      "start": 1748284,
      "text": "Hey.",
      "id": "ep_53_ut_114"
    },
    {
      "end": 1751684,
      "speaker": "Enrico Bertini",
      "start": 1749132,
      "text": "So did you give a look to Tableau nine?",
      "id": "ep_53_ut_115"
    },
    {
      "end": 1816076,
      "speaker": "Moritz Stefaner",
      "start": 1751852,
      "text": "Yeah, yeah. So the new version is out and they added a few really nice features. Data import got a bit better and the whole startup experience is much nicer. They added in contextual menus for quickly doing aggregations and analytics. So if you want to add a trend line or an average or some percentiles in your data, you can now do that on the fly. Maps got better so you have more zoom levels. It's, you know, it's a really nice haulover for the whole. Already working quite well and so I can definitely recommend to try it out. And for your free trial you can visit Tableau software at Tableau. And now back to the show. And now you have another satellite imagery project, so we can briefly talk about that. That's a fun one. It's not strictly data visualization. I like the perspective. So it's called.",
      "id": "ep_53_ut_116"
    },
    {
      "end": 1817508,
      "speaker": "Enrico Bertini",
      "start": 1816148,
      "text": "It depends how you define it, right?",
      "id": "ep_53_ut_117"
    },
    {
      "end": 1830950,
      "speaker": "Moritz Stefaner",
      "start": 1817564,
      "text": "Yeah, that's true. And we could, you could think about a mod towards like charts. So it's called Arial Bolden and it's about finding letters from space, more or less, right?",
      "id": "ep_53_ut_118"
    },
    {
      "end": 1969510,
      "speaker": "Benedikt Groß",
      "start": 1830990,
      "text": "Basically, yeah. I think then Joey. Yeah, again, it's a collaboration with Joey Lee. I think while we were doing the big atlas of LA pools, we spend a lot of time in front of our computer staring on satellite imagery. And at some point we maybe. We probably developed an obsession with satellite imagery, not sure whether it's a healthy or an unhealthy one. But basically at some point we realized that a lot of stuff in the satellite imagery is also. Maybe you could also say that this is maybe a letter or something else, so that it is kind of a. So that has sometimes a great ambiguity between it's a building, but also it looks like an a or there's an island, a tropical island, but it looks also like a heart. We thought, this is interesting and maybe we should do a project around that, basically. Again, kind of a silly question this time. Not really how many swimming pools, but more like, hey, can you find with some kind of computer magic and with a clever way, all features in satellite imagery shaped like a letter form. And then we decided to do a kickstart on it, mainly to share the process and kind of to engage already from the beginning with an audience, because the big Atlas and Felipe project doesn't communicate well, I think the process behind it. So I think the project works quite nice. If I do a presentation before, or if we do a presentation, but not really, I mean, not so good in a way, if it's just in the gallery and you kind of stumble across the books and kind of. The Ariel bowl project is an attempt to showcase that process and kind of to share that process with the people. So, I mean, we raised the money and it actually took us quite a while to create. To create a Kickstarter video for it, because the project is kind of unpitchable.",
      "id": "ep_53_ut_119"
    },
    {
      "end": 1978270,
      "speaker": "Moritz Stefaner",
      "start": 1970810,
      "text": "It's a bit hard to explain in the beginning. Definitely imagine making this typeface made for buildings. It's like.",
      "id": "ep_53_ut_120"
    },
    {
      "end": 2092466,
      "speaker": "Benedikt Groß",
      "start": 1981450,
      "text": "Yeah, and then currently we are just working on it, and a lot of it is really like to engage with, with other people. So, for instance, the sourcing of all the training data is done with a crowdsourcing tool, where we ask our backers or other Internet folks or friends to help us. It's a gamification thing, so you have a nice interface for it, and then you can start to find those letters, and then there's a high school list, and then you get credits for it, and I mean, all the details, like how can you define the study areas? Because, I mean, the world is quite big and you don't want to send people to the Sahara desert, which, where obviously no letters are around. So it took us quite a while to find a methodology which is based on population density and so on and so on. Or it's quite hard as well to write that classifier because you need training data, but then you need also a classifier which then crunches all that satellite imagery and detects all the letter forms. And so we are collaborating on that end with Hochschule in Regensburg, Weingarten. And Ankita is like doing her master thesis on that classifier. In a way, I think it's really like the project engaged with a lot of people and with a lot of different domains. And again, we are really hoping to kind of showcase and then maybe document. Then once we have the classifier and the dataset, that process in a much.",
      "id": "ep_53_ut_121"
    },
    {
      "end": 2098698,
      "speaker": "Moritz Stefaner",
      "start": 2092498,
      "text": "Better way, and will it become a typing tool? So can you do like a typeface for that?",
      "id": "ep_53_ut_122"
    },
    {
      "end": 2151252,
      "speaker": "Benedikt Groß",
      "start": 2098754,
      "text": "Basically, I mean, yes, I mean, one end result could be definitely a typeface, but I think for me, the end result is really like this large scale data set and we are also aiming to open source it afterwards and hopefully people have then. I mean, it's really beautiful. I mean, we already did a catalog, like internally for us kind of to create a bit the training data and it's. I mean, there are really a lot of beautiful moments where you have like whatever, a stadium with a running track suddenly looking like a Q or P and so on. It's quite intriguing, actually. And a lot of people are like, we have been approached by a big publisher in the States asking us to do kind of a kid ABC book on an id. So that's probably a project.",
      "id": "ep_53_ut_123"
    },
    {
      "end": 2152280,
      "speaker": "Moritz Stefaner",
      "start": 2151316,
      "text": "Nice idea.",
      "id": "ep_53_ut_124"
    },
    {
      "end": 2162008,
      "speaker": "Benedikt Groß",
      "start": 2153740,
      "text": "I think there are quite a few. Quite a few outcomes. I mean, it's quite open at the moment, but, yeah, once we have first.",
      "id": "ep_53_ut_125"
    },
    {
      "end": 2168368,
      "speaker": "Moritz Stefaner",
      "start": 2162064,
      "text": "You collect the data and, you know, just immerse yourself in this thing and then you see what to do with it. Right.",
      "id": "ep_53_ut_126"
    },
    {
      "end": 2221880,
      "speaker": "Benedikt Groß",
      "start": 2168504,
      "text": "Yeah, I mean, in a way, I think it's. The difference in a way is maybe that we. That we create our own data set and then kind of visualize it, I think. I mean, it's now all the common, but I think still a lot of people from the field are kind of more the people who kind of find a dataset and find it interesting and then they visualize it, which is perfectly fine, nothing against that. And. Super. And I think we were just kind of interested in how can you create a unique or really interesting data set on your own, and also as a non machine learning person, for instance, how can you do that in a collaborative way with crowdsourcing or with collaborations?",
      "id": "ep_53_ut_127"
    },
    {
      "end": 2235020,
      "speaker": "Moritz Stefaner",
      "start": 2222000,
      "text": "Yeah, I mean, that's the full safari. It's like the full expedition. Instead of getting the ship banana from South America, you go to South America, harvest the banana, fly back home, then eat it.",
      "id": "ep_53_ut_128"
    },
    {
      "end": 2248930,
      "speaker": "Benedikt Groß",
      "start": 2235680,
      "text": "In a way, maybe it's more like. It's maybe not so much like data visualization in a sense of kind of making something readable or better understandable. It's maybe more like wildlife photography, maybe.",
      "id": "ep_53_ut_129"
    },
    {
      "end": 2252638,
      "speaker": "Moritz Stefaner",
      "start": 2251350,
      "text": "Wildlife data.",
      "id": "ep_53_ut_130"
    },
    {
      "end": 2253410,
      "speaker": "Benedikt Groß",
      "start": 2252734,
      "text": "Yeah.",
      "id": "ep_53_ut_131"
    },
    {
      "end": 2258158,
      "speaker": "Enrico Bertini",
      "start": 2253950,
      "text": "So, Benedikt, what is the hardest letter to find?",
      "id": "ep_53_ut_132"
    },
    {
      "end": 2259406,
      "speaker": "Benedikt Groß",
      "start": 2258294,
      "text": "The hardest letter.",
      "id": "ep_53_ut_133"
    },
    {
      "end": 2260830,
      "speaker": "Enrico Bertini",
      "start": 2259478,
      "text": "The hardest letters.",
      "id": "ep_53_ut_134"
    },
    {
      "end": 2262110,
      "speaker": "Benedikt Groß",
      "start": 2260910,
      "text": "Yeah, actually there is.",
      "id": "ep_53_ut_135"
    },
    {
      "end": 2263782,
      "speaker": "Enrico Bertini",
      "start": 2262190,
      "text": "I'm sure they are not equally distributed.",
      "id": "ep_53_ut_136"
    },
    {
      "end": 2264430,
      "speaker": "Benedikt Groß",
      "start": 2263806,
      "text": "Yeah, yeah. So.",
      "id": "ep_53_ut_137"
    },
    {
      "end": 2271026,
      "speaker": "Enrico Bertini",
      "start": 2264470,
      "text": "But you said. Oh, is. Is easy to find. I is probably straightforward.",
      "id": "ep_53_ut_138"
    },
    {
      "end": 2295176,
      "speaker": "Benedikt Groß",
      "start": 2271098,
      "text": "So there is a website, letterhunt, Ariel dashbold.com, and of course we have a distribution chart. So it's. I mean, the heart, of course, is quite hard to find, but the small set and uppercase end. And the most common one.",
      "id": "ep_53_ut_139"
    },
    {
      "end": 2296440,
      "speaker": "Enrico Bertini",
      "start": 2295208,
      "text": "Uppercase n. Yeah.",
      "id": "ep_53_ut_140"
    },
    {
      "end": 2319340,
      "speaker": "Benedikt Groß",
      "start": 2296520,
      "text": "The most common one is l. L. The difference is huge. So, for instance, we have, at the moment we have 902 ls, like uppercase l, and we have just 29 small sets, for instance. So it's really a long tail distribution.",
      "id": "ep_53_ut_141"
    },
    {
      "end": 2329230,
      "speaker": "Moritz Stefaner",
      "start": 2319970,
      "text": "And it's a totally different one than the one in language. Right. So it's not the ease and the r's and so on, but it's just more geometry based, obviously. Very interesting.",
      "id": "ep_53_ut_142"
    },
    {
      "end": 2332290,
      "speaker": "Enrico Bertini",
      "start": 2329770,
      "text": "So you're doing both uppercase and lowercase?",
      "id": "ep_53_ut_143"
    },
    {
      "end": 2341882,
      "speaker": "Benedikt Groß",
      "start": 2332410,
      "text": "Yeah, uppercase, lowercase and a few, like, I mean, the most symbols. The most. Yeah, like whatever. Like question mark, explanation mark.",
      "id": "ep_53_ut_144"
    },
    {
      "end": 2344030,
      "speaker": "Moritz Stefaner",
      "start": 2341946,
      "text": "And do you do emoji as well?",
      "id": "ep_53_ut_145"
    },
    {
      "end": 2349110,
      "speaker": "Benedikt Groß",
      "start": 2345410,
      "text": "Nothing. Nothing. Nothing besides the heart.",
      "id": "ep_53_ut_146"
    },
    {
      "end": 2353450,
      "speaker": "Moritz Stefaner",
      "start": 2351430,
      "text": "That's good. That's a good motto.",
      "id": "ep_53_ut_147"
    },
    {
      "end": 2370766,
      "speaker": "Enrico Bertini",
      "start": 2356270,
      "text": "So, Benedikt, I wanted to. I want to. Sure. I understand exactly what you did. So you've been first creating a training set manually by crowdsourcing the data, is that correct?",
      "id": "ep_53_ut_148"
    },
    {
      "end": 2371046,
      "speaker": "Benedikt Groß",
      "start": 2370838,
      "text": "Yes.",
      "id": "ep_53_ut_149"
    },
    {
      "end": 2374262,
      "speaker": "Enrico Bertini",
      "start": 2371078,
      "text": "And then you've been building a classifier using this training data?",
      "id": "ep_53_ut_150"
    },
    {
      "end": 2376326,
      "speaker": "Benedikt Groß",
      "start": 2374326,
      "text": "Yes, exactly. So. And.",
      "id": "ep_53_ut_151"
    },
    {
      "end": 2385630,
      "speaker": "Enrico Bertini",
      "start": 2376398,
      "text": "But you also build a small app for. To outsource, to use Amazon mechanical Turk to find the initial training set.",
      "id": "ep_53_ut_152"
    },
    {
      "end": 2459360,
      "speaker": "Benedikt Groß",
      "start": 2385930,
      "text": "I mean, so everything at the moment at Ariel Bold is really based on people who are contributing on a volunteer basis. So it's not Amazon mechanical Turk, it's really like Amazon Mechanical Turk, Washington for the big Atlas affiliate pools. But basically we did a campaign. So we did just like the Kickstarter campaign and then we did another campaign, Letter Hunt was the name, also with some support, some nice press, and then people picked it really up and really got. I think it's also a bit addictive. I think it makes you a bit addictive. Yeah, it's kind of addictive, the task, you know, you kind of scroll around in, in satellite imagery. And I think it's just like super great for procrastination at work. And I think. And that in addition with a high score table, just seems to do the trick. And we got really a lot of contributions. I think we have at the moment, like over 10,000 found letters. And it's not so easy, actually to find those kind of letters in satellite imagery.",
      "id": "ep_53_ut_153"
    },
    {
      "end": 2465560,
      "speaker": "Moritz Stefaner",
      "start": 2460060,
      "text": "And is there a tool is still a bookmarklet or like, how could you contribute in an easy way?",
      "id": "ep_53_ut_154"
    },
    {
      "end": 2528330,
      "speaker": "Benedikt Groß",
      "start": 2466540,
      "text": "Just go to that website, letterhunt dot Ariel dashboard.com, and then you can just go letter hunting and you just open up. I'd open up this micro task app or you have a study area, like a random pick study area based on our population density research. And then you have tools to kind of mark those letter forms and. Yeah, and then you can. Yeah, and then you basically kind of create then a bounding box, and you rotate it, and you adjust the size and. Yeah, and then you tag basically that. That location. And then we have quite a sophisticated or complicated workflow, which kind of derives, then kind of normalizes then this data. And then we are using that data for the classifier.",
      "id": "ep_53_ut_155"
    },
    {
      "end": 2545184,
      "speaker": "Moritz Stefaner",
      "start": 2528450,
      "text": "Nice. Now I want a tool where I can drop in a couple of numbers, and it will find me a chart. Here's a bar chart for these five numbers you just pasted in the. And it's in the middle of the United States.",
      "id": "ep_53_ut_156"
    },
    {
      "end": 2576666,
      "speaker": "Benedikt Groß",
      "start": 2545352,
      "text": "I mean, that's the cool thing, actually. With these data points, we know whether it's an l or a set, but we also know because we want to cross enhance it with open street map. We probably will also know whether it's a building, whether it's a lake, whether it's a forest, and also the country, the city, the address, and so on. We are just hoping that this creates then kind of also an interesting dataset for projects or for others.",
      "id": "ep_53_ut_157"
    },
    {
      "end": 2586470,
      "speaker": "Moritz Stefaner",
      "start": 2576858,
      "text": "I can see a lot of remixes and collages just taking the SS and the EMS or something and create new stuff with it. And I can totally see that.",
      "id": "ep_53_ut_158"
    },
    {
      "end": 2601520,
      "speaker": "Benedikt Groß",
      "start": 2586850,
      "text": "Nice. And again, it's kind of creepy as well. You don't have to be the NSA to be able to do that. Yeah, it's interesting and creepy, in my opinion.",
      "id": "ep_53_ut_159"
    },
    {
      "end": 2608364,
      "speaker": "Moritz Stefaner",
      "start": 2602340,
      "text": "I mean, the NSA could do the full unicode letter set, probably, but, yeah.",
      "id": "ep_53_ut_160"
    },
    {
      "end": 2610440,
      "speaker": "Benedikt Groß",
      "start": 2608532,
      "text": "They could do probably a lot more.",
      "id": "ep_53_ut_161"
    },
    {
      "end": 2643510,
      "speaker": "Moritz Stefaner",
      "start": 2614260,
      "text": "And then there's a last project we could discuss. It's called population I o. And we'll be debating a bit, like, how much do we talk about it? Because it's really cool. But then you also still, like, in the last stages of actually finishing it up. But I think we can talk about it as long as people don't all go to it. Don't go to it now. Give it a day or two, depending on when you listen, of course. So what is it about?",
      "id": "ep_53_ut_162"
    },
    {
      "end": 2820280,
      "speaker": "Benedikt Groß",
      "start": 2644130,
      "text": "I think, in a way, it's more like a classical database project. So a year ago, so Wolfgang Fengler from World bank and Casey Samir from Iasiz in Vienna approached me and were saying, we have this really nice asset. So we have a global dataset for population and also with predictions and with the history and so on, and also quite a sophisticated math to interpolate missing paths for every country and everything. Then we did several workshops and then decided okay. We want to have basically two leads. One is we want to showcase the data set and make it accessible to a wider audience so that people can engage with it. And the other thing is that we want to make it accessible for other institutions or for other data science persons or whoever is interested in population data. And then we build an API for it. It's quite nice. I think it's probably the first time that you have this kind of detailed dataset so nicely accessible with a lot of endpoints, right? Yeah, and, yeah, and then we did the website population IO and got quite a lot of nice responses, TED talk on it as well, and quite a few things. Yeah. And basically the website is just like, you can enter your country, your date of birth and your gender and so on. And then we get several pages of several kind of data visualizations which try to make that topic and why it's interesting and why we are living in such an interesting time in regards of off population data, just kind of to make that tangible and hopefully bring the point across. I mean, it's really intriguing because at the moment I think we are really living in a unique time of human history because all those big shifts in population, they are happening in a relatively short period of time, which is now between 1900, that between 1950 and 2050, the population will grow from two and a half million to 9.5 billion. So, like in our life, like all those big challenges will be.",
      "id": "ep_53_ut_163"
    },
    {
      "end": 2822108,
      "speaker": "Enrico Bertini",
      "start": 2821820,
      "text": "Yeah.",
      "id": "ep_53_ut_164"
    },
    {
      "end": 2869228,
      "speaker": "Moritz Stefaner",
      "start": 2822124,
      "text": "And you have all these different speeds also of development, like decreasing population, older populations in the traditional first world and all the other countries catching up and so. Absolutely, yeah. And I think it's interesting because you centered the project around the user themselves. So the central question is, what's my place in the world population and how long will I live? So you start, of course, with the individual and then sort of tie all the statistics you present to you as a user, which is, I think, a very nice way of approaching this topic. And many others would go like, yeah, here's the big picture. These are the big trends. This one works actually the other way around, like expanding from a single person to the bigger context.",
      "id": "ep_53_ut_165"
    },
    {
      "end": 2871228,
      "speaker": "Benedikt Groß",
      "start": 2869364,
      "text": "Maybe that's the next phase then.",
      "id": "ep_53_ut_166"
    },
    {
      "end": 2872160,
      "speaker": "Moritz Stefaner",
      "start": 2871404,
      "text": "Yeah.",
      "id": "ep_53_ut_167"
    },
    {
      "end": 2884880,
      "speaker": "Enrico Bertini",
      "start": 2874260,
      "text": "So it looks I'm older than 64% of the world's population and older than 41% of all people in Italy.",
      "id": "ep_53_ut_168"
    },
    {
      "end": 2911558,
      "speaker": "Benedikt Groß",
      "start": 2885300,
      "text": "That's actually quite interesting because it means quite a lot. Even as a, as somebody who is quite young in a country in Europe, you are already at the old half in regards of the world population. So for instance, for me, coming from Germany. Yeah, it's pretty scary for me, coming from Germany. I'm young by German standards, but quite old by the world population.",
      "id": "ep_53_ut_169"
    },
    {
      "end": 2915078,
      "speaker": "Enrico Bertini",
      "start": 2911734,
      "text": "Yeah, that's very interesting, the gap between the two.",
      "id": "ep_53_ut_170"
    },
    {
      "end": 2916810,
      "speaker": "Benedikt Groß",
      "start": 2915134,
      "text": "Yeah, it's super interesting.",
      "id": "ep_53_ut_171"
    },
    {
      "end": 2922454,
      "speaker": "Enrico Bertini",
      "start": 2917710,
      "text": "Yeah. I think we all belong to these aging, terribly aging countries.",
      "id": "ep_53_ut_172"
    },
    {
      "end": 2926010,
      "speaker": "Moritz Stefaner",
      "start": 2922542,
      "text": "Yeah, that's what we do.",
      "id": "ep_53_ut_173"
    },
    {
      "end": 2931330,
      "speaker": "Enrico Bertini",
      "start": 2927070,
      "text": "And the opposite trend is actually happening in other countries. So that's very interesting.",
      "id": "ep_53_ut_174"
    },
    {
      "end": 2966450,
      "speaker": "Moritz Stefaner",
      "start": 2931750,
      "text": "That's a, population and demographics is a really fascinating topic. There has also been a great article on quartz by David Bauer, I don't know if you had seen that. And it looks about a country breakdown of demographics and then also gender differences. And there's so many individual stories, or you can tie a lot of so many events and stories in general, big trends on these demographic data. So it sounds a bit boring in the beginning, but again, the more you dig in, the more you see of our, the whole world development depends, you know, it's sort of tied to that.",
      "id": "ep_53_ut_175"
    },
    {
      "end": 2968110,
      "speaker": "Benedikt Groß",
      "start": 2966490,
      "text": "Yeah, yeah, absolutely.",
      "id": "ep_53_ut_176"
    },
    {
      "end": 2976610,
      "speaker": "Moritz Stefaner",
      "start": 2968430,
      "text": "Also nice feature. You can download an ical event with your date of death. So just in case you want to be reminded maybe like a week before.",
      "id": "ep_53_ut_177"
    },
    {
      "end": 2979930,
      "speaker": "Enrico Bertini",
      "start": 2978390,
      "text": "Don't waste your life.",
      "id": "ep_53_ut_178"
    },
    {
      "end": 2983370,
      "speaker": "Moritz Stefaner",
      "start": 2980630,
      "text": "Remind me five minutes before or something.",
      "id": "ep_53_ut_179"
    },
    {
      "end": 3007776,
      "speaker": "Benedikt Groß",
      "start": 2986030,
      "text": "So that's a good feature. I mean, it's kind of, I mean, we had quite a lot of discussions actually, you know, whether we should approach it with this kind of cynical or kind of with humor, basically, and whether all people will get it. But so far, actually, the reactions were quite good. No, people didn't freak out or didn't kind of sue us.",
      "id": "ep_53_ut_180"
    },
    {
      "end": 3009300,
      "speaker": "Enrico Bertini",
      "start": 3007888,
      "text": "Oh, yeah. Not at all.",
      "id": "ep_53_ut_181"
    },
    {
      "end": 3013180,
      "speaker": "Moritz Stefaner",
      "start": 3010040,
      "text": "Look at that. Five days later and I'm still alive.",
      "id": "ep_53_ut_182"
    },
    {
      "end": 3021260,
      "speaker": "Benedikt Groß",
      "start": 3016840,
      "text": "I spent all my money, now I'm ruined.",
      "id": "ep_53_ut_183"
    },
    {
      "end": 3048900,
      "speaker": "Enrico Bertini",
      "start": 3022160,
      "text": "It's interesting because you have this piece. Maybe you can tell us more about it. So that's very interesting. You have, what are the big milestones to expect in your life, which I really like, and then you say your next. So, for instance, for my data, your next milestone is the 2 December 2017. Then you'll be the fifth billion person to be alive in the world. That's really interesting. How do you calculate that?",
      "id": "ep_53_ut_184"
    },
    {
      "end": 3115774,
      "speaker": "Benedikt Groß",
      "start": 3050840,
      "text": "That's a good question, and I think I'm actually the wrong one to answer that. It's. Yeah, I mean, I can't tell you the math behind it. I would have to reach out to Samia, but maybe I can, I mean, maybe I can explain why we find that interesting. I mean, the idea basically is that maybe that maybe is also interesting to, to have kind of a relative birthday. And a relative birthday would be then kind of your position within the world population. And we thought this could be kind of a nice, I mean, not so much like the number in a way, kind of the hard number. I mean, yeah, fifth billion person. It's kind of nice. But I find the idea intriguing that we are all kind of just a long queue of people on the world, basically, and that, you know, people are kind of coming in and the end, people are dying, but. But then kind of. Where are you in that kind of long queue of people? Yeah.",
      "id": "ep_53_ut_185"
    },
    {
      "end": 3123990,
      "speaker": "Enrico Bertini",
      "start": 3115942,
      "text": "And, yeah, that's very interesting. You have these charts with the age distribution and you can really see whether you are tipping off or not.",
      "id": "ep_53_ut_186"
    },
    {
      "end": 3124670,
      "speaker": "Moritz Stefaner",
      "start": 3124070,
      "text": "Right.",
      "id": "ep_53_ut_187"
    },
    {
      "end": 3126158,
      "speaker": "Enrico Bertini",
      "start": 3124830,
      "text": "That's really, really interesting.",
      "id": "ep_53_ut_188"
    },
    {
      "end": 3129806,
      "speaker": "Moritz Stefaner",
      "start": 3126254,
      "text": "I'm in Germany and I'm sort of in this bump. So there's two peaks next to me.",
      "id": "ep_53_ut_189"
    },
    {
      "end": 3130246,
      "speaker": "Enrico Bertini",
      "start": 3129878,
      "text": "Yeah.",
      "id": "ep_53_ut_190"
    },
    {
      "end": 3138590,
      "speaker": "Moritz Stefaner",
      "start": 3130318,
      "text": "And now I start to wonder like, yeah, baby boomers, but what's the right one, you know? So you start to think about where that comes from.",
      "id": "ep_53_ut_191"
    },
    {
      "end": 3196416,
      "speaker": "Benedikt Groß",
      "start": 3140130,
      "text": "I mean, we have a lot of ideas to push that further, but I mean, as I already mentioned, we have a lot of problems, like technical wise, to really scale that up and to find the right people. I mean, the project is based on a lot of volunteer work of a lot of contributors, and it's really hard to find a people who, you know, who can kind of speak than the other domain language. So you know that whatever, somebody who is really good with math, but then also who is kind of open with the design side of things and then who can also write then production code, which scales well and so on. It's kind of that. It's more, in a way, it's kind of a shame, but I would say it's a logistics project. It's not so much like actually kind of a design project. I feel often more like as a logistics expert after a while.",
      "id": "ep_53_ut_192"
    },
    {
      "end": 3238340,
      "speaker": "Moritz Stefaner",
      "start": 3196528,
      "text": "Yeah, yeah. I mean, that's the thing. So you decided to take this huge data set and make it personal and sort of have everybody have their own perspective on it, but then you have to calculate all these perspectives. Yeah. And sometimes it's straightforward or sometimes just a simple filtering or average over a couple of things, but the way you do it, it's like, it's a whole statistics atlas for every person, you know. Then you have to. Yeah, as you say, you have to think about how to, how to scale that from a prototype to something that can withstand a Bill Gates tweet. Exactly as you had recently.",
      "id": "ep_53_ut_193"
    },
    {
      "end": 3270454,
      "speaker": "Benedikt Groß",
      "start": 3238960,
      "text": "Yeah, I mean, we had that like, like last week, and it just toasted our service. I mean, it was just. Yeah, it was. I said it already. It was like a denial of service attack. I mean it was just crazy. But we are working on that and I think I'm quite optimistic that we will have that soft soon. We already have like a working back end which is a lot better. And it's open source, so everything is open source. It's on GitHub. I guess other people might find that useful.",
      "id": "ep_53_ut_194"
    },
    {
      "end": 3275010,
      "speaker": "Moritz Stefaner",
      "start": 3270502,
      "text": "So if you run a different planet than Earth, you can just, you know, fork it.",
      "id": "ep_53_ut_195"
    },
    {
      "end": 3283130,
      "speaker": "Enrico Bertini",
      "start": 3280550,
      "text": "How does the original data look like?",
      "id": "ep_53_ut_196"
    },
    {
      "end": 3311340,
      "speaker": "Benedikt Groß",
      "start": 3283630,
      "text": "It's, it's a combination of data from the World bank and also from, from a UN survey and, and then Samia enhanced it with, I think with some kind of, of local data from country or from country reports and then came up with a nice methodology of how can you interpolate and how can you kind of stitch all that data together so that it makes sense, and then he kind of validated it and so on.",
      "id": "ep_53_ut_197"
    },
    {
      "end": 3316072,
      "speaker": "Enrico Bertini",
      "start": 3312480,
      "text": "So do you have this part available on GitHub as well?",
      "id": "ep_53_ut_198"
    },
    {
      "end": 3338036,
      "speaker": "Benedikt Groß",
      "start": 3316176,
      "text": "I think most of it should be available on GitHub as well, or at least the links, I guess on GitHub is probably more like the derived data sources we are using, but I think it has API or about or developer and there are all the links of where you find the source datasets.",
      "id": "ep_53_ut_199"
    },
    {
      "end": 3351412,
      "speaker": "Moritz Stefaner",
      "start": 3338148,
      "text": "Yeah, and there's the API looks really nice too. So there's a full rest API for world population ranks, life expectancies, population tables, mortality distributions. So that looks good.",
      "id": "ep_53_ut_200"
    },
    {
      "end": 3352480,
      "speaker": "Benedikt Groß",
      "start": 3351556,
      "text": "Yeah, thanks.",
      "id": "ep_53_ut_201"
    },
    {
      "end": 3365970,
      "speaker": "Moritz Stefaner",
      "start": 3353220,
      "text": "Yeah, a good API, I mean that's nice. And there can be a nice outcome of such a complex project too, is that you don't just present the end result in shiny charts, but actually give some infrastructure to do something interesting.",
      "id": "ep_53_ut_202"
    },
    {
      "end": 3385232,
      "speaker": "Benedikt Groß",
      "start": 3367030,
      "text": "We actually are quite keen on that as well. So far I guess nobody, or as far as I know nobody has used the API for an interesting project, but we are really keen to explore that. To what could other people come up with that API?",
      "id": "ep_53_ut_203"
    },
    {
      "end": 3395672,
      "speaker": "Moritz Stefaner",
      "start": 3385416,
      "text": "Cool. Yeah, maybe you need to do some hackathon contests, workshop type thing with a few talented students or something. Yeah, could work.",
      "id": "ep_53_ut_204"
    },
    {
      "end": 3396660,
      "speaker": "Benedikt Groß",
      "start": 3395736,
      "text": "Definitely.",
      "id": "ep_53_ut_205"
    },
    {
      "end": 3449410,
      "speaker": "Moritz Stefaner",
      "start": 3397960,
      "text": "Cool. Good stuff. So much. And we haven't even talked about all the projects we had on our list. So you also experimented with printing, landscape, like a really large scale project where he worked with basically farming, modern farming here. So we'll link to that. It's a good one. It's a good one. And yeah, super interesting. I'm really intrigued. I'm also interested in how our listeners perceive this whole field. I don't think we talked that much about experimental work with data and data art. Give us your feedback on that. And I'm always super intrigued by this, and I always think about, like, what that means for data visualization and how we work with data in general. So it's really cool.",
      "id": "ep_53_ut_206"
    },
    {
      "end": 3464944,
      "speaker": "Enrico Bertini",
      "start": 3449950,
      "text": "Yeah, I really like this mix of image processing and visualization that you have. I think it's a very interesting trend. I think this is true also for selfie city. Moritz. Right. And Lev Manovich does a lot of that.",
      "id": "ep_53_ut_207"
    },
    {
      "end": 3521546,
      "speaker": "Moritz Stefaner",
      "start": 3464992,
      "text": "Yeah. And the general idea of using, I call these, like, mixed mode projects where you use your own methodology to bootstrap something. You know, like you use data visualization or you use machine learning to bootstrap basically a dataset and then visualize it again and then give it to people. And then people do something with it and you visualize the results again. So it's these sort of inquiries into something that use your own methodology right from the start. And, yeah, I really like that. And these projects are sometimes a bit difficult, like what they're actually about. It's like selfie city. I can never explain, is it about Instagram, is it about selfies, is about surveillance, is about pop culture, you know, who knows? It's about everything. You can't separate it anymore. And that makes it, from a science point of view, a bit hard then to generalize the results, but at the same time, you get this super richest picture at the end.",
      "id": "ep_53_ut_208"
    },
    {
      "end": 3550272,
      "speaker": "Benedikt Groß",
      "start": 3521738,
      "text": "And I guess a lot of feedback as well. I mean, for me, the most interesting bit with those projects is often that you can engage with a wider audience also, outside of the usual, in my case, the usual art and design realm, you know, I mean, nothing, nothing wrong with that, but I think it's really, really interesting. Kind of normal or like everyday people kind of encounter those kind of projects.",
      "id": "ep_53_ut_209"
    },
    {
      "end": 3550980,
      "speaker": "Moritz Stefaner",
      "start": 3550336,
      "text": "Yeah.",
      "id": "ep_53_ut_210"
    },
    {
      "end": 3561992,
      "speaker": "Benedikt Groß",
      "start": 3551320,
      "text": "Because the reactions are quite different from people within the field. And I find it quite valuable. And, yeah, I think that's.",
      "id": "ep_53_ut_211"
    },
    {
      "end": 3603710,
      "speaker": "Moritz Stefaner",
      "start": 3562056,
      "text": "And again, like collecting and crafting your own data and doing all the measurements yourself, I think it's so valuable because then you understand suddenly how flaky all the other datasets must be that you have been working with in the past and how much you blindly trusted them. It's a bit like this effect. I don't know there's even a name for it. If you read a newspaper article on a topic you know well, and you realize the journalist totally got it wrong, and then this next second, you think like, oh, it has to be like this with all the articles. That's horrible. That's insane. So it's maybe the same effect with data sets. Enrico, I cut you off.",
      "id": "ep_53_ut_212"
    },
    {
      "end": 3655320,
      "speaker": "Enrico Bertini",
      "start": 3603790,
      "text": "I was just saying it's interesting what you're saying about engaging people on the web. And you said rather than doing the usual art or design thing and actually doing things only for this community. And I have to say that in a way it's very similar to me when we talk about the academic community, which is a community that historically has been probably developing ideas and methods and even software, but just for, for the community itself, for this small community. And I think these things are changing there as well. I think this is a trend that you can see everywhere. The idea that people want to reach out to a much larger set of people or to the population at large. And this is happening in so many different areas. And I think it's a big trend.",
      "id": "ep_53_ut_213"
    },
    {
      "end": 3657564,
      "speaker": "Benedikt Groß",
      "start": 3657020,
      "text": "Yeah.",
      "id": "ep_53_ut_214"
    },
    {
      "end": 3679990,
      "speaker": "Enrico Bertini",
      "start": 3657652,
      "text": "I mean, it might actually sound obvious, but the web is really powerful, right? I mean, it sounds obvious, but I think in practice it's not obvious at all because why don't, so if you're working on something, why not trying to, I don't know, walk the extra mile and make it available so that people can, can see it or use it.",
      "id": "ep_53_ut_215"
    },
    {
      "end": 3682286,
      "speaker": "Moritz Stefaner",
      "start": 3680030,
      "text": "And not just the end results, but also the process.",
      "id": "ep_53_ut_216"
    },
    {
      "end": 3685614,
      "speaker": "Enrico Bertini",
      "start": 3682478,
      "text": "And not just the end result. The process as well. Yes, exactly.",
      "id": "ep_53_ut_217"
    },
    {
      "end": 3704872,
      "speaker": "Moritz Stefaner",
      "start": 3685702,
      "text": "Because often people think like, first they have to sweat it and finish it, then put it out. But that's a whole different area, like how to do these participatory projects and what the constraints are and for what it's good, for what it doesn't work so well, that's super interesting, too.",
      "id": "ep_53_ut_218"
    },
    {
      "end": 3718352,
      "speaker": "Enrico Bertini",
      "start": 3705056,
      "text": "Yeah. But people love to engage and participate to these kind of projects. And I think, Benedikt, you said that there are lots, you were surprised to see how many people are interested and are willing to help.",
      "id": "ep_53_ut_219"
    },
    {
      "end": 3719020,
      "speaker": "Benedikt Groß",
      "start": 3718416,
      "text": "Right.",
      "id": "ep_53_ut_220"
    },
    {
      "end": 3733970,
      "speaker": "Enrico Bertini",
      "start": 3719400,
      "text": "So I think that's a very interesting model. I think the idea that we can engage people not just as passive readers but also as contributors, that's a very, very interesting idea. And I don't see it fully.",
      "id": "ep_53_ut_221"
    },
    {
      "end": 3736038,
      "speaker": "Benedikt Groß",
      "start": 3735750,
      "text": "I.",
      "id": "ep_53_ut_222"
    },
    {
      "end": 3830560,
      "speaker": "Enrico Bertini",
      "start": 3736054,
      "text": "Don't know, developed or, I don't know. I don't see many, many examples like that out there. There is one thing that, there is one project that maybe you guys know that has been very, very successful along these lines that is called fold it. I don't know if you know it. You know, fold it. Moritz. Very interesting. So this is a guy, I think, from the University of Washington, who developed a game on the web on folding proteins and molecules. And actually you're. So it looks like a game. It is a game, but in reality, you are trying to find new, I think, new proteins or new arrangements or something like that. Now, I don't remember the details, but you. What happens is that the outcome is that through crowdsourcing, using this crowdsourcing kind of game, they manage to find new molecular structures. So there is an impact on science, and this is big. So I think there is this whole idea that people like to participate when they see that they have a role in the process. And I think this is true for your project as well, Benedikt, that people like to feel like. My guess is that people participate because maybe there is one letter that you're gonna put in the final database that come from me. Right. It's a nice feeling. It's a very nice feeling. And, yeah, I think there is some untapped opportunities there.",
      "id": "ep_53_ut_223"
    },
    {
      "end": 3832820,
      "speaker": "Benedikt Groß",
      "start": 3831260,
      "text": "Yeah, I agree fully.",
      "id": "ep_53_ut_224"
    },
    {
      "end": 3845080,
      "speaker": "Moritz Stefaner",
      "start": 3832940,
      "text": "Yeah, it'll be exciting to see what comes out of all this. And fingers crossed, Internet is sort of interesting, too. Yeah. Okie doke. Thanks so much, Benedikt. That was super fascinating.",
      "id": "ep_53_ut_225"
    },
    {
      "end": 3846452,
      "speaker": "Benedikt Groß",
      "start": 3845420,
      "text": "Many thanks as well.",
      "id": "ep_53_ut_226"
    },
    {
      "end": 3847180,
      "speaker": "Enrico Bertini",
      "start": 3846516,
      "text": "Thanks, Benedikt.",
      "id": "ep_53_ut_227"
    },
    {
      "end": 3848780,
      "speaker": "Moritz Stefaner",
      "start": 3847220,
      "text": "Thank you. Bye bye.",
      "id": "ep_53_ut_228"
    },
    {
      "end": 3850412,
      "speaker": "Enrico Bertini",
      "start": 3848900,
      "text": "Thank you. Bye. Take care.",
      "id": "ep_53_ut_229"
    },
    {
      "end": 3851440,
      "speaker": "Benedikt Groß",
      "start": 3850476,
      "text": "Bye bye bye.",
      "id": "ep_53_ut_230"
    },
    {
      "end": 3875510,
      "speaker": "Enrico Bertini",
      "start": 3854500,
      "text": "Data stories is supported by Tableau software, helping people see and understand their data. Get answers from interactive dashboards. Wherever you go for your free trial, visit Tableau software@Tableau.com. Datastories this is Tableau.com slash Datastories.",
      "id": "ep_53_ut_231"
    }
  ],
  "confidence": 0.909306499476437,
  "audio_duration": 3876,
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_status_code": null,
  "webhook_auth": false,
  "webhook_auth_header_name": null,
  "speed_boost": false,
  "auto_highlights_result": null,
  "auto_highlights": false,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_audio_quality": null,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "content_safety": false,
  "iab_categories": true,
  "content_safety_labels": {
    "status": "unavailable",
    "results": [],
    "summary": {}
  },
  "language_detection": false,
  "language_detection_threshold": null,
  "language_confidence": null,
  "custom_spelling": null,
  "throttled": false,
  "auto_chapters": true,
  "summarization": false,
  "summary_type": null,
  "summary_model": null,
  "custom_topics": false,
  "topics": [],
  "speech_threshold": null,
  "speech_model": "best",
  "chapters": [
    {
      "summary": "Data stories is supported by Tableau software, helping people see and understand their data. Get answers from interactive dashboards. Wherever you go for a free trial, visit Tableau. Datastories.",
      "gist": "Tableau Software: Data Stories",
      "headline": "Data stories is supported by Tableau software, helping people see and understand their data",
      "start": 520,
      "end": 19650,
      "id": "ep_53_ch_0"
    },
    {
      "summary": "Enrico: Spring is here. I just came back from resonate festival in Belgrade, so I was there for a full week. I did the insect smarts workshop again. Now I have to catch up with projects.",
      "gist": "Enrico at the",
      "headline": "Enrico: Spring is here. Still not going away",
      "start": 29560,
      "end": 119140,
      "id": "ep_53_ch_1"
    },
    {
      "summary": "Benedikt is a research associate at the upcoming movie lab, which deals with the future of mobility maps. His work involves somehow data, computational design, and also often speculative design. It's a nice balance between industry projects and his own projects and a bit of teaching.",
      "gist": "Benedikt Cumberbatch at TED",
      "headline": "We have a special guest today, as usual. And this time it's Benedikt. Hi, Benedikt. How are you doing today",
      "start": 121320,
      "end": 229648,
      "id": "ep_53_ch_2"
    },
    {
      "summary": "The book deals more with the principles of generative design or computational design. It came out of your diploma thesis in Taufge Mund. It took us one and a half years part time, to kind of come to a phase which was then publishable. This will be up to date in ten years still.",
      "gist": "The Future of Computational Design",
      "headline": "The generative design book is quite old now. Quite old now",
      "start": 229744,
      "end": 401160,
      "id": "ep_53_ch_3"
    },
    {
      "summary": "Can you describe generative design in a few words? Just. I think it's basically creating things, often visual things, like images, with code. And as we are data visualization podcasts, there's lots of overlap.",
      "gist": "Can you describe generative design in a few words?",
      "headline": "Can you describe generative design in a few words",
      "start": 401500,
      "end": 595030,
      "id": "ep_53_ch_4"
    },
    {
      "summary": "RCA program is like real hardcore art program. It tries to look into technologies from many ways. One of the projects you did in this context was the atlas of LA Pools. It was quite a long investigation in a seemingly mundane topic.",
      "gist": "Exploring the Future of Design at RCA",
      "headline": "You went to RCA in the design interactions program in 2009",
      "start": 595110,
      "end": 1090190,
      "id": "ep_53_ch_5"
    },
    {
      "summary": "Benedikt: How did you do it technically? Was that a crowdsourcing service or what? The process is really interesting. How can you make this super tangible in so many ways?",
      "gist": "How to find a swimming pool by Google Maps",
      "headline": "Benedikt: How did you do it technically",
      "start": 1090970,
      "end": 1545582,
      "id": "ep_53_ch_6"
    },
    {
      "summary": "Right. That's what you do. And I think it's so funny. I mean, the reactions were quite good. Yeah, you had a lot of press. And so.",
      "gist": "\"It's Funny!\"",
      "headline": "You had a lot of press about the joke, right",
      "start": 1545646,
      "end": 1561716,
      "id": "ep_53_ch_7"
    },
    {
      "summary": "Enrico: Why do you spend so much time on such a stupid topic? People can find different kind of use cases in it. Data stories is supported by Tableau software, helping people see and understand their data. New version is out and they added a few nice features.",
      "gist": "Data visualization in the future with Tableau",
      "headline": "Tableau lets people connect to any kind of data and visualize it on the fly",
      "start": 1561748,
      "end": 1799980,
      "id": "ep_53_ch_8"
    },
    {
      "summary": "Arial Bolden is about finding letters from space, more or less. All features in satellite imagery shaped like a letter form. Project is an attempt to showcase that process and kind of share that process with the people.",
      "gist": "The Arial Bolden Project",
      "headline": "Ariel Bolden is a project about finding letters from satellite imagery",
      "start": 1802420,
      "end": 2253410,
      "id": "ep_53_ch_9"
    },
    {
      "summary": "Benedikt: What is the hardest letter to find? The hardest letter. And the most common one is l. The difference is huge. It's a long tail distribution. And it's a totally different one than the one in language.",
      "gist": "The Hardest Letters to Find",
      "headline": "So, Benedikt, what is the hardest letter to find?",
      "start": 2253950,
      "end": 2353450,
      "id": "ep_53_ch_10"
    },
    {
      "summary": "Letter Hunt uses Amazon Mechanical Turk to find the initial training set. At the moment, over 10,000 found letters. We are hoping this creates an interesting dataset for projects or for others.",
      "gist": "How to train a neural classifier from satellite data",
      "headline": "You've been creating a training set manually by crowdsourcing the data",
      "start": 2356270,
      "end": 2610440,
      "id": "ep_53_ch_11"
    },
    {
      "summary": "There's a last project we could discuss. It's called population I o. We want to showcase the data set and make it accessible to a wider audience. Between 1950 and 2050, the population will grow from two and a half million to 9.5 billion.",
      "gist": "The World's population data",
      "headline": "David Bauer is working on a project to make population data more accessible",
      "start": 2614260,
      "end": 3028336,
      "id": "ep_53_ch_12"
    },
    {
      "summary": "A new tool calculates how many people are alive in the world. The data is based on a combination of data from the World bank and UN survey. It's on GitHub. The project is being scaled up, but there are technical problems to scale it up.",
      "gist": "How to Guess How Many People Are Alive in the World",
      "headline": "You have, what are the big milestones to expect in your life",
      "start": 3028368,
      "end": 3398408,
      "id": "ep_53_ch_13"
    },
    {
      "summary": "Mixed mode projects where you use your own methodology to bootstrap something. The most interesting bit with those projects is often that you can engage with a wider audience. I'm also interested in how our listeners perceive this whole field. Give us your feedback on that.",
      "gist": "Data Art and Visualization",
      "headline": "I really like this mix of image processing and visualization that you have",
      "start": 3398464,
      "end": 3600210,
      "id": "ep_53_ch_14"
    },
    {
      "summary": "Benedikt: The idea that we can engage people not just as passive readers but also as contributors is a very, very interesting idea. People love to engage and participate to these kind of projects. It'll be exciting to see what comes out of all this.",
      "gist": "Crowdsourcing in the sciences",
      "headline": "Benedikt: It's interesting that people like to participate in projects",
      "start": 3601830,
      "end": 3875510,
      "id": "ep_53_ch_15"
    }
  ],
  "disfluencies": false,
  "entity_detection": false,
  "sentiment_analysis": false,
  "sentiment_analysis_results": null,
  "entities": null,
  "speakers_expected": null,
  "summary": null,
  "custom_topics_results": null,
  "is_deleted": null,
  "episode_num": "53",
  "episode_metadata": {
    "speakers": [
      "Moritz Stefaner",
      "Enrico Bertini",
      "Benedikt Groß"
    ],
    "WPid": "298",
    "url": "https://datastori.es/podlove/file/796/s/feed/c/mp3/data-stories-53-data-safari-w-benedikt-gros.mp3",
    "episode_title": "Data Safaris w/ Benedikt Groß"
  }
}