{
  "id": "2feec055-4a84-493c-b2b9-b32b30a242c8",
  "language_model": "assemblyai_default",
  "acoustic_model": "assemblyai_default",
  "language_code": "en_us",
  "status": "completed",
  "audio_url": "https://datastori.es/podlove/file/206/s/feed/c/mp3/Datastories-05.mp3",
  "utterances": [
    {
      "end": 11474,
      "speaker": "Moritz Stefaner",
      "start": 5240,
      "text": "Yeah, let's kick it off. Enrico, you have to do it. You're the only one who can open this podcast. There's no one else. I'm sorry.",
      "id": "ep_5_ut_0"
    },
    {
      "end": 22726,
      "speaker": "Enrico Bertini",
      "start": 14934,
      "text": "Hi, everyone. This is Enrico from data stories number five. And I'm together as usual with Moritz.",
      "id": "ep_5_ut_1"
    },
    {
      "end": 23118,
      "speaker": "Moritz Stefaner",
      "start": 22830,
      "text": "Hello.",
      "id": "ep_5_ut_2"
    },
    {
      "end": 26646,
      "speaker": "Enrico Bertini",
      "start": 23166,
      "text": "And we also have again, Andy Kirk with us.",
      "id": "ep_5_ut_3"
    },
    {
      "end": 28234,
      "speaker": "Andy Kirk",
      "start": 26750,
      "text": "Hello. Good evening.",
      "id": "ep_5_ut_4"
    },
    {
      "end": 29964,
      "speaker": "Enrico Bertini",
      "start": 28864,
      "text": "How are you?",
      "id": "ep_5_ut_5"
    },
    {
      "end": 41004,
      "speaker": "Andy Kirk",
      "start": 30744,
      "text": "I'm good. Just sat here looking at the rain outside, which is, you know, typical of England in April. So we're not as fortunate as some who can sit next to pools in Miami. But we're okay.",
      "id": "ep_5_ut_6"
    },
    {
      "end": 44720,
      "speaker": "Enrico Bertini",
      "start": 42544,
      "text": "I've already trained from time to time there.",
      "id": "ep_5_ut_7"
    },
    {
      "end": 45724,
      "speaker": "Andy Kirk",
      "start": 44832,
      "text": "Exactly.",
      "id": "ep_5_ut_8"
    },
    {
      "end": 47608,
      "speaker": "Moritz Stefaner",
      "start": 46104,
      "text": "Yeah, it's much too hot.",
      "id": "ep_5_ut_9"
    },
    {
      "end": 50524,
      "speaker": "Enrico Bertini",
      "start": 47776,
      "text": "Yeah. Moritz, what happened?",
      "id": "ep_5_ut_10"
    },
    {
      "end": 57218,
      "speaker": "Moritz Stefaner",
      "start": 51784,
      "text": "I'm good. I'm super tired. But who cares? We have a podcast to do.",
      "id": "ep_5_ut_11"
    },
    {
      "end": 58522,
      "speaker": "Andy Kirk",
      "start": 57346,
      "text": "The listeners don't care.",
      "id": "ep_5_ut_12"
    },
    {
      "end": 67014,
      "speaker": "Moritz Stefaner",
      "start": 58618,
      "text": "Yeah, they won't notice when I fall asleep. No, I'm doing good. Exciting times. Exciting times.",
      "id": "ep_5_ut_13"
    },
    {
      "end": 69498,
      "speaker": "Enrico Bertini",
      "start": 67634,
      "text": "It's always exciting times for biz.",
      "id": "ep_5_ut_14"
    },
    {
      "end": 71614,
      "speaker": "Moritz Stefaner",
      "start": 69546,
      "text": "Yeah. But now it's especially exciting times.",
      "id": "ep_5_ut_15"
    },
    {
      "end": 73574,
      "speaker": "Andy Kirk",
      "start": 72474,
      "text": "Super exciting.",
      "id": "ep_5_ut_16"
    },
    {
      "end": 116334,
      "speaker": "Enrico Bertini",
      "start": 74114,
      "text": "So today we are going to talk a hot topic, which is how to learn visualization. Lots of people are curious about that, and that's the main reason why we have Andy again with us, because he has some very nice training courses and he's a real expert on the topic. And, yeah, I think we wanted to start by saying that visualization is notoriously quite hard to learn because it's very multidisciplinary and lots of people really don't know how to approach it. Andy, what's your experience with that?",
      "id": "ep_5_ut_17"
    },
    {
      "end": 234230,
      "speaker": "Andy Kirk",
      "start": 116714,
      "text": "Yeah, I mean, what you say is correct about the multidisciplinary. I mean, the courses I do are introduction courses at the moment, and this is people typically who. I mean, this is the case for everybody these days. Everyone's touched in some way, shape or form by responsibility for data and presentation of data and communication of data. And the people coming to the courses represent the full spectrum of industries and organisation types, but also age groups and even skill sets. So you've got people there who perhaps are analysts already looking to top up their skills, or you might have academics or graphic designers looking to perhaps widen and broaden their portfolio skills. So everybody's kind of interested right now in the, I guess, the potential of visualisation in their own worlds. And it's just something that's really pleasing for me to see all these different types of people emerging on the scene and coming along to the course has got exactly what we were all expecting three, four years ago, when the subject really moved into the mainstream. I think the challenges we'll discuss in a second the challenge of picking up all these diverse skills. And this kind of convergence of all these traditionally diverse skills is something that's a challenge not just for people to pick up, but also when you're trying to conceive and structure and sequence a training course, especially in a single day. I mean, we're talking about maybe five, six contact hours in a day. There's no way a person can leave those 6 hours as an expert. And certainly my objective really is to give people a route into the subjects and give them the equipment through which they can discover the subject beyond the timeframe of a single day, because it's just impossible.",
      "id": "ep_5_ut_18"
    },
    {
      "end": 277282,
      "speaker": "Moritz Stefaner",
      "start": 234342,
      "text": "It's really interesting because I mean, I started my whole digital media thing like 1012 maybe years ago, and there multimedia was the big thing and everybody was learning sound editing, video, three de HTML programming director and everybody was like, oh, it's also new and everybody's just figuring it out and you have to know everything and learn everything at once. And now this whole scene has much more specialized. So yeah, everybody knows much better what type of multimedia is doing. But now the same thing starts in infovis. I have the feeling that everybody's learning everything and combining everything. I'm looking forward to see in ten years how the specializations.",
      "id": "ep_5_ut_19"
    },
    {
      "end": 363924,
      "speaker": "Andy Kirk",
      "start": 277378,
      "text": "That's right. And I think an interesting thing for me is people tend not to just purely be coming to the courses in the capacity of having a design responsibility. A lot of the people have got a role to commission work or to evaluate others work, and what they're trying to do is inform themselves better about how to evaluate and understand how to judge somebody else's work. And also you've got people who exist in teams, so you might have a single lead designer, but then they've got colleagues who are computer scientists or technologists or video editors. People are surrounded by teams of specialists and it's about how they harness the talent into a single cohesive project. It's not always people who are trying to pick up everything for themselves, but certainly have an awareness of what is involved and what is required to do this subject well. So it's such a fascinating field. I mean, you know, as things stand there, I guess there are very few of us doing the training offering at the moment. And that in itself sort of reflects that. This is still an emerging, evolving field, difficult to nail down and it doesn't sit still. So maybe in three to five years there'll be thousands of trainers out there and I'll be looking for a new job but we'll see.",
      "id": "ep_5_ut_20"
    },
    {
      "end": 370244,
      "speaker": "Moritz Stefaner",
      "start": 365024,
      "text": "I don't think so. There will always be something in this field to train.",
      "id": "ep_5_ut_21"
    },
    {
      "end": 397154,
      "speaker": "Enrico Bertini",
      "start": 371864,
      "text": "What I think is really interesting is that there are so many areas that a person should be able to cover. You have to know about computers, humans, data, the design process itself is really, really broad. I'm wondering, Andy, from your experience, the people who attend your courses, what is the area that they have most problems with that they have a hard time to cover?",
      "id": "ep_5_ut_22"
    },
    {
      "end": 397770,
      "speaker": "Andy Kirk",
      "start": 397314,
      "text": "Yeah.",
      "id": "ep_5_ut_23"
    },
    {
      "end": 398938,
      "speaker": "Enrico Bertini",
      "start": 397842,
      "text": "What's the biggest gap?",
      "id": "ep_5_ut_24"
    },
    {
      "end": 560496,
      "speaker": "Andy Kirk",
      "start": 399066,
      "text": "Well, I think the first thing to say is that I don't attempt to challenge to tackle a lot of the technology in the tool side, because I do explain to people that there's such an inconsistency of people's capabilities as they come to the sessions. There's no point me trying to find a session that talks about tools or programming in such depth that we'll be able to bring everybody along at the same time. So I kind of make that clear in the outset. But I think the difficulty people have, which is why I've responded with the structure of training that I have done, is the tactics is really, you know, when they are commissioned or they're briefed or they're asked by a boss or someone to do a visualization piece, it's typically surrounded by limited time scales or limited resources. And so they've got to find an efficient and effective way through this, you know, essentially quite a difficult creative and scientific task. And so what I try and do is give, give people this route through the design process. And obviously, it's very iterative and they have to revisit stages. But that, to me, is what people are seeking above all else. A set of tactics or a rough process or methodology that can be portable to any problem context, whether it's a small infographic or a large video installation, hopefully that will then give them the more efficient and effective way to tackle the projects. And obviously, everyone's looking for the silver bullet when it comes to what is the best method for this given scenario. But once again, there's so many variables there, it's difficult to say, oh, you always use this. And I think it's important also not to focus on hard rules or fixed principles as such because of that very reason. There are so many variables and different scenarios that are involved. And I recall, I think it's sort of a couple of months ago now, but there was a really interesting Twitter discussion between, I think it was Wes Grubbs and Hugh Moritz, and I think Jeff Clark was involved and Nathan, and it was about this balancing between. Do you give people principles and a kind of set of guidelines that they should follow, or should people just play and discover things? They're much more kind of serendipitous process. And that was a really interesting discussion, I thought.",
      "id": "ep_5_ut_25"
    },
    {
      "end": 599044,
      "speaker": "Enrico Bertini",
      "start": 560560,
      "text": "Yeah, I personally think this is a huge theme. I mean, how much you want to balance the theoretical part with practice. And I cannot really see any of the two separate. I cannot see these two things separated. They really, in a way, they help each other. You need, of course, some basic knowledge and theory, because otherwise, basically, what I like to say is that if you don't have any knowledge to guide your design, you are basically playing darts. And that's really bad. And I see it all the times.",
      "id": "ep_5_ut_26"
    },
    {
      "end": 651154,
      "speaker": "Moritz Stefaner",
      "start": 599664,
      "text": "You can hurt yourself. Right. No, but I totally agree. I'm also. But I mean, that's also philosophical point, really. But I also think, like, you should first learn the rules and understand the conventions, you know, and understand how it works, basically. And then you can start to play with that and become creative and also play with these conventions, you know, and use them in interesting ways. But you have to be aware of all this body of work that's, you know, that's there already. And other people say, like, that's just, you know, that spoils you, and you should be as, let's say, as your mind should be as untouched as possible, then it's at its best creative point. I mean, I can see that in my kids, of course. I mean, my son is painting like crazy. Yeah. Better than I ever could, basically. So there's something to that, too.",
      "id": "ep_5_ut_27"
    },
    {
      "end": 676316,
      "speaker": "Andy Kirk",
      "start": 652414,
      "text": "Sorry, I was just saying it's the same in any creative discipline. I mean, you mentioned painting that when I did art at school, it was very much about painting between the lines and not going outside the lines. And then as you develop more confidence, you then start to become more expressive. Even things like football, you know, you can be so overly coached as a young kid that you actually lose that sense of.",
      "id": "ep_5_ut_28"
    },
    {
      "end": 677484,
      "speaker": "Moritz Stefaner",
      "start": 676340,
      "text": "You can overthink freedom.",
      "id": "ep_5_ut_29"
    },
    {
      "end": 680196,
      "speaker": "Andy Kirk",
      "start": 677604,
      "text": "Exactly. Yeah. So it's a real balance in that particular.",
      "id": "ep_5_ut_30"
    },
    {
      "end": 696148,
      "speaker": "Moritz Stefaner",
      "start": 680260,
      "text": "But the thing is, there is a strong functional component to data visualization. So, you know, it's not art, it's design. And we're building something that should work in some sense. And there you can get lucky by just, you know, fooling around. But usually it works much better if you know what you're doing.",
      "id": "ep_5_ut_31"
    },
    {
      "end": 696764,
      "speaker": "Andy Kirk",
      "start": 696236,
      "text": "Yeah.",
      "id": "ep_5_ut_32"
    },
    {
      "end": 697650,
      "speaker": "Moritz Stefaner",
      "start": 696884,
      "text": "Just saying.",
      "id": "ep_5_ut_33"
    },
    {
      "end": 701074,
      "speaker": "Andy Kirk",
      "start": 697772,
      "text": "Yes. Hashtag. Just saying. Hashtag.",
      "id": "ep_5_ut_34"
    },
    {
      "end": 706430,
      "speaker": "Enrico Bertini",
      "start": 701934,
      "text": "Moritz. Are you aware that this is recorded? Yeah, it's carved in stone now.",
      "id": "ep_5_ut_35"
    },
    {
      "end": 726548,
      "speaker": "Moritz Stefaner",
      "start": 706542,
      "text": "Absolutely. I totally stand to that. No, I also think there is some, you know, some visualizations are objectively better than others. You know, I'm totally convinced of that. And some, I also think design is an objective activity where you can have objective measures. You know, it's not a matter of taste.",
      "id": "ep_5_ut_36"
    },
    {
      "end": 727152,
      "speaker": "Andy Kirk",
      "start": 726686,
      "text": "No.",
      "id": "ep_5_ut_37"
    },
    {
      "end": 728352,
      "speaker": "Moritz Stefaner",
      "start": 727248,
      "text": "What you do. Not really.",
      "id": "ep_5_ut_38"
    },
    {
      "end": 730752,
      "speaker": "Andy Kirk",
      "start": 728408,
      "text": "And I think serious, I mean, you.",
      "id": "ep_5_ut_39"
    },
    {
      "end": 732416,
      "speaker": "Enrico Bertini",
      "start": 730768,
      "text": "Don't need to convince me on that.",
      "id": "ep_5_ut_40"
    },
    {
      "end": 738920,
      "speaker": "Moritz Stefaner",
      "start": 732560,
      "text": "Yeah, but some people, I mean, just saying, hashtag, hashtag, it's trending.",
      "id": "ep_5_ut_41"
    },
    {
      "end": 748968,
      "speaker": "Andy Kirk",
      "start": 738952,
      "text": "Then. Another important thing is we had a question from EJ Fox, who works at visually.",
      "id": "ep_5_ut_42"
    },
    {
      "end": 749592,
      "speaker": "Moritz Stefaner",
      "start": 749136,
      "text": "Oh, yes.",
      "id": "ep_5_ut_43"
    },
    {
      "end": 790784,
      "speaker": "Andy Kirk",
      "start": 749648,
      "text": "And the question he, or the point he was asking for a bit of a discussion about was in discussion with colleagues, it seems. Biggest gap for Dataviz newbies is needing a question before going further. And he asks, can you explain more about the importance of starting with a question or how to convey that process to newbs, newbies, new people? So I think that was followed up by a reference to a Ben Shneiderman mantra. And Moritz, you controversially retweeted and replied, did you say you want to discuss this because you don't agree?",
      "id": "ep_5_ut_44"
    },
    {
      "end": 817914,
      "speaker": "Moritz Stefaner",
      "start": 791244,
      "text": "Yeah, I mean, there's something to it. I mean, of course, you know, all these rules of thumb, of course they don't come from nowhere. So it's good if you have a question in mind. But I think it's such a cliche to say every infographic, every visualization needs a central question. I don't think it's true. And I think many great works just were produced from a fascination of a certain topic or a certain data set or a certain formal technique, you know, like.",
      "id": "ep_5_ut_45"
    },
    {
      "end": 819050,
      "speaker": "Andy Kirk",
      "start": 818074,
      "text": "But do you think so?",
      "id": "ep_5_ut_46"
    },
    {
      "end": 848584,
      "speaker": "Moritz Stefaner",
      "start": 819082,
      "text": "I'm fairly sure the great, great wind visualization Wattenberger and Viegas did, I'm fairly sure it just came from this fascination for the nice particle streams. And then they thought, ah, listen, you know what? We could use that for wind. Let's see if we can find a wind database, you know? And so I think that's totally valid. And there is no question behind this wind data visualization except the very obvious question, where does the wind blow? Yeah, but I mean, that's a topic for me, not a question. Right. That's true.",
      "id": "ep_5_ut_47"
    },
    {
      "end": 857568,
      "speaker": "Enrico Bertini",
      "start": 848624,
      "text": "Also on another level, I mean, even from a more academic point of view, traditionally visualization has been used for exploratory data analysis.",
      "id": "ep_5_ut_48"
    },
    {
      "end": 858168,
      "speaker": "Andy Kirk",
      "start": 857696,
      "text": "Yeah.",
      "id": "ep_5_ut_49"
    },
    {
      "end": 865064,
      "speaker": "Enrico Bertini",
      "start": 858256,
      "text": "And exploratory data analysis is, is basically looking at the data and seeing what can I see here?",
      "id": "ep_5_ut_50"
    },
    {
      "end": 867524,
      "speaker": "Moritz Stefaner",
      "start": 865184,
      "text": "And helps you find questions, not answers.",
      "id": "ep_5_ut_51"
    },
    {
      "end": 869024,
      "speaker": "Enrico Bertini",
      "start": 868544,
      "text": "Right?",
      "id": "ep_5_ut_52"
    },
    {
      "end": 869624,
      "speaker": "Moritz Stefaner",
      "start": 869104,
      "text": "Yes.",
      "id": "ep_5_ut_53"
    },
    {
      "end": 875384,
      "speaker": "Enrico Bertini",
      "start": 869744,
      "text": "And even searching for an hypothesis. So I think that's, that's true at many levels.",
      "id": "ep_5_ut_54"
    },
    {
      "end": 886016,
      "speaker": "Andy Kirk",
      "start": 875544,
      "text": "Yeah. And am I right, Enrico? And saying that's the distinction between, is it inductive and deductive research methods? Yeah. So one's boring.",
      "id": "ep_5_ut_55"
    },
    {
      "end": 887484,
      "speaker": "Enrico Bertini",
      "start": 886040,
      "text": "I'm getting boring here.",
      "id": "ep_5_ut_56"
    },
    {
      "end": 929806,
      "speaker": "Andy Kirk",
      "start": 888074,
      "text": "We're getting too academic. Let's bring it back. So I think the response to EJ is that, of course many things will start with a question and start with a curiosity about something, but it's such an iterative process. You'll maybe start with curiosity, you'll embark on some exploitary analysis and then new questions, new discoveries will emerge and you kind of go on a cycle from there. So I don't think any lack of questions should prevent people from embarking on a database process. Just dive in there and see what patterns and relationships and interesting things emerge. But I guess, as you said, Moritz, at some point, maybe a topic will emerge, perhaps rather than a question.",
      "id": "ep_5_ut_57"
    },
    {
      "end": 931174,
      "speaker": "Moritz Stefaner",
      "start": 929910,
      "text": "Yeah, I mean, at some point it's.",
      "id": "ep_5_ut_58"
    },
    {
      "end": 942194,
      "speaker": "Andy Kirk",
      "start": 931254,
      "text": "Quite necessary forever and ever, but yeah, I think don't get too hot by needing a very specific, defined question. If it's there, great. But otherwise, no.",
      "id": "ep_5_ut_59"
    },
    {
      "end": 974916,
      "speaker": "Enrico Bertini",
      "start": 942814,
      "text": "So I wanted to move on. I would like to ask you guys, if you would have to suggest to a novice who wants to learn how to do proper visualization, what is the basic skillset? What do you think are the most important things to start with in terms of knowledge? And then of course, we can discuss practice. Starting from studying visualization, what do you think is the most important body of knowledge that you need to acquire?",
      "id": "ep_5_ut_60"
    },
    {
      "end": 977504,
      "speaker": "Andy Kirk",
      "start": 975060,
      "text": "Well, do you want to tell us more?",
      "id": "ep_5_ut_61"
    },
    {
      "end": 1025668,
      "speaker": "Moritz Stefaner",
      "start": 978124,
      "text": "Yeah, I mean, the basic thing you should know, which is often not reflected that much, is how visual variables work. So which visual properties of a mark can we vary to express something? And what different qualities do they have? And it takes quite a while to figure that out in detail. So because you can work with sizes, you can work with positions, with textures, with colors, with shapes, with rotation, you can combine all of that into glyphs. So there's lots of things to learn in this area. And basically, also, if you look at combinations, the learning never stops. And much is unknown there too. I think everybody who is in the field should know about the basics in this area. Also, basic perception rules.",
      "id": "ep_5_ut_62"
    },
    {
      "end": 1028516,
      "speaker": "Andy Kirk",
      "start": 1025836,
      "text": "The Cleveland's Miguel stuff.",
      "id": "ep_5_ut_63"
    },
    {
      "end": 1037516,
      "speaker": "Moritz Stefaner",
      "start": 1028540,
      "text": "Yeah, yeah, yeah. And because this is the thing we're working with, you know, it's like if you want to make music, you have to know about the tones, right?",
      "id": "ep_5_ut_64"
    },
    {
      "end": 1037932,
      "speaker": "Andy Kirk",
      "start": 1037540,
      "text": "Yeah.",
      "id": "ep_5_ut_65"
    },
    {
      "end": 1053322,
      "speaker": "Moritz Stefaner",
      "start": 1038028,
      "text": "So this is what we combine to bigger structures and to more complex things. And you, I think that's one thing I try to teach. When I teach, I'm not great at teaching. I should say that first. But when I teach, I try to.",
      "id": "ep_5_ut_66"
    },
    {
      "end": 1054570,
      "speaker": "Andy Kirk",
      "start": 1053378,
      "text": "And we have to lose Morich there.",
      "id": "ep_5_ut_67"
    },
    {
      "end": 1070130,
      "speaker": "Moritz Stefaner",
      "start": 1054642,
      "text": "Yeah, I try to make clear that this is, you should be really clear in how you use these visual variables. You should, you know, if somebody asks you, you should like, without hesitation, be able to explain how you did that in a certain way.",
      "id": "ep_5_ut_68"
    },
    {
      "end": 1070730,
      "speaker": "Andy Kirk",
      "start": 1070162,
      "text": "Exactly.",
      "id": "ep_5_ut_69"
    },
    {
      "end": 1077254,
      "speaker": "Moritz Stefaner",
      "start": 1070842,
      "text": "Because everything, there was a conscious decision. Nothing, absolutely nothing arbitrary about these choices.",
      "id": "ep_5_ut_70"
    },
    {
      "end": 1124884,
      "speaker": "Andy Kirk",
      "start": 1077294,
      "text": "That's an absolutely central tenet to my sessions, that everything has to be justified, reasoned, deliberate and explainable. And obviously, if you've got that knowledge of the visuals, great. But as you said, there are so many available combinations of things that, in essence, for new people, for new business. EJ Column it's almost a need for almost like a menu. This is the awareness of all these different fables that exist. And as you sort of move beyond the comfort zone of things like bars and lines into things like glyphs and motion and luminance and blur, it's very much really visual variables you're mentioning there.",
      "id": "ep_5_ut_71"
    },
    {
      "end": 1131416,
      "speaker": "Moritz Stefaner",
      "start": 1125464,
      "text": "Yummy. Missing texture and hatching, of course.",
      "id": "ep_5_ut_72"
    },
    {
      "end": 1209572,
      "speaker": "Andy Kirk",
      "start": 1131480,
      "text": "Yeah. But to offset the visual but variable stuff, obviously things around statistics and analytics and that kind of angle is obviously a foundation of the subject field. I mean, how many times do we see poorly applied statistics completely undermine a visualization piece? So I guess that's the, that's the stern offset to the design variables that exist. And then there's, I mean, there's things such as, I guess, taking the sort of visual variable angle a bit further. The Gestalt laws are obviously very important. And for those who don't know about Gestalt laws, these are a set of, I guess, laws that explain how the eye and the brain perceive shapes and patterns and relationships between shapes and patterns. That once again are the kind of foundation of how visualization succeeds, how we understand whether the continuity of a line is the same series or is a new series, and how you understand the different clusters and shapes that form from different position and relationships fail. Yeah.",
      "id": "ep_5_ut_73"
    },
    {
      "end": 1213404,
      "speaker": "Moritz Stefaner",
      "start": 1209588,
      "text": "I mean, visual variables, they describe quite well how a single mark works.",
      "id": "ep_5_ut_74"
    },
    {
      "end": 1213900,
      "speaker": "Andy Kirk",
      "start": 1213484,
      "text": "That's right.",
      "id": "ep_5_ut_75"
    },
    {
      "end": 1231778,
      "speaker": "Moritz Stefaner",
      "start": 1213932,
      "text": "You know, how large do I make that circle or where position it? And gestalt laws, they help you a lot in like talking about groups of markers and their interrelation, you know, and again, that's really, that's really important, basic knowledge there. Yeah, absolutely.",
      "id": "ep_5_ut_76"
    },
    {
      "end": 1291574,
      "speaker": "Andy Kirk",
      "start": 1231906,
      "text": "And I suppose picking up on the issue of questions and topics or curiosities, I think the best designers also have that sense, I guess, of a, almost a journalistic sense of what's an interesting angle. What's an interesting story to dig out? I mean, if we take someone like David McCandless, for example, I mean, David's core strength for me, he's got a really sound sense of what's an interesting subject, an interesting story to pull out from data. So I think that really adds, I guess, to the statistical side and going through the exploitative process, you could be on an infinite process of combinations and permutations of variables. But if you have got a sense of what you believe is an interesting angle, then that does help cut through a lot of the wasted effort. What would you say, Enrico, from your academic perspective, do you think is a real key ingredient?",
      "id": "ep_5_ut_77"
    },
    {
      "end": 1342780,
      "speaker": "Enrico Bertini",
      "start": 1292554,
      "text": "I definitely agree that visual variables are the building blocks of visualization. And if you don't learn how to play with them first, the rest cannot really come normally. And there is one thing related to visual variables that I've experienced over and over, is, I don't know if you have the same opinion as me, is that particularly the way being trained yourself to use these visual variables in different settings, different problems, especially trying to. To have to come up with different designs on top of the same data, it's really, really useful. And among the visual variables, I think that position is clearly the most important one.",
      "id": "ep_5_ut_78"
    },
    {
      "end": 1343784,
      "speaker": "Andy Kirk",
      "start": 1342852,
      "text": "Oh, absolutely.",
      "id": "ep_5_ut_79"
    },
    {
      "end": 1385826,
      "speaker": "Enrico Bertini",
      "start": 1344244,
      "text": "And I have seen people playing a lot with different colors, sizes and all the rest, but very few people realize that the most important thing is playing with layout. I think layout is really, really important. And the more you learn how to come up with different layouts, the more you have a whole lot of opportunities in front of you. Yeah, because this is what really changes the angle. You are talking about the way you use position to represent data. And then of course, on top of that, you can use all the other variables. But position is really, really important and I never see it stressed enough. I mean, I think it's really, really important.",
      "id": "ep_5_ut_80"
    },
    {
      "end": 1417754,
      "speaker": "Moritz Stefaner",
      "start": 1385890,
      "text": "Yeah. My 6th word advice is position is everything. Color is difficult in this area. And there's also, in design, there's usually a saying, get it right in black and white. So, you know, get it to work in. If it works on a napkin or like, you know, in black and white, you can be fairly sure that it will also work in a more refined format. But yeah, if you have the sort of the size relations and the. And the positional, you know, relations nailed, then you're almost there.",
      "id": "ep_5_ut_81"
    },
    {
      "end": 1459144,
      "speaker": "Andy Kirk",
      "start": 1418614,
      "text": "And that leads on to colour and the knowledge of color theory. And there was an interesting case this last week where I think it was probably myself, Moritz and Gregor were lazing with Simon Rogers about the guardian choropleth map and color scheme there. And, you know, there is, there are so many nuances to color that you can't just get away with throwing any color together. It needs to be so deliberate and so well informed about the different schemes, whether it's diverging, converging, whether it's sequential. I mean, you know, color spaces.",
      "id": "ep_5_ut_82"
    },
    {
      "end": 1460496,
      "speaker": "Moritz Stefaner",
      "start": 1459224,
      "text": "Yeah, I mean, there's.",
      "id": "ep_5_ut_83"
    },
    {
      "end": 1489066,
      "speaker": "Andy Kirk",
      "start": 1460560,
      "text": "It's color deficiencies, metaphors. Come on. I mean, for me, I think obviously everyone should know hopefully, about color. Brewer as colourbrewer two.org as a resource. But in terms of books, Colin Ware would be the go to guy for me in terms of color theory and understanding how the brain and eye works. But I think that's a key thing.",
      "id": "ep_5_ut_84"
    },
    {
      "end": 1493044,
      "speaker": "Moritz Stefaner",
      "start": 1489130,
      "text": "We will do a specific episode only on color. I can promise that.",
      "id": "ep_5_ut_85"
    },
    {
      "end": 1493672,
      "speaker": "Andy Kirk",
      "start": 1493154,
      "text": "Okay.",
      "id": "ep_5_ut_86"
    },
    {
      "end": 1498344,
      "speaker": "Moritz Stefaner",
      "start": 1493768,
      "text": "Because, I mean, you could do like ten different episodes on color and would still be frustrating.",
      "id": "ep_5_ut_87"
    },
    {
      "end": 1577414,
      "speaker": "Andy Kirk",
      "start": 1498384,
      "text": "Will this be like the Beatles albums? We'll do a black series and a blue series. And then obviously you need in terms of knowledge to clearly move on to things such as tools and software and programming to actually execute the work. And I mean, you know, I mean, this is probably once again another complete episode in its own right. But you've got to have an array of skills in, I guess, statistical packages and program environments and things like illustrator, Photoshop and publishing tools. So the great shame, I guess, of the field at the moment is just this fragmentation of all the tools that are out there, and there isn't one single tool that does everything. And I know that's a great frustration for people who come on my course is the sense that, oh God, I've got to learn six or seven different applications here just to complete a single piece. And, you know, many times, you know, it's quite overwhelming for many people, but ultimately that's the, unless you're doing something in pen and paper or crayons or tapestries or any kind of non computer related media. But it is ultimately what makes the think I'm alive.",
      "id": "ep_5_ut_88"
    },
    {
      "end": 1597542,
      "speaker": "Enrico Bertini",
      "start": 1578014,
      "text": "Yeah, yeah. What I think is also important in terms of knowledge, which actually builds on top of that is having a clear understanding of what different kind of visualization techniques are available according to the data format you have in front of you. That's also really important.",
      "id": "ep_5_ut_89"
    },
    {
      "end": 1600926,
      "speaker": "Andy Kirk",
      "start": 1597598,
      "text": "Okay, so things like comparing time or those methods.",
      "id": "ep_5_ut_90"
    },
    {
      "end": 1618302,
      "speaker": "Enrico Bertini",
      "start": 1600950,
      "text": "Yeah, if you have time, geo multidimensional graphs, hierarchies, having at least a toolbox of, I don't know, different standard approaches that you can try out right away as soon as you know what kind of data you have.",
      "id": "ep_5_ut_91"
    },
    {
      "end": 1619854,
      "speaker": "Andy Kirk",
      "start": 1618398,
      "text": "Absolutely, yeah.",
      "id": "ep_5_ut_92"
    },
    {
      "end": 1678108,
      "speaker": "Moritz Stefaner",
      "start": 1619974,
      "text": "And always a repertoire. So if you see a network data, you should not only think, I could make this network map, but you should also think matrix or radio layout. Right. So exactly. What I find really important is, apart from the data and the technic side, is this idea of to have a repertoire of metaphors as well. So there's a great book by Lakov from the eighties. It's called metaphors we live by. And he looks at language, I mean, it's mostly western thinking and English, but I mean, our whole language is so dominated by images, you know, that express something like, more is your language and less is down. You know, that's, in a way it's arbitrary. In another way it's clear, because, you know, it comes from the physical world also. Or that a stronger plant, you know, is bigger or like rises higher up. So that must be better. Some higher. And so all these directions, for instance, they have a deep meaning depending on which data you're using.",
      "id": "ep_5_ut_93"
    },
    {
      "end": 1678756,
      "speaker": "Andy Kirk",
      "start": 1678196,
      "text": "That's right.",
      "id": "ep_5_ut_94"
    },
    {
      "end": 1680892,
      "speaker": "Moritz Stefaner",
      "start": 1678820,
      "text": "Or in which domain you're operating. Right.",
      "id": "ep_5_ut_95"
    },
    {
      "end": 1690222,
      "speaker": "Andy Kirk",
      "start": 1680948,
      "text": "And there's a great book by Connie Malamud, the visual language for designers. I love it, which is great for that sort of knowledge as well.",
      "id": "ep_5_ut_96"
    },
    {
      "end": 1700742,
      "speaker": "Moritz Stefaner",
      "start": 1690398,
      "text": "Cool. Yeah. And I think it's something people often tend to forget who are very focused on the mathematical side of things, is that these things have an innate. They come with connotations.",
      "id": "ep_5_ut_97"
    },
    {
      "end": 1701438,
      "speaker": "Andy Kirk",
      "start": 1700838,
      "text": "Yeah.",
      "id": "ep_5_ut_98"
    },
    {
      "end": 1711034,
      "speaker": "Moritz Stefaner",
      "start": 1701566,
      "text": "Colors, directions, any type of graphic always comes with connotations and evokes certain metaphors or certain mental imagery.",
      "id": "ep_5_ut_99"
    },
    {
      "end": 1715694,
      "speaker": "Enrico Bertini",
      "start": 1712794,
      "text": "Another. Oh, sorry, another small thing.",
      "id": "ep_5_ut_100"
    },
    {
      "end": 1718178,
      "speaker": "Andy Kirk",
      "start": 1716754,
      "text": "Your turn. Go on.",
      "id": "ep_5_ut_101"
    },
    {
      "end": 1721010,
      "speaker": "Moritz Stefaner",
      "start": 1718346,
      "text": "Okay, you both, it's my turn.",
      "id": "ep_5_ut_102"
    },
    {
      "end": 1723954,
      "speaker": "Andy Kirk",
      "start": 1721042,
      "text": "I guess we've eliminated each other.",
      "id": "ep_5_ut_103"
    },
    {
      "end": 1725018,
      "speaker": "Moritz Stefaner",
      "start": 1723994,
      "text": "Yeah, exactly.",
      "id": "ep_5_ut_104"
    },
    {
      "end": 1726330,
      "speaker": "Andy Kirk",
      "start": 1725066,
      "text": "Go on. Emerica.",
      "id": "ep_5_ut_105"
    },
    {
      "end": 1728814,
      "speaker": "Moritz Stefaner",
      "start": 1726442,
      "text": "Minus one times minus one is plus one.",
      "id": "ep_5_ut_106"
    },
    {
      "end": 1741574,
      "speaker": "Enrico Bertini",
      "start": 1729154,
      "text": "So another thing I want to mention is that interaction plays a large role as well, or may play a large role. Yeah, I must say that interaction is a little bit of a Cinderella of visualization.",
      "id": "ep_5_ut_107"
    },
    {
      "end": 1748594,
      "speaker": "Moritz Stefaner",
      "start": 1743094,
      "text": "I thought it was color. What is color then? Damn it, I'm all confused now. Oh, God.",
      "id": "ep_5_ut_108"
    },
    {
      "end": 1753982,
      "speaker": "Enrico Bertini",
      "start": 1750574,
      "text": "I mean, interaction is even more Cinderella than color.",
      "id": "ep_5_ut_109"
    },
    {
      "end": 1759154,
      "speaker": "Moritz Stefaner",
      "start": 1754078,
      "text": "Maybe it's the black art. Is it the ninja? Is it the black ninja? Maybe, yeah.",
      "id": "ep_5_ut_110"
    },
    {
      "end": 1824712,
      "speaker": "Enrico Bertini",
      "start": 1761214,
      "text": "But I mean, what is really surprising from an academic point of view is that especially at the beginning of the early years of infovis, there was a lot of development in the area of very fancy interactive techniques to deal with visualization, and most of them have never been applied in industry or design or whatever. I mean, it's really strange. There is a whole set of interactive techniques that have been developed, developed during the nineties and they are basically dead. They are just in a few papers and nobody really cares about them. But I think it's an important aspect of visualization as well, especially when you want to do something that is a little bit more complex than only representing the data. As soon as you want to give the possibility to switch from one view to another or to, I don't know, get more information because you cannot really represent everything visually. I think interaction plays a very, very.",
      "id": "ep_5_ut_111"
    },
    {
      "end": 1847434,
      "speaker": "Moritz Stefaner",
      "start": 1824768,
      "text": "Large role and it has to be used really well. I mean, I had that with students often that they want to do either an animation or something interactive, you know, just because it sounds cooler or. Yeah, it could be more fun potentially. But if you do something, if you make something interactive that wasn't meant to be interactive, it's always like it's big fail. Yeah.",
      "id": "ep_5_ut_112"
    },
    {
      "end": 1848990,
      "speaker": "Enrico Bertini",
      "start": 1848214,
      "text": "I mean, even.",
      "id": "ep_5_ut_113"
    },
    {
      "end": 1882798,
      "speaker": "Moritz Stefaner",
      "start": 1849062,
      "text": "Should we drop Shneiderman? Let's quickly schnup Shneiderman's mantra, so just go ahead. Yeah, so that's the sort of, he formulated this basic idea that any exploratory information visualization should first start with an overview. Then you can zoom and or filter and you provide details on demand. And if you think about it, I mean, 99% of all interactive info works like that, in fact. And so I think he pretty much nailed it. The question is how helpful it is to know that. But it's a good observation.",
      "id": "ep_5_ut_114"
    },
    {
      "end": 1918218,
      "speaker": "Andy Kirk",
      "start": 1882886,
      "text": "Absolutely. Yeah. And I think the, I guess the other thing that brings everything together is you've ultimately got to have a certain flair for design, an eye for design, an eye for layout and placement and arrangement, and just that's something about how you bring all this together into a single piece and that kind of design discipline as well. Knowing when to finish, knowing when have you got to the point of, you know, there's nothing more to do on this piece, but how do you learn?",
      "id": "ep_5_ut_115"
    },
    {
      "end": 1919050,
      "speaker": "Moritz Stefaner",
      "start": 1918306,
      "text": "How do you teach?",
      "id": "ep_5_ut_116"
    },
    {
      "end": 1936694,
      "speaker": "Andy Kirk",
      "start": 1919122,
      "text": "Well, that's it. I mean, that's something which I'd argue is perhaps more about practice than it's about teaching. Absolutely. But I think the thing to concentrate on the teaching is to make people aware that there is a need to consciously call something as finished and understand why that's the case.",
      "id": "ep_5_ut_117"
    },
    {
      "end": 1943314,
      "speaker": "Moritz Stefaner",
      "start": 1937114,
      "text": "That's the first. Yeah, that's true. That's the first step to, or to see maybe when something's overdone, under done and understand.",
      "id": "ep_5_ut_118"
    },
    {
      "end": 1977354,
      "speaker": "Andy Kirk",
      "start": 1943394,
      "text": "Exactly. Yeah. And I just think as well that the, I mean, design something that, which is very difficult to teach in its own sense, but all these other elements that we've discussed around visual variables about laws, man shows about color. That will give you the building blocks of a design capability, and then the rest is practice. I mean, that's the unfortunate thing. You can't just pick these things up individually and expect to run away with something successfully straightaway.",
      "id": "ep_5_ut_119"
    },
    {
      "end": 1991302,
      "speaker": "Moritz Stefaner",
      "start": 1977474,
      "text": "Yeah, but let's say somebody comes to you, he's in the beginning, or she of her twenties, and says, oh, I'm so keen on learning database. What should I do? So what's the first thing you should.",
      "id": "ep_5_ut_120"
    },
    {
      "end": 1993994,
      "speaker": "Andy Kirk",
      "start": 1991398,
      "text": "Well, you immediately go onto my website and book a course.",
      "id": "ep_5_ut_121"
    },
    {
      "end": 2001314,
      "speaker": "Moritz Stefaner",
      "start": 1998214,
      "text": "Book all of the courses there that was prepared.",
      "id": "ep_5_ut_122"
    },
    {
      "end": 2008774,
      "speaker": "Andy Kirk",
      "start": 2003734,
      "text": "But I mean, if we're talking about different channels through which you could learn.",
      "id": "ep_5_ut_123"
    },
    {
      "end": 2010074,
      "speaker": "Moritz Stefaner",
      "start": 2008814,
      "text": "Stupid questions.",
      "id": "ep_5_ut_124"
    },
    {
      "end": 2033476,
      "speaker": "Andy Kirk",
      "start": 2010734,
      "text": "Stupid questions. The wrong guy. Exactly. But I mean, I mean, certainly from my point of view, I was never, I was never taught these things. I, I was very much self taught and went through discovery kind of all my own. And it's, you immerse yourself in the books, you immerse yourself in the, the best websites and the practitioners and you keep on top of the.",
      "id": "ep_5_ut_125"
    },
    {
      "end": 2040604,
      "speaker": "Moritz Stefaner",
      "start": 2033620,
      "text": "Yeah, but would you say, go study, or would you say, go join a company? Or would you say go try it out yourself?",
      "id": "ep_5_ut_126"
    },
    {
      "end": 2042290,
      "speaker": "Andy Kirk",
      "start": 2040684,
      "text": "I think try out yourself in the first instance.",
      "id": "ep_5_ut_127"
    },
    {
      "end": 2043418,
      "speaker": "Moritz Stefaner",
      "start": 2042322,
      "text": "Yeah, yeah.",
      "id": "ep_5_ut_128"
    },
    {
      "end": 2049834,
      "speaker": "Andy Kirk",
      "start": 2043466,
      "text": "I think that personal void through this is probably more important. I mean, it depends on the company.",
      "id": "ep_5_ut_129"
    },
    {
      "end": 2053178,
      "speaker": "Moritz Stefaner",
      "start": 2049874,
      "text": "And get in touch on the web with like the usual suspects. I mean.",
      "id": "ep_5_ut_130"
    },
    {
      "end": 2053602,
      "speaker": "Andy Kirk",
      "start": 2053266,
      "text": "Yeah.",
      "id": "ep_5_ut_131"
    },
    {
      "end": 2057122,
      "speaker": "Moritz Stefaner",
      "start": 2053658,
      "text": "See who you can pick up a Twitter fight with and take it from there.",
      "id": "ep_5_ut_132"
    },
    {
      "end": 2113496,
      "speaker": "Andy Kirk",
      "start": 2057218,
      "text": "Yeah, exactly. But I mean, I think for many people, I mean, this is certainly true of myself. You know, coming from a background which was quite, perhaps hard statistics, information management, I was very much on the kind of corporate, shall we say, the Stephen Few style side of the world. And it does take quite a concerted effort to kind of release yourself from those shackles in many ways. And I would also equate it to art once again. You know, it's difficult to have that confidence to go outside the lines and to become quite expressive. But, and that's where I think the working on yourself by yourself is so important. It's much more liberating. There's no rules there, there's no company organization bosses going to say, well, you didn't do that. Right. This is going to do by next Monday. So I think, you know, that kind of personal practice. And as you said.",
      "id": "ep_5_ut_133"
    },
    {
      "end": 2130966,
      "speaker": "Moritz Stefaner",
      "start": 2113600,
      "text": "But will you learn alone, like how to all these design principles, I mean, so I would say take at least to an internship or maybe study design, because just to learn this process of sketching or understanding, like solving the wicked problems, knowing when to stop and these things.",
      "id": "ep_5_ut_134"
    },
    {
      "end": 2132110,
      "speaker": "Andy Kirk",
      "start": 2131070,
      "text": "Yeah, absolutely.",
      "id": "ep_5_ut_135"
    },
    {
      "end": 2134382,
      "speaker": "Moritz Stefaner",
      "start": 2132222,
      "text": "So. But maybe an internship is good, too.",
      "id": "ep_5_ut_136"
    },
    {
      "end": 2178884,
      "speaker": "Andy Kirk",
      "start": 2134438,
      "text": "I also think. I mean, you've talked in previous episodes about contests, and, you know, if. If you're. If you've got the capacity and the time and the. The will to do it, there's absolutely no harm in taking those contests and the data sets that are on offer there and the briefs that come with them and throwing something together, submitting it, and then learning from what everybody else is doing. I mean, design is all about choices, and as you'll see on any visualization contest gallery, in so many different interpretations. And you can learn from those different interpretations, see what other people have discovered as a potential solution, and form your own judgments, whether that seems to work for you or not.",
      "id": "ep_5_ut_137"
    },
    {
      "end": 2216140,
      "speaker": "Moritz Stefaner",
      "start": 2180464,
      "text": "I mean, I would even say if you have time studying cognitive science hasn't hurt. For me, that was a good basis, too. I mean, it's a bit like a very long road, because first you study something where, I mean, technically, I don't use 80% of the things I've learned, you know, but it sort of provides that a lot of formal background in knowledge representation, computing, artificial intelligence, you know, and these things. Absolutely. Linguistics. So I think from a sort of coming from the second angle, not the directly applicable one, but the more the background, that's a great thing to do.",
      "id": "ep_5_ut_138"
    },
    {
      "end": 2225154,
      "speaker": "Andy Kirk",
      "start": 2216172,
      "text": "And everything that we say is a kind of. It's revealing that there is so little formal education on these things.",
      "id": "ep_5_ut_139"
    },
    {
      "end": 2229370,
      "speaker": "Moritz Stefaner",
      "start": 2225194,
      "text": "Yeah, there's none. I mean, there's nothing otherwise, just say, yeah, take that course and you're done.",
      "id": "ep_5_ut_140"
    },
    {
      "end": 2266010,
      "speaker": "Andy Kirk",
      "start": 2229402,
      "text": "Right, exactly. You know, or see math through to a certain level. There's nothing. I mean, and obviously, it's difficult. As we've mentioned, it's so interdisciplinary. Where would you pitch it? Where would you position this? And I've talked about this in previous blog posts on my site about where and how could you teach youngsters, you know, age ten, 1112, at the start of secondary school? How could you get the skills across at that early age? So it's difficult, and that's why people are now reacting afterwards, almost, to build up these skills off their own back in many ways.",
      "id": "ep_5_ut_141"
    },
    {
      "end": 2266774,
      "speaker": "Moritz Stefaner",
      "start": 2266122,
      "text": "Sure.",
      "id": "ep_5_ut_142"
    },
    {
      "end": 2308860,
      "speaker": "Enrico Bertini",
      "start": 2268394,
      "text": "Yeah. I think what is really interesting is that if you like data visualization and you are in the position of starting a new bachelor or master, it's not easy to understand what kind of faculty you would have to go to. And there are so many options. So historically, you can do visualization in either computer science with a more. With a bend towards human computer interaction, or computer graphics. But you have lots of people coming from statistics, from design itself, from cognitive science, as you said, Moritz, like you. And there is a very long tradition in geography as well.",
      "id": "ep_5_ut_143"
    },
    {
      "end": 2309716,
      "speaker": "Andy Kirk",
      "start": 2308932,
      "text": "Absolutely.",
      "id": "ep_5_ut_144"
    },
    {
      "end": 2312492,
      "speaker": "Moritz Stefaner",
      "start": 2309860,
      "text": "Oh, yes. Yeah. Not to forget.",
      "id": "ep_5_ut_145"
    },
    {
      "end": 2337258,
      "speaker": "Enrico Bertini",
      "start": 2312668,
      "text": "Not to forget. So basically, I mean, it's really hard to decide. I think, of course you have to follow your heart, but if your main goal is to learn visualization, and you already know that this is the thing you like, I really don't know what's best. I mean, probably I would say computer science because I'm a computer scientist, but any other faculty would work as well.",
      "id": "ep_5_ut_146"
    },
    {
      "end": 2388712,
      "speaker": "Andy Kirk",
      "start": 2337426,
      "text": "And I guess it also depends on where you've come from. So you might have a statistician who's looking to enhance their kind of design capabilities. So they'll already have that grounded. You might have other people coming from a graphic design, so they've got the kind of execution skills, they've got the design skills, maybe even the color theory, and they'll need to address all the gaps. So I guess it is the original perspective that you're coming from, the gap you're trying to bridge. But, yeah, I mean, all those, all those disciplines are ideal. But I mean, the interesting thing for me is if you're studying something like biological sciences or medicine or anything that's got a quantitative element, how do those people skill themselves in this field? I would love to see elective modules in universities that, yeah, everybody should have.",
      "id": "ep_5_ut_147"
    },
    {
      "end": 2389384,
      "speaker": "Moritz Stefaner",
      "start": 2388728,
      "text": "A course on that.",
      "id": "ep_5_ut_148"
    },
    {
      "end": 2391604,
      "speaker": "Andy Kirk",
      "start": 2389424,
      "text": "Everyone should have an alert, everyone can drop in.",
      "id": "ep_5_ut_149"
    },
    {
      "end": 2416682,
      "speaker": "Moritz Stefaner",
      "start": 2392784,
      "text": "I might be giving a course to like 1012 PhD students from all kinds of fields. So I'm just discussing that. And this will be fantastic because they all do visualization. They're just not reflecting it, you know, that this is something or how much you can do there. I think there's. And for me, it will be totally interesting to look at their research, too. So it should be fun.",
      "id": "ep_5_ut_150"
    },
    {
      "end": 2417454,
      "speaker": "Andy Kirk",
      "start": 2416778,
      "text": "Yeah.",
      "id": "ep_5_ut_151"
    },
    {
      "end": 2421610,
      "speaker": "Enrico Bertini",
      "start": 2418034,
      "text": "I mean, in the end, visualization is a basic tool, and you can imagine.",
      "id": "ep_5_ut_152"
    },
    {
      "end": 2424578,
      "speaker": "Moritz Stefaner",
      "start": 2421762,
      "text": "In an ideal, it's like writing or, you know.",
      "id": "ep_5_ut_153"
    },
    {
      "end": 2434074,
      "speaker": "Enrico Bertini",
      "start": 2424666,
      "text": "Yeah, exactly. This is what I was saying. In an ideal world, you would have to, you would love to teach visualization to in the high school as well. I mean, why not?",
      "id": "ep_5_ut_154"
    },
    {
      "end": 2489804,
      "speaker": "Andy Kirk",
      "start": 2434194,
      "text": "Yeah, absolutely. It didn't go any further, unfortunately, but I had a teacher from a local school approached me about an interest that he had in, I think it was his maths class, and he was looking to find out, unfortunately, didn't go any further for various reasons. But I mean, I guess let's make this a public appeal. I'd be very interested in getting together with any teachers out there are interested in. I don't know whether it's a maths class or any class, really. I'd love to find the technique to teach at that level now. You know, I'm so far away now from school, I can't remember really how or what is the most effective technique at that age to impart such things and how deep should you go? But I'd love to have a go and see what we can do. Because if you can get people equipped at that age, then wonderful for them.",
      "id": "ep_5_ut_155"
    },
    {
      "end": 2499594,
      "speaker": "Moritz Stefaner",
      "start": 2491624,
      "text": "So for self teaching, I mean, what would you recommend? Are there any good lectures, books? How would you go about.",
      "id": "ep_5_ut_156"
    },
    {
      "end": 2514014,
      "speaker": "Enrico Bertini",
      "start": 2500014,
      "text": "So some time ago, I wrote a blog post on books and other resources. And I think, Andy, you had something similar in the past, right?",
      "id": "ep_5_ut_157"
    },
    {
      "end": 2515634,
      "speaker": "Andy Kirk",
      "start": 2514054,
      "text": "Yeah, I copied immediately after.",
      "id": "ep_5_ut_158"
    },
    {
      "end": 2519590,
      "speaker": "Moritz Stefaner",
      "start": 2518414,
      "text": "The usual thing.",
      "id": "ep_5_ut_159"
    },
    {
      "end": 2520038,
      "speaker": "Andy Kirk",
      "start": 2519702,
      "text": "Yeah.",
      "id": "ep_5_ut_160"
    },
    {
      "end": 2521302,
      "speaker": "Moritz Stefaner",
      "start": 2520086,
      "text": "Plagiarism, french thumbnail.",
      "id": "ep_5_ut_161"
    },
    {
      "end": 2526244,
      "speaker": "Andy Kirk",
      "start": 2521358,
      "text": "It's sickening. That's right.",
      "id": "ep_5_ut_162"
    },
    {
      "end": 2598166,
      "speaker": "Enrico Bertini",
      "start": 2526664,
      "text": "I remember what I tried to do is that there are so many resources around that it's really, really hard to decide what to get right, and especially if you go on the web, but even if you just want to focus on books, there are so many right now that it's really hard to know where to start. So I have a few books that I think are really, really basic and they do not overlap too much. And for me, these books are, and I can tell you why I really like them. The first one is show me the numbers by Stephen Few. I learned so much from this book because it's basically only about very basic graphs, like bar charts, timelines, even tables and so on. But it helps you to understand how, what are the basic building blocks of visualization? If you don't master this first, it's really, really hard to do anything fancier that is also effective at the same time. So I think this is a really great introductory book from my point of view.",
      "id": "ep_5_ut_163"
    },
    {
      "end": 2601222,
      "speaker": "Andy Kirk",
      "start": 2598230,
      "text": "Yeah, that was my first book.",
      "id": "ep_5_ut_164"
    },
    {
      "end": 2602758,
      "speaker": "Enrico Bertini",
      "start": 2601398,
      "text": "Yeah. Okay, great.",
      "id": "ep_5_ut_165"
    },
    {
      "end": 2603834,
      "speaker": "Andy Kirk",
      "start": 2602926,
      "text": "There you go.",
      "id": "ep_5_ut_166"
    },
    {
      "end": 2606082,
      "speaker": "Moritz Stefaner",
      "start": 2604694,
      "text": "I never read it.",
      "id": "ep_5_ut_167"
    },
    {
      "end": 2610494,
      "speaker": "Andy Kirk",
      "start": 2606238,
      "text": "Oh, yeah, get off the line.",
      "id": "ep_5_ut_168"
    },
    {
      "end": 2614858,
      "speaker": "Enrico Bertini",
      "start": 2614194,
      "text": "Yeah.",
      "id": "ep_5_ut_169"
    },
    {
      "end": 2618454,
      "speaker": "Moritz Stefaner",
      "start": 2614986,
      "text": "The second book I read only books where I appear somewhere.",
      "id": "ep_5_ut_170"
    },
    {
      "end": 2627974,
      "speaker": "Andy Kirk",
      "start": 2624634,
      "text": "Yes, Cinderella, he doesn't even kill the book himself.",
      "id": "ep_5_ut_171"
    },
    {
      "end": 2642054,
      "speaker": "Enrico Bertini",
      "start": 2631614,
      "text": "So the second one is more academic is readings in information visualization, using vision to think. And that's a key.",
      "id": "ep_5_ut_172"
    },
    {
      "end": 2644918,
      "speaker": "Moritz Stefaner",
      "start": 2642174,
      "text": "I mean, but it's a bit dated, isn't it funny to say?",
      "id": "ep_5_ut_173"
    },
    {
      "end": 2679814,
      "speaker": "Enrico Bertini",
      "start": 2645006,
      "text": "It is, it is. It's a bit dated. But what I normally suggest is to start to read chapter one. And I think chapter one still is the best introduction to information visualization ever. Ever. You cannot go wrong with the first chapter there are so many basic principles summarized in a few pages that, I mean, it's really, it's the best you can get. If you want to start with something small, and it's a very solid foundation from the theoretical point of view, I think that's the best you can get.",
      "id": "ep_5_ut_174"
    },
    {
      "end": 2686362,
      "speaker": "Moritz Stefaner",
      "start": 2680314,
      "text": "Okay, could be, but maybe if I will have to see how. I think it was fairly expensive and.",
      "id": "ep_5_ut_175"
    },
    {
      "end": 2686850,
      "speaker": "Andy Kirk",
      "start": 2686378,
      "text": "You're not in it.",
      "id": "ep_5_ut_176"
    },
    {
      "end": 2695834,
      "speaker": "Moritz Stefaner",
      "start": 2686882,
      "text": "And just for that one chapter, and I mean, a big part of the book are classic papers, but I'm not sure how much they would help somebody who is now getting started.",
      "id": "ep_5_ut_177"
    },
    {
      "end": 2707466,
      "speaker": "Enrico Bertini",
      "start": 2695914,
      "text": "You know, it's a collection of paper, the rest is a collection of papers. And most, it's mostly outdated. Yeah, but the first, if they could publish only the first chapter, I think it would be really, really valuable.",
      "id": "ep_5_ut_178"
    },
    {
      "end": 2708974,
      "speaker": "Moritz Stefaner",
      "start": 2707570,
      "text": "Yeah, could be.",
      "id": "ep_5_ut_179"
    },
    {
      "end": 2716236,
      "speaker": "Enrico Bertini",
      "start": 2709634,
      "text": "And then, of course, you cannot not read at least one Tufte's book.",
      "id": "ep_5_ut_180"
    },
    {
      "end": 2717224,
      "speaker": "Moritz Stefaner",
      "start": 2716340,
      "text": "That's true.",
      "id": "ep_5_ut_181"
    },
    {
      "end": 2723964,
      "speaker": "Enrico Bertini",
      "start": 2717524,
      "text": "And I think the visual display of quantitative information is still the best. I mean, you cannot go wrong with that one.",
      "id": "ep_5_ut_182"
    },
    {
      "end": 2724660,
      "speaker": "Moritz Stefaner",
      "start": 2724004,
      "text": "Yeah, that's true.",
      "id": "ep_5_ut_183"
    },
    {
      "end": 2733424,
      "speaker": "Enrico Bertini",
      "start": 2724692,
      "text": "It's the most basic one. Basic principles, still not easy to read. I think every Tufte book is not an easy read at all.",
      "id": "ep_5_ut_184"
    },
    {
      "end": 2765654,
      "speaker": "Andy Kirk",
      "start": 2734044,
      "text": "And it's more, I guess, almost like a stream of conscience, isn't it? It's a set of ideas. I mean, you would, you wouldn't have that next to your computer and follow step by step what to do, but it's a reference for sticking a bookmark in different pages. This is a really great design concept that will transcend all tasks and just stick in your mind as a thing to remember and to recall as you go through the process. That's how I've used that book. It's a great book.",
      "id": "ep_5_ut_185"
    },
    {
      "end": 2815912,
      "speaker": "Enrico Bertini",
      "start": 2766834,
      "text": "Then the last one I would mention is information visualization, perception for design from calling Ware, which you mentioned already before in the podcast. Yeah, and that's the, I mean, if you want to have, and you have to have a solid foundation from the perceptual point of view, I mean, that's the book. If you really want to choose one book, that's the book. If you want to get serious about visualization, you have to read this book. And I have a small criticism about this book, or a kind of warning. In many cases, it's very hard. At least I found it hard to translate the content of this book in practical rules.",
      "id": "ep_5_ut_186"
    },
    {
      "end": 2830718,
      "speaker": "Moritz Stefaner",
      "start": 2816008,
      "text": "Exactly. Yeah. It's great to learn about all this background info, you know, and at some point then you go, aha, you know, during workouts and think back to it, but it's not really a guide. You know how to. How to do it, right?",
      "id": "ep_5_ut_187"
    },
    {
      "end": 2853070,
      "speaker": "Enrico Bertini",
      "start": 2830886,
      "text": "Yeah, yeah. It's not a guide, but it's important. And you get the feeling that once you know these things, everything is much more. Whatever you do in visualization is much more well reasoned. And you get. You acquired those skills that help you justifying the. Why you do things in a certain way.",
      "id": "ep_5_ut_188"
    },
    {
      "end": 2887114,
      "speaker": "Andy Kirk",
      "start": 2853182,
      "text": "Yeah, yeah. And I'm just looking through the books that I put up on the, on the site and it's such a, it's such a process of layering up your, your knowledge because I mean, you get the foundation stuff there. But I mean, you could also argue that there are elements of, as we've mentioned before, William Cleveland's book, visualising data, or even actually, I probably don't bother getting the book and just try and get. Track down the research paper that he did around 83, 84 with McGill.",
      "id": "ep_5_ut_189"
    },
    {
      "end": 2888414,
      "speaker": "Enrico Bertini",
      "start": 2887654,
      "text": "Yeah.",
      "id": "ep_5_ut_190"
    },
    {
      "end": 2920684,
      "speaker": "Andy Kirk",
      "start": 2888574,
      "text": "And then, you know, there's different perspectives that you can drop into. I've always got a lot out of books like Donald Norman's book and Bill Buxton, Alan McReach. And, you know, all these different perspectives that just reinforce messages or just bring a different kind of angle to things. Merlin Wilkinson Grammar, graphics. I mean, there are so many books out there. It's a wonderful kind of subject to get into if you've got an appetite for reading and consuming books.",
      "id": "ep_5_ut_191"
    },
    {
      "end": 2938740,
      "speaker": "Enrico Bertini",
      "start": 2924144,
      "text": "I must say that what is really interesting is that recently we also saw so new books came that are more about data visualization, that they have more practical angle.",
      "id": "ep_5_ut_192"
    },
    {
      "end": 2939156,
      "speaker": "Andy Kirk",
      "start": 2938812,
      "text": "Yeah.",
      "id": "ep_5_ut_193"
    },
    {
      "end": 2944180,
      "speaker": "Enrico Bertini",
      "start": 2939220,
      "text": "And I think that's. That's great, too. I mean, the book from Nathan Yao.",
      "id": "ep_5_ut_194"
    },
    {
      "end": 2944868,
      "speaker": "Andy Kirk",
      "start": 2944252,
      "text": "Yeah, that's.",
      "id": "ep_5_ut_195"
    },
    {
      "end": 2951084,
      "speaker": "Enrico Bertini",
      "start": 2944916,
      "text": "That's a great book. And also the other one, Noah, is it called please help me? Yeah.",
      "id": "ep_5_ut_196"
    },
    {
      "end": 2952892,
      "speaker": "Andy Kirk",
      "start": 2951164,
      "text": "Design data visualizations.",
      "id": "ep_5_ut_197"
    },
    {
      "end": 2953484,
      "speaker": "Enrico Bertini",
      "start": 2953068,
      "text": "Yeah.",
      "id": "ep_5_ut_198"
    },
    {
      "end": 2953716,
      "speaker": "Andy Kirk",
      "start": 2953524,
      "text": "Yes.",
      "id": "ep_5_ut_199"
    },
    {
      "end": 2962540,
      "speaker": "Enrico Bertini",
      "start": 2953740,
      "text": "These are two books that are much more practical, and I think they very nicely complement the more theoretical ones. And they are equally important.",
      "id": "ep_5_ut_200"
    },
    {
      "end": 2966412,
      "speaker": "Andy Kirk",
      "start": 2962732,
      "text": "Is it too shameless if I announce that I'm writing a book as well?",
      "id": "ep_5_ut_201"
    },
    {
      "end": 2970384,
      "speaker": "Enrico Bertini",
      "start": 2966588,
      "text": "Wow, that's a scoop, Moritz. We have a scoop.",
      "id": "ep_5_ut_202"
    },
    {
      "end": 2977148,
      "speaker": "Andy Kirk",
      "start": 2973564,
      "text": "Yes. Yes. I'm working on a book. Excellent.",
      "id": "ep_5_ut_203"
    },
    {
      "end": 2977652,
      "speaker": "Moritz Stefaner",
      "start": 2977276,
      "text": "Wow.",
      "id": "ep_5_ut_204"
    },
    {
      "end": 2979564,
      "speaker": "Andy Kirk",
      "start": 2977708,
      "text": "In fact, I'm potentially working on three.",
      "id": "ep_5_ut_205"
    },
    {
      "end": 2981624,
      "speaker": "Moritz Stefaner",
      "start": 2979604,
      "text": "What will it be about? Soccer.",
      "id": "ep_5_ut_206"
    },
    {
      "end": 2986144,
      "speaker": "Enrico Bertini",
      "start": 2982804,
      "text": "It's about British soccer.",
      "id": "ep_5_ut_207"
    },
    {
      "end": 2988784,
      "speaker": "Moritz Stefaner",
      "start": 2987404,
      "text": "Microbreweries.",
      "id": "ep_5_ut_208"
    },
    {
      "end": 3025074,
      "speaker": "Andy Kirk",
      "start": 2990264,
      "text": "It's. Yeah, it's color in between the lines, an introduction guide. But I guess it's going to be, in some respects similar to the sort of stuff that I do basically training around. So I'm going to leave it quite enigmatic and elusive and I'm just going to leave it there. But you know, I've plugged it and I'll keep people informed as things develop. But, yeah, it's an interesting challenge, actually translating knowledge into training and then training into a book format, because it's a completely different format.",
      "id": "ep_5_ut_209"
    },
    {
      "end": 3031954,
      "speaker": "Moritz Stefaner",
      "start": 3025654,
      "text": "And on training, you rely on the dialogue as well, interaction. And in the book, you're like talking to the ball.",
      "id": "ep_5_ut_210"
    },
    {
      "end": 3036614,
      "speaker": "Andy Kirk",
      "start": 3032654,
      "text": "That's it. And it's linear and it's so difficult. Yeah. Watch this space.",
      "id": "ep_5_ut_211"
    },
    {
      "end": 3039798,
      "speaker": "Moritz Stefaner",
      "start": 3036654,
      "text": "Anyway, but publisher or are you like.",
      "id": "ep_5_ut_212"
    },
    {
      "end": 3041034,
      "speaker": "Andy Kirk",
      "start": 3039886,
      "text": "Yeah, I've got a publisher.",
      "id": "ep_5_ut_213"
    },
    {
      "end": 3045258,
      "speaker": "Moritz Stefaner",
      "start": 3042334,
      "text": "Fantastic. Wow, wow, wow.",
      "id": "ep_5_ut_214"
    },
    {
      "end": 3046654,
      "speaker": "Enrico Bertini",
      "start": 3045386,
      "text": "We have a scoop.",
      "id": "ep_5_ut_215"
    },
    {
      "end": 3049538,
      "speaker": "Moritz Stefaner",
      "start": 3047074,
      "text": "Gonna be the best book ever.",
      "id": "ep_5_ut_216"
    },
    {
      "end": 3050814,
      "speaker": "Andy Kirk",
      "start": 3049706,
      "text": "Oh, my word.",
      "id": "ep_5_ut_217"
    },
    {
      "end": 3052682,
      "speaker": "Moritz Stefaner",
      "start": 3051354,
      "text": "Does it have pictures?",
      "id": "ep_5_ut_218"
    },
    {
      "end": 3053866,
      "speaker": "Andy Kirk",
      "start": 3052818,
      "text": "It will have pictures.",
      "id": "ep_5_ut_219"
    },
    {
      "end": 3054674,
      "speaker": "Moritz Stefaner",
      "start": 3053970,
      "text": "That's fantastic.",
      "id": "ep_5_ut_220"
    },
    {
      "end": 3060466,
      "speaker": "Andy Kirk",
      "start": 3054714,
      "text": "Not couple pictures. It'll have pictures. But I think. Is it going. Go ahead. Sorry.",
      "id": "ep_5_ut_221"
    },
    {
      "end": 3065066,
      "speaker": "Enrico Bertini",
      "start": 3060650,
      "text": "I hope it's not going to be another one of those table books that you never read.",
      "id": "ep_5_ut_222"
    },
    {
      "end": 3066658,
      "speaker": "Andy Kirk",
      "start": 3065250,
      "text": "A coffee table book? No.",
      "id": "ep_5_ut_223"
    },
    {
      "end": 3067538,
      "speaker": "Enrico Bertini",
      "start": 3066746,
      "text": "Coffee table book.",
      "id": "ep_5_ut_224"
    },
    {
      "end": 3073768,
      "speaker": "Andy Kirk",
      "start": 3067586,
      "text": "Yeah, no, it's actually, I think, going to be published as an ebook to start with. Okay.",
      "id": "ep_5_ut_225"
    },
    {
      "end": 3077216,
      "speaker": "Moritz Stefaner",
      "start": 3073816,
      "text": "Okay, great. Does it have an animal on the.",
      "id": "ep_5_ut_226"
    },
    {
      "end": 3084244,
      "speaker": "Andy Kirk",
      "start": 3077240,
      "text": "COVID No, there's no animals or crustaceans or any version of it.",
      "id": "ep_5_ut_227"
    },
    {
      "end": 3090016,
      "speaker": "Enrico Bertini",
      "start": 3084984,
      "text": "Do you want me and Moritz on the COVID On the back cover, maybe?",
      "id": "ep_5_ut_228"
    },
    {
      "end": 3092752,
      "speaker": "Andy Kirk",
      "start": 3090040,
      "text": "On the back cover, yeah. Peer reviewed people. Yeah.",
      "id": "ep_5_ut_229"
    },
    {
      "end": 3093752,
      "speaker": "Moritz Stefaner",
      "start": 3092928,
      "text": "Very small.",
      "id": "ep_5_ut_230"
    },
    {
      "end": 3124762,
      "speaker": "Andy Kirk",
      "start": 3093848,
      "text": "So. But, yeah, so, yeah, I mean, going back to the. This section, I mean, books is something that you can, you know, get from libraries and dive into and, you know, I think just not just myself and you, Enrico, I think George Georgie Camos did a post as well. So there are a lot of people out there sharing their experiences of what books have been important to them. So, yeah, it just goes back to the point about immersing yourself in the subject.",
      "id": "ep_5_ut_231"
    },
    {
      "end": 3142886,
      "speaker": "Moritz Stefaner",
      "start": 3124888,
      "text": "One thing that helped me a lot was I was at some point just googling for information visualization lecture PDF. And it's amazing, you know, because everybody puts their slides online. And so I went through Jeff Heer's slide, you know, and all some really good lecturers, this one.",
      "id": "ep_5_ut_232"
    },
    {
      "end": 3143150,
      "speaker": "Andy Kirk",
      "start": 3142910,
      "text": "Brilliant.",
      "id": "ep_5_ut_233"
    },
    {
      "end": 3158420,
      "speaker": "Moritz Stefaner",
      "start": 3143182,
      "text": "And then just followed up the references from there. So that was a great summary of what I should probably know. And, you know, and the other thing is on iTunes, you just Google for visualization. There's some complete visualization lectures online.",
      "id": "ep_5_ut_234"
    },
    {
      "end": 3159264,
      "speaker": "Andy Kirk",
      "start": 3158532,
      "text": "Yeah.",
      "id": "ep_5_ut_235"
    },
    {
      "end": 3161492,
      "speaker": "Moritz Stefaner",
      "start": 3159644,
      "text": "Some from Harvard, some from Stanford.",
      "id": "ep_5_ut_236"
    },
    {
      "end": 3162316,
      "speaker": "Andy Kirk",
      "start": 3161588,
      "text": "Yes, that's what it's saying.",
      "id": "ep_5_ut_237"
    },
    {
      "end": 3172532,
      "speaker": "Moritz Stefaner",
      "start": 3162340,
      "text": "I mean, it's a bit tedious to watch a university lecture that wasn't meant for video. But still, you can take a lot out of these and then you can.",
      "id": "ep_5_ut_238"
    },
    {
      "end": 3175956,
      "speaker": "Andy Kirk",
      "start": 3172548,
      "text": "Go online and get a full certificate and say you've passed a degree.",
      "id": "ep_5_ut_239"
    },
    {
      "end": 3182710,
      "speaker": "Moritz Stefaner",
      "start": 3176060,
      "text": "Yeah, they know they're now doing these math lectures for like hundreds of thousands of people. I mean, no info with one, but it might come.",
      "id": "ep_5_ut_240"
    },
    {
      "end": 3183850,
      "speaker": "Andy Kirk",
      "start": 3182852,
      "text": "It must come at some point.",
      "id": "ep_5_ut_241"
    },
    {
      "end": 3189338,
      "speaker": "Moritz Stefaner",
      "start": 3183882,
      "text": "Yeah, it must definitely come. So that's an amazing development, if you think about it.",
      "id": "ep_5_ut_242"
    },
    {
      "end": 3189986,
      "speaker": "Andy Kirk",
      "start": 3189386,
      "text": "Yeah.",
      "id": "ep_5_ut_243"
    },
    {
      "end": 3191534,
      "speaker": "Moritz Stefaner",
      "start": 3190130,
      "text": "Gotta love the Internet.",
      "id": "ep_5_ut_244"
    },
    {
      "end": 3193734,
      "speaker": "Andy Kirk",
      "start": 3192514,
      "text": "It's headstair.",
      "id": "ep_5_ut_245"
    },
    {
      "end": 3195874,
      "speaker": "Moritz Stefaner",
      "start": 3194794,
      "text": "I think it's gonna go.",
      "id": "ep_5_ut_246"
    },
    {
      "end": 3196934,
      "speaker": "Andy Kirk",
      "start": 3195954,
      "text": "It's got a future.",
      "id": "ep_5_ut_247"
    },
    {
      "end": 3204018,
      "speaker": "Enrico Bertini",
      "start": 3199114,
      "text": "And I think Tamara Munzner is going to write, publish a book.",
      "id": "ep_5_ut_248"
    },
    {
      "end": 3206578,
      "speaker": "Moritz Stefaner",
      "start": 3204066,
      "text": "She's writing on a book. Yeah, I've seen her draft.",
      "id": "ep_5_ut_249"
    },
    {
      "end": 3222284,
      "speaker": "Andy Kirk",
      "start": 3206666,
      "text": "And Alberto Cairo's got a book coming out. It's already out. He's translated into English. And there's some other people, and I can't remember who they are. Now, I didn't write about it, but it's. Yeah, it's a rich period for good quality books.",
      "id": "ep_5_ut_250"
    },
    {
      "end": 3270776,
      "speaker": "Enrico Bertini",
      "start": 3223864,
      "text": "So before we finish, do we want to mention a bit about how to learn the practice of visualization? I mean, I don't know. We have been discussing a little bit about how to acquire the basic knowledge, but let's assume that now you have this knowledge, how do you translate it into actually being able to design visualizations? Because it doesn't really come naturally from them. I mean, from my experience, I noticed that it's almost impossible to study visualization for hours and then directly translate what you learned into something that is really valuable. It's more of a craft.",
      "id": "ep_5_ut_251"
    },
    {
      "end": 3271136,
      "speaker": "Moritz Stefaner",
      "start": 3270840,
      "text": "Right.",
      "id": "ep_5_ut_252"
    },
    {
      "end": 3275240,
      "speaker": "Enrico Bertini",
      "start": 3271200,
      "text": "You really need to do it over and over to learn how to do it.",
      "id": "ep_5_ut_253"
    },
    {
      "end": 3300144,
      "speaker": "Moritz Stefaner",
      "start": 3275272,
      "text": "Well, yeah, I think you need to learn some programming language or some. You need to have some environment that is fairly, that's more than template based, you know. So I think you cannot just use Excel and try and use Excel. There's creative uses of Excel. Anyhow, I think you need to pick, just be it HTML or processing or whatever environment.",
      "id": "ep_5_ut_254"
    },
    {
      "end": 3326500,
      "speaker": "Andy Kirk",
      "start": 3300764,
      "text": "Actually, that's a good point, because we got another question from Lane Harrison, and he's a PhD student at UNC Charlotte. And he asked the question, which was, if I can find it, so what the pros and cons of DIY tools such as D3 processing versus system tools such as Tableau. So that's question to you, Moritz. Let's put it to you first.",
      "id": "ep_5_ut_255"
    },
    {
      "end": 3374172,
      "speaker": "Moritz Stefaner",
      "start": 3326692,
      "text": "Yeah, I mean, in a way, it's quite obvious. I mean, of course the boundaries are blurring, so every tool brings its assumption with it. Even D3 is not totally unconstrained. Right. But it's a bit more open what you can do there than, for instance, in Tableau. And of course, Tableau is a bit like on rails, right? There are certain things you cannot even do with certain data types because they don't make any sense. Yeah, well, you can make totally nonsensical stuff in D3 if you like. So with great power comes great responsibility. That's quite a thread. I think in order to make a really good visualization, you have to have that freedom of make also nonsensical stuff. And then, and I think it comes back. Use it power wisely.",
      "id": "ep_5_ut_256"
    },
    {
      "end": 3376372,
      "speaker": "Andy Kirk",
      "start": 3374268,
      "text": "Yeah. And it comes back to capability in time.",
      "id": "ep_5_ut_257"
    },
    {
      "end": 3397916,
      "speaker": "Moritz Stefaner",
      "start": 3376508,
      "text": "Yeah. You know, and thinking about encoding again, I think the encoding you choose, you know, that makes the visualization in the end, and you have to explicitly formulate that. So sometimes in Tableau, I'm not really sure, like, is he scaling the circles, you know, with the square or is it linear? Hmm.",
      "id": "ep_5_ut_258"
    },
    {
      "end": 3399060,
      "speaker": "Andy Kirk",
      "start": 3398020,
      "text": "I don't know.",
      "id": "ep_5_ut_259"
    },
    {
      "end": 3407520,
      "speaker": "Moritz Stefaner",
      "start": 3399252,
      "text": "It's like, let's measure it. But if I program it, I know, like what's the process from data to visual? And I think you should know if.",
      "id": "ep_5_ut_260"
    },
    {
      "end": 3408440,
      "speaker": "Andy Kirk",
      "start": 3407552,
      "text": "You, it's the control.",
      "id": "ep_5_ut_261"
    },
    {
      "end": 3419244,
      "speaker": "Moritz Stefaner",
      "start": 3408512,
      "text": "It's like, you know, if you're a chef and you're cooking, you don't use like premade food, you know, it's like, hello, please. You chop your carrots and you peel your.",
      "id": "ep_5_ut_262"
    },
    {
      "end": 3432464,
      "speaker": "Enrico Bertini",
      "start": 3420704,
      "text": "Can we suggest? So if a person wants to learn infobase, do you think there's no way to do it without knowing a little bit of programming?",
      "id": "ep_5_ut_263"
    },
    {
      "end": 3436664,
      "speaker": "Moritz Stefaner",
      "start": 3433124,
      "text": "Yeah, yeah, yeah, yeah, me too.",
      "id": "ep_5_ut_264"
    },
    {
      "end": 3444332,
      "speaker": "Enrico Bertini",
      "start": 3439604,
      "text": "That's a recurring question and I agree. I mean, but on the other hand.",
      "id": "ep_5_ut_265"
    },
    {
      "end": 3470826,
      "speaker": "Andy Kirk",
      "start": 3444508,
      "text": "Actually, can I take my answer back? I want to take my answer back because, well, I guess this is visualization. Yeah, I suppose if we expanded things to include things like infographics, but obviously there's a great deal of infographics that are done through illustration and, you know, obviously built on some sort of data or information. But yeah, I guess visualization, I mean, to fully unleash the power of a visualization, then programming languages is unfortunately a requirement.",
      "id": "ep_5_ut_266"
    },
    {
      "end": 3475610,
      "speaker": "Moritz Stefaner",
      "start": 3471010,
      "text": "Yeah, I mean, information graphics has been around before computers, so I mean, you know.",
      "id": "ep_5_ut_267"
    },
    {
      "end": 3480254,
      "speaker": "Andy Kirk",
      "start": 3475682,
      "text": "Yeah, so that sort of makes sense. William Playfair managed all right.",
      "id": "ep_5_ut_268"
    },
    {
      "end": 3484722,
      "speaker": "Moritz Stefaner",
      "start": 3481194,
      "text": "But I think if you talk about data visualization, it's like, it's quite clear.",
      "id": "ep_5_ut_269"
    },
    {
      "end": 3489810,
      "speaker": "Enrico Bertini",
      "start": 3484898,
      "text": "Yeah. But what I want to say at the same time is that you don't need to become a software engineer to do this.",
      "id": "ep_5_ut_270"
    },
    {
      "end": 3492454,
      "speaker": "Moritz Stefaner",
      "start": 3489882,
      "text": "No, you can totally like wing it.",
      "id": "ep_5_ut_271"
    },
    {
      "end": 3509290,
      "speaker": "Enrico Bertini",
      "start": 3493674,
      "text": "I mean, you can start with processing. I think it's really nice because it's not a too steep learning curve there. And not necessarily you have to learn every detail about Java. You can start with processing and see what happens. Right.",
      "id": "ep_5_ut_272"
    },
    {
      "end": 3524320,
      "speaker": "Andy Kirk",
      "start": 3509322,
      "text": "Well, that's interesting because I need to learn, and I've kind of lined up this summer to focus on one particular tool. So you both would say processing has got the more accessible routing versus d.",
      "id": "ep_5_ut_273"
    },
    {
      "end": 3527764,
      "speaker": "Moritz Stefaner",
      "start": 3524352,
      "text": "Three because of the lack of UI toolkits.",
      "id": "ep_5_ut_274"
    },
    {
      "end": 3528928,
      "speaker": "Andy Kirk",
      "start": 3528144,
      "text": "Okay.",
      "id": "ep_5_ut_275"
    },
    {
      "end": 3537424,
      "speaker": "Moritz Stefaner",
      "start": 3529056,
      "text": "Yeah. And so I think if you really want to do interactive stuff, processing is great if you have just one view in your application, but if you have like three different tabs.",
      "id": "ep_5_ut_276"
    },
    {
      "end": 3537998,
      "speaker": "Andy Kirk",
      "start": 3537504,
      "text": "Yeah.",
      "id": "ep_5_ut_277"
    },
    {
      "end": 3579910,
      "speaker": "Moritz Stefaner",
      "start": 3538096,
      "text": "And different controls and zooms and pans and whatever. It's a lot of work actually. So I think flash is the perfect environment. I think it's a bit tragic that it's going away because it was really made for visualization. So I'm really bummed here, but I think for fresh people, I would say build it inside the browser you have. HTML is fantastic and CSS and JavaScript is okay, but there's lots of libraries and the community counts. But I mean, processing would be my second choice, especially if you go more high definition and installations and cinematic effects and so on.",
      "id": "ep_5_ut_278"
    },
    {
      "end": 3580406,
      "speaker": "Andy Kirk",
      "start": 3580102,
      "text": "Yeah.",
      "id": "ep_5_ut_279"
    },
    {
      "end": 3584894,
      "speaker": "Enrico Bertini",
      "start": 3580430,
      "text": "And I think it's also a matter of the nice environment it provides.",
      "id": "ep_5_ut_280"
    },
    {
      "end": 3589590,
      "speaker": "Moritz Stefaner",
      "start": 3584934,
      "text": "I mean, there's a very active community, lots of source code around, lots of.",
      "id": "ep_5_ut_281"
    },
    {
      "end": 3596790,
      "speaker": "Enrico Bertini",
      "start": 3589622,
      "text": "Source code, lots of documentation, and then you basically, you install it, you run it and you can start writing code right away.",
      "id": "ep_5_ut_282"
    },
    {
      "end": 3610722,
      "speaker": "Moritz Stefaner",
      "start": 3596902,
      "text": "Yeah, yeah, yeah. And it's nice people around it. So, yeah, everybody active in the processing scene is really cool. And that, you're right, that makes a big difference. Yeah. Good, okay, let's do that.",
      "id": "ep_5_ut_283"
    },
    {
      "end": 3626562,
      "speaker": "Enrico Bertini",
      "start": 3610898,
      "text": "Let's do that. One last thing I wanted to mention about practice is another question that I always get is how do you find data and how do you.",
      "id": "ep_5_ut_284"
    },
    {
      "end": 3627098,
      "speaker": "Andy Kirk",
      "start": 3626738,
      "text": "Yeah.",
      "id": "ep_5_ut_285"
    },
    {
      "end": 3632706,
      "speaker": "Enrico Bertini",
      "start": 3627146,
      "text": "Find interesting problems. I think that's another big issue, especially for people who are just starting.",
      "id": "ep_5_ut_286"
    },
    {
      "end": 3633774,
      "speaker": "Moritz Stefaner",
      "start": 3632850,
      "text": "Big question.",
      "id": "ep_5_ut_287"
    },
    {
      "end": 3635354,
      "speaker": "Enrico Bertini",
      "start": 3634234,
      "text": "Yeah. What do you think?",
      "id": "ep_5_ut_288"
    },
    {
      "end": 3681594,
      "speaker": "Andy Kirk",
      "start": 3635434,
      "text": "There's plenty of problems going around, but I mean there are so many and growing in number sources of data, data market info, chimps, guardian data blog, you know, I guess it's whether or not these are the datasets that you particularly want to have a go with. But if you are just looking for something to practice on, as we said before, the value of the contests, there's usually perfect data sets prepared for you there and also a problem or a brief that comes with it. So they're great test environments to practice. But I mean, the amount of data on the web these days is just infinite, so you shouldn't struggle to find World bank data.",
      "id": "ep_5_ut_289"
    },
    {
      "end": 3727664,
      "speaker": "Moritz Stefaner",
      "start": 3683414,
      "text": "Two things I find always interesting, or where people don't think about so much, but there's a lot of stuff on your hard drive. And also, let's say, skype, your chat history is on your hard drive, so you could totally visualize that APIs. The other thing is you can also generate your own data sets. And I like that for teaching to say we started zero, first we generate a dataset because then you have to think about, okay, what do I actually measure? How do I measure, you know, what's the granularity? Isn't it redundant if I measure this, but that as well? I could just write down this one value because the other one depends on it and stuff like that. So I think that's a good exercise too, to think about how could I generate my own data?",
      "id": "ep_5_ut_290"
    },
    {
      "end": 3746838,
      "speaker": "Enrico Bertini",
      "start": 3728244,
      "text": "Yeah, I think that's a great advice, because if you have data that you care for first and you can really understand, then you have a huge advantage. It's a lot easier to create something that is meaningful and interesting and not, I don't know, obvious, right?",
      "id": "ep_5_ut_291"
    },
    {
      "end": 3748006,
      "speaker": "Moritz Stefaner",
      "start": 3747006,
      "text": "Yeah, exactly.",
      "id": "ep_5_ut_292"
    },
    {
      "end": 3787162,
      "speaker": "Andy Kirk",
      "start": 3748070,
      "text": "And I think just kind of closing the benefit of the practice angle down. You need to put your work out there. You need to let people evaluate it and critique it and feedback, because otherwise you kind of exist in that bubble of just you and the design and your own taste. And that's kind of good for only so far. So, you know, get a Tumblr blog, get a blog, get something going where you can publish the work and seek feedback from people in the field to kind of refine the skill. And that'll be where the practice actually comes alive. And that's where the experience will develop.",
      "id": "ep_5_ut_293"
    },
    {
      "end": 3788618,
      "speaker": "Moritz Stefaner",
      "start": 3787338,
      "text": "Yep, absolutely.",
      "id": "ep_5_ut_294"
    },
    {
      "end": 3819824,
      "speaker": "Enrico Bertini",
      "start": 3788746,
      "text": "I think that criticism has a big role in learning the how to do good visualization, because by seeing what other people do and having a critical eye and trying to think about what works and what doesn't work, it's really, really useful, especially at the beginning. There is the blog, the y axis, which I really, really like because it's totally devoted to very detailed criticism and constructive criticism, by the way, of anything.",
      "id": "ep_5_ut_295"
    },
    {
      "end": 3821744,
      "speaker": "Moritz Stefaner",
      "start": 3820124,
      "text": "And also very balanced, right?",
      "id": "ep_5_ut_296"
    },
    {
      "end": 3854014,
      "speaker": "Enrico Bertini",
      "start": 3821804,
      "text": "Yeah, very balanced. Very balanced. It's always mentioning good and bad things. And I think this is a perfect example of how you can acquire better skills in producing good visualizations, because first you have to understand what works and what doesn't work. And the best way is to look at what others do and also actively think about how would I redesign it in order to overcome these problems. And normally what you find is that as soon as you try to fix a problem, then you have another problem somewhere else. Right?",
      "id": "ep_5_ut_297"
    },
    {
      "end": 3855854,
      "speaker": "Moritz Stefaner",
      "start": 3854674,
      "text": "Then you have to.",
      "id": "ep_5_ut_298"
    },
    {
      "end": 3864346,
      "speaker": "Enrico Bertini",
      "start": 3856514,
      "text": "Yeah, I mean, you fix this problem and you and you create another problem. So I think it's important to go through this process.",
      "id": "ep_5_ut_299"
    },
    {
      "end": 3876834,
      "speaker": "Moritz Stefaner",
      "start": 3864450,
      "text": "Yeah. And also, everything is a trade off. So in the beginning, you often think like there's the perfect solution, but usually there isn't. So to live with these trade offs and basically it's all about picking the right trade off, you know?",
      "id": "ep_5_ut_300"
    },
    {
      "end": 3877546,
      "speaker": "Andy Kirk",
      "start": 3876914,
      "text": "That's right.",
      "id": "ep_5_ut_301"
    },
    {
      "end": 3879258,
      "speaker": "Moritz Stefaner",
      "start": 3877650,
      "text": "The least worst solution.",
      "id": "ep_5_ut_302"
    },
    {
      "end": 3894114,
      "speaker": "Andy Kirk",
      "start": 3879386,
      "text": "And I was. I had an email conversation with Jay Thorpe about the process that he went through for recent work for, I can't remember the magazine. Escape my mind. Popular science.",
      "id": "ep_5_ut_303"
    },
    {
      "end": 3894794,
      "speaker": "Moritz Stefaner",
      "start": 3894194,
      "text": "Popular science.",
      "id": "ep_5_ut_304"
    },
    {
      "end": 3910264,
      "speaker": "Andy Kirk",
      "start": 3894834,
      "text": "138 years of popular science. And what was interesting about what he revealed there was he conceded that his process is riddled with errors and blind alleys and things that don't go away. So, you know, even, even the best.",
      "id": "ep_5_ut_305"
    },
    {
      "end": 3911928,
      "speaker": "Moritz Stefaner",
      "start": 3910384,
      "text": "It's a sad profession.",
      "id": "ep_5_ut_306"
    },
    {
      "end": 3922160,
      "speaker": "Andy Kirk",
      "start": 3912096,
      "text": "Yes. It's pathetic. It's built on failure. Don't expect to get things right the first time because it's an iterative process.",
      "id": "ep_5_ut_307"
    },
    {
      "end": 3941704,
      "speaker": "Moritz Stefaner",
      "start": 3922232,
      "text": "But I'm constantly cursing during work. I mean, during the day. Yeah. Usually it's not fun. I mean, for others it's fun. Exactly. Maybe I should do that, like the live stream.",
      "id": "ep_5_ut_308"
    },
    {
      "end": 3944500,
      "speaker": "Andy Kirk",
      "start": 3943604,
      "text": "Wordly.",
      "id": "ep_5_ut_309"
    },
    {
      "end": 3957468,
      "speaker": "Moritz Stefaner",
      "start": 3944652,
      "text": "Maybe, maybe not. Yeah. Damn it. Stupid thing. Yeah. Anyhow, I think we're good. I mean, if now people don't know how to learn it, what else can.",
      "id": "ep_5_ut_310"
    },
    {
      "end": 3958532,
      "speaker": "Andy Kirk",
      "start": 3957516,
      "text": "What hope is there?",
      "id": "ep_5_ut_311"
    },
    {
      "end": 3964964,
      "speaker": "Moritz Stefaner",
      "start": 3958628,
      "text": "Yeah. Not that hard. I mean, come on.",
      "id": "ep_5_ut_312"
    },
    {
      "end": 3969480,
      "speaker": "Enrico Bertini",
      "start": 3967784,
      "text": "No, I think it's good to.",
      "id": "ep_5_ut_313"
    },
    {
      "end": 3972484,
      "speaker": "Moritz Stefaner",
      "start": 3969672,
      "text": "I mean, we just barely scratched the surface, but.",
      "id": "ep_5_ut_314"
    },
    {
      "end": 3980800,
      "speaker": "Enrico Bertini",
      "start": 3972824,
      "text": "Yeah, yeah, but we have some blog posts around and we will keep talking about these things in the future.",
      "id": "ep_5_ut_315"
    },
    {
      "end": 3982120,
      "speaker": "Moritz Stefaner",
      "start": 3980912,
      "text": "I believe so, too.",
      "id": "ep_5_ut_316"
    },
    {
      "end": 3984912,
      "speaker": "Enrico Bertini",
      "start": 3982272,
      "text": "Andy's book.",
      "id": "ep_5_ut_317"
    },
    {
      "end": 3989964,
      "speaker": "Moritz Stefaner",
      "start": 3984968,
      "text": "I'm so looking forward. I'm really curious now. Damn it. Wow.",
      "id": "ep_5_ut_318"
    },
    {
      "end": 3991206,
      "speaker": "Andy Kirk",
      "start": 3990454,
      "text": "I mean, it's.",
      "id": "ep_5_ut_319"
    },
    {
      "end": 3995422,
      "speaker": "Enrico Bertini",
      "start": 3991270,
      "text": "Maybe. Maybe the listeners won't believe it, but we didn't really know it.",
      "id": "ep_5_ut_320"
    },
    {
      "end": 3998030,
      "speaker": "Andy Kirk",
      "start": 3995558,
      "text": "That was a genuine scope.",
      "id": "ep_5_ut_321"
    },
    {
      "end": 4000214,
      "speaker": "Moritz Stefaner",
      "start": 3998222,
      "text": "I didn't even know. You should write, basically.",
      "id": "ep_5_ut_322"
    },
    {
      "end": 4001474,
      "speaker": "Andy Kirk",
      "start": 4000254,
      "text": "I can write. Yeah.",
      "id": "ep_5_ut_323"
    },
    {
      "end": 4004474,
      "speaker": "Enrico Bertini",
      "start": 4002214,
      "text": "Was it a present for us, Andy?",
      "id": "ep_5_ut_324"
    },
    {
      "end": 4008982,
      "speaker": "Andy Kirk",
      "start": 4004854,
      "text": "It was. It was the gift of being invited back to episode five.",
      "id": "ep_5_ut_325"
    },
    {
      "end": 4013094,
      "speaker": "Moritz Stefaner",
      "start": 4009118,
      "text": "Probably he just made it up and now he's, like, checking out publisher websites.",
      "id": "ep_5_ut_326"
    },
    {
      "end": 4016298,
      "speaker": "Andy Kirk",
      "start": 4013254,
      "text": "I'm just quickly writing about Google for.",
      "id": "ep_5_ut_327"
    },
    {
      "end": 4019842,
      "speaker": "Moritz Stefaner",
      "start": 4016346,
      "text": "Free online books publishing. Ghostwriter.",
      "id": "ep_5_ut_328"
    },
    {
      "end": 4024146,
      "speaker": "Andy Kirk",
      "start": 4019938,
      "text": "Quick insert author name. Yes, exactly.",
      "id": "ep_5_ut_329"
    },
    {
      "end": 4027334,
      "speaker": "Moritz Stefaner",
      "start": 4024290,
      "text": "And now pick a cover for your so called book.",
      "id": "ep_5_ut_330"
    },
    {
      "end": 4031282,
      "speaker": "Andy Kirk",
      "start": 4029714,
      "text": "It will come, it will arrive.",
      "id": "ep_5_ut_331"
    },
    {
      "end": 4037454,
      "speaker": "Moritz Stefaner",
      "start": 4031378,
      "text": "Don't worry. I'm totally looking forward to that. Good. Yeah.",
      "id": "ep_5_ut_332"
    },
    {
      "end": 4040242,
      "speaker": "Enrico Bertini",
      "start": 4038714,
      "text": "More, Moritz?",
      "id": "ep_5_ut_333"
    },
    {
      "end": 4056944,
      "speaker": "Moritz Stefaner",
      "start": 4040338,
      "text": "Yes, I'm looking forward to c conference, by the way, which is in nine days or something. So if you're in Germany, pick a ticket. I think there are still tickets available. There will be Emmanuel Lima, Stephanie Posavec and on Sunday, we'll do a little workshop c with some of the speakers.",
      "id": "ep_5_ut_334"
    },
    {
      "end": 4058348,
      "speaker": "Enrico Bertini",
      "start": 4057684,
      "text": "That's great.",
      "id": "ep_5_ut_335"
    },
    {
      "end": 4058812,
      "speaker": "Moritz Stefaner",
      "start": 4058396,
      "text": "Yeah.",
      "id": "ep_5_ut_336"
    },
    {
      "end": 4060516,
      "speaker": "Enrico Bertini",
      "start": 4058908,
      "text": "One of my students is coming.",
      "id": "ep_5_ut_337"
    },
    {
      "end": 4061868,
      "speaker": "Moritz Stefaner",
      "start": 4060660,
      "text": "Oh, that's nice.",
      "id": "ep_5_ut_338"
    },
    {
      "end": 4063140,
      "speaker": "Enrico Bertini",
      "start": 4062036,
      "text": "Yeah, that's nice.",
      "id": "ep_5_ut_339"
    },
    {
      "end": 4070952,
      "speaker": "Andy Kirk",
      "start": 4063292,
      "text": "There's some big names there. I understand. There's young Willem. There's Gregor on the workshop.",
      "id": "ep_5_ut_340"
    },
    {
      "end": 4072512,
      "speaker": "Moritz Stefaner",
      "start": 4071008,
      "text": "Yeah, everybody.",
      "id": "ep_5_ut_341"
    },
    {
      "end": 4073664,
      "speaker": "Andy Kirk",
      "start": 4072648,
      "text": "The who's who.",
      "id": "ep_5_ut_342"
    },
    {
      "end": 4077288,
      "speaker": "Moritz Stefaner",
      "start": 4073784,
      "text": "Benny, moon widow care. Yeah, yeah, yeah. It's gonna be great.",
      "id": "ep_5_ut_343"
    },
    {
      "end": 4078284,
      "speaker": "Andy Kirk",
      "start": 4077336,
      "text": "Paulo going?",
      "id": "ep_5_ut_344"
    },
    {
      "end": 4081776,
      "speaker": "Moritz Stefaner",
      "start": 4079224,
      "text": "No, I think he has some other obligations.",
      "id": "ep_5_ut_345"
    },
    {
      "end": 4087272,
      "speaker": "Andy Kirk",
      "start": 4081880,
      "text": "Okay. So. But it's a good. It's a good lineup. So if you're in the neighborhood, drop in.",
      "id": "ep_5_ut_346"
    },
    {
      "end": 4095932,
      "speaker": "Moritz Stefaner",
      "start": 4087408,
      "text": "Yeah. In the neighborhood means, like, around thousand miles in the flight there without changing flow.",
      "id": "ep_5_ut_347"
    },
    {
      "end": 4106244,
      "speaker": "Andy Kirk",
      "start": 4096028,
      "text": "That's the way I view Europe. It's just one big neighborhood. So that's training, is it not? That's the end of the training.",
      "id": "ep_5_ut_348"
    },
    {
      "end": 4108304,
      "speaker": "Moritz Stefaner",
      "start": 4106284,
      "text": "It is. It is, most definitely.",
      "id": "ep_5_ut_349"
    },
    {
      "end": 4110580,
      "speaker": "Andy Kirk",
      "start": 4108724,
      "text": "So it was really interesting.",
      "id": "ep_5_ut_350"
    },
    {
      "end": 4118060,
      "speaker": "Moritz Stefaner",
      "start": 4110652,
      "text": "And, I mean, we could do this, I think, every week, basically, but, yeah. So much to learn. Yeah.",
      "id": "ep_5_ut_351"
    },
    {
      "end": 4118704,
      "speaker": "Andy Kirk",
      "start": 4118092,
      "text": "Yeah.",
      "id": "ep_5_ut_352"
    },
    {
      "end": 4126193,
      "speaker": "Enrico Bertini",
      "start": 4119404,
      "text": "Okay, guys, so I think. I think we have to cut it here. We have been talking for three days.",
      "id": "ep_5_ut_353"
    },
    {
      "end": 4130833,
      "speaker": "Moritz Stefaner",
      "start": 4126493,
      "text": "It's always with the Andy. Always with the talking. Yeah, yeah, yeah.",
      "id": "ep_5_ut_354"
    },
    {
      "end": 4137165,
      "speaker": "Andy Kirk",
      "start": 4131813,
      "text": "It's a bonus. Bonus material. We'll publish the outtakes as well, shall we?",
      "id": "ep_5_ut_355"
    },
    {
      "end": 4144829,
      "speaker": "Moritz Stefaner",
      "start": 4137229,
      "text": "Bonus for one. Okay, guys. Yeah. So it was great to have you.",
      "id": "ep_5_ut_356"
    },
    {
      "end": 4151794,
      "speaker": "Enrico Bertini",
      "start": 4144941,
      "text": "Thank you very much, Andy. Thanks a lot. I mean, it's great having you here.",
      "id": "ep_5_ut_357"
    },
    {
      "end": 4154970,
      "speaker": "Moritz Stefaner",
      "start": 4151954,
      "text": "We'll have you again when you have your so called book out, okay?",
      "id": "ep_5_ut_358"
    },
    {
      "end": 4156294,
      "speaker": "Andy Kirk",
      "start": 4155082,
      "text": "Yeah, of course.",
      "id": "ep_5_ut_359"
    },
    {
      "end": 4158894,
      "speaker": "Enrico Bertini",
      "start": 4157754,
      "text": "Absolutely.",
      "id": "ep_5_ut_360"
    },
    {
      "end": 4161490,
      "speaker": "Moritz Stefaner",
      "start": 4159594,
      "text": "Okie doke. It was great having you.",
      "id": "ep_5_ut_361"
    },
    {
      "end": 4164866,
      "speaker": "Enrico Bertini",
      "start": 4161562,
      "text": "Thank you. Plans for Moritz?",
      "id": "ep_5_ut_362"
    },
    {
      "end": 4165938,
      "speaker": "Moritz Stefaner",
      "start": 4164930,
      "text": "Do we have a plan?",
      "id": "ep_5_ut_363"
    },
    {
      "end": 4171114,
      "speaker": "Enrico Bertini",
      "start": 4166106,
      "text": "I think we have a plan for having the next episode on color.",
      "id": "ep_5_ut_364"
    },
    {
      "end": 4186521,
      "speaker": "Moritz Stefaner",
      "start": 4171194,
      "text": "The color show. Yeah. I hope we can do the next one. We want to have a very special guest on colors. But if we manage to do that, then the next one should be on color, I think. Yeah, because color is a good topic. Otherwise, we just make something up and go with it.",
      "id": "ep_5_ut_365"
    },
    {
      "end": 4188373,
      "speaker": "Andy Kirk",
      "start": 4186617,
      "text": "Eddie. Probably from Mister Tuft.",
      "id": "ep_5_ut_366"
    },
    {
      "end": 4194625,
      "speaker": "Moritz Stefaner",
      "start": 4189513,
      "text": "Eddie. Yeah. Why not? But he's not great in color. He's more like a black and white guy.",
      "id": "ep_5_ut_367"
    },
    {
      "end": 4197213,
      "speaker": "Andy Kirk",
      "start": 4194769,
      "text": "I'll tell you what you need for colour. You need Nigel blue.",
      "id": "ep_5_ut_368"
    },
    {
      "end": 4202853,
      "speaker": "Moritz Stefaner",
      "start": 4197793,
      "text": "Oh, good point. Yeah. At least, like, make one statement in between.",
      "id": "ep_5_ut_369"
    },
    {
      "end": 4205006,
      "speaker": "Andy Kirk",
      "start": 4203374,
      "text": "It might be a limited discussion, but.",
      "id": "ep_5_ut_370"
    },
    {
      "end": 4221638,
      "speaker": "Moritz Stefaner",
      "start": 4205110,
      "text": "Yeah, I mean, yeah, he can only talk about color, not colors, but color theory. Yeah, color theory. That might work with him. No, it might be an option, too. It's a good point. Yeah, we can see.",
      "id": "ep_5_ut_371"
    },
    {
      "end": 4222374,
      "speaker": "Andy Kirk",
      "start": 4221726,
      "text": "Okay.",
      "id": "ep_5_ut_372"
    },
    {
      "end": 4226190,
      "speaker": "Moritz Stefaner",
      "start": 4222494,
      "text": "Okay. Okay, guys, have a great time.",
      "id": "ep_5_ut_373"
    },
    {
      "end": 4228406,
      "speaker": "Andy Kirk",
      "start": 4226262,
      "text": "Enjoy your week. See you later. Bye.",
      "id": "ep_5_ut_374"
    }
  ],
  "confidence": 0.908099334373851,
  "audio_duration": 4238,
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_status_code": null,
  "webhook_auth": false,
  "webhook_auth_header_name": null,
  "speed_boost": false,
  "auto_highlights_result": null,
  "auto_highlights": false,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_audio_quality": null,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "content_safety": false,
  "iab_categories": true,
  "content_safety_labels": {
    "status": "unavailable",
    "results": [],
    "summary": {}
  },
  "language_detection": false,
  "language_detection_threshold": null,
  "language_confidence": null,
  "custom_spelling": null,
  "throttled": false,
  "auto_chapters": true,
  "summarization": false,
  "summary_type": null,
  "summary_model": null,
  "custom_topics": false,
  "topics": [],
  "speech_threshold": null,
  "speech_model": "best",
  "chapters": [
    {
      "summary": "Enrico opens data stories number five with Moritz and Andy Kirk. It's typical of England in April with rain and hot temperatures. Exciting times for biz. But now it's especially exciting times.",
      "gist": "Data Stories",
      "headline": "Enrico from data stories number five joins us this evening",
      "start": 5240,
      "end": 73574,
      "id": "ep_5_ch_0"
    },
    {
      "summary": "Today we are going to talk a hot topic, which is how to learn visualization. It's notoriously quite hard to learn because it's very multidisciplinary. People coming to the courses represent the full spectrum of industries and organisation types.",
      "gist": "How to learn Visualisation",
      "headline": "How to learn visualization is notoriously difficult because it's multidisciplinary",
      "start": 74114,
      "end": 189844,
      "id": "ep_5_ch_1"
    },
    {
      "summary": "The convergence of all these traditionally diverse skills is something that's a challenge not just for people to pick up, but also when you're trying to conceive and structure and sequence a training course. There will always be something in this field to train.",
      "gist": "Teaching multimedia: the challenge",
      "headline": "The convergence of all these traditionally diverse skills is a challenge for training courses",
      "start": 190524,
      "end": 370244,
      "id": "ep_5_ch_2"
    },
    {
      "summary": "Andy: There are so many areas that a person should be able to cover. You have to know about computers, humans, data, the design process itself is really, really broad. What is the area that people have most problems with that they have a hard time to cover?",
      "gist": "The Biggest Gap",
      "headline": "Andy says the design process itself is really, really broad",
      "start": 371864,
      "end": 739524,
      "id": "ep_5_ch_3"
    },
    {
      "summary": "Biggest gap for Dataviz newbies is needing a question before going further. Moritz: It's such a cliche to say every infographic, every visualization needs a central question. Historically visualization has been used for exploratory data analysis. But at some point, maybe a topic will emerge, perhaps rather than a question.",
      "gist": "Dataviz Newbies: Need a Question",
      "headline": "Biggest gap for Dataviz newbies is needing a question before going further",
      "start": 741704,
      "end": 942194,
      "id": "ep_5_ch_4"
    },
    {
      "summary": "The basic thing you should know is how visual variables work. Also, basic perception rules. The Gestalt laws are obviously very important. Everything has to be justified, reasoned, deliberate and explainable. The best designers have a sense of an interesting angle.",
      "gist": "What is the basic skill required for visualization?",
      "headline": "Starting from studying visualization, what do you think is the most important body of knowledge",
      "start": 942814,
      "end": 1417754,
      "id": "ep_5_ch_5"
    },
    {
      "summary": "There are so many nuances to color that you can't just get away with throwing any color together. What I find really important is this idea of to have a repertoire of metaphors as well. And then obviously you need in terms of knowledge to clearly move on to tools and software and programming.",
      "gist": "Colour and the knowledge of it",
      "headline": "Connie Malud: Everyone should know about color",
      "start": 1418614,
      "end": 1728814,
      "id": "ep_5_ch_6"
    },
    {
      "summary": "Interaction plays a very, very. Large role and it has to be used really well. Knowing when to finish, knowing when have you got to the point of, you know, there's nothing more to do on this piece, but how do you learn?",
      "gist": "Interactivity in Data Visualization",
      "headline": "Interaction plays a large role in visualization and it has to be used well",
      "start": 1729154,
      "end": 2132758,
      "id": "ep_5_ch_7"
    },
    {
      "summary": "It's revealing that there is so little formal education on these things. If you like data visualization, it's not easy to understand what kind of faculty you would have to go to. There are so many options. Where would you pitch it?",
      "gist": "Choosing the right degree for visualization",
      "headline": "Moritz: There is very little formal education on data visualization",
      "start": 2132886,
      "end": 2489804,
      "id": "ep_5_ch_8"
    },
    {
      "summary": "For self teaching, what would you recommend? Are there any good lectures, books? How would you go about. What I normally suggest is to start to read chapter one. It's the best introduction to information visualization ever.",
      "gist": "Self-Teaching in Information Visualization",
      "headline": "So for self teaching, what would you recommend? Are there any good lectures, books",
      "start": 2491624,
      "end": 2765654,
      "id": "ep_5_ch_9"
    },
    {
      "summary": "If you want to get serious about visualization, you have to read this book. In many cases, it's very hard to translate the content of this book in practical rules. Recently we also saw so new books came that are more about data visualization, that they have more practical angle.",
      "gist": "The book about data visualization: Magic Words",
      "headline": "If you want to get serious about visualization, you have to read this book",
      "start": 2766834,
      "end": 2962540,
      "id": "ep_5_ch_10"
    },
    {
      "summary": "I'm working on a book. In fact, I'm potentially working on three. What will it be about? Soccer. Microbreweries. Going to be published as an ebook to start with. Gonna be the best book ever.",
      "gist": "I'm writing a book about visualization",
      "headline": "I'm working on a book about soccer. In fact, I'm potentially working on three",
      "start": 2962732,
      "end": 3233304,
      "id": "ep_5_ch_11"
    },
    {
      "summary": "It's almost impossible to study visualization for hours and then directly translate what you learned into something that is really valuable. You need to learn some programming language or some environment that is fairly, that's more than template based.",
      "gist": "How to Develop a Visualization Style",
      "headline": "How do you translate basic knowledge into actually being able to design visualizations",
      "start": 3233384,
      "end": 3300144,
      "id": "ep_5_ch_12"
    },
    {
      "summary": "D3 processing has got the more accessible routing versus D3 because of the lack of UI toolkits. To fully unleash the power of a visualization, programming languages are unfortunately a requirement.",
      "gist": "D3 vs. Tableau",
      "headline": "Moritz: What are pros and cons of DIY tools for visualization",
      "start": 3300764,
      "end": 3612014,
      "id": "ep_5_ch_13"
    },
    {
      "summary": "The amount of data on the web these days is just infinite, so you shouldn't struggle to find World bank data. The other thing is you can also generate your own data sets. Criticism has a big role in learning the how to do good visualization.",
      "gist": "How do you find data for visualization?",
      "headline": "One last thing I wanted to mention about practice is how do you find data",
      "start": 3615714,
      "end": 3879258,
      "id": "ep_5_ch_14"
    },
    {
      "summary": "Moritz: I'm looking forward to c conference, by the way, which is in nine days. If you're in Germany, pick a ticket. Now pick a cover for your so called book. It will come, it will arrive.",
      "gist": "Writing in the World",
      "headline": "Moritz: I'm looking forward to c conference in Germany next week",
      "start": 3879386,
      "end": 4104944,
      "id": "ep_5_ch_15"
    },
    {
      "summary": "That's the end of the training. It is. And, I mean, we could do this, I think, every week, basically, but, yeah. So much to learn.",
      "gist": "Trainers at the Olympics",
      "headline": "That's the end of the training. Yeah. So much to learn. And, I mean, we could do this, I think, every",
      "start": 4105324,
      "end": 4118704,
      "id": "ep_5_ch_16"
    },
    {
      "summary": "It was great having you here. We'll have you again when you have your so called book out, okay? Yeah, of course. Okie doke. Bonus material. We will publish the outtakes as well.",
      "gist": "Andy Hadley on Talking",
      "headline": "Andy, it was great having you here. We'll publish the outtakes as well, shall we",
      "start": 4119404,
      "end": 4162374,
      "id": "ep_5_ch_17"
    },
    {
      "summary": "Next episode should be on color. We want to have a very special guest on colors. Probably from Mister Tuft. He's not great in color. You need Nigel blue. At least, like, make one statement in between.",
      "gist": "Next episode: On Colors",
      "headline": "The next episode should be on color, I think",
      "start": 4162874,
      "end": 4228406,
      "id": "ep_5_ch_18"
    }
  ],
  "disfluencies": false,
  "entity_detection": false,
  "sentiment_analysis": false,
  "sentiment_analysis_results": null,
  "entities": null,
  "speakers_expected": null,
  "summary": null,
  "custom_topics_results": null,
  "episode_num": 5,
  "episode_metadata": {
    "speakers": [
      "Moritz Stefaner",
      "Enrico Bertini",
      "Andy Kirk"
    ],
    "WPid": "106",
    "url": "https://datastori.es/podlove/file/206/s/feed/c/mp3/datastories-05.mp3",
    "episode_title": "How To Learn Data Visualization (with Andy Kirk)"
  }
}