{
  "id": "4326974d-485b-4342-84a3-91c8e20ac668",
  "language_model": "assemblyai_default",
  "acoustic_model": "assemblyai_default",
  "language_code": "en_us",
  "status": "completed",
  "audio_url": "https://datastori.es/podlove/file/170/s/feed/c/mp3/Datastories-14.mp3",
  "utterances": [
    {
      "end": 59222,
      "speaker": "Various",
      "start": 23080,
      "text": "When data stories hangout. This time I'm here with the ten people. Yeah, it's crazy. I'm here with too many people. Let me see. 123-45-6789 and ten, which is the maximum? Probably there are more people waiting on the list, actually. You are all muted. You cannot speak. Nobody can hear you. We will try to unmute you all by going through the list. Okay, so it's an experiment. We don't know what is gonna happen. Moritz.",
      "id": "ep_14_ut_0"
    },
    {
      "end": 59878,
      "speaker": "B",
      "start": 59398,
      "text": "No.",
      "id": "ep_14_ut_1"
    },
    {
      "end": 74942,
      "speaker": "Various",
      "start": 59966,
      "text": "And let's just do it and see. So who do we unmute first? You can raise your hand. The first one is raising the hand. Raise your hand. Raise your hand. Okay, we choose. Okay. Kim, Kim, Kim.",
      "id": "ep_14_ut_2"
    },
    {
      "end": 81038,
      "speaker": "B",
      "start": 75118,
      "text": "Excellent. But you have to do it yourself. Yeah. Otherwise it doesn't work. Kim Santiago is here.",
      "id": "ep_14_ut_3"
    },
    {
      "end": 83422,
      "speaker": "Various",
      "start": 81206,
      "text": "Okay, great. Hi, Kim. How are you?",
      "id": "ep_14_ut_4"
    },
    {
      "end": 85108,
      "speaker": "C",
      "start": 83558,
      "text": "Good, good. How are you guys doing?",
      "id": "ep_14_ut_5"
    },
    {
      "end": 86604,
      "speaker": "Various",
      "start": 85276,
      "text": "Nice to see you.",
      "id": "ep_14_ut_6"
    },
    {
      "end": 88340,
      "speaker": "C",
      "start": 86764,
      "text": "Yes, likewise.",
      "id": "ep_14_ut_7"
    },
    {
      "end": 90584,
      "speaker": "Various",
      "start": 88532,
      "text": "Yeah. How is it going?",
      "id": "ep_14_ut_8"
    },
    {
      "end": 92652,
      "speaker": "C",
      "start": 90884,
      "text": "Good. Are you in New York now?",
      "id": "ep_14_ut_9"
    },
    {
      "end": 101412,
      "speaker": "Various",
      "start": 92828,
      "text": "I'm in New York, yeah. All right, let's see if I can show you some Brooklyn here. Yeah, well, not much here. Okay.",
      "id": "ep_14_ut_10"
    },
    {
      "end": 103212,
      "speaker": "B",
      "start": 101468,
      "text": "Original Brooklyn windows.",
      "id": "ep_14_ut_11"
    },
    {
      "end": 108804,
      "speaker": "Various",
      "start": 103348,
      "text": "Yeah, you cannot see it, but I swear it's Brooklyn. Please believe me.",
      "id": "ep_14_ut_12"
    },
    {
      "end": 111980,
      "speaker": "B",
      "start": 108884,
      "text": "It's just a big photo. Actually, he is somewhere in.",
      "id": "ep_14_ut_13"
    },
    {
      "end": 114184,
      "speaker": "Various",
      "start": 112092,
      "text": "Yeah, I'm still in. I'm in Rome, actually.",
      "id": "ep_14_ut_14"
    },
    {
      "end": 125654,
      "speaker": "B",
      "start": 116594,
      "text": "So maybe we should introduce Kim. Kim is a partner at periscopic data visualization boutique in Portland.",
      "id": "ep_14_ut_15"
    },
    {
      "end": 128418,
      "speaker": "C",
      "start": 127154,
      "text": "That is correct.",
      "id": "ep_14_ut_16"
    },
    {
      "end": 130254,
      "speaker": "Various",
      "start": 128586,
      "text": "So what are you up to?",
      "id": "ep_14_ut_17"
    },
    {
      "end": 167248,
      "speaker": "C",
      "start": 131594,
      "text": "We just finished up a project for the Hewlett foundation, which was a lot of fun. I don't have the link off the top because I just jumped in this as I saw it pop up on Google. But you can go to our website, periscopic.com and see our latest stuff. So the. It was sort of an exploration of all of the grants they've made over the past twelve years, which is about $4 billion, which was interesting. Yeah. So that was a fun one. And I just got back from the visualized conference in New York.",
      "id": "ep_14_ut_18"
    },
    {
      "end": 168776,
      "speaker": "Various",
      "start": 167336,
      "text": "Great. How was it?",
      "id": "ep_14_ut_19"
    },
    {
      "end": 208062,
      "speaker": "C",
      "start": 168880,
      "text": "It was great. It was a lot of fun. Just, you know, it was. It's amazing to me how many people I still have yet to meet in the field. Everyone from Twitter I've known forever, but, you know, finally still meeting some of them. But some really fantastic talks. I know that they are. They're going to be putting up some of the videos soon, so I strongly encourage people to check them out. There were some really beautiful, some really emotional talks as well. You know, just people who are bringing their own sort of life stories into what they do and their process. It was really, really well done.",
      "id": "ep_14_ut_20"
    },
    {
      "end": 218334,
      "speaker": "B",
      "start": 208238,
      "text": "Okay, what was your highlight, apart from Santiago and Benjamin? Out of competition, of course.",
      "id": "ep_14_ut_21"
    },
    {
      "end": 264364,
      "speaker": "C",
      "start": 218414,
      "text": "Out of competition, aside from the conference, I actually had this really beautiful encounter with Benjamin and Christian, which was just total happenstance. They happened to be having a lunch with Ann Kirkat Dinandoluca, and so I popped in with them. We're sitting there, and we're facing the window, and this poor young woman walks by with a bunch of blueprints in her hand, just as a huge gust of wind kicks up and blows all of her blueprints all over this Manhattan street. Just this whirlwind of papers. And Christian and Benjamin run outside and quickly gather all the papers up and rush this poor woman into Dina de Luca.",
      "id": "ep_14_ut_22"
    },
    {
      "end": 267352,
      "speaker": "D",
      "start": 265744,
      "text": "It was like a movie scene.",
      "id": "ep_14_ut_23"
    },
    {
      "end": 313754,
      "speaker": "C",
      "start": 267408,
      "text": "Yeah, it was. It was absolutely beautiful, but it sort of. In it. But it was really interesting to me because I was later interviewed by Vish Dalton, the publisher, and, you know, they were asking about the conference, and I was saying, remarking that it's such a fantastic community. I've never been a part of a professional community that is more welcoming and more generous and more wonderful, you know, and so, like, that little. That little encounter was just sort of, you know, showed how wonderful the community can be and just how nice everyone has them. So I had a great time. And then they threw a great party, too, which was a lot of fun.",
      "id": "ep_14_ut_24"
    },
    {
      "end": 320366,
      "speaker": "Various",
      "start": 315014,
      "text": "Great, great. I was actually planning to come to the party, but I couldn't. I had a flu.",
      "id": "ep_14_ut_25"
    },
    {
      "end": 370644,
      "speaker": "C",
      "start": 320550,
      "text": "Oh, but Santiago, you said besides Santiago, besides Benjamin, which were both fantastic, I have to say. And just seeing them present their work in person was, you know, they were the highlight. Santiago was the people's choice, which was awesome. It came up there with Rockstar, which is really great. And, I don't know, some of the other ones that were fantastic. I had never seen Xiahuang present before, and he gave a really beautiful talk. It was a very poetic Benjamin showing me. So, yeah, it was a lot of fun.",
      "id": "ep_14_ut_26"
    },
    {
      "end": 386184,
      "speaker": "Various",
      "start": 371264,
      "text": "Santiago and Benjamin, can you briefly say, what did you present at visualize? I'm trying to unmute you in the meantime, but you have to unmute yourself. Yeah, go. You have to unmute yourself.",
      "id": "ep_14_ut_27"
    },
    {
      "end": 389076,
      "speaker": "B",
      "start": 387364,
      "text": "Click the red microphone.",
      "id": "ep_14_ut_28"
    },
    {
      "end": 390180,
      "speaker": "E",
      "start": 389260,
      "text": "Okay.",
      "id": "ep_14_ut_29"
    },
    {
      "end": 391804,
      "speaker": "Various",
      "start": 390372,
      "text": "Yeah, you can hear Ben.",
      "id": "ep_14_ut_30"
    },
    {
      "end": 447994,
      "speaker": "E",
      "start": 391884,
      "text": "Okay. So I presented basically an analysis of our own process. So I talked through, like, pages of CSV files that we tracked our own time on data visualization projects. So I wanted to find out, how much time do we spend on different activities throughout the development and design cycle of a data visualization project? So it was kind of meta because I created visualizations out of data that I tracked during visualization project. That was one of the parts. And by that I explained a few challenges, so to speak, that we ran into so like difficulties to where we struggled with data, where we struggled with getting approval, where we struggle with getting physical sensors in place, stuff like that.",
      "id": "ep_14_ut_31"
    },
    {
      "end": 455874,
      "speaker": "Various",
      "start": 448614,
      "text": "Going on with data visualization. Go ahead. I don't know, it's some nice.",
      "id": "ep_14_ut_32"
    },
    {
      "end": 554912,
      "speaker": "E",
      "start": 456254,
      "text": "Okay. And the other part was completely lost, the train of thought. Now, the other part was, I made an investigation and contacted a lot of people who work in that field to ask about how they approach their projects and to understand their process that they go through. And I got really a lot of responses from a whole lot of people actually, that were at the conference. And so I again made an analysis of their process and tried to distill some sort of visualization process framework out of it, if you will. I concluded ten different phases that I found shared by most of the practitioners. I started to describe it a little bit, but it was all a very rough sketch of such a framework. And now on my flight back, I thought a little bit harder about it. And if we could actually bring it in some form, that would make actually sense, and that would actually distinguish between circles, phases, activities, and methods. And circles are basically two iterative circles that I see shared among most practitioners. Phases are, of course, the more typical phases that you would know. Activities are the steps that you go through in each phase, and then methods are applied for certain activities. So it's a concept still in the very rough version.",
      "id": "ep_14_ut_33"
    },
    {
      "end": 556684,
      "speaker": "B",
      "start": 555008,
      "text": "Isn't this a bottomless pit?",
      "id": "ep_14_ut_34"
    },
    {
      "end": 586814,
      "speaker": "E",
      "start": 557784,
      "text": "I don't know if it is. It's definitely a challenge. And what is really important to me is that it should not be seen as a recipe for successful work. It could either be something to try out to go through. It could be something to help educators like to build, maybe, maybe a lecture around it. It could be something that is discussed, of course.",
      "id": "ep_14_ut_35"
    },
    {
      "end": 595186,
      "speaker": "B",
      "start": 589074,
      "text": "Explain to clients how you usually work. I think it's great if you have one diagram that explains your workflow or something.",
      "id": "ep_14_ut_36"
    },
    {
      "end": 607294,
      "speaker": "Various",
      "start": 595370,
      "text": "Yeah. And I don't know if you are aware of that, but a paper has been published this week, this year with a very, very similar intent. So I would be. You have it there on your desk?",
      "id": "ep_14_ut_37"
    },
    {
      "end": 622800,
      "speaker": "E",
      "start": 607714,
      "text": "No, but it's so classic that I would like tell you something, Elko. And you would come back. I'm not quite sure if I know which one you are referring to.",
      "id": "ep_14_ut_38"
    },
    {
      "end": 623096,
      "speaker": "F",
      "start": 622832,
      "text": "Can you?",
      "id": "ep_14_ut_39"
    },
    {
      "end": 632608,
      "speaker": "Various",
      "start": 623120,
      "text": "No, no. But I mean, it's really interesting. I would really like to compare the two things and see if there are any commonalities and where they differ. Maybe the interesting part is also where they differ.",
      "id": "ep_14_ut_40"
    },
    {
      "end": 633524,
      "speaker": "E",
      "start": 632776,
      "text": "Yeah.",
      "id": "ep_14_ut_41"
    },
    {
      "end": 637924,
      "speaker": "B",
      "start": 634104,
      "text": "So we should do an episode with Benjamin and probably Miriam.",
      "id": "ep_14_ut_42"
    },
    {
      "end": 647886,
      "speaker": "Various",
      "start": 638304,
      "text": "Yeah, sure, sure. Check. But I would be happy to give it a look if you have anything you can send.",
      "id": "ep_14_ut_43"
    },
    {
      "end": 668514,
      "speaker": "E",
      "start": 647990,
      "text": "Yeah, there is a very first iteration, but I already actually don't want to show it anymore because a lot of the content doesn't make sense and it's not precise. I am happy to send it over to you at some point and also explain a little bit how I plan to develop it further.",
      "id": "ep_14_ut_44"
    },
    {
      "end": 675974,
      "speaker": "Various",
      "start": 668634,
      "text": "Yeah, yeah, yeah, yeah. Okay. Santiago, do you want to say something about what you presented and visualized?",
      "id": "ep_14_ut_45"
    },
    {
      "end": 814126,
      "speaker": "G",
      "start": 676794,
      "text": "Okay. First, in relation to what Benjamin there said, what I found really interesting and beautiful about the, Benjamin's talk was this, like, meta information, as he said, the fact that it's interesting to see how someone could be at the same time working on projects and analyzing the projects and the process on the projects. I think that the value of his presentation, the fact, it is clear he got a lot of value and analysis and interesting data about the entire process. So in the, in the further steps, he, he was able to compare projects. And that was great. That, that I think what the interest point of his talk like, okay, I can learn from different projects in order to make better ones and through better processes. Okay, so I make his presentation. My presentation. The idea was to argue or to show that information visualization is a cultural medium, that you can use it to express much more than only quantities or relations, that you can use it to express like, very white cultural ideas or emotions or stories through different types of techniques. So what I basically did was to. To feature several projects. And with each project, try to argument from one particular point of view that defended the whole idea of visualization being a language. And I think the highlight of my talk was when I presented the work of a ten years old kid that created amazing handmade visualization, very subjective ones. And in that point, I like, like, felt the public, like, very happy, and it was very optimistic. I think that was, I believe, the best part of my presentation.",
      "id": "ep_14_ut_46"
    },
    {
      "end": 822594,
      "speaker": "Various",
      "start": 814230,
      "text": "Okay, good, good, good. And are you gonna publish anything on the web that we can see?",
      "id": "ep_14_ut_47"
    },
    {
      "end": 852150,
      "speaker": "G",
      "start": 823374,
      "text": "Yes, actually I am. I am waiting for the video. So what I want to create is I want to, with the video, create a website in which you will have all the links to all the resources I feature in the presentation. But time correlated, so you can follow the video and understand which is the source that is related with what? I am talking in that very moment.",
      "id": "ep_14_ut_48"
    },
    {
      "end": 853846,
      "speaker": "B",
      "start": 852302,
      "text": "That sounds super cool.",
      "id": "ep_14_ut_49"
    },
    {
      "end": 856126,
      "speaker": "Various",
      "start": 854030,
      "text": "Yeah, it is. It is. Yeah.",
      "id": "ep_14_ut_50"
    },
    {
      "end": 863398,
      "speaker": "B",
      "start": 856190,
      "text": "You need to do that. Did they record the videos? Will they publish videos?",
      "id": "ep_14_ut_51"
    },
    {
      "end": 864074,
      "speaker": "Various",
      "start": 863446,
      "text": "Yeah.",
      "id": "ep_14_ut_52"
    },
    {
      "end": 867174,
      "speaker": "G",
      "start": 864414,
      "text": "Yes. If they are published right now. No, no.",
      "id": "ep_14_ut_53"
    },
    {
      "end": 868646,
      "speaker": "Various",
      "start": 867294,
      "text": "Will they in the future?",
      "id": "ep_14_ut_54"
    },
    {
      "end": 870174,
      "speaker": "G",
      "start": 868710,
      "text": "Yes, yes, yes.",
      "id": "ep_14_ut_55"
    },
    {
      "end": 870702,
      "speaker": "Various",
      "start": 870214,
      "text": "Okay.",
      "id": "ep_14_ut_56"
    },
    {
      "end": 872074,
      "speaker": "G",
      "start": 870798,
      "text": "They say they will.",
      "id": "ep_14_ut_57"
    },
    {
      "end": 873354,
      "speaker": "Various",
      "start": 872454,
      "text": "Okay.",
      "id": "ep_14_ut_58"
    },
    {
      "end": 888444,
      "speaker": "E",
      "start": 873854,
      "text": "Maybe. Maybe there's something that Santiago didn't mention, which I think is definitely worth mentioning. So, Santiago, you actually built your own tool to come up with the presentation. Please talk a little bit about it.",
      "id": "ep_14_ut_59"
    },
    {
      "end": 925824,
      "speaker": "G",
      "start": 888824,
      "text": "Yes, but it was, at the same time, it was fantastic because it basically saved my life, because the tool had a clock like the timing in the bottom, and I was able to present all my projects without the need to close windows and open other windows. But it's an extremely simple tool. It's like HTML with frames, nothing more than that. And then the cloud, the clock in the bottom. But extremely simple, extremely useful.",
      "id": "ep_14_ut_60"
    },
    {
      "end": 931220,
      "speaker": "Various",
      "start": 925944,
      "text": "Anyway, are you going to outsource this tool or what?",
      "id": "ep_14_ut_61"
    },
    {
      "end": 936012,
      "speaker": "G",
      "start": 931392,
      "text": "It's five lines of code. Yes, yes, yes, yes.",
      "id": "ep_14_ut_62"
    },
    {
      "end": 939164,
      "speaker": "Various",
      "start": 936068,
      "text": "It's crazy how much noise you can make with five lines of code.",
      "id": "ep_14_ut_63"
    },
    {
      "end": 940664,
      "speaker": "B",
      "start": 939204,
      "text": "These lines are that long?",
      "id": "ep_14_ut_64"
    },
    {
      "end": 959864,
      "speaker": "G",
      "start": 942844,
      "text": "No, no, it's very simple. I think what I will outsource, finally, is more the idea than the code itself, you know? But, yes, I want to publish it so people will quickly understand. It's really simple and easy to. To be aside, you know?",
      "id": "ep_14_ut_65"
    },
    {
      "end": 962908,
      "speaker": "Various",
      "start": 961444,
      "text": "Okay, good.",
      "id": "ep_14_ut_66"
    },
    {
      "end": 964300,
      "speaker": "C",
      "start": 963036,
      "text": "Can I jump in here?",
      "id": "ep_14_ut_67"
    },
    {
      "end": 965464,
      "speaker": "Various",
      "start": 964412,
      "text": "Sure. Sure.",
      "id": "ep_14_ut_68"
    },
    {
      "end": 995644,
      "speaker": "C",
      "start": 966364,
      "text": "I have to say, both of these gentlemen are being very modest about what they present. First of all, Benjamin, his outline of process was amazing. It was extremely detailed and thorough, and I thought it was just fantastic. I mean, it highlighted everything that. That we do. But I think for most people, it's. Sorry, is that me? For most people, I think that.",
      "id": "ep_14_ut_69"
    },
    {
      "end": 997992,
      "speaker": "D",
      "start": 997704,
      "text": "If.",
      "id": "ep_14_ut_70"
    },
    {
      "end": 1065363,
      "speaker": "C",
      "start": 998008,
      "text": "They're just coming in to get a visualization or if they're looking to work with someone as a vendor, it's incredibly helpful for people to see what that entire process is. I think it's invaluable. So it was incredibly detailed, and even though he's dissatisfied with it, I think it was really wonderful. And then Santiago presented amazing work. And the thing that he's remarking on. Yes, people responded well to the boys visualization, but he got lots of oohs and ahs about his work. He did one fantastic piece. Well, he showed some iterations of things that we've seen in the past, but new versions that are really exciting and cool, and I encourage everyone to go check them out. But he also showed this piece about constellations and how, you know, seeing them in the night sky presents one visual representation. But once you start to look at the distance of the stars. And he showed this, like, amazing 3d model of like, the distance of stars and how they form a different shape based on their constellations. That was gorgeous. Absolutely stunning.",
      "id": "ep_14_ut_71"
    },
    {
      "end": 1103846,
      "speaker": "Various",
      "start": 1067383,
      "text": "Good to hear that. Santiago, you want to comment on that? We cannot hear you anyway. Okay. Sorry, I'm still recovering from my flu. Okay, but that's not an episode about visualized, so let's let other people speak. Who else wants to speak? Raise your hand. I can see you all. Raise your hand. Raise your hand. Maybe we can ask to Yuri what he's doing in Costa Rica. Yeah, you have to unmute yourself. I'm sorry, I cannot do it for you.",
      "id": "ep_14_ut_72"
    },
    {
      "end": 1104966,
      "speaker": "D",
      "start": 1103990,
      "text": "Do you hear me?",
      "id": "ep_14_ut_73"
    },
    {
      "end": 1112034,
      "speaker": "Various",
      "start": 1105070,
      "text": "Yeah, I can hear you. Can you introduce yourself again? Because when you introduced yourself initially, we were not broadcasting yet.",
      "id": "ep_14_ut_74"
    },
    {
      "end": 1120714,
      "speaker": "D",
      "start": 1112694,
      "text": "I'm Yorja Engelhardt. I'm a researcher and teacher in data visualization at the University of Amsterdam in the Netherlands.",
      "id": "ep_14_ut_75"
    },
    {
      "end": 1127634,
      "speaker": "Various",
      "start": 1122334,
      "text": "Fantastic place. I lived there for a few months some years ago. I loved it.",
      "id": "ep_14_ut_76"
    },
    {
      "end": 1133982,
      "speaker": "D",
      "start": 1127934,
      "text": "I also love it. The only thing that I find difficult is the weather in the winter.",
      "id": "ep_14_ut_77"
    },
    {
      "end": 1137862,
      "speaker": "Various",
      "start": 1134158,
      "text": "Yeah, of course. But you said you are in Costa Rica now.",
      "id": "ep_14_ut_78"
    },
    {
      "end": 1138634,
      "speaker": "D",
      "start": 1137958,
      "text": "Yes.",
      "id": "ep_14_ut_79"
    },
    {
      "end": 1144034,
      "speaker": "Various",
      "start": 1139694,
      "text": "Are you doing some vis there or is it just for leisure?",
      "id": "ep_14_ut_80"
    },
    {
      "end": 1233504,
      "speaker": "D",
      "start": 1145134,
      "text": "Yeah, I'm exploring Costa Rica and I'm exploring data visualization in Costa Rica. And I found a lot of interesting things that I had no clue about, actually. The Costa Rica Institute of Technology has been teaching data visualization for many years. Their students are doing interesting stuff, mostly in D3. We've had a fantastic week with Alberto Cairo just very recently. I love Alberto's work and his personality, and we had a great time together. He was coaching a group of about 50 journalists, designers and developers at the national newspaper La Natione, and it was very, very inspiring. There's great people here at La Nacion. There is, for example, investigative journalist, data journalist Giannina Segnini. She was on the jury of the data journalism awards. We were both invited to speak in Paris at the World News Summit. There is Manuel Canales, who has been winning awards at Malofiej, and there's a very passionate team of developers, infographics, designers, data analysts. It's amazing. I'm very interested in this field of data journalism. I teach a lot of journalists, but my own background is basically data visualization. And I love this application that is booming in data journalism.",
      "id": "ep_14_ut_81"
    },
    {
      "end": 1237708,
      "speaker": "Various",
      "start": 1234164,
      "text": "Okay, are you a journalist by training or what?",
      "id": "ep_14_ut_82"
    },
    {
      "end": 1239812,
      "speaker": "D",
      "start": 1237756,
      "text": "No, I have a PhD in computer science.",
      "id": "ep_14_ut_83"
    },
    {
      "end": 1240484,
      "speaker": "Various",
      "start": 1239948,
      "text": "Okay.",
      "id": "ep_14_ut_84"
    },
    {
      "end": 1248196,
      "speaker": "D",
      "start": 1240564,
      "text": "But I hang out a lot with graphic designers. And in addition to the University of Amsterdam, I teach at various design schools and art schools.",
      "id": "ep_14_ut_85"
    },
    {
      "end": 1249584,
      "speaker": "Various",
      "start": 1248340,
      "text": "Okay, cool.",
      "id": "ep_14_ut_86"
    },
    {
      "end": 1286350,
      "speaker": "B",
      "start": 1251964,
      "text": "I can totally recommend Yuri's PhD thesis. I have to have to mention that briefly. I think I read it five, six years ago or so when I. And it's about the language of graphics. So it's this idea that graphics is a language. Santiago north. Right. And so it looks at the syntax and the semantics of graphics and tracks, and I. I should read it again. I just realized. Yeah, we should all probably. So it's probably in the recording. You can't see the link, but it's yuriweb.com, and there you can find it.",
      "id": "ep_14_ut_87"
    },
    {
      "end": 1290718,
      "speaker": "Various",
      "start": 1286382,
      "text": "Yeah, we'll post that in the. In the blog post. Anyway. Okay.",
      "id": "ep_14_ut_88"
    },
    {
      "end": 1296034,
      "speaker": "D",
      "start": 1290846,
      "text": "I'm very honored with your. With your comments and compliments. Thank you, Moritz.",
      "id": "ep_14_ut_89"
    },
    {
      "end": 1302834,
      "speaker": "Various",
      "start": 1297854,
      "text": "Yeah. And so. And you are still teaching visualization?",
      "id": "ep_14_ut_90"
    },
    {
      "end": 1315734,
      "speaker": "D",
      "start": 1303454,
      "text": "Right now? I am basically supervising master's theses in data visualization from my hammock under the papaya tree. And we're.",
      "id": "ep_14_ut_91"
    },
    {
      "end": 1319514,
      "speaker": "Various",
      "start": 1315854,
      "text": "You have to tell me the secret on how to do that, because I.",
      "id": "ep_14_ut_92"
    },
    {
      "end": 1365106,
      "speaker": "D",
      "start": 1320484,
      "text": "I'm on a kind of extended sabbatical combined with parental leave. We have two very small boys hanging around here, and they love this country and the warmth and everything, but I'm very active. We have a Tableau user group, Costa Rica. We have a Facebook group, visually, dacion de datos, data visualization in Costa Rica. And it's amazing to be in a. I hang out a lot in Europe. I teach in Barcelona at University Pompeo Fabra in a postgraduate on information visualization and various other places. But for me, it's amazing to be in Central America and find all these data visualization things going on and people doing amazing stuff.",
      "id": "ep_14_ut_93"
    },
    {
      "end": 1378786,
      "speaker": "Various",
      "start": 1365250,
      "text": "Sure, sure. Well, when we had the interview with Alberto, I had this strong feeling that South America is really booming in terms of visualization, especially journalism. Visual journalism, yeah.",
      "id": "ep_14_ut_94"
    },
    {
      "end": 1379666,
      "speaker": "D",
      "start": 1378810,
      "text": "There's two.",
      "id": "ep_14_ut_95"
    },
    {
      "end": 1381850,
      "speaker": "Various",
      "start": 1379850,
      "text": "A lot of things are happening there.",
      "id": "ep_14_ut_96"
    },
    {
      "end": 1382378,
      "speaker": "F",
      "start": 1382002,
      "text": "Yeah.",
      "id": "ep_14_ut_97"
    },
    {
      "end": 1392294,
      "speaker": "D",
      "start": 1382426,
      "text": "There's two newspapers called Lanacion in Latin America that are doing great data visualization work. That's Lanacion here in Costa Rica, and the other La Nacion in Argentina.",
      "id": "ep_14_ut_98"
    },
    {
      "end": 1407404,
      "speaker": "Various",
      "start": 1392914,
      "text": "Yeah. Cool. Santiago, you are in the right. In the right part of the hemisphere, of course. Kind of. He says, you want to say something? We cannot hear you. You have to unmute yourself first.",
      "id": "ep_14_ut_99"
    },
    {
      "end": 1435474,
      "speaker": "G",
      "start": 1408104,
      "text": "No, I live completely isolated from Buenos Aires, so I am actually more close to Barcelona, to New York than to Buenos Aires in terms of connection and things going on. But, yes, I know people at La Nacion here in Argentina, and they are doing excellent stuff. In terms of opening data, making it accessible, and then start creating platforms to work with that data. Yes.",
      "id": "ep_14_ut_100"
    },
    {
      "end": 1443014,
      "speaker": "Various",
      "start": 1435594,
      "text": "Okay. But you have the south American ribbon, right? So people say, oh, this guy is from South America. It must be cool.",
      "id": "ep_14_ut_101"
    },
    {
      "end": 1444410,
      "speaker": "G",
      "start": 1443714,
      "text": "I'm cool.",
      "id": "ep_14_ut_102"
    },
    {
      "end": 1445210,
      "speaker": "Various",
      "start": 1444482,
      "text": "That's true.",
      "id": "ep_14_ut_103"
    },
    {
      "end": 1446986,
      "speaker": "G",
      "start": 1445322,
      "text": "And I am from South America.",
      "id": "ep_14_ut_104"
    },
    {
      "end": 1463686,
      "speaker": "Various",
      "start": 1447010,
      "text": "Yes. Okay, Moritz, maybe you want to lead the discussion because I'm coughing like. Like crazy and I didn't. I'm sorry. Maybe we should mute you.",
      "id": "ep_14_ut_105"
    },
    {
      "end": 1468062,
      "speaker": "B",
      "start": 1463790,
      "text": "Yeah, can we mute you as a moderator?",
      "id": "ep_14_ut_106"
    },
    {
      "end": 1470254,
      "speaker": "Various",
      "start": 1468238,
      "text": "No, I think you can't.",
      "id": "ep_14_ut_107"
    },
    {
      "end": 1471046,
      "speaker": "B",
      "start": 1470374,
      "text": "Too bad.",
      "id": "ep_14_ut_108"
    },
    {
      "end": 1471834,
      "speaker": "Various",
      "start": 1471150,
      "text": "Yeah.",
      "id": "ep_14_ut_109"
    },
    {
      "end": 1475794,
      "speaker": "B",
      "start": 1472894,
      "text": "Okay, so we have a few more people here.",
      "id": "ep_14_ut_110"
    },
    {
      "end": 1477342,
      "speaker": "Various",
      "start": 1476334,
      "text": "We have a few more.",
      "id": "ep_14_ut_111"
    },
    {
      "end": 1478286,
      "speaker": "B",
      "start": 1477438,
      "text": "Who's next?",
      "id": "ep_14_ut_112"
    },
    {
      "end": 1482854,
      "speaker": "Various",
      "start": 1478430,
      "text": "Raise your hand. Raise your hand. Don't be shy. Oh, here we go. Tiven.",
      "id": "ep_14_ut_113"
    },
    {
      "end": 1552494,
      "speaker": "F",
      "start": 1483554,
      "text": "Hi. One of the questions I had for you guys is I'm working with a number of different data sets. An example right now being even though the NHL season is currently locked out, we're still living in hopes that they'll be hockey again at some point. And we're taking a look at individual stats for specific players. That's fine when we're dealing with a large canvas like a computer monitor, but we're trying to figure out how do you scale down the number of data points as the screen size decreases. So how do you determine sort of what's the density of information that you would put onto something the size of a tablet versus something the size of a phone? Because when you're talking about 800 players or so, obviously the way that you approach it is going to be one way for a high res, large screen device like a tv or a computer monitor, but then much smaller when it comes down to something on a more mobile size. So I want to know what your thoughts were in terms of how do you go about approaching that sort of information density per pixel? I guess.",
      "id": "ep_14_ut_114"
    },
    {
      "end": 1557374,
      "speaker": "Various",
      "start": 1555634,
      "text": "That's a good one for mobile.",
      "id": "ep_14_ut_115"
    },
    {
      "end": 1561934,
      "speaker": "B",
      "start": 1558274,
      "text": "Yeah, that's great, because I don't really do much mobile.",
      "id": "ep_14_ut_116"
    },
    {
      "end": 1570634,
      "speaker": "Various",
      "start": 1564074,
      "text": "Who does mobile? Yeah, maybe Kim does some mobile. Do you, Kim?",
      "id": "ep_14_ut_117"
    },
    {
      "end": 1573554,
      "speaker": "C",
      "start": 1571094,
      "text": "We don't design specifically for mobile.",
      "id": "ep_14_ut_118"
    },
    {
      "end": 1575710,
      "speaker": "B",
      "start": 1575374,
      "text": "Other.",
      "id": "ep_14_ut_119"
    },
    {
      "end": 1634150,
      "speaker": "C",
      "start": 1575742,
      "text": "Than tablets, but we. I mean, the way that I would approach that or the periscopic would approach it is just by the use case, I guess, by the user experience point of view and look at what, you know, what is the most important aspects to get across. What are the key takeaways that a mobile user would be looking for? You know, you don't have to show every single thing, just find, you know, without knowing the specific data set and without looking at it, it's hard to say, but I would just start with the user and also, I just saw hacks and hackers. New York recently had someone present about that very thing. And I know they just put their slides up. So I would either ask Chris Wu, you can find her on Twitter or you can visit Google hacks, tag first to New York City. And those slides are up. So I haven't looked at them yet, but it looks like an interesting process.",
      "id": "ep_14_ut_120"
    },
    {
      "end": 1681282,
      "speaker": "B",
      "start": 1634342,
      "text": "Maybe as a general rule, you can expect in a traditional setting, people might better be able to navigate to the spot themselves, where they find the information they want to find. And in a mobile setting, you want to think more about how to push the right type of information in a given context. So take time into account, take location into account, general situation, and sort of then try to figure out a bit more automatically what that individual data point is that somebody's interested in. You can't expect somebody to navigate huge lists on a mobile phone or deep navigation schemas, but I haven't seen that great data visualization on mobiles, honestly. And maybe that's a structural problem, or maybe that's just because it takes time to get used to how to design for them properly.",
      "id": "ep_14_ut_121"
    },
    {
      "end": 1725734,
      "speaker": "F",
      "start": 1681378,
      "text": "Okay. The way we've been approaching it so far is to look at it more as a weight, as a tool, at least on the larger screen, for people to explore and to be able to compare different types of player stats against each other. So how many game winning goals over the course of an entire season, or how many, you know, what's your shooting percentage base contrasted with the number of penalties per minute or those kinds of things, which lends itself to being able to look around and sort of see interesting correlations. But what I'm hearing and what makes a lot of sense is that type of exploration is not going to work on a tiny little screen. So, yeah, thinking about it more from the perspective of what's the context in which they're using it would certainly make a lot of sense.",
      "id": "ep_14_ut_122"
    },
    {
      "end": 1736710,
      "speaker": "Various",
      "start": 1727214,
      "text": "So are you, are you actually trying to have the same data on different, on different devices at the same time, or you have different projects?",
      "id": "ep_14_ut_123"
    },
    {
      "end": 1783646,
      "speaker": "F",
      "start": 1736742,
      "text": "Well, it's necessarily because it's the same players, it's going to be the same stats. It doesn't necessarily have to be the full range of stats, given the limitations of bandwidth of the device. But I think like what we, what we see people doing quite a bit with mobile devices is using it during a sporting event to be able to look up individual bits of information about a player or about something that just recently happened. So what I'm thinking, as you guys are talking is that rather than providing a way to explore the full universe of every single different player, just focusing on the ones that are active at the moment or the ones that are maybe the top ten for each type of category and approaching it that way might make more sense.",
      "id": "ep_14_ut_124"
    },
    {
      "end": 1797542,
      "speaker": "B",
      "start": 1783830,
      "text": "Yeah. Or if a player just scored a goal, then show that exactly that context specific info, you know, that what you that you might be interested in that player at that point in time and push that rather than have the user pick that from a list or something.",
      "id": "ep_14_ut_125"
    },
    {
      "end": 1798062,
      "speaker": "G",
      "start": 1797678,
      "text": "Cool.",
      "id": "ep_14_ut_126"
    },
    {
      "end": 1803710,
      "speaker": "F",
      "start": 1798118,
      "text": "So what I'm doing is that it's going to be an entirely different build for different devices.",
      "id": "ep_14_ut_127"
    },
    {
      "end": 1804614,
      "speaker": "B",
      "start": 1803902,
      "text": "Sure.",
      "id": "ep_14_ut_128"
    },
    {
      "end": 1805954,
      "speaker": "F",
      "start": 1804774,
      "text": "Yeah, fair enough.",
      "id": "ep_14_ut_129"
    },
    {
      "end": 1808514,
      "speaker": "Various",
      "start": 1807774,
      "text": "Sure.",
      "id": "ep_14_ut_130"
    },
    {
      "end": 1820734,
      "speaker": "F",
      "start": 1809754,
      "text": "I put a link to the current work in progress over in the chat there. It shows the full data set and when you look at it, you can see of course that's not going to work on a time built.",
      "id": "ep_14_ut_131"
    },
    {
      "end": 1827094,
      "speaker": "Various",
      "start": 1824754,
      "text": "Do you have any other questions or comments?",
      "id": "ep_14_ut_132"
    },
    {
      "end": 1835054,
      "speaker": "F",
      "start": 1829074,
      "text": "I like the podcast quite a bit. My fiance gets a kick out of how nerdy you guys sound.",
      "id": "ep_14_ut_133"
    },
    {
      "end": 1841634,
      "speaker": "B",
      "start": 1838374,
      "text": "So you should show her the video so she sees how nerdy will look.",
      "id": "ep_14_ut_134"
    },
    {
      "end": 1844714,
      "speaker": "F",
      "start": 1843734,
      "text": "I don't know.",
      "id": "ep_14_ut_135"
    },
    {
      "end": 1847190,
      "speaker": "D",
      "start": 1846534,
      "text": "But yeah.",
      "id": "ep_14_ut_136"
    },
    {
      "end": 1853434,
      "speaker": "F",
      "start": 1847222,
      "text": "No other specific questions. It's been great to be able to ask you this so far. Thanks.",
      "id": "ep_14_ut_137"
    },
    {
      "end": 1891352,
      "speaker": "Various",
      "start": 1853814,
      "text": "Yeah, thanks. Thanks to you. Yesterday I went to a data visualization meetup here in New York and I had quite some people dropping by and say, hey, data stories, we love it, and so on. It's cool. We should make a t shirt Moritz at some point or something similar. Or a handbag, or a handbag. But t shirt is better, I guess. Okay, any other comments or questions you guys have? Karen, Karen, we cannot hear you. You can maybe type something?",
      "id": "ep_14_ut_138"
    },
    {
      "end": 1892544,
      "speaker": "H",
      "start": 1891528,
      "text": "Yeah. Can you hear me now?",
      "id": "ep_14_ut_139"
    },
    {
      "end": 1901188,
      "speaker": "Various",
      "start": 1892584,
      "text": "Oh yeah. Fantastic. Hi, nice to hear you. So I'm starting, do you want to briefly introduce yourself?",
      "id": "ep_14_ut_140"
    },
    {
      "end": 1925424,
      "speaker": "H",
      "start": 1901356,
      "text": "Okay, so I'm just starting my PhD in information visualization at UT Dallas, and we're starting to get a group that's coming together with the arts and technology department as well as I'm in the CS department. So my question is how to narrow down and find a good research topic, because it seems like.",
      "id": "ep_14_ut_141"
    },
    {
      "end": 1928052,
      "speaker": "Various",
      "start": 1927244,
      "text": "That's the only.",
      "id": "ep_14_ut_142"
    },
    {
      "end": 1938836,
      "speaker": "H",
      "start": 1928108,
      "text": "Grail I know, but it's hard because on the one hand, well, right now I'm just doing a temporary project on visualization of collaboration networks.",
      "id": "ep_14_ut_143"
    },
    {
      "end": 1939428,
      "speaker": "Various",
      "start": 1938940,
      "text": "Yeah.",
      "id": "ep_14_ut_144"
    },
    {
      "end": 2000664,
      "speaker": "H",
      "start": 1939516,
      "text": "And so just to do that is basically I'm saying I'm going to look at complex, you know, graphical data, and then it almost feels like if that's the path I go down, then my research is defined by the type of data that I'm that type of data. And as opposed to. Well, I guess the other option is you end up working with a different group. Like a group doing, like, bioinformatics research, and then you end up doing research that's really tied to their research. I don't know, it just seems hard because partially in the arts and technology department, what is a project in that department? I mean, from my perspective, it's a project, but from their perspective, it's research. From my department's perspective, the CS department, it's not really research, it's just a project. So how do you define what's research versus what's a project?",
      "id": "ep_14_ut_145"
    },
    {
      "end": 2008924,
      "speaker": "Various",
      "start": 2001344,
      "text": "It sounds like something I should answer here. I don't know how honest I can be in public.",
      "id": "ep_14_ut_146"
    },
    {
      "end": 2013720,
      "speaker": "B",
      "start": 2011944,
      "text": "You can speak in code.",
      "id": "ep_14_ut_147"
    },
    {
      "end": 2069786,
      "speaker": "Various",
      "start": 2013912,
      "text": "In code? I have to use my fingers. Can we do that offline? No. Okay. Well, my experience is that I don't remember there was a nice. A nice set of slides, PowerPoint slides, who some researchers did some years ago about the fact that basically, when you start a PhD, you start like this, and then you. This, this. And at the end of your thesis, these hundred pages you write, is about a tiny portion of the idea you had at the beginning. That's how research works. It's having a very precise questions and trying to answer this question in a. In a systematic way. So I think. I'm glad you mentioned the dichotomy between projects and research, because I found this thing. Yeah. Yuri, you want to speak? Yeah, I'll give you. You want to say something right now? Yeah.",
      "id": "ep_14_ut_148"
    },
    {
      "end": 2103584,
      "speaker": "D",
      "start": 2069850,
      "text": "Just a very brief warning about not following your advice, not narrowing down your topic fast enough. I kind of refuse to give up the big question that I wanted to answer with my PhD thesis about the fundamental unifying principles of all theories of data visualization. And I am grateful to Moritz about his very kind words. But the warning is, it did take me eight years to finish my PhD thesis. So I do advise. You follow Enrico's advice.",
      "id": "ep_14_ut_149"
    },
    {
      "end": 2184544,
      "speaker": "Various",
      "start": 2104764,
      "text": "No, really. I mean, it's always like that when you start. You want to conquer the world, but that's not the way research works. Research works by trying to answer a tiny question and build on top of it. And that's painful at the beginning, because you really want to conquer the world, but the way you conquer the world is by answering tiny questions. And another thing you mentioned, I mean, you said you are in a CS department, right? Yeah. That's a very tricky thing, because visualization can happen in many different departments. And if you are in a CS department, the people who are going to evaluate your work are computer scientists. Don't forget that. Because they want to see computer science stuff they don't care. They don't actually give a shit on. Yeah, I'm seeing pretty pictures on the screen. Okay. They want to see where the computer science contribution is. So be very careful. I mean, I think we should keep talking about that offline if you want to. We could very easily spend a couple of hours discussing this thing. But you have to be careful because I encountered many problems myself. So it's. And so almost every person who's been working in Visualisation during the last ten years in computer science, I'm sure had very similar problems.",
      "id": "ep_14_ut_150"
    },
    {
      "end": 2187708,
      "speaker": "H",
      "start": 2185364,
      "text": "Well, thank you for everyone's feedback.",
      "id": "ep_14_ut_151"
    },
    {
      "end": 2189144,
      "speaker": "Various",
      "start": 2187756,
      "text": "I really appreciate it.",
      "id": "ep_14_ut_152"
    },
    {
      "end": 2202394,
      "speaker": "B",
      "start": 2190444,
      "text": "Maybe to add to that, and now that Yuri said it, I also recall that my. My supervisor, Boris Muller in Potsdam, he also said, you know, I always had these big plans. And he always said, it's just a thesis.",
      "id": "ep_14_ut_153"
    },
    {
      "end": 2203710,
      "speaker": "Various",
      "start": 2202694,
      "text": "Yeah, relax.",
      "id": "ep_14_ut_154"
    },
    {
      "end": 2204094,
      "speaker": "B",
      "start": 2203822,
      "text": "It's.",
      "id": "ep_14_ut_155"
    },
    {
      "end": 2204834,
      "speaker": "Various",
      "start": 2204134,
      "text": "Relax.",
      "id": "ep_14_ut_156"
    },
    {
      "end": 2237254,
      "speaker": "B",
      "start": 2205294,
      "text": "And you're just demonstrating a skill, you know, it doesn't. I mean, if you actually advance the field, that's great. I mean, but you're lucky if that actually happens, you know? But foremost, you're demonstrating that you can do a certain thing in a certain structured way. And then, fingers crossed, maybe you're advancing the field as well. But it's just a thesis. Yeah, you don't want to hear that. Maybe while you're in it. But afterwards you say, yeah, basically. Why did I?",
      "id": "ep_14_ut_157"
    },
    {
      "end": 2250672,
      "speaker": "Various",
      "start": 2237634,
      "text": "Well, at the same time, I think it's not a good advice to fly too low. I mean, it's not a matter of not being. Being or not being ambitious. You can still be ambitious, but by trying to solve little problems, little by little.",
      "id": "ep_14_ut_158"
    },
    {
      "end": 2258332,
      "speaker": "B",
      "start": 2250818,
      "text": "Yeah, but then it's. You know, it's that one paper. Maybe that is really the thing that advances the field, but usually the thesis doesn't.",
      "id": "ep_14_ut_159"
    },
    {
      "end": 2259460,
      "speaker": "Various",
      "start": 2258468,
      "text": "Yeah, do that.",
      "id": "ep_14_ut_160"
    },
    {
      "end": 2262540,
      "speaker": "B",
      "start": 2259532,
      "text": "The thesis is just that report on what you did.",
      "id": "ep_14_ut_161"
    },
    {
      "end": 2265924,
      "speaker": "Various",
      "start": 2262652,
      "text": "Well, unless you are Jock McKinley, for instance.",
      "id": "ep_14_ut_162"
    },
    {
      "end": 2266532,
      "speaker": "B",
      "start": 2266004,
      "text": "Yeah, some.",
      "id": "ep_14_ut_163"
    },
    {
      "end": 2267124,
      "speaker": "Various",
      "start": 2266588,
      "text": "Some people.",
      "id": "ep_14_ut_164"
    },
    {
      "end": 2272864,
      "speaker": "B",
      "start": 2267204,
      "text": "Yeah, I mean, Uwe's thesis is pretty good, actually, so. Have I mentioned that before?",
      "id": "ep_14_ut_165"
    },
    {
      "end": 2275464,
      "speaker": "Various",
      "start": 2274044,
      "text": "He's hiding away.",
      "id": "ep_14_ut_166"
    },
    {
      "end": 2279834,
      "speaker": "B",
      "start": 2278134,
      "text": "It's a good thesis, man.",
      "id": "ep_14_ut_167"
    },
    {
      "end": 2293710,
      "speaker": "Various",
      "start": 2283334,
      "text": "Misha, you want to say something? You typed something on the chat. You have something to say? It looks like right now you had similar problems. You said.",
      "id": "ep_14_ut_168"
    },
    {
      "end": 2369226,
      "speaker": "I",
      "start": 2293902,
      "text": "Yeah, no, it was in reference to what you said. With the computer science crowd in visualization, it's like I'm sort of. Can we talk about the user interface? Case studies. Oh, but can we just perfect our algorithms a bit more and it's, well, it's actually, it's really interesting what you can learn with machine learning about data and society and patterns. I mean, it's entirely fantastic. The trouble is kind of also learning how to make other. Make, make, make, make, make, make, make, make, make, make. The computer science folks understand that the 30,000 dots on screen, even if they're perfectly organized, are really cool, but communication is still necessary. So one has to learn a lot of negotiation skills. But I suppose the point is that there is a fantastic amount of stuff you can do in computer science now that we have all this open data. But visualization can play a good role as well. A question of finding the right language to explain it.",
      "id": "ep_14_ut_169"
    },
    {
      "end": 2383854,
      "speaker": "Various",
      "start": 2369410,
      "text": "Yeah, yeah. And actually, this reminded me another thing you said, Karen, that I think you mentioned the fact that you are collaborating with some source of domain experts or something like that. Right.",
      "id": "ep_14_ut_170"
    },
    {
      "end": 2412644,
      "speaker": "H",
      "start": 2385394,
      "text": "So that would be the other option. No, right now I'm not. I'm working in the arts and technology group just on collaboration. But the other option is to go that more specific route of either bioinformatics or like our geology department has a lot of data. I've been asking people, hey, do you have data that you need visualized to try and see if that would lead me to a good research area because.",
      "id": "ep_14_ut_171"
    },
    {
      "end": 2451458,
      "speaker": "Various",
      "start": 2412764,
      "text": "That's another super tricky issue that people working with data, they want to have some real data and connections with real people. Right. But you always end up with the risk of doing basically engineering work and no research because you are always solving their problem and creating no new research on top of it. So that's, again, super, super tricky. And I've seen that happening many, many times, including myself. That, that's super tricky again. Okay, why don't we let somebody else pee?",
      "id": "ep_14_ut_172"
    },
    {
      "end": 2454578,
      "speaker": "B",
      "start": 2451506,
      "text": "Yeah. We should say hi to Wes. Wes joined us.",
      "id": "ep_14_ut_173"
    },
    {
      "end": 2455194,
      "speaker": "Various",
      "start": 2454666,
      "text": "Hey.",
      "id": "ep_14_ut_174"
    },
    {
      "end": 2471774,
      "speaker": "B",
      "start": 2455314,
      "text": "Yeah, Wes is founder of Pigeon Deactivation. And incidentally, I'm wearing their t shirt. How did that happen? Yeah, he sent it to me last year, which. Thanks, Wes. That was nice. You see, I actually still wear it, so that's great.",
      "id": "ep_14_ut_175"
    },
    {
      "end": 2473338,
      "speaker": "Various",
      "start": 2472074,
      "text": "It looks good on you.",
      "id": "ep_14_ut_176"
    },
    {
      "end": 2478434,
      "speaker": "B",
      "start": 2473466,
      "text": "Oh, totally. I still fit in, by the way, growing belly notwithstanding.",
      "id": "ep_14_ut_177"
    },
    {
      "end": 2482094,
      "speaker": "Various",
      "start": 2478474,
      "text": "I still, I want one. I want one.",
      "id": "ep_14_ut_178"
    },
    {
      "end": 2485010,
      "speaker": "B",
      "start": 2482474,
      "text": "Yeah, we should all get one. Free t shirts.",
      "id": "ep_14_ut_179"
    },
    {
      "end": 2488522,
      "speaker": "Various",
      "start": 2485162,
      "text": "I've got a, I've got a box full of them here if you want one.",
      "id": "ep_14_ut_180"
    },
    {
      "end": 2494014,
      "speaker": "B",
      "start": 2488658,
      "text": "Yeah, you don't wash, you don't wash your sweaters anymore. You just pull out a new one. Right?",
      "id": "ep_14_ut_181"
    },
    {
      "end": 2513764,
      "speaker": "Various",
      "start": 2495354,
      "text": "That was the point. Living in luxury. We'll send you the data stories. One, once you, once we have it? Yeah, yeah, yeah. Maybe you guys need help with getting them so screened or something like that. Yeah.",
      "id": "ep_14_ut_182"
    },
    {
      "end": 2520724,
      "speaker": "B",
      "start": 2516504,
      "text": "If you can handle the amount we will need. I mean, we're looking at hundred thousand here.",
      "id": "ep_14_ut_183"
    },
    {
      "end": 2528814,
      "speaker": "Various",
      "start": 2523154,
      "text": "Come on, Moritz, think big. Think big. Yeah, sure.",
      "id": "ep_14_ut_184"
    },
    {
      "end": 2539854,
      "speaker": "B",
      "start": 2530194,
      "text": "You forgot. Sort of organize that show on CBC that we will have. Stephen, is that an option? Saturday night show on CBC.",
      "id": "ep_14_ut_185"
    },
    {
      "end": 2542506,
      "speaker": "F",
      "start": 2540194,
      "text": "Sorry, you're looking for a show on CBC?",
      "id": "ep_14_ut_186"
    },
    {
      "end": 2543178,
      "speaker": "Various",
      "start": 2542610,
      "text": "Yeah.",
      "id": "ep_14_ut_187"
    },
    {
      "end": 2544694,
      "speaker": "B",
      "start": 2543306,
      "text": "Can you make that happen?",
      "id": "ep_14_ut_188"
    },
    {
      "end": 2548814,
      "speaker": "F",
      "start": 2546114,
      "text": "I think you overestimate my importance here.",
      "id": "ep_14_ut_189"
    },
    {
      "end": 2553048,
      "speaker": "B",
      "start": 2550154,
      "text": "Come on. We help you with that mobile app. And then.",
      "id": "ep_14_ut_190"
    },
    {
      "end": 2600604,
      "speaker": "F",
      "start": 2553136,
      "text": "Yeah, I worked in the strategy group, not in the actually doing something group. I did actually have another question, and it had to do with the piece that you did around the Olympics. I think it was called Emoto. Is that right? Yeah, yeah. When I was looking at that, it was obvious, like, looking at all the different phases that your data went through in terms of collecting it from the firehose, putting it through an analytics engine, and I was just impressed at the number of different stages it went through. From your perspective, when you're actually building something out, how do you know what you're working with in terms of data? Because I'm assuming all of that infrastructure was not in place on day one when you started, or maybe it was. I don't know.",
      "id": "ep_14_ut_191"
    },
    {
      "end": 2628120,
      "speaker": "B",
      "start": 2601064,
      "text": "Yeah, it wasn't even in place on day minus one. It was difficult. No, that was one of the. The biggest challenges. So what we did, actually, the first thing we did is collect some data, sports data, and then had a sort of a simulation running of, you know, replaying that stream over and over again. And so we collected, but we had only data, so we were just looking in the newspaper. Okay. Is there any sports event that we just had? The golf Masters.",
      "id": "ep_14_ut_192"
    },
    {
      "end": 2628856,
      "speaker": "F",
      "start": 2628272,
      "text": "Yeah.",
      "id": "ep_14_ut_193"
    },
    {
      "end": 2684112,
      "speaker": "B",
      "start": 2628960,
      "text": "And the soccer Euro cup. And they were both not really representative of what happened at the games because the games were much more, like massively parallel and more delayed because there were all these different time zones commenting on things later. And it was just much more echoey and much more in parallel than these individual events. So the golf Masters, they really had these nice curves, you know, they start playing again and now it's over. And the games were a big mess in that respect. And I knew, for instance, the BBC, they also wrote a full simulation of the games in order to test their. To test their software. Yeah, because they also had these real time aspects to their. And they wrote a simulation of the Olympic Games, more or less, you know, with, like, agents that would, like, send out messages and would be, like, randomized and always running.",
      "id": "ep_14_ut_194"
    },
    {
      "end": 2695162,
      "speaker": "F",
      "start": 2684288,
      "text": "So were you building out your prototype with dummy data or making assumptions on what the data was going to look like or the structure that it was going to come in at. Or did you. No. Pretty much right off the hop, just.",
      "id": "ep_14_ut_195"
    },
    {
      "end": 2739084,
      "speaker": "B",
      "start": 2695338,
      "text": "Basically guessing based on the data we collected before, that was sort of representative, but not really that representative. And then the first three or four days, we did not announce the project during the games, so a few people knew, but we sort of soft launched it, so we had a chance to tweak the parameters, and we made sure beforehand that everything was tweakable. And the other thing we did is we never worked with real absolute numbers, but everything was always relative. So, because if you don't know if you're getting 10,000 or 100,000 or a million tweets, you know, we never showed. It worked, actually, in the graphics, with an absolute number, but always with a relative to the, you know, what happened five minutes before or something like that.",
      "id": "ep_14_ut_196"
    },
    {
      "end": 2759634,
      "speaker": "F",
      "start": 2739544,
      "text": "So then I guess if you're doing everything relative to the amount of traffic based on each sport or event, if you're. How did you address difference in scale in terms of the amount of activity between one type of event and another? Because they would end up necessarily looking, if you like, small multiples, effectively.",
      "id": "ep_14_ut_197"
    },
    {
      "end": 2761286,
      "speaker": "B",
      "start": 2759974,
      "text": "Yeah, we didn't.",
      "id": "ep_14_ut_198"
    },
    {
      "end": 2762234,
      "speaker": "F",
      "start": 2761430,
      "text": "Okay.",
      "id": "ep_14_ut_199"
    },
    {
      "end": 2776114,
      "speaker": "B",
      "start": 2765254,
      "text": "No, because, you know, hundred meters. Sprint is like, millions of people tweeting at the same time, and it's, you know, polo or hockey or whatever. Nobody cares.",
      "id": "ep_14_ut_200"
    },
    {
      "end": 2777390,
      "speaker": "Various",
      "start": 2776894,
      "text": "Cool.",
      "id": "ep_14_ut_201"
    },
    {
      "end": 2778114,
      "speaker": "F",
      "start": 2777462,
      "text": "Thanks.",
      "id": "ep_14_ut_202"
    },
    {
      "end": 2780034,
      "speaker": "Various",
      "start": 2779134,
      "text": "Welcome.",
      "id": "ep_14_ut_203"
    },
    {
      "end": 2791880,
      "speaker": "B",
      "start": 2783104,
      "text": "I mean, this Olympics project, it was very difficult, I have to say. We spread it a lot.",
      "id": "ep_14_ut_204"
    },
    {
      "end": 2796376,
      "speaker": "F",
      "start": 2792072,
      "text": "Very difficult. Because of how uncertain the data was or why everything.",
      "id": "ep_14_ut_205"
    },
    {
      "end": 2808404,
      "speaker": "B",
      "start": 2796520,
      "text": "Real time. Real time. Too much data, unknown data. Big part of the technology stack, like breaking away three weeks before launch, stuff like that.",
      "id": "ep_14_ut_206"
    },
    {
      "end": 2812126,
      "speaker": "Various",
      "start": 2808814,
      "text": "But, Moritz, you still have this data, right? And you can play with.",
      "id": "ep_14_ut_207"
    },
    {
      "end": 2827262,
      "speaker": "B",
      "start": 2812230,
      "text": "Yes. So we have 12 million tweets. Yeah, we have 12 million tweets. If somebody's seriously interested, we can. We can give you a download link and if you. So we have a few scientists actually analyzing the data now. Yeah.",
      "id": "ep_14_ut_208"
    },
    {
      "end": 2828150,
      "speaker": "Various",
      "start": 2827358,
      "text": "Yeah. That's cool.",
      "id": "ep_14_ut_209"
    },
    {
      "end": 2846140,
      "speaker": "B",
      "start": 2828222,
      "text": "More like. Yeah, because now we know how things went down. And, you know, there's this nice reference to this. Real events, and then you can see how well the tweets predicted something or how much attention, which topics got at what time. Yeah, we are really interested in how that would work out.",
      "id": "ep_14_ut_210"
    },
    {
      "end": 2848624,
      "speaker": "F",
      "start": 2846332,
      "text": "So you can do it all over again for Sochi.",
      "id": "ep_14_ut_211"
    },
    {
      "end": 2857984,
      "speaker": "B",
      "start": 2851644,
      "text": "I can, really? But we're sort of working on that. Yeah. Cool to do it again. Two years or four years.",
      "id": "ep_14_ut_212"
    },
    {
      "end": 2977704,
      "speaker": "Various",
      "start": 2860874,
      "text": "Yuri, you wanted to say something before. We cannot hear you. Nothing. Okay. No. Okay. Sorry, Jim. You, you never talked so far. All right, you have to unmute yourself. Can you. Hello? Oh, okay, good, good. Sorry for interrupting earlier. I thought we were all muted by default. My mistake. I'm Jim Blandingham, data visualization hack. So far. My first introduction into it was your original blog post about how to become the interview you had with Moritz that eventually started up the data stories podcast. So thank you again for that. I've been mostly involved in JavaScript based, web based visualizations using D3, and then recently I was fortunate enough to have a post on flowingdata.com about making interactive data visualizations. But other than that, I'm really just getting started in this world of data visualization and just really enjoying the, the community. As we were talking about earlier, Kim mentioning how open and collaborative everything is, do you see that movement changing as more and more of us hacks get in and take up space in this? Will it become more competitive to a point that the collaborative nature of the area goes away? That's a good question.",
      "id": "ep_14_ut_213"
    },
    {
      "end": 2983024,
      "speaker": "B",
      "start": 2979524,
      "text": "I feel at the moment it's still very, you know, very cooperative.",
      "id": "ep_14_ut_214"
    },
    {
      "end": 2985180,
      "speaker": "Various",
      "start": 2983484,
      "text": "Yeah, I agree. Yeah.",
      "id": "ep_14_ut_215"
    },
    {
      "end": 3005254,
      "speaker": "B",
      "start": 2985292,
      "text": "So, and I don't see that going away. And probably it's because, I mean, everybody has this feeling, okay, we're in this together, you know, it's, we need to sort of advance the field. It's important. And also, there's not, I mean, there is a big demand in the field, and so it's not really that we all have to compete. So if you don't get that one job, you take the other one.",
      "id": "ep_14_ut_216"
    },
    {
      "end": 3033872,
      "speaker": "Various",
      "start": 3006474,
      "text": "I mean, every person I know who is doing this thing professionally, the feedback I get is always, look, I get so many requests that I don't have a problem right now. So how long is it gonna last? I have no idea. But I don't know if it's just a bubble or. No, but we always discuss that. It's, I mean, it's. Yeah, yeah, it's a kind of, I.",
      "id": "ep_14_ut_217"
    },
    {
      "end": 3037204,
      "speaker": "B",
      "start": 3033888,
      "text": "Mean, in which part of the hype cycle are we. Yeah, yeah.",
      "id": "ep_14_ut_218"
    },
    {
      "end": 3064940,
      "speaker": "Various",
      "start": 3039544,
      "text": "But who cares? I mean, as long as we are having, maybe it's, it's not the real question. Right. Let's just wait now. Yeah. I think that we're on a wave that's going to be growing. I mean, look at the elections and what's happened as a result of data science and everything. I think we're actually in a very good position. And I I, I would argue against anybody saying that we're in a bubble.",
      "id": "ep_14_ut_219"
    },
    {
      "end": 3065824,
      "speaker": "B",
      "start": 3065092,
      "text": "Yeah.",
      "id": "ep_14_ut_220"
    },
    {
      "end": 3072224,
      "speaker": "Various",
      "start": 3066844,
      "text": "Yeah. I don't know. I just say something so.",
      "id": "ep_14_ut_221"
    },
    {
      "end": 3102674,
      "speaker": "B",
      "start": 3074004,
      "text": "Right. And it's like, I mean both the Obama team but as well as how's the New York Times guy called? Sorry, I'm blanking out here. The chief statistician, Nate Silver. Yeah, exactly. Thanks yoi. I mean both of that shows that it's actually, it helps actually, you know, it's not like it makes things better but it prettier or so, or look better but it actually helps in performing better. So probably that's, yeah.",
      "id": "ep_14_ut_222"
    },
    {
      "end": 3134034,
      "speaker": "C",
      "start": 3104134,
      "text": "The only thing I worry about in terms of this being a bubble, I often waver in this as well. But I think that we can't underestimate like the fickleness of our clients. But as soon as there's some new other trendy thing to go along to, they're going to hop on that. So I'm just playing devil's advocate. I know we're all incredibly important, but I worry about the next big thing.",
      "id": "ep_14_ut_223"
    },
    {
      "end": 3162390,
      "speaker": "Various",
      "start": 3134614,
      "text": "I welcome when this stops becoming so trendy. Actually I think that would be a great thing. And people who contact us are always serious rather than they just want cool infographics. I mean half of the projects that come our way are people who really just want to have like Nicholas Felton style infographics made in five days. You know, it drives me nuts. So hopefully, hopefully it will keep maturing.",
      "id": "ep_14_ut_224"
    },
    {
      "end": 3162806,
      "speaker": "B",
      "start": 3162542,
      "text": "Yeah.",
      "id": "ep_14_ut_225"
    },
    {
      "end": 3163454,
      "speaker": "Various",
      "start": 3162830,
      "text": "I was going to, I was going.",
      "id": "ep_14_ut_226"
    },
    {
      "end": 3164114,
      "speaker": "F",
      "start": 3163454,
      "text": "To ask.",
      "id": "ep_14_ut_227"
    },
    {
      "end": 3169914,
      "speaker": "Various",
      "start": 3167314,
      "text": "Yuri, you want to say something? Yes.",
      "id": "ep_14_ut_228"
    },
    {
      "end": 3294764,
      "speaker": "D",
      "start": 3169954,
      "text": "I have a question that is related to competitiveness versus collaboration and I guess Kim knows a lot about it. It's the issue of visualization that matters in the sense of like periscopic is doing data visualization for social causes, humanitarian causes, environmental causes. Three years ago in 2009 at this week there was a panel on changing the world with data visualization. This year at IO, Kim, you were involved. There was a panel called can bar charts change the world? And it might all sound very naive, but my real heroes in data visualization are the people that work on visualizing things that matter, on trying to, in the words of the Spanish visualization organization, visuality, working to improve our world. One data visualization project at a time. And I wonder whether there would be space for us to create something like data kind. Jake Pory where organizing. There's lots of things going on with open data hackathons but very little of it is geared towards the visualization part. Could we start visualizers without borders? Could we do more stuff like Kim is doing at periscopic? Would it make sense to start something like visualization that matters, where people could actually ask questions and get help from us, depending on whether they need technical help, design help, or just some ideas about their visualization to help with their causes. Non governmental organizations, citizen activist groups and things like that. Again, those are my real heroes in data visualization. Maybe Kim can say something about this.",
      "id": "ep_14_ut_229"
    },
    {
      "end": 3399934,
      "speaker": "C",
      "start": 3295584,
      "text": "Sure. I think that Jake is doing fantastic work. I really love what he's doing, and I think that he is trying to make visualization a big part of, of data kind. And so I, you know, I think that it's. It's a part that we, you know, there's a bit of a struggle with it because it tends to be the time consuming part of the data science. And so when they have hackathons, it's, you know, there's a lot of time spent in gathering and cleaning up and getting data in some format that's usable. And then it's like, okay, well, now we've just exhausted ourselves. Let's just dump it into a map, because it's. That's the easy way to get it out into a visual form. So I think there's definitely room for bringing the visualization aspect into that. And I agree that that's where the importance is, is like taking that raw stuff and pumping it out into something that makes sense, something that's compelling for people. But, I mean, there's certainly room for anybody who's wanting to take on that challenge. I certainly would love for more people to be doing good things with data. I love visuality. There's a group at the UN called un global Pulse, which I think is just doing some amazing things with big data and using it in ways that we, most people haven't thought of before for doing a lot of social good in the world. So there are definitely people out there. And I think that, you know, the community being so collaborative and so welcoming that, you know, you just have to knock on someone's door to suggest an idea and people rally around it.",
      "id": "ep_14_ut_230"
    },
    {
      "end": 3416894,
      "speaker": "D",
      "start": 3402954,
      "text": "Kim and Periscopic are doing a lot with that and the un pulse and visuality. But could we also, the rest of us, do more in that direction?",
      "id": "ep_14_ut_231"
    },
    {
      "end": 3425404,
      "speaker": "Various",
      "start": 3420184,
      "text": "Well, it's always hard. Oh, Misha, you want to say something?",
      "id": "ep_14_ut_232"
    },
    {
      "end": 3484294,
      "speaker": "I",
      "start": 3425944,
      "text": "Yeah, sorry. Just to offer a data centric perspective, I'm also involved with the Open Knowledge foundation, and I was one of the organizers of the Open Knowledge festival in Helsinki a few months ago. And there, there was a lot of different organizations from kind of doing different things around data, whether it's open science or open development. And there was about 13 topic streams, but not to make this sound like an advertisement for the event, but what I meant to say is that there's increasingly a big movement to open up data, whether it's from official sources like the World bank, or to crowdsource it somehow by grassroots movements. And they're all really passionate about doing that, but they're just not really good at communicating it. So there's definitely a case for Yuri's suggestion.",
      "id": "ep_14_ut_233"
    },
    {
      "end": 3590174,
      "speaker": "Various",
      "start": 3486954,
      "text": "Yeah, I think what would be really interesting. So I've been thinking about along the same lines many times, but I never came to the point of convincing myself that we need something that is specific to visualization. Because in a way, in order to build up this whole thing like data kind like the folks at Datakind are doing, you need a lot of resources, a lot of effort, a lot of connections and so on. So I'm not clear whether it's better to create a thousand different, I don't know, a whole constellation of things, or trying to make one that is really, really strong. So personally, I think it's much, much more interesting from my point of view, to try to do more visualization within entities like Datakind, where maybe, I don't know right now, they are doing more, I don't know, machine learning or stuff like that. I actually don't know exactly what they are doing, but I think it would much more pay off trying to do more visualization within the existing organization, rather than trying to come up with one that says, oh, we visualization folks are also doing that because it's never a visualization problem, it's a visualization problem, a data analysis problem, data collection problem. So these things of trying to segment everything in sectors, I think it's detrimental to the old, to the big picture, to the goal, right, to the world goal. So I much more prefer trying to have something that includes people from different, that is able to work from different angles, rather than, again, as I said before, having the vis folks, the machine learning folks, the data curation folks, and so on.",
      "id": "ep_14_ut_234"
    },
    {
      "end": 3600696,
      "speaker": "B",
      "start": 3592344,
      "text": "But it would be nice to have some, you know, to actually have a pool of people interested in that and maybe form some interdisciplinary teams or so.",
      "id": "ep_14_ut_235"
    },
    {
      "end": 3603584,
      "speaker": "Various",
      "start": 3600880,
      "text": "Just absolutely.",
      "id": "ep_14_ut_236"
    },
    {
      "end": 3621144,
      "speaker": "B",
      "start": 3603624,
      "text": "I don't know, how much does everybody know about Jake's? So the people they work with typically. Is that more data scientists or more technical people? Is that the general impression or wouldn't like it, somebody interested in visualization also be a good match for data kind?",
      "id": "ep_14_ut_237"
    },
    {
      "end": 3660074,
      "speaker": "D",
      "start": 3624084,
      "text": "My impression is, but Kim, you might know more about it, is that a lot of the people doing this fantastic stuff around the data kind events and the open data hackathons are a lot of what these days we call data scientists sexy people, a lot of machine learning, a lot of technical people, a lot of coders, a lot of programmers, and to my knowledge, but I haven't really been involved yet. I haven't really seen many signs of actually graphic designers, for example, or visualization design people helping.",
      "id": "ep_14_ut_238"
    },
    {
      "end": 3702314,
      "speaker": "Various",
      "start": 3661454,
      "text": "Yeah, but this is what I'm saying. I think what I would much more prefer is having people like us reaching out to them and say, look, I can bring this, my expertise, on the table, and I'm sure they would be really, really happy to have our help. Okay, can I ask really quick? Sorry, I don't understand that last comment, because there are a lot of graphic designers right now in the field, a lot of artists. When you look at Jeremy Thorpe, even Moritz, and us at pitch Interactive, we really traverse on that sort of boundary between art and functional data visualization. I don't feel that there's any lack in that, necessarily.",
      "id": "ep_14_ut_239"
    },
    {
      "end": 3706726,
      "speaker": "D",
      "start": 3702934,
      "text": "I was talking specifically about the data kind events.",
      "id": "ep_14_ut_240"
    },
    {
      "end": 3730374,
      "speaker": "Various",
      "start": 3706910,
      "text": "Yeah. Oh, I see. Okay. Are you aware of data kind? Okay, Benjamin, I have a Comcast account, which I'm going to call after this, and kind of yell at them for this connection. It's kind of lagging. That's my excuse. Okay, Benjamin, you want to say something?",
      "id": "ep_14_ut_241"
    },
    {
      "end": 3821914,
      "speaker": "E",
      "start": 3730714,
      "text": "I just wanted to add, like, a quick perspective from our side. We are involved in the swiss chapter, so to speak, of open data. It's called Opendata Ch, and it should be by now, the swiss chapter of the Open Knowledge foundation. And we were involved in a lot of those hackathons at the time. And I would agree that from our perspective, designers tend to be a little bit shy of these things. I don't know if it's just the general term of a hackathon not being something that a designer is involved in. But whenever I do see designers show up, and when we, or I with my team go there, design is always much appreciated by the technologists. And so I definitely feel, just to the point that you raised Enrico, that interdisciplinary or multidisciplinary teams can work much more efficient on projects like this, because a pure design focused team would get stuck when they don't find the data in the form that they needed. And on the other hand, a data scientist could get stuck when it comes to communicating the results. And so, therefore, I really feel that this dialogue, it should be a dialogue rather than two separate teams or camps.",
      "id": "ep_14_ut_242"
    },
    {
      "end": 3835054,
      "speaker": "B",
      "start": 3823174,
      "text": "And, I mean, we're just coming out of a weekend where more than 1000 students were spending 60 something hours, like hacking visualizations. So I think there's a huge potential there.",
      "id": "ep_14_ut_243"
    },
    {
      "end": 3873924,
      "speaker": "Various",
      "start": 3836874,
      "text": "Yeah. But I think Yuri raised a good point and it would be fantastic to see more visualization happening in these areas. I think there is a lot of potential there. And me myself, I have some plans in trying to do more work in this direction as far as I can. Okay, we've been talking for almost 1 hour now, or exactly 1 hour. I don't know. Do you, does any of you have any other comments or questions? Otherwise I would try to close it here. Otherwise it's going to be too long. Any other questions?",
      "id": "ep_14_ut_244"
    },
    {
      "end": 3882948,
      "speaker": "B",
      "start": 3874004,
      "text": "I should say hi from Moebio from Santiago. He got kicked out and then he didn't get in anymore. It's a tough life here.",
      "id": "ep_14_ut_245"
    },
    {
      "end": 3884036,
      "speaker": "Various",
      "start": 3883036,
      "text": "It's a tough life.",
      "id": "ep_14_ut_246"
    },
    {
      "end": 3884556,
      "speaker": "F",
      "start": 3884140,
      "text": "Yeah.",
      "id": "ep_14_ut_247"
    },
    {
      "end": 3891384,
      "speaker": "B",
      "start": 3884620,
      "text": "And also we had a few people who couldn't make or they came too late and then it was full. So we will have to do it again.",
      "id": "ep_14_ut_248"
    },
    {
      "end": 3933364,
      "speaker": "Various",
      "start": 3891924,
      "text": "Yeah. This was our first experiment and to me it looks like it went well. I really enjoyed speaking with all of you guys. I think it was quite smooth. I still don't know what's the final outcome. That's a surprise for all of us. So supposedly Google is taking care of it and this whole thing is gonna be up to appear in appearing in my personal YouTube account. And then let's see what we can do with that. We'll publish something during, during the next days. Okay. And yeah, thanks a lot for participating. It's been great. Really great. I really enjoyed it. Morris, you want to say something before leaving?",
      "id": "ep_14_ut_249"
    },
    {
      "end": 3937308,
      "speaker": "B",
      "start": 3933444,
      "text": "It was super nice. It was great. It was really like meeting you. It's pretty fantastic.",
      "id": "ep_14_ut_250"
    },
    {
      "end": 3939146,
      "speaker": "Various",
      "start": 3937396,
      "text": "Yeah. We should actually do it more often.",
      "id": "ep_14_ut_251"
    },
    {
      "end": 3941194,
      "speaker": "B",
      "start": 3939300,
      "text": "Yeah, I think so too.",
      "id": "ep_14_ut_252"
    },
    {
      "end": 3943574,
      "speaker": "Various",
      "start": 3942014,
      "text": "Okay. Thanks a lot.",
      "id": "ep_14_ut_253"
    },
    {
      "end": 3945206,
      "speaker": "B",
      "start": 3943734,
      "text": "Thanks. Bye.",
      "id": "ep_14_ut_254"
    }
  ],
  "confidence": 0.915858946211805,
  "audio_duration": 3955,
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_status_code": null,
  "webhook_auth": false,
  "webhook_auth_header_name": null,
  "speed_boost": false,
  "auto_highlights_result": null,
  "auto_highlights": false,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_audio_quality": null,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "content_safety": false,
  "iab_categories": true,
  "content_safety_labels": {
    "status": "unavailable",
    "results": [],
    "summary": {}
  },
  "language_detection": false,
  "language_detection_threshold": null,
  "language_confidence": null,
  "custom_spelling": null,
  "throttled": false,
  "auto_chapters": true,
  "summarization": false,
  "summary_type": null,
  "summary_model": null,
  "custom_topics": false,
  "topics": [],
  "speech_threshold": null,
  "speech_model": "best",
  "chapters": [
    {
      "summary": "When data stories hangout. We will try to unmute you all by going through the list. You can raise your hand. The first one is raising the hand. But you have to do it yourself.",
      "gist": "Unmasking a data story",
      "headline": "We will try to unmute you all by going through the list",
      "start": 23080,
      "end": 78814,
      "id": "ep_14_ch_0"
    },
    {
      "summary": "Kim Santiago is here. Let's see if I can show you some Brooklyn here. Yeah, you cannot see it, but I swear it's Brooklyn. Actually, he is somewhere in Rome, actually.",
      "gist": "Kim Santiago shows off her Brooklyn windows",
      "headline": "Kim Santiago is here. How are you guys doing? Nice to see you",
      "start": 78894,
      "end": 114184,
      "id": "ep_14_ch_1"
    },
    {
      "summary": "Kim is a partner at periscopic data visualization boutique in Portland. Just finished up a project for the Hewlett foundation, which was a lot of fun. Just got back from the visualized conference in New York.",
      "gist": "Data Visualization: The Fun Stuff",
      "headline": "Kim is a partner at periscopic data visualization boutique in Portland",
      "start": 116594,
      "end": 208062,
      "id": "ep_14_ch_2"
    },
    {
      "summary": "Aside from the conference, I actually had this really beautiful encounter with Benjamin and Christian. Just seeing them present their work in person was, you know, they were the highlight. And then they threw a great party, too, which was a lot of fun.",
      "gist": "The Conference and the",
      "headline": "Aside from Santiago and Benjamin, what was your highlight from the conference",
      "start": 208238,
      "end": 370644,
      "id": "ep_14_ch_3"
    },
    {
      "summary": "Elko: I presented basically an analysis of our own process. I concluded ten different phases that I found shared by most of the practitioners. If we could actually bring it in some form, that would make actually sense. We should do an episode with Benjamin and probably Miriam.",
      "gist": "The Data-Visualization Process",
      "headline": "Santiago and Benjamin, what did you present at visualize",
      "start": 371264,
      "end": 669786,
      "id": "ep_14_ch_4"
    },
    {
      "summary": "The idea was to argue or to show that information visualization is a cultural medium. The highlight of my talk was when I presented the work of a ten years old kid that created amazing handmade visualization. I want to create a website in which you will have all the links to all the resources I feature in the presentation.",
      "gist": "At the Conference: Information visualization",
      "headline": "Santiago: I think Benjamin's presentation was very interesting",
      "start": 669850,
      "end": 879354,
      "id": "ep_14_ch_5"
    },
    {
      "summary": "Santiago built his own tool to come up with the presentation. It's like HTML with frames, nothing more than that. And then the cloud, the clock in the bottom. Are you going to outsource this tool or what?",
      "gist": "How to present your projects in a meaningful way",
      "headline": "You built your own tool to come up with the presentation",
      "start": 880224,
      "end": 959864,
      "id": "ep_14_ch_6"
    },
    {
      "summary": "Benjamin's outline of process was amazing. Even though he's dissatisfied with it, I think it was really wonderful. And then Santiago presented amazing work. For most people, it's incredibly helpful for people to see what that entire process is.",
      "gist": "The Visualization Conference",
      "headline": "Benjamin and Santiago presented amazing work at the conference",
      "start": 961444,
      "end": 1084144,
      "id": "ep_14_ch_7"
    },
    {
      "summary": "Yorja Engelhardt is a researcher and teacher in data visualization at the University of Amsterdam. She is exploring data visualization in Costa Rica. She recommends Yuri's PhD thesis about the language of graphics. She loves the booming field of data journalism.",
      "gist": "In the Elevator with Yuri Cohen",
      "headline": "Yorja Engelhardt is exploring data visualization in Costa Rica",
      "start": 1084964,
      "end": 1298302,
      "id": "ep_14_ch_8"
    },
    {
      "summary": "Alberto is supervising master's theses in data visualization from his hammock under the papaya tree. South America is really booming in terms of visualization, especially journalism. For him, it's amazing to be in Central America and find all these data visualization things going on.",
      "gist": "The rise of data visualization in Latin America",
      "headline": "South America is really booming in terms of data visualization, especially journalism",
      "start": 1298358,
      "end": 1471834,
      "id": "ep_14_ch_9"
    },
    {
      "summary": "Okay, so we have a few more people here. Who's next? Raise your hand. Don't be shy. Here we go. Tiven.",
      "gist": "The Frozen Heads",
      "headline": "Who's next? Raise your hand. Okay, so we have a few more people here. Who's next",
      "start": 1472894,
      "end": 1482854,
      "id": "ep_14_ch_10"
    },
    {
      "summary": "How do you scale down the number of data points as the screen size decreases? What are the key takeaways that a mobile user would be looking for? I haven't seen that great data visualization on mobiles, honestly.",
      "gist": "How to Scale a Data Set for Mobile Users",
      "headline": "How do you scale down the number of data points as screen size decreases",
      "start": 1483554,
      "end": 1878444,
      "id": "ep_14_ch_11"
    },
    {
      "summary": "Okay, any other comments or questions you guys have? Karen, Karen, we cannot hear you. You can maybe type something? Can you hear me now? Oh yeah. Fantastic.",
      "gist": "QUESTIONS FOR THE AUDIENCE",
      "headline": "Okay, any other comments or questions you guys have? Karen, Karen, we cannot hear you. You can maybe type something",
      "start": 1880504,
      "end": 1896904,
      "id": "ep_14_ch_12"
    },
    {
      "summary": "Yuri is just starting his PhD in information visualization at UT Dallas. His question is how to narrow down and find a good research topic. How do you define what's research versus what's a project? It took him eight years to finish his PhD thesis.",
      "gist": "How to narrow down your research topic",
      "headline": "Yuri is starting his PhD in information visualization at UT Dallas",
      "start": 1897644,
      "end": 2128774,
      "id": "ep_14_ch_13"
    },
    {
      "summary": "If you are in a CS department, the people who are going to evaluate your work are computer scientists. One has to learn a lot of negotiation skills. visualization can play a good role as well. A question of finding the right language to explain it.",
      "gist": "A message on data science and the future",
      "headline": "If you are in a CS department, the people who are evaluating your work are computer scientists",
      "start": 2129074,
      "end": 2446414,
      "id": "ep_14_ch_14"
    },
    {
      "summary": "Moritz: Let's say hi to Wes. Wes is founder of Pigeon Deactivation. I'm wearing their t shirt. We should all get one. Sort of organize that show on CBC that we will have.",
      "gist": "Pigeon Deactivation T-Shirt",
      "headline": "Wes is founder of Pigeon Deactivation. We should say hi to Wes",
      "start": 2448714,
      "end": 2557884,
      "id": "ep_14_ch_15"
    },
    {
      "summary": "How do you know what you're working with in terms of data? From your perspective, when you're actually building something out. The games were a big mess in that respect. Everything was always relative.",
      "gist": "The Making of Twitter's Analytics",
      "headline": "I did actually have another question about your simulation around the Olympics",
      "start": 2560984,
      "end": 2778114,
      "id": "ep_14_ch_16"
    },
    {
      "summary": "We have 12 million tweets. If somebody's seriously interested, we can. We can give you a download link and if you. So we have a few scientists actually analyzing the data now. So you can do it all over again for Sochi.",
      "gist": "Olympics 2016: The Twitter Project",
      "headline": "Moritz: This Olympics project was very difficult, very difficult",
      "start": 2779134,
      "end": 2876614,
      "id": "ep_14_ch_17"
    },
    {
      "summary": "Jim Blandingham is a data visualization hack. Do you see that movement changing as more and more of us hacks get in and take up space in this? Will it become more competitive to a point that the collaborative nature of the area goes away?",
      "gist": "Jim Blandingham on the Data Visualization Hype",
      "headline": "Jim Blandingham: I worry about the next big data visualization trend",
      "start": 2877634,
      "end": 3162390,
      "id": "ep_14_ch_18"
    },
    {
      "summary": "Could we start visualizers without borders? Could we do more stuff like Kim is doing at periscopic? Would it make sense to start something like visualization that matters? I certainly would love for more people to be doing good things with data.",
      "gist": "Could we start a non-profit organization around visualization?",
      "headline": "Yuri: I wonder whether there would be space for data kind visualization",
      "start": 3162542,
      "end": 3853894,
      "id": "ep_14_ch_19"
    },
    {
      "summary": "This was our first experiment and to me it looks like it went well. I really enjoyed speaking with all of you guys. I still don't know what's the final outcome. Google is taking care of it and this whole thing is gonna be up to appear in appearing in my personal YouTube account.",
      "gist": "A chat with Google Glass",
      "headline": "This was our first experiment and to me it looks like it went well",
      "start": 3856394,
      "end": 3945206,
      "id": "ep_14_ch_20"
    }
  ],
  "disfluencies": false,
  "entity_detection": false,
  "sentiment_analysis": false,
  "sentiment_analysis_results": null,
  "entities": null,
  "speakers_expected": null,
  "summary": null,
  "custom_topics_results": null,
  "episode_num": 14,
  "episode_metadata": {
    "speakers": [
      "Various"
    ],
    "WPid": "97",
    "url": "https://datastori.es/podlove/file/170/s/feed/c/mp3/datastories-14.mp3",
    "episode_title": "Data Stories Hangout"
  }
}