{
  "id": "9a065d0c-8b82-4f09-bdc0-aeea17face0b",
  "language_model": "assemblyai_default",
  "acoustic_model": "assemblyai_default",
  "language_code": "en_us",
  "status": "completed",
  "audio_url": "https://datastori.es/podlove/file/355/s/feed/c/mp3/Datastories-e34.mp3",
  "utterances": [
    {
      "end": 10190,
      "speaker": "Moritz Stefaner",
      "start": 6160,
      "text": "Hey everyone. Data stories number 34. Hey, Enrico, how you doing?",
      "id": "ep_34_ut_0"
    },
    {
      "end": 12038,
      "speaker": "Enrico Bertini",
      "start": 10270,
      "text": "Hey, I'm doing great. And you?",
      "id": "ep_34_ut_1"
    },
    {
      "end": 14686,
      "speaker": "Moritz Stefaner",
      "start": 12174,
      "text": "It's good. Yeah, I'm fine.",
      "id": "ep_34_ut_2"
    },
    {
      "end": 25324,
      "speaker": "Enrico Bertini",
      "start": 14878,
      "text": "I like that you are starting the show from time to time. Yeah, it leaves some stress from my side. You should try to fake it.",
      "id": "ep_34_ut_3"
    },
    {
      "end": 27940,
      "speaker": "Moritz Stefaner",
      "start": 25462,
      "text": "Yeah, I'll get a Romanian accent.",
      "id": "ep_34_ut_4"
    },
    {
      "end": 32540,
      "speaker": "Enrico Bertini",
      "start": 28240,
      "text": "Yeah, yeah, I can try with German. I spent some time with.",
      "id": "ep_34_ut_5"
    },
    {
      "end": 36664,
      "speaker": "Moritz Stefaner",
      "start": 34440,
      "text": "So what's up, Enrico? Any news?",
      "id": "ep_34_ut_6"
    },
    {
      "end": 52984,
      "speaker": "Enrico Bertini",
      "start": 36792,
      "text": "Good, good, good. Lots of work. I'm teaching and my course is going well. Lots of excitement coming from the class. You might have seen my diaries. I've been writing a diary about what I'm teaching in class.",
      "id": "ep_34_ut_7"
    },
    {
      "end": 56580,
      "speaker": "Moritz Stefaner",
      "start": 53072,
      "text": "Yeah, your blog posts are really good. Recommended reading.",
      "id": "ep_34_ut_8"
    },
    {
      "end": 82770,
      "speaker": "Enrico Bertini",
      "start": 57540,
      "text": "And I think what is fun is that I'm really trying to capture the kind of feedback that I get in class and the things that make me think much deeper about visualization, these strange things that we do. And so it's fun. And on the research side, I'm working on a couple of papers. I'm really excited about the research that we are doing and hopefully I will be able to show some stuff soon to the public.",
      "id": "ep_34_ut_9"
    },
    {
      "end": 84654,
      "speaker": "Moritz Stefaner",
      "start": 83150,
      "text": "This deadlines are coming up.",
      "id": "ep_34_ut_10"
    },
    {
      "end": 93530,
      "speaker": "Enrico Bertini",
      "start": 84742,
      "text": "This deadline is coming up and my students are working hard on a couple of ideas we have. So I'm really excited. And you?",
      "id": "ep_34_ut_11"
    },
    {
      "end": 94998,
      "speaker": "Moritz Stefaner",
      "start": 94350,
      "text": "Yeah, good.",
      "id": "ep_34_ut_12"
    },
    {
      "end": 95890,
      "speaker": "Enrico Bertini",
      "start": 95054,
      "text": "Anything new?",
      "id": "ep_34_ut_13"
    },
    {
      "end": 112282,
      "speaker": "Moritz Stefaner",
      "start": 96230,
      "text": "Yeah, I just came back from a really nice conference in the Netherlands, IC 14. So it's an infographics conference or information design conference. And they had me over and Nicholas Felton and Stephanie Posavec and a few other really good speakers. Yeah.",
      "id": "ep_34_ut_14"
    },
    {
      "end": 118070,
      "speaker": "Enrico Bertini",
      "start": 112386,
      "text": "Cool. Did you hang around? Of course.",
      "id": "ep_34_ut_15"
    },
    {
      "end": 139122,
      "speaker": "Moritz Stefaner",
      "start": 119450,
      "text": "John Grimwade was there as well. He's like an infographics legend and he spoke at every single of these conferences. And this time he decided to disguise himself as a different guy and made up a name, had a wig and so on. It was quite a travesty. It was nice.",
      "id": "ep_34_ut_16"
    },
    {
      "end": 140370,
      "speaker": "Enrico Bertini",
      "start": 139266,
      "text": "Cool, cool, cool. Yeah.",
      "id": "ep_34_ut_17"
    },
    {
      "end": 149122,
      "speaker": "Moritz Stefaner",
      "start": 140410,
      "text": "Nicholas Felton has a nice new report coming up, so he showed us a few, a little preview and also a bit on the reporter app and so on.",
      "id": "ep_34_ut_18"
    },
    {
      "end": 154466,
      "speaker": "Enrico Bertini",
      "start": 149226,
      "text": "And he has the new app, right? I downloaded the app, but I didn't start using it.",
      "id": "ep_34_ut_19"
    },
    {
      "end": 162524,
      "speaker": "Moritz Stefaner",
      "start": 154538,
      "text": "Yeah, no, it's really pretty slick and works quite well. Maybe we should have him on. It happened.",
      "id": "ep_34_ut_20"
    },
    {
      "end": 168320,
      "speaker": "Enrico Bertini",
      "start": 162652,
      "text": "Yes, sometime soon. You have such a long list right now, we can see.",
      "id": "ep_34_ut_21"
    },
    {
      "end": 185116,
      "speaker": "Moritz Stefaner",
      "start": 169100,
      "text": "Yeah. And other than that, we now have help with the audio editing, which is awesome because for me. And so the last episode, number 33, if you heard that one, it was edited by Fabricio Tavares. Thanks, Fabricio.",
      "id": "ep_34_ut_22"
    },
    {
      "end": 187324,
      "speaker": "Enrico Bertini",
      "start": 185188,
      "text": "Thanks, Fabricio. Fantastic job.",
      "id": "ep_34_ut_23"
    },
    {
      "end": 191840,
      "speaker": "Moritz Stefaner",
      "start": 187412,
      "text": "We have, or maybe even three audio editors helping us out.",
      "id": "ep_34_ut_24"
    },
    {
      "end": 204590,
      "speaker": "Enrico Bertini",
      "start": 193190,
      "text": "It's great to have some help from you guys. Fantastic. And it's great to know that this help comes from the community, from the listeners. That's awesome.",
      "id": "ep_34_ut_25"
    },
    {
      "end": 220944,
      "speaker": "Moritz Stefaner",
      "start": 204670,
      "text": "If you're listening and you think you can do that, it's really not terribly hard to listen to the episode. Yeah, it takes a while, that's clear. But it's also, we're gonna have our mean. Drop us a line. We are happy about anybody who helps us.",
      "id": "ep_34_ut_26"
    },
    {
      "end": 224312,
      "speaker": "Enrico Bertini",
      "start": 221072,
      "text": "Yeah. Or if you want to help us with something else, let us know.",
      "id": "ep_34_ut_27"
    },
    {
      "end": 225024,
      "speaker": "Moritz Stefaner",
      "start": 224456,
      "text": "That's true.",
      "id": "ep_34_ut_28"
    },
    {
      "end": 227060,
      "speaker": "Enrico Bertini",
      "start": 225072,
      "text": "And any kind of help is welcome.",
      "id": "ep_34_ut_29"
    },
    {
      "end": 229900,
      "speaker": "Moritz Stefaner",
      "start": 228920,
      "text": "Or food.",
      "id": "ep_34_ut_30"
    },
    {
      "end": 231980,
      "speaker": "Enrico Bertini",
      "start": 230360,
      "text": "Whatever. Whatever.",
      "id": "ep_34_ut_31"
    },
    {
      "end": 235696,
      "speaker": "Moritz Stefaner",
      "start": 234200,
      "text": "So, shall we?",
      "id": "ep_34_ut_32"
    },
    {
      "end": 240500,
      "speaker": "Enrico Bertini",
      "start": 235848,
      "text": "Shall we introduce our guest? Yeah, another big guest today. Good.",
      "id": "ep_34_ut_33"
    },
    {
      "end": 245104,
      "speaker": "Moritz Stefaner",
      "start": 241440,
      "text": "So today we have Simon Rogers from Twitter. Hey, Simon.",
      "id": "ep_34_ut_34"
    },
    {
      "end": 245360,
      "speaker": "Enrico Bertini",
      "start": 245152,
      "text": "Hi.",
      "id": "ep_34_ut_35"
    },
    {
      "end": 247460,
      "speaker": "Simon Rogers",
      "start": 245400,
      "text": "Hi, guys. Hi. How you doing?",
      "id": "ep_34_ut_36"
    },
    {
      "end": 249220,
      "speaker": "Moritz Stefaner",
      "start": 248340,
      "text": "Good, how are you?",
      "id": "ep_34_ut_37"
    },
    {
      "end": 252680,
      "speaker": "Simon Rogers",
      "start": 249260,
      "text": "Good. Great. The sun is shining here and it's nice and warm.",
      "id": "ep_34_ut_38"
    },
    {
      "end": 255800,
      "speaker": "Enrico Bertini",
      "start": 253180,
      "text": "Oh, don't tell me. Come on, Simon.",
      "id": "ep_34_ut_39"
    },
    {
      "end": 258172,
      "speaker": "Simon Rogers",
      "start": 256460,
      "text": "I'm just taunting and holding.",
      "id": "ep_34_ut_40"
    },
    {
      "end": 264800,
      "speaker": "Enrico Bertini",
      "start": 258196,
      "text": "I. Yeah. So finally we have another nice British accent on the show.",
      "id": "ep_34_ut_41"
    },
    {
      "end": 266188,
      "speaker": "Moritz Stefaner",
      "start": 265340,
      "text": "That was the plan.",
      "id": "ep_34_ut_42"
    },
    {
      "end": 267652,
      "speaker": "Enrico Bertini",
      "start": 266244,
      "text": "Yeah, that was the plan.",
      "id": "ep_34_ut_43"
    },
    {
      "end": 270120,
      "speaker": "Simon Rogers",
      "start": 267836,
      "text": "Now I know why I was invited. Okay.",
      "id": "ep_34_ut_44"
    },
    {
      "end": 279368,
      "speaker": "Enrico Bertini",
      "start": 272420,
      "text": "Yeah. But you have a big competitor. Andy Kirk has been here for, I don't know, many times already. Three or four times.",
      "id": "ep_34_ut_45"
    },
    {
      "end": 280168,
      "speaker": "Moritz Stefaner",
      "start": 279504,
      "text": "Maybe four.",
      "id": "ep_34_ut_46"
    },
    {
      "end": 282940,
      "speaker": "Simon Rogers",
      "start": 280224,
      "text": "Yeah, we'll start sound alike after a while.",
      "id": "ep_34_ut_47"
    },
    {
      "end": 291336,
      "speaker": "Enrico Bertini",
      "start": 286800,
      "text": "Yeah. So, Simon, you want to introduce yourself? That's the way we do it here.",
      "id": "ep_34_ut_48"
    },
    {
      "end": 292160,
      "speaker": "Simon Rogers",
      "start": 291448,
      "text": "Okay.",
      "id": "ep_34_ut_49"
    },
    {
      "end": 295544,
      "speaker": "Enrico Bertini",
      "start": 292280,
      "text": "Just for the few people out there who don't know who you are, I.",
      "id": "ep_34_ut_50"
    },
    {
      "end": 313670,
      "speaker": "Simon Rogers",
      "start": 295552,
      "text": "Think for the lots of people who don't know who I am. So I work at Twitter in San Francisco. I'm data editor here. And before I was here, I worked for the Guardian in London, where I set up the datablog. And I've got some books out, and I kind of write about data journalism on my blog as well.",
      "id": "ep_34_ut_51"
    },
    {
      "end": 326810,
      "speaker": "Enrico Bertini",
      "start": 315890,
      "text": "Great. So, Simon, when did you start your career at Guardian? Has it been a very good.",
      "id": "ep_34_ut_52"
    },
    {
      "end": 332910,
      "speaker": "Simon Rogers",
      "start": 326970,
      "text": "It was years and years ago. I started there in 98, and I was the launch editor of the Guardian news website.",
      "id": "ep_34_ut_53"
    },
    {
      "end": 333876,
      "speaker": "Moritz Stefaner",
      "start": 333260,
      "text": "Oh, wow.",
      "id": "ep_34_ut_54"
    },
    {
      "end": 383960,
      "speaker": "Simon Rogers",
      "start": 333948,
      "text": "So that was my first job. And that was when nobody wanted to work online because everybody thought it was a bit of a dead end. So that was my job. And then I went to the paper, and my first day on the paper was September 10, 2001. So, obviously the next day, the world changed forever. And after that, I guess I found myself working increasingly with graphics and visuals because they needed somebody to do it. Nobody really wanted to. And I was thinking, well, these are proper pieces of editorial. They might be visual or they might be graphical, but they're as much editorial as a thousand word article, and probably more people will look at them. So I became the person that kind of the news editor who worked with the graphics team and helped them tell stories visually without being a designer. I've never had any design training, which kind of shows sometimes, but, you know.",
      "id": "ep_34_ut_55"
    },
    {
      "end": 399820,
      "speaker": "Enrico Bertini",
      "start": 386460,
      "text": "So how did this happen? You all in a sudden realized that showing stories through data was a great way to build new pieces, or it was more a progressive kind of thing?",
      "id": "ep_34_ut_56"
    },
    {
      "end": 481090,
      "speaker": "Simon Rogers",
      "start": 399900,
      "text": "Well, I guess I found that I was good at collecting that information and good at trying to simplify the story down so that it would make sense to somebody who's working with it visually. Because what used to happen, certainly in the Guardian, and it's very common, more common perhaps in the UK than the US, is that the graphic designers would be given a task to do and they wouldn't be given any information. And these guys, who should be spending their time designing and making something look amazing, were spending time trying to find out what the latest situation was in Afghanistan or whatever. So I would be the person who would do that and try and boil it down. And what are the key points here? What are the important things? And at the same time, the graphic designers would try and mitigate my demands to have lots of explosions and flashes and kind of crash stuff all over the graphics. And eventually we kind of come to this arrangement and at the time it kind of coincided with a lot of things that we had editors who were very keen to have more big visual displays, center spreads and so on, which were entirely kind of graphical visual based. And it coincided with the fact that people were increasingly looking at data as ways to get into journalism, as ways to tell stories. So all these things kind of came together. I found myself suddenly with lots of datasets and thinking, well, we should start publishing some of these, which is really how the datablog came about.",
      "id": "ep_34_ut_57"
    },
    {
      "end": 489318,
      "speaker": "Moritz Stefaner",
      "start": 482990,
      "text": "But you started actually, like as a journalist designer on the paper, as a.",
      "id": "ep_34_ut_58"
    },
    {
      "end": 526260,
      "speaker": "Simon Rogers",
      "start": 489334,
      "text": "Journalist, there was no designing from my end, really, at all. I was retrained that way. It was just lots of background editing and news editing and working on the desk and having to do things super quickly. Five impossible things before breakfast really is what it's like when you work on news desk, and that's kind of how it works. You have a million impossible things to do. Interestingly, that's something that I think is one of the best skills you learn as journalists is having to not get phased by time and having small amounts of time to do big difficult things and just getting on with it and trying not to panic and getting your head down and making it happen.",
      "id": "ep_34_ut_59"
    },
    {
      "end": 530746,
      "speaker": "Moritz Stefaner",
      "start": 527810,
      "text": "And did you also work with David McCandless in the beginning? Right?",
      "id": "ep_34_ut_60"
    },
    {
      "end": 593570,
      "speaker": "Simon Rogers",
      "start": 530818,
      "text": "Yes. So basically, when I started the datablock, we were looking around for people to feature. And one of the things we realized is that when you ask people to visualize the data that you've just published, people do come back and do that. We had so many people suddenly started kind of sending us visualizations or things they'd done, and David was one of them. So we suddenly thought that he's really good. And it wasn't necessarily, you know, there are other designers out there who probably more classically trained designers. What David was really good at was showing things, telling stories in a way that people would understand. Combining interesting data together, that makes it kind of a bigger thing. So the parts are maybe quite small, but the whole is something interesting. I think that's David's real strength, is telling stories that people actually care about and give monkeys about. And that is, I think that's kind of a key skill of data journalism. It's not necessarily about showing off or showing how clever you are, but about taking data that actually means something and telling it to people in a way they can understand.",
      "id": "ep_34_ut_61"
    },
    {
      "end": 602542,
      "speaker": "Moritz Stefaner",
      "start": 594190,
      "text": "Yeah. He has a great intuition, like how to find like a nice angle on a topic or the few facts that people will be really interested in.",
      "id": "ep_34_ut_62"
    },
    {
      "end": 621880,
      "speaker": "Simon Rogers",
      "start": 602566,
      "text": "Yeah. And his background is a written journalist as well, isn't it? So I think that's really interesting. It's his background as a storyteller and that's kind of what we're all doing, is telling stories. I would say to some degree, everything, I would say everything is a story. Just even a tweet could be a story.",
      "id": "ep_34_ut_63"
    },
    {
      "end": 628516,
      "speaker": "Moritz Stefaner",
      "start": 622980,
      "text": "Yeah, no, the background is, I just wrote a blog post like two weeks ago, bashing all this storytelling hype.",
      "id": "ep_34_ut_64"
    },
    {
      "end": 629236,
      "speaker": "Simon Rogers",
      "start": 628708,
      "text": "There you go.",
      "id": "ep_34_ut_65"
    },
    {
      "end": 630684,
      "speaker": "Enrico Bertini",
      "start": 629268,
      "text": "That's a hot topic right now.",
      "id": "ep_34_ut_66"
    },
    {
      "end": 634960,
      "speaker": "Simon Rogers",
      "start": 630732,
      "text": "All right, bring it on, Moritz. I'm ready. I'm ready for you.",
      "id": "ep_34_ut_67"
    },
    {
      "end": 643348,
      "speaker": "Moritz Stefaner",
      "start": 638620,
      "text": "I don't, I don't want. At least not that early in the episode.",
      "id": "ep_34_ut_68"
    },
    {
      "end": 646840,
      "speaker": "Simon Rogers",
      "start": 643444,
      "text": "Okay, come back later. We have time.",
      "id": "ep_34_ut_69"
    },
    {
      "end": 655212,
      "speaker": "Moritz Stefaner",
      "start": 647820,
      "text": "But that's interesting. And when did that, like, develop most traction? Like 2008, 2009? The Guardian datablock.",
      "id": "ep_34_ut_70"
    },
    {
      "end": 703910,
      "speaker": "Simon Rogers",
      "start": 655236,
      "text": "Yeah, we launched the datablog early on. We launched datablog in 2009, but the only reason it happened then was because we had the traction internally because it coincided with the launch of the open platform, which is the API. So actually having that traction meant that we. Because before you talk to people, I talked to a senior editor and say, I really think we should do this blog. We publish data. Why would we do that? Who on earth would be interested in that? And now nobody would argue with that. By the time I left, it was the biggest bug in the Guardian. Nate Silver's launching their own 538s, their own version of Datablog, launched today. It won't be the only one. There are two or three other organizations who are setting up their own data based blogs and publications now. So now nobody would have that argument. But back then, I guess it was a bit unusual, and we were kind of finding our way.",
      "id": "ep_34_ut_71"
    },
    {
      "end": 728466,
      "speaker": "Moritz Stefaner",
      "start": 704730,
      "text": "And I also remember there were lots of discussions about, as you say, like, who needs that? Or about the quality with this proper journalism, you know, in air quotes. And there was also this discussion, I remember, with David McCandless on BBC, where he was, like, bashed really badly by Neville Brody. And, you know, it was like this time when it really wasn't clear what the place for that is.",
      "id": "ep_34_ut_72"
    },
    {
      "end": 774350,
      "speaker": "Simon Rogers",
      "start": 728578,
      "text": "I think that was such an interesting time. I don't know, focus on David too much. That's not fair on poor David. But actually, there came a time when a lot of people who've been working design for a while were kind of resentful of this guy's success because they were looking to say, oh, it's not proper design. It doesn't look like this or hasn't got that. And I would think, well, actually, if it tells story in a way that millions of people understand, then surely that's a success. It might be classic visualization, and a lot of visualization people are incredibly dogmatic, obviously, apart from you, Moritz people. If you're not doing things in a certain way, it's like the thought police almost. I think people are willing to experiment and muck around with that and do different things. They're the people that are really interested.",
      "id": "ep_34_ut_73"
    },
    {
      "end": 786584,
      "speaker": "Moritz Stefaner",
      "start": 775930,
      "text": "You can't do that. But overall, I absolutely respect his ability to, as you say, for the storytelling and finding an interesting angle aspect. He's great at that.",
      "id": "ep_34_ut_74"
    },
    {
      "end": 788056,
      "speaker": "Simon Rogers",
      "start": 786672,
      "text": "Yeah, for sure. Yeah.",
      "id": "ep_34_ut_75"
    },
    {
      "end": 796380,
      "speaker": "Moritz Stefaner",
      "start": 788088,
      "text": "As you said, he opened also, I think, or maybe also your work opened data visualization to, I think, whole new audiences that have not been involved.",
      "id": "ep_34_ut_76"
    },
    {
      "end": 869710,
      "speaker": "Simon Rogers",
      "start": 797000,
      "text": "I mean, to me, that's the most interesting thing about the whole movement, is how it didn't really come out of mainstream media at all. It came out of groups like the open Knowledge foundation or little hacker groups, people who are just interested in the data and opening up public data. And that world, it seems to me, is all about collaborative storytelling. It's about using the community to help you work better. I kind of differentiate that almost from now. Data journalism so evolved that there are different types. It feels to me that there's another type of data journalism which is the new mainstream, which is much more about. About, look, we're going to do this work, fellows, you step back a bit, we'll show you how it's done. And much less inclusive than I feel some of the strongest hydrosm is, which is about including the community, involving them, getting them to show you how to do things better. I've learned more from people talking to me, complaining about things that I've done, or I think, Moritz, you might have done that in the past. Why are you using those colors, that sort of stuff? To me, that's so valuable because my work become better because of that. And I think there's a.",
      "id": "ep_34_ut_77"
    },
    {
      "end": 874022,
      "speaker": "Moritz Stefaner",
      "start": 869750,
      "text": "Just remember, Gregor and I, we were having this huge discussion with you on.",
      "id": "ep_34_ut_78"
    },
    {
      "end": 877214,
      "speaker": "Simon Rogers",
      "start": 874046,
      "text": "Twitter on a color, but, you know, we changed everything how to do it properly.",
      "id": "ep_34_ut_79"
    },
    {
      "end": 881302,
      "speaker": "Moritz Stefaner",
      "start": 877262,
      "text": "But in the end, you're right, we all were smarter in the end.",
      "id": "ep_34_ut_80"
    },
    {
      "end": 927800,
      "speaker": "Simon Rogers",
      "start": 881486,
      "text": "Do you remember when you tweeted that? I was really pissed off at first. I spent all this time making this map and you guys tweeting this, yeah, this color is terrible. And to me now, when I look back on that, I think that's actually taught me so much about data visualization in one Twitter conversation. I think collaborative working is so much stronger, and I think that's what you'll find, that maybe there are different types of data journalism, and a lot of the mainstream data journalism we're seeing now is about the professionals taking over, and that's fine. I think there's definitely an audience for that. I'm more interested in open data journalism, which is about democratizing the data that's out there, making it public, doing interesting things without. That's much more interesting to me.",
      "id": "ep_34_ut_81"
    },
    {
      "end": 956300,
      "speaker": "Moritz Stefaner",
      "start": 929900,
      "text": "I also found that interesting is that you didn't really pick up programming to a big depth or so, but you were always able to come up with some solution to display the data in a smart way, like relying on existing tools or just doing simple things, but do them in an interesting way. And I think that can be a model for many journalists who, of course, don't have, like, a science or like, much time to pick up.",
      "id": "ep_34_ut_82"
    },
    {
      "end": 1041474,
      "speaker": "Simon Rogers",
      "start": 957600,
      "text": "To me, that's really interesting, because basically, whenever I try and sit down and consciously learn any coding, it just goes in one ear and out the other. Really does. I'm not very good at learning stuff like that. I've been trying to spend some time recently looking at coding APIs and stuff and to be honest, it's not until I have to use it that it sinks in. So, for instance, at the moment here at Twitter, one of the things doing, maybe we're visualizing conversation around a big issue like the Ukraine or Beyonce's album release or whatever, and there we might be using a tool like cartodB, which is actually a free tool. And for me, that's because it's the right tool for the job. Allows me to make something in ten minutes that I couldn't do otherwise. Now I've learned how to use. I've learned how to get the best out of it. So before it was using fusion tables or whatever, or coding JSON around that, and actually, if you'd sat me down and given me a class on it, it really would not have sunk in. But actually having to do it around a specific event or a specific data point suddenly makes it something I've got to learn, because there's no other way to tell that story. So, I guess definitely there are people out there who are much better at coding than I am and putting that stuff together. My thing, I guess, is, you know, I've got half an hour to do this. What's the best way to do it in that time? And that's how I'll think about it. And, you know, what are the best?",
      "id": "ep_34_ut_83"
    },
    {
      "end": 1048842,
      "speaker": "Moritz Stefaner",
      "start": 1041522,
      "text": "Three commendations or what are the tools you appreciate the most? You mentioned carDb. Are there any other tools you use a lot?",
      "id": "ep_34_ut_84"
    },
    {
      "end": 1194280,
      "speaker": "Simon Rogers",
      "start": 1049026,
      "text": "Yeah, we use data wrapper you may have heard of. So, Dataapper, for those who don't use it, is this brilliant, open source, basic charting tool. It allows you to make really simple, interactive charts on their maps are actually pretty good. I mean, if I was talking a bit about what I do here, I guess so what I'll do often is we'll look at how to tell stories around the way that people talk on Twitter, around events. So, with the Olympics, say, in Sochi, we were doing things like, every day I'd put out a map of showing which countries were talking most about the games that day, and we basically normalized it by the population in that country. I used data wrapper for those maps. It's really simple to use and allows you to choose colors and to customize it just enough that actually you've got a really easily embeddable map and you can make it in ten minutes, which I appreciate that, and I appreciate how shareable it is, because people can tweet that out and can share it and embed it on their websites, too. So that's really good for us. So I use data app a lot. Cartodobi, I think, is really powerful, and we're kind of scratching the surface of that. So it allows you to animate a map and make an animated map in 15 minutes, which is amazingly good. And I can't think of anything else that allows you to do that without being a coder. But then also, data journalism, I think, is about working with people and finding friends to work with. So here there's a really, really good visual insights team, for instance, as people like Miguel Rios and Nicolas Belmonte, who we work with very closely. And so something like the State of the Union speech, Nico and I worked on something which I'm really proud of. It's one of the things I'm proudest of, actually, since I've done this kind of work. And that is where we try to tie in the speech itself, state of the union speech to Twitter activity. Because often a lot of Twitter visualizations are very pretty. They don't help you tell the story. And I really want to do something where you'd see how people reacted to bits of the speech. And the great thing about Nico's work is he makes these kind of complicated things come true and it looks beautiful, which is really important as well. And that meant you could click on a bit of speech, you could see exactly what was happening on Twitter at that time, or you could click at exactly the time.",
      "id": "ep_34_ut_85"
    },
    {
      "end": 1197524,
      "speaker": "Moritz Stefaner",
      "start": 1196700,
      "text": "That's quite amazing.",
      "id": "ep_34_ut_86"
    },
    {
      "end": 1217530,
      "speaker": "Simon Rogers",
      "start": 1197572,
      "text": "And I think that's the way I want to go. I'm really interested in that and trying to visualize things that actually tell you what was happening whilst that activity was going on Twitter. I think that's such an interesting area because people tweet in the way that they think. They tweet instantly and they get those opinions out there. So to be able to show that, I think is really fascinating.",
      "id": "ep_34_ut_87"
    },
    {
      "end": 1235758,
      "speaker": "Moritz Stefaner",
      "start": 1218670,
      "text": "Here's a million dollar startup idea. I would like to have that. I always do that. No, I'd like to have that for tv series like when they first aired, but I watch them later that I can have a replay of that feed commenting on what's going on.",
      "id": "ep_34_ut_88"
    },
    {
      "end": 1252494,
      "speaker": "Simon Rogers",
      "start": 1235814,
      "text": "Wouldn't it be great if you had a tool like that? You could just annotate as well? You need that annotation. I think it's that that makes it key. It's not enough for it to look beautiful because it looks beautiful but confusing. And I think you need to be able to annotate it and say that this is when this happened or that is when that happened. Yeah, yeah.",
      "id": "ep_34_ut_89"
    },
    {
      "end": 1259654,
      "speaker": "Moritz Stefaner",
      "start": 1252622,
      "text": "And the big challenge is, of course, to filter out the relevant, like, only match only the tweets that actually refer to the thing you captured.",
      "id": "ep_34_ut_90"
    },
    {
      "end": 1289870,
      "speaker": "Simon Rogers",
      "start": 1259822,
      "text": "That's always the fascinating thing about twist data is that it's a self policed corpus of information. It's not something where we say, right, if you're going to tweet about the Olympics, you must use this hashtag. It doesn't work like that. People use whatever they want to do, and that's what makes it so amazing and vibrant and alive. But also, it's one of the challenges of analyzing the data is that you have to make your guess of where the conversation is. It's always about your best guess and you come in a full.",
      "id": "ep_34_ut_91"
    },
    {
      "end": 1292838,
      "speaker": "Moritz Stefaner",
      "start": 1289910,
      "text": "Hashtags and replies have both been invented by the community.",
      "id": "ep_34_ut_92"
    },
    {
      "end": 1294918,
      "speaker": "Simon Rogers",
      "start": 1292894,
      "text": "Exactly. The whole thing is these were never.",
      "id": "ep_34_ut_93"
    },
    {
      "end": 1299810,
      "speaker": "Moritz Stefaner",
      "start": 1294974,
      "text": "Twitter features until people just started to use it and then Twitter had to react it.",
      "id": "ep_34_ut_94"
    },
    {
      "end": 1309770,
      "speaker": "Simon Rogers",
      "start": 1301390,
      "text": "Now everybody uses hashtags and at symbols. Right. So now it's become something invented by the community, and now it's part of the world of social data.",
      "id": "ep_34_ut_95"
    },
    {
      "end": 1320744,
      "speaker": "Moritz Stefaner",
      "start": 1314920,
      "text": "So how would you describe your role as? I think your official job title is data editor. Is that right?",
      "id": "ep_34_ut_96"
    },
    {
      "end": 1323784,
      "speaker": "Simon Rogers",
      "start": 1320792,
      "text": "Yeah, that's right. So essentially, what do you do, like.",
      "id": "ep_34_ut_97"
    },
    {
      "end": 1325180,
      "speaker": "Moritz Stefaner",
      "start": 1323832,
      "text": "On a day to day to day?",
      "id": "ep_34_ut_98"
    },
    {
      "end": 1433490,
      "speaker": "Simon Rogers",
      "start": 1325520,
      "text": "So basically it's about. Yeah, I wasn't brought in for my coding experience, as you can tell, but certainly I think it was interesting to be in an organization. So at the Guardian, I guess it was an organization where I, there were not that many people understood data, but there were lots of storytellers. And here, in a way, it's the other way around. There are lots of people understand data, but it's about trying to help tell those stories with that data and take it from being big and confusing to make it meaningful and simpler people to understand. And that's working. Like I said, working a lot with the visual insights team here to try and show that making data available, making data points available around big events. If you follow the Twitter data feed, you'll see a lot of the stuff we've been doing has really been about showing how people are talking about an event on Twitter and trying to put it into perspective for people. Because a lot of these numbers are abstract and we don't want them to be abstract anymore. We want them to be understandable and also trying to encourage people to do better work with that data and show kind of what can be done and showcase things that we like as well. So the great thing is, I mean, as a journalist working outside Twitter before it changed the way that I would understand news or I would report events. And now being inside, you can see the information behind that change and how much part of the news process Twitter is nowadays. And that's. And it's fascinating to be able to kind of explore that data and try and understand it a bit better. And I think after I've been here nearly a year now, I still feel like I'm scratching the surface of what's possible.",
      "id": "ep_34_ut_99"
    },
    {
      "end": 1451890,
      "speaker": "Enrico Bertini",
      "start": 1435950,
      "text": "So can you tell us a little bit more about how your team works? So I guess there are people who are more on the analytics side and managing the data and people like you that are more creating the stories, or are you working all together in one team?",
      "id": "ep_34_ut_100"
    },
    {
      "end": 1453918,
      "speaker": "Simon Rogers",
      "start": 1452630,
      "text": "We are spread all over.",
      "id": "ep_34_ut_101"
    },
    {
      "end": 1457006,
      "speaker": "Enrico Bertini",
      "start": 1453934,
      "text": "How do you come up with a new idea? I'm just curious about it.",
      "id": "ep_34_ut_102"
    },
    {
      "end": 1652880,
      "speaker": "Simon Rogers",
      "start": 1457078,
      "text": "Yeah. So we're spread all over the organization. So, for instance, I work closely with the analytics team, who are amazing here. They're kind of quantum physicists and geniuses. So, for instance, we did a piece last week on what happens if you add a hashtag to a tweet or a photograph or those kind of hard features. What's the result in retweets? And it varies by which area people are in. So a journalist adding a photograph to retweet has a different effect to athlete or a tv presenter. And that's working with the analytics team who did this amazing research into millions of tweets from thousands of verified users. So you've got work like that where they're already all the time, the analytics team, doing this incredible research to try and understand better how people use Twitter and how you can kind of get the most out of it. And then it might be there's a big event coming up, like the Oscars, say. Then I'd work with Nico Belmonte on the visual insights team and trying to showcase some of that stuff. So with the Oscars, for instance, we did this visualization, photogrid of the most viral images of the Oscars as they were going on. So from noon till midnight, what were the images around the Oscars that were being shared? And suddenly, of course, you have that enormous, that enormous image right in the middle from Ellen, and that kind of changed everything. It was really selfie. Yeah, the selfie. And that was really, we weren't necessarily expect, obviously, we expect that at all, and then see that happen and see the effect on the data and suddenly how it changes everything about the way this thing looks was really fascinating. And we don't always do things live, but that was one of the examples where we might try and do a live visualization because it's a live event for people here. It's also the first time I've ever watched the Oscars live in my life, not having lived in the right time zone before. So that's something that's a big memory for me. And then things like the State of the union speech where we're trying to tie in the speech itself to the day. So often it'll be around events to think, this big event is coming up. What can we do that will help you? What can we do that's shareable that any newspaper or news organization could take and put on its site? And for me, that's really exciting. I've actually work up involved in has been displayed on more outlets since I've been here than in my entire career, pretty much from Buzzfeed to Wall Street Journal, which is. So that's quite a kind of gratifying feeling. And then obviously things happen in the world. There are events, there are things where something happens, and there's a big news story, and a lot of those news stories take place on Twitter. There was a really interesting piece by a guy at Dataminer this week about the Harlem explosion and how you can actually use Twitter status to show people reacting to that lie before it's picked up by any kind of mainstream news media. And that's a really interesting thing that I think I'd like to spend a bit more time investigating how events influence Twitter immediately. It's such a fascinating kind of real time conversation. Stuff happens and you can see it happening as it goes on.",
      "id": "ep_34_ut_103"
    },
    {
      "end": 1658508,
      "speaker": "Enrico Bertini",
      "start": 1654260,
      "text": "Sure. And is there a specific website where you publish all this work?",
      "id": "ep_34_ut_104"
    },
    {
      "end": 1685540,
      "speaker": "Simon Rogers",
      "start": 1658644,
      "text": "So at the moment, the stuff spread all over the website. So I say you follow Twitter data, you'll be able to pick up most of it, which is one word, Twitter data. And we're published on, apart from being published all over the place on news websites and so on, there's the official Twitter blog and Twitter media. The media blog also has a kind of a data section there. You'll find bits. So we're in many places and it should be pretty easy to find.",
      "id": "ep_34_ut_105"
    },
    {
      "end": 1687072,
      "speaker": "Enrico Bertini",
      "start": 1686680,
      "text": "Okay.",
      "id": "ep_34_ut_106"
    },
    {
      "end": 1692480,
      "speaker": "Moritz Stefaner",
      "start": 1687096,
      "text": "There was also one overview page with all the public facing visualizations.",
      "id": "ep_34_ut_107"
    },
    {
      "end": 1699456,
      "speaker": "Simon Rogers",
      "start": 1692520,
      "text": "There is? Yeah, absolutely. There's. And that's, at the moment, that is a GitHub address, actually. I'll just give it to you.",
      "id": "ep_34_ut_108"
    },
    {
      "end": 1699728,
      "speaker": "Moritz Stefaner",
      "start": 1699488,
      "text": "Right.",
      "id": "ep_34_ut_109"
    },
    {
      "end": 1707980,
      "speaker": "Simon Rogers",
      "start": 1699784,
      "text": "Yeah. So it's. Let me just. I'm going to tell you what it is. It's Twitter GitHub IO interactive.",
      "id": "ep_34_ut_110"
    },
    {
      "end": 1711730,
      "speaker": "Moritz Stefaner",
      "start": 1709270,
      "text": "We'll put it into the blog post so people can.",
      "id": "ep_34_ut_111"
    },
    {
      "end": 1744160,
      "speaker": "Simon Rogers",
      "start": 1712150,
      "text": "That's got a really nice collection of all the kind of public facing visualizations we've done so far. And there's some really interesting things on there, which is done by these amazing designers downstairs. So there's one of the Philippines, which is one of my favorites, which Nico did, which showed people tweeting the words help and the Philippines. It wasn't just this is about conversation about this awful disaster. It was about people offering to help via Twitter, which I kind of like that it's kind of turning around what you might expect us to do. And it's rather beautiful. He's this kind of. You might appreciate the edge bundling that goes on there, Morris.",
      "id": "ep_34_ut_112"
    },
    {
      "end": 1749104,
      "speaker": "Moritz Stefaner",
      "start": 1744200,
      "text": "But, yeah, there's nothing bad about nice edge bundling.",
      "id": "ep_34_ut_113"
    },
    {
      "end": 1754020,
      "speaker": "Simon Rogers",
      "start": 1749152,
      "text": "Exactly. That's a whole term. That's a whole term I wish I hadn't heard of. But there you go. Now I know.",
      "id": "ep_34_ut_114"
    },
    {
      "end": 1782106,
      "speaker": "Moritz Stefaner",
      "start": 1755760,
      "text": "Very nice. And I have to think back. We did this project two years ago about the Olympics and also tracking the Twitter conversation, and we got the question quite a bit. Or it was also what we wanted to investigate is, like, how does the insights you get from analyzing what people say on Twitter? How is it different from mainstream media report on. I mean, it's a huge question, but do you have a short answer?",
      "id": "ep_34_ut_115"
    },
    {
      "end": 1790514,
      "speaker": "Simon Rogers",
      "start": 1782218,
      "text": "Oh, my God. I don't know. I mean, I can't think. Depends what you're looking at. I know some people look at sentiment, which is not something that I've got into.",
      "id": "ep_34_ut_116"
    },
    {
      "end": 1791362,
      "speaker": "Moritz Stefaner",
      "start": 1790602,
      "text": "That's what we did.",
      "id": "ep_34_ut_117"
    },
    {
      "end": 1795152,
      "speaker": "Simon Rogers",
      "start": 1791426,
      "text": "Yeah. And I think that's a tricky thing to do programmatically, isn't it?",
      "id": "ep_34_ut_118"
    },
    {
      "end": 1795756,
      "speaker": "Moritz Stefaner",
      "start": 1795226,
      "text": "Absolutely.",
      "id": "ep_34_ut_119"
    },
    {
      "end": 1845600,
      "speaker": "Simon Rogers",
      "start": 1795788,
      "text": "And still tricky thing to do programmatically. And, you know, the closest I got to, I guess, is before, ironically, before I came to, is when I worked at the Guardian. We looked at the riots and the team, and this was actually academics. It wasn't. It was Frida Bisson academics, Manchester and Frida's now at Sheffield. And she's just brilliant and analyzing social media data. But they looked at the language around rumors on Twitter and how quickly they spread and how quickly the community came to challenge those rumors when they were wrong as well. And to me, that is a really fascinating way to use that data because it's based, in fact, it's hand coded. So you know it's right. You're not relying on algorithms that you're not 100% sure of. And for me, that's really great way to use that data. Yeah.",
      "id": "ep_34_ut_120"
    },
    {
      "end": 1851466,
      "speaker": "Moritz Stefaner",
      "start": 1846140,
      "text": "And the second thing, obviously, as you mentioned, with the Harlem explosion is just the pure speed.",
      "id": "ep_34_ut_121"
    },
    {
      "end": 1889800,
      "speaker": "Simon Rogers",
      "start": 1851658,
      "text": "It's the pure speed, and things are wrong often with speed. But if you're a reporter and you just use something without checking it, that would be insane. So, you know, it's a tip off mechanism. It's amazing. And that's something like data miners really good for that. I would really recommend anybody look at that because it allows the way that it monitors explosions of information. Not necessarily actual explosions, but explosions of kind of tweets and people talking about an event as it happens. That is really, really fascinating. And they've got some really good geo referencing tools on there as well, which are brilliant, and estimate geography to 90% accuracy, which is pretty impressive.",
      "id": "ep_34_ut_122"
    },
    {
      "end": 1915980,
      "speaker": "Moritz Stefaner",
      "start": 1892860,
      "text": "Another question, one thing I noticed you push out a lot of, let's say, very snackable information. Graphics like a little piece of information. It fits into a tweet, basically. I mean, that's obviously, it makes sense also, in your context, do you think in general that's sort of the future for how to present information on the web, to make these very small units and.",
      "id": "ep_34_ut_123"
    },
    {
      "end": 1917780,
      "speaker": "Simon Rogers",
      "start": 1916060,
      "text": "Well, I think it's interesting as well.",
      "id": "ep_34_ut_124"
    },
    {
      "end": 1923756,
      "speaker": "Moritz Stefaner",
      "start": 1917900,
      "text": "Or is there a place for long forum as well, or mid sized forum? I mean, what's your take on that?",
      "id": "ep_34_ut_125"
    },
    {
      "end": 2016050,
      "speaker": "Simon Rogers",
      "start": 1923788,
      "text": "So I think there's a place for everything, just as there is a place for different types of data journalism. You know, there's also a place for different types of visualizing it. And, you know, in the past, certainly when I was a news desk, news editors would always want something interactive. It's got to be interactive. And actually, nine times out of ten, you know, for people to share, it doesn't have to be interactive. And if it is interactive, you're kind of writing up all those people who might be looking at it on mobile platforms or, you know, old blackberries or whatever format it is. And so by just checking something out, which is simple, and a lot of those things are designed by the design team here. They give us templates that we can use to just when we want to release a number. So Adrian Holavati, the godfather of data journalism, said that just publishing a number can be a story in itself. It doesn't have to be a visual, it doesn't have to be a big interactive. There's room for those things. When you see these incredibly elegant things, such as Fernanda and Martin's wind project last year, that's something incredibly beautiful and elegant, lovely. And there will always be room for those. People always want to see those. But also sometimes just having a quick hit like that, that's viral and get shared around is a really powerful thing. I mean, there's the Buzzfeed effect, isn't it, on journalism that actually journalism now doesn't have to be huge long form pieces. It can be these very kind of instant, quick things that tell you something interesting about the world. I don't think that makes us less informed. It makes us more informed with lots of. Lots more information.",
      "id": "ep_34_ut_126"
    },
    {
      "end": 2028810,
      "speaker": "Moritz Stefaner",
      "start": 2018190,
      "text": "Great stuff. Enrico, you picked up that great article. I totally forgot about it. Which one? It was from Simon. It was about punk.",
      "id": "ep_34_ut_127"
    },
    {
      "end": 2038010,
      "speaker": "Enrico Bertini",
      "start": 2030670,
      "text": "That's one I loved. I think you have a blog post that is called something like data journalism as punk.",
      "id": "ep_34_ut_128"
    },
    {
      "end": 2039742,
      "speaker": "Simon Rogers",
      "start": 2038670,
      "text": "It's the new punk.",
      "id": "ep_34_ut_129"
    },
    {
      "end": 2045062,
      "speaker": "Enrico Bertini",
      "start": 2039806,
      "text": "Yeah, is the punk or something like that. I really like the title, but the content as well.",
      "id": "ep_34_ut_130"
    },
    {
      "end": 2138268,
      "speaker": "Simon Rogers",
      "start": 2045126,
      "text": "So I mean, I kind of, I kind of wrote that to provoke a reaction in a way. And partly, I guess, it was a reaction against the kind of the over professionalization of data journalism I kind of felt was going on. And I thought that actually, you know, the great thing about it is that, you know, anyone can do it. You don't need to be, you don't need to be, you know, Moritz or Nat Silver or me or to do, to do day journalism. Anybody can do it because the tools are there. Just as, you know, like punk started with a few kids in garages playing guitars. And that was, I love that stage, Daytona, when it's brand new and anybody was kind of just diving into tools and trying to create things. And actually it's because of the power of the story. The power of trying to tell a story properly is what makes it powerful and doing it quickly and instantly and just have a go. And I like that a lot and I hope that that persists. But just as punk became mainstream, data will become mainstream too, because that's inevitable. I really hope that there will always be a room for kind of gifted amateurs out there. And we had a lot of conversation. We wrote that piece about what if it's not very good? What if it's crap? And actually, I don't think something can be crap. I don't think can be not very good. I think it's about having a go. And nine times out of ten, maybe that stuff won't change the world. And people look at that, it's a bit of a joke, but actually, what if out of that comes something amazing, something incredible that nobody has seen for, you know, it's like life is made up of those kind of moments, isn't it? And I think that's really important to.",
      "id": "ep_34_ut_131"
    },
    {
      "end": 2180816,
      "speaker": "Enrico Bertini",
      "start": 2138284,
      "text": "Encourage those so I'm just curious to hear from you. Oh, sorry, Moritz, go ahead. I'm just curious to hear from you after so many years of experience. I think what is interesting about data journalism is the fact that there are journalists who traditionally are not trained in statistics or anything related to data, or in a sudden. So, as you said, I mean, data journalism as punk means that everyone now can do data journalism. Right? And that's. I agree with you that on the one hand, is fantastic, but on the other hand, it's so easy to. To use data improperly. Right? I mean, I'll tell you what.",
      "id": "ep_34_ut_132"
    },
    {
      "end": 2200556,
      "speaker": "Simon Rogers",
      "start": 2181008,
      "text": "If you use it badly and you publish it, you will have a million people on your back in five minutes. This is the great thing about it. It's not that. So Mark Twain said that a lie can be halfway around the world before the truth has got his boots on. And. Yeah, that's true. But the rise of Twitter and social media and everything means that the truth can catch up as well. To me, that's.",
      "id": "ep_34_ut_133"
    },
    {
      "end": 2203540,
      "speaker": "Enrico Bertini",
      "start": 2200588,
      "text": "So you mean that it's basically self regulating, right?",
      "id": "ep_34_ut_134"
    },
    {
      "end": 2249360,
      "speaker": "Simon Rogers",
      "start": 2203660,
      "text": "Yeah, for sure. And so whenever we got something datablow and got something wrong, I would have a million comments. And the great thing was about publishing this stuff is that you find that one guy, that one woman who knows something inside out. Oh, yeah, actually, I did that research, and I think you'll find that it's better to look at it this way. So I think it's a very democratic way of reporting, and I think that's a really important thing. I hope we don't lose that, because I think this is how you get new people coming up. This is how you get new stars of that world, because it's accessible and easy to do. And it's not about maths. I was terrible at maths at school. Really, really bad. It's about the tools that you've got and treating information in a kind of skeptical way. I think that's really important.",
      "id": "ep_34_ut_135"
    },
    {
      "end": 2263216,
      "speaker": "Enrico Bertini",
      "start": 2251020,
      "text": "Sure. But I still think that there are quite some big challenges there. I mean, there are all sorts of scientists who made things wrong with data. So I guess that everyone can, can do very badly with data.",
      "id": "ep_34_ut_136"
    },
    {
      "end": 2306940,
      "speaker": "Simon Rogers",
      "start": 2263408,
      "text": "I think the more. The more data literate we are as a profession, the less likely it is people are going to get away with stuff. I've seen in the past, journalists being given data stories and just accepting them without questioning them in a way they would never do with any other source of information. You have a guy tells you a story in a pub, you would check it out properly, and there was a kind of, in the world of kind of disbelieving numbers. When they're put in front of you, then that kind of disappears. And now I think what's happening is because people are more data, it'll be more questioning, and if they're not questioning, their audience will be. And it's, that's why it's so important to involve the audience, to involve the community in what you're doing, because then you're going to get things right.",
      "id": "ep_34_ut_137"
    },
    {
      "end": 2308176,
      "speaker": "Enrico Bertini",
      "start": 2307800,
      "text": "Yeah.",
      "id": "ep_34_ut_138"
    },
    {
      "end": 2314050,
      "speaker": "Moritz Stefaner",
      "start": 2308208,
      "text": "So you see a journalist much more, let's say, like a moderator than actually a writer.",
      "id": "ep_34_ut_139"
    },
    {
      "end": 2330962,
      "speaker": "Simon Rogers",
      "start": 2314090,
      "text": "You're a curator, you're curating information. That's how you should be treating. So you shouldn't be, I don't think, anyway. And, you know, everybody has different views on this. Right. But you shouldn't just see yourself as the only expert that matters. It's not, it's not about showing off. It shouldn't be about showing off, but.",
      "id": "ep_34_ut_140"
    },
    {
      "end": 2339012,
      "speaker": "Moritz Stefaner",
      "start": 2330986,
      "text": "You make it rather sure the experts sort of have their say in the process and that all sides are represented. It's an interesting perspective. Yeah.",
      "id": "ep_34_ut_141"
    },
    {
      "end": 2346340,
      "speaker": "Simon Rogers",
      "start": 2339186,
      "text": "Being wrong is okay. I think I'd rather have a load of rubbish out there. And that's where you. The way you get the pearls. Yeah.",
      "id": "ep_34_ut_142"
    },
    {
      "end": 2360504,
      "speaker": "Enrico Bertini",
      "start": 2347120,
      "text": "Yeah, yeah. I think one aspect of, an interesting aspect of data in general is that I have the feeling that people, I ever answered that people, when, when they see a story supported by data, they believe it more. Right.",
      "id": "ep_34_ut_143"
    },
    {
      "end": 2361420,
      "speaker": "Simon Rogers",
      "start": 2360672,
      "text": "Yeah.",
      "id": "ep_34_ut_144"
    },
    {
      "end": 2362584,
      "speaker": "Enrico Bertini",
      "start": 2361920,
      "text": "Yeah.",
      "id": "ep_34_ut_145"
    },
    {
      "end": 2376520,
      "speaker": "Simon Rogers",
      "start": 2362712,
      "text": "But that goes back to, yeah, that goes back to Florence Nightingale or, you know, William Playfairs, isn't it? You know, they're using, using numbers to make their case. And that's, that's absolutely right. I think there is still a kind of, the numbers must be true.",
      "id": "ep_34_ut_146"
    },
    {
      "end": 2377868,
      "speaker": "Enrico Bertini",
      "start": 2377300,
      "text": "Yeah.",
      "id": "ep_34_ut_147"
    },
    {
      "end": 2386080,
      "speaker": "Simon Rogers",
      "start": 2377964,
      "text": "Acceptance out there. And that's where if you have a more literal audience, then you're going to have more, more challenging of those opinions, I would say.",
      "id": "ep_34_ut_148"
    },
    {
      "end": 2422498,
      "speaker": "Enrico Bertini",
      "start": 2387740,
      "text": "So another thing that I wanted to ask you that is even somewhat related to what we are discussing, where in your experience, where is the limit in terms of complexity that the audience can bear when you are publishing a new visualization out? And how does it, does this plays a role in the way you create visualization? Because I think another interesting discussion is that sometimes there are things that you might actually depict better, but with something that is more complex, and then you have to find the right trade off between complexity and expressiveness in your work.",
      "id": "ep_34_ut_149"
    },
    {
      "end": 2499020,
      "speaker": "Simon Rogers",
      "start": 2422604,
      "text": "It's so interesting because I had this discussion with John Keefe at WMYC, and we talked about how a lot of data journalism is actually very simple. It's like something got bigger or smaller. How has it changed over time? How does this thing compare to that thing? And actually, wouldn't it be interesting if we could find a way to use more sophisticated data analysis techniques that exist out there? Statisticians have been working on more complicated ways to tell stories for a while. The problem you've always got is that you have to sell that story to the news editor or to the public. So you've always got that balance of. My take on it was I would do things that I thought other people could replicate to test what I've done. And if other people could replicate what I do, then that's great, because I know I'm more likely to be right. That's just my take. You have people, other much more sophisticated journalists who are writing now, some of them really famous, who are doing things that are kind of complicated models and telling those kind of stories, and that's fine too. I think there's room enough for all those types. But I suspect we are becoming more sophisticated. But what I hope we don't become so sophisticated that people end up saying, that model is so sophisticated, I don't understand it, so I can't test whether it's true or not, but it must be because it's really complicated. I think either we have to watch out for that or for a world where that happens.",
      "id": "ep_34_ut_150"
    },
    {
      "end": 2500984,
      "speaker": "Enrico Bertini",
      "start": 2499840,
      "text": "Yeah, it's tricky.",
      "id": "ep_34_ut_151"
    },
    {
      "end": 2522520,
      "speaker": "Moritz Stefaner",
      "start": 2501032,
      "text": "It's really tricky. I think I often make the case that we have really complex issues to tackle and that we can also trust people to actually get into quite some complexity if they're really interested in topics. I think that's often underestimated. At the same time, I think we often also overestimate how statistically and visually literate people actually are.",
      "id": "ep_34_ut_152"
    },
    {
      "end": 2536092,
      "speaker": "Simon Rogers",
      "start": 2524220,
      "text": "So there was always really interesting dynamics of conversations. Certainly when I was at the paper, I assume a little bit now, where people would. I said, the paper, the Guardian. It's just in my head that it's the paper. You know?",
      "id": "ep_34_ut_153"
    },
    {
      "end": 2536612,
      "speaker": "Moritz Stefaner",
      "start": 2536116,
      "text": "It's the paper.",
      "id": "ep_34_ut_154"
    },
    {
      "end": 2608480,
      "speaker": "Simon Rogers",
      "start": 2536676,
      "text": "Yeah, it's the paper as far as I'm concerned. But, you know, where we would talk a lot about, you know, how simple stuff should be, I would want things, because I grew up in kind of Dorling Kindersley books, you know, how things work, cutaways, 3D Cutaways and so on. And, you know, when I first started doing this, I was like, why can't we use a 3d pie chart? Well, actually it's crap and it distorts the data. But you know, because you want things that are accessible and easy for people to understand when you're visualizing information. And there's always those kind of, that dichotomy, isn't there, between, you know, designers who know what they're doing and, you know, amateurs like me who kind of, you know, are kind of working our way through it. So, you know, Mike Robinson, the Guardian, when I was head of graphic amazing designer, and he, we would often kind of butt heads on this, you know, how to do things. I would want the kind of big explosions or, you know, 3d tank cutaways and say, well, actually you're, that's just too much stuff. It's too much stuff on that. Visualize that. It's too complex now for people to understand. It's all about making things simpler. And now I can really see the benefits of that. At the time, I might have argued a bit about it.",
      "id": "ep_34_ut_155"
    },
    {
      "end": 2696782,
      "speaker": "Enrico Bertini",
      "start": 2610740,
      "text": "Yeah. And I think another related aspect, this is related to what you were saying at the beginning, that the visualization community is a little bit too dogmatic. That was definitely true for myself. I have to say, during the last few years, I think I reconsidered many of the things that I thought were true. And one thing that I realized is that people who are working in visualization, or who have been working in visualization for a very long time, they tend to fall in love for very good design. But I think that a good visualization is not necessarily only about the design of the visualization itself, is the data that is really, really important. Right. So I think that a great piece is a piece that actually has really great data and trends to show regardless the way you show it in the first place. Right. I think that sometimes this aspect is a little bit under, it's not, I mean, it's not clear because we tend to judge visualization only in terms of what is the visual representation of this data. But behind that, there is a very long and complex work of deciding what kind of data to collect in the first place, elements of this data to select, and I guess a lot of failures as well. So even in my own activities, sometimes we try to do something and we don't discover anything interesting there. So there is boring data out there.",
      "id": "ep_34_ut_156"
    },
    {
      "end": 2697286,
      "speaker": "Simon Rogers",
      "start": 2696846,
      "text": "Right.",
      "id": "ep_34_ut_157"
    },
    {
      "end": 2698450,
      "speaker": "Enrico Bertini",
      "start": 2697398,
      "text": "And coming up.",
      "id": "ep_34_ut_158"
    },
    {
      "end": 2773890,
      "speaker": "Simon Rogers",
      "start": 2700840,
      "text": "There's no boring data. What are you talking about? I think you're right in a sense. But there's, I think, you know, when I, when I first started the gun, one of the first newsletters, I want to ask one of the senior users there, you know, how do you choose what to do, because if you're news editing, you've got all this stuff coming at you and you're trying to balance it all out. How do you choose what makes a story and what doesn't? They say, well, you have to choose stuff that's interesting to you, because if it's interesting to you, it will be interesting to somebody else. And that's been my kind of rule, really. If I'm interested, then there'll be somebody out there who'll be interested in it as well. I think that's really. That's really important. And also, I don't know, I guess I think the data is when it really comes together and the data and the image come together, that kind of really perfect marriage, something that's timely so people care about it, and then suddenly, suddenly they're interested and, you know, the story and everything kind of merges together at the right time. And when you work with people really, who are really talented, that often happens. And that's one of the most rewarding things about this area of work, that there was some really clever, smart, creative people out there, and you get to work with some of the best of them. Which brings me neatly onto these kids books I've done, because etail has seeped into that.",
      "id": "ep_34_ut_159"
    },
    {
      "end": 2777110,
      "speaker": "Enrico Bertini",
      "start": 2775110,
      "text": "Why don't you tell us more about your book?",
      "id": "ep_34_ut_160"
    },
    {
      "end": 2860160,
      "speaker": "Simon Rogers",
      "start": 2777150,
      "text": "So this is. I did the data work on these a year ago. There are two books out there, one on the animal kingdom and one on the human body, published by Candlewick in the US. And they are illustrated by amazing designers. Peter Grundy doing one of them. Peter Grundy has been designing infographics since the seventies. And you look at his stuff now and it feels incredibly timely because his work was so well designed. And Nicholas Blackman, who's based out of New York, did the one on the animal kingdom. And they're infographics for kids, basically. So my kids love them because they're obsessed with the truth. And they're obsessed with facts because they want certainty in the world, right? You guys have kids, right? So they want certainty. They want to know too many. They think that things are either true or they're not true. They don't like shades of grey. And the great thing about facts and data is it gives them certainty in a kind of a weird, uncertain world. And that, to me, that's really interesting. Why, you know, is this a way of dealing with kids? So we've done this now. And a friend of mine who works with kids with educational needs, special needs, as they call them in the UK, she said this could be a great way to teach for them. Guys, I have to go. The meeting room's. No, there are people coming into the meeting room.",
      "id": "ep_34_ut_161"
    },
    {
      "end": 2863500,
      "speaker": "Moritz Stefaner",
      "start": 2861820,
      "text": "So you have to run somewhere?",
      "id": "ep_34_ut_162"
    },
    {
      "end": 2865880,
      "speaker": "Simon Rogers",
      "start": 2863580,
      "text": "Yeah, I have to get out of this room.",
      "id": "ep_34_ut_163"
    },
    {
      "end": 2872222,
      "speaker": "Moritz Stefaner",
      "start": 2866270,
      "text": "No, yeah, no worries. It's been fantastic. And the books, they look great. I think I have to get them. I have two kids, too.",
      "id": "ep_34_ut_164"
    },
    {
      "end": 2877970,
      "speaker": "Simon Rogers",
      "start": 2872286,
      "text": "Oh, let me know what you think. You're going to critique them visually, though, aren't you? I can. I can feel that coming.",
      "id": "ep_34_ut_165"
    },
    {
      "end": 2882730,
      "speaker": "Moritz Stefaner",
      "start": 2879630,
      "text": "As long as it's audience adequate, I'm all for.",
      "id": "ep_34_ut_166"
    },
    {
      "end": 2885086,
      "speaker": "Simon Rogers",
      "start": 2884230,
      "text": "Guys, it's been.",
      "id": "ep_34_ut_167"
    },
    {
      "end": 2894912,
      "speaker": "Moritz Stefaner",
      "start": 2885158,
      "text": "I find it super interesting. What? Like which types of diagrams are picked up by your. I think that's a whole, whole. Another topic.",
      "id": "ep_34_ut_168"
    },
    {
      "end": 2896528,
      "speaker": "Simon Rogers",
      "start": 2894936,
      "text": "For sure.",
      "id": "ep_34_ut_169"
    },
    {
      "end": 2897848,
      "speaker": "Moritz Stefaner",
      "start": 2896624,
      "text": "It's infographics.",
      "id": "ep_34_ut_170"
    },
    {
      "end": 2898848,
      "speaker": "Simon Rogers",
      "start": 2897984,
      "text": "Yeah, absolutely.",
      "id": "ep_34_ut_171"
    },
    {
      "end": 2903340,
      "speaker": "Moritz Stefaner",
      "start": 2898904,
      "text": "Simon, it's been great having you on. That was fantastic. We need to continue the conversation.",
      "id": "ep_34_ut_172"
    },
    {
      "end": 2905620,
      "speaker": "Simon Rogers",
      "start": 2904040,
      "text": "I'll happily come back, guys.",
      "id": "ep_34_ut_173"
    },
    {
      "end": 2907400,
      "speaker": "Moritz Stefaner",
      "start": 2906760,
      "text": "Yeah.",
      "id": "ep_34_ut_174"
    },
    {
      "end": 2909688,
      "speaker": "Simon Rogers",
      "start": 2907520,
      "text": "All right. See you soon.",
      "id": "ep_34_ut_175"
    },
    {
      "end": 2910800,
      "speaker": "Enrico Bertini",
      "start": 2909744,
      "text": "Thanks a lot, Simon.",
      "id": "ep_34_ut_176"
    },
    {
      "end": 2912080,
      "speaker": "Simon Rogers",
      "start": 2910880,
      "text": "Okay. Bye, guys.",
      "id": "ep_34_ut_177"
    },
    {
      "end": 2912848,
      "speaker": "Enrico Bertini",
      "start": 2912240,
      "text": "Thank you.",
      "id": "ep_34_ut_178"
    },
    {
      "end": 2913940,
      "speaker": "Simon Rogers",
      "start": 2912904,
      "text": "Bye bye.",
      "id": "ep_34_ut_179"
    }
  ],
  "confidence": 0.912050551645853,
  "audio_duration": 2928,
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_status_code": null,
  "webhook_auth": false,
  "webhook_auth_header_name": null,
  "speed_boost": false,
  "auto_highlights_result": null,
  "auto_highlights": false,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_audio_quality": null,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "content_safety": false,
  "iab_categories": true,
  "content_safety_labels": {
    "status": "unavailable",
    "results": [],
    "summary": {}
  },
  "language_detection": false,
  "language_detection_threshold": null,
  "language_confidence": null,
  "custom_spelling": null,
  "throttled": false,
  "auto_chapters": true,
  "summarization": false,
  "summary_type": null,
  "summary_model": null,
  "custom_topics": false,
  "topics": [],
  "speech_threshold": null,
  "speech_model": "best",
  "chapters": [
    {
      "summary": "Enrico: I just came back from a really nice conference in the Netherlands. Nicholas Felton has a nice new report coming up. We now have help with the audio editing. Drop us a line. If you want to help us with something else, let us know.",
      "gist": "Data Stories",
      "headline": "We now have help with the audio editing, which is awesome",
      "start": 6160,
      "end": 231980,
      "id": "ep_34_ch_0"
    },
    {
      "summary": "Simon Rogers is data editor at Twitter in San Francisco. Previously worked for the Guardian in London, where he set up the datablog. Found himself working increasingly with graphics and visuals. People were increasingly looking at data as ways to get into journalism.",
      "gist": "Introducing Twitter's Data Editor Simon Rogers",
      "headline": "Simon Rogers from Twitter joins us today to talk about data journalism",
      "start": 234200,
      "end": 481090,
      "id": "ep_34_ch_1"
    },
    {
      "summary": "You started out as a journalist designer on the paper. What David was really good at was showing things, telling stories in a way that people would understand. I think that's kind of a key skill of data journalism. Just even a tweet could be a story.",
      "gist": "Data Journalism: The Storytellers",
      "headline": "You started out as a journalist designer on the paper",
      "start": 482990,
      "end": 630684,
      "id": "ep_34_ch_2"
    },
    {
      "summary": "Moritz Moritz: When did datablog develop most traction? Like 2008, 2009? The Guardian datablock. Data journalism so evolved that there are different types. Another type of data journalism is new mainstream. It's about using the community to help you work better.",
      "gist": "The Guardian Datablog",
      "headline": "Your work opened data visualization to new audiences that have not been involved",
      "start": 630732,
      "end": 1046146,
      "id": "ep_34_ch_3"
    },
    {
      "summary": "We use data wrapper, Dataapper and Cartodobi. We try to tell stories around the way that people talk on Twitter. Wouldn't it be great if you had a tool like that? You could just annotate as well.",
      "gist": "Other than DataApp, What Do You Use to Visualize Twitter",
      "headline": "Are there any other tools you use a lot to visualize Twitter data",
      "start": 1046218,
      "end": 1309770,
      "id": "ep_34_ch_4"
    },
    {
      "summary": "\"My official job title is data editor. It's about trying to help tell those stories with that data and take it from being big and confusing to make it meaningful and simpler people to understand \" After a year in the job, he says he still feels like he's \"scratching the surface of what's possible \"",
      "gist": "What does your role at the Guardian entail?",
      "headline": "Your official job title is data editor at Twitter",
      "start": 1314920,
      "end": 1433490,
      "id": "ep_34_ch_5"
    },
    {
      "summary": "I work closely with the analytics team, who are amazing here. Then I'd work with Nico Belmonte on the visual insights team. I'd like to spend a bit more time investigating how events influence Twitter immediately. Is there a specific website where you publish all this work?",
      "gist": "How Twitter works: The data, analytics, visualization",
      "headline": "How do you come up with new ideas using Twitter data",
      "start": 1435950,
      "end": 1816716,
      "id": "ep_34_ch_6"
    },
    {
      "summary": "But they looked at the language around rumors on Twitter and how quickly they spread. And to me, that is a really fascinating way to use that data. It allows the way that it monitors explosions of information.",
      "gist": "The Internet's Secret to the Harlem Explosion",
      "headline": "Data miners monitor explosions of information on Twitter",
      "start": 1816748,
      "end": 1889800,
      "id": "ep_34_ch_7"
    },
    {
      "summary": "There's a place for everything, just as there is for different types of data journalism. Just as punk became mainstream, data will become mainstream too, because that's inevitable. I really hope that there will always be a room for gifted amateurs out there.",
      "gist": "Interactive Data Journalism: The New Punk",
      "headline": "You push out a lot of very snackable information on the web",
      "start": 1892860,
      "end": 2138268,
      "id": "ep_34_ch_8"
    },
    {
      "summary": "Data journalism as punk means that everyone now can do data journalism. But it's so easy to use data improperly. The more data literate we are as a profession, the less likely it is people will get away with stuff. It's so important to involve the audience in what you're doing.",
      "gist": "The role of data journalism",
      "headline": "William Night says everyone can do data journalism, but mistakes can happen",
      "start": 2138284,
      "end": 2386080,
      "id": "ep_34_ch_9"
    },
    {
      "summary": "Where is the limit in terms of complexity that the audience can bear when you are publishing a new visualization? You have to find the right trade off between complexity and expressiveness in your work.",
      "gist": "The Limit of Complexity in Data Visualization",
      "headline": "Where is the limit in terms of complexity that the audience can bear when visualization",
      "start": 2387740,
      "end": 2611052,
      "id": "ep_34_ch_10"
    },
    {
      "summary": "A good visualization is not necessarily only about the design of the visualization itself, is the data that is really, really important. Sometimes we try to do something and we don't discover anything interesting there. If I'm interested, then there'll be somebody out there who'll be interested in it as well.",
      "gist": "I think the visualization community is a little too dogmatic",
      "headline": "I think the visualization community is a little bit too dogmatic",
      "start": 2611076,
      "end": 2767410,
      "id": "ep_34_ch_11"
    },
    {
      "summary": "Simon Cowell has released two children's books. The books are illustrated by Peter Grundy and Nicholas Blackman. They are infographics for kids, basically. A friend of mine who works with kids with special needs said this could be a great way to teach them.",
      "gist": "Simon on His Infographics for Kids",
      "headline": "Simon etail has written two children's books about infographics",
      "start": 2768590,
      "end": 2913940,
      "id": "ep_34_ch_12"
    }
  ],
  "disfluencies": false,
  "entity_detection": false,
  "sentiment_analysis": false,
  "sentiment_analysis_results": null,
  "entities": null,
  "speakers_expected": null,
  "summary": null,
  "custom_topics_results": null,
  "is_deleted": null,
  "episode_num": "34",
  "episode_metadata": {
    "speakers": [
      "Moritz Stefaner",
      "Enrico Bertini",
      "Simon Rogers"
    ],
    "WPid": "165",
    "url": "https://datastori.es/podlove/file/355/s/feed/c/mp3/datastories-e34.mp3",
    "episode_title": "Data journalism w/ Simon Rogers"
  }
}