{
  "id": "38875123-d516-44c4-aa74-625550344cf1",
  "language_model": "assemblyai_default",
  "acoustic_model": "assemblyai_default",
  "language_code": "en_us",
  "status": "completed",
  "audio_url": "https://datastori.es/podlove/file/174/s/feed/c/mp3/Datastories-13.mp3",
  "utterances": [
    {
      "end": 35372,
      "speaker": "Enrico Bertini",
      "start": 15120,
      "text": "Hi, everyone. Enrico here for a special edition of Data Stories. I am at this week 2012, and unfortunately Moritz is not here and I don't even know if he knows that we are recording that. And I have some special guests. So I have Andrew Van de Moere here.",
      "id": "ep_13_ut_0"
    },
    {
      "end": 36204,
      "speaker": "Andrew Vande Moere",
      "start": 35548,
      "text": "Thank you.",
      "id": "ep_13_ut_1"
    },
    {
      "end": 41644,
      "speaker": "Enrico Bertini",
      "start": 36284,
      "text": "I don't know if my pronunciation was correct. Andrew and Jerome Cukier. Hi, guys.",
      "id": "ep_13_ut_2"
    },
    {
      "end": 42212,
      "speaker": "Andrew Vande Moere",
      "start": 41764,
      "text": "Hello.",
      "id": "ep_13_ut_3"
    },
    {
      "end": 75614,
      "speaker": "Enrico Bertini",
      "start": 42308,
      "text": "So if you don't know who these guys are, well, just google it and you will find out. Well, that's totally improvised. We just want to say something about this week 2012. I'm sure you guys have some impressions now. We are almost at the end. Today's Thursday and tomorrow morning is going to end. Yeah, I mean, for me it was fantastic, as usual. And I don't know. Jerome, do you have something that you want to say about this week, this year?",
      "id": "ep_13_ut_4"
    },
    {
      "end": 130580,
      "speaker": "Jerome Cukier",
      "start": 76274,
      "text": "Okay, about today or about the week? Well, as you like, started by today. Today was really good. There were two sessions that I really, really liked. First one this morning was bringing the industry to talk to this week. And so we had talks about practitioners and who are not just about theory. And that was interesting to have that dialogue. There was a very interesting question that was asked to these folks is what do the designers expect from the scientists of this week? My impression in the five these weeks that I've been attending is that you never actually ask the science community actually what he needs to do.",
      "id": "ep_13_ut_5"
    },
    {
      "end": 131884,
      "speaker": "Enrico Bertini",
      "start": 130772,
      "text": "Oh, I like that.",
      "id": "ep_13_ut_6"
    },
    {
      "end": 133228,
      "speaker": "Jerome Cukier",
      "start": 132004,
      "text": "Yeah, that was interesting.",
      "id": "ep_13_ut_7"
    },
    {
      "end": 135836,
      "speaker": "Enrico Bertini",
      "start": 133316,
      "text": "And were there any questions then?",
      "id": "ep_13_ut_8"
    },
    {
      "end": 145824,
      "speaker": "Jerome Cukier",
      "start": 136020,
      "text": "Oh, answer us answers, actually. Okay. I would say the question was more interesting than the answers, but it was interesting.",
      "id": "ep_13_ut_9"
    },
    {
      "end": 147380,
      "speaker": "Enrico Bertini",
      "start": 146124,
      "text": "So what was it?",
      "id": "ep_13_ut_10"
    },
    {
      "end": 152064,
      "speaker": "Jerome Cukier",
      "start": 147492,
      "text": "And so don't grill me.",
      "id": "ep_13_ut_11"
    },
    {
      "end": 169080,
      "speaker": "Andrew Vande Moere",
      "start": 152404,
      "text": "No, but like some, I remember Kim Reyes telling that she likes these very rigorous things that are also very. Some depth in a way, I guess, mimicking her own style, but that she basically wants to steal stuff for her own practice, which I think is a very truthful article.",
      "id": "ep_13_ut_12"
    },
    {
      "end": 170400,
      "speaker": "Enrico Bertini",
      "start": 169112,
      "text": "That's how science works, right.",
      "id": "ep_13_ut_13"
    },
    {
      "end": 187248,
      "speaker": "Jerome Cukier",
      "start": 170432,
      "text": "Kim Ruiz, she usually gets the written proceedings, like the book that used to be made. Right? And she brings it back to a secret lab and studies it and see what can be replicated or not. But now the book are no longer printed, so you actually have to attend.",
      "id": "ep_13_ut_14"
    },
    {
      "end": 197382,
      "speaker": "Enrico Bertini",
      "start": 187296,
      "text": "Well, I think you can still ask for, I mean, the printed version of the proceedings if you pay for. Yeah, yeah, sure, sure. They are just memory sticks from us.",
      "id": "ep_13_ut_15"
    },
    {
      "end": 198830,
      "speaker": "Jerome Cukier",
      "start": 197478,
      "text": "Yeah, I mean, she's got one, I guess.",
      "id": "ep_13_ut_16"
    },
    {
      "end": 209414,
      "speaker": "Enrico Bertini",
      "start": 198862,
      "text": "Yeah, they're just trying to be more ecological or just saving some money, probably. Okay. Andrew, your impressions on this week, what do you.",
      "id": "ep_13_ut_17"
    },
    {
      "end": 249654,
      "speaker": "Andrew Vande Moere",
      "start": 209494,
      "text": "Well, it's more me. Well, I've only been here before one or two times, but that's kind of many years ago. So I find it much more mixed than I expected. Some parts go very, very technical. Really over your head. But the session last session today was very design oriented. You had indeed some people from practice talking. There was also a session of artists really showing their work, which tried to inspire scientists. And the room was not empty. What else? There was even a session where they were a drawing, where there were sketching things. First of all, the design tutorial, very basic one. Yeah.",
      "id": "ep_13_ut_18"
    },
    {
      "end": 251854,
      "speaker": "Enrico Bertini",
      "start": 249734,
      "text": "You mean this last one that we just attended?",
      "id": "ep_13_ut_19"
    },
    {
      "end": 275958,
      "speaker": "Andrew Vande Moere",
      "start": 251894,
      "text": "No, it was yesterday. I think so, yeah. We'll talk about sketching later. There was a guy, I forgot his name. He was a designer himself, visual communication designer, and he gave some, some good tips and then they got some data, some cancer statistics data, if I remember correctly. And they had to start drawing. So it was very hands on as well. So in a way, I think it's way more richer or wider than a typical academic conference.",
      "id": "ep_13_ut_20"
    },
    {
      "end": 306654,
      "speaker": "Enrico Bertini",
      "start": 276046,
      "text": "Yeah, yeah. It's exactly my same feeling. And I've been coming here for some years now and I'm more and more excited and it's really cool. And another effect that I've noticed is that we have these three main tracks. We have scientific visualization, information visualization and visual analytics. And they become more and more differentiated. And I think that's a good thing. Especially the infovis's track. It's getting its own style and its own specific content. I don't know if you have the same.",
      "id": "ep_13_ut_21"
    },
    {
      "end": 308950,
      "speaker": "Andrew Vande Moere",
      "start": 306734,
      "text": "The only people who tweet are in the infobest track.",
      "id": "ep_13_ut_22"
    },
    {
      "end": 310518,
      "speaker": "Enrico Bertini",
      "start": 309022,
      "text": "It's kind of very difficult for people.",
      "id": "ep_13_ut_23"
    },
    {
      "end": 313878,
      "speaker": "Andrew Vande Moere",
      "start": 310566,
      "text": "Outside to know that there are other kinds of visualizations, which is a pity.",
      "id": "ep_13_ut_24"
    },
    {
      "end": 315846,
      "speaker": "Enrico Bertini",
      "start": 313966,
      "text": "Yeah, that's true.",
      "id": "ep_13_ut_25"
    },
    {
      "end": 342486,
      "speaker": "Jerome Cukier",
      "start": 315910,
      "text": "I think that the fact that you have one person that tweets and another person that replies. That's right. Stimulates the debate within the room. And so the other tracks, they need to have their doctor, TJ and Robert Kosara. So another thing for the week that for me was different than the other years. And I regret that Ben Standaman is not here because he asked the greatest questions.",
      "id": "ep_13_ut_26"
    },
    {
      "end": 345678,
      "speaker": "Enrico Bertini",
      "start": 342670,
      "text": "Is it because he always eats up the room or what?",
      "id": "ep_13_ut_27"
    },
    {
      "end": 365294,
      "speaker": "Jerome Cukier",
      "start": 345806,
      "text": "I mean, it's very interesting when. I mean, yeah, there is that. But the question that he can afford to ask any question to a presenter and he does, and it makes, creates a dynamic.",
      "id": "ep_13_ut_28"
    },
    {
      "end": 370466,
      "speaker": "Enrico Bertini",
      "start": 366874,
      "text": "So do you mean that the presenters have not been challenged enough this year?",
      "id": "ep_13_ut_29"
    },
    {
      "end": 405554,
      "speaker": "Jerome Cukier",
      "start": 370530,
      "text": "Oh, there has been some really good questions. However, I did attend at least one talk where the person gave their presentation and there was no question. And I didn't feel good about it. I wasn't able myself to ask questions because it was way over my head. But that's. Yeah, I felt kind of uneasy about it that you could let the paper, when, you know, all the effort that goes into making a presentation, submitting the acceptance rates, etcetera.",
      "id": "ep_13_ut_30"
    },
    {
      "end": 417938,
      "speaker": "Enrico Bertini",
      "start": 405634,
      "text": "Yeah, yeah, yeah. But. Well, this is normally also the role of the session chair. He has to take care of having at least one question, but this can change from one session to another. Anyway, these are technicalities.",
      "id": "ep_13_ut_31"
    },
    {
      "end": 419514,
      "speaker": "Jerome Cukier",
      "start": 417986,
      "text": "You did pretty good as a session chair.",
      "id": "ep_13_ut_32"
    },
    {
      "end": 454800,
      "speaker": "Enrico Bertini",
      "start": 419594,
      "text": "Oh, thanks. Thanks a lot. Yeah. And another thing I noticed that at infovis particularly, is that I have the feeling that this year we are getting more reflective on what we have done in the past. So we had a quite good mix of techniques and reflections, maybe even a little bit more reflections than techniques, which is pretty unique this year. But in a way, I think it's an interesting trend. Of course, the downside of it is that we might become too reflective and not creative enough. But I think it's interesting. I don't know if you have noticed that or.",
      "id": "ep_13_ut_33"
    },
    {
      "end": 458866,
      "speaker": "Andrew Vande Moere",
      "start": 454912,
      "text": "I don't think. Well, it was maybe one and a half session about more, I think, at.",
      "id": "ep_13_ut_34"
    },
    {
      "end": 469482,
      "speaker": "Enrico Bertini",
      "start": 458890,
      "text": "Least, especially the beginning of the week, we had all these sessions on evaluation methodology, frameworks, stuff like that. Maybe it's just the impression I got from the first day and I'm still there. I don't know.",
      "id": "ep_13_ut_35"
    },
    {
      "end": 482254,
      "speaker": "Andrew Vande Moere",
      "start": 469498,
      "text": "But yesterday was like plenty of techniques and plenty of very high level mathematics and algorithms. So I think it kind of compensates. But, yeah, you have to watch out to keep some sort of ACLU balance.",
      "id": "ep_13_ut_36"
    },
    {
      "end": 489424,
      "speaker": "Enrico Bertini",
      "start": 482804,
      "text": "So what's the highlight? Okay, what did you like, Jerome?",
      "id": "ep_13_ut_37"
    },
    {
      "end": 499220,
      "speaker": "Jerome Cukier",
      "start": 489844,
      "text": "I think that so far, the star of the conference is the handy processing library and applications and the discussion around it.",
      "id": "ep_13_ut_38"
    },
    {
      "end": 500700,
      "speaker": "Enrico Bertini",
      "start": 499332,
      "text": "Which one? Sorry, say it again.",
      "id": "ep_13_ut_39"
    },
    {
      "end": 502380,
      "speaker": "Jerome Cukier",
      "start": 500812,
      "text": "The handy. The sketching.",
      "id": "ep_13_ut_40"
    },
    {
      "end": 507012,
      "speaker": "Enrico Bertini",
      "start": 502532,
      "text": "The sketchy. Sketchy visualization. Yeah. Can you explain what it is first?",
      "id": "ep_13_ut_41"
    },
    {
      "end": 577344,
      "speaker": "Jerome Cukier",
      "start": 507108,
      "text": "Okay, so it is a library in processing, but the implementation is not that important. It's a technique by which, instead of drawing a shape. Exactly. With nice straight angles, you introduce a dimension of sketchiness, that is shaking lines, and you get that hand drawn effect, but algorithmically. And so the people from the GI center, Gerwood Jezendeiss, they had prepared their effects by distributing those postcards in the poster session. And I was intrigued when I first saw it. And when Jo Wood did the actual presentation, I think that was the one that generated the most activity on Twitter. Both from inside the room and outside, I could tell that many people have liked to be here. And I must say that George is a great presenter. And all his talks that I've been at in the past.",
      "id": "ep_13_ut_42"
    },
    {
      "end": 581544,
      "speaker": "Enrico Bertini",
      "start": 578604,
      "text": "Yeah, he has a really nice style.",
      "id": "ep_13_ut_43"
    },
    {
      "end": 638602,
      "speaker": "Jerome Cukier",
      "start": 581924,
      "text": "And also about those people, I must say that they are among the researchers that have the strongest sense of aesthetics in the presentation of their results, which is very nice. But anyway, this library introduced a wide range of possibilities. And then following that in the session, there's been some very interesting discussions about how to use it. Because it's not a gadget, it's not a filter or something, you know, a decoration. It's really a variable that has a purpose, that has limitations, that has. Right. Possible application. And so to have this all in context, it was very interesting. It's one of those things. Before it didn't really exist. It wasn't easy to do. And now it's there and it's really exciting.",
      "id": "ep_13_ut_44"
    },
    {
      "end": 661884,
      "speaker": "Enrico Bertini",
      "start": 638778,
      "text": "Okay. I have to say that personally liked it quite a lot, but I'm not so excited. So what's the reason? Why do you think it's so important to have that? What does it add to our toolbox? Why is it so important? Yeah, because I think it's nice, but I'm not fully convinced that it's really important or useful.",
      "id": "ep_13_ut_45"
    },
    {
      "end": 722164,
      "speaker": "Jerome Cukier",
      "start": 663344,
      "text": "I think that booster Wood and Jean Den Fiquette framed it in a different way, but in an interesting way, that when you present a visual, that sketching effect, you are in a way allowing people to critique it. So it's more engaging, it is more approachable. And I think that this feels a need that we were not really able to do without doing things manually working like illustrators. And this is not unlike another thing that's been presented, which are the typographical maps. The technique that's been presented earlier in the week to make maps with letters and text. It's been a really interesting algorithm presented to the. It automatically because before it was possible to do it manually.",
      "id": "ep_13_ut_46"
    },
    {
      "end": 726544,
      "speaker": "Enrico Bertini",
      "start": 722244,
      "text": "That's the work. That's the work from the lab of Schiller Carpenter or what?",
      "id": "ep_13_ut_47"
    },
    {
      "end": 729220,
      "speaker": "Jerome Cukier",
      "start": 726924,
      "text": "Okay, now I have to rekindle.",
      "id": "ep_13_ut_48"
    },
    {
      "end": 733468,
      "speaker": "Andrew Vande Moere",
      "start": 729292,
      "text": "No, I don't think so. GI center again. Yeah, it might be.",
      "id": "ep_13_ut_49"
    },
    {
      "end": 758364,
      "speaker": "Jerome Cukier",
      "start": 733596,
      "text": "It was a collaboration, but like the handy thing anyway. But suppose feel that needs to. To go towards things that look more like illustration, that look more. I mean, less cold, automatic and more personal, fuzzy and human centered.",
      "id": "ep_13_ut_50"
    },
    {
      "end": 770572,
      "speaker": "Andrew Vande Moere",
      "start": 758864,
      "text": "Yeah, I'm also not. I mean, I know it's very beautiful and it was also a very accessible talk. So it was kind of very easy to be enthusiastic about, but it's an effect. Like, imagine everybody would use it.",
      "id": "ep_13_ut_51"
    },
    {
      "end": 771436,
      "speaker": "Enrico Bertini",
      "start": 770688,
      "text": "It will lose.",
      "id": "ep_13_ut_52"
    },
    {
      "end": 787844,
      "speaker": "Andrew Vande Moere",
      "start": 771500,
      "text": "I think it's special, sort of. Its special, its uniqueness. So it's also a danger. Right. You have to kind of use it in a very wise way, just like you use color in the right way and stuff like that. But it has an immediately a visual appeal that maybe also is a danger of it.",
      "id": "ep_13_ut_53"
    },
    {
      "end": 803040,
      "speaker": "Jerome Cukier",
      "start": 787924,
      "text": "Yeah, I was thinking when I was doing that, that it could go terribly wrong if it was abused. Like, if you just add sketchiness for the sake of it. Yeah. There's just no point.",
      "id": "ep_13_ut_54"
    },
    {
      "end": 816856,
      "speaker": "Andrew Vande Moere",
      "start": 803152,
      "text": "You can see sketchiness already. Infographics for you. Lots of people try to convey this not computational way of conveying these sort of things. So you have many, plenty of bad examples of this sort of thing.",
      "id": "ep_13_ut_55"
    },
    {
      "end": 877680,
      "speaker": "Jerome Cukier",
      "start": 816920,
      "text": "Yeah, I really liked the example. Okay, so there was. So Jooch showed graph rendering of a network using this technique that looks like something you can sketch on paper, only it was interactive. That is, you could drag the nodes around. And so that was very interesting. I'm also thinking that there's a possible use of this technique to make diagrams. That reminds me of the books of Dan Rome. The backside of the napkin, that is, to create that style, which is appropriate when you make a presentation to kind of reflex, how to say it, a form of personal reflection, as opposed to just using the templates, can show your personal involvement, which is nice. So, yeah.",
      "id": "ep_13_ut_56"
    },
    {
      "end": 889416,
      "speaker": "Andrew Vande Moere",
      "start": 877872,
      "text": "And I would like to take the opportunity to put another paper in the spotlight, the one about design study methodology, like for your listeners. Very, very applicable.",
      "id": "ep_13_ut_57"
    },
    {
      "end": 890456,
      "speaker": "Enrico Bertini",
      "start": 889520,
      "text": "That's what I liked a lot.",
      "id": "ep_13_ut_58"
    },
    {
      "end": 901188,
      "speaker": "Andrew Vande Moere",
      "start": 890480,
      "text": "So if you ever want to come to this week and you want to present, and you're a designer, that's really the paper. At least if you read only one paper, that should be the paper to read, because basically also tells you you should tweet more paper.",
      "id": "ep_13_ut_59"
    },
    {
      "end": 901904,
      "speaker": "Enrico Bertini",
      "start": 901276,
      "text": "Yeah.",
      "id": "ep_13_ut_60"
    },
    {
      "end": 908508,
      "speaker": "Andrew Vande Moere",
      "start": 902484,
      "text": "Before you can ever make the chance. But I hope you'll add it to your blog or to this story.",
      "id": "ep_13_ut_61"
    },
    {
      "end": 909180,
      "speaker": "Enrico Bertini",
      "start": 908596,
      "text": "I will.",
      "id": "ep_13_ut_62"
    },
    {
      "end": 921332,
      "speaker": "Andrew Vande Moere",
      "start": 909292,
      "text": "But that's certainly one thing that for the community of designers and practitioners who want to kind of make the bridge to science and the other way around as well, could be very provocative, could be really a way in.",
      "id": "ep_13_ut_63"
    },
    {
      "end": 933282,
      "speaker": "Enrico Bertini",
      "start": 921468,
      "text": "Yeah, I'm glad you mentioned that, because it's one of the few papers I've seen in this venue that can really have an impact out of academia, and it's really. So maybe we should summarize what it is.",
      "id": "ep_13_ut_64"
    },
    {
      "end": 935814,
      "speaker": "Andrew Vande Moere",
      "start": 933338,
      "text": "Oh, my God. You have to remember something two days ago.",
      "id": "ep_13_ut_65"
    },
    {
      "end": 939214,
      "speaker": "Enrico Bertini",
      "start": 937274,
      "text": "I don't know. Andrew, you want to summarize?",
      "id": "ep_13_ut_66"
    },
    {
      "end": 970880,
      "speaker": "Andrew Vande Moere",
      "start": 940714,
      "text": "Well .1, I have ten points to say. Okay. No, it basically tells you some pitfalls and gives you some tips, if I remember correctly, how to approach this and what you should at least cover or where reviewers will definitely look for in such a paper, if you're a designer. So you can't just explain what you've done. You have to be more rigorous than that. But, yeah. So it's maybe more like a cookbook. I hope it's. I have to read it myself more carefully, but that's what I remember. So maybe it's a cookbook.",
      "id": "ep_13_ut_67"
    },
    {
      "end": 971704,
      "speaker": "Enrico Bertini",
      "start": 970992,
      "text": "Yeah, yeah.",
      "id": "ep_13_ut_68"
    },
    {
      "end": 974336,
      "speaker": "Andrew Vande Moere",
      "start": 971824,
      "text": "Although, you know, you can cook and follow the recipe.",
      "id": "ep_13_ut_69"
    },
    {
      "end": 983168,
      "speaker": "Enrico Bertini",
      "start": 974480,
      "text": "It's a very detailed, very well specified design process for visualization.",
      "id": "ep_13_ut_70"
    },
    {
      "end": 983752,
      "speaker": "Andrew Vande Moere",
      "start": 983296,
      "text": "Right.",
      "id": "ep_13_ut_71"
    },
    {
      "end": 997430,
      "speaker": "Enrico Bertini",
      "start": 983848,
      "text": "Starting from how you approach people who might be potential, potential end users up to developing the thing and reflecting on the thing. Right.",
      "id": "ep_13_ut_72"
    },
    {
      "end": 998154,
      "speaker": "Andrew Vande Moere",
      "start": 997502,
      "text": "Yeah.",
      "id": "ep_13_ut_73"
    },
    {
      "end": 1001758,
      "speaker": "Enrico Bertini",
      "start": 998734,
      "text": "Documenting all the way down and documenting all the way down everything you do.",
      "id": "ep_13_ut_74"
    },
    {
      "end": 1004326,
      "speaker": "Andrew Vande Moere",
      "start": 1001806,
      "text": "Because it might become important later on.",
      "id": "ep_13_ut_75"
    },
    {
      "end": 1071412,
      "speaker": "Enrico Bertini",
      "start": 1004510,
      "text": "And one thing that is, I think it's really useful, and it's definitely useful for myself. I really like that one of the early stages of this process that they propose is that they have this winnowing phase where they basically say, I really like the way Michael, the presenter, Michael Seidelmeyer presented the thing. And he said, basically, I've been doing several design studies so far. And the problem there is that when you have a person approaching you and saying, oh, I think I will need visualization, then you are a visualization designer or researcher or whatever, and you say, sure, I will do it, and you never say no to anyone. But then when you go down to really trying to do this thing for real, you might discover that there are a whole lot of problems. Like they don't really need visualization. They thought they needed visualization. But this problem can either be solved automatically or with something else, or you cannot really collaborate with these people, or they told you that they had some kind of data, but they cannot really access this data. So there are all sorts of problems. And I have experienced that many, many times so far, and I think it's really, really useful.",
      "id": "ep_13_ut_76"
    },
    {
      "end": 1087020,
      "speaker": "Jerome Cukier",
      "start": 1071548,
      "text": "Well, in the organization, you may not have the liberty to turn down people who come and ask you to make this on the paper. What I liked on the presentation is that he highlighted a number of pitfalls.",
      "id": "ep_13_ut_77"
    },
    {
      "end": 1088324,
      "speaker": "Enrico Bertini",
      "start": 1087132,
      "text": "Yeah, yeah.",
      "id": "ep_13_ut_78"
    },
    {
      "end": 1102156,
      "speaker": "Jerome Cukier",
      "start": 1088484,
      "text": "And that things that you may not be aware of when you make visualizations. You know, like, for instance, I really like to use that cool technique that I've just researched. It's probably the best you know, that's.",
      "id": "ep_13_ut_79"
    },
    {
      "end": 1102676,
      "speaker": "Enrico Bertini",
      "start": 1102220,
      "text": "Yeah.",
      "id": "ep_13_ut_80"
    },
    {
      "end": 1104740,
      "speaker": "Jerome Cukier",
      "start": 1102780,
      "text": "Those insights I really liked.",
      "id": "ep_13_ut_81"
    },
    {
      "end": 1109104,
      "speaker": "Andrew Vande Moere",
      "start": 1104932,
      "text": "Rico, what was your impression of the best paper? Except of mine, of course.",
      "id": "ep_13_ut_82"
    },
    {
      "end": 1131034,
      "speaker": "Enrico Bertini",
      "start": 1110124,
      "text": "I actually really liked yours. You don't want me to talk about your paper? That is fresh in my mind. I mean, it's just something. You presented this in a few, not minutes ago, maybe 1 hour ago or so. Yeah. No, really. I really like your presentation. And not the paper, but the presentation.",
      "id": "ep_13_ut_83"
    },
    {
      "end": 1132994,
      "speaker": "Andrew Vande Moere",
      "start": 1132014,
      "text": "Okay.",
      "id": "ep_13_ut_84"
    },
    {
      "end": 1150448,
      "speaker": "Enrico Bertini",
      "start": 1134134,
      "text": "No, no, really. Well, maybe you want to describe, want to tell your paper I like your paper? No, really. No. I like a lot the best paper. But let's talk about your paper first. Can you briefly summarize what it is?",
      "id": "ep_13_ut_85"
    },
    {
      "end": 1185374,
      "speaker": "Andrew Vande Moere",
      "start": 1150496,
      "text": "Okay. We took three, we chose three different styles from the same visualization technique. One was very analytical, one was very artistic. One tried to sort of hit the middle ground between functionality and beauty. And we were looking for whether people had different sorts of insights, kinds of insights that they could get out of it. And in the end, it became a very big study that we did online with some clear patterns that we could see, but also a lot of open questions that came out of the research. Good.",
      "id": "ep_13_ut_86"
    },
    {
      "end": 1190602,
      "speaker": "Enrico Bertini",
      "start": 1187594,
      "text": "Yeah. This is another thing I wanted to ask you, Andrew, so.",
      "id": "ep_13_ut_87"
    },
    {
      "end": 1191494,
      "speaker": "Andrew Vande Moere",
      "start": 1190658,
      "text": "Oh, my God.",
      "id": "ep_13_ut_88"
    },
    {
      "end": 1218196,
      "speaker": "Enrico Bertini",
      "start": 1191834,
      "text": "Yeah. So how is it for you coming to this week and wearing probably, I don't know, maybe you are wearing different hats. Is it more the designer kind of thing or the editor? I didn't tell that you are the editor of infosthetics. Maybe people might not know it. I don't know. Or the scientist, actually. You are all these things together, right?",
      "id": "ep_13_ut_89"
    },
    {
      "end": 1246424,
      "speaker": "Andrew Vande Moere",
      "start": 1218340,
      "text": "Well, it's all together. I can't distinguish them. So I think I look through all these glasses at the same time. I can't mix them. So I'm tweeting as well as I'm trying to make notes for new research ideas. So in that sense, it's kind of useful to be here. Although, you know, like I said, it's more like a meta level of visualization. So as a designer, you have to get kind of also get used that lots of these things that are being discussed are really going over your head.",
      "id": "ep_13_ut_90"
    },
    {
      "end": 1246904,
      "speaker": "Enrico Bertini",
      "start": 1246504,
      "text": "Yeah.",
      "id": "ep_13_ut_91"
    },
    {
      "end": 1252844,
      "speaker": "Andrew Vande Moere",
      "start": 1246984,
      "text": "And it's really computer science. It is really a science. You can't just step into it and think, you know, everything.",
      "id": "ep_13_ut_92"
    },
    {
      "end": 1257216,
      "speaker": "Enrico Bertini",
      "start": 1254664,
      "text": "Good, good. Yeah.",
      "id": "ep_13_ut_93"
    },
    {
      "end": 1258680,
      "speaker": "Andrew Vande Moere",
      "start": 1257240,
      "text": "But still, what is your best paper?",
      "id": "ep_13_ut_94"
    },
    {
      "end": 1259872,
      "speaker": "Enrico Bertini",
      "start": 1258792,
      "text": "It's the best paper.",
      "id": "ep_13_ut_95"
    },
    {
      "end": 1262680,
      "speaker": "Andrew Vande Moere",
      "start": 1260008,
      "text": "The best paper. Can you talk about what that was?",
      "id": "ep_13_ut_96"
    },
    {
      "end": 1264752,
      "speaker": "Enrico Bertini",
      "start": 1262832,
      "text": "No, Sharon can do it.",
      "id": "ep_13_ut_97"
    },
    {
      "end": 1269040,
      "speaker": "Jerome Cukier",
      "start": 1264928,
      "text": "Well, if we talk about the best paper, then we can talk about.",
      "id": "ep_13_ut_98"
    },
    {
      "end": 1271296,
      "speaker": "Enrico Bertini",
      "start": 1269112,
      "text": "There was a lot of discussion around this paper. Right.",
      "id": "ep_13_ut_99"
    },
    {
      "end": 1272832,
      "speaker": "Jerome Cukier",
      "start": 1271360,
      "text": "There is a mini scandal, actually.",
      "id": "ep_13_ut_100"
    },
    {
      "end": 1278808,
      "speaker": "Enrico Bertini",
      "start": 1272928,
      "text": "A mini scandal color gauge. Oh, we like this kind of stuff in data stories.",
      "id": "ep_13_ut_101"
    },
    {
      "end": 1281312,
      "speaker": "Jerome Cukier",
      "start": 1278936,
      "text": "Let's talk about what the best paper was.",
      "id": "ep_13_ut_102"
    },
    {
      "end": 1282444,
      "speaker": "Enrico Bertini",
      "start": 1281448,
      "text": "Yeah, sure.",
      "id": "ep_13_ut_103"
    },
    {
      "end": 1289536,
      "speaker": "Jerome Cukier",
      "start": 1283104,
      "text": "So I remember what it was, but I don't remember the title. So could you find it? You can find it online.",
      "id": "ep_13_ut_104"
    },
    {
      "end": 1291872,
      "speaker": "Andrew Vande Moere",
      "start": 1289640,
      "text": "1 second. It was our capacity limits.",
      "id": "ep_13_ut_105"
    },
    {
      "end": 1293656,
      "speaker": "Enrico Bertini",
      "start": 1291968,
      "text": "Oh, wait, wait. I have to learn this one.",
      "id": "ep_13_ut_106"
    },
    {
      "end": 1301216,
      "speaker": "Andrew Vande Moere",
      "start": 1293680,
      "text": "How capacity limits of attention influence information, visualization, effectiveness. Listeners know exactly what it does.",
      "id": "ep_13_ut_107"
    },
    {
      "end": 1303204,
      "speaker": "Jerome Cukier",
      "start": 1301280,
      "text": "Beside the authors, they deserve to be.",
      "id": "ep_13_ut_108"
    },
    {
      "end": 1306144,
      "speaker": "Andrew Vande Moere",
      "start": 1303904,
      "text": "Steve Harrows and David Whitney.",
      "id": "ep_13_ut_109"
    },
    {
      "end": 1306720,
      "speaker": "Jerome Cukier",
      "start": 1306304,
      "text": "Okay.",
      "id": "ep_13_ut_110"
    },
    {
      "end": 1307968,
      "speaker": "Enrico Bertini",
      "start": 1306752,
      "text": "And Steve was presenting.",
      "id": "ep_13_ut_111"
    },
    {
      "end": 1308974,
      "speaker": "Jerome Cukier",
      "start": 1308016,
      "text": "Right, right.",
      "id": "ep_13_ut_112"
    },
    {
      "end": 1310614,
      "speaker": "Enrico Bertini",
      "start": 1309144,
      "text": "Okay, sure. I'm quiet.",
      "id": "ep_13_ut_113"
    },
    {
      "end": 1438244,
      "speaker": "Jerome Cukier",
      "start": 1311034,
      "text": "So the experiments that was done was a square, which was made of 64 small squares of various colors, and the number of different colors would vary. In the experiment, there could be two colors, three colors, five colors, six, seven colors. And sometimes all the squares of the same colors were put together, grouped. That is, they were all in the same area of the larger square, all touching each other, and sometimes they were all scrambled. And so the presenters were testing whether viewers could easily distinguish, easily find which, if there was a color with only one square, or how many different colors were present in total, and things like that. And so the conclusion was that there's a big difference if the squares are grouped. If the colors are grouped together, it makes it much easier to decode what's going on in the larger square, and that there is a threshold, a number of color, where there's a clear threshold, where the ability to decode this falls drastically. And so that number changes whether the. Depending on whether those scholars are grouped or not. And as you said, it got the best paper award. And I must say that the demonstration that is a presentation of it was very, very convincing. I mean, you could really very easily follow the thought process of the authors, and they walk you through the results. It was very clear.",
      "id": "ep_13_ut_114"
    },
    {
      "end": 1438764,
      "speaker": "Enrico Bertini",
      "start": 1438364,
      "text": "Yeah.",
      "id": "ep_13_ut_115"
    },
    {
      "end": 1443652,
      "speaker": "Jerome Cukier",
      "start": 1438844,
      "text": "And I agree, as a non researcher, I appreciated this.",
      "id": "ep_13_ut_116"
    },
    {
      "end": 1444988,
      "speaker": "Andrew Vande Moere",
      "start": 1443748,
      "text": "So what's the scandal?",
      "id": "ep_13_ut_117"
    },
    {
      "end": 1446624,
      "speaker": "Jerome Cukier",
      "start": 1445116,
      "text": "The scandal was that.",
      "id": "ep_13_ut_118"
    },
    {
      "end": 1513840,
      "speaker": "Enrico Bertini",
      "start": 1447044,
      "text": "Okay, sorry. Before you say that, I want to mention one thing I really like about the paper is also that the paper was a core perceptual, psychological kind of study. And I think, in fact, I think these folks are actually psychologists, at least. I think the advisor of this guy is a psychologist, because you cannot run this stuff without rigorous, rigorous psychological labor lab stuff, actually. And one thing I really liked is that, well, first of all, I think we definitely need this kind of basic research. But what I think was really impressive of the talk and the paper itself is that they tried to do the extra, to run the extra mile and translate the results into practical guidelines. And I think that that's pretty unique. I've been a few papers of. I've seen a few papers of this kind in the past, and it's quite rare to see people going up to the point of translating this research into practical guidelines. And I think that's one of the reasons why it's a well deserved best paper.",
      "id": "ep_13_ut_119"
    },
    {
      "end": 1514804,
      "speaker": "Jerome Cukier",
      "start": 1513992,
      "text": "Okay.",
      "id": "ep_13_ut_120"
    },
    {
      "end": 1521352,
      "speaker": "Enrico Bertini",
      "start": 1515224,
      "text": "Anyway, God. Go ahead with the scandal. What's the scandal? We want the scandal.",
      "id": "ep_13_ut_121"
    },
    {
      "end": 1582292,
      "speaker": "Jerome Cukier",
      "start": 1521408,
      "text": "During the week, I've discussed a few people who were not convinced by the paper because one, I don't know if I can say her. Told me that she wasn't. She was. No, I mean, well, that. How to put it. The colors, your eye with the group things not according to hue, but according to luminance, and the colors had not the same luminance. And so there's perception bias in this that wasn't addressed. And so the whole experiment from a color perspective was pretty flawed, and she was surprised that this was not taken into account as the reviewers in that. Yeah. I don't know if this is the.",
      "id": "ep_13_ut_122"
    },
    {
      "end": 1584708,
      "speaker": "Enrico Bertini",
      "start": 1582308,
      "text": "Person who was talking to you or what.",
      "id": "ep_13_ut_123"
    },
    {
      "end": 1585884,
      "speaker": "Jerome Cukier",
      "start": 1584756,
      "text": "Yeah. Yeah. Okay.",
      "id": "ep_13_ut_124"
    },
    {
      "end": 1588572,
      "speaker": "Andrew Vande Moere",
      "start": 1586004,
      "text": "I mean, there's also a guy posting the same.",
      "id": "ep_13_ut_125"
    },
    {
      "end": 1593548,
      "speaker": "Enrico Bertini",
      "start": 1588628,
      "text": "Yeah, this is what I was wondering. Because somebody posted that same condom as a webpage.",
      "id": "ep_13_ut_126"
    },
    {
      "end": 1593948,
      "speaker": "Andrew Vande Moere",
      "start": 1593596,
      "text": "Right?",
      "id": "ep_13_ut_127"
    },
    {
      "end": 1613100,
      "speaker": "Jerome Cukier",
      "start": 1594036,
      "text": "Yeah. And you completely expect this kind of remarks from the b three community. I think it's perfectly valid and et cetera. I don't think it would undermine the validity of the study. Maybe you could do it with glyphs instead of colors. But that was an issue.",
      "id": "ep_13_ut_128"
    },
    {
      "end": 1622684,
      "speaker": "Andrew Vande Moere",
      "start": 1613212,
      "text": "Yeah, but like. Okay, the author already answered. Right? So you not necessarily did. The critique could be correct, because that's a scandal. Who is right?",
      "id": "ep_13_ut_129"
    },
    {
      "end": 1628680,
      "speaker": "Jerome Cukier",
      "start": 1622804,
      "text": "The scandal is that. And it's a mini scandal if it's a non event. But anyway, so this afternoon.",
      "id": "ep_13_ut_130"
    },
    {
      "end": 1629764,
      "speaker": "Andrew Vande Moere",
      "start": 1628752,
      "text": "Okay, sorry.",
      "id": "ep_13_ut_131"
    },
    {
      "end": 1683856,
      "speaker": "Jerome Cukier",
      "start": 1630504,
      "text": "This afternoon, somebody posted a anonymous critique of the best paper. And, well, the thing was that it is anonymous. It was rather harsh. And the person said, where was it posted? Well, there's that account which is called this critic, c r I t I c, on Twitter that said just that. And the person said, look, I'm not steven to you, so I'm not going to do it publicly because that would hurt my career perspective. And so that got some reactions. Some people were like Carlos Schelliger or Danyel Fisher. They were pretty harsh towards this attitude. They said, well, you know, she has something to say. You have to come out and say it.",
      "id": "ep_13_ut_132"
    },
    {
      "end": 1687232,
      "speaker": "Enrico Bertini",
      "start": 1683960,
      "text": "But I didn't realize that. Now I understand the scandal.",
      "id": "ep_13_ut_133"
    },
    {
      "end": 1692964,
      "speaker": "Andrew Vande Moere",
      "start": 1687408,
      "text": "Did you end here? Yes. I realized very late that it was so quiz critic with an s. Yeah.",
      "id": "ep_13_ut_134"
    },
    {
      "end": 1723660,
      "speaker": "Jerome Cukier",
      "start": 1694184,
      "text": "And so the question is, if you are a young researcher, can you speak out against the most senior members of the VSWE community? Because the best paper process is fairly rigorous. I mean, it goes through lots of round. I mean, it's not something pretty random. Right. So I don't know. Yes, because I'm completely referring to this.",
      "id": "ep_13_ut_135"
    },
    {
      "end": 1739524,
      "speaker": "Enrico Bertini",
      "start": 1723772,
      "text": "My opinion is this is bullshit. I mean, if you. It doesn't matter if you're a junior or senior or whatever, if you are honestly convinced that something is flawed, you should. You should actually go to the mic and speak up.",
      "id": "ep_13_ut_136"
    },
    {
      "end": 1743352,
      "speaker": "Andrew Vande Moere",
      "start": 1740584,
      "text": "And you might not have thought that.",
      "id": "ep_13_ut_137"
    },
    {
      "end": 1762148,
      "speaker": "Enrico Bertini",
      "start": 1743448,
      "text": "Earlier, but actually I think this could be beneficial to your career. Not detrimental unless you go there and you say something that is totally stupid. But if you honestly think that what you just saw is not cool. Correct. You should go there, step up and speak.",
      "id": "ep_13_ut_138"
    },
    {
      "end": 1825052,
      "speaker": "Jerome Cukier",
      "start": 1762316,
      "text": "So about the fact that it could be beneficial to your career, I have a little anecdote I'm going to share with you this morning in the session with the practitioners, we had, Eddie Fields from Tableau, and Tableau has been very helpful in setting up this week and etcetera. So Eddie was showing us the trends in the usage of Tableau public. And, you know, I mean, we're all data people. So we saw that curve where the usage were coming up nicely, and then there's a huge spike that goes down very shortly after and then the curve continues. And obviously when you see that, you wonder, so what is a spike? Now, Robert Kosara gave me the answer. He said, you know, the spike was a WikiLeaks incident. So what happened was that somebody had posted a very benign visualization of WikiLeaks, something WikiLeaks related on Tableau public.",
      "id": "ep_13_ut_139"
    },
    {
      "end": 1826092,
      "speaker": "Enrico Bertini",
      "start": 1825148,
      "text": "That's a different story.",
      "id": "ep_13_ut_140"
    },
    {
      "end": 1839364,
      "speaker": "Jerome Cukier",
      "start": 1826148,
      "text": "And. No, no, no. You see, you're going to see how relevant that is. And somebody in the public administration have asked Tableau to take it down and they did, and they got huge backlash for that.",
      "id": "ep_13_ut_141"
    },
    {
      "end": 1841580,
      "speaker": "Enrico Bertini",
      "start": 1839484,
      "text": "Yeah, but that's a completely different story. Right?",
      "id": "ep_13_ut_142"
    },
    {
      "end": 1851292,
      "speaker": "Jerome Cukier",
      "start": 1841612,
      "text": "Yeah, no, let me finish. But then it translated into a huge spike in the views of the visualization.",
      "id": "ep_13_ut_143"
    },
    {
      "end": 1856508,
      "speaker": "Enrico Bertini",
      "start": 1851388,
      "text": "Oh, you mean you're taking this as an example of bad things that could actually lead to bad things?",
      "id": "ep_13_ut_144"
    },
    {
      "end": 1891908,
      "speaker": "Jerome Cukier",
      "start": 1856596,
      "text": "Exactly, yes. So, although. Although the visualization world and lots of people attacked ferociously Tableau for doing that, the result was that they got more views and they got many leads. So people actually downloaded the tool to play with it. So they had fear that you'll be very negative if they complied with what was asked of them. But actually give them more exposure.",
      "id": "ep_13_ut_145"
    },
    {
      "end": 1930384,
      "speaker": "Andrew Vande Moere",
      "start": 1892086,
      "text": "And basically the argument of the guy who is anonymous is that to take away the best paper award, something like that. I mean, I think every paper you can critique, I mean, every paper, you will find mistakes and even the people will sell. But I find it very harsh to even kind of try to do something like that. I think you can open a discussion and see who is right. And probably the truth is somewhere in the middle, or the person might have not written specific things in there, which he should, why he puts questions there. But it's kind of a very harsh way to critique and say, this should not be the best paperwork, at least for all heap of people. The original reviewers and the best paper award reviewers it was.",
      "id": "ep_13_ut_146"
    },
    {
      "end": 1937516,
      "speaker": "Jerome Cukier",
      "start": 1931524,
      "text": "I'm going to put a positive spin to that. I think it's good to have people passionate about this issue.",
      "id": "ep_13_ut_147"
    },
    {
      "end": 1951224,
      "speaker": "Andrew Vande Moere",
      "start": 1937660,
      "text": "Yeah, sure. I mean, but critiquing is part of science and words, and then another word and trying to, as long as it's, if it's constructed, try to take away an award, this is deconstructed. That's not really.",
      "id": "ep_13_ut_148"
    },
    {
      "end": 1998948,
      "speaker": "Enrico Bertini",
      "start": 1951304,
      "text": "It will never be perfect. And we have this kind of discussion every single year, and there are always people who are an epi. I think that's normal. I was kind of an epi, I think, last year or two years ago. It's fine. It's part of the process. One thing that I tried to suggest this year, I was in a committee meeting today. One thing that I find odd is the fact that we announce best papers without explaining why this is the best paper. And I think that's strange because actually there is a committee, and probably the committee discusses why they think this is the best one. And it doesn't take much to just ask the committee to write down this single sentence and speak this sentence when the best paper is given. And maybe this might change next year.",
      "id": "ep_13_ut_149"
    },
    {
      "end": 2003932,
      "speaker": "Jerome Cukier",
      "start": 1999036,
      "text": "You could visualize the committee preferences and how they evolve, you know, round after round.",
      "id": "ep_13_ut_150"
    },
    {
      "end": 2004636,
      "speaker": "Enrico Bertini",
      "start": 2004108,
      "text": "Yeah.",
      "id": "ep_13_ut_151"
    },
    {
      "end": 2005356,
      "speaker": "Jerome Cukier",
      "start": 2004740,
      "text": "How do you communicate?",
      "id": "ep_13_ut_152"
    },
    {
      "end": 2022780,
      "speaker": "Andrew Vande Moere",
      "start": 2005420,
      "text": "But it's more giving a reasoning. I mean, it's also what you can communicate through social media, on the website, and other people. A new generation of researchers will read, why is it so good? And should we do this research in the future? It will be. And now it's just an award, and you have to kind of read in between the lines why it got an award.",
      "id": "ep_13_ut_153"
    },
    {
      "end": 2095404,
      "speaker": "Enrico Bertini",
      "start": 2022852,
      "text": "Yeah. And one thing I was claiming today is that I firmly believe that this conference is turning little by little from being a core academic kind of thing to being something that is more multifaceted. Right. And the more people we get at this conference that don't come from the core academic community, the more we have to take care of what kind of messages we send to them. And giving this best. Best paper award by, basically, it was something like, okay, guys, this is the best paper award. And we gave the award. Yeah, maybe we just added a few sentences about how the process works, but we didn't really explain why this is the best, or at least why the committee thought that this was the best. I think that's really, really detrimental, especially to people who come from the outside, that they cannot really get it. They go there, and it's probably like. I feel like it's like the. The academics telling to the others, look, you have to take this for granted, and it's the best, and take it and read it. Okay? And I don't like this kind of attitude, and I think we should change that. I don't think that this is done on purpose. I think it's more the. I don't know. It's, as I said before, it's more.",
      "id": "ep_13_ut_154"
    },
    {
      "end": 2097452,
      "speaker": "Andrew Vande Moere",
      "start": 2095444,
      "text": "That, like a detail, but it's an important detail.",
      "id": "ep_13_ut_155"
    },
    {
      "end": 2099508,
      "speaker": "Enrico Bertini",
      "start": 2097508,
      "text": "It's an important detail, yeah.",
      "id": "ep_13_ut_156"
    },
    {
      "end": 2103140,
      "speaker": "Andrew Vande Moere",
      "start": 2099636,
      "text": "So anything bad that you saw or anything you.",
      "id": "ep_13_ut_157"
    },
    {
      "end": 2155282,
      "speaker": "Enrico Bertini",
      "start": 2103252,
      "text": "Well, there is always plenty of bad, right? It's always like, Donna. Well, I don't know if I want to offer the details, but I have to say that there is a paper. I attended the talk of a paper today that I really, really liked. I was one of the reviewers for this paper. I cannot mention. I cannot really tell which paper. And I was really, really impressed by how bad the talk was and how a very good, good paper can be killed by a talk and probably the other way around. The opposite happens, too. Right. So. And it made me reflect about the value of. I think there is a disconnect between the value of the paper and the value of the presentation. And I think that's an important presentation.",
      "id": "ep_13_ut_158"
    },
    {
      "end": 2157522,
      "speaker": "Andrew Vande Moere",
      "start": 2155338,
      "text": "We put online because people are asking my slides.",
      "id": "ep_13_ut_159"
    },
    {
      "end": 2165588,
      "speaker": "Enrico Bertini",
      "start": 2157618,
      "text": "I think this year, for the first time, we have a very well organized kind of taping thing.",
      "id": "ep_13_ut_160"
    },
    {
      "end": 2168872,
      "speaker": "Andrew Vande Moere",
      "start": 2165746,
      "text": "And are they taping the sound or what? Or.",
      "id": "ep_13_ut_161"
    },
    {
      "end": 2174960,
      "speaker": "Enrico Bertini",
      "start": 2169048,
      "text": "I think the sound and the slides. So there's no video recording.",
      "id": "ep_13_ut_162"
    },
    {
      "end": 2175360,
      "speaker": "Andrew Vande Moere",
      "start": 2175032,
      "text": "Okay.",
      "id": "ep_13_ut_163"
    },
    {
      "end": 2189232,
      "speaker": "Enrico Bertini",
      "start": 2175392,
      "text": "But I think there is at least the slides and the audio, because I don't know if you noticed that you should have signed, actually, for your time. At the end of each talk, they let you sign. Sort of.",
      "id": "ep_13_ut_164"
    },
    {
      "end": 2193724,
      "speaker": "Andrew Vande Moere",
      "start": 2189408,
      "text": "Maybe I signed closure a month ago, but that. I don't remember, but not here now.",
      "id": "ep_13_ut_165"
    },
    {
      "end": 2199196,
      "speaker": "Enrico Bertini",
      "start": 2193884,
      "text": "Okay. Anyway, I know that they are doing that, and I will be happy to promote this kind of thing.",
      "id": "ep_13_ut_166"
    },
    {
      "end": 2200164,
      "speaker": "Jerome Cukier",
      "start": 2199340,
      "text": "I did sign.",
      "id": "ep_13_ut_167"
    },
    {
      "end": 2202820,
      "speaker": "Enrico Bertini",
      "start": 2200284,
      "text": "You did sign? Yeah, yeah, yeah, yeah. They are recording.",
      "id": "ep_13_ut_168"
    },
    {
      "end": 2204384,
      "speaker": "Andrew Vande Moere",
      "start": 2202932,
      "text": "Maybe they didn't like mine.",
      "id": "ep_13_ut_169"
    },
    {
      "end": 2215428,
      "speaker": "Jerome Cukier",
      "start": 2204924,
      "text": "So it's when I make a shameless plug to my talk. So we did this free tutorial with Jeff Fair and Scott Murray. I was very happy.",
      "id": "ep_13_ut_170"
    },
    {
      "end": 2218036,
      "speaker": "Enrico Bertini",
      "start": 2215556,
      "text": "Oh, yeah, sure. You had your tutorial. We didn't.",
      "id": "ep_13_ut_171"
    },
    {
      "end": 2218596,
      "speaker": "Jerome Cukier",
      "start": 2218100,
      "text": "Yeah, yeah.",
      "id": "ep_13_ut_172"
    },
    {
      "end": 2219984,
      "speaker": "Andrew Vande Moere",
      "start": 2218660,
      "text": "It was very good one.",
      "id": "ep_13_ut_173"
    },
    {
      "end": 2221414,
      "speaker": "Jerome Cukier",
      "start": 2220354,
      "text": "Thank you. Guys.",
      "id": "ep_13_ut_174"
    },
    {
      "end": 2224026,
      "speaker": "Enrico Bertini",
      "start": 2222274,
      "text": "You have to iterate over.",
      "id": "ep_13_ut_175"
    },
    {
      "end": 2260012,
      "speaker": "Jerome Cukier",
      "start": 2224090,
      "text": "Okay. So I've been talking at this week a couple of times, and it's always a super experience. Especially, you know, I have the feeling I come from the outside. I'm kind of tolerated here. And the tutorial was the most successful thing I've done at this week so far. It's really, really exciting to talk in to a full room. And we had great questions. And so it was really a great experience. And I had good feedback. I mean, people looked happy. So I was really excited about how it turned out.",
      "id": "ep_13_ut_176"
    },
    {
      "end": 2260704,
      "speaker": "Enrico Bertini",
      "start": 2260068,
      "text": "Yeah.",
      "id": "ep_13_ut_177"
    },
    {
      "end": 2263860,
      "speaker": "Jerome Cukier",
      "start": 2262524,
      "text": "What else do you want to say?",
      "id": "ep_13_ut_178"
    },
    {
      "end": 2277680,
      "speaker": "Enrico Bertini",
      "start": 2263892,
      "text": "I had the feeling that this year we had more people than usual coming from the not blogosphere, but this people who are normally tweeting about visualization. I met more people than usual.",
      "id": "ep_13_ut_179"
    },
    {
      "end": 2282728,
      "speaker": "Andrew Vande Moere",
      "start": 2277752,
      "text": "So, yeah, I don't. Well, where the old usual suspects were here, like Robert Kosara is.",
      "id": "ep_13_ut_180"
    },
    {
      "end": 2301440,
      "speaker": "Enrico Bertini",
      "start": 2282776,
      "text": "Yeah, but these are the academics, right? I meant who else was blogging? Maybe not directly blogging. What's this guy. What's the name of the guy who wrote the book? Oh, Ilya. Ilya. No, Ilya. Noah. Noah.",
      "id": "ep_13_ut_181"
    },
    {
      "end": 2302320,
      "speaker": "Jerome Cukier",
      "start": 2301552,
      "text": "No, I didn't ski.",
      "id": "ep_13_ut_182"
    },
    {
      "end": 2302472,
      "speaker": "Andrew Vande Moere",
      "start": 2302352,
      "text": "Yeah.",
      "id": "ep_13_ut_183"
    },
    {
      "end": 2302616,
      "speaker": "Enrico Bertini",
      "start": 2302488,
      "text": "Yeah.",
      "id": "ep_13_ut_184"
    },
    {
      "end": 2303920,
      "speaker": "Andrew Vande Moere",
      "start": 2302640,
      "text": "Okay, because he's local.",
      "id": "ep_13_ut_185"
    },
    {
      "end": 2309600,
      "speaker": "Enrico Bertini",
      "start": 2303992,
      "text": "Oh, because he's local. I. I saw for a second Kim Reese, right? You met her, right?",
      "id": "ep_13_ut_186"
    },
    {
      "end": 2311128,
      "speaker": "Andrew Vande Moere",
      "start": 2309632,
      "text": "Yes, but she was one of the speakers.",
      "id": "ep_13_ut_187"
    },
    {
      "end": 2311944,
      "speaker": "Enrico Bertini",
      "start": 2311216,
      "text": "Okay.",
      "id": "ep_13_ut_188"
    },
    {
      "end": 2314520,
      "speaker": "Jerome Cukier",
      "start": 2312104,
      "text": "Kim doesn't come from too far.",
      "id": "ep_13_ut_189"
    },
    {
      "end": 2318744,
      "speaker": "Enrico Bertini",
      "start": 2314712,
      "text": "Yeah, it's true. I think being in Seattle played a role also.",
      "id": "ep_13_ut_190"
    },
    {
      "end": 2334020,
      "speaker": "Andrew Vande Moere",
      "start": 2318784,
      "text": "I mean, I noticed, I think that she couldn't. She was here yesterday, which was probably the most technical day. So it was very hard, I think, for people like that, outsiders to come in, like the session this afternoon. I'm sure she would probably like much more because that's what you could steal, the sketchiness and things.",
      "id": "ep_13_ut_191"
    },
    {
      "end": 2334676,
      "speaker": "Enrico Bertini",
      "start": 2334092,
      "text": "Yeah.",
      "id": "ep_13_ut_192"
    },
    {
      "end": 2338084,
      "speaker": "Andrew Vande Moere",
      "start": 2334820,
      "text": "Yesterday it was much more difficult to kind of get a grip.",
      "id": "ep_13_ut_193"
    },
    {
      "end": 2351076,
      "speaker": "Jerome Cukier",
      "start": 2338204,
      "text": "But I'm going to make another plug for Kim. It's really great that we have people like her here. It is really great that she will.",
      "id": "ep_13_ut_194"
    },
    {
      "end": 2352478,
      "speaker": "Enrico Bertini",
      "start": 2351100,
      "text": "Be listening to this.",
      "id": "ep_13_ut_195"
    },
    {
      "end": 2353934,
      "speaker": "Jerome Cukier",
      "start": 2352676,
      "text": "Maybe, maybe not.",
      "id": "ep_13_ut_196"
    },
    {
      "end": 2356654,
      "speaker": "Enrico Bertini",
      "start": 2354634,
      "text": "Now you're getting her nice. Now.",
      "id": "ep_13_ut_197"
    },
    {
      "end": 2376614,
      "speaker": "Jerome Cukier",
      "start": 2358434,
      "text": "She knows. She knows how to say that kind of stuff. It's really great that people from the v three. Community can see the added value that people like him and other practitioners bring to the visualization.",
      "id": "ep_13_ut_198"
    },
    {
      "end": 2377990,
      "speaker": "Enrico Bertini",
      "start": 2376954,
      "text": "Yeah, sure.",
      "id": "ep_13_ut_199"
    },
    {
      "end": 2396034,
      "speaker": "Jerome Cukier",
      "start": 2378162,
      "text": "Because it's not always obvious and that the kind of stuff they do, again, it is not prettiness. It is, you know, organizing information. It is bringing meaning to information.",
      "id": "ep_13_ut_200"
    },
    {
      "end": 2397118,
      "speaker": "Enrico Bertini",
      "start": 2396574,
      "text": "Yeah.",
      "id": "ep_13_ut_201"
    },
    {
      "end": 2445534,
      "speaker": "Jerome Cukier",
      "start": 2397206,
      "text": "And she does it in a way with her tools and with her experience, and that is great and useful. I'm really happy that there can be some intersections now. I wanted also to mention something rapidly for a very short while. Robert Kosara had put online Tableau public visualization of the Visweek attendees, but they had to take it down, but not fast enough so people couldn't see it. And so I noticed that people without PhD, although they represent only one third of the data stories speaking committee, they are a slight majority at this week.",
      "id": "ep_13_ut_202"
    },
    {
      "end": 2454846,
      "speaker": "Andrew Vande Moere",
      "start": 2445574,
      "text": "So these are also people who almost have a PhD. There are many graduates, so you have to subtract from that.",
      "id": "ep_13_ut_203"
    },
    {
      "end": 2464454,
      "speaker": "Jerome Cukier",
      "start": 2454870,
      "text": "Okay, five. So there were 1050 attendees this week, which is significantly more than the previous ones, which were around 800.",
      "id": "ep_13_ut_204"
    },
    {
      "end": 2472366,
      "speaker": "Enrico Bertini",
      "start": 2464534,
      "text": "Yeah, I think the numbers are the correct numbers. Rough numbers are like, this year. 4000 more than last year.",
      "id": "ep_13_ut_205"
    },
    {
      "end": 2473246,
      "speaker": "Jerome Cukier",
      "start": 2472430,
      "text": "4000.",
      "id": "ep_13_ut_206"
    },
    {
      "end": 2483714,
      "speaker": "Enrico Bertini",
      "start": 2473430,
      "text": "Sorry, 400. No, 400 more. And previous year was around 300 more. So it's really growing.",
      "id": "ep_13_ut_207"
    },
    {
      "end": 2515204,
      "speaker": "Jerome Cukier",
      "start": 2484614,
      "text": "So 150 people, 501 of which have a PhD, and 46 grad students. Or students, maybe not grad students. So will more than 25 of the students get a PhD or not? Anyway, so just to say that we non PhD people are not a poor guy. Yeah, yeah. I mean, no, we are not the most visible.",
      "id": "ep_13_ut_208"
    },
    {
      "end": 2521648,
      "speaker": "Enrico Bertini",
      "start": 2515584,
      "text": "Are you trying to scare people out of this week or trying to help? Because I'm always trying to do the opposite here.",
      "id": "ep_13_ut_209"
    },
    {
      "end": 2523112,
      "speaker": "Jerome Cukier",
      "start": 2521776,
      "text": "No, no, no. I think that.",
      "id": "ep_13_ut_210"
    },
    {
      "end": 2524240,
      "speaker": "Enrico Bertini",
      "start": 2523168,
      "text": "Don't spoil my plan.",
      "id": "ep_13_ut_211"
    },
    {
      "end": 2533640,
      "speaker": "Jerome Cukier",
      "start": 2524312,
      "text": "There are lots of sessions which are perfectly accessible for people who don't speak advanced mathematics.",
      "id": "ep_13_ut_212"
    },
    {
      "end": 2564092,
      "speaker": "Enrico Bertini",
      "start": 2533792,
      "text": "Yeah, but I want to say something else. I mean, it's not only a matter of participating. So if there is one message that I want to give to the world is there are plenty of opportunities to have an active role. You don't have to be a professor or a PhD student or whatever related to academia. You can find your role in this community if you want to. And I think your example is. Your case is one example. Right.",
      "id": "ep_13_ut_213"
    },
    {
      "end": 2571824,
      "speaker": "Jerome Cukier",
      "start": 2564188,
      "text": "Okay, so I'm going to talk about someone else, someone who was a first time this week person. Jon Schwabish.",
      "id": "ep_13_ut_214"
    },
    {
      "end": 2573708,
      "speaker": "Enrico Bertini",
      "start": 2572604,
      "text": "Oh, yeah, he was there.",
      "id": "ep_13_ut_215"
    },
    {
      "end": 2574204,
      "speaker": "Jerome Cukier",
      "start": 2573796,
      "text": "Yeah. Yeah.",
      "id": "ep_13_ut_216"
    },
    {
      "end": 2575744,
      "speaker": "Enrico Bertini",
      "start": 2574244,
      "text": "Oh, that's another guy.",
      "id": "ep_13_ut_217"
    },
    {
      "end": 2581244,
      "speaker": "Jerome Cukier",
      "start": 2576404,
      "text": "So let's. Let's talk about John for a minute, because. So it's his first time at Visweek.",
      "id": "ep_13_ut_218"
    },
    {
      "end": 2582904,
      "speaker": "Enrico Bertini",
      "start": 2581284,
      "text": "Don't say that. He didn't like it.",
      "id": "ep_13_ut_219"
    },
    {
      "end": 2588540,
      "speaker": "Jerome Cukier",
      "start": 2583724,
      "text": "I've met him before, but. So he comes up with a poster.",
      "id": "ep_13_ut_220"
    },
    {
      "end": 2589172,
      "speaker": "Enrico Bertini",
      "start": 2588732,
      "text": "Oh, okay.",
      "id": "ep_13_ut_221"
    },
    {
      "end": 2590108,
      "speaker": "Jerome Cukier",
      "start": 2589188,
      "text": "A banner perspiration.",
      "id": "ep_13_ut_222"
    },
    {
      "end": 2590892,
      "speaker": "Enrico Bertini",
      "start": 2590156,
      "text": "Yeah, sure.",
      "id": "ep_13_ut_223"
    },
    {
      "end": 2594860,
      "speaker": "Jerome Cukier",
      "start": 2591028,
      "text": "And an ignite talk at offsite events. Three things at once.",
      "id": "ep_13_ut_224"
    },
    {
      "end": 2595664,
      "speaker": "Enrico Bertini",
      "start": 2594892,
      "text": "Yeah, yeah.",
      "id": "ep_13_ut_225"
    },
    {
      "end": 2600024,
      "speaker": "Andrew Vande Moere",
      "start": 2596244,
      "text": "You are supporting, my dear networks with everyone.",
      "id": "ep_13_ut_226"
    },
    {
      "end": 2601476,
      "speaker": "Enrico Bertini",
      "start": 2600484,
      "text": "Thanks, Jono.",
      "id": "ep_13_ut_227"
    },
    {
      "end": 2603628,
      "speaker": "Jerome Cukier",
      "start": 2601580,
      "text": "Yeah, yeah. See, we don't plan, but actually, we'll.",
      "id": "ep_13_ut_228"
    },
    {
      "end": 2604612,
      "speaker": "Andrew Vande Moere",
      "start": 2603636,
      "text": "Get a beer later on.",
      "id": "ep_13_ut_229"
    },
    {
      "end": 2605476,
      "speaker": "Enrico Bertini",
      "start": 2604708,
      "text": "Yeah, yeah.",
      "id": "ep_13_ut_230"
    },
    {
      "end": 2609396,
      "speaker": "Jerome Cukier",
      "start": 2605580,
      "text": "Okay, sure. Oh, okay.",
      "id": "ep_13_ut_231"
    },
    {
      "end": 2610584,
      "speaker": "Andrew Vande Moere",
      "start": 2609420,
      "text": "I have something to add.",
      "id": "ep_13_ut_232"
    },
    {
      "end": 2612944,
      "speaker": "Jerome Cukier",
      "start": 2611884,
      "text": "Annaburger.",
      "id": "ep_13_ut_233"
    },
    {
      "end": 2614260,
      "speaker": "Enrico Bertini",
      "start": 2613924,
      "text": "So.",
      "id": "ep_13_ut_234"
    },
    {
      "end": 2622416,
      "speaker": "Jerome Cukier",
      "start": 2614292,
      "text": "No, but I mean, so he comes from the outside and he was kind of conscious about it because. So he's got a PhD, for the record, but he's an economist.",
      "id": "ep_13_ut_235"
    },
    {
      "end": 2623344,
      "speaker": "Enrico Bertini",
      "start": 2622520,
      "text": "Yeah, yeah.",
      "id": "ep_13_ut_236"
    },
    {
      "end": 2628404,
      "speaker": "Jerome Cukier",
      "start": 2623464,
      "text": "So. And I think that what he's done has been appreciated.",
      "id": "ep_13_ut_237"
    },
    {
      "end": 2632768,
      "speaker": "Enrico Bertini",
      "start": 2628824,
      "text": "Sure. I'm sure. Absolutely. And he's been blogging, right?",
      "id": "ep_13_ut_238"
    },
    {
      "end": 2633504,
      "speaker": "Andrew Vande Moere",
      "start": 2632816,
      "text": "Yeah, it was tweeting.",
      "id": "ep_13_ut_239"
    },
    {
      "end": 2643734,
      "speaker": "Jerome Cukier",
      "start": 2633544,
      "text": "Oh, yeah. Because that's, yeah, that's the problem of, you know, when it's your first time, Andy Kirk will take advantage of that. He will ask you something and you can't refuse.",
      "id": "ep_13_ut_240"
    },
    {
      "end": 2645162,
      "speaker": "Enrico Bertini",
      "start": 2643824,
      "text": "You did that last year, right?",
      "id": "ep_13_ut_241"
    },
    {
      "end": 2664010,
      "speaker": "Jerome Cukier",
      "start": 2645218,
      "text": "Yeah, right. I've been there. Yeah, I know the feeling. You know, I've been in John's shoes. You come back after a day full of conference, full of talk, and then you do, you go, you know, you do the parties and all that. You come home, it's 02:00 a.m. and you, you're thinking, I can't sleep before I write that blog post for Andy.",
      "id": "ep_13_ut_242"
    },
    {
      "end": 2664506,
      "speaker": "Enrico Bertini",
      "start": 2664122,
      "text": "Yeah.",
      "id": "ep_13_ut_243"
    },
    {
      "end": 2664954,
      "speaker": "Jerome Cukier",
      "start": 2664570,
      "text": "Yeah.",
      "id": "ep_13_ut_244"
    },
    {
      "end": 2665654,
      "speaker": "Enrico Bertini",
      "start": 2665034,
      "text": "That.",
      "id": "ep_13_ut_245"
    },
    {
      "end": 2707578,
      "speaker": "Andrew Vande Moere",
      "start": 2665994,
      "text": "I wonder a bit, because what we are just all tweeting, but we don't know. I mean, I don't know how people react on, but I hope it has a big influence also on this week that for people who are not, could not be here, still had some sort of real time feedback of where we're at and what the discussion was about and the feelings and the emotions within the audience. Maybe conferences should be more attentive for that to have some people tweeting and actively encourage that and even questions or something that comes from the external world to the paper. Maybe session shared, should read some tweets and maybe ask a question from the guy who can read the paper from his own country and still have a question.",
      "id": "ep_13_ut_246"
    },
    {
      "end": 2708334,
      "speaker": "Enrico Bertini",
      "start": 2707666,
      "text": "Yeah.",
      "id": "ep_13_ut_247"
    },
    {
      "end": 2711114,
      "speaker": "Andrew Vande Moere",
      "start": 2710274,
      "text": "2.0.",
      "id": "ep_13_ut_248"
    },
    {
      "end": 2712694,
      "speaker": "Enrico Bertini",
      "start": 2711194,
      "text": "Yeah, I agree.",
      "id": "ep_13_ut_249"
    },
    {
      "end": 2725716,
      "speaker": "Jerome Cukier",
      "start": 2713634,
      "text": "In some conferences there are devices so that you could ask questions. I mean, you could see tweets. You can visualize tweets like, you know, screen project.",
      "id": "ep_13_ut_250"
    },
    {
      "end": 2728156,
      "speaker": "Andrew Vande Moere",
      "start": 2725860,
      "text": "Yeah. Twitter wall.",
      "id": "ep_13_ut_251"
    },
    {
      "end": 2735372,
      "speaker": "Jerome Cukier",
      "start": 2728340,
      "text": "I have mixed feelings for that, for really presentations, because you could really, we.",
      "id": "ep_13_ut_252"
    },
    {
      "end": 2737436,
      "speaker": "Enrico Bertini",
      "start": 2735388,
      "text": "Should outsource this thing to you, Andrea.",
      "id": "ep_13_ut_253"
    },
    {
      "end": 2742228,
      "speaker": "Andrew Vande Moere",
      "start": 2737580,
      "text": "I can't program a Twitter wall, but I'm sure, like, people like Jerome stuff.",
      "id": "ep_13_ut_254"
    },
    {
      "end": 2744660,
      "speaker": "Enrico Bertini",
      "start": 2742276,
      "text": "You do this kind of large display stuff, right?",
      "id": "ep_13_ut_255"
    },
    {
      "end": 2747988,
      "speaker": "Andrew Vande Moere",
      "start": 2744732,
      "text": "Yeah, but we don't program visualizations yet. Yeah, come on.",
      "id": "ep_13_ut_256"
    },
    {
      "end": 2749384,
      "speaker": "Jerome Cukier",
      "start": 2748076,
      "text": "That's not, you know.",
      "id": "ep_13_ut_257"
    },
    {
      "end": 2767498,
      "speaker": "Enrico Bertini",
      "start": 2752674,
      "text": "Anyway, yeah. It's a miracle that we managed to record this episode here. We've been empty. We wanted to do it from day one, and I always want to do this thing when I'm attending this week, and I never managed to do.",
      "id": "ep_13_ut_258"
    },
    {
      "end": 2768810,
      "speaker": "Andrew Vande Moere",
      "start": 2767586,
      "text": "I really try to push.",
      "id": "ep_13_ut_259"
    },
    {
      "end": 2776894,
      "speaker": "Enrico Bertini",
      "start": 2768882,
      "text": "I'm really, really happy that we managed to do that here. I think we should stop here. We've been talking for more than 45 minutes.",
      "id": "ep_13_ut_260"
    },
    {
      "end": 2781154,
      "speaker": "Jerome Cukier",
      "start": 2777514,
      "text": "The last plot for a session that I liked. It's positive, right?",
      "id": "ep_13_ut_261"
    },
    {
      "end": 2781514,
      "speaker": "Enrico Bertini",
      "start": 2781234,
      "text": "Yeah.",
      "id": "ep_13_ut_262"
    },
    {
      "end": 2808608,
      "speaker": "Jerome Cukier",
      "start": 2781554,
      "text": "Come on. It takes 30 seconds. I like connecting the dots tutorial, especially the second part, is if you haven't had a chance to be at this week, you can see the slides. So the second part has a very, very nice comparison of all the ways to group visually information, and I think that you can find it useful.",
      "id": "ep_13_ut_263"
    },
    {
      "end": 2833964,
      "speaker": "Enrico Bertini",
      "start": 2808736,
      "text": "Okay, great. Good tip. Okay, what else? I propose that we say hello to Moritz, everyone. Probably you are sleeping right now, and it was great not to have you here. No, he's saying all these terrible things about you. I had some buddies with me out, and. Thanks a lot, guys, for helping me.",
      "id": "ep_13_ut_264"
    },
    {
      "end": 2838680,
      "speaker": "Jerome Cukier",
      "start": 2834584,
      "text": "A couple of people asked me, how do we get Moritz Stefaner here?",
      "id": "ep_13_ut_265"
    },
    {
      "end": 2840672,
      "speaker": "Enrico Bertini",
      "start": 2838792,
      "text": "Oh, you want to touch that now?",
      "id": "ep_13_ut_266"
    },
    {
      "end": 2841712,
      "speaker": "Jerome Cukier",
      "start": 2840808,
      "text": "No, no, no.",
      "id": "ep_13_ut_267"
    },
    {
      "end": 2843944,
      "speaker": "Enrico Bertini",
      "start": 2841848,
      "text": "That's a huge, huge thing. Yeah.",
      "id": "ep_13_ut_268"
    },
    {
      "end": 2844832,
      "speaker": "Jerome Cukier",
      "start": 2843984,
      "text": "Yeah. So.",
      "id": "ep_13_ut_269"
    },
    {
      "end": 2846984,
      "speaker": "Enrico Bertini",
      "start": 2844928,
      "text": "But maybe we can announce that.",
      "id": "ep_13_ut_270"
    },
    {
      "end": 2848864,
      "speaker": "Jerome Cukier",
      "start": 2847064,
      "text": "That I don't think.",
      "id": "ep_13_ut_271"
    },
    {
      "end": 2850808,
      "speaker": "Enrico Bertini",
      "start": 2848864,
      "text": "Is it a secret of 2014?",
      "id": "ep_13_ut_272"
    },
    {
      "end": 2851884,
      "speaker": "Andrew Vande Moere",
      "start": 2850936,
      "text": "What's the secret?",
      "id": "ep_13_ut_273"
    },
    {
      "end": 2853320,
      "speaker": "Enrico Bertini",
      "start": 2852504,
      "text": "It's not a secret.",
      "id": "ep_13_ut_274"
    },
    {
      "end": 2854320,
      "speaker": "Andrew Vande Moere",
      "start": 2853392,
      "text": "This is house.",
      "id": "ep_13_ut_275"
    },
    {
      "end": 2878394,
      "speaker": "Enrico Bertini",
      "start": 2854472,
      "text": "No. This week, 2014 will be for the first time in Europe, in Paris. And I guess that would be much, much easier for Moritz to attend. But it's true, Moritz, a lot of people here have been asking about you, and a lot of people actually told me and said, oh, data story is cool. And, yeah, I listen to it while I'm in the bathroom.",
      "id": "ep_13_ut_276"
    },
    {
      "end": 2886898,
      "speaker": "Andrew Vande Moere",
      "start": 2879734,
      "text": "Oh, wow. That's the best compliment you have. Great. What were your compliments people made?",
      "id": "ep_13_ut_277"
    },
    {
      "end": 2888642,
      "speaker": "Enrico Bertini",
      "start": 2887066,
      "text": "That's the best compliment ever.",
      "id": "ep_13_ut_278"
    },
    {
      "end": 2889346,
      "speaker": "Andrew Vande Moere",
      "start": 2888698,
      "text": "All right, great.",
      "id": "ep_13_ut_279"
    },
    {
      "end": 2892450,
      "speaker": "Enrico Bertini",
      "start": 2889450,
      "text": "Anyway, thanks a lot. We stop here. Bye. Bye.",
      "id": "ep_13_ut_280"
    },
    {
      "end": 2893570,
      "speaker": "Andrew Vande Moere",
      "start": 2892522,
      "text": "See you, guys. Bye.",
      "id": "ep_13_ut_281"
    }
  ],
  "confidence": 0.902293619724076,
  "audio_duration": 2896,
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_status_code": null,
  "webhook_auth": false,
  "webhook_auth_header_name": null,
  "speed_boost": false,
  "auto_highlights_result": null,
  "auto_highlights": false,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_audio_quality": null,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "content_safety": false,
  "iab_categories": true,
  "content_safety_labels": {
    "status": "unavailable",
    "results": [],
    "summary": {}
  },
  "language_detection": false,
  "language_detection_threshold": null,
  "language_confidence": null,
  "custom_spelling": null,
  "throttled": false,
  "auto_chapters": true,
  "summarization": false,
  "summary_type": null,
  "summary_model": null,
  "custom_topics": false,
  "topics": [],
  "speech_threshold": null,
  "speech_model": "best",
  "chapters": [
    {
      "summary": "Enrico: This is a special edition of Data Stories. And I have some special guests. Andrew Van de Moere and Jerome Cukier. If you don't know who these guys are, just google it and you will find out.",
      "gist": "Data Stories",
      "headline": "Enrico has some special guests for Data Stories this week",
      "start": 15120,
      "end": 51156,
      "id": "ep_13_ch_0"
    },
    {
      "summary": "We just want to say something about this week 2012. Today's Thursday and tomorrow morning is going to end. For me, for me it was fantastic, as usual. Jerome, do you have something that you want to says about thisweek, this year?",
      "gist": "A message about the week",
      "headline": "We just want to say something about this week 2012. I'm sure you guys have some impressions now",
      "start": 51220,
      "end": 78894,
      "id": "ep_13_ch_1"
    },
    {
      "summary": "Today was really good. There were two sessions that I really, really liked. First one this morning was bringing the industry to talk to this week. Talks about practitioners and who are not just about theory. What do the designers expect from the scientists of this week?",
      "gist": "WGS08: What do the designers expect from the scientists of",
      "headline": "There were two sessions that I really, really liked today",
      "start": 79514,
      "end": 203754,
      "id": "ep_13_ch_2"
    },
    {
      "summary": "Andrew: I find it much more mixed than I expected. The session last session today was very design oriented. There was even a session where they were a drawing, where there were sketching things. In a way, I think it's way more richer or wider than a typical academic conference.",
      "gist": "Wonders of the Conference",
      "headline": "Andrew: I find this conference much more mixed than I expected",
      "start": 204974,
      "end": 329314,
      "id": "ep_13_ch_3"
    },
    {
      "summary": "So do you mean that the presenters have not been challenged enough this year? Oh, there has been some really good questions. However, I did attend at least one talk where the person gave their presentation and there was no question. I wasn't able myself to ask questions because it was way over my head.",
      "gist": "A Question for the Presenters",
      "headline": "So another thing for the week that for me was different than the other years",
      "start": 330494,
      "end": 423210,
      "id": "ep_13_ch_4"
    },
    {
      "summary": "This year we are getting more reflective on what we have done in the past. We had a quite good mix of techniques and reflections, maybe even a little bit more reflections than techniques. Of course, the downside of it is that we might become too reflective and not creative enough.",
      "gist": "A mix of techniques and reflections at Infovies",
      "headline": "Infovies this year had a mix of techniques and reflections",
      "start": 423322,
      "end": 482254,
      "id": "ep_13_ch_5"
    },
    {
      "summary": "Jerome: The star of the conference is the handy processing library and applications and the discussion around it. Instead of drawing a shape, you introduce a dimension of sketchiness, that is shaking lines, and you get that hand drawn effect. There have been some interesting discussions about how to use it.",
      "gist": "The sketchy library",
      "headline": "Jerome: I think the star of the conference was the handy processing library",
      "start": 482804,
      "end": 875924,
      "id": "ep_13_ch_6"
    },
    {
      "summary": "The paper about design study methodology is very, very applicable to designers. It's one of the few papers I've seen in this venue that can really have an impact out of academia. I hope you'll add it to your blog or to this story.",
      "gist": "The Design Study Methodology paper",
      "headline": "One of the few papers that can really have an impact out of academia",
      "start": 876504,
      "end": 931084,
      "id": "ep_13_ch_7"
    },
    {
      "summary": "The paper is a very detailed, very well specified design process for visualization. It basically tells you some pitfalls and gives you some tips on how to approach this. Andrew: I think it's really useful, and it's definitely useful for myself.",
      "gist": "The Design Process for Data Visualization",
      "headline": "It's a very detailed, very well specified design process for visualization",
      "start": 931164,
      "end": 1104740,
      "id": "ep_13_ch_8"
    },
    {
      "summary": "Rico, what was your impression of the best paper? Except of mine, of course. I actually really liked yours. And not the paper, but the presentation.",
      "gist": "A Taste of the Best Paper",
      "headline": "Rico: I really like your presentation. And not the paper, but the presentation",
      "start": 1104932,
      "end": 1146354,
      "id": "ep_13_ch_9"
    },
    {
      "summary": "Researchers chose three different styles from the same visualization technique. One was very analytical, one was very artistic. One tried to sort of hit the middle ground between functionality and beauty. In the end, it became a very big study with some clear patterns that we could see, but also a lot of open questions.",
      "gist": "Interactive visualization: The science of data visualization",
      "headline": "You've done a study looking at how people use visualization techniques",
      "start": 1146654,
      "end": 1188234,
      "id": "ep_13_ch_10"
    },
    {
      "summary": "Andrew Keen: Is it more the designer kind of thing or the editor? Keen: You are all these things together, right? What is your best paper? It's the best paper.",
      "gist": "The World's Best Paper",
      "headline": "Andrew: What is your best paper? Sharon: The best paper",
      "start": 1188354,
      "end": 1278808,
      "id": "ep_13_ch_11"
    },
    {
      "summary": "How capacity limits of attention influence information, visualization, effectiveness. If the colors are grouped together, it makes it much easier to decode what's going on in the larger square. The study was a core perceptual, psychological kind of study. It got the best paper award.",
      "gist": "The World Psychological Awards 2009",
      "headline": "How capacity limits of attention influence information, visualization, effectiveness",
      "start": 1278936,
      "end": 1518000,
      "id": "ep_13_ch_12"
    },
    {
      "summary": "There's perception bias in this that wasn't addressed. The whole experiment from a color perspective was pretty flawed. Maybe you could do it with glyphs instead of colors. The critique could be correct, because that's a scandal.",
      "gist": "The critique of the b 3 study",
      "headline": "There's perception bias in this paper that wasn't addressed",
      "start": 1518152,
      "end": 1626332,
      "id": "ep_13_ch_13"
    },
    {
      "summary": "Someone posted a anonymous critique of the best paper on Twitter. The question is, if you are a young researcher, can you speak out against the most senior members of the VSWE community? If you are honestly convinced that something is flawed, you should. speak up.",
      "gist": "Anonymous Critic of the Best Paper",
      "headline": "Someone posted an anonymous critique of the best paper on Twitter this afternoon",
      "start": 1626388,
      "end": 1762148,
      "id": "ep_13_ch_14"
    },
    {
      "summary": "The spike was a WikiLeaks incident. Someone had posted a very benign visualization of WikiLeaks on Tableau public. The result was that they got more views and they got many leads. I find it very harsh to even kind of try to do something like that.",
      "gist": "The Case for Criticizing Tableau",
      "headline": "Someone posted a benign visualization of WikiLeaks on Tableau public",
      "start": 1762316,
      "end": 1965704,
      "id": "ep_13_ch_15"
    },
    {
      "summary": "One thing that I find odd is the fact that we announce best papers without explaining why this is the best paper. This conference is turning little by little from being a core academic kind of thing to being more multifaceted.",
      "gist": "The Best Paper Award",
      "headline": "One thing that I find odd is that we announce best papers without explaining",
      "start": 1965864,
      "end": 2099508,
      "id": "ep_13_ch_16"
    },
    {
      "summary": "Donna Brazile: I attended the talk of a paper today that I really, really liked. She says she was impressed by how bad the talk was and how a very good, good paper can be killed by a talk and probably the other way around. Brazile says there is a disconnect between the value of the paper and thevalue of the presentation.",
      "gist": "A talk at the Summer Conference",
      "headline": "I attended the talk of a paper today that I really, really liked",
      "start": 2099636,
      "end": 2224026,
      "id": "ep_13_ch_17"
    },
    {
      "summary": "This year we had more people than usual coming from the not blogosphere, but this people who are normally tweeting about visualization. Kim Reese was one of the speakers. It's really great that people from the v three. Community can see the added value that people like him and other practitioners bring to the visualization.",
      "gist": "A taste of V3 at the Conference",
      "headline": "This year we had more people than usual coming from the not blogosphere",
      "start": 2224090,
      "end": 2408722,
      "id": "ep_13_ch_18"
    },
    {
      "summary": "There were 1050 attendees this week, which is significantly more than the previous ones. 150 people, 501 of which have a PhD, and 46 grad students. There are plenty of sessions which are perfectly accessible for people who don't speak advanced mathematics. You can find your role in this community if you want to.",
      "gist": "A message for non-PPhDs",
      "headline": "There were 1050 attendees this week, which is significantly more than previous ones",
      "start": 2408738,
      "end": 2564092,
      "id": "ep_13_ch_19"
    },
    {
      "summary": "Jon Schwabish was a first time attendee at Visweek this week. He came up with a poster and ignite talk at offsite events. Maybe conferences should be more attentive for that to have some people tweeting. It's a miracle that we managed to record this episode here.",
      "gist": "Visweek 1.3",
      "headline": "Jono: Maybe conferences should more actively encourage tweeting at conferences",
      "start": 2564188,
      "end": 2772174,
      "id": "ep_13_ch_20"
    },
    {
      "summary": "I like connecting the dots tutorial, especially the second part. Second part has a very, very nice comparison of all the ways to group visually information. I think that you can find it useful.",
      "gist": "Continuing the Connecting the Dot",
      "headline": "I like connecting the dots tutorial, especially the second part",
      "start": 2772754,
      "end": 2810528,
      "id": "ep_13_ch_21"
    },
    {
      "summary": "This week, 2014 will be for the first time in Europe, in Paris. Moritz, a lot of people here have been asking about you. What were your compliments people made? That's the best compliment ever. See you, guys. Bye.",
      "gist": "Moritz Stefaner on",
      "headline": "This week, 2014 will be for the first time in Europe, in Paris",
      "start": 2810696,
      "end": 2893570,
      "id": "ep_13_ch_22"
    }
  ],
  "disfluencies": false,
  "entity_detection": false,
  "sentiment_analysis": false,
  "sentiment_analysis_results": null,
  "entities": null,
  "speakers_expected": null,
  "summary": null,
  "custom_topics_results": null,
  "episode_num": 13,
  "episode_metadata": {
    "speakers": [
      "Enrico Bertini",
      "Andrew Vande Moere",
      "Jerome Cukier"
    ],
    "WPid": "98",
    "url": "https://datastori.es/podlove/file/174/s/feed/c/mp3/datastories-13.mp3",
    "episode_title": "from Visweek 2012"
  }
}