{
  "id": "886b0404-acc8-4a3b-b331-b09f8f711da0",
  "language_model": "assemblyai_default",
  "acoustic_model": "assemblyai_default",
  "language_code": "en_us",
  "status": "completed",
  "audio_url": "https://datastori.es/podlove/file/568/s/feed/c/mp3/Datastories-46.mp3",
  "utterances": [
    {
      "end": 16930,
      "speaker": "Moritz Stefaner",
      "start": 240,
      "text": "Datastores is supported by Tableau software, helping people see and understand their data. Get answers from interactive dashboards wherever you go. For your free trial, visit Tableau software at table software.com Datastories.",
      "id": "ep_46_ut_0"
    },
    {
      "end": 33630,
      "speaker": "Enrico Bertini",
      "start": 27150,
      "text": "Hi, everyone. Data stories number 46. Happy New year. Hi, Moritz. How are you?",
      "id": "ep_46_ut_1"
    },
    {
      "end": 38946,
      "speaker": "Moritz Stefaner",
      "start": 33930,
      "text": "Good. Refreshed? Yeah. I did nothing for two whole weeks.",
      "id": "ep_46_ut_2"
    },
    {
      "end": 39618,
      "speaker": "Enrico Bertini",
      "start": 39018,
      "text": "Same here.",
      "id": "ep_46_ut_3"
    },
    {
      "end": 42706,
      "speaker": "Moritz Stefaner",
      "start": 39674,
      "text": "Nothing, absolutely nothing was exactly what I was after.",
      "id": "ep_46_ut_4"
    },
    {
      "end": 43314,
      "speaker": "Enrico Bertini",
      "start": 42858,
      "text": "Perfect.",
      "id": "ep_46_ut_5"
    },
    {
      "end": 46510,
      "speaker": "Moritz Stefaner",
      "start": 43362,
      "text": "And now I'm so bored, I'm even happy working.",
      "id": "ep_46_ut_6"
    },
    {
      "end": 48386,
      "speaker": "Enrico Bertini",
      "start": 47130,
      "text": "Really? Come on.",
      "id": "ep_46_ut_7"
    },
    {
      "end": 52682,
      "speaker": "Moritz Stefaner",
      "start": 48418,
      "text": "It's like I had to do something again. So I'm doing well.",
      "id": "ep_46_ut_8"
    },
    {
      "end": 53338,
      "speaker": "Robert Kosara",
      "start": 52746,
      "text": "Yeah.",
      "id": "ep_46_ut_9"
    },
    {
      "end": 54418,
      "speaker": "Moritz Stefaner",
      "start": 53474,
      "text": "How are you?",
      "id": "ep_46_ut_10"
    },
    {
      "end": 80846,
      "speaker": "Enrico Bertini",
      "start": 54594,
      "text": "Great. Well, lots of work to do just after the holidays, but. Great. I feel well rested, lots of food, lots of. Not lots. A little bit of sleep and as much as I could and. Yeah, great. So the perfect episode for the new year is the year in review, and we have Andy Kirk. Classic. And Robert Kosara. Another classic. Hi, guys. How are you?",
      "id": "ep_46_ut_11"
    },
    {
      "end": 82650,
      "speaker": "Robert Kosara",
      "start": 80998,
      "text": "Good evening. Good to be here.",
      "id": "ep_46_ut_12"
    },
    {
      "end": 86232,
      "speaker": "Enrico Bertini",
      "start": 83310,
      "text": "Yeah. We couldn't resist inviting you again.",
      "id": "ep_46_ut_13"
    },
    {
      "end": 90620,
      "speaker": "Moritz Stefaner",
      "start": 86376,
      "text": "We had to invite both of you, otherwise the fight would start again. Like I won.",
      "id": "ep_46_ut_14"
    },
    {
      "end": 98260,
      "speaker": "Enrico Bertini",
      "start": 93720,
      "text": "So maybe we can have a little bit of a virtual fight online.",
      "id": "ep_46_ut_15"
    },
    {
      "end": 105736,
      "speaker": "Robert Kosara",
      "start": 99040,
      "text": "Well, just to point out that Robert only appeared in one third of the Viz review episode, so. Yeah.",
      "id": "ep_46_ut_16"
    },
    {
      "end": 106896,
      "speaker": "Enrico Bertini",
      "start": 105888,
      "text": "Oh, that's true.",
      "id": "ep_46_ut_17"
    },
    {
      "end": 108320,
      "speaker": "Moritz Stefaner",
      "start": 106968,
      "text": "Does that obviously count?",
      "id": "ep_46_ut_18"
    },
    {
      "end": 110180,
      "speaker": "Robert Kosara",
      "start": 108480,
      "text": "We're not counting. We're not counting.",
      "id": "ep_46_ut_19"
    },
    {
      "end": 119080,
      "speaker": "Andy Kirk",
      "start": 110560,
      "text": "But I was there for the meetup. At least. I think that counts for like, three or four. I was actually physically present.",
      "id": "ep_46_ut_20"
    },
    {
      "end": 122804,
      "speaker": "Enrico Bertini",
      "start": 119700,
      "text": "Oh, that's true. Andy, you've never been physically present.",
      "id": "ep_46_ut_21"
    },
    {
      "end": 127240,
      "speaker": "Robert Kosara",
      "start": 122852,
      "text": "Sure. Yeah. He wins again. Again.",
      "id": "ep_46_ut_22"
    },
    {
      "end": 135156,
      "speaker": "Enrico Bertini",
      "start": 128860,
      "text": "So I don't even know if we need to introduce these two guys. You guys have been here so many times.",
      "id": "ep_46_ut_23"
    },
    {
      "end": 136628,
      "speaker": "Moritz Stefaner",
      "start": 135268,
      "text": "More often than us. Almost.",
      "id": "ep_46_ut_24"
    },
    {
      "end": 159098,
      "speaker": "Enrico Bertini",
      "start": 136764,
      "text": "Yeah, almost, yeah. So we don't do that. So we have a long list of things we want to talk about, and I think we want to start from big trends and teams for the past year. So what happened? What are the big things happened? Who wants to start? Andy, allow me to start.",
      "id": "ep_46_ut_25"
    },
    {
      "end": 247100,
      "speaker": "Robert Kosara",
      "start": 159154,
      "text": "Yeah. Well, I think the first general point would be that 2014 was kind of a hard year to get hold of, to get a real sense of what was the big changes, the big improvements, maybe some of the. Some of the negative things. But in a sense, I think that reflects a field that is stabilizing, that is continuing to build on the progress of previous years. So I think it is quite a challenge to pull out highlights and headlines, but I think, in a sense, that's not necessarily a bad thing. I think it's been a year where we've just seen the great people doing more great stuff, new people coming along in the slipstream of the great designers from years gone by. So I think it's been a good year. I don't think it's been a revolutionary year, but I think we probably needed evolution more so than revolution. So I think it's been a good year. A lot of good work. And as you know, I do the kind of monthly collection of some of the best work that's taken place in the previous month. And that's a continually growing list and a continually growing challenge to edit it down to something reasonably sized. So that is a little single indicator suggests to me that we're still progressing. More people participating.",
      "id": "ep_46_ut_26"
    },
    {
      "end": 265836,
      "speaker": "Moritz Stefaner",
      "start": 247960,
      "text": "Yeah, I mean, the party's becoming bigger and bigger. I feel the same way. And I think that hits the nail on the head in a sense that it's not so easy to talk about the five big things anymore, you know, because everybody's doing visualization, there's so much going on, everybody's making progress.",
      "id": "ep_46_ut_27"
    },
    {
      "end": 285750,
      "speaker": "Robert Kosara",
      "start": 266028,
      "text": "Some of the very best works that you will have seen four or five years ago would have probably, in a sense, stood alone or stood alongside two or three others. But now you're talking about 2030, 40 real kind of marquee projects per year, which I think is a reflection of healthy field, really.",
      "id": "ep_46_ut_28"
    },
    {
      "end": 340610,
      "speaker": "Andy Kirk",
      "start": 286050,
      "text": "Yeah, I think that's. I'm actually much more positive than you guys are. I think maybe it wasn't a revolutionary year, perhaps, but not every year can be. I think that there are a lot of things that are really interesting that happened this last year, and we are looking at a long list here of things we wrote up and mostly Andy actually wrote up. And Andy has these summaries of the months and every six months that have long lists of interesting projects there. So I think that a lot of things happened that were quite, quite interesting this last year, and there's a lot of stuff to talk about. Maybe nothing that was a big standout, but lots of good developments. And in particular, I think the academic side actually did really well this last year. We had a really good conference that had a lot of new, interesting work and felt like a lot of new things were happening and really good work being done.",
      "id": "ep_46_ut_29"
    },
    {
      "end": 351660,
      "speaker": "Enrico Bertini",
      "start": 341880,
      "text": "Yeah, academia is rocking the show. I like that. Robert, you're on the wrong side now.",
      "id": "ep_46_ut_30"
    },
    {
      "end": 358180,
      "speaker": "Moritz Stefaner",
      "start": 354920,
      "text": "Obviously losing enterprise side. I mean.",
      "id": "ep_46_ut_31"
    },
    {
      "end": 361728,
      "speaker": "Enrico Bertini",
      "start": 359120,
      "text": "I mean, that's not true because Robert is doing research.",
      "id": "ep_46_ut_32"
    },
    {
      "end": 362460,
      "speaker": "Andy Kirk",
      "start": 361824,
      "text": "Right.",
      "id": "ep_46_ut_33"
    },
    {
      "end": 479340,
      "speaker": "Robert Kosara",
      "start": 366040,
      "text": "One thing that is, I think it was today, but Stephen Few published a short post on his site saying that essentially 2014 was a bit of a nothing year from his perspective. Lack of growth, development and improvement in practices. But the difficulty is, and it's something that we've always faced, we're not present in front of all the people out there doing visualization work. In a sense I guess the analogy would be we're almost tv chefs sharing good practice with others who are blogging and writing about the field, sharing the work that we're doing. In a sense we're trying to evangelize good practice. But the people who are hopefully consuming and following and taking on board this kind of advice are distant and detached from us. We can't see we're not physically there to kind of witness the improvement people, especially those people who are doing this work within the corporate walls and the work that is purely internal focused and you know, we never get to see it. So it's very difficult to say that things haven't grown when we're so far away from the people where growth would actually exist. But from a personal point of view, certainly the kind of client list I've had in the last twelve months reflects to me at least a growing awareness, continue growing awareness of visualization as a thing and why visualization is important to them. So I think that bottom layer of the pyramid in terms of a healthy kind of ecosystem, just the simple awareness level, is continuing to grow. The top parts of that pyramid, well, we're a little bit hidden from it really. So we have to take that bottom lay as a single proxy of growth.",
      "id": "ep_46_ut_34"
    },
    {
      "end": 528660,
      "speaker": "Enrico Bertini",
      "start": 480320,
      "text": "No, but I agree that there's nothing really really big that happened, has happened last year. But at the same time I don't have this negative stance that you can find if you read this piece from Stephen Few. And I think it's actually, I personally believe that it's actually good. I believe that we are probably in a new stage of visualization and then if nothing really really new or special is happening, it's not necessarily bad. It might actually mean that the, the old community and practice is growing. And actually I wanted to mention it. I think I might be wrong, but I haven't seen as much as in the past a lot of criticism of bad visualizations out there. And this might actually be a sign of the fact that things are going well, right?",
      "id": "ep_46_ut_35"
    },
    {
      "end": 529280,
      "speaker": "Moritz Stefaner",
      "start": 528700,
      "text": "Yeah.",
      "id": "ep_46_ut_36"
    },
    {
      "end": 536280,
      "speaker": "Enrico Bertini",
      "start": 533820,
      "text": "Maybe it's my wrong expression. I don't know.",
      "id": "ep_46_ut_37"
    },
    {
      "end": 552380,
      "speaker": "Andy Kirk",
      "start": 537260,
      "text": "I think the WTF viz Tumblr only started this last year. That or is it already has been around for more than that. So I think there's certainly still a lot of work that needs to be criticized.",
      "id": "ep_46_ut_38"
    },
    {
      "end": 557576,
      "speaker": "Enrico Bertini",
      "start": 552960,
      "text": "Maybe we're all right. I mean, but I think the average.",
      "id": "ep_46_ut_39"
    },
    {
      "end": 558992,
      "speaker": "Moritz Stefaner",
      "start": 557648,
      "text": "Graphic has much improved, right?",
      "id": "ep_46_ut_40"
    },
    {
      "end": 560968,
      "speaker": "Andy Kirk",
      "start": 559016,
      "text": "Oh yeah. No, I agree with that. Yeah.",
      "id": "ep_46_ut_41"
    },
    {
      "end": 561856,
      "speaker": "Enrico Bertini",
      "start": 561144,
      "text": "Yeah.",
      "id": "ep_46_ut_42"
    },
    {
      "end": 581730,
      "speaker": "Moritz Stefaner",
      "start": 562008,
      "text": "I mean another trend that has been continued, I think, is this whole like the data journalism and talking to journalists and journalists learning more about data and this whole dialogue with the journalistic scene. I think that's, that's big. Yeah, that's, yeah, that has become even bigger I think, this year and I'm really super happy that it's happening.",
      "id": "ep_46_ut_43"
    },
    {
      "end": 726800,
      "speaker": "Robert Kosara",
      "start": 581890,
      "text": "Yeah, I mean we've seen the emergence of the new data, Jillian. Sites such as Vox 538, Marshall projects. I'm sure there's many more as well. I mean these are, you know, this is all just pretty much blown up in the last twelve months, I guess in many respects. Most things in that sense would lead back to being for people like Nate Silver. But I think what you could question across some of those sites is the quality of the visualization work being undertaken. But I think it's very perhaps unfair to judge them on that level yet because it takes a long time I guess, for any organization to establish its, you know, its palettes, its templates, its approaches to different stories that in certainly, you know, if we focus on the work being done by the upshot, I think they've done some extraordinary work this year with, you know, Amanda very much involved in that and people like Gregor and Kevin Quill. There's been some amazing stuff there. So they've continued in a different capacity. The great work of the New York Times. I think for the others, the likes of Vox and 538, there's a little bit of a way to go. But just the presence of those sites is only a good thing. And as we've seen elsewhere, the likes of the Washington Post have gone from strength to strength. They've got an amazing crew under the leadership of cat Downs Mulder there. And you know, I think they have to be spoken in exactly the same terms as the New York Times these days. And beyond the classic two, I think we've seen the emergence of did sight in Germany and certainly some increasing visibility of work from the LA Times in the UK, the Financial Times with John Burns Murdoch have certainly increased their visible output. And also Reuters under the kind of stewardship of Simon Scar, formerly of the South China Morning Post. They've certainly, we've started to see his influence on their work there. So I think the data journalism world is very much still the leading front of database, really.",
      "id": "ep_46_ut_44"
    },
    {
      "end": 806678,
      "speaker": "Andy Kirk",
      "start": 727700,
      "text": "Absolutely. I agree. And also there are a number of things here that are interesting. First of all is of course that the upshot being part of the New York Times, they're able to do a lot more work and have a lot more people to work on things than some of the others that are much smaller and also have to produce much more output. And so they just don't have as much time to build very intricate, very interactive pieces. But also, I think there's a lot more focus now on the graphical side and on the data side. So I've been collecting these links to these year end roundups of what each of the graphics departments have done, and they've really started doing that now and to show off what they were doing and also to give you a way to browse through and see all the things that are out there. So it's really interesting that when you look at those, that there's just a huge amount of stuff that Bloomberg is doing, that the Washington Post certainly is doing, the New York Times and others, and that are really, really interesting, really well thought out, very elaborate, interactive pieces, not just a few charts here and there. And they also come up with new ideas and try out new things that are really interesting to watch. So I totally agree that there's a lot of the cutting edge really is happening in data journalism still.",
      "id": "ep_46_ut_45"
    },
    {
      "end": 807198,
      "speaker": "Enrico Bertini",
      "start": 806814,
      "text": "Yeah.",
      "id": "ep_46_ut_46"
    },
    {
      "end": 838200,
      "speaker": "Moritz Stefaner",
      "start": 807254,
      "text": "And it's really, it's proving its worth, because if you look at the list of the top ten most visited pages or features at these big media houses, it's on the top places, often interactive apps or interactive visualizations. So these actually drive the traffic. So I remember last year there was this map of, from the New York Times actually done by an intern about these local dialects across the US, how would you say?",
      "id": "ep_46_ut_47"
    },
    {
      "end": 841406,
      "speaker": "Andy Kirk",
      "start": 839070,
      "text": "Right. Different terms that are being used.",
      "id": "ep_46_ut_48"
    },
    {
      "end": 841894,
      "speaker": "Robert Kosara",
      "start": 841478,
      "text": "That's right.",
      "id": "ep_46_ut_49"
    },
    {
      "end": 842726,
      "speaker": "Andy Kirk",
      "start": 841942,
      "text": "Exactly.",
      "id": "ep_46_ut_50"
    },
    {
      "end": 861654,
      "speaker": "Moritz Stefaner",
      "start": 842918,
      "text": "And that was a very playful app everybody could relate to. And it actually generated the most traffic over the whole year. And I think this year it has been for the big house, is very similar. So these pieces actually, you know, it's not just a gimmick or additional luxury, it's actually what drives traffic to these sites these days, which I find really interesting.",
      "id": "ep_46_ut_51"
    },
    {
      "end": 943600,
      "speaker": "Robert Kosara",
      "start": 861702,
      "text": "Absolutely. And I mean, just two of the favorite designs from the last year, from my perspective, came from the upshot. One of them was the economy in 255 charts, which was just this. The audacity of 255 line charts on a scatterplot was just outstanding. So much depth to it. But also I think what you see across a lot of these works now is this pure integration between interactivity, but also this kind of managed tabular reveal of a editorial perspective. You know, five different views of this multitudinous chart that we think are interesting. So they are creating the interactive depth, but they're also managing the message about the things that they think are of most interest. And then the second one that came from that organization was the most detailed maps you've had ever seen from the midterm elections, which was just really beautiful, elegant detail maps produced, published on the night of the election. So obviously, there would have been plenty of work in advance, but just the quality and the elegance of this kind of output, it's the real high mark of this field. Really.",
      "id": "ep_46_ut_52"
    },
    {
      "end": 959734,
      "speaker": "Moritz Stefaner",
      "start": 947350,
      "text": "Yeah. That's been two really, really great pieces. And I specifically remember the reshaped economy in 255 charts. This was one of the visualizations where I was just like, what's going on? This is crazy.",
      "id": "ep_46_ut_53"
    },
    {
      "end": 966526,
      "speaker": "Enrico Bertini",
      "start": 959782,
      "text": "Can you guys describe what it is just in case somebody listening doesn't, haven't seen it? Yeah, I know it's hard to describe.",
      "id": "ep_46_ut_54"
    },
    {
      "end": 982838,
      "speaker": "Robert Kosara",
      "start": 966558,
      "text": "But, yeah, if you can imagine launching 255 worms from zero to zero of varying color and then just watching out as they scatter across this landscape, it simply was.",
      "id": "ep_46_ut_55"
    },
    {
      "end": 985250,
      "speaker": "Moritz Stefaner",
      "start": 982934,
      "text": "It's like explosion in the noodle factory.",
      "id": "ep_46_ut_56"
    },
    {
      "end": 1007560,
      "speaker": "Robert Kosara",
      "start": 986470,
      "text": "Yeah, it was literally 255 line charts with the zero, zero point mapping onto a scatterplot position. And then you could hover over the lines and you could see a pop up, kind of airy chart with further details. So it was just a, you know, a really amazing concept and pulled off very effectively.",
      "id": "ep_46_ut_57"
    },
    {
      "end": 1012180,
      "speaker": "Enrico Bertini",
      "start": 1011780,
      "text": "Yeah.",
      "id": "ep_46_ut_58"
    },
    {
      "end": 1013748,
      "speaker": "Moritz Stefaner",
      "start": 1012220,
      "text": "And it used scroll telling.",
      "id": "ep_46_ut_59"
    },
    {
      "end": 1019760,
      "speaker": "Robert Kosara",
      "start": 1013804,
      "text": "Scroll telling. So that was incredible as a scroll down, wasn't it?",
      "id": "ep_46_ut_60"
    },
    {
      "end": 1023084,
      "speaker": "Enrico Bertini",
      "start": 1021180,
      "text": "Is that a new thing? Yeah, I guess it's new.",
      "id": "ep_46_ut_61"
    },
    {
      "end": 1031038,
      "speaker": "Moritz Stefaner",
      "start": 1023132,
      "text": "Yeah. There was like, I mean, snowfall, is it one year ago or two years? But it's, you know, it's. We are still in the middle of this Crowley telling thing.",
      "id": "ep_46_ut_62"
    },
    {
      "end": 1033542,
      "speaker": "Robert Kosara",
      "start": 1031174,
      "text": "I think it's. I think it might be two years.",
      "id": "ep_46_ut_63"
    },
    {
      "end": 1036630,
      "speaker": "Andy Kirk",
      "start": 1033566,
      "text": "Yeah, I think, yeah, it should be two years now. I think.",
      "id": "ep_46_ut_64"
    },
    {
      "end": 1071070,
      "speaker": "Robert Kosara",
      "start": 1036750,
      "text": "I mean, there has been some backlash over the last films towards those long form journeys and pieces, but I still think the, the majority are of good quality and do warrant that kind of format. And I think it's up to the reader whether they've got the commitment or the interest in the subject matter to engage with it. But, yeah, there's been some splendid work. I mean, one of the other projects that I really enjoyed this year, which was, it was perhaps a slightly different long form structure which was losing ground by ProPublica, which was a.",
      "id": "ep_46_ut_65"
    },
    {
      "end": 1078426,
      "speaker": "Moritz Stefaner",
      "start": 1071730,
      "text": "What's the criticism like when these long form pieces are criticized? Is it just like they're blowing something small up to be very long?",
      "id": "ep_46_ut_66"
    },
    {
      "end": 1095292,
      "speaker": "Robert Kosara",
      "start": 1078498,
      "text": "I think that's one part of it, yeah. In a sense. I guess the lazy accusation is that people are just copying the New York times or from snowfall and trying to emulate the success just by copying the format. But I don't think that's necessarily fair.",
      "id": "ep_46_ut_67"
    },
    {
      "end": 1100964,
      "speaker": "Moritz Stefaner",
      "start": 1095436,
      "text": "That never works, whatever you do. It's like if you just copy the surface but have no substance.",
      "id": "ep_46_ut_68"
    },
    {
      "end": 1157562,
      "speaker": "Andy Kirk",
      "start": 1101012,
      "text": "I mean, but there were some examples very early on, right after snowfall, within maybe a few months, that were really not very well done, that had a lot of moving things and a lot of different elements, but the actual content wasn't really the right fit for that kind of work. So you need something, you need a big story, a complex story for this kind of thing, especially when it's such a big production, when you mix video and images and animations and stuff like that. But I think the format of scrolling and things happening and falling into place, that can also, of course, be very distracting and annoying when, like, I remember seeing one where all the images would just kind of pop up, so you would scroll and that would be an empty space and the images would kind of pop into existence. And so it was really distracting as you were reading, things are popping and moving and you have to do it.",
      "id": "ep_46_ut_69"
    },
    {
      "end": 1159282,
      "speaker": "Moritz Stefaner",
      "start": 1157586,
      "text": "Really well from the usability point of view.",
      "id": "ep_46_ut_70"
    },
    {
      "end": 1185050,
      "speaker": "Andy Kirk",
      "start": 1159306,
      "text": "Right, exactly. Because it's so easy to overdo all these effects. So I think that's a lot of the criticism, is that it's just too heavy handed and too much flashiness and not enough substance necessarily. But I think that some of the good ones, ones that have been done recently, have kind of figured out people who were doing them have figured out where to find a balance between making something that's attractive but not so over the top.",
      "id": "ep_46_ut_71"
    },
    {
      "end": 1187090,
      "speaker": "Robert Kosara",
      "start": 1186310,
      "text": "Wait.",
      "id": "ep_46_ut_72"
    },
    {
      "end": 1213000,
      "speaker": "Moritz Stefaner",
      "start": 1187470,
      "text": "I mean, for me, anything that sort of gives journalism a chance online for me, is great because we need it. And I think the fact alone that long form has a future has been a big. A big insight and also a big relief that we don't have to do only three point list to survive, but you can actually write something that takes ten minutes to consume.",
      "id": "ep_46_ut_73"
    },
    {
      "end": 1262780,
      "speaker": "Robert Kosara",
      "start": 1213120,
      "text": "I think the other point about this is I was chatting to Paul Blitley, did site about a month before the 25th anniversary of the German reunification, and he was expressing this idea that there is pressure. When there is a potentially popular story that a number of organizations will cover, there is a pressure to be different and to do something that will stand out from the crowd. And so, in a sense, it is a risk for an organisation to commit to a big, long form project. So those that do see that through, I think, should be commended for having that vision to go ahead and do that thing, rather a very quick novelty thing that might be consumed in in a minute and people move on. So there is a certain courage, I think, behind this.",
      "id": "ep_46_ut_74"
    },
    {
      "end": 1265100,
      "speaker": "Enrico Bertini",
      "start": 1263960,
      "text": "Yeah, yeah.",
      "id": "ep_46_ut_75"
    },
    {
      "end": 1297410,
      "speaker": "Moritz Stefaner",
      "start": 1267240,
      "text": "Yeah. And it's not for everybody, you know, so I can maybe in the future see also. Yeah, sure. Detide and New York Times and so on that they have this time and the manpower to embark on these a, you need an original investigation, like, you know, really investigative journalism and the story behind it, and b, then also back that up with the fitting multimedia, you know, that's obviously not something every newsroom. Right. So. And all these things will, of course, be much more clearly, I guess, in the future.",
      "id": "ep_46_ut_76"
    },
    {
      "end": 1308514,
      "speaker": "Enrico Bertini",
      "start": 1297530,
      "text": "Yeah. And at the same time, I think this is a good sign because it means that people are ready to consume this kind of information, otherwise they wouldn't do it. Right. Yeah. So I think that's a very good.",
      "id": "ep_46_ut_77"
    },
    {
      "end": 1335714,
      "speaker": "Moritz Stefaner",
      "start": 1308522,
      "text": "Sign of text and commentary and sort of trying to build a longer argument that you illustrate with a couple of facts and charts. This is something where I'm now much looking forward, that it trickles through maybe also to the business side or, you know, or like the organizations, for instance, I work with, you know, that because it's a really nice format to get complex information across, but in a nicely structured and guided way. And I mean, in the end, this is what we are all after, right?",
      "id": "ep_46_ut_78"
    },
    {
      "end": 1336146,
      "speaker": "Robert Kosara",
      "start": 1335762,
      "text": "Absolutely.",
      "id": "ep_46_ut_79"
    },
    {
      "end": 1336482,
      "speaker": "Moritz Stefaner",
      "start": 1336178,
      "text": "Yeah.",
      "id": "ep_46_ut_80"
    },
    {
      "end": 1338402,
      "speaker": "Robert Kosara",
      "start": 1336546,
      "text": "And I think we've been.",
      "id": "ep_46_ut_81"
    },
    {
      "end": 1339194,
      "speaker": "Enrico Bertini",
      "start": 1338506,
      "text": "Yeah.",
      "id": "ep_46_ut_82"
    },
    {
      "end": 1404940,
      "speaker": "Robert Kosara",
      "start": 1339362,
      "text": "Along the same sort of theme. And not to embarrass you, Moritz, but I think there's a lot of merit, I doubt. Let's try by Moritz and others. I won't list all the people involved, but what I really loved about this project, Moritz, was this same kind of intersection between something that you're equipping people with the means to interrogate and to explore themselves, but you're also managing the things that you want to show people and to present people. So whilst, in a sense, sense, that was a. It's a different type of long form results page. What I love was it wasn't just, here's an interface over to you folks to find something interesting. It was. This is what we found. Also explore yourself. But these are the things that we thought were most salient. So that kind of trend, I think, can only be positive where we're not just saying that there's this pure separation between we either just explain or we just explore that we can find a way to incorporate both, which really suits in theory, all audience types.",
      "id": "ep_46_ut_83"
    },
    {
      "end": 1414944,
      "speaker": "Enrico Bertini",
      "start": 1407240,
      "text": "So can we say then that a big trend this year is going in depth? In general, I think things are much more curated than in the past.",
      "id": "ep_46_ut_84"
    },
    {
      "end": 1443550,
      "speaker": "Moritz Stefaner",
      "start": 1414992,
      "text": "Maybe. But also, remember Vox in 538? They were criticized a lot for being a bit too much on the quick side. I don't know, but there's at least a big. Yeah, a big chunk of works in this area that go much deeper and go the extra mile in producing another graphic and summary. And there an exploratory part. Yeah, probably. I would agree.",
      "id": "ep_46_ut_85"
    },
    {
      "end": 1454746,
      "speaker": "Enrico Bertini",
      "start": 1444690,
      "text": "So what else happened? Other big trends, ideas? I think Robert at the beginning mentioned the academic side of things.",
      "id": "ep_46_ut_86"
    },
    {
      "end": 1455322,
      "speaker": "Andy Kirk",
      "start": 1454898,
      "text": "Yes.",
      "id": "ep_46_ut_87"
    },
    {
      "end": 1459050,
      "speaker": "Enrico Bertini",
      "start": 1455386,
      "text": "Which of course I like. Maybe you want to elaborate on that, Robert.",
      "id": "ep_46_ut_88"
    },
    {
      "end": 1532430,
      "speaker": "Andy Kirk",
      "start": 1459090,
      "text": "Sure. Yeah. So the visconference this last year in Paris, first of all, it was in Paris, which was a new thing. This is the first time they did it in Europe, and that really worked out really well. They had a very successful, very well run, very well attended conference. So that was really good. And I felt that the quality of the talks was really good, and I'm talking mostly here about the infovis part of it. So the viz conference consists of infovis information visualization, which is infovis, the VAST conference, and SCIVIS, and SYWis scientific visualization. And I mostly went to the infovis sessions, but those were overall really, really good. There were some really excellent papers. I felt that the presentation quality was much better than in the years past. People in many cases had a URL at the end of their presentation that is essentially a landing page where they had materials from their paper and maybe the PDF and other things like that. Also, I think that Moritz and Dominicus, they did this tutorial on the.",
      "id": "ep_46_ut_89"
    },
    {
      "end": 1534510,
      "speaker": "Robert Kosara",
      "start": 1533090,
      "text": "Everything but the charts.",
      "id": "ep_46_ut_90"
    },
    {
      "end": 1539738,
      "speaker": "Andy Kirk",
      "start": 1536250,
      "text": "Okay. Hello.",
      "id": "ep_46_ut_91"
    },
    {
      "end": 1542178,
      "speaker": "Moritz Stefaner",
      "start": 1539874,
      "text": "Yeah. Yes, you can go on.",
      "id": "ep_46_ut_92"
    },
    {
      "end": 1599716,
      "speaker": "Andy Kirk",
      "start": 1542314,
      "text": "Okay. So Moritz and Dominicus, they had this tutorial on everything but the charts that is in the, in basically talking about something that's very unusual at this, which is talk about all the stuff around it. How do you make your visualization shareable? How do you make it work on the web and so on? And it was really interesting that a lot of, some of the things that they talked about people are already starting to do. So this was very timely. So people did not really have necessarily a press kit, but they did have their landing pages, they did have images on there. They did have materials for people to use, maybe a link to their GitHub repository with the code and so on. So it was really good to have all of that available and just feel that there's more stuff going on and people are more interested and careful about making the stuff they do available and usable to people. So I think that was a really good thing to.",
      "id": "ep_46_ut_93"
    },
    {
      "end": 1623930,
      "speaker": "Moritz Stefaner",
      "start": 1599748,
      "text": "Yeah, and there were lots of GitHub links, like, here's our code. There was a paper, even with a Twitter account where you could tweet at the paper. And Jeff here, he embedded the data of his paper into the PDF. So whenever you would download the PDF, you could also download the data would come bundled with it. So lots of smart thoughts around how to make research more accessible and more actually get it out there.",
      "id": "ep_46_ut_94"
    },
    {
      "end": 1657480,
      "speaker": "Andy Kirk",
      "start": 1628230,
      "text": "So I think that was a really good thing to see. And also just generally, it felt like there was a lot of stuff happening this last year in the academic world, and this is going to take a bit longer, of course, to actually make its way into tools and into people's actual practical work. But I think it's important that it happens. And if this trend continues, I think we're going to seal up more of that kind of quality of work, which is good to see. I'm very happy about that and very positive about what's going on there.",
      "id": "ep_46_ut_95"
    },
    {
      "end": 1686570,
      "speaker": "Moritz Stefaner",
      "start": 1658590,
      "text": "Yeah, I had the same impression. So I was the first time, as you know, at this. But I also felt very, as you said, the presentations were great and a lot of, like, inspiration taken also from external fields. Everybody uses D3 and, you know, the people are really interested in putting things on the web and so. Yeah. So maybe that's another big positive trend that's finally academia and the rest of the world to get closer to each other.",
      "id": "ep_46_ut_96"
    },
    {
      "end": 1726848,
      "speaker": "Enrico Bertini",
      "start": 1686980,
      "text": "Yeah. And I think from my side, I think that's another interesting trend that I see happening, maybe probably thanks to organizing this in Paris, I've seen a lot of people are more on the practitioner side of things, chatting and doing things together with academics, and this is great. And one thing that you might actually have noticed is that academics, people love what you guys are doing in practice in the real world. So that's. That's amazing. I love it. And at the same time, I think it's very important for practitioners to be aware of the fact that there are some works out there that can be really, really, really useful in practice. So I think that's great.",
      "id": "ep_46_ut_97"
    },
    {
      "end": 1734376,
      "speaker": "Andy Kirk",
      "start": 1726984,
      "text": "Yeah, it was fun because I was actually kind of surprised and shocked that there were so many people at that tutorial that Moritz was doing.",
      "id": "ep_46_ut_98"
    },
    {
      "end": 1735792,
      "speaker": "Enrico Bertini",
      "start": 1734448,
      "text": "Yeah, exactly. Yeah.",
      "id": "ep_46_ut_99"
    },
    {
      "end": 1742328,
      "speaker": "Andy Kirk",
      "start": 1735936,
      "text": "I think people were like, what are you talking about? What is this? But they're very, very curious about this. That's pretty interesting.",
      "id": "ep_46_ut_100"
    },
    {
      "end": 1752052,
      "speaker": "Enrico Bertini",
      "start": 1742424,
      "text": "I had a few people coming to me and say, oh, can you introduce me to Mauritsh? Right. So that, that's. Yeah, I mean, it's great. Seriously?",
      "id": "ep_46_ut_101"
    },
    {
      "end": 1752796,
      "speaker": "Andy Kirk",
      "start": 1752156,
      "text": "Yeah.",
      "id": "ep_46_ut_102"
    },
    {
      "end": 1759164,
      "speaker": "Enrico Bertini",
      "start": 1752948,
      "text": "And it's happening. I think it's happening. So that's great. So we have Tamara Manson are here on the show.",
      "id": "ep_46_ut_103"
    },
    {
      "end": 1761280,
      "speaker": "Moritz Stefaner",
      "start": 1759292,
      "text": "Yeah, a couple of shows.",
      "id": "ep_46_ut_104"
    },
    {
      "end": 1771388,
      "speaker": "Enrico Bertini",
      "start": 1761620,
      "text": "And now she's on Twitter and she wants to tweet and be part of the community. And I've seen her tweeting with a lot of people who normally don't come to academic conferences.",
      "id": "ep_46_ut_105"
    },
    {
      "end": 1782608,
      "speaker": "Moritz Stefaner",
      "start": 1771524,
      "text": "Her book is really good, by the way. By now I read it. It's really good and super helpful for me from the user task side, like to think in a structured way about what people might want to draw out of a visualization.",
      "id": "ep_46_ut_106"
    },
    {
      "end": 1786900,
      "speaker": "Robert Kosara",
      "start": 1782744,
      "text": "Yeah, my copy arrived just this very morning, so looking forward to read that.",
      "id": "ep_46_ut_107"
    },
    {
      "end": 1800380,
      "speaker": "Moritz Stefaner",
      "start": 1787720,
      "text": "No, it's really good. And the figures are, you can use the figures in your presentations and that'll be good. So that's another really nice thing. Yeah. Like visual variables and chart types and things like that. It's all there.",
      "id": "ep_46_ut_108"
    },
    {
      "end": 1804820,
      "speaker": "Enrico Bertini",
      "start": 1801400,
      "text": "So should we talk about books in general? What happened last year?",
      "id": "ep_46_ut_109"
    },
    {
      "end": 1853820,
      "speaker": "Robert Kosara",
      "start": 1805390,
      "text": "Well, I think Tamara's stands out, really, in terms of the gaps that I feel exist in the book space about, you know, about process, about kind of critical thinking. Aside from that book, though, the other one that I really enjoyed reading was raw data. Infographic designer sketchbook. I'm not sure if it's got the same name in the States, but it's a really beautiful kind of book. A different case studies, but the production quality is absolutely outstanding. And there's some really, really good insights in there. Different tips from people in all sorts of different projects and data sets. And that's something I've really spent a lot of time looking through this last few weeks. So that's one of my favorites this year.",
      "id": "ep_46_ut_110"
    },
    {
      "end": 1866428,
      "speaker": "Moritz Stefaner",
      "start": 1856360,
      "text": "Understanding the world is really nice. It's from Sandra Rendgen again, who did this first really big infographics. Remember this huge book with subway rap?",
      "id": "ep_46_ut_111"
    },
    {
      "end": 1870040,
      "speaker": "Robert Kosara",
      "start": 1866444,
      "text": "I've got a shelf for that book. Yeah, exactly.",
      "id": "ep_46_ut_112"
    },
    {
      "end": 1888948,
      "speaker": "Moritz Stefaner",
      "start": 1871740,
      "text": "And understanding the world is the same format. And again, like, lots of really well selected nice graphics. So that was a highlight for me, too. And it's all about like world statistics or. Yeah, something about the world. I mean, so you need to make a big book.",
      "id": "ep_46_ut_113"
    },
    {
      "end": 1890530,
      "speaker": "Andy Kirk",
      "start": 1889004,
      "text": "Yeah, yeah.",
      "id": "ep_46_ut_114"
    },
    {
      "end": 1893170,
      "speaker": "Moritz Stefaner",
      "start": 1890910,
      "text": "Any, any other great, great books.",
      "id": "ep_46_ut_115"
    },
    {
      "end": 1901766,
      "speaker": "Enrico Bertini",
      "start": 1894910,
      "text": "Was the book of trees published last year? Yeah, I think so. Yeah. Yeah, we had manual here on the show, I guess.",
      "id": "ep_46_ut_116"
    },
    {
      "end": 1902766,
      "speaker": "Robert Kosara",
      "start": 1901798,
      "text": "Yeah. Yeah.",
      "id": "ep_46_ut_117"
    },
    {
      "end": 1904010,
      "speaker": "Moritz Stefaner",
      "start": 1902798,
      "text": "That was a great one, too.",
      "id": "ep_46_ut_118"
    },
    {
      "end": 1941230,
      "speaker": "Robert Kosara",
      "start": 1904710,
      "text": "There was a book that I think some of us contributed in terms of being a brand trust, which was the. The best American infographics of 2000. Now was it 14 or 13? I can't remember which year time for me actually relates to, but that's a really nice collection of work. And I think what's. What comes across in that book is how well they've reproduced the sense of interactive work as well, which I think is increasingly important, obviously, in a print media. But anyway, 2016 is the year for.",
      "id": "ep_46_ut_119"
    },
    {
      "end": 1942686,
      "speaker": "Andy Kirk",
      "start": 1941230,
      "text": "The books, so people are still reading books.",
      "id": "ep_46_ut_120"
    },
    {
      "end": 1945780,
      "speaker": "Robert Kosara",
      "start": 1942758,
      "text": "Myself and Alberta Publishing, sir.",
      "id": "ep_46_ut_121"
    },
    {
      "end": 1953540,
      "speaker": "Enrico Bertini",
      "start": 1950040,
      "text": "Wow. Alberto is publishing a new book, right?",
      "id": "ep_46_ut_122"
    },
    {
      "end": 1961208,
      "speaker": "Moritz Stefaner",
      "start": 1953880,
      "text": "Yeah. But I think his is more headed towards 2016. Honestly, he's too much on Twitter before.",
      "id": "ep_46_ut_123"
    },
    {
      "end": 1962940,
      "speaker": "Enrico Bertini",
      "start": 1961264,
      "text": "We can comment on that.",
      "id": "ep_46_ut_124"
    },
    {
      "end": 1966380,
      "speaker": "Moritz Stefaner",
      "start": 1963320,
      "text": "Yeah, yeah. What are you writing on, Andy?",
      "id": "ep_46_ut_125"
    },
    {
      "end": 1983600,
      "speaker": "Robert Kosara",
      "start": 1967040,
      "text": "I guess in a similar vein to Tamara, which is trying to break this down into kind of critical thinking to process. I mean, you know, I did the book two or three years ago, which was largely unsatisfactory in terms of output. Yeah.",
      "id": "ep_46_ut_126"
    },
    {
      "end": 1984932,
      "speaker": "Enrico Bertini",
      "start": 1983900,
      "text": "What really?",
      "id": "ep_46_ut_127"
    },
    {
      "end": 2017380,
      "speaker": "Robert Kosara",
      "start": 1985116,
      "text": "I've got a lot of unfinished business, unfinished content, but also a desire to publish in color, which would be nice. So, yeah, I'm working. I'm actually about three months behind, but I reckon that'll be the end of this this year. But hopefully that'll be something that's will be useful for beginners, really, just to see this as a workflow process rather than just as a glossy example of all sorts of nice projects. Looking forward to doing that. Actually, I'm quite enjoying the process.",
      "id": "ep_46_ut_128"
    },
    {
      "end": 2030568,
      "speaker": "Moritz Stefaner",
      "start": 2020480,
      "text": "Cool. Yeah. And if you have something really on critique and critical thinking around database, I think that hasn't happened that much. The biggest challenge, it will definitely fill.",
      "id": "ep_46_ut_129"
    },
    {
      "end": 2037058,
      "speaker": "Robert Kosara",
      "start": 2030584,
      "text": "Again, being able to use bad examples in a book to pick it up.",
      "id": "ep_46_ut_130"
    },
    {
      "end": 2043434,
      "speaker": "Moritz Stefaner",
      "start": 2037234,
      "text": "Yeah. So. But just to develop a position towards graphics and like.",
      "id": "ep_46_ut_131"
    },
    {
      "end": 2057272,
      "speaker": "Robert Kosara",
      "start": 2043482,
      "text": "Absolutely. But, yeah, I think it's. It's something that I still feel is that there is room for publishing. Why so looking forward to get out? I think it's nice.",
      "id": "ep_46_ut_132"
    },
    {
      "end": 2086126,
      "speaker": "Moritz Stefaner",
      "start": 2057466,
      "text": "Can we talk about blogging? I just realized now we talked about books, we talked about newspapers, but we haven't talked about blogging. And my feeling is it's been a bit slow last year. Like, either people sort of kept up the pace halfway or like, didn't post at all anymore. No more discussions on blogs. Everybody's just like, yelling at each other on Twitter. It's like, am I wrong here or is that a generally wrong?",
      "id": "ep_46_ut_133"
    },
    {
      "end": 2095770,
      "speaker": "Robert Kosara",
      "start": 2086278,
      "text": "I think there's. I mean, if you just take. Well, let's. Let's pick on Enrico. He's sat right here now. Enrico, how many posts do you publish last year?",
      "id": "ep_46_ut_134"
    },
    {
      "end": 2100438,
      "speaker": "Enrico Bertini",
      "start": 2098230,
      "text": "No. Twelve posts in one year.",
      "id": "ep_46_ut_135"
    },
    {
      "end": 2105886,
      "speaker": "Robert Kosara",
      "start": 2100454,
      "text": "I know Gregor posted on this morning and he said it's the first one for a year.",
      "id": "ep_46_ut_136"
    },
    {
      "end": 2111210,
      "speaker": "Moritz Stefaner",
      "start": 2106038,
      "text": "Yeah. Now everybody's trying to catch up quickly because they realized they haven't been blogging.",
      "id": "ep_46_ut_137"
    },
    {
      "end": 2161720,
      "speaker": "Robert Kosara",
      "start": 2111870,
      "text": "But I think you're right. I think there's been a little bit of a drying up of blog posts and possibly also new blog sites. I mean, certainly around the Tableau ecosystem there's been a lot of new bloggers, which I think is great to see the energy around that space. But I think this is played my third annual review on the, on this podcast and I think the first one we did, I think we had an appeal for saying to people that there's more space, there's more room for people to be blogging, to be doing critical analysis, in particular the work that Robert does on his site and Kaiser and people like Brian on the Y axis. There's still a lot of room for that kind of critical e construction. Really?",
      "id": "ep_46_ut_138"
    },
    {
      "end": 2257578,
      "speaker": "Andy Kirk",
      "start": 2164050,
      "text": "Oh yeah, absolutely. And I think it's maybe people are just all busy writing books now, but it's just that it really feels like that has slowed down. I mean, Kaiser is really active. He's been doing a lot. Nathan. Yeah, of course he's loving data, he posts a lot of stuff, but I'm not seeing a lot of others. And actually I just redid my theme from my website and I used to have this blog role and I just took it out because I clicked through the links and all the postings were like months and months old, if not over a year old. So I was like, why bother? Nobody's going to look at that and if they are, they're not going to get enough out. So it feels like there is a lot of people have started things but then kind of let them slowly kind of die or kind of fall into disuse or whatever. And it's too bad because there should be a lot more good stuff. Like the other day I was talking to somebody about glyphs in visualization and we look at the Wikipedia page for glyphs. It's really infuriating because it's just really bad and there's nothing else out there that's really good about it. That's one of the next things I'm going to rewriting on my blog, posting about glyphs so that there is one out. There's so much stuff that's really missing when you google things, you find, especially Wikipedia, is really bad with visualization stuff, visualization topics. A lot of people writing there have absolutely no clue. Which of course would mean I should go in and actually do something about that.",
      "id": "ep_46_ut_139"
    },
    {
      "end": 2263710,
      "speaker": "Moritz Stefaner",
      "start": 2257674,
      "text": "That's a really nice idea, by the way. We should all get together one evening like 10:20 p.m. do a little hackathon.",
      "id": "ep_46_ut_140"
    },
    {
      "end": 2289900,
      "speaker": "Andy Kirk",
      "start": 2264970,
      "text": "Yeah, that's a really good idea, actually. But also just have stuff out there. So when somebody googles for something, they find good information and current information, not stuff that's years and years old. So that's my concern. We're really not. Visualization still isn't present enough on the web. And there is some stuff that's happening. Like Andy just mentioned these Tableau blogs, which are really good. Actually. There's a very good stuff if you're looking for all kinds of trips.",
      "id": "ep_46_ut_141"
    },
    {
      "end": 2291992,
      "speaker": "Moritz Stefaner",
      "start": 2291600,
      "text": "Tips.",
      "id": "ep_46_ut_142"
    },
    {
      "end": 2327410,
      "speaker": "Andy Kirk",
      "start": 2292016,
      "text": "And tricks, show you things that you wouldn't think would even be possible, but the broader field still needs a lot more of that. I'm actually hoping to actually do it more this year and do a bit more linking to other things and stuff like that. But really push harder and hopefully other people will feel that they also now should be doing something about that. Even needed to write a rant about how bad the visualization blog space is. But it's getting old because it's always the same. It doesn't really change much.",
      "id": "ep_46_ut_143"
    },
    {
      "end": 2329398,
      "speaker": "Enrico Bertini",
      "start": 2328550,
      "text": "What do you think?",
      "id": "ep_46_ut_144"
    },
    {
      "end": 2339486,
      "speaker": "Moritz Stefaner",
      "start": 2329494,
      "text": "I want to mention one outlier has been visual loop, and their output has been amazing. They always make relentless, huge posts of like the best photographics from last week.",
      "id": "ep_46_ut_145"
    },
    {
      "end": 2340850,
      "speaker": "Robert Kosara",
      "start": 2339598,
      "text": "It's like, what?",
      "id": "ep_46_ut_146"
    },
    {
      "end": 2346982,
      "speaker": "Moritz Stefaner",
      "start": 2342510,
      "text": "And really nice interviews and lots of good stuff. So a lot of.",
      "id": "ep_46_ut_147"
    },
    {
      "end": 2348678,
      "speaker": "Robert Kosara",
      "start": 2347126,
      "text": "Yeah, it's a great guy's Tiago.",
      "id": "ep_46_ut_148"
    },
    {
      "end": 2361114,
      "speaker": "Moritz Stefaner",
      "start": 2348734,
      "text": "And now they've been acquired by infographics or who acquired them. Yeah, yeah. So that's also like something to achieve, like to be acquired as a blog. Congrats to visual.",
      "id": "ep_46_ut_149"
    },
    {
      "end": 2386138,
      "speaker": "Robert Kosara",
      "start": 2361282,
      "text": "The high point in terms of blogging. Sorry, Henriko, just very quickly, I think the high point of the year, blogging wise, was the, was the kind of sequence of posts that people put forward around April May time, around storytelling. And I think, Moritz, you triggered it with your trolling of tapestry conference. And then I think you put forward your worlds, not stories post. And then there was a sequence of responses.",
      "id": "ep_46_ut_150"
    },
    {
      "end": 2386870,
      "speaker": "Moritz Stefaner",
      "start": 2386234,
      "text": "Yeah.",
      "id": "ep_46_ut_151"
    },
    {
      "end": 2410830,
      "speaker": "Robert Kosara",
      "start": 2387690,
      "text": "Because it is too big a thing to talk about on Twitter and it needs that kind of discourse on a blog post. So I think that's, you know, for me, when the, the best example of blogging takes place, when people just take on this, this theme and, you know, and riff on it and put forth different perspectives, and then the collective is a. Is a sense of the spectrum of views about one single important subject.",
      "id": "ep_46_ut_152"
    },
    {
      "end": 2437834,
      "speaker": "Moritz Stefaner",
      "start": 2413050,
      "text": "Yeah, but that also sort of proves the point because that was in January or maybe end of February. Yeah, yeah, but it's basically, you know, a year ago. And yeah, I was sort of missing that maybe in summer or in fall this year to have more of these in depth debates really, that go back and forth and where people actually think about the answers, write a coherent statement.",
      "id": "ep_46_ut_153"
    },
    {
      "end": 2483892,
      "speaker": "Robert Kosara",
      "start": 2437882,
      "text": "Well, that's it. I mean, I mean, the other thing that I was kind of reminded of this year was the kind of famous visualization manifesto from Manuel. And what was so striking about that post was just the amount of commenting that took place on the blog and the people who were doing the commenting, it was the who's who's list that would never happen. Now, because commenting is done on Twitter, you want more people to see your views and people perhaps take less time and attend. Care to offer a very constructive post in terms of a comment? So, you know, I don't know if we'll ever recreate those glory days of two thousands, but I think there's generally.",
      "id": "ep_46_ut_154"
    },
    {
      "end": 2511108,
      "speaker": "Moritz Stefaner",
      "start": 2483916,
      "text": "A big, like a big frustration with Internet comments. And, you know, everybody knows why because they're horrible and just need to go to Reddit for five minutes and you're done for the day. But, and, and so, for instance, medium, like the blogging platform, they don't even allow comments. And maybe this, at the moment, there's no big interest in these sort of getting caught up in these, somebody's wrong on the Internet debate because a lot.",
      "id": "ep_46_ut_155"
    },
    {
      "end": 2661480,
      "speaker": "Andy Kirk",
      "start": 2511124,
      "text": "Of that is also happening on Twitter now and has kind of moved to the social media platforms. But medium has comments, but they're just in line. Like when you mouse over, there's a little bubble on the side of each paragraph. I think you have to be logged in perhaps to see that. And sometimes there's a little number there and then you can click on that and see what the comments are. So there isn't that much commenting back and forth at the bottom, but it can be in line where people can say about, yeah, but what about this? Or, yeah, good point. So I'm not sure if that's really working all that well, but I know in general it's an issue. And I also know on my side, I actually am still debating whether to keep comments or just turn them off. I don't get a whole lot. And so it's kind of, a lot of it is spam. So why keep them around if they're mostly a problem? But I don't know, but I think that what you were just talking about earlier, that kind of back and forth between the different blogs that I think is a really good one. And also Kaiser does this a few times sometimes that he picks up something from somewhere else and says, well, here's my view, here's how I'm going to redo this. And I think that's a really good way of doing things because that kind of, it's not a very sexy thing, I guess, in Web 2.0 or 3.0, whatever terms. But it's just responding to something on your blog and having more space than just a quick thing on Twitter is certainly a good thing. That's a thing to do. I forgot, of course, Alberto Cairo's blog is also a very good one to follow the functional art website. And also that's something I wanted to say earlier but then forgot, is that Alberto has also been more present, I think, and there has been more connections between academia and journalism because of him, because he gave the keynote at the Whiz conference this year. And well, I happen to have just seen him speak, I think four or five times last year. I'm kind of getting sick of him. But he's just, I think people are paying attention to him. They're using his book in their teaching and I think he, that they're getting a lot of the ideas about presentation and the importance of using visualization to tell people something about the world that's really now happening a lot more because of his influence and presence there as well, including his blog certainly, but his book and everything.",
      "id": "ep_46_ut_156"
    },
    {
      "end": 2669480,
      "speaker": "Enrico Bertini",
      "start": 2664340,
      "text": "So 2014 was the year where, when he had a lot of influence.",
      "id": "ep_46_ut_157"
    },
    {
      "end": 2671600,
      "speaker": "Andy Kirk",
      "start": 2669840,
      "text": "It's the year of Alberto Cairo.",
      "id": "ep_46_ut_158"
    },
    {
      "end": 2680416,
      "speaker": "Enrico Bertini",
      "start": 2671680,
      "text": "The year of Alberto Cairo. What else?",
      "id": "ep_46_ut_159"
    },
    {
      "end": 2683420,
      "speaker": "Robert Kosara",
      "start": 2680528,
      "text": "I suppose tools would be.",
      "id": "ep_46_ut_160"
    },
    {
      "end": 2710720,
      "speaker": "Enrico Bertini",
      "start": 2685240,
      "text": "Oh, I just briefly, before we move on to tools, I was just wondering if there are any other podcasts out there. What do you mean other podcasts I've heard of. So there is a, I recently discovered orally podcast that is more on data or something, not necessarily on data visualization, but they might actually have something on visualization there as well.",
      "id": "ep_46_ut_161"
    },
    {
      "end": 2723430,
      "speaker": "Moritz Stefaner",
      "start": 2711020,
      "text": "I enjoyed listening to development drums. They have all kinds of issues around improving the world and that has been quite nice. And they have been talking about data occasionally as well. So that was interesting.",
      "id": "ep_46_ut_162"
    },
    {
      "end": 2733882,
      "speaker": "Enrico Bertini",
      "start": 2724010,
      "text": "But I think we do need more podcasts. No, seriously, I mean, we've been talking about blogs and podcasts is another reality, but we haven't seen anything special out there.",
      "id": "ep_46_ut_163"
    },
    {
      "end": 2774062,
      "speaker": "Moritz Stefaner",
      "start": 2733906,
      "text": "That's true. And I mean there could be much coming, let's say, or like also big, big media houses, you know, they could have really nice podcasts and data, but there's a lot around Internet culture and tech culture. Like, you know, these dominate basically the top lists, like talking about Macs or talking about web development or so, but very little on. Yeah, actually on data, on society, on really interesting things. There's a big recommendation for me is reply all. It's about like Internet themes and Internet topics. It's really good, nicely produced and really nice, nice little stories around 15 minutes or so. So it's easy to listen.",
      "id": "ep_46_ut_164"
    },
    {
      "end": 2804584,
      "speaker": "Robert Kosara",
      "start": 2774086,
      "text": "Yeah. And John Schrobisch's started one with Stephanie Evergreen on. It's more to be presentation methods and techniques in general, but obviously, yeah. Very much based and rooted in Dataviz. And another Matt Francis and Emily Kund have started one over the last few months specific to Tableau, and I've completely forgotten the title. What it be something. That's right.",
      "id": "ep_46_ut_165"
    },
    {
      "end": 2806528,
      "speaker": "Andy Kirk",
      "start": 2804632,
      "text": "I think it's called Tableau wannabe. Right.",
      "id": "ep_46_ut_166"
    },
    {
      "end": 2823900,
      "speaker": "Robert Kosara",
      "start": 2806584,
      "text": "So they've got a Soundcloud and iTunes podcast on that. So yes, there are people perhaps on a kind of smaller basis, on a very kind of perhaps a niche basis doing podcasts. But I suppose you guys are still at the forefront of things.",
      "id": "ep_46_ut_167"
    },
    {
      "end": 2835148,
      "speaker": "Moritz Stefaner",
      "start": 2830460,
      "text": "Yeah, no, but it would be nice to have like a few more podcasts. I totally agree.",
      "id": "ep_46_ut_168"
    },
    {
      "end": 2836020,
      "speaker": "Robert Kosara",
      "start": 2835204,
      "text": "Oh, podcasts.",
      "id": "ep_46_ut_169"
    },
    {
      "end": 2836876,
      "speaker": "Enrico Bertini",
      "start": 2836060,
      "text": "Yeah, exactly.",
      "id": "ep_46_ut_170"
    },
    {
      "end": 2840640,
      "speaker": "Robert Kosara",
      "start": 2836988,
      "text": "Visual. Yeah.",
      "id": "ep_46_ut_171"
    },
    {
      "end": 2844120,
      "speaker": "Enrico Bertini",
      "start": 2840940,
      "text": "A vodkas. Yeah, that would be interesting. Yeah.",
      "id": "ep_46_ut_172"
    },
    {
      "end": 2879760,
      "speaker": "Moritz Stefaner",
      "start": 2846500,
      "text": "So let's take a short break to talk about our sponsor. As you know, Datastores is supported by Tableau software, helping people see and understand their data. Tableau lets people connect to any kind of data and visualize it on the fly. Databases, spreadsheets, and even big data sources are easily combined into interactive visualizations, reports and dashboards. What is your data trying to tell you? For your free trial, visit Tableau software at table software.com Datastories. And now back to the interview.",
      "id": "ep_46_ut_173"
    },
    {
      "end": 2882480,
      "speaker": "Enrico Bertini",
      "start": 2880380,
      "text": "Should we move on to tools?",
      "id": "ep_46_ut_174"
    },
    {
      "end": 2966220,
      "speaker": "Robert Kosara",
      "start": 2883630,
      "text": "This is something that I'm saying something about tools in terms of curation sense. So the launch of my new site in September published a collection of 273 resources around Dataviz, and I've had about 20 or 30 more since then. So it's still a very broad, very fragmented space. I don't think we've seen a great number of new tools in 2014. Certainly the headlines from my perspective have been the kind of continued growth and presence of raw from density design. I think that's certainly built on its initial momentum in 2013. It's expanded more chart types, more techniques for people, and I've seen a lot of people using raw. And I guess I would equate it to people who used to use Excel and record macros in the sense that you might use raw to create a start of a tendency and then build on the syntax that's generated from that work and tweak it thereafter without having to start from a blank slate. So I think people seem to be using raw as a gateway into learning more about D3 and JavaScript coding. So that seems to be a positive. Right.",
      "id": "ep_46_ut_175"
    },
    {
      "end": 2972040,
      "speaker": "Moritz Stefaner",
      "start": 2966340,
      "text": "And it's great for teaching because you can just have everybody drop in a data set, explain the buttons.",
      "id": "ep_46_ut_176"
    },
    {
      "end": 2989990,
      "speaker": "Robert Kosara",
      "start": 2972930,
      "text": "So, and Lyra is still something that I think is still in beta stage from Arvind. I can't remember his surname right now, but he's part of Jeff Hair's group or was part of Jeff Hayes group.",
      "id": "ep_46_ut_177"
    },
    {
      "end": 2991594,
      "speaker": "Andy Kirk",
      "start": 2990490,
      "text": "He still is, yeah.",
      "id": "ep_46_ut_178"
    },
    {
      "end": 2992950,
      "speaker": "Robert Kosara",
      "start": 2991682,
      "text": "Is it? Right, okay.",
      "id": "ep_46_ut_179"
    },
    {
      "end": 3021478,
      "speaker": "Andy Kirk",
      "start": 2993410,
      "text": "And it's also I guess part of why it's this tool is of course a very academic tool. So I don't know exactly what their plans are, but I know they have quite a few users and they are working on it. So it's in active development. But I don't know if they're ever going to declare it as kind of release because of course their ability to really support it and to support the users is limited. But it's a very cool tool and.",
      "id": "ep_46_ut_180"
    },
    {
      "end": 3026094,
      "speaker": "Moritz Stefaner",
      "start": 3021494,
      "text": "I guess they made their point already, maybe. So maybe what was important to them they have demonstrated.",
      "id": "ep_46_ut_181"
    },
    {
      "end": 3056736,
      "speaker": "Andy Kirk",
      "start": 3026142,
      "text": "Yeah, but I think they want to keep this going. So my understanding is that they're not just going to abandon it now that it's been published and people know about it. I think they're still working on it, that they're still improving it and building new things into it. And I think they want to really establish this as essentially a frontend for D3. So that is my understanding. I mean, I don't know exactly, but I'm pretty sure that they're working on this. I'm just saying that if you.",
      "id": "ep_46_ut_182"
    },
    {
      "end": 3058576,
      "speaker": "Moritz Stefaner",
      "start": 3056848,
      "text": "But does it generate D3 code?",
      "id": "ep_46_ut_183"
    },
    {
      "end": 3099730,
      "speaker": "Andy Kirk",
      "start": 3058608,
      "text": "No, it does. I think it generates, what's it called? There is Vega code. Right? Vega is this, but that's essentially D3 because Vega is then turned into D3 to actually run it in the browser. It doesn't do everything that D3 can do, but it covers a pretty decent subset. And Vega is another thing. This is built by trifecta. This is Jeff Heer's company and they are working on a new version of Vega as well. So they're going to add more things to Vega. I'm guessing that Lyre will have new things that they can then do because they can do them in Vega now and then be able to actually export them.",
      "id": "ep_46_ut_184"
    },
    {
      "end": 3123820,
      "speaker": "Moritz Stefaner",
      "start": 3102270,
      "text": "I mean, that makes sense if Lara becomes an editor for Vega. Yeah, but my general concern is that it's really tough to build a software product. I mean, you know, and it's not an academic task or job at all, you know, and it's. It's really, it's really tough.",
      "id": "ep_46_ut_185"
    },
    {
      "end": 3124440,
      "speaker": "Enrico Bertini",
      "start": 3123860,
      "text": "Yeah.",
      "id": "ep_46_ut_186"
    },
    {
      "end": 3129280,
      "speaker": "Moritz Stefaner",
      "start": 3125300,
      "text": "That can do arbitrary things. That's not so easy.",
      "id": "ep_46_ut_187"
    },
    {
      "end": 3136532,
      "speaker": "Enrico Bertini",
      "start": 3129980,
      "text": "Yeah, but academic products can be the basis for. For products on the market, like tab.",
      "id": "ep_46_ut_188"
    },
    {
      "end": 3152700,
      "speaker": "Moritz Stefaner",
      "start": 3136556,
      "text": "Right, right. But then somebody would need to take Lyra and the idea and start from scratch, like, you know, with probably with what do people want? What can we actually sell it? How do we do that?",
      "id": "ep_46_ut_189"
    },
    {
      "end": 3183510,
      "speaker": "Andy Kirk",
      "start": 3154480,
      "text": "Well, they might be able to get some funding to push it further. I don't know, but there are options. I mean, it's not easy, that's for sure. And most academic software is essentially built once and then just kind of slowly fades away. But I think that if anybody can keep stuff alive, it's Jeff, and Jeff here in his group. So I think I would certainly have much lower hopes. If it wasn't somebody around that group.",
      "id": "ep_46_ut_190"
    },
    {
      "end": 3186578,
      "speaker": "Enrico Bertini",
      "start": 3185050,
      "text": "I would be that strong.",
      "id": "ep_46_ut_191"
    },
    {
      "end": 3231750,
      "speaker": "Moritz Stefaner",
      "start": 3186674,
      "text": "Talking about Jeff Heer, I saw Trifacta. He is also involved in this company. Actually, when we had him on data stories, he talked about just getting started there. And what's exciting to see this year at Viz, they gave demos of the trifecta tour. And it's really nice software, so you can use it to clean up messy data, so you can feed it mostly text based data sets, like CSV files or something that looks like a CSV, but it's not really one, and clean it up. And you do that example wise on a small data set, but then you can apply the same operations on huge data sets in the cloud, basically. And so that's quite a nice. A nice niche to fill, and b, they have built a really, really snappy little tool there. So I'm pretty impressed.",
      "id": "ep_46_ut_192"
    },
    {
      "end": 3234538,
      "speaker": "Enrico Bertini",
      "start": 3232090,
      "text": "And it is actually the outcome of an academic product.",
      "id": "ep_46_ut_193"
    },
    {
      "end": 3237866,
      "speaker": "Moritz Stefaner",
      "start": 3234594,
      "text": "Right. But it's a company that has now been working on it for two or three years. Right.",
      "id": "ep_46_ut_194"
    },
    {
      "end": 3238186,
      "speaker": "Enrico Bertini",
      "start": 3237898,
      "text": "So.",
      "id": "ep_46_ut_195"
    },
    {
      "end": 3238706,
      "speaker": "Robert Kosara",
      "start": 3238258,
      "text": "Yeah, yeah.",
      "id": "ep_46_ut_196"
    },
    {
      "end": 3240586,
      "speaker": "Moritz Stefaner",
      "start": 3238738,
      "text": "So that's exactly the same.",
      "id": "ep_46_ut_197"
    },
    {
      "end": 3245610,
      "speaker": "Enrico Bertini",
      "start": 3240618,
      "text": "So it's a very good example of how an academic product can become a product on the market.",
      "id": "ep_46_ut_198"
    },
    {
      "end": 3247910,
      "speaker": "Moritz Stefaner",
      "start": 3245770,
      "text": "Yeah. Non academics are involved.",
      "id": "ep_46_ut_199"
    },
    {
      "end": 3252922,
      "speaker": "Andy Kirk",
      "start": 3249730,
      "text": "But not just. That's the point. Right. Because this is, this is actually.",
      "id": "ep_46_ut_200"
    },
    {
      "end": 3253946,
      "speaker": "Moritz Stefaner",
      "start": 3252986,
      "text": "No, we need both.",
      "id": "ep_46_ut_201"
    },
    {
      "end": 3305490,
      "speaker": "Andy Kirk",
      "start": 3254058,
      "text": "A lot like, this was actually founded by a number of folks from Stanford. Jeff and I always forget the other guys names, but they're by a number of failed. No, no, not at all, actually. So this is another good example, and there aren't many, of course, there aren't a lot of examples that really work that way and that really ended up being successful. But that certainly is an example that seems to be working, going really well, so it can happen. But of course, I totally agree with what you're saying about academic software in general is really sad. But that's the problem with the incentives that you have in academia, that it doesn't really, in most cases, there's no point or no academic value, I guess, in keeping something alive and developing small things because you want to have a big publication about something else. And so that makes it tough.",
      "id": "ep_46_ut_202"
    },
    {
      "end": 3371500,
      "speaker": "Moritz Stefaner",
      "start": 3305610,
      "text": "Yeah. The last 20% that make it a round product you can't write a paper on. Then it fixed a lot of bugs and then I polished the, you know, that's exactly the problem. One tool I was really impressed with was Mirador or Mirador, who knows? It's a really nice tool for quickly exploring. You have a fresh data set and you just want to look into it and see distributions and correlations. Basically, like how are the different variables? How are the values distributed? Does one value occur very often and others very rarely? And also how do they occur together? And it's very optimized for that case really fast. And it has this really nice, I don't know, is it mosaic plot, Marimekko chart type things? I can't remember if they have a proper name, but they are really effective. So you can spot immediately the correlations really well. And I used it a few times and it works really well. So I can recommend that. And it's free, open source, everything coming from fathom, Ben Fry's company, and I.",
      "id": "ep_46_ut_203"
    },
    {
      "end": 3401060,
      "speaker": "Robert Kosara",
      "start": 3371500,
      "text": "Think we have to mention Tableau for Mac being a significant milestone of last year, which a lot of people kind of were unleashed, I guess, into the tour over the last. What is it, about six months ago? So, yeah, and also, I think the smoothness of the transition. I've been using it quite a lot this last few months and I found very few, if any, books. I think that was a very important milestone, certainly for Tableau.",
      "id": "ep_46_ut_204"
    },
    {
      "end": 3443930,
      "speaker": "Andy Kirk",
      "start": 3403080,
      "text": "Oh, yeah, that's for sure. We got lots and lots of requests for that. So we were very happy to be able to do that so people could actually stop asking about it. And of course, the same version, 8.3, also had the story points feature. 8.2 actually, sorry, but had the story points feature, which was interesting for me, of course, because I was involved in that and we were able to build this, this feature where you could actually build stories out of your existing visualizations. And I think that's been really interesting to watch people use that. So to kind of add a bit to the storytelling theme there, that's another bit that I certainly liked about that release.",
      "id": "ep_46_ut_205"
    },
    {
      "end": 3445334,
      "speaker": "Enrico Bertini",
      "start": 3444790,
      "text": "Yeah.",
      "id": "ep_46_ut_206"
    },
    {
      "end": 3462650,
      "speaker": "Moritz Stefaner",
      "start": 3445422,
      "text": "But I also use Tableau still a lot and it's really a solid piece. Also on the Mac software because the first release is sometimes a bit wonky, but Tableau just works, you know, it's great. I'm also really happy and I don't need to fire up parallels all the time. It's like a huge difference.",
      "id": "ep_46_ut_207"
    },
    {
      "end": 3465822,
      "speaker": "Enrico Bertini",
      "start": 3463350,
      "text": "It is, yeah, yeah, yeah.",
      "id": "ep_46_ut_208"
    },
    {
      "end": 3484342,
      "speaker": "Moritz Stefaner",
      "start": 3465966,
      "text": "Any other, like what happened to all these? I remember there were a lot of these charting made simple startups, like, you know, like charts for everybody. Like funky charts here, drop your data there. Has any of these. Do you follow the scene? Are they all the same? Are some of them really good?",
      "id": "ep_46_ut_209"
    },
    {
      "end": 3524420,
      "speaker": "Robert Kosara",
      "start": 3484366,
      "text": "And others, I guess from the outside, I mean, I've certainly not played with enough of them to create a single conclusion, but they do seem quite lightweight. I'm sure they've got an audience out there for very simple needs, but how long they'll survive is a different matter. But I don't feel like there's been many new ones of late. I think certainly the start of last year and the end of the previous year seemed to win. About four or five came onto the market at once, but I forgot the whole automating infographics scene hopefully has dried up somewhat.",
      "id": "ep_46_ut_210"
    },
    {
      "end": 3627926,
      "speaker": "Andy Kirk",
      "start": 3527240,
      "text": "Well, on the other hand though, there's actually so. I don't remember having seen that many new ones, but maybe I'm also just kind of tuning them out now because there are just so many, and to an extent, many of them really are very similar, but there are a few that stand out. And one in particular was in interesting because they made some interesting decisions recently, which is data wrapper. They changed their model from being free because I think they no longer have the funding that they used to have and some they actually have to pay for. And I forget the actual way to do this because I think it's actually really clever. There's something about that. I don't remember exactly how it works, but I think you can create things, but to host them you have to pay them, but you don't have to keep paying them. So your things still stay up if you stop paying. I think if you paid them, why you were using it to create things if that makes any sense. But either way, I think they have an interesting model there where it's not a huge burden to pay for it, but they make some money because they have to and to keep running, and we'll see how this works out because this was only done a few weeks ago, I think. But it's interesting to see because they have to figure out all of these startups, they start some grant or whatever, or some sort of funding, but then they have to make money somehow and many of them are free. Well, I was watching this with swivel, which looked like it was going to take over the world, and then it just folded without really much fan for at some point. So I'm always worried about these things, and it seems the data wrapper, they know what they're doing there and it's a very popular topic, and it also survived. It's good to see that they figured.",
      "id": "ep_46_ut_211"
    },
    {
      "end": 3649850,
      "speaker": "Robert Kosara",
      "start": 3627958,
      "text": "It out, the loss of Gregor, who was the venture behind that. Oh, yeah, I guess on the side doing some work to support it. But yeah, it feels like it's got through that kind of infancy stage and it's found its place, and a lot of small kind of independent newspapers are using that still for their web based graphics, so, yeah, it's good to see.",
      "id": "ep_46_ut_212"
    },
    {
      "end": 3655470,
      "speaker": "Moritz Stefaner",
      "start": 3653030,
      "text": "Yeah. And they had a very clear idea of who they are targeting.",
      "id": "ep_46_ut_213"
    },
    {
      "end": 3655662,
      "speaker": "Andy Kirk",
      "start": 3655510,
      "text": "Right.",
      "id": "ep_46_ut_214"
    },
    {
      "end": 3664520,
      "speaker": "Moritz Stefaner",
      "start": 3655686,
      "text": "And it's exactly the small to medium sized newspapers that don't have a big, like, graphics department, and they. Yeah, they did that really well.",
      "id": "ep_46_ut_215"
    },
    {
      "end": 3665800,
      "speaker": "Robert Kosara",
      "start": 3665020,
      "text": "Yeah.",
      "id": "ep_46_ut_216"
    },
    {
      "end": 3698320,
      "speaker": "Moritz Stefaner",
      "start": 3666460,
      "text": "And are still doing. That's true. So maybe this, that's a special one among all the startups. Yeah. Any other tools? I mean, have there been any big programming progresses? I'm just thinking. So I saw a few, like, interesting things coming out of the python world, or like more scientific computing things, but like on the web and general data visualization scene, I think it's still nothing else, right?",
      "id": "ep_46_ut_217"
    },
    {
      "end": 3782150,
      "speaker": "Andy Kirk",
      "start": 3699620,
      "text": "Oh, yeah, absolutely. There's a lot of that around. Oh, so one thing that is related to D3 that's interesting is there's a neat project by Manish Arkavala and a few other folks that is called D3 deconstructor. I think that takes, when you look at a website that has a D3 viz on it, you can run this deconstructor. It's a little plugin for chrome, and most of the time, it doesn't always work. Most of the time it will find the visualization and it will show you all the mappings. You can grab the data, which is neat, so you can just get the data directly out of the visualization. You can also change the mapping. So if you don't like the bubble chart that they're showing you, you can actually turn that into something else. And it's very clever. It's really impressive. This was a paper at Wist or at CHI's, I think, last year, and they released the code and released that module for this plugin, I guess, for chrome, I think in November or so, or December perhaps. So it's not out there for that long and most people don't know about it, but it's very neat and it's very, very cool. If you want to learn more about D3, it's a very good way to see how things are built and what's kind of going on behind the scenes. And especially if you want to steal some data, it's also a good tool for that.",
      "id": "ep_46_ut_218"
    },
    {
      "end": 3823300,
      "speaker": "Enrico Bertini",
      "start": 3783850,
      "text": "Yeah, I think another interesting tool, I don't know if you've ever heard of it, is shiny by RSTudio, which is pretty nice. I was really impressed. One of my students showed to me and it's been playing with the system for a while and it's pretty neat and it's based on D3. And it's basically the idea is that you, from R, you can directly code something that goes on to the web and there is also interaction on top of it. So it's very flexible, it looks good. And I think it's a major, major step towards making R something that can be a little bit more interactive and also easier to distribute. So I think it's a really, really nice tool.",
      "id": "ep_46_ut_219"
    },
    {
      "end": 3837610,
      "speaker": "Moritz Stefaner",
      "start": 3826680,
      "text": "But the charts, as far as, were they really web native or is it more or less transmitting mostly images? Because I think I looked at it and. Oh, yeah, no, it's not the images.",
      "id": "ep_46_ut_220"
    },
    {
      "end": 3841966,
      "speaker": "Enrico Bertini",
      "start": 3838270,
      "text": "It's not. Yeah, it is nice.",
      "id": "ep_46_ut_221"
    },
    {
      "end": 3842782,
      "speaker": "Moritz Stefaner",
      "start": 3842078,
      "text": "That's cool.",
      "id": "ep_46_ut_222"
    },
    {
      "end": 3877242,
      "speaker": "Enrico Bertini",
      "start": 3842886,
      "text": "And what I'm really surprised about is that you can also code from r, the interactive part of it, right. Which is really new and very much needed in the R world because one of the major limitations of R is that it's very, very hard to create something that is interactive, right? So I think these guys made. Yeah. Created a fantastic tool, shiny. It's called shiny. And, you know, I mean, I mean, you know how many people use r everyday in this, in this world, right? There are lots of data scientists out there, so we might actually see more, more visualizations coming from this world.",
      "id": "ep_46_ut_223"
    },
    {
      "end": 3877962,
      "speaker": "Robert Kosara",
      "start": 3877426,
      "text": "Right?",
      "id": "ep_46_ut_224"
    },
    {
      "end": 3882154,
      "speaker": "Moritz Stefaner",
      "start": 3878066,
      "text": "Rise of the data scientists. That's another big trend, the rise of the data scientists.",
      "id": "ep_46_ut_225"
    },
    {
      "end": 3884442,
      "speaker": "Robert Kosara",
      "start": 3882242,
      "text": "Yeah, yeah. I mean, on that point, if there.",
      "id": "ep_46_ut_226"
    },
    {
      "end": 3888560,
      "speaker": "Moritz Stefaner",
      "start": 3884466,
      "text": "Have been big themes from Lynn.",
      "id": "ep_46_ut_227"
    },
    {
      "end": 3912332,
      "speaker": "Robert Kosara",
      "start": 3889860,
      "text": "I can't remember which one it is now. That one of the comments. Yeah, one of the comments that she had for the last year was internally, I've opened up the wrong one. Something around the fact that she felt that there was a greater kind of movement from database people to kind of embrace data science. Like Santiago. Yeah, yeah.",
      "id": "ep_46_ut_228"
    },
    {
      "end": 3913660,
      "speaker": "Andy Kirk",
      "start": 3912396,
      "text": "Oh, yeah, like Santiago.",
      "id": "ep_46_ut_229"
    },
    {
      "end": 3918800,
      "speaker": "Robert Kosara",
      "start": 3913820,
      "text": "So, I mean, see myself, but it feels like a valid observation.",
      "id": "ep_46_ut_230"
    },
    {
      "end": 3928964,
      "speaker": "Moritz Stefaner",
      "start": 3920460,
      "text": "But I think that's a natural development because you just hit your walls when you do the same simple analysis over and over again.",
      "id": "ep_46_ut_231"
    },
    {
      "end": 3929324,
      "speaker": "Andy Kirk",
      "start": 3929052,
      "text": "Right.",
      "id": "ep_46_ut_232"
    },
    {
      "end": 3940458,
      "speaker": "Moritz Stefaner",
      "start": 3929372,
      "text": "At some point, you realize you need to get into statistics, really, you know, or machine learning and so on to really figure stuff out and. Yeah. And it's just happening. That's cool. I like it.",
      "id": "ep_46_ut_233"
    },
    {
      "end": 3981464,
      "speaker": "Enrico Bertini",
      "start": 3940554,
      "text": "Yeah. And at the same time, I think there are many, many data scientists out there who do need help from visualization experts. I've been talking with a few ones, and when I actually explained to them what we can do for them, they're really, really surprised. And what I mean is not just visualizing the result of their machine learning algorithms or whatever, it's also creating visualization that help them making sense of what they do. Because basically they are doing everything based on numbers. Right. But as we all know, sometimes numbers hide a lot of complexities. And if you can open this box a little bit, you might actually discover important things. So I think there is a lot.",
      "id": "ep_46_ut_234"
    },
    {
      "end": 4031650,
      "speaker": "Andy Kirk",
      "start": 3981472,
      "text": "Of fun because there's still a lack of visual thinking in statistics and in data science. And this is 40 years or so now after Tukey and many, many years after. People like Howard Wehner and others have tried to bring that into this world a bit more. But it seems that a lot of people are still not seeing that and not really getting that. And there's so much. I don't know, maybe it's just different kinds of people having different preferences, but I feel that it's so much easier to see what's going on when you even just think about things as visuals, even if you're not even seeing them. And so just having this kind of second channel is just really useful. So I'm really surprised that there's still such a big divide between the two.",
      "id": "ep_46_ut_235"
    },
    {
      "end": 4058610,
      "speaker": "Enrico Bertini",
      "start": 4032630,
      "text": "Yeah. But I can tell you from my experience, I expected much more resistance. And when I talk to this kind of people, they are very much open to visualization. It's just that it's not their thing. I think most of these people, their mindset is I need to collaborate with someone who can, who understands visualization rather than learning how to do visualization properly, which is, I think it's good news for us. Yeah.",
      "id": "ep_46_ut_236"
    },
    {
      "end": 4060606,
      "speaker": "Andy Kirk",
      "start": 4059390,
      "text": "So one thing we kind of.",
      "id": "ep_46_ut_237"
    },
    {
      "end": 4076918,
      "speaker": "Moritz Stefaner",
      "start": 4060638,
      "text": "Yeah, but that's going to be interesting once you actually collaborate. No, but, you know, because there is different philosophies in these fields, and I think we can benefit very much from each other, but there might be, like, also very fundamental differences. And now how you see the world.",
      "id": "ep_46_ut_238"
    },
    {
      "end": 4103690,
      "speaker": "Enrico Bertini",
      "start": 4076974,
      "text": "Or what you want to achieve, I don't know. I think one thing that I like of the data science or machine learning world is that they're mostly playing with models, and we don't have this model concept in visualization. I think it's an important aspect of dealing with data. Through building models out of data is a very important aspect of data science or anything related to that, and we don't have that in visualization at all. Right.",
      "id": "ep_46_ut_239"
    },
    {
      "end": 4104678,
      "speaker": "Robert Kosara",
      "start": 4104390,
      "text": "Yeah.",
      "id": "ep_46_ut_240"
    },
    {
      "end": 4120570,
      "speaker": "Moritz Stefaner",
      "start": 4104694,
      "text": "And also sort of robust notions of what, something like how you can maybe prove something statistically, or how robust the research or the data behind your statements is and things like that. That's all of these things we can learn a lot.",
      "id": "ep_46_ut_241"
    },
    {
      "end": 4121770,
      "speaker": "Robert Kosara",
      "start": 4120990,
      "text": "Yeah.",
      "id": "ep_46_ut_242"
    },
    {
      "end": 4128142,
      "speaker": "Moritz Stefaner",
      "start": 4123590,
      "text": "Cool. Shall we segue over to the future, or is there anything.",
      "id": "ep_46_ut_243"
    },
    {
      "end": 4129930,
      "speaker": "Enrico Bertini",
      "start": 4128206,
      "text": "Yeah, let's do that.",
      "id": "ep_46_ut_244"
    },
    {
      "end": 4219468,
      "speaker": "Moritz Stefaner",
      "start": 4130769,
      "text": "Pass is the path. It's totally over. Yeah, it's totally done. I'm bored already. So one thing in the future, talking about the future. So, because I was thinking about journalism, and, you know, the role journalism plays and how we like the data, people should be more journalistic, but also the journalists should be more data ish. And one thing that really impressed me was the serial podcast. Did you listen to serial? It's really good. It's really good. And it's really. I don't know, it's sort of, for me, it sort of rearranged a few notions I had about journalism and what it means and so on. So it's sort of an investigative, a reinvestigation of a murder case that happened 15 years ago. And it's ten episodes. They're each, I think, 45 minutes long or something like this. And it's a single journalist, and she has a strong editorial voice. She tells very much from her perspective, how she sort of re investigates that case. And she talks to the guy who was convicted, and she talks to the witnesses that she can still get a hold of, and she reads all the files and sort of tries to make sense of that case. And of course, the basic premise is, well, maybe there was, maybe the guy who's in jail now is, of course, not guilty, right. But it sort of flips always back and forth between this. Well, did he do it or didn't to do it?",
      "id": "ep_46_ut_245"
    },
    {
      "end": 4221320,
      "speaker": "Robert Kosara",
      "start": 4219564,
      "text": "Are you about to spoil this brick?",
      "id": "ep_46_ut_246"
    },
    {
      "end": 4287856,
      "speaker": "Moritz Stefaner",
      "start": 4225420,
      "text": "And it's really sort of thrilling to follow that. And what I found really interesting is the strong first person perspective. Like, you know, somebody actually walking you through. She makes sense of that mess, you know, and she sort of thinks out aloud and, you know, but at the same time, she built a huge drama around a fact based story. So it's, you know, in a way, it's the best of storytelling, but it's also the worst of storytelling because end of the day, it's a murder case. And, I mean, I don't know if I'm spoiling anything, but my feeling is, after the podcast, everybody's worse off who was actually involved in the original case, because now everything's dragged online and, you know, and it's like, it's a big mess. At the same time, she did something really, really, I don't know, it was. It's just a masterpiece in a way, how she did it. But then the effect of it is very, I don't know, almost like, it's almost like she makes a big entertainment out of something very serious.",
      "id": "ep_46_ut_247"
    },
    {
      "end": 4290140,
      "speaker": "Robert Kosara",
      "start": 4288008,
      "text": "So how do you see translating emeralds?",
      "id": "ep_46_ut_248"
    },
    {
      "end": 4339886,
      "speaker": "Moritz Stefaner",
      "start": 4290680,
      "text": "And my question is, or what I was wondering about is if this strong first person perspective is that, is that something we will maybe see more in the future, that somebody walks you through something and very explicitly says, this is not the truth. This is just how I encounter counted facts, or what I found to be facts. So this sort of even stronger sort of subjective perspectives. And, yeah, the other thing was really, again, like these narrative formats and this sort of building a drama around simple things. Is that something we need? You know, is that something we really should do? And so on. But it's another thing. But I would really recommend listening to the podcast and sort of thinking about what that means for other types of media because it's sort of a new thing. It's a very exciting thing, but also very, like, potentially dangerous one, I feel. So it was interesting to think about it.",
      "id": "ep_46_ut_249"
    },
    {
      "end": 4343990,
      "speaker": "Robert Kosara",
      "start": 4339958,
      "text": "I actually thought it was a fictional work from the outside, but clearly not.",
      "id": "ep_46_ut_250"
    },
    {
      "end": 4354558,
      "speaker": "Moritz Stefaner",
      "start": 4344070,
      "text": "No, it's an actual case. And now you're talking about Reddit, now there's a subreddit, and there's like hundreds of sort of amateur detectives now figuring it all out, and it's a huge mess.",
      "id": "ep_46_ut_251"
    },
    {
      "end": 4371890,
      "speaker": "Andy Kirk",
      "start": 4354654,
      "text": "Well, there are other media, too, that are doing interviews with the people, and so there is some follow up on it. Yeah, there's. This has kind of turned into a little story by itself and following that up and figuring out what really happened and who hasn't talked yet and what they all have to hide.",
      "id": "ep_46_ut_252"
    },
    {
      "end": 4432850,
      "speaker": "Robert Kosara",
      "start": 4374790,
      "text": "So I asked a question on Twitter about people's hopes or fears for 2015, just to quickly read a few of these out. I guess the same theme about the kind of idea collaborated with data scientists and the mutual benefits there. We had one coming from Will Allen, who said that he recognized this ongoing need for kind of continued collaboration between journalists looking to learn how to communicate with visualizers. So that was one comment from Jen Christiansen. We had a hope for 2015 more, more access accessible outlets like data stories for conversations between researchers and practitioners. So I guess there's a theme they're developing about not existing in silos and having the means to kind of, I guess, kind of fertilize ideas across different groups.",
      "id": "ep_46_ut_253"
    },
    {
      "end": 4443458,
      "speaker": "Moritz Stefaner",
      "start": 4434430,
      "text": "I agree. I also think we will see great stuff from like natural scientists next year. That's because they are now getting the hang of all the cool stuff.",
      "id": "ep_46_ut_254"
    },
    {
      "end": 4443834,
      "speaker": "Robert Kosara",
      "start": 4443554,
      "text": "Right?",
      "id": "ep_46_ut_255"
    },
    {
      "end": 4447070,
      "speaker": "Moritz Stefaner",
      "start": 4443882,
      "text": "And yeah, that's my feeling, too.",
      "id": "ep_46_ut_256"
    },
    {
      "end": 4465910,
      "speaker": "Robert Kosara",
      "start": 4448370,
      "text": "Sarah Sloban from the Wall Street Journal said, for 2015, I'd love to see more stories built around visuals and data as opposed to word. So I guess that is probably picking once again on the themes that we discussed at the start of the session.",
      "id": "ep_46_ut_257"
    },
    {
      "end": 4475680,
      "speaker": "Moritz Stefaner",
      "start": 4468740,
      "text": "That's an interesting perspective to say. Maybe traditional journalism still is even still to word focused.",
      "id": "ep_46_ut_258"
    },
    {
      "end": 4506270,
      "speaker": "Robert Kosara",
      "start": 4477780,
      "text": "I suppose. I mean, that will come with a segue into another theme that I'm hoping for next year, which I know something that strikes, Enrico is this issue of visualization literacy. Perhaps until we've got the audience out there with the true literacy to take on board things that don't have, have the assistance that comes with words, we won't really have the platform to do that. Yeah, but just to finish off in terms of the tweets, Ben Jones.",
      "id": "ep_46_ut_259"
    },
    {
      "end": 4577126,
      "speaker": "Enrico Bertini",
      "start": 4507730,
      "text": "Sorry, Andy. I just want to briefly say something about that because this is what I was going to say about 2015. My hope is that there will be more resources to help people learn more about not only about visualizations, but also how to deal with data in general. I think there is a big, big lack of, however you want to call it, statistical literacy, data literacy, visual literacy, however you want to call it. But I think we really, really need much more, many more resources to help people learn about these things because all the kind of information that talk about this thing a little bit is scattered all over the place. There are a lot of good statistics book, but they are very heavily loaded with other things. So it's hard and I think it's very much needed. And it's not just about visualization. And I had a brief conversation with Moritz about that as well in the past. I think it's really, really important to think about having a larger perspective. It's not just visualizing things, it's also about thinking through the. Yeah, I think there is a lot to learn there. Really a lot. I am learning a lot myself.",
      "id": "ep_46_ut_260"
    },
    {
      "end": 4615650,
      "speaker": "Robert Kosara",
      "start": 4577158,
      "text": "Yeah. I think just my own experience of doing training workshops. Some of the folks who come along, maybe from a graphic design background or more of a creative background, there is genuine, perhaps not fear, but a genuine kind of hesitance with getting to grips with even things like a simple spreadsheet and the data types and how to treat different types of data. And perhaps there is a certain complacency from us in the field that everyone does have that relatively basic entry point, but I don't think it is. I don't think it does exist. So I think you're absolutely right.",
      "id": "ep_46_ut_261"
    },
    {
      "end": 4635728,
      "speaker": "Enrico Bertini",
      "start": 4616430,
      "text": "Yeah. And it's so easy to jump to conclusions, and I think it's very dangerous. So I think people should be a little bit more careful jumping to conclusions through one data set, analyze across a certain perspective. So I think that's something that we all have to learn.",
      "id": "ep_46_ut_262"
    },
    {
      "end": 4679810,
      "speaker": "Robert Kosara",
      "start": 4635824,
      "text": "And just on the broader point of visualization, literacy. So we're working on a research project, and this concludes in March of this year. So we're looking to release a lot of resources and findings about the recipients, the readers, the users, the audiences, to give them a bit more assistance and guidance about how to make a sense of visualizations, how to read them, how to approach them and what to look for. Because as we've just said there, it's not something you necessarily get taught. You kind of get through by kind of exposure to charts for your adult years, largely. So we're hoping to just to contribute something on that front. So that'll be something that I'm hoping to affect in terms of trends of next year. Certainly.",
      "id": "ep_46_ut_263"
    },
    {
      "end": 4683590,
      "speaker": "Moritz Stefaner",
      "start": 4681190,
      "text": "Will there be a report from the research project?",
      "id": "ep_46_ut_264"
    },
    {
      "end": 4686934,
      "speaker": "Robert Kosara",
      "start": 4683630,
      "text": "Reports, videos, presentations, all sorts stuff.",
      "id": "ep_46_ut_265"
    },
    {
      "end": 4688078,
      "speaker": "Moritz Stefaner",
      "start": 4687022,
      "text": "Cool, cool.",
      "id": "ep_46_ut_266"
    },
    {
      "end": 4689702,
      "speaker": "Enrico Bertini",
      "start": 4688254,
      "text": "Let us know that's important.",
      "id": "ep_46_ut_267"
    },
    {
      "end": 4691810,
      "speaker": "Robert Kosara",
      "start": 4689846,
      "text": "And possibly podcasts, who knows?",
      "id": "ep_46_ut_268"
    },
    {
      "end": 4693730,
      "speaker": "Andy Kirk",
      "start": 4692670,
      "text": "Oh, wow.",
      "id": "ep_46_ut_269"
    },
    {
      "end": 4711650,
      "speaker": "Robert Kosara",
      "start": 4695270,
      "text": "Yeah, just, just. The last tweet was from Ben Jones, who said hopes for 2015 continued high level collaboration database across disciplines and tools. The same things we just said there, his fears, the zombie apocalypse. So let's hope that doesn't happen.",
      "id": "ep_46_ut_270"
    },
    {
      "end": 4726512,
      "speaker": "Moritz Stefaner",
      "start": 4713550,
      "text": "That would be really bad for databases, just personal propublica. It's true. Or do you say propublica? Probably in the US, but yeah, we haven't mentioned that yet, but they did some great work.",
      "id": "ep_46_ut_271"
    },
    {
      "end": 4743900,
      "speaker": "Robert Kosara",
      "start": 4726576,
      "text": "Yeah, yeah, absolutely. My last kind of prediction for 2015 would be a big showing from the Guardian and specifically the Guardian UK. Recently they've been making some big high profile appointments.",
      "id": "ep_46_ut_272"
    },
    {
      "end": 4746392,
      "speaker": "Moritz Stefaner",
      "start": 4744800,
      "text": "It's been quiet around the media.",
      "id": "ep_46_ut_273"
    },
    {
      "end": 4791600,
      "speaker": "Robert Kosara",
      "start": 4746456,
      "text": "It has, yeah. I mean the Guardian US has been doing some great work, but the garden UK has lost a certain number of people the last few years. Simon left, Alyssa Dand, people like that left. So they've now appointed Aaron Pilhofer as executive editor of Digital and Shakeen Gonzalez, formerly of the MIT, is now the editor of visuals. So there's some big names kind of starting to coordinate things there. Yesterday they appointed Pablo Gutierrez from the BBC. Cath Levitt's been the editor for graphics over the last year or so, I think. So they seem to kind of reshuffling their, their decks and expecting a big year from them.",
      "id": "ep_46_ut_274"
    },
    {
      "end": 4803640,
      "speaker": "Moritz Stefaner",
      "start": 4792900,
      "text": "That sounds good. So all by Guardian stocks now it's the new gold.",
      "id": "ep_46_ut_275"
    },
    {
      "end": 4805600,
      "speaker": "Andy Kirk",
      "start": 4804580,
      "text": "Exactly.",
      "id": "ep_46_ut_276"
    },
    {
      "end": 4829440,
      "speaker": "Robert Kosara",
      "start": 4807580,
      "text": "I think it's kind of hard to predict the next year in the sense that as we began this podcast, 2014 was kind of hard to get a hold of. I think really the hope would be just continue more of the same, continued growth, more people doing great stuff. No big revolution, just continued evolution.",
      "id": "ep_46_ut_277"
    },
    {
      "end": 4937050,
      "speaker": "Andy Kirk",
      "start": 4830620,
      "text": "Yeah, well, I could do without a revolution, but it's, we can't predict that, obviously, so we'll see what happens. But I think that a lot of good things happened quite obviously this last year and I'm thinking that more of that will happen as well this year. Again, I think that on the academic side and some of these things just take a while. That's why it's hard to pin down individual things that happen in one year, because things just take a while. People move to a different job, it takes them a while to get started and so on, especially in academia, everything takes very long. So it's not just that something happens and it's there. So what I think, and I'm pretty sure will happen more, is there's more academic, more interest and more attention from academia, from the academic viz side in presentation, not just storytelling, but just being able to communicate data. And I think Enrico's work on, on the literacy is part of that. And there are other things that are happening that I think are really interesting and there's going to be more of that as well, and just in general more communication. We haven't talked much about these conferences that have been going on for the last two years, like Openviz and then Tapestry and I o and visualized and so on, but those are actually making a difference. I think there's a lot of new dialogue that hasn't really happened before, and because there were these separate communities that were, you know, academics were going to this event, and the practitioners were going to that event, and then designers were talking to themselves there. But there's a lot more kind of cross fertilization now, I think, and between all those fields, and I think that's really helpful, and that's going to make a lot of new things happen.",
      "id": "ep_46_ut_278"
    },
    {
      "end": 4958590,
      "speaker": "Robert Kosara",
      "start": 4937130,
      "text": "That was very evident to tapestry last year and also open phase. You can very. And also not evident in the sense that you saw people going from these different worlds and they would stick together in cliques. It was introducing yourself to people. Oh, you're from that background and are you from that background? Yeah. Yeah. I think that's a good point.",
      "id": "ep_46_ut_279"
    },
    {
      "end": 4978920,
      "speaker": "Moritz Stefaner",
      "start": 4961330,
      "text": "Yeah. And all these things, they, over the years, draw and draw more and more people in, and everybody brings in their existing perspectives, and that leads exactly to what we discussed in the beginning, this incredibly rich and diverse field. It's even hard to get an overview anymore, which is great.",
      "id": "ep_46_ut_280"
    },
    {
      "end": 4979568,
      "speaker": "Robert Kosara",
      "start": 4979000,
      "text": "Yeah.",
      "id": "ep_46_ut_281"
    },
    {
      "end": 4982980,
      "speaker": "Enrico Bertini",
      "start": 4979704,
      "text": "Yeah. It's amazing to be here. I love it.",
      "id": "ep_46_ut_282"
    },
    {
      "end": 4985740,
      "speaker": "Moritz Stefaner",
      "start": 4984400,
      "text": "Good place to be.",
      "id": "ep_46_ut_283"
    },
    {
      "end": 4990200,
      "speaker": "Enrico Bertini",
      "start": 4986280,
      "text": "Good place to be. Still, still cool.",
      "id": "ep_46_ut_284"
    },
    {
      "end": 4991580,
      "speaker": "Moritz Stefaner",
      "start": 4990240,
      "text": "Shall we wrap it up there?",
      "id": "ep_46_ut_285"
    },
    {
      "end": 4993216,
      "speaker": "Enrico Bertini",
      "start": 4992200,
      "text": "Let's wrap it up.",
      "id": "ep_46_ut_286"
    },
    {
      "end": 4994660,
      "speaker": "Moritz Stefaner",
      "start": 4993288,
      "text": "2014 is done.",
      "id": "ep_46_ut_287"
    },
    {
      "end": 4996220,
      "speaker": "Andy Kirk",
      "start": 4995280,
      "text": "It's done.",
      "id": "ep_46_ut_288"
    },
    {
      "end": 5004300,
      "speaker": "Moritz Stefaner",
      "start": 4997720,
      "text": "Not coming back. Yeah, it's cool. I'm looking forward to 2015. It's going be cool.",
      "id": "ep_46_ut_289"
    },
    {
      "end": 5014720,
      "speaker": "Enrico Bertini",
      "start": 5004920,
      "text": "Yeah. Let me just mention that if you're listening to this and you want to suggest someone you want to see appear on the podcast in 2015, let us know.",
      "id": "ep_46_ut_290"
    },
    {
      "end": 5015816,
      "speaker": "Moritz Stefaner",
      "start": 5014760,
      "text": "That's a good idea.",
      "id": "ep_46_ut_291"
    },
    {
      "end": 5022904,
      "speaker": "Enrico Bertini",
      "start": 5016008,
      "text": "Suggestions are always welcome. Thanks a lot, guys, for being on the show.",
      "id": "ep_46_ut_292"
    },
    {
      "end": 5023732,
      "speaker": "Moritz Stefaner",
      "start": 5022992,
      "text": "Thanks for having me.",
      "id": "ep_46_ut_293"
    },
    {
      "end": 5067680,
      "speaker": "Enrico Bertini",
      "start": 5023826,
      "text": "Yeah, we love you, as you know. Thanks a lot. Bye. Take care. Bye bye. Data story is supported by Tableau software, helping people see and understand their data get answers from interactive dashboards. Wherever you go for your free trial, visit Tableau software at T A B L E A U. Once again, Tableau software.com Datastories. Don't forget to put Datastories worries because it's very important that they know that you are coming from us. Thanks a lot for supporting us with this. Bye.",
      "id": "ep_46_ut_294"
    },
    {
      "end": 5072020,
      "speaker": "Robert Kosara",
      "start": 5069660,
      "text": "You, our.",
      "id": "ep_46_ut_295"
    }
  ],
  "confidence": 0.911403029060821,
  "audio_duration": 5072,
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_status_code": null,
  "webhook_auth": false,
  "webhook_auth_header_name": null,
  "speed_boost": false,
  "auto_highlights_result": null,
  "auto_highlights": false,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_audio_quality": null,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "content_safety": false,
  "iab_categories": true,
  "content_safety_labels": {
    "status": "unavailable",
    "results": [],
    "summary": {}
  },
  "language_detection": false,
  "language_detection_threshold": null,
  "language_confidence": null,
  "custom_spelling": null,
  "throttled": false,
  "auto_chapters": true,
  "summarization": false,
  "summary_type": null,
  "summary_model": null,
  "custom_topics": false,
  "topics": [],
  "speech_threshold": null,
  "speech_model": "best",
  "chapters": [
    {
      "summary": "Datastores is supported by Tableau software, helping people see and understand their data. Get answers from interactive dashboards wherever you go. Happy New year. Data stories number 46.",
      "gist": "Tableau Data Stories: Happy New Year!",
      "headline": "Datastores is supported by Tableau software, helping people see and understand data",
      "start": 240,
      "end": 70090,
      "id": "ep_46_ch_0"
    },
    {
      "summary": "The perfect episode for the new year is the year in review, and we have Andy Kirk and Robert Kosara. Maybe we can have a virtual fight online.",
      "gist": "Year in Review",
      "headline": "So the perfect episode for the new year is the year in review",
      "start": 71030,
      "end": 140920,
      "id": "ep_46_ch_1"
    },
    {
      "summary": "2014 was a hard year to get hold of, to get a real sense of what was the big changes. But in a sense, I think that reflects a field that is stabilizing. Academic side actually did really well this last year. There's a lot of stuff to talk about.",
      "gist": "A Year in the Life of Visualization",
      "headline": "We have a long list of things we want to talk about in 2014",
      "start": 141930,
      "end": 362460,
      "id": "ep_46_ch_2"
    },
    {
      "summary": "2014 was a bit of a nothing year from his perspective. But the kind of client list I've had in the last twelve months reflects to me at least a growing awareness of visualization as a thing. If nothing really really new or special is happening, it's not necessarily bad. It might actually mean that the old community and practice is growing.",
      "gist": "A New Era of Data Visualization",
      "headline": "Stephen Few says 2014 was a bit of a nothing year for visualization",
      "start": 366040,
      "end": 862174,
      "id": "ep_46_ch_3"
    },
    {
      "summary": "The economy in 255 charts on a scatterplot was just outstanding. What you see across a lot of these works now is this pure integration between interactivity and editorial perspective. There has been some backlash over the last films towards those long form journeys and pieces, but the majority are of good quality.",
      "gist": "The Future of Long Form Data",
      "headline": "Two of my favorite designs from the last year came from the upshot",
      "start": 862222,
      "end": 1213000,
      "id": "ep_46_ch_4"
    },
    {
      "summary": "It is a risk for an organisation to commit to a big, long form project. But I think this is a good sign because it means that people are ready to consume this kind of information. Can we say then that a big trend this year is going in depth?",
      "gist": "Longform in the future",
      "headline": "Moritz: It is a risk for an organisation to commit to long form project",
      "start": 1213120,
      "end": 1443550,
      "id": "ep_46_ch_5"
    },
    {
      "summary": "The visconference this last year in Paris was the first time they did it in Europe. I felt that the presentation quality was much better than in the years past. There were lots of smart thoughts around how to make research more accessible. Maybe that's another big positive trend that's finally academia and the rest of the world to get closer to each other.",
      "gist": "The VIPS Conference and the",
      "headline": "Robert: The visconference this last year in Paris was very well attended",
      "start": 1444690,
      "end": 1756612,
      "id": "ep_46_ch_6"
    },
    {
      "summary": "So we have Tamara Manson are here on the show. Now she's on Twitter and she wants to tweet and be part of the community. Her book is really good, by the way. It's really good and super helpful for me from the user task side.",
      "gist": "Tamara Manson on the Science of Visualizations",
      "headline": "Tamara Manson's book is super helpful from a visualization standpoint",
      "start": 1756756,
      "end": 1800380,
      "id": "ep_46_ch_7"
    },
    {
      "summary": "Andy: 2016 is the year for. the books, so people are still reading books. I've got a lot of unfinished business, unfinished content, but also a desire to publish in color, which would be nice. Alberto is publishing a new book, but I think his is more headed towards 2016.",
      "gist": "Book Review: 2016",
      "headline": "So should we talk about books in general? What happened last year",
      "start": 1801400,
      "end": 2057272,
      "id": "ep_46_ch_8"
    },
    {
      "summary": "There's been a little bit of a drying up of blog posts and possibly also new blog sites. Visualization still isn't present enough on the web. We should all get together one evening like 10:20 p. m. do a little hackathon.",
      "gist": "Boring on Blogs",
      "headline": "Can we talk about blogging? I just realized now we talked about books",
      "start": 2057466,
      "end": 2438258,
      "id": "ep_46_ch_9"
    },
    {
      "summary": "There's generally a big frustration with Internet comments. For instance, medium, like the blogging platform, they don't even allow comments. 2014 was the year of Alberto Cairo. Having more space than just a quick thing on Twitter is certainly a good thing.",
      "gist": "Comments on the Internet in 2014",
      "headline": "A big, like a big frustration with Internet comments is spam",
      "start": 2438274,
      "end": 2683420,
      "id": "ep_46_ch_10"
    },
    {
      "summary": "It would be nice to have like a few more podcasts. There's a big recommendation for me is reply all. It's about like Internet themes and Internet topics. Let's take a short break to talk about our sponsor. Datastores is supported by Tableau software.",
      "gist": "Tableau Data: Podcasts",
      "headline": "I think we do need more podcasts. No, seriously, I mean, we've been talking about blogs",
      "start": 2685240,
      "end": 2879760,
      "id": "ep_46_ch_11"
    },
    {
      "summary": "I don't think we've seen a great number of new tools in 2014. The headlines have been the continued growth and presence of raw from density design. Lyra is still something that I think is still in beta stage from Arvind. But my general concern is that it's really tough to build a software product.",
      "gist": "D3: The Future of Learning in 2014",
      "headline": "Should we move on to tools? I don't think we've seen many in 2014",
      "start": 2880380,
      "end": 3186578,
      "id": "ep_46_ch_12"
    },
    {
      "summary": "Trifacta is a good example of how an academic product can become a product on the market. One tool I was really impressed with was Mirador, a really nice tool for quickly exploring. But of course, I totally agree with what you're saying about academic software in general.",
      "gist": "An academic product becomes a commercial product",
      "headline": "Trifacta is an example of how an academic product can become a product",
      "start": 3186674,
      "end": 3371500,
      "id": "ep_46_ch_13"
    },
    {
      "summary": "Think we have to mention Tableau for Mac being a significant milestone of last year. Also, the smoothness of the transition. 8.3 also had the story points feature. I also use Tableau still a lot and it's really a solid piece.",
      "gist": "Tablum for Mac: A Significant Milestone",
      "headline": "Tabla for Mac was a significant milestone for Tableau last year",
      "start": 3371500,
      "end": 3465822,
      "id": "ep_46_ch_14"
    },
    {
      "summary": "I remember there were a lot of these charting made simple startups. But I don't feel like there's been many new ones of late. The whole automating infographics scene hopefully has dried up somewhat.",
      "gist": "What Happened to the Charting Explosion?",
      "headline": "I remember there were a lot of these charting made simple startups",
      "start": 3465966,
      "end": 3524420,
      "id": "ep_46_ch_15"
    },
    {
      "summary": "Data wrapper changed their model from being free to paying. A lot of small kind of independent newspapers are using that still for their web based graphics. It feels like it's got through that kind of infancy stage and has found its place.",
      "gist": "Data Wrapper and the Free Press",
      "headline": "Some startups have changed their model from being free to paying for content",
      "start": 3527240,
      "end": 3673920,
      "id": "ep_46_ch_16"
    },
    {
      "summary": "Another interesting tool is shiny by RSTudio, which is based on D3. You can directly code something that goes on to the web and there is interaction on top of it. I think it's a major step towards making R something that can be a little bit more interactive. Rise of the data scientists.",
      "gist": "What are the latest data visualization tools in R?",
      "headline": "On the web and general data visualization scene, there are few interesting tools",
      "start": 3677060,
      "end": 3882842,
      "id": "ep_46_ch_17"
    },
    {
      "summary": "There's still a lack of visual thinking in statistics and in data science. Many data scientists need help from visualization experts. I'm really surprised that there's still such a big divide between the two.",
      "gist": "Top Data Scientists: More Visual Thinking in Data Science",
      "headline": "There's still a lack of visual thinking in statistics and in data science",
      "start": 3882866,
      "end": 4137469,
      "id": "ep_46_ch_18"
    },
    {
      "summary": "One thing that really impressed me was the serial podcast. It's sort of an investigative, a reinvestigation of a murder case that happened 15 years ago. What I found really interesting is the strong first person perspective. I would recommend listening to the podcast and thinking about what that means for other types of media.",
      "gist": "The Making of a Serial Podcast",
      "headline": "One thing that impressed me was the serial podcast about a murder case",
      "start": 4140969,
      "end": 4371890,
      "id": "ep_46_ch_19"
    },
    {
      "summary": "For 2015, I'd love to see more stories built around visuals and data as opposed to word. I also think we will see great stuff from like natural scientists next year. Maybe traditional journalism still is even still to word focused.",
      "gist": "Top Tech Writers' Hopes and Nightmares for 2015",
      "headline": "Twitter users share their hopes and fears for 2015",
      "start": 4374790,
      "end": 4478236,
      "id": "ep_46_ch_20"
    },
    {
      "summary": "There is a big, big lack of statistical literacy, data literacy, visual literacy, however you want to call it. My hope is that there will be more resources to help people learn more about not only about visualizations, but also how to deal with data in general.",
      "gist": "What's to Do About Visualization in 2015?",
      "headline": "One of the themes that I'm hoping for next year is visualization literacy",
      "start": 4478268,
      "end": 4635728,
      "id": "ep_46_ch_21"
    },
    {
      "summary": "And just on the broader point of visualization, literacy. We're working on a research project, and this concludes in March of this year. Will there be a report from the research project? Reports, videos, presentations, all sorts stuff. And possibly podcasts.",
      "gist": "Top Visualization Literacy Issues",
      "headline": "We're working on a research project on visualization, literacy",
      "start": 4635824,
      "end": 4696030,
      "id": "ep_46_ch_22"
    },
    {
      "summary": "The last tweet was from Ben Jones, who said hopes for 2015 continued high level collaboration database across disciplines and tools. So let's hope that doesn't happen. That would be really bad for databases.",
      "gist": "#2015 Hopes for a Collaboration Database",
      "headline": "Ben Jones hopes for 2015 continued high level collaboration database across disciplines",
      "start": 4696070,
      "end": 4728500,
      "id": "ep_46_ch_23"
    },
    {
      "summary": "My last kind of prediction for 2015 would be a big showing from the Guardian and specifically the Guardian UK. There's more academic, more interest and more attention from academia, from the academic viz side in presentation. No big revolution, just continued evolution.",
      "gist": "Predictions for 2015",
      "headline": "My last kind of prediction for 2015 would be a big showing from the Guardian",
      "start": 4729800,
      "end": 5033900,
      "id": "ep_46_ch_24"
    },
    {
      "summary": "Data story is supported by Tableau software, helping people see and understand their data. Wherever you go for a free trial, visit Tableau software at T A B L E A U. Don't forget to put Datastories worries because it's very important.",
      "gist": "Tableau Software: Datastories",
      "headline": "Data story is supported by Tableau software, helping people see and understand data",
      "start": 5038320,
      "end": 5072020,
      "id": "ep_46_ch_25"
    }
  ],
  "disfluencies": false,
  "entity_detection": false,
  "sentiment_analysis": false,
  "sentiment_analysis_results": null,
  "entities": null,
  "speakers_expected": null,
  "summary": null,
  "custom_topics_results": null,
  "is_deleted": null,
  "episode_num": "46",
  "episode_metadata": {
    "speakers": [
      "Moritz Stefaner",
      "Enrico Bertini",
      "Robert Kosara",
      "Andy Kirk"
    ],
    "WPid": "234",
    "url": "https://datastori.es/podlove/file/568/s/feed/c/mp3/datastories-46.mp3",
    "episode_title": "Year 2014 Review w/ Robert Kosara and Andy Kirk"
  }
}