{
  "id": "70f8f49f-1e90-4be6-bd67-0426470125d9",
  "language_model": "assemblyai_default",
  "acoustic_model": "assemblyai_default",
  "language_code": "en_us",
  "status": "completed",
  "audio_url": "https://datastori.es/podlove/file/3628/s/feed/c/mp3/92-a-tribute-to-hans-rosling.mp3",
  "utterances": [
    {
      "end": 208734,
      "speaker": "Hans Rosling",
      "start": 160,
      "text": "And in the eighties, here you have Bangladesh, still among the African countries there, but not Bangladesh. It's a miracle that happens. In the eighties, the imams start to promote family planning, and they move up into that corner. And in nineties we have the terrible HIV epidemic that takes down the life expectancy of the African countries. And all the rest of the world moves up into the corner where we have long lives and small family, and we have a completely new world. So we did the software which displays it like this. Every bubble here is a country. This country over here is. This is China, this is India. The size of the bubble is the population. And on this axis here, I put fertility rate. Because my students, what they said when they looked upon the world and I asked them, what do you really think about the world? Well, I first discovered that the textbook was Tintin mainly. And they said, the world is still we and them, and we is western world, and them is third world. And what do you mean with western world? I said, well, that's long life in small family. And third world is short life in large family. So this is what I could display here. I put fertility rate here. Number of children per woman. 1234. Up to about eight children per woman. We have very good data since 1960, 219 60, about on the size of families in all countries. The error margin is narrow. Here I put life expectancy at birth from 30 years in some countries, up to about 70 years. And 1962, there was really a group of countries here that was industrialized countries, and they had small families and long lives. And these were the developing countries. They had large families and they had relatively short lives. Now, what has happened since 1962? We want to see the change. Are the students right? It's still two types of countries. Or have these developing countries got smaller families and they live here? Or have they got longer lives and live up there? Let's see. We start the world. And this is all un statistic that has been available. Here we go. Can you see there? It's China. They're moving against better health. They're improving there. All the green latin American countries, they are moving towards smaller families. Your yellow ones here are the arabic countries. And they get larger families, but they no longer lives. But not larger families. The Africans are the green down here. They still remain here. This is India. Indonesia is moving on pretty fast. And in the eighties, here you have Bangladesh. Still among the African countries there, but not Bangladesh. It's a miracle that happens. In the eighties. The imams start to promote family planning, and they move up into that corner and in nineties, we have the terrible HIV epidemic that takes down the life expectancy of the African countries and all the rest of the world moves up into the corner where we have long lives and small family and we have a completely new world.",
      "id": "ep_92_ut_0"
    },
    {
      "end": 221178,
      "speaker": "Enrico Bertini",
      "start": 220514,
      "text": "Wow.",
      "id": "ep_92_ut_1"
    },
    {
      "end": 222546,
      "speaker": "Moritz Stefaner",
      "start": 221306,
      "text": "Hey, Moritz.",
      "id": "ep_92_ut_2"
    },
    {
      "end": 223974,
      "speaker": "Enrico Bertini",
      "start": 222730,
      "text": "Hey, Enrico.",
      "id": "ep_92_ut_3"
    },
    {
      "end": 226034,
      "speaker": "Moritz Stefaner",
      "start": 224674,
      "text": "That was due, right?",
      "id": "ep_92_ut_4"
    },
    {
      "end": 226706,
      "speaker": "Enrico Bertini",
      "start": 226114,
      "text": "Yeah, yeah.",
      "id": "ep_92_ut_5"
    },
    {
      "end": 240294,
      "speaker": "Moritz Stefaner",
      "start": 226770,
      "text": "I mean, that's Hans Rosling and his famous first that talk. And we almost felt obliged to organize some sort of tribute to him. Right.",
      "id": "ep_92_ut_6"
    },
    {
      "end": 266844,
      "speaker": "Enrico Bertini",
      "start": 240454,
      "text": "Yeah. Unfortunately, he passed away on February 7. And, yeah, he was one of the most influential figures for data visualization, especially in promoting statistics to people who thought they might not be interested in statistics and data visualization. And, yeah, he was just an amazing person. So we dedicate one episode to him and try to look back a bit what he achieved. Have a few commentaries from other people as well.",
      "id": "ep_92_ut_7"
    },
    {
      "end": 298254,
      "speaker": "Moritz Stefaner",
      "start": 266924,
      "text": "Yeah, yeah. I have to say that in organizing this episode, I mean, when I heard of his death, I was really sad. I'm still very sad. But then me and you, we've been playing his talks, right, to prepare the episode, and he made us laugh all the time. And he had this incredible ability of let people laugh with statistics and talking about extremely serious and important events.",
      "id": "ep_92_ut_8"
    },
    {
      "end": 300466,
      "speaker": "Hans Rosling",
      "start": 300154,
      "text": "And.",
      "id": "ep_92_ut_9"
    },
    {
      "end": 305722,
      "speaker": "Moritz Stefaner",
      "start": 300490,
      "text": "Giving a positive message. So that's really, I don't know, fantastic contribution.",
      "id": "ep_92_ut_10"
    },
    {
      "end": 330778,
      "speaker": "Enrico Bertini",
      "start": 305818,
      "text": "Yeah. And he was a great storyteller and he really knew how to engage people. But also, I really appreciate his points were often quite complex or quite nuanced. It's not that he was reinforcing stereotypes about making things look simple, which are not simple, actually, quite to the contrary. He convinced us quite often that things are a bit more complicated than they look.",
      "id": "ep_92_ut_11"
    },
    {
      "end": 331850,
      "speaker": "Moritz Stefaner",
      "start": 330866,
      "text": "Yeah, yeah.",
      "id": "ep_92_ut_12"
    },
    {
      "end": 337642,
      "speaker": "Enrico Bertini",
      "start": 331882,
      "text": "Or that we might think we know that there's a first world and third world and in fact, there's a continuum. Right.",
      "id": "ep_92_ut_13"
    },
    {
      "end": 338458,
      "speaker": "Moritz Stefaner",
      "start": 337698,
      "text": "Yeah, yeah.",
      "id": "ep_92_ut_14"
    },
    {
      "end": 343410,
      "speaker": "Enrico Bertini",
      "start": 338506,
      "text": "And these are pretty powerful thoughts and he really demonstrated these.",
      "id": "ep_92_ut_15"
    },
    {
      "end": 343898,
      "speaker": "Moritz Stefaner",
      "start": 343522,
      "text": "Yeah.",
      "id": "ep_92_ut_16"
    },
    {
      "end": 358960,
      "speaker": "Enrico Bertini",
      "start": 343946,
      "text": "Complex ideas with data, but in such an exciting and engaging way that everybody was immediately hooked. You know, it's like you listen to him for 10 seconds and you. You want to know, like, yeah, how will this end? Like, what is he doing there? Yeah, who's this crazy guy?",
      "id": "ep_92_ut_17"
    },
    {
      "end": 399874,
      "speaker": "Moritz Stefaner",
      "start": 359032,
      "text": "Yeah. He made it possible to expose, in an incredible way the big gap between what? Intuitions about reality and reality. And there are all sorts of gaps like this out there. And I think it's still such a strong message and it's going to be very strong for many years. Right. I mean, that's so important. Of course, I think he had so much influence on everyone in visualization and, I don't know, he had lots of influence on me. I'm sure he had influence on you and everyone else in the field.",
      "id": "ep_92_ut_18"
    },
    {
      "end": 462414,
      "speaker": "Enrico Bertini",
      "start": 400694,
      "text": "Absolutely. And there's millions of people, I think, who got excited about statistics just by watching him. And I think his influence cannot be underestimated. He was mostly a professor for statistics and. But also health. And so he was a physician. Physician, practicing physician as well at Karolinska Institute. And what also many people, I think don't really know is that he helped develop or develop the trendilizer software that was later acquired by Google. And he basically also kicked off a whole public data movement, let's say, at Google. And the fact that a lot of public datasets are now available and really documented, I think also can be attributed to him. You can find a lot of these activities on his Gapminder website and also these activities will go on. I think his family and a larger circle of people will continue these activities.",
      "id": "ep_92_ut_19"
    },
    {
      "end": 514624,
      "speaker": "Moritz Stefaner",
      "start": 462494,
      "text": "Yeah. And I think it's important to mention that he was helped a lot by his son Ola and his daughter in law Anna. And I think they were acting more behind the scenes. Right. And he was more the character and I mean, the way he managed to play data, as I said before, I mean, he makes me laugh. And he still is very serious and invented a lot of different ways of communicating data. Right. I mean, originally with trendalizer, the software, but then he kind of like became more extreme, right. Using objects of different types. Coming to a talk with a washing machine.",
      "id": "ep_92_ut_20"
    },
    {
      "end": 519344,
      "speaker": "Enrico Bertini",
      "start": 515284,
      "text": "And he once swallowed a sword.",
      "id": "ep_92_ut_21"
    },
    {
      "end": 520824,
      "speaker": "Moritz Stefaner",
      "start": 519924,
      "text": "Swallow sword.",
      "id": "ep_92_ut_22"
    },
    {
      "end": 531740,
      "speaker": "Enrico Bertini",
      "start": 523004,
      "text": "There's also a fantastic 1 minute or 52nd TeD talk he gave just with stones. We can briefly listen to that one. Shall we? Shall we listen?",
      "id": "ep_92_ut_23"
    },
    {
      "end": 532628,
      "speaker": "Moritz Stefaner",
      "start": 531772,
      "text": "Yeah, let's do that.",
      "id": "ep_92_ut_24"
    },
    {
      "end": 535838,
      "speaker": "Enrico Bertini",
      "start": 532716,
      "text": "It's amazing. But you have to watch it on YouTube as well. But here's the sound.",
      "id": "ep_92_ut_25"
    },
    {
      "end": 582224,
      "speaker": "Kim Rees",
      "start": 535956,
      "text": "X means unknown, but the world is pretty known. It's 7 billion people. We have seven stones. 1 billion can save money to fly abroad on holiday every year. 1 billion can save money to keep a car or buy a car. And then 3 billion they save money to be able to buy a bicycle or perhaps a two wheeler. And 2 billion they are busy saving money to buy shoes. In the future they will get richer and these people will move over here. These people will move over here. We will have 2 billion more in the world like this. And the question is whether the rich people over there are prepared to be integrated in a world with 10 billion people. That was the shortest TeD talk ever given.",
      "id": "ep_92_ut_26"
    },
    {
      "end": 590104,
      "speaker": "Enrico Bertini",
      "start": 588884,
      "text": "Fantastic.",
      "id": "ep_92_ut_27"
    },
    {
      "end": 607482,
      "speaker": "Moritz Stefaner",
      "start": 590724,
      "text": "Yeah. He was an amazing actor. Yeah. I think my big hope. I think this is something that Ola Rosling wrote right after his death in a message. There are lots of potential Hans Roslings out there.",
      "id": "ep_92_ut_28"
    },
    {
      "end": 608010,
      "speaker": "Enrico Bertini",
      "start": 607538,
      "text": "Yeah.",
      "id": "ep_92_ut_29"
    },
    {
      "end": 631524,
      "speaker": "Moritz Stefaner",
      "start": 608122,
      "text": "So I really hope that his example is going to inspire many, many, many more people also in trying to do something similar and, yeah, kind of like get the role of presenting data the same way or other ways that Hans Rosling did it, because there's such a big need of having this kind of people out there.",
      "id": "ep_92_ut_30"
    },
    {
      "end": 666530,
      "speaker": "Enrico Bertini",
      "start": 631644,
      "text": "Yeah, yeah, absolutely. So, yeah, just to celebrate his heritage, we also asked a few other people to contribute short snippets to the show. We were not able to organize a big roundtable, but we have a few, five short segments from five friends of the show and big admirers of his work. And the first one is from Kim Rees from periscopic. And, yeah, she tells us a bit about what Hans Rosling and his work meant to her and periscopic as a whole. So let's listen to that one.",
      "id": "ep_92_ut_31"
    },
    {
      "end": 767664,
      "speaker": "Andy Kirk",
      "start": 666682,
      "text": "Hi, this is Kim Rees from Periscopic. We were very saddened to hear about the passing of Hans Rosling. Like many data visualization firms, we've been inspired by his infectious enthusiasm for numbers and for his ability to communicate complexity using data. We've also benefited directly from Hans work in the very early years of periscopic. It was quite an educational process to explain the function and the importance of data visualization to potential clients. It can be very frustrating at times. And then one day we were surprised. We were approached by a conservation biologist to help him transform his research into a data visualization. And he told us that he had watched this TED talk by a guy named Hans Rosling and asked us if we could make something like that. So it was pretty exciting. We were just thrilled that Hans talk had reached someone outside of the Dataviz world. And so it was really exciting to hear that. And we got the project and it really became our breakout work that put us on the map as a Dataviz firm. It was very much inspired by Hans animated bubble chart, and we also really strived to communicate as clearly and succinctly as Hans might. So it was very inspirational to us. And Hans has always been very influential to us as a firm, both as someone who is extremely passionate about data and also as someone who is very passionate about making a positive change in the world.",
      "id": "ep_92_ut_32"
    },
    {
      "end": 790186,
      "speaker": "Enrico Bertini",
      "start": 769084,
      "text": "Yeah, good point. Yeah. The passion is really what you could really feel his wholehearted passion about the topics he was talking about. I think that's a big part of it. Kim's comment reminds me I was also once commissioned to remix one of his works, which was interesting, like, in a manner.",
      "id": "ep_92_ut_33"
    },
    {
      "end": 791986,
      "speaker": "Moritz Stefaner",
      "start": 790210,
      "text": "I remembered that form it.",
      "id": "ep_92_ut_34"
    },
    {
      "end": 799642,
      "speaker": "Enrico Bertini",
      "start": 792050,
      "text": "Yeah. And so it was the same data set as in the introductory talk, fertility and life expectancy.",
      "id": "ep_92_ut_35"
    },
    {
      "end": 804866,
      "speaker": "Moritz Stefaner",
      "start": 799698,
      "text": "Did you actually call it Hans Rosling remixed or something like that? I vaguely remembered that, yeah.",
      "id": "ep_92_ut_36"
    },
    {
      "end": 805138,
      "speaker": "Robert Kosara",
      "start": 804890,
      "text": "Yeah.",
      "id": "ep_92_ut_37"
    },
    {
      "end": 860974,
      "speaker": "Enrico Bertini",
      "start": 805186,
      "text": "So that's basically. Yeah. It was an explicit commission to remix his work, like, you know, like a musical remix, kind of interesting. And so I was really thinking about, how can I put these dynamic charts? So had these bubble charts and everything's moving, and especially the bubble charts with the trails. I think that was also quite unique. And they look kind of insane. They work really well when he's, like, working with them, but I didn't know how to reproduce that dynamism in print. But in the end, I made something that's very close. Yeah. So. And it looked like a bit like sperm. I think that was a good match for the topic with the fertility and so on. Yeah. But it's. I think he really. He had a few really iconic, not just talks, but also data visualizations that everybody remembers, and the animated bubbles are one of them.",
      "id": "ep_92_ut_38"
    },
    {
      "end": 872368,
      "speaker": "Moritz Stefaner",
      "start": 861434,
      "text": "I'm pretty sure many benefited from Hans Rosling's popularity. He had a huge impact also in popularizing vase in general. Right. So, yeah, yeah, absolutely.",
      "id": "ep_92_ut_39"
    },
    {
      "end": 885616,
      "speaker": "Enrico Bertini",
      "start": 872416,
      "text": "I think along with Edward Tufte, I think, you know, probably half of the people in Viz will have encountered data visualization first through Hans Rosling or Edward Tufte or maybe even more. Maybe even more.",
      "id": "ep_92_ut_40"
    },
    {
      "end": 886088,
      "speaker": "Moritz Stefaner",
      "start": 885640,
      "text": "I agree.",
      "id": "ep_92_ut_41"
    },
    {
      "end": 906454,
      "speaker": "Enrico Bertini",
      "start": 886176,
      "text": "So, yeah, that's such a huge, huge influence. Yeah. Next up is Andy Kirk, friend of the show, blogger, writer and teacher, educator and teacher, mostly, yeah. From the UK. Let's hear what he has to say.",
      "id": "ep_92_ut_42"
    },
    {
      "end": 1145064,
      "speaker": "Kennedy Elliott",
      "start": 906574,
      "text": "Hi, Enrico and Moritz, this is Andy Kirk. Thanks ever so much for producing this richly deserved tribute episode to gather the memories and acknowledge the legacy of Professor Hans Rosling. I won't claim to remember exactly when I first came across his work. It definitely would have been through his 2006 TED Talk, and it would definitely have been around ten years ago, back in 2007. And it was back then when I first discovered visualisation as a subject ten years on. And I still genuinely, hugely enjoy watching that famous horse racing style commentary. I can almost recite word for word passages like, it's a miracle that happens. In the 1980s, the imams start to promote family planning, things like that just always, you know, just stuck with me. The passion that he portrayed in that famous video, that still brings me pleasure to watch it today. But the legacy for me of Professor Rosling's work is actually told more through the impact I've seen and witnessed in other people. As somebody who spends a lot of time, professional time, delivering training workshops, and I guess in my capacity as the editor of visualizing data.com, i'm fortunate to come into contact with lots of people who are really beginning their journey, their learning journey in this field. And I get lots of emails and have lots of chats with people who are genuinely sort of wide eyed with excitement and enthusiasm about find a subject or a pursuit or a discipline that really resonates with them and their sensibilities. And down the years, I can tell you, I've had so many discussions, I've had so many, I've met so many different people who have landed in this subject because of, and thanks to Professor Rosling and through his many celebrated talks, not just the TED talk and different tv appearances, they've been a critical entry point for people discovering the subject. And it showed them that, that data, that stats, that communicating these things can be powerful, can be impactive and also fun. And his inescapable enthusiasm and genuine positivity about the world at large through these videos is really the kind of Trojan horse that helped and helps put visualization into a much more mainstream consciousness. And actually, just 15 minutes ago, I genuinely received an email from a lady who'd been on to attend one of my recent workshops. And she sent me a link to an article about Hans Rosling. You might know this mister and his work. I just discovered it and thought I'd share it. And that's kind of typical of a lot of these kind of entry points that people have with his work. Now, looking back, there's been times when I've received such emails with links to his work, with links to his videos. And people have come up to me with their laptops to show me a video. And actually, looking back, I've probably instinctively reacted with a little bit of contempt, along the lines of, why are you sending me this? Of course I've seen this. Of course I know Hans Rosling. Of course everyone in visualization knows about this guy already. But it's easy to forget that others have not. It's easy to forget that we too were once in that position, discovering with excitement what we'd seen him portray these stats with the visualizations, with the commentaries. We also were excited. And it's easy to take these huge contributions, these huge milestones in the lineage of this subject for granted. So a huge thank you from me and on behalf of other people, I've come across to Professor Hans Rosling, your wonderful legacy will live long, and I want to just express best wishes to your family and to all your friends. Thanks very much.",
      "id": "ep_92_ut_43"
    },
    {
      "end": 1179094,
      "speaker": "Moritz Stefaner",
      "start": 1145404,
      "text": "Yeah, that's what we were just saying. Right. It's like so many people got in contact with Vis through watching Hans Rosling. Absolutely. So one thing I like about what Andy says is the timing that Hans Rosling had when he was talking in his talks. Right. The way he takes the right pauses and then the pitches, and then he stops again a little bit, so that the timing was just perfect.",
      "id": "ep_92_ut_44"
    },
    {
      "end": 1199438,
      "speaker": "Enrico Bertini",
      "start": 1179454,
      "text": "Yeah. Yeah. Almost like a musician, a big data impresario. And nobody has done it. Nobody has done it like this before. I think that's also people underestimate, like, how. How mind blowing this was when people saw it for the first time. Because nobody ever presented stats like that.",
      "id": "ep_92_ut_45"
    },
    {
      "end": 1200302,
      "speaker": "Moritz Stefaner",
      "start": 1199486,
      "text": "Exactly.",
      "id": "ep_92_ut_46"
    },
    {
      "end": 1218470,
      "speaker": "Enrico Bertini",
      "start": 1200438,
      "text": "It's a bit like what Feynman did for physics or exactly thinking about these things or, like, talking about these things in such an unprecedented way. And I think that's the big achievement here, to just not caring about how you normally talk about these things. Right.",
      "id": "ep_92_ut_47"
    },
    {
      "end": 1259592,
      "speaker": "Moritz Stefaner",
      "start": 1218622,
      "text": "It's literally a performance. Right. And so I was talking the other day with a friend of mine. He's also a professor here at NYU, but he's at the teach school of Art, and he actually teaches actors, and he's an actor himself. I was like, did you ever see Hans Rosling's talk? And was like, no, do it, please. Do it now. And then tell me what you think about it. I think that's such an interesting place, right? And space to explore. Data performance is something. So I think, what do we have next? We have Robert Kosara, right?",
      "id": "ep_92_ut_48"
    },
    {
      "end": 1260256,
      "speaker": "Enrico Bertini",
      "start": 1259648,
      "text": "Yep.",
      "id": "ep_92_ut_49"
    },
    {
      "end": 1263144,
      "speaker": "Moritz Stefaner",
      "start": 1260400,
      "text": "From Eagereyes and Tableau software.",
      "id": "ep_92_ut_50"
    },
    {
      "end": 1264822,
      "speaker": "Enrico Bertini",
      "start": 1263224,
      "text": "Let's hear what he has to say.",
      "id": "ep_92_ut_51"
    },
    {
      "end": 1403874,
      "speaker": "H",
      "start": 1265008,
      "text": "Hi, this is Robert Kosara. I still remember the first time I saw Hans Rosling's TED talk in 2006. This was before Twitter and before social media, certainly for me. And people were emailing this around, and they were saying, look, you have to see this. You're interested in how to present data. You have to watch this guy. Just be fun and exciting and interesting with data and talking about the world using numbers. And I watched it several times that day, and I was just blown away. I mean, this was somebody who clearly knew how to make data exciting and how to tell people about the world using data. And this was really inspiring. I think this actually inspired a lot of work in data visualization and in a lot of journalism, too. I know a lot of people, journalists, who have said that they wouldnt be where they are right now. If they hadnt seen Rosling do his presentation and do it using data, that they got interested in doing this and trying to do this themselves. In a way, I think that what Rosling did and what Gapminder did, we should, of course, always remember that this is not just Hans Rosling. This is also his son, Ola, and his daughter in law, Anna. That they also kind of continued the work that people like Otto Neurath had done many years before that, but it had really not been picked up at all in 50 or 60 years. So it's really exciting to see people wanting to inform the world, or rather people about the world, using numbers and using data and trying to dispel a lot of the myths that, that they're out there and that are untrue, but that just stick around despite the data saying that they're not actually true anymore or that they never were true perhaps in the first place. So I think what I'm taking away from Rosling and from his work and his enthusiasm and his positive outlook is that this is possible, that we can inform the world, that we can hopefully change the world, and that we can make the world a better place using numbers and using data if we do it right.",
      "id": "ep_92_ut_52"
    },
    {
      "end": 1449004,
      "speaker": "Moritz Stefaner",
      "start": 1404514,
      "text": "Yeah. So I really relate deeply with what Robert said here, especially being a researcher and being in academia myself. So I had a very similar experience when I watched Hans Rosling's talk for the first time and I discovered his work. I was like, oh, my God. We in academia think that visualization is mostly about analysis. But look at this guy. He's communicating information with stats and visualization, and it's so powerful. Right? It's so powerful. And it's one of those things that in retrospect, is so obvious, right. But back then for me was like, what is that?",
      "id": "ep_92_ut_53"
    },
    {
      "end": 1453004,
      "speaker": "Enrico Bertini",
      "start": 1451264,
      "text": "What is he even doing?",
      "id": "ep_92_ut_54"
    },
    {
      "end": 1467634,
      "speaker": "Moritz Stefaner",
      "start": 1453704,
      "text": "Yeah. And what am I doing? Right? Because now you start comparing your work to his work, and it's like, this guy is incredibly impactful with this little bubble chart, right?",
      "id": "ep_92_ut_55"
    },
    {
      "end": 1469942,
      "speaker": "Enrico Bertini",
      "start": 1468174,
      "text": "Right. Yeah.",
      "id": "ep_92_ut_56"
    },
    {
      "end": 1491560,
      "speaker": "Moritz Stefaner",
      "start": 1470038,
      "text": "I don't know. I think being so powerful with a little bubble chart is something that I clearly remember being, I don't know, very surprising to me. It's like, look what a person can do with a single bubble chart, right, if you do it right, so that, I don't know, left a very strong impression on me.",
      "id": "ep_92_ut_57"
    },
    {
      "end": 1496472,
      "speaker": "Enrico Bertini",
      "start": 1491632,
      "text": "Yeah. And this whole idea that presentation is part of data visualization.",
      "id": "ep_92_ut_58"
    },
    {
      "end": 1497304,
      "speaker": "Moritz Stefaner",
      "start": 1496648,
      "text": "Yeah.",
      "id": "ep_92_ut_59"
    },
    {
      "end": 1517590,
      "speaker": "Enrico Bertini",
      "start": 1497424,
      "text": "Was not that much discussed in 2006. Right. So this is something that academia only caught up on five years ago, maybe, you know, five years later, not even yet, the big storytelling, discussion, discussions, and how presentation can affect, like, what people read from a chart or not. And this was. Yeah, it was totally new.",
      "id": "ep_92_ut_60"
    },
    {
      "end": 1518142,
      "speaker": "Moritz Stefaner",
      "start": 1517742,
      "text": "Yeah.",
      "id": "ep_92_ut_61"
    },
    {
      "end": 1520154,
      "speaker": "Enrico Bertini",
      "start": 1518198,
      "text": "Sounds crazy today, but it's true.",
      "id": "ep_92_ut_62"
    },
    {
      "end": 1528374,
      "speaker": "Moritz Stefaner",
      "start": 1522694,
      "text": "Yeah. Okay, so shall we move on to the next one?",
      "id": "ep_92_ut_63"
    },
    {
      "end": 1529238,
      "speaker": "Enrico Bertini",
      "start": 1528454,
      "text": "Yeah, sure.",
      "id": "ep_92_ut_64"
    },
    {
      "end": 1535558,
      "speaker": "Moritz Stefaner",
      "start": 1529326,
      "text": "Okay. Next one is Kennedy Elliott from Washington Post.",
      "id": "ep_92_ut_65"
    },
    {
      "end": 1807564,
      "speaker": "Robert Kosara",
      "start": 1535686,
      "text": "Hi, I'm Kennedy Elliott, and I'm going to talk about my favorite memory of Hans Roslyn. My favorite memory of Hans Rosin is probably, like for many other people, the first time I saw his famous hologram video. When I saw it for the first time, I was just starting out in the news graphics space, and I was a new developer at the AP. And this is right around the same time that data visualization is getting really big in news graphics, and everyone's trying to figure out how to negotiate large amounts of data and serve it on a browser. And JavaScript is also starting to get really popular, and suddenly you have D3 and you have a ton of other tools for chart building, and you get very excited when you can render a chart or make a little object move across the screen with code. But when I saw Hans video, it really altered my sense of what I am supposed to do as a journalist and as a visual storyteller. And we've all seen the video, so we know what happens. But the most important part is that he is annotating the data. He gives us contact context to what we're seeing, and tells us what we should be taking away from the story. He's extremely passionate and knowledgeable, and so he's a lot of fun to watch. But it's more than that. There are deliberate choices that he makes to the production of the video that were remarkable and unprecedented. It's him behind the visualization, a real person, not a narration or an annotation. And he's throwing his body into his explanations, waving his hands over his head and crouching on the floor. He's almost got this whispery shout as he's talking. The background looks like this dark urban loft, not a polished, sterile studio. Perhaps the most interesting thing is that before he performs, the camera follows him up the stairs to the room. Instead of just starting the video off with him in the proper position, he even cuts to the camera crew. And this is all telling us that this is a story with humans behind it, not just a data set. The phrase humanizing the data is a concept that's so often talked about in news graphics that is almost cliche, but this is the ultimate example of humanizing the visualization, not by changing the shape of the geometries on the screen to perhaps a silhouette of a person, but by putting a human into the storytelling itself. You see this video as a young practitioner, and suddenly you have to rethink everything. The key, you realize, is not the code that you use. It's how the people want to take in the information. They want to be told a story. And that is a very tricky thing. It's hard to tell successful stories. It's a craft, and Hans got it right. I hope we can all remember what the old Gapminder site looked like. It was the kind of graphical database that we probably all created at some point, and it was how people told data stories. You know, in 2010, we'd create a database and give it some kind of minimal graphic interface and let the reader do all the work. And this is obviously ineffectual, and it's not really storytelling. And the Gapminder site doesn't really does this. Pretty much it's on its own. It's not really that remarkable. It's not only a database with a lot of hidden stories, but it's also a scatter plot, which we know is a very hard visualization for people to read. It's not just that, but it's a three very scatter plot, which means that the size of the bubbles change and that only further obscures some of the trends. So the Gapminder database is not really any more notable than the next visual database. It's Hans that makes the difference. In fact, years later, when I was doing research for my Openviz talk, I came across a study called effectiveness of animation and trend visualization. The researchers were intrigued by the notion of a lively speaker that Hans had created in his hologram video. And they studied the effectiveness of three graphical techniques that were similar, but did not involve a lively speaker. Interestingly enough, the three graphical techniques that the researcher studied are widely being used today. And I think that that is precisely because we cannot give the same kind of treatment to our graphics as Hans did to his. Thank you.",
      "id": "ep_92_ut_66"
    },
    {
      "end": 1889710,
      "speaker": "Moritz Stefaner",
      "start": 1807984,
      "text": "Yeah. Kennedy also talks about this idea of watching Hans for the first time and having to rethink everything that's exactly the same, the same experience that almost everyone had. And I really liked the fact that Shia liked the idea that the key is not the code and the idea of humanizing the data. I think in retrospect, looking at this thing today looks pretty obvious that there is a need for humanizing the data, and many people are trying to do that. But back then, that was totally, totally novel. And I also like the fact that Kennedy is mentioning this research work on the role of animation in base. And, yeah, even in terms of animation. So, on the research side, animation has always been considered some kind of bad way of visualizing data. And then Hans Rosling comes on stage and shows us that actually, animation can be a perfect tool to convey not only information, but also emotions and a narrative. And she's correct when she says that it's been adopted in many, many other situations and conditions. So, thanks so much, Kennedy.",
      "id": "ep_92_ut_67"
    },
    {
      "end": 1894778,
      "speaker": "Enrico Bertini",
      "start": 1889822,
      "text": "And here's our final contribution from Alberto Cairo.",
      "id": "ep_92_ut_68"
    },
    {
      "end": 2052540,
      "speaker": "I",
      "start": 1894906,
      "text": "Hi, everyone. Well, first of all, thank you for letting me be part of this initiative, which is a tribute to Professor Hans Rosling. So I would like to say a few words about why I believe that his work is so relevant and so important for what we do nowadays when it comes to data visualization and data communication in general, and spreading the word among the general public about. About how important it is to use evidence to run better lives. I think that the only thing that you need to do to understand how an impact professor Roslyn made in the world is to take a look at some of his lectures, particularly the one that he made at the TED conferences, I believe, back in 2006, which is the one that I also believe that made him a worldwide celebrity. There are several things that we can learn from that lecture. The first one is, I believe that when you are presenting important information to people, particularly data that usually looks cold and faceless to the general public, you need to show your own enthusiasm about the data that you are presenting. And that's something that he did really, really well. I mean, he jumped around the stage. He showed his emotions about what the data, the stories, the data that it was revealing, etcetera. When I interviewed him for my first book, he told me that to get inspiration for his talks, he imagined that he was not presenting the data to an audience made of academics, but he imagined that he was broadcasting a soccer game. And you can notice that inspiration in his lectures. And then we can also learn about, from Professor Rosling, how important it is to, particularly in these times that we are living through, how important it is to stick to a facts based worldview, and how important it is to spread the word to the general public about how relevant and how important it is to them to consider facts and consider evidence, and learn how to reason logically and scientifically in all areas of life, just to run better lives. And so that's basically it. I think that that Hans Rosling's passing is a great loss for our community. Data visualization, but also data journalism, data communication, but it's also a great loss for the world in general.",
      "id": "ep_92_ut_69"
    },
    {
      "end": 2087283,
      "speaker": "Moritz Stefaner",
      "start": 2052732,
      "text": "So Alberto was our final contributor. So I want to conclude this part by saying a big thank you to all of these vis experts who agreed on recording a snippet for the show. Thanks so much. That's highly appreciated. So. Well, that's our tribute to Hans Rosling. We thought it would be nice to have a few people just record a few words on his impact and legacy and try to make it personal.",
      "id": "ep_92_ut_70"
    },
    {
      "end": 2105034,
      "speaker": "Enrico Bertini",
      "start": 2089503,
      "text": "Just such an amazing guy. And, yeah, as you say, let's hope there's a lot more like him in the future. I'm sure he. I know he did have a big impact, and he caused a lot of good things to happen.",
      "id": "ep_92_ut_71"
    },
    {
      "end": 2141084,
      "speaker": "Moritz Stefaner",
      "start": 2105614,
      "text": "Yeah. I just want to say that, as I said at the beginning, I mean, that's clearly a sad episode in the sense that, I mean, we are talking about his death, and I'm still very deeply saddened by his death. But once again, I think we also have to be happy that this man lived, and he also had not only a big impact, but such a positive, positive attitude and message. And I really want to stress that having a positive attitude and a positive message is such a powerful thing. Such a powerful thing. So.",
      "id": "ep_92_ut_72"
    },
    {
      "end": 2169976,
      "speaker": "Enrico Bertini",
      "start": 2141204,
      "text": "Absolutely, yeah. And I think we can end with his. So he produced a tv show together with BBC, and this one's amazing. It's called the Joy of Stats. And, yeah, we'll play a short snippet and, yeah, then you should watch all his talks. Maybe do a long night of Hans Rosling talks in his honor. So thank you, Hans.",
      "id": "ep_92_ut_73"
    },
    {
      "end": 2171160,
      "speaker": "Moritz Stefaner",
      "start": 2170080,
      "text": "Thank you, Hans Rosling.",
      "id": "ep_92_ut_74"
    },
    {
      "end": 2173164,
      "speaker": "Enrico Bertini",
      "start": 2171232,
      "text": "And we are out.",
      "id": "ep_92_ut_75"
    },
    {
      "end": 2288450,
      "speaker": "Kim Rees",
      "start": 2177144,
      "text": "Visualization is right at the heart of my own work, too. I teach global health, and I know having the data is not enough. I have to show it in ways people both enjoy and understand. Now I'm going to try something I've never done before, animating the data in real space with a bit of technical assistance from the crew. So here we go. First, an axis for health. Life expectancy from 25 years to 75 years. And down here, an axis for wealth. Income per person, 404,000 and $40,000. So down here is poor and sick, and up here is rich and healthy. Now, I'm going to show you the world 200 years ago in 1810. Here come all the countries. Europe, brown, Asia, red. Middle east, green. Africa, south of Sahara, blue. And the Americas, yellow. And the size of the country bubbles show the size of the population and in 1810, it was pretty crowded down there, wasn't it? All countries were sick and poor. Life expectancy were below 40 in all countries, and only UK and the Netherlands were slightly better off, but not much. And now, why start the world? The industrial revolution makes countries in Europe and elsewhere move away from the rest. But the colonized countries in Asia and Africa, they are stuck down there. And eventually the western countries get healthier and healthier. And now we slow down to show the impact of the First World War and the Spanish flu epidemic.",
      "id": "ep_92_ut_76"
    },
    {
      "end": 2290054,
      "speaker": "Hans Rosling",
      "start": 2288602,
      "text": "What a catastrophe.",
      "id": "ep_92_ut_77"
    },
    {
      "end": 2394544,
      "speaker": "Kim Rees",
      "start": 2291154,
      "text": "And now I speed up through the 1920s and the 1930s, and in spite of the Great Depression, western countries forge on towards greater wealth and health. Japan and some others try to follow, but most countries stay down here. Now, after the tragedies of the second world war, we stop a bit to look at the world. In 1940, 819 48 was a great year. The war was over. Sweden topped the medal table at the Winter Olympics, and I was born. But the differences between the countries of the world was wider than ever. United States was in the front, Japan was catching up. Brazil was way behind. Iran was getting a little richer from oil, but still had short lives. And the Asian giants, China, India, Pakistan, Bangladesh and Indonesia, they were still poor and sick down here. But look what is about to happen. Here we go again. In my lifetime, former colonies gained independence, and then finally they started to get healthier and healthier and healthier. And in the 1970s, then countries in Asia and Latin America started to catch up with the western countries. They became the emerging economies. Some in Africa follows. Some Africans were stuck in civil war and others hit by HIV. And now we can see the world today in the most up to date statistics. Most people today live in the middle, but there are huge difference at the same time between the best of countries and the worst of countries. And there are also huge inequalities within countries. These bubbles show country averages, but I can split them. Take China, I can split it into provinces.",
      "id": "ep_92_ut_78"
    },
    {
      "end": 2397144,
      "speaker": "Hans Rosling",
      "start": 2395084,
      "text": "There goes Shanghai.",
      "id": "ep_92_ut_79"
    },
    {
      "end": 2455474,
      "speaker": "Kim Rees",
      "start": 2398084,
      "text": "It has the same wealth and health as Italy today. And there is the poor inland province, Guaishou. It is like Pakistan. And if I split it further, the rural parts are like Ghana in Africa. And yet, despite the enormous disparities, today we have seen 200 years of remarkable progress. That huge historical gap between the west and the rest is now closing. We have become an entirely new, converging world. And I see a clear trend into the future. With aid, trade, green technology and peace, it's fully possible that everyone can make it to the healthy, wealthy corner. Well, what you have seen in the last few minutes is a story of 200 countries shown over 200 years and beyond. It involved plotting of 120,000 numbers. Pretty neat, huh?",
      "id": "ep_92_ut_80"
    },
    {
      "end": 2470374,
      "speaker": "Moritz Stefaner",
      "start": 2462774,
      "text": "Hey guys, thanks for listening to data stories again. Before you leave, here are a few ways you can support the show and get in touch with us.",
      "id": "ep_92_ut_81"
    },
    {
      "end": 2485060,
      "speaker": "Enrico Bertini",
      "start": 2470454,
      "text": "First, we have a page on Patreon where you can contribute an amount of your choosing per episode. As you can imagine, we have some costs for running the show and we would love to make it a community driven project. You can find the page@patreon.com Datastories and.",
      "id": "ep_92_ut_82"
    },
    {
      "end": 2495704,
      "speaker": "Moritz Stefaner",
      "start": 2485092,
      "text": "If you can spend a couple of minutes rating us on iTunes, that would be extremely helpful for the show. Just search us in iTunes store or follow the link in our website.",
      "id": "ep_92_ut_83"
    },
    {
      "end": 2519798,
      "speaker": "Enrico Bertini",
      "start": 2496044,
      "text": "And we also want to give you some information on the many ways you can get news directly from from us. We're, of course, on twitter@twitter.com Datastories. But we also have a Facebook page@Facebook.com, Datastories podcast and we also have a newsletter. So if you want to get news directly into your inbox, go to our homepage data stories and look for the link that you find in the footer.",
      "id": "ep_92_ut_84"
    },
    {
      "end": 2541432,
      "speaker": "Moritz Stefaner",
      "start": 2519926,
      "text": "And finally, you can also chat directly with us and other listeners using slack again, you can find a button to sign up at the bottom of our page. And we do love to get in touch with our listeners. So if you want to suggest a way to improve the show or know amazing people you want us to invite or projects you want us to talk about, let us know.",
      "id": "ep_92_ut_85"
    },
    {
      "end": 2544784,
      "speaker": "Enrico Bertini",
      "start": 2541528,
      "text": "That's all for now. See you next time. And thanks for listening to data stories.",
      "id": "ep_92_ut_86"
    }
  ],
  "confidence": 0.930776068349266,
  "audio_duration": 2549,
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_status_code": null,
  "webhook_auth": false,
  "webhook_auth_header_name": null,
  "speed_boost": false,
  "auto_highlights_result": null,
  "auto_highlights": false,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_audio_quality": null,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "content_safety": false,
  "iab_categories": true,
  "content_safety_labels": {
    "status": "unavailable",
    "results": [],
    "summary": {}
  },
  "language_detection": false,
  "language_detection_threshold": null,
  "language_confidence": null,
  "custom_spelling": null,
  "throttled": false,
  "auto_chapters": true,
  "summarization": false,
  "summary_type": null,
  "summary_model": null,
  "custom_topics": false,
  "topics": [],
  "speech_threshold": null,
  "speech_model": "best",
  "chapters": [
    {
      "summary": "Hans Rosling was one of the most influential figures for data visualization. We dedicate one episode to him and try to look back a bit what he achieved. What has happened since 1962? We want to see the change.",
      "gist": "A Tribute to Hans Rosling",
      "headline": "We dedicate this episode to Hans Rosling, who pioneered data visualization",
      "start": 160,
      "end": 369884,
      "id": "ep_92_ch_0"
    },
    {
      "summary": "Hans Rosling helped develop the trendilizer software that was later acquired by Google. He basically also kicked off a whole public data movement at Google. To celebrate his heritage, we also asked a few other people to contribute short snippets to the show.",
      "gist": "A moment of silence for Hans Rosling",
      "headline": "Hans Rosling had huge influence on visualization and statistics",
      "start": 370624,
      "end": 666530,
      "id": "ep_92_ch_1"
    },
    {
      "summary": "Periscopic was saddened to hear about the passing of Hans Rosling. Like many data visualization firms, they've been inspired by his enthusiasm for numbers. I was also once commissioned to remix one of his works. Half of the people in Viz will have encountered data visualization first through Rosling or Tufte.",
      "gist": "A message about Hans Rosling",
      "headline": "Periscopic was inspired by Hans Rosling's work on data visualization",
      "start": 666682,
      "end": 891764,
      "id": "ep_92_ch_2"
    },
    {
      "summary": "Next up is Andy Kirk, friend of the show, blogger, writer and teacher, educator and teacher. He first discovered visualisation ten years ago through Hans Rosling's TED Talk. His work helped put visualization into a much more mainstream consciousness.",
      "gist": "Tribute to Hans Rosling",
      "headline": "Andy Kirk says he first discovered visualisation through Professor Hans Rosling",
      "start": 892304,
      "end": 1058664,
      "id": "ep_92_ch_3"
    },
    {
      "summary": "Baze: It's easy to take these huge contributions, these huge milestones in the lineage of this subject for granted. The timing that Hans Rosling had when he was talking in his talks. Nobody has done it like this before. Data performance is something.",
      "gist": "A message about Hans Rosling",
      "headline": "Baze: Many people got in contact with Vis through watching Hans Rosling",
      "start": 1059004,
      "end": 1253604,
      "id": "ep_92_ch_4"
    },
    {
      "summary": "Hans Rosling's TED talk in 2006 inspired a lot of work in data visualization. This whole idea that presentation is part of data visualization was not that much discussed in 2006. Next up we have Robert Kosara from Eagereyes and Tableau software.",
      "gist": "In the Elevator With Hans Rosling",
      "headline": "Robert Kosara says Hans Rosling's TED talk inspired a lot of visualization work",
      "start": 1254064,
      "end": 1535558,
      "id": "ep_92_ch_5"
    },
    {
      "summary": "Kennedy Elliott: My favorite memory of Hans Rosin is the first time I saw his famous hologram video. He says it altered his sense of what he is supposed to do as a journalist and as a visual storyteller. Elliott: The key is not the code that you use, it's how the people want to take in the information.",
      "gist": "Hans Rosin: The Story of Data Visualization",
      "headline": "Kennedy Elliott: My favorite memory of Hans Roslyn is seeing his hologram video",
      "start": 1535686,
      "end": 1894778,
      "id": "ep_92_ch_6"
    },
    {
      "summary": "Professor Hans Rosling's passing is a great loss for our community. His work is so relevant and so important for what we do nowadays when it comes to data visualization and data communication in general. About how important it is to use evidence to run better lives.",
      "gist": "A Tribute to Hans Rosling",
      "headline": "This initiative is a tribute to Professor Hans Rosling, who passed away recently",
      "start": 1894906,
      "end": 2056948,
      "id": "ep_92_ch_7"
    },
    {
      "summary": "We thought it would be nice to have a few people just record a few words on his impact and legacy. Just such an amazing guy. Let's hope there's a lot more like him in the future. Having a positive attitude and a positive message is such a powerful thing.",
      "gist": "A Tribute to Hans Rosling",
      "headline": "We thought it would be nice to pay tribute to Hans Rosling",
      "start": 2057116,
      "end": 2171160,
      "id": "ep_92_ch_8"
    },
    {
      "summary": "In 1810, the world was poor and sick, and up here is rich and healthy. Despite huge disparities, today we have seen 200 years of remarkable progress. We have become an entirely new, converging world. With aid, trade, green technology and peace, it's fully possible that everyone can make it to the healthy, wealthy corner.",
      "gist": "A look at health and wealth in the world",
      "headline": "Visualization is right at the heart of my own work on global health",
      "start": 2171232,
      "end": 2465510,
      "id": "ep_92_ch_9"
    },
    {
      "summary": "We have a page on Patreon where you can contribute an amount of your choosing per episode. If you can spend a couple of minutes rating us on iTunes, that would be extremely helpful for the show. And we also want to give you some information on the many ways you can get news directly from from us.",
      "gist": "How to support Datastories",
      "headline": "Before you leave, here are a few ways you can support the show",
      "start": 2465622,
      "end": 2544784,
      "id": "ep_92_ch_10"
    }
  ],
  "disfluencies": false,
  "entity_detection": false,
  "sentiment_analysis": false,
  "sentiment_analysis_results": null,
  "entities": null,
  "speakers_expected": null,
  "summary": null,
  "custom_topics_results": null,
  "episode_num": 92,
  "episode_metadata": {
    "speakers": [
      "Hans Rosling",
      "Enrico Bertini",
      "Moritz Stefaner",
      "Kim Rees",
      "Andy Kirk",
      "Robert Kosara",
      "Kennedy Elliott",
      "Alberto Cairo"
    ],
    "WPid": "877",
    "url": "https://datastori.es/podlove/file/3628/s/feed/c/mp3/92-a-tribute-to-hans-rosling.mp3",
    "episode_title": "A Tribute to Hans Rosling"
  }
}