{
  "id": "c74ead77-d82d-4487-ae68-22150ff5659f",
  "language_model": "assemblyai_default",
  "acoustic_model": "assemblyai_default",
  "language_code": "en_us",
  "status": "completed",
  "audio_url": "https://datastori.es/podlove/file/2877/s/feed/c/mp3/80-dietmar-offenhuber.mp3",
  "utterances": [
    {
      "end": 9674,
      "speaker": "Dietmar Offenhuber",
      "start": 200,
      "text": "This is what indexical visualization does. It indicates it points to a phenomenon and it frames it in a certain way so we can see it.",
      "id": "ep_80_ut_0"
    },
    {
      "end": 42254,
      "speaker": "Enrico Bertini",
      "start": 13974,
      "text": "Data stories is sponsored by Tableau. Tableau helps people see and understand their data. Tableau Ten is the latest version of the company's rapid fire, easy to use visual analytics software. It includes a completely refreshed design, mobile enhancements, new options for preparing, integrating and connecting to data, and a host of new enterprise capabilities. For more information, go to Tableau's website, www.Tableau.com.",
      "id": "ep_80_ut_1"
    },
    {
      "end": 65160,
      "speaker": "Moritz Stefaner",
      "start": 61344,
      "text": "Hey, everyone, it's a new data stories. Hi, Enrico, how are you doing?",
      "id": "ep_80_ut_2"
    },
    {
      "end": 67244,
      "speaker": "D",
      "start": 65272,
      "text": "Well, fantastic.",
      "id": "ep_80_ut_3"
    },
    {
      "end": 71840,
      "speaker": "Moritz Stefaner",
      "start": 68184,
      "text": "With the new music, I can see your head nod. With the groove.",
      "id": "ep_80_ut_4"
    },
    {
      "end": 75804,
      "speaker": "D",
      "start": 71872,
      "text": "We're nodding. Yeah, people can see that, but we are nodding.",
      "id": "ep_80_ut_5"
    },
    {
      "end": 88754,
      "speaker": "Moritz Stefaner",
      "start": 76664,
      "text": "So we have a new title, music, thanks to https://www.oddone.de/ in Berlin. Great audio shop. So if you also need a new podcast music, you might contact them. They're really cool. And yeah, now we have a new groove.",
      "id": "ep_80_ut_6"
    },
    {
      "end": 93674,
      "speaker": "D",
      "start": 88834,
      "text": "Oh my God. Yeah. Let us know how you like it.",
      "id": "ep_80_ut_7"
    },
    {
      "end": 97906,
      "speaker": "Moritz Stefaner",
      "start": 93714,
      "text": "Exciting. We've been using the old one for years, right. So you don't even think about it.",
      "id": "ep_80_ut_8"
    },
    {
      "end": 100866,
      "speaker": "D",
      "start": 97930,
      "text": "It's been what, almost four years of the old one?",
      "id": "ep_80_ut_9"
    },
    {
      "end": 101706,
      "speaker": "Moritz Stefaner",
      "start": 100890,
      "text": "Yeah. Right. So.",
      "id": "ep_80_ut_10"
    },
    {
      "end": 102562,
      "speaker": "D",
      "start": 101770,
      "text": "Oh my God.",
      "id": "ep_80_ut_11"
    },
    {
      "end": 105226,
      "speaker": "Moritz Stefaner",
      "start": 102658,
      "text": "Yeah, it's like a fresh painting for your apartment.",
      "id": "ep_80_ut_12"
    },
    {
      "end": 106410,
      "speaker": "D",
      "start": 105250,
      "text": "It's a fresh painting.",
      "id": "ep_80_ut_13"
    },
    {
      "end": 107134,
      "speaker": "Dietmar Offenhuber",
      "start": 106482,
      "text": "It's.",
      "id": "ep_80_ut_14"
    },
    {
      "end": 111682,
      "speaker": "D",
      "start": 109914,
      "text": "Oh my God. I'm getting emotional.",
      "id": "ep_80_ut_15"
    },
    {
      "end": 112858,
      "speaker": "Moritz Stefaner",
      "start": 111778,
      "text": "I like the old one too.",
      "id": "ep_80_ut_16"
    },
    {
      "end": 114394,
      "speaker": "D",
      "start": 112906,
      "text": "I like the old one too. Yeah.",
      "id": "ep_80_ut_17"
    },
    {
      "end": 124154,
      "speaker": "Moritz Stefaner",
      "start": 114514,
      "text": "And we had that from Dave from pilot vibe. We should mention that too. But the new groove is good too.",
      "id": "ep_80_ut_18"
    },
    {
      "end": 127314,
      "speaker": "D",
      "start": 124234,
      "text": "Yeah, that's a good one. That's a good one. Yeah.",
      "id": "ep_80_ut_19"
    },
    {
      "end": 128214,
      "speaker": "Moritz Stefaner",
      "start": 127474,
      "text": "Wow.",
      "id": "ep_80_ut_20"
    },
    {
      "end": 129170,
      "speaker": "D",
      "start": 128674,
      "text": "Yeah.",
      "id": "ep_80_ut_21"
    },
    {
      "end": 131898,
      "speaker": "Moritz Stefaner",
      "start": 129242,
      "text": "So how are things for you, Enrico? Things are going well.",
      "id": "ep_80_ut_22"
    },
    {
      "end": 141386,
      "speaker": "D",
      "start": 131946,
      "text": "Going well, going well. And not much of a vacation this year. Working hard. But summer is always good and. Yeah, having a good time.",
      "id": "ep_80_ut_23"
    },
    {
      "end": 143294,
      "speaker": "Enrico Bertini",
      "start": 141530,
      "text": "Just working hard.",
      "id": "ep_80_ut_24"
    },
    {
      "end": 146706,
      "speaker": "D",
      "start": 144034,
      "text": "How about you? I know you've been around a little bit.",
      "id": "ep_80_ut_25"
    },
    {
      "end": 155146,
      "speaker": "Moritz Stefaner",
      "start": 146810,
      "text": "Yeah, same here. I mean, I had a crazy June and relaxed July, but now August is kicking in with some work to do. As for you.",
      "id": "ep_80_ut_26"
    },
    {
      "end": 158554,
      "speaker": "D",
      "start": 155250,
      "text": "But yeah, we're warming up the engines for.",
      "id": "ep_80_ut_27"
    },
    {
      "end": 162370,
      "speaker": "Moritz Stefaner",
      "start": 158594,
      "text": "I do enjoy working, so I'm only half complaining. I actually enjoy working.",
      "id": "ep_80_ut_28"
    },
    {
      "end": 167654,
      "speaker": "D",
      "start": 162482,
      "text": "Yeah, yeah, that's the problem, right? Almost too much.",
      "id": "ep_80_ut_29"
    },
    {
      "end": 169902,
      "speaker": "Dietmar Offenhuber",
      "start": 169334,
      "text": "Yeah.",
      "id": "ep_80_ut_30"
    },
    {
      "end": 176438,
      "speaker": "Moritz Stefaner",
      "start": 169998,
      "text": "I can also take some time off. I'll have another vacation in October, so I can now get something done.",
      "id": "ep_80_ut_31"
    },
    {
      "end": 177114,
      "speaker": "D",
      "start": 176486,
      "text": "Yeah.",
      "id": "ep_80_ut_32"
    },
    {
      "end": 178838,
      "speaker": "Moritz Stefaner",
      "start": 177574,
      "text": "Cool. Shall we start?",
      "id": "ep_80_ut_33"
    },
    {
      "end": 179994,
      "speaker": "D",
      "start": 178966,
      "text": "Let's start.",
      "id": "ep_80_ut_34"
    },
    {
      "end": 197438,
      "speaker": "Moritz Stefaner",
      "start": 180494,
      "text": "Let's dive right in. So today we have another special guest, and it's a familiar face and voice, Dietmar Offenhuber, who we had on the show already for the smart Cities episode. And now we have a new topic to discuss with him. Hi, Dietmar.",
      "id": "ep_80_ut_35"
    },
    {
      "end": 199154,
      "speaker": "Dietmar Offenhuber",
      "start": 197476,
      "text": "Hi, Moritz. Hi, Enrico.",
      "id": "ep_80_ut_36"
    },
    {
      "end": 202498,
      "speaker": "D",
      "start": 199194,
      "text": "Hey, Dietmar. Hey, great to have you on the show again.",
      "id": "ep_80_ut_37"
    },
    {
      "end": 203954,
      "speaker": "Dietmar Offenhuber",
      "start": 202626,
      "text": "Thanks for inviting me again.",
      "id": "ep_80_ut_38"
    },
    {
      "end": 204770,
      "speaker": "D",
      "start": 204074,
      "text": "Yeah, yeah.",
      "id": "ep_80_ut_39"
    },
    {
      "end": 235212,
      "speaker": "Moritz Stefaner",
      "start": 204802,
      "text": "So the topic today has a bit of an obscure title. It's called indexical visualization, but it's a super fascinating topic and it's one I'm personally really interested in. And, yeah, Dietmar happens to be one of the experts on that, so we wanted to get him on and discuss a bit what it's all about. And the first question, of course, everybody will have is, what is index visualization? Yeah, exactly. So maybe let's get that straight out of the way.",
      "id": "ep_80_ut_40"
    },
    {
      "end": 236892,
      "speaker": "D",
      "start": 235268,
      "text": "Let's start with the hard task. What is it?",
      "id": "ep_80_ut_41"
    },
    {
      "end": 237636,
      "speaker": "Moritz Stefaner",
      "start": 236948,
      "text": "What is it?",
      "id": "ep_80_ut_42"
    },
    {
      "end": 243260,
      "speaker": "Dietmar Offenhuber",
      "start": 237740,
      "text": "Yeah, this is actually a very hard question to begin with, but no, I.",
      "id": "ep_80_ut_43"
    },
    {
      "end": 245356,
      "speaker": "D",
      "start": 243292,
      "text": "Want a mathematical definition.",
      "id": "ep_80_ut_44"
    },
    {
      "end": 272828,
      "speaker": "Dietmar Offenhuber",
      "start": 245500,
      "text": "Exactly. Exactly. No, it is hard, because indexical visualization is a little bit of a paradoxical thing, because it is visualization without representation. So it is, I use it to describe a collection of strategies that allow us to more or less directly observe a phenomenon without translating it into a symbolic visual language, such as charts and maps.",
      "id": "ep_80_ut_45"
    },
    {
      "end": 279828,
      "speaker": "Moritz Stefaner",
      "start": 272956,
      "text": "So there's no real data involved in terms of numbers or databases or something like this.",
      "id": "ep_80_ut_46"
    },
    {
      "end": 378814,
      "speaker": "Dietmar Offenhuber",
      "start": 279876,
      "text": "Yeah, exactly. Exactly. So that's the second paradoxical thing, because indexical visualization is visualization without data, since data are also a form of symbolic abstraction or representation. So this idea of non representational visualization is radically different from what we understand under the rubric of data visualization. So maybe best idea would be to start explaining it through an example. So think of a wind tunnel, so we cannot really see the airflow. But if we add some smoke, very precisely, so we start seeing lines, and the lines indicate the movement of air. And if we do it in a very accurate way, then we have a beautiful 3d visualization. But those lines that we see, those lines of smoke, are not really representations. They don't really stand for something else. They are part of the phenomenon that we are actually interested in. So this is what indexical visualization does. It indicates it points to a phenomenon and it frames it in a certain way so we can see it. So this is, of course, the term is a reference to Charles Sanders purse and his semiology, where he said that the index shows something about an object because it's physically connected to it. So it's different.",
      "id": "ep_80_ut_47"
    },
    {
      "end": 383838,
      "speaker": "Moritz Stefaner",
      "start": 378934,
      "text": "Index finger is basically the point with. Right. So is that the root of the word?",
      "id": "ep_80_ut_48"
    },
    {
      "end": 529894,
      "speaker": "Dietmar Offenhuber",
      "start": 383966,
      "text": "Exactly, exactly. So it's really about this act of pointing. And that's the second reason why? It's hard to define because indexical visualization is not really about what it is, but what it does. So it is a very performative notion under this. So what does this mean? Or because I said earlier, that is a collection of strategies. So what are some of these strategies that we can use to produce indexical visualizations? So one of the most important aspects of it is connected to producing traces. So that's what happens in the wind tunnel when we add the smoke is a visible marker. Or if we go to the hospital and we do an x ray and we have to swallow some radioactive tracer material so that those things show up on the x ray. Or if you are watching CSI and those different crime shows, making the latent fingerprints visible, those are all different acts of producing traces to make something visible. And, well, a second strategy would be constraining a phenomenon. So taking away degrees of freedom, if you think about a thermometer has liquid inside and the liquid expands with temperature, but we wouldn't be able to see it. So we have to make sure that it can only expand in a single direction in a very thin glass tube. So this act of showing something by constraining it is a very important element. A third strategy is related, is about framing the phenomenon. So this means that we have to add some references for comparison. So the New York artist Natalie Jeremijenko did a number of projects along those lines. One very simple one is where she used dust masks that have a grayscale printed. And if you go through various, you know, strong air pollution, the dust mask will turn gray. And then by comparing it with this reference, you can see how bad it is.",
      "id": "ep_80_ut_49"
    },
    {
      "end": 533706,
      "speaker": "Moritz Stefaner",
      "start": 531154,
      "text": "So the dust mask becomes the visualization.",
      "id": "ep_80_ut_50"
    },
    {
      "end": 534614,
      "speaker": "Dietmar Offenhuber",
      "start": 533770,
      "text": "Exactly.",
      "id": "ep_80_ut_51"
    },
    {
      "end": 556512,
      "speaker": "Moritz Stefaner",
      "start": 534914,
      "text": "Just by adding that legend or adding scale to it, it suddenly becomes a visualization. That's a crazy thought, actually, because it sounds like a stoner thought, almost like, whoa, whoa, whoa. Everything's a visualization, right? Do you think there's a limit there? I mean, at some point everything might become visualization of something if you see it like this, right?",
      "id": "ep_80_ut_52"
    },
    {
      "end": 656564,
      "speaker": "Dietmar Offenhuber",
      "start": 556608,
      "text": "Yeah. I mean, of course, that's another hard thing to really the problem of specificity. But in this case, what the scale does is that it's actually what differentiates just any phenomenon from something that becomes data by basically adding a scale or thinking about the sundial or actually a beautiful device that was invented in the 18th century that we used for the program for the symposium that we're going to talk about later as well, is the cyanometer. It is actually a ring that has a blue color scale on the outside. And it's here to measure the blueness of the sky. And by that, you can basically estimate the humidity of the air. And so without this frame of reference, how blue is the sky is a kind of a meaningless question unless you start adding a scale. So to make it basically systematic and make it discrete. And I think what's the interesting part here, or a sundial? The interesting part here is that this is really the moment when kind of a systematic observation becomes discrete, becomes data, which also is a big difference compared to data visualization, where data is already something that we have in the beginning, before we start. But here we are really going through this process of interpretation and discretization ourselves.",
      "id": "ep_80_ut_53"
    },
    {
      "end": 665160,
      "speaker": "Moritz Stefaner",
      "start": 656944,
      "text": "And inviting that measurement. Basically, that gives you a tool to actually measure. I was also thinking about analog and digital clocks.",
      "id": "ep_80_ut_54"
    },
    {
      "end": 665964,
      "speaker": "Dietmar Offenhuber",
      "start": 665272,
      "text": "Yes.",
      "id": "ep_80_ut_55"
    },
    {
      "end": 723840,
      "speaker": "Moritz Stefaner",
      "start": 666654,
      "text": "You know, if you have a clock made from springs, it actually, it's just a physical system. And it happens to show the time because it's smartly assembled. But there's no number really encoded anywhere in the system. It's just angles and movements and stuff. And the digital clock has this abstract, like representation of time and what time is and what an hour is and what a minute is. But then some digital clocks, or like lots of modern clocks, are all, like, most are electric, but then they have the. The hands of the analog clocks again. Right. So, and I think when you mentioned the wind tunnel, I was also thinking like, yeah, maybe you would visualize the same data also as these wind tunnel lines. So I think this is also interesting that a lot of the data visualization strategies we use routinely come from the physical world and come from actual processes that happen and have a certain causality and are plausible physically.",
      "id": "ep_80_ut_56"
    },
    {
      "end": 818694,
      "speaker": "Dietmar Offenhuber",
      "start": 724032,
      "text": "Exactly. And this is also where our really beautiful categories breakdown. Because if you really think about it, the computer is also in the exec device. So there's no magic happening inside. There is some kind of defined electricity. And this is exactly where I want to add a fourth principle, which is minimizing the distance between the visualization and the phenomenon that we are looking at. So if you think about the clock or thermometer digitizing and storing it in some kind of digital storage capacity, that does not really necessarily change the reading of the temperature, but it increases the distance between the physical experience of temperature and this kind of appearance of the visualization. So what we have, in fact, is a continuous scale between, you know, the cooked and the processed and the raw. So it is. That's also where we can later start relaxing this definition of indexical visualization a little bit, because we are actually not always or exclusively dealing with physical phenomena. So there are a lot of indexical processes that also apply in data visualizations as we know it.",
      "id": "ep_80_ut_57"
    },
    {
      "end": 835540,
      "speaker": "D",
      "start": 819564,
      "text": "An indexical visualization doesn't necessarily have to be physical, right? So as long as the digital representation of information is as close as possible to the original signal. Is that the way this works?",
      "id": "ep_80_ut_58"
    },
    {
      "end": 838652,
      "speaker": "Dietmar Offenhuber",
      "start": 835572,
      "text": "I remember this is definitely one criterion.",
      "id": "ep_80_ut_59"
    },
    {
      "end": 852974,
      "speaker": "D",
      "start": 838828,
      "text": "I think you once mentioned, for instance, the router that you have in front of you with all these blinking lights is an example of kind of like in between digital and physical visualization, right?",
      "id": "ep_80_ut_60"
    },
    {
      "end": 959854,
      "speaker": "Dietmar Offenhuber",
      "start": 853314,
      "text": "Yeah, that's a funny example, because we're talking about the led lights on your Internet router. And usually we don't really think about what each led means, and we don't really interpret exactly the rhythm and what we see, but we read it as a trace. We just read it as an indication that something happens. If it just immediately, at some point starts basically going crazy, then we know that something is going on and some network traffic occurs. So we have a purely symbolic representation, but the way how we read it is actually as a indication of something that happens. So there are a lot of different layers and stages in between. And frankly, that's really what visual communication, or communication in general is about. So there's no pure form of communication. So this is actually where the one very important difference between data visualization and indexical visualization. When we look at data visualization, we usually use data as a starting point, but in indexical visualization, data, the end result of our interpretation. So they might look very similar to different forms. If you think of tree rings, for example, they almost look like a visualization. And in fact, there are many visualizations that use tree rings as a metaphor, but the direction is a different one.",
      "id": "ep_80_ut_61"
    },
    {
      "end": 1012212,
      "speaker": "Moritz Stefaner",
      "start": 960474,
      "text": "This is what I like so much about it. You know, the whole world is sort of readable then, and you can read the world as a diagram. Basically you just have a phenomenon and you read its traces, you make sense of its traces, and then if it's rich enough and you can read enough out of the traces, then you have this information experience and you're absolutely right. Then the boundaries really start to blur, and who cares if numbers have been involved or not, as long as you learn something from reading the traces. And if you see it like this, suddenly this whole world opens, right, of things where you think like, wow, we've been doing this for hundreds of years also in sciences, right? Like the history of science is one of reading these traces and setting up smart systems that generate interesting traces, right?",
      "id": "ep_80_ut_62"
    },
    {
      "end": 1067254,
      "speaker": "Dietmar Offenhuber",
      "start": 1012268,
      "text": "Exactly. Yeah. I mean, I think it's, you know, we have all this history of basically reading the world and reading phenomena, you know, figuring out whether it's gonna rain tomorrow or not by, you know, looking at the grass or the leaves or things like that. But on the other hand, I mean, this sounds very archaic, but a lot of those forms of reading are also still present in the way how we engage with information and with visualizations and with visual artifacts around us. So that's why I'm really more drawn to this kind of performative definition where you really look at what, you know, what the representation does, it shows you a certain thing, rather than basically fitting into a very neat category.",
      "id": "ep_80_ut_63"
    },
    {
      "end": 1161684,
      "speaker": "Enrico Bertini",
      "start": 1071634,
      "text": "So this is a good time to take a little break and talk about our sponsor, Tableau. And more specifically, we're going to talk about Tableau's new release, Tableau ten. Tableau Ten is the latest version of the company's rapid fire, easy to use visual analytics software. It includes a completely refreshed design, mobile enhancements, new options for preparing, integrating and connecting to data, and a host of new enterprise capabilities. Every element of the interface was reconsidered for Tableau ten. In order to maximize cognition and help people focus on their data, Tableau Mobile now provides one tap access to get real time data, while the new device designer allows people to lay out visualizations ahead of time. For a range of devices, which now includes Android tablets, preparing and integrating data is easy, with features such as cross database join and union, and new visual analytics capabilities make communicating with data more intuitive. Web updates make it easier to stay in the flow of analyzing data in the cloud, and enterprise improvements make it easier to explore data in a trusted environment. The full features list for Tableau ten can be found on Tableau's website at www. Dot. This is www.table.com. and now back to the show.",
      "id": "ep_80_ut_64"
    },
    {
      "end": 1292588,
      "speaker": "D",
      "start": 1164744,
      "text": "I think one thing that you briefly mentioned is this idea of minimizing the distance. And I think that's a super interesting and important concept because I think, on the one hand, by being able to visualize and talk about numbers and statistics, we can understand some phenomena much better, right? But when you use these numbers as a way to communicate information to others, there is a, sometimes I would even say often a very big distance between these numbers and the original phenomenon. And visualization is kind of like a way to try to reduce this gap. But again, I believe that it doesn't reduce the gap very well in many cases. Right? And so I think this whole idea of understanding the distance between the original phenomenon and the representation is something that is really, really important to explore. And in dexical visualization, seems to be a way to get closer to the. To the origin, right. And just a few days ago, I became aware of this idea of. So there is a researcher, his name is Paul Slovak, and he coined this term psychic numbness. I don't know if you are aware of that. And the idea there is that for us, it's very easy to lose sense of what large numbers mean, right? So when we are talking, for instance, about number of deaths or genocide or a lot of other atrocities, right. One person, the specific account of one person has a very big impact on you, right. And he empirically demonstrated that the more people you have, right. The more you get closer to numbers. Right.",
      "id": "ep_80_ut_65"
    },
    {
      "end": 1294736,
      "speaker": "Enrico Bertini",
      "start": 1292786,
      "text": "And the more the number grows and.",
      "id": "ep_80_ut_66"
    },
    {
      "end": 1314360,
      "speaker": "D",
      "start": 1294760,
      "text": "The less effect you have on the emotional response and even the decisions that people make. Right. So, say there are some experiments where they put people. They ask people to make kind of like political decisions based on these numbers, right. And when the numbers grow, there is more distance, and it's much harder to.",
      "id": "ep_80_ut_67"
    },
    {
      "end": 1315944,
      "speaker": "Enrico Bertini",
      "start": 1314392,
      "text": "Make sensible decisions there.",
      "id": "ep_80_ut_68"
    },
    {
      "end": 1478042,
      "speaker": "Dietmar Offenhuber",
      "start": 1316024,
      "text": "Yeah, this is. Yeah, I mean, that's pretty much almost a literal definition of abstraction. When you pull away from a phenomenon by. Yeah, that's very neat. And I think there's a lot of concern about narrative strategies in visualization. Telling stories with data, data stories. But I think a second aspect is the experience of. Of data and of information. And a story is something when someone else basically guides you and explains something to you. But when we think about traces, we have to put it together ourselves. So this is another, I think, a very interesting aspect of it. And something that, as you said, emotionally really affects us because we are really experiencing the phenomenon that we are talking about. And so I think there is a very beautiful example, which is not really an indexical visualization in the narrow sense that it is a kind of a physical representation or a physical phenomenon, but more in this more extended sense. Kamal McCluffy's visualization of iraqi casualties during the Iraq war. Where I think the data set was originally from WikiLeaks. And he visualized it in the most simple way you can imagine, by using exactly one pixel for one person who died. And so the result is a visualization that has a fixed resolution. So it's in a way, unique. You cannot really scale it. You cannot really transform it a lot. So you have a kind of a one to one relationship between the visualization and the data. This is one way to really establish a kind of indexical relationship within the narrow constraints of data visualization. Or, for example, when Bill Cleveland or Andrew Galeman expressed a preference for showing all data points of a distribution rather than using a box plot. That's also indexical strategy, because all those data points allow multiple readings and they also require interpretation. So, again, playing with the distance between the phenomenon and the visualization.",
      "id": "ep_80_ut_69"
    },
    {
      "end": 1514444,
      "speaker": "D",
      "start": 1478218,
      "text": "Yeah, no, that's a really good point. And I'm always struggling myself with this problem of whether I should abstract a bit and make things easier to grasp or give full details. I think there is always this tension in visualization, and what I notice is that most people tend to abstract a lot, and I tend to give a lot of details, but too many details are overwhelming. So I think there is a very interesting space there where one needs to understand. I don't know where to draw the line.",
      "id": "ep_80_ut_70"
    },
    {
      "end": 1564468,
      "speaker": "Moritz Stefaner",
      "start": 1515184,
      "text": "I think one other real example or advantage of this strategy is that you can actually be surprised by what happens, because it's a little like when you set up these systems, it's a little lab experiment, for instance. One other way we haven't mentioned is, of course, long term photo exposure or things like this. So you can create images based on photographic processes, and if you have a long time exposure, you can basically capture a long process in one image. But every time you do that, you never know how it turns out. So you can be really surprised by the end result of your own visualization. And I think that's really charming about it too. That sort of you as an author, you're also in the same position as the audience. You just have to see how it works out, basically.",
      "id": "ep_80_ut_71"
    },
    {
      "end": 1610904,
      "speaker": "Dietmar Offenhuber",
      "start": 1564556,
      "text": "Exactly. As an author, you're really. Basically, you're building a system for observation. And this is something that we often forget when we talk about traces, we often think about evidence, and basically, traces speak for themselves, but we have to somehow make them visible. And this involves, to some extent, an author. So even when we think about something very obvious, like tree rings, we have to cut the tree before we can see the tree rings or do something similar. But there's this act of messing with the situation before we can actually see those traces.",
      "id": "ep_80_ut_72"
    },
    {
      "end": 1617624,
      "speaker": "Moritz Stefaner",
      "start": 1611484,
      "text": "Evidence is an interesting word. Like, there's the whole forensic topic coming in, of course. Like, what is actual evidence?",
      "id": "ep_80_ut_73"
    },
    {
      "end": 1843498,
      "speaker": "Dietmar Offenhuber",
      "start": 1618204,
      "text": "Yeah, I think this is because one might ask, okay, is this indexical visualization is a very nice armchair pet topic of intellectual conversation. Good hobby to have. But actually, I think it is very important. And one of the most important aspects is really this kinship with evidence. When we think of traces, we think of evidence. And this is also, from a visualization standpoint, one of the beautiful aspects of it, because it allows us to experience causality. And we basically reenact, by looking at traces, this experience of collecting data and figuring out what is going on. And because of that, we find indexical forms of visualization very often in situations where evidence is very central. In a courtroom, of course, we have visualization firms that focus on courtroom visualization, which is another really interesting topic because it's right between storytelling and in the exact notions and things like that. But also citizen science. If you look at cases where citizens collect evidence of pollution to basically create public pressure that something is not right, those citizens are not really scientists, so they have to make a very good case that what they collect are not just random numbers, but there is a kind of evidence that can be also accepted and experienced by other people. And one of the examples that we talked about at the conference is a map of fracking exposure, hydrogen sulfide, some chemical that is found in drinking water, that was visualized with photo paper in a very specific way. So you would get a map that is actually consists of these little stripes of photo paper. And it's a different thing if you have on the one hand, a scatterplot or bar chart where someone could say, anyone can do that, but if you have this physical evidence, you're more persuasive. And even among scientists, if you look at science magazine photos, you see a lot of photos of petri dishes. Now, you would say that everyone would believe that those are legitimate scientists because they published in Science magazine, but they still think it's important to show the actual visual evidence of the bacteria doing a certain thing. So this notion of evidence is very important, and that's connected to other things as well. So, for example, bridging different scales, we cannot really experience what happens at the microscopic scale, but if we use these inks and dyes that attach themselves to specific bacteria, or we can visualize something that otherwise is too small to see. So I think there are a lot of advantages in using these different strategies.",
      "id": "ep_80_ut_74"
    },
    {
      "end": 1901864,
      "speaker": "D",
      "start": 1843626,
      "text": "So, Dietmar, one thing I wanted to ask you is, I guess maybe some of our listeners are listening to this and want to try out, right? I think especially for the physical kind of indexical visualizations. It's an exciting idea, and I'm wondering if you have any suggestions on how to start or guidelines. My sense is that there are at least two ways to do physical indexical visualizations. One is going around hunting in the world and trying to find out phenomena that are already recorded into something like, as you said, cutting a tree or deliberately design something, knowing that you are going to capture an interesting phenomenon, something like the petri dish or similar situations. Right. So how do you get started with this? Do you have any suggestions that you can give?",
      "id": "ep_80_ut_75"
    },
    {
      "end": 1942016,
      "speaker": "Dietmar Offenhuber",
      "start": 1902204,
      "text": "So. Well, one very easy answer is basically, we have now our documentation of the indexical design symposium up, and there are a lot of videos of different practitioners, researchers. So we had criminologists, forensic scientists, biologists, historians, artists, who basically covered indexical practices in the broadest possible way. Also including Moritz, who conducted as part of the symposium with Susanne Jaschko. Another instance of the data cuisine workshop.",
      "id": "ep_80_ut_76"
    },
    {
      "end": 1945392,
      "speaker": "Moritz Stefaner",
      "start": 1942080,
      "text": "Yeah, that's right. The Boston edition was good.",
      "id": "ep_80_ut_77"
    },
    {
      "end": 2027734,
      "speaker": "Dietmar Offenhuber",
      "start": 1945448,
      "text": "The Boston edition, exactly. So I think. I think just getting a sense of all those different practices is a very good start, because we are familiar with a lot of those different practices. But thinking about it from the angle of visualization lets us appreciate what actually happens. And there are, of course, many things that you can do instead of basically just taking data for granted. Start how data were collected and start from there and figuring out how can we make patterns visible with the least amount of transformation. And I think also this notion of multiple readings is important. Of course, it's not always useful. You know, sometimes you really have a certain message and you want to communicate this message. So indexical visualization is definitely not a universal strategy, but it's very effective if you really want to get a sense of all the multiple readings that are possible if you look at a particular phenomenon.",
      "id": "ep_80_ut_78"
    },
    {
      "end": 2051394,
      "speaker": "Moritz Stefaner",
      "start": 2027834,
      "text": "Yeah. Just a simple thought that you don't always need a spreadsheet to start with. I think, you know, exactly. Now that I say it sounds very obvious, but, you know, we are so focused on what's the data, where does the data come from? Which data do I visualize that? This thought that, well, maybe I can shortcut the whole thing and just visualize the phenomenon directly without any data. You know, it doesn't even cross our mind. And, I mean, that's a sad fact.",
      "id": "ep_80_ut_79"
    },
    {
      "end": 2054478,
      "speaker": "Dietmar Offenhuber",
      "start": 2053094,
      "text": "Professional deformation.",
      "id": "ep_80_ut_80"
    },
    {
      "end": 2063102,
      "speaker": "Moritz Stefaner",
      "start": 2054566,
      "text": "Bounce back from that a bit. Yeah, it sounds like. Yeah, two more things came to my mind. Like Nick Felton, who we had on the show already, he published a book on photovis.",
      "id": "ep_80_ut_81"
    },
    {
      "end": 2063702,
      "speaker": "Dietmar Offenhuber",
      "start": 2063158,
      "text": "Yeah, beautiful.",
      "id": "ep_80_ut_82"
    },
    {
      "end": 2101397,
      "speaker": "Moritz Stefaner",
      "start": 2063758,
      "text": "So that's really focused on using photography for visualization. And I think a lot of his examples would somehow qualify as physical visualization as well. And then there's, of course, we have another episode with domestic data streamers, and so they make these participatory data sculptures, where, let's say everybody drops a pebble somewhere, or like, it's often like a survey or a poll, and people will, like, maybe pick up a thread of wool and, you know, mark something in the sculpture. And by this collective activity, the visualization of the collective activity emerges.",
      "id": "ep_80_ut_83"
    },
    {
      "end": 2101677,
      "speaker": "Dietmar Offenhuber",
      "start": 2101445,
      "text": "Right?",
      "id": "ep_80_ut_84"
    },
    {
      "end": 2106445,
      "speaker": "Moritz Stefaner",
      "start": 2101725,
      "text": "So they also set up these really smart indexical systems, I would say.",
      "id": "ep_80_ut_85"
    },
    {
      "end": 2215414,
      "speaker": "Dietmar Offenhuber",
      "start": 2106589,
      "text": "Yeah, absolutely. Great references. Photography, of course, is a huge. Photography is also also basically a perpetual problem for indexicality, because already Charles Sanders Peirce talked about the photography as being iconic. It represents something. It's a portrait of someone, but at the same time, it is the result of a photochemical process. So it has this kind of dual role. And later then, in the sixties, seventies, when image manipulation became more widespread and easier to do, suddenly this notion of authenticity of a photograph is also very much in question. So this kind of long term exposures and manipulations and synthetic aperture and computational photography is, I think, a very exciting, a boundary area that one can explore. And it also has a second element that I like a lot, which is also in the second example that you talked about, this kind of participation, participatory sculptures, which is the element of time. So in the end, time is the ultimate tool or category for indexicality, because all those processes that happen over time leave some traces. And time is often one of the crucial things to look at if we want to understand traces. I think those are very good examples.",
      "id": "ep_80_ut_86"
    },
    {
      "end": 2251444,
      "speaker": "Moritz Stefaner",
      "start": 2215494,
      "text": "Really fascinating topic. We will also link, of course, to the conference talk. So these are all recorded, so you can check out the different lectures, really, from all kinds of perspectives to the different books. There's also scientific papers, if you want to dive into the hardcore stuff aspects. Yeah, there's a lot of stuff around that, too. And. Yeah, and maybe listeners, if you come up with new ways of setting up indexical visualizations, or if you have done in the past and you just didn't know that it had such a fancy name, let us know and we can maybe publish that, too.",
      "id": "ep_80_ut_87"
    },
    {
      "end": 2261740,
      "speaker": "D",
      "start": 2251584,
      "text": "Yeah, and Dietmar has a Pinterest board collecting lots of examples. Right, Dietmar? We're going to show notes updated.",
      "id": "ep_80_ut_88"
    },
    {
      "end": 2308352,
      "speaker": "Dietmar Offenhuber",
      "start": 2261892,
      "text": "Yes, I do. So, you know, it might not be self explanatory, because sometimes you might ask yourself, you know, why I think this particular Pinterest, these images, is in lexical, but maybe this show gives some clues. And also there's also a paper that I wrote with my colleague and friend Orkan Telhan on indexical visualization. And so Orkan, as an artist, he also looks into the topic of the signature. What does it mean to see signatures in a particular context? So I think there are a lot of things to explore.",
      "id": "ep_80_ut_89"
    },
    {
      "end": 2325992,
      "speaker": "Moritz Stefaner",
      "start": 2308448,
      "text": "Yeah, it's definitely one of these topics. The more you look into it, the bigger it becomes and suddenly you see it everywhere. And I think that's really fascinating. Yeah. Thanks so much. That was really fascinating. I hope we got you hooked on this topic as well. And thanks, Dietmar, for joining us once again.",
      "id": "ep_80_ut_90"
    },
    {
      "end": 2328976,
      "speaker": "Dietmar Offenhuber",
      "start": 2326088,
      "text": "Thanks, Enriquez. Thanks, Moritz. This was a lot of fun.",
      "id": "ep_80_ut_91"
    },
    {
      "end": 2330628,
      "speaker": "D",
      "start": 2329040,
      "text": "Thanks, Dietmar. Thank you.",
      "id": "ep_80_ut_92"
    },
    {
      "end": 2331020,
      "speaker": "Moritz Stefaner",
      "start": 2330676,
      "text": "Thank you.",
      "id": "ep_80_ut_93"
    },
    {
      "end": 2331404,
      "speaker": "Dietmar Offenhuber",
      "start": 2331052,
      "text": "Bye bye.",
      "id": "ep_80_ut_94"
    },
    {
      "end": 2332264,
      "speaker": "Moritz Stefaner",
      "start": 2331444,
      "text": "Bye bye.",
      "id": "ep_80_ut_95"
    },
    {
      "end": 2345220,
      "speaker": "Enrico Bertini",
      "start": 2339244,
      "text": "Hey, guys, thanks for listening to data stories again. Before you leave, we have a request if you can spend a couple of.",
      "id": "ep_80_ut_96"
    },
    {
      "end": 2348940,
      "speaker": "D",
      "start": 2345252,
      "text": "Minutes rating us on iTunes, that would be extremely helpful for the show.",
      "id": "ep_80_ut_97"
    },
    {
      "end": 2379702,
      "speaker": "Moritz Stefaner",
      "start": 2349052,
      "text": "And here's also some information on the many ways you can get news directly from us. We're, of course, on twitter@twitter.com. Datastories. We have a Facebook page@Facebook.com, data storiespodcast all in one word. And we also have an email newsletter. So if you want to get news directly into your inbox and be notified whenever we publish an episode, you can go to our homepage datastory es and look for the link that you find on the bottom in the footer.",
      "id": "ep_80_ut_98"
    },
    {
      "end": 2382574,
      "speaker": "Enrico Bertini",
      "start": 2379798,
      "text": "So one last thing that we want to tell you is that we love.",
      "id": "ep_80_ut_99"
    },
    {
      "end": 2384270,
      "speaker": "D",
      "start": 2382614,
      "text": "To get in touch with our listeners.",
      "id": "ep_80_ut_100"
    },
    {
      "end": 2385886,
      "speaker": "Enrico Bertini",
      "start": 2384382,
      "text": "Especially if you want to suggest a.",
      "id": "ep_80_ut_101"
    },
    {
      "end": 2387944,
      "speaker": "D",
      "start": 2385910,
      "text": "Way to improve the show or amazing.",
      "id": "ep_80_ut_102"
    },
    {
      "end": 2391800,
      "speaker": "Enrico Bertini",
      "start": 2387984,
      "text": "People you want us to invite or even projects you want us to talk about.",
      "id": "ep_80_ut_103"
    },
    {
      "end": 2401164,
      "speaker": "Moritz Stefaner",
      "start": 2391912,
      "text": "Yeah, absolutely. So don't hesitate to get in touch with us. It's always a great thing for us. And that's all for now. See you next time, and thanks for listening to data stories.",
      "id": "ep_80_ut_104"
    },
    {
      "end": 2432614,
      "speaker": "Enrico Bertini",
      "start": 2404744,
      "text": "Data stories is sponsored by Tableau. Tableau helps people see and understand their data. Tableau Ten is the latest version of the company's rapid fire, easy to use visual analytics software. It includes a completely refreshed design, mobile enhancements, new options for preparing, integrating and connecting to data, and a host of new enterprise capabilities. For more information, go to Tableau's website, www.Tableau.com.",
      "id": "ep_80_ut_105"
    }
  ],
  "confidence": 0.926062855583845,
  "audio_duration": 2432,
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_status_code": null,
  "webhook_auth": false,
  "webhook_auth_header_name": null,
  "speed_boost": false,
  "auto_highlights_result": null,
  "auto_highlights": false,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_audio_quality": null,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "content_safety": false,
  "iab_categories": true,
  "content_safety_labels": {
    "status": "unavailable",
    "results": [],
    "summary": {}
  },
  "language_detection": false,
  "language_detection_threshold": null,
  "language_confidence": null,
  "custom_spelling": null,
  "throttled": false,
  "auto_chapters": true,
  "summarization": false,
  "summary_type": null,
  "summary_model": null,
  "custom_topics": false,
  "topics": [],
  "speech_threshold": null,
  "speech_model": "best",
  "chapters": [
    {
      "summary": "Data stories is sponsored by Tableau. Tableau helps people see and understand their data. New title, music, thanks to https://www.oddone.de/ in Berlin. Let us know how you like it.",
      "gist": "Data Stories",
      "headline": "Tableau Ten is the latest version of the company's rapid fire visual analytics software",
      "start": 200,
      "end": 129170,
      "id": "ep_80_ch_0"
    },
    {
      "summary": "Enrico: Things are going well. And not much of a vacation this year. Working hard. But summer is always good and. Yeah, having a good time. How about you?",
      "gist": "Enrico",
      "headline": "Enrico says summer is going well with some work to do",
      "start": 129242,
      "end": 178838,
      "id": "ep_80_ch_1"
    },
    {
      "summary": "Indexical visualization is visualization without representation. It allows us to observe a phenomenon without translating it into a symbolic visual language. One of the most important aspects of it is connected to producing traces. What are some of the strategies that we can use to produce indexical visualizations?",
      "gist": "Indexical Visualization",
      "headline": "Indexical visualization is visualization without representation, says Dietmar Offenhuber",
      "start": 178966,
      "end": 696514,
      "id": "ep_80_ch_2"
    },
    {
      "summary": "A lot of the data visualization strategies we use routinely come from the physical world. And this is also where our really beautiful categories breakdown. Because if you really think about it, the computer is also in the exec device. There is some kind of defined electricity.",
      "gist": "Data visualization in the wind tunnel",
      "headline": "A lot of data visualization strategies come from the physical world",
      "start": 696904,
      "end": 741154,
      "id": "ep_80_ch_3"
    },
    {
      "summary": "An indexical visualization doesn't necessarily have to be physical. As long as the digital representation of information is as close as possible to the original signal. There are a lot of different layers and stages in between. This is really what visual communication in general is about.",
      "gist": "What is data visualization and indexical visualization?",
      "headline": "Fourth principle of indexical visualization is minimizing distance between visualization and phenomenon",
      "start": 742694,
      "end": 1067254,
      "id": "ep_80_ch_4"
    },
    {
      "summary": "Tableau Ten is the latest version of the company's rapid fire, easy to use visual analytics software. It includes a completely refreshed design, mobile enhancements, new options for preparing, integrating and connecting to data. The full features list for Tableau ten can be found on Tableau's website.",
      "gist": "Tableau 10",
      "headline": "Tableau Ten is the latest version of the company's rapid fire visual analytics software",
      "start": 1071634,
      "end": 1161684,
      "id": "ep_80_ch_5"
    },
    {
      "summary": "The idea of understanding the distance between the original phenomenon and the representation is something that is really, really important to explore. In dexical visualization, seems to be a way to get closer to the. origin. There is always this tension in visualization.",
      "gist": "The distance between the phenomenon and the visualization",
      "headline": "The idea of minimizing the distance between the phenomenon and the visualization is important",
      "start": 1164744,
      "end": 1843498,
      "id": "ep_80_ch_6"
    },
    {
      "summary": "There are at least two ways to do physical indexical visualizations. Think about it from the angle of visualization lets us appreciate what actually happens. Photography is also basically a perpetual problem for indexicality. Do you have any suggestions that you can give?",
      "gist": "How to start a Physical Indexical Visualization",
      "headline": "Dietmar: There are two ways to do physical indexical visualizations",
      "start": 1843626,
      "end": 2173884,
      "id": "ep_80_ch_7"
    },
    {
      "summary": "Time is the ultimate tool or category for indexicality, because all those processes that happen over time leave some traces. Dietmar has a Pinterest board collecting lots of examples. If you come up with new ways of setting up indexical visualizations, let us know.",
      "gist": "Indexical Visualizations",
      "headline": "Time is the ultimate tool or category for indexicality",
      "start": 2174224,
      "end": 2342076,
      "id": "ep_80_ch_8"
    },
    {
      "summary": "Before you leave, we have a request if you can spend a couple of. Minutes rating us on iTunes. Here's also some information on the many ways you can get news directly from us. We love to get in touch with our listeners.",
      "gist": "Data Stories Podcast",
      "headline": "Before you leave, we have a request if you can spend a couple of minutes rating data stories",
      "start": 2342220,
      "end": 2401164,
      "id": "ep_80_ch_9"
    },
    {
      "summary": "Tableau Ten is the latest version of the company's rapid fire, easy to use visual analytics software. It includes a completely refreshed design, mobile enhancements, new options for preparing, integrating and connecting to data. For more information, go to Tableau's website.",
      "gist": "Tableau 10 Announcement",
      "headline": "Tableau Ten is the latest version of the company's rapid fire visual analytics software",
      "start": 13974,
      "end": 42254,
      "id": "ep_80_ch_10"
    }
  ],
  "disfluencies": false,
  "entity_detection": false,
  "sentiment_analysis": false,
  "sentiment_analysis_results": null,
  "entities": null,
  "speakers_expected": null,
  "summary": null,
  "custom_topics_results": null,
  "episode_num": 80,
  "episode_metadata": {
    "speakers": [
      "Dietmar Offenhuber",
      "Enrico Bertini",
      "Moritz Stefaner"
    ],
    "WPid": "725",
    "url": "https://datastori.es/podlove/file/2877/s/feed/c/mp3/80-dietmar-offenhuber.mp3",
    "episode_title": "Indexical Visualization with Dietmar Offenhuber"
  }
}