{
  "id": "fe613217-b605-4c3c-8683-538eee1aed80",
  "language_model": "assemblyai_default",
  "acoustic_model": "assemblyai_default",
  "language_code": "en_us",
  "status": "completed",
  "audio_url": "https://datastori.es/podlove/file/2589/s/feed/c/mp3/78-mimi-onuoha.mp3",
  "utterances": [
    {
      "end": 11394,
      "speaker": "Mimi Onuoha",
      "start": 200,
      "text": "A lot of us who work with data, we either do like personal, quantified self stuff, or you work with APIs or big datasets. And it's very rare to work with the people who actually are producing the data themselves.",
      "id": "ep_78_ut_0"
    },
    {
      "end": 36204,
      "speaker": "Moritz Stefaner",
      "start": 13734,
      "text": "Datastores is brought to you by Qlik, who allows you to explore the hidden relationships within your data that lead to meaningful insights. Let your instincts lead the way to create personalized visualizations and dynamic dashboards with Qlik sense, which you can download for free at Qlik.de/datastories . That's Qlik.de/datastories.",
      "id": "ep_78_ut_1"
    },
    {
      "end": 68280,
      "speaker": "C",
      "start": 47264,
      "text": "Hey, everyone, this is a new data stories. I'm here without Enrico, but with Mimi on Waha, and we're sitting here together in the club lounge. Very nice of the Millennium hotel in Minneapolis because we both attended EYEO festival, so I wanted to use the chance and talk to her a bit. Hi, Mimi, good to have you on.",
      "id": "ep_78_ut_2"
    },
    {
      "end": 69384,
      "speaker": "Mimi Onuoha",
      "start": 68352,
      "text": "Hello, it's great to be here.",
      "id": "ep_78_ut_3"
    },
    {
      "end": 70072,
      "speaker": "C",
      "start": 69424,
      "text": "How are you doing?",
      "id": "ep_78_ut_4"
    },
    {
      "end": 71728,
      "speaker": "Mimi Onuoha",
      "start": 70168,
      "text": "Pretty good. Yeah, that's nice.",
      "id": "ep_78_ut_5"
    },
    {
      "end": 72976,
      "speaker": "C",
      "start": 71816,
      "text": "Did you enjoy the festival?",
      "id": "ep_78_ut_6"
    },
    {
      "end": 82816,
      "speaker": "Mimi Onuoha",
      "start": 73080,
      "text": "It was really good, very inspiring. Lots of good people. Very thought provoking. A lot of space to really reflect and think about cool things people are doing and then how it affects your work. So it was really nice.",
      "id": "ep_78_ut_7"
    },
    {
      "end": 100174,
      "speaker": "C",
      "start": 82880,
      "text": "Yeah, I always enjoy it. I've been here for a few years now and yeah, it's one of the really good conferences. So if you have a chance to go there one day, check it out, everyone should come. Everybody should. Exactly. So, Mimi, can you tell us a bit what you do, what your background is, and then we can dive into one of your projects?",
      "id": "ep_78_ut_8"
    },
    {
      "end": 124484,
      "speaker": "Mimi Onuoha",
      "start": 100254,
      "text": "Sure, I'd love to. Like, as you said, my name is Mimi. I'm an artist and researcher, and most of my work has to do with the moment of data collection. I'm really interested in that, and I like to think about that moment and a lot of the different issues and questions that looking at it provokes. I am right now a fellow at the Data and society research institute. And yeah, that's mainly it. I do a couple other things on the side.",
      "id": "ep_78_ut_9"
    },
    {
      "end": 138016,
      "speaker": "C",
      "start": 126064,
      "text": "One project that came to our attention that we found really interesting was the pathways project, and it presents findings, or maybe you can introduce it. What is it all about?",
      "id": "ep_78_ut_10"
    },
    {
      "end": 169064,
      "speaker": "Mimi Onuoha",
      "start": 138080,
      "text": "Right, so pathways is a sort of data storytelling project, and it basically consists of me following around or getting a month's worth of data from four different groups of Londoners. And I was trying to find the data of a relationship. So people who already had these existing relationships with each other, and they allowed me to collect their mobile data, and then I took it and I visualized and represented it and told the stories of what we found from it and also what the experience was like for me and for them, because they were people who I knew. So I was working with them in person, but also working with their data.",
      "id": "ep_78_ut_11"
    },
    {
      "end": 181258,
      "speaker": "C",
      "start": 169444,
      "text": "Yeah, it's great. And it's one of these types of projects you don't often get to do. So how for you, how did it come about? Like, why did you start of the project and how did you get to do such an interesting project?",
      "id": "ep_78_ut_12"
    },
    {
      "end": 297990,
      "speaker": "Mimi Onuoha",
      "start": 181386,
      "text": "Well, there are really two sides to it. One of them is practical and the other side is more just what I'm interested in. So on the practical side, I got this really great opportunity to do this Fulbright, which is a fund that pays for Americans to leave America and go and do anything anywhere else. It also pays for non Americans to come to the states. Yeah, yeah, that's nice, right? So I got this fund and it was in collaboration with National Geographic. So they were funding me to go somewhere and work on a project of my own choosing, and National Geographic was going to host the project. So it was this kind of nice opportunity. And then I got to work with the Royal College of Art in London and they said they would host me. So practically, I basically got funded to do a project that I wanted to do, which was like a dream. And then on the other side of it, I'm just very interested in this idea of people's subjectivity. As data. Yeah, as data subjects, I suppose, and their understanding of themselves as that. And I feel like a lot of us who work with data, we either do like personal, quantified self stuff, or you work with APIs or big data sets. And it's very rare to work with the people who actually are producing the data themselves and to know how they feel about it and what that process is like. So I wanted something where I could do like a typical sort of data project, but that seems like that on the outside. But in reality was more about this process of me being with people and convincing them to give me their data and then working with them and meeting with them regularly over the course of a month and being like, this is what I'm seeing. How do you feel about this? And also that layered within this idea of all of. They were giving me geolocation data and some of them personal messaging metadata. So not the actual messages, but times and modes that they communicated through. And it was interesting to me that all of that data is already collected by companies and corporations, but somehow it felt different to see that you have a person, face to face, who was getting it. And so it just provided me with this great opportunity to explore all of these different things.",
      "id": "ep_78_ut_13"
    },
    {
      "end": 305798,
      "speaker": "C",
      "start": 298062,
      "text": "Yeah, it's almost like an ethnographic approach where you explore somebody as, like, a phenomenon and you use that through data.",
      "id": "ep_78_ut_14"
    },
    {
      "end": 316770,
      "speaker": "Mimi Onuoha",
      "start": 305886,
      "text": "Exactly. It was like this ethnographic approach, but it was sort of masked within Dataviz and data analysis. But in reality, I got to do much more into that or the two combined.",
      "id": "ep_78_ut_15"
    },
    {
      "end": 324114,
      "speaker": "C",
      "start": 316842,
      "text": "And so you observed or analyzed four groups of people. Can you tell us who that was and what you found out about them?",
      "id": "ep_78_ut_16"
    },
    {
      "end": 356406,
      "speaker": "Mimi Onuoha",
      "start": 324154,
      "text": "Oh, definitely. So I actually worked with a lot of people, but I ended up settling on these four groups. And like I said, they had these existing relationships with each other, so. And they were all kind of going through some moment or asking a question of themselves. And the four groups were a couple, a family, a group of co workers and friends, and a group of roommates. And the couple were in a long distance relationship between the states and between the UK. And then the family were. They were in. I got to track their data in the week before they were about to have their first child.",
      "id": "ep_78_ut_17"
    },
    {
      "end": 356942,
      "speaker": "C",
      "start": 356510,
      "text": "Oh, wow.",
      "id": "ep_78_ut_18"
    },
    {
      "end": 384712,
      "speaker": "Mimi Onuoha",
      "start": 356998,
      "text": "So I got to see, what does the birth of a child look like? And then the roommates, one of them was moving out. So they were kind of. It was like seeing this data, see what we could see as they were leading up to this moment where one of their, somebody who was very close to them was about to move out. And then the co workers had this question of whether they were more friends or more co workers. Which one, which bond was more, like, important or was more visible? And so those were sort of the four situations that I got to focus upon.",
      "id": "ep_78_ut_19"
    },
    {
      "end": 387384,
      "speaker": "C",
      "start": 384808,
      "text": "Right, right, yeah. And what did you learn about them?",
      "id": "ep_78_ut_20"
    },
    {
      "end": 491264,
      "speaker": "Mimi Onuoha",
      "start": 387424,
      "text": "I learned a lot. So one of the things I learned was, of course, just the obvious, the most obvious sort of takeaway is that the data can't tell you everything at all. And in fact, you know, we create stories from, like, data is a story in itself, the way that we choose to collect it, what we decide to collect is a story, and we already frame that. But even beyond that, there, I think there's this idea that this myth of just being able to get just everything you need, the more data you have, the better. And this project really, really resisted that understanding, so. And it. And part of the way that it did that was that it combined the information that I was getting from their data. I would bring it to them, and then I would ask them what they thought, and they would kind of come back to me. So one example was the coworkers. I looked at their data, and you could see, you see there I was collecting their geolocation data, so I can see where they go. And you have it over the month. And over the course of the month, I could see the two of them spent more time with each other than they spent with the third. And later on, those two ended up moving in together. And I told them, I was like, well, I could have predicted this. Because you said, yeah, you spend more time together. I told them this, and they totally resisted it. They were like, no, it's not true. And then I sort of showed them, then they thought about it, and they said, well, you know, the third one of us is in a serious relationship, and the two of us are not. So they were like, this is why this is the case. And it was this very, just great moment of back and forth where I was like, this is it. And they had this sort of, wait, is that true? Is that who we are? And then they thought about it, and then they filled in all the gray for why that was the case. And it was this thing that I never would have been able to understand unless I was there with them, able to talk to them, but that they also never would have been able to understand unless I was there collecting their quantitative data. So it was this sort of back and forth that I learned for all of them. I had these moments.",
      "id": "ep_78_ut_21"
    },
    {
      "end": 498796,
      "speaker": "C",
      "start": 491604,
      "text": "So you could almost become a quantified life coach, actually, sort of like a.",
      "id": "ep_78_ut_22"
    },
    {
      "end": 503740,
      "speaker": "Mimi Onuoha",
      "start": 498820,
      "text": "Rebel quantified life coach. And I was like, this isn't going to tell you anything, but it will tell you something, but what do you think it is?",
      "id": "ep_78_ut_23"
    },
    {
      "end": 505636,
      "speaker": "C",
      "start": 503812,
      "text": "Exactly? Yeah, like a therapist.",
      "id": "ep_78_ut_24"
    },
    {
      "end": 553782,
      "speaker": "Mimi Onuoha",
      "start": 505700,
      "text": "Yeah, exactly. It was very interesting. And also getting to talk with them about why. I was like, why are you so open to letting me have this? What does this mean? And getting their understandings of what? Just, I don't know. I feel like I said before, there often feels like there's this gap between people who think and are paid to think and talk about data, and then people who don't maybe have that luxury. And this project really showed me that people are very interested in data when they feel like they can understand it and it's grounded and it relates to, to them. And often, I don't think that you get to see that very much, because there are terms that we, you know, look at this. This is like a data Stories podcast. There are terms that we use and throw around that makes sense to us. And it was really great seeing them begin seeing, watching them as they were like, oh, what does this mean? How can I negotiate this? How can I use this?",
      "id": "ep_78_ut_25"
    },
    {
      "end": 640094,
      "speaker": "Moritz Stefaner",
      "start": 553958,
      "text": "This is a good time to take a little break and talk about our sponsor this week. Click, who allows you to explore the hidden relationships within your data that lead to meaningful insights. Let your instincts lead the way to create personalized visualizations and dynamic dashboards with Qlik sense, which you can download for free at Qlik Datastories. That's Qlik Datastories. And this week we would like to feature a web application brought to you by Qlik that demonstrates how nicely you can represent also complex datasets using their products. It compares the cost of living in the Asia Pacific region in many different categories. So if you want to see if food or transport or education is especially costly or comparably cheap in cities like Tokyo, Sydney or Shanghai, you can easily find that out by experimenting with the interactive tools and visualizations on the click website. I especially like the treemap visualizations that show you directly how the price is in one city compared to all others in one chart. Who knew, for instance, that public buses are quite expensive in Sydney, but playing golf is comparably cheap? Anyways, check it out for yourself on the click website. The link is in the show notes. And make sure to try out Qlik sense for free at Qlik deries. That's Qlik de data stories. And now back to the show.",
      "id": "ep_78_ut_26"
    },
    {
      "end": 670234,
      "speaker": "C",
      "start": 640394,
      "text": "And. Yeah, and so you published your findings and the little data stories basically you constructed on the web. We will of course link the project from the show notes. You should definitely check it out. There's one, a little explanation, a sequence of statements and a little explorable data visualizations for each of these four groups. I think that's really nicely put together. Can we talk a bit about how you put that whole application together?",
      "id": "ep_78_ut_27"
    },
    {
      "end": 671090,
      "speaker": "Mimi Onuoha",
      "start": 670354,
      "text": "Definitely, yeah.",
      "id": "ep_78_ut_28"
    },
    {
      "end": 675574,
      "speaker": "C",
      "start": 671122,
      "text": "Because it seems quite a lot of stuff. There's a lot going on.",
      "id": "ep_78_ut_29"
    },
    {
      "end": 678066,
      "speaker": "Mimi Onuoha",
      "start": 676234,
      "text": "There's a lot of different pieces coming together.",
      "id": "ep_78_ut_30"
    },
    {
      "end": 678538,
      "speaker": "C",
      "start": 678130,
      "text": "Exactly.",
      "id": "ep_78_ut_31"
    },
    {
      "end": 701794,
      "speaker": "Mimi Onuoha",
      "start": 678586,
      "text": "One of them has to do with even, like I said, I'm super interested in collection. So the way that we were getting the data for each group, the main thing, every group, I would gather their geolocation data. So latitude and longitude, where they went every day for a month. And they. With some of. There were different apps. So one of them was open paths, which actually was created by Jared Thorpe, organizer of IO and his whole group.",
      "id": "ep_78_ut_32"
    },
    {
      "end": 702966,
      "speaker": "C",
      "start": 702094,
      "text": "At New York Times.",
      "id": "ep_78_ut_33"
    },
    {
      "end": 811878,
      "speaker": "Mimi Onuoha",
      "start": 703030,
      "text": "Yeah, yeah. And it was. Openpaths is great. It's fantastic because it's this open source tool. It also has not been updated in a long time, and I started to have to deal with these issues of open source can give you this data, and it's very open, but it wasn't the best, it wasn't the most granular data. And in fact, the moves app, which is moves is great, it also does geolocation tracking, but the problem is that it's owned by Facebook. And I told you I was talking about this, just this distance between personal ownership and corporation ownership. And so that was one thing that we had to deal with, is that there were two different ways of gathering it, and the one that was better was the one that was kind of antithetical to the point I was trying to make. But this is the reality of a lot of these tools. So getting the data itself was one thing. And then for actually showing it, what I realized, there was this a lot of it's very JavaScript heavy for trying to show the maps and kind of help you understand there's a slider and you can walk through the month for each group. But there was this question of how to make it into a story, which was something I hadn't even thought about when I was working on it, because I was so very much interested in this process. And I realized that presenting it was just as important as the experience of it. And even though, and that, and I had to understand that that experience of presenting it would not be the same as the experience I had in collecting it, but I needed to create a different one. And so I ended up using reveal j's, which is this sort of slideshow software for allowing people to really for like stepping people through the story. And once you've been the first time, you go to the site, you enter it and then it walks you through exactly what happened for everyone. And then once you, after you've experienced it once there's a point where you can just skip that and go straight to the data and just play around with that and see it. But just framing it became really important so that people would understand, like, this is where we came from, this is what we were doing, this is how this happened.",
      "id": "ep_78_ut_34"
    },
    {
      "end": 844130,
      "speaker": "C",
      "start": 811966,
      "text": "Yeah, yeah, yeah. And I found that quite smart to use the slide base like software or library to walk people through a data story. I hadn't seen that before, but it's quite smart because you can also have interactive charts on the slides if you want, or you can play with different media elements, very easily integrate video. So I think that's a very smart way to do this. Narratives on the web, everybody does these long scrollable websites sometimes. Yeah. Sometimes a sequence of slides can, can be the best solution, really.",
      "id": "ep_78_ut_35"
    },
    {
      "end": 853058,
      "speaker": "Mimi Onuoha",
      "start": 844202,
      "text": "And you can also, the good thing with slides is that once you realize what's happening, you can just fast forward. It gives the user a bit more control. They're like, okay, I get it. I read this. Moving on.",
      "id": "ep_78_ut_36"
    },
    {
      "end": 866890,
      "speaker": "C",
      "start": 853106,
      "text": "Yeah, and it's a nice way to chunk information. And so how was the design process for this? Did you go through a couple of different iterations or did you have a fairly clear idea already straight away how to do it?",
      "id": "ep_78_ut_37"
    },
    {
      "end": 965714,
      "speaker": "Mimi Onuoha",
      "start": 867002,
      "text": "Absolutely not at all. Nothing clear whatsoever. It was like I said, I went into this so focused on the process and this question of collection that when I first went into it, I didn't even really think about how important the presentation and visualization aspect of it was, which is just my own, like I said, my own biases. I'm so focused on this process that's hard to communicate. So it took me a really long time to figure out how to explain what it was I was doing and how to get it across to people. And just lots of testing and lots of talking to people, lots of working with, like, showing people things and having people be like, I don't understand what, like, you know, I wanted to start, and just the first thing I wanted was just to have a map and not even tell people where it was taking place. I was like, no, we're just gonna let everybody figure it out on their own. And then you realize you have to ground, like, you just have to give people something to hold onto. So, for instance, you know, it's in London. All of them have different, different colored maps to kind of separate them, different backgrounds, but they're all in the same city. And so that that helps ground it a bit. And you're like, okay, I see that these people are in this part, these are in this part of town, except for the long distance couple who are worldwide, they're global. But the rest of them, you get this sort of just these anchor points, I think. And that became a really important design. Just decision was thinking about, how do you tell this story? How does, it's, like I said before, the fact that my experience, I think the project is on two levels. So there's the story of the data, and then there's the story of my experience and working with people and what this understanding. And I kind of see them as like two different sides of it. And so they became two different processes.",
      "id": "ep_78_ut_38"
    },
    {
      "end": 977630,
      "speaker": "C",
      "start": 967454,
      "text": "Nice. I also see on the website, the code is on GitHub, so people can look how you made it. And there's also a press kit, which is also.",
      "id": "ep_78_ut_39"
    },
    {
      "end": 978742,
      "speaker": "Mimi Onuoha",
      "start": 977822,
      "text": "Yeah, yeah, yeah.",
      "id": "ep_78_ut_40"
    },
    {
      "end": 1007614,
      "speaker": "C",
      "start": 978838,
      "text": "No, but I think it's so important also to understand, like, as you said, like, having a good project idea is one thing, or, like, doing the data collection or what you're actually after, but, like, how you present presented afterwards and how you give people a chance to quickly understand what it's all about is super important in the end. Yeah. And so how was it received? Like, what happened after you launched the project? Was it more like quiet thing and nobody really noticed, or did you get a lot of attention? How did people react?",
      "id": "ep_78_ut_41"
    },
    {
      "end": 1076414,
      "speaker": "Mimi Onuoha",
      "start": 1008514,
      "text": "It was, I would say, quiet overall, with some spikes. There were some bumps. It was posted on flowing data, which was nice. That was. I gave it a bit of attention and I had, for National Geographic, we did this big presentation where we talked about it. So that was, you know, so there were some moments. Definitely got a bit of love in some places. I think the other thing is, like I said, I'm not really, you know, this press kit sort of makes it seem like I'm far more into, like, pushing it than I am in reality. The thing I was really interested, was interested in was how it would be for just my relationship with these people who I had been. I felt like I was sort of intimately connected to, but also very separate from at the same time. And it was interesting seeing how they received it. And there were, I think their reaction sort of raged. Some people were. Some of the groups were very, very, you know, some of the groups I'm still in touch with, like, the family, I. This, like, this child is very. Is really interesting to me. Yeah, this is a good example. The child. I never collected anything from this newborn baby, but you can see the whole story of this child through the data of everybody else around him.",
      "id": "ep_78_ut_42"
    },
    {
      "end": 1076950,
      "speaker": "C",
      "start": 1076494,
      "text": "Right.",
      "id": "ep_78_ut_43"
    },
    {
      "end": 1096672,
      "speaker": "Mimi Onuoha",
      "start": 1077062,
      "text": "And that's really interesting. And I, like, ate dinner with the family and hung out with this child. And that was, to me, that was somehow like a focal point of the experience was that. So I think that's. It's been interesting. And some of the people who I worked with still use the apps that they were that I asked them to download.",
      "id": "ep_78_ut_44"
    },
    {
      "end": 1097160,
      "speaker": "C",
      "start": 1096728,
      "text": "Oh, wow.",
      "id": "ep_78_ut_45"
    },
    {
      "end": 1105604,
      "speaker": "Mimi Onuoha",
      "start": 1097232,
      "text": "Yeah. So there's that for themselves. For themselves and all of them. I was like, here you can. Here's the data. Here you go. This is you. So that was pretty interesting.",
      "id": "ep_78_ut_46"
    },
    {
      "end": 1122964,
      "speaker": "C",
      "start": 1106184,
      "text": "Nice. Yeah. And you said the groups, how did they feel while you were tracking them? Like, did they find it creepy or did they forget about it fairly quickly? Like, how was this whole situation there?",
      "id": "ep_78_ut_47"
    },
    {
      "end": 1255828,
      "speaker": "Mimi Onuoha",
      "start": 1123744,
      "text": "It varied. So this is sort of another part of the project is how I actually recruited people. And I had a few different waves. And like I said, I actually gathered data from far more people. But these were the four who kind of. I was like, these are the best stories to tell, I think. And in the first wave of recruiting, I went to London. I didn't know it. I just was there in this country, and I kind of just told everybody who I met. I was like, I'm working on this project. I want to collect this day. This is what I'm trying to do. And I got quite a few people who were willing to do the project just by virtue of me saying it. And so their obligation was more to me than to the actual project. And then I had this other group. The second time I did it, I went for people who I did not know at all. And I sent out a lot of emails on listservs, just everywhere. I was like, oh, I'm recruiting. Does anybody want to participate in this? And so I got participants who were a part of it just because they were interested in this idea of gathering data on themselves. Right? And so those two groups, the reactions varied according to what group you were from. And so the people from the first group were so much more likely to be uncomfortable. They were, you know, obviously they were like, this is weird. And then I would show them some of the stuff. I was. I'd be like, oh, yeah, here's your data. And they would be like, whoa, is this anonymized? What does this mean? And so I had far more conversations with them about, like, security, privacy, and just like this, that kind of whole ecosystem. The second group, on the other hand, they were the complete opposite. They were almost data enthusiasts. They were like, yeah, I want to see this. This is interesting. It's another way of recording something about myself. I want to see what I can learn. And they were so, they weren't worried at all, if anything. They were like, more. More like, come on. Here, like, take this. Do you want my. Some of them. Some of them were like, do you want my social media data? Do you want this? Do you want that? And I was like, no, you're like, over asking for more than I can take. So that was. But that ended up being, I think, really telling for me, because it's really particularly working with that first group of people, people who are not as. Who are much more uncomfortable. I think that's great. That's so useful because it reveals your blind spots in a way, right? And it forces you to have to explain what it is. That's happening and why. And why you think it's important. So right there, there were different mixed reactions.",
      "id": "ep_78_ut_48"
    },
    {
      "end": 1276584,
      "speaker": "C",
      "start": 1255876,
      "text": "Yeah, yeah, yeah. And it's so interesting because it's, I think for all of us, there's, to some degree it's interesting and nice. And also we like to be represented also on a map maybe sometimes, you know, or like. Yeah. To be measured. But then there's also for all of us, this point where we say, like, oh, that's too much. Or that goes too far and too deep, and it can flip very quickly, I guess.",
      "id": "ep_78_ut_49"
    },
    {
      "end": 1311524,
      "speaker": "Mimi Onuoha",
      "start": 1277124,
      "text": "Yeah, exactly. Something we talk about a lot at data and society are the different relationships people have to data. So some people have this sort of data by choice relationship where some people are. It's like this data by coercion where you don't really get a choice and your data sort of taken from you. And this was very much like sorting people into that. Like, you get to choose, you know, if you're uncomfortable, you can back out at any time. But it was. I think what was interesting was that it did sort of. It was a nod to that fact that you're saying that people. People's relationships to it are very. They're different. And it depends on where you are situated and your feeling of power and control over lots of things.",
      "id": "ep_78_ut_50"
    },
    {
      "end": 1315940,
      "speaker": "C",
      "start": 1311644,
      "text": "Yeah, yeah, yeah, yeah. It's a topic that will keep us busy for a while.",
      "id": "ep_78_ut_51"
    },
    {
      "end": 1317124,
      "speaker": "Mimi Onuoha",
      "start": 1316132,
      "text": "Oh, yeah, yeah.",
      "id": "ep_78_ut_52"
    },
    {
      "end": 1319580,
      "speaker": "C",
      "start": 1317204,
      "text": "So you did the pathways project last year?",
      "id": "ep_78_ut_53"
    },
    {
      "end": 1320364,
      "speaker": "Mimi Onuoha",
      "start": 1319652,
      "text": "Yeah, last year.",
      "id": "ep_78_ut_54"
    },
    {
      "end": 1330076,
      "speaker": "C",
      "start": 1320404,
      "text": "So there was probably much of last year went into that. It was a huge effort. So what's up this year? What are you up to now? What are you. Can you tell us a bit what you're working on?",
      "id": "ep_78_ut_55"
    },
    {
      "end": 1330484,
      "speaker": "Mimi Onuoha",
      "start": 1330140,
      "text": "Absolutely.",
      "id": "ep_78_ut_56"
    },
    {
      "end": 1331436,
      "speaker": "C",
      "start": 1330524,
      "text": "What you're interested in.",
      "id": "ep_78_ut_57"
    },
    {
      "end": 1400094,
      "speaker": "Mimi Onuoha",
      "start": 1331500,
      "text": "Sure. So like I said, I remain really interested in data collection because I just think there's so much encoded in this moment and what I've been. I'm now a fellow at Data and Society Research Institute, and I have been working this year on a series of investigations into missing data sets. So these are spaces where, as what I call spaces that are data saturated. So there's tons of data collected around them, but then there are these very curious blank spots and something notably will not be collected. So an example that I always use, because it's very topical, is like, civilians killed by the police, which was. There was no data collected on that. There were no data, although there were loads of data collected on the whole justice system and on policing and on coherent data sets. Oh, wow. Right. And so I've been looking into a lot of these different spaces. And once you begin to look there, there's so many. It's spaces where there are loads of data collected and then just something that's just notably absent. And I've been spending this whole year really thinking about why are those there and what does it mean and when is it really powerful to not have data? Like, when does it really benefit a group to, like, say, no, we're not gonna have anything collected? And when is it actually, when does it take your power away? When you're like, there's nothing about us that can be represented.",
      "id": "ep_78_ut_58"
    },
    {
      "end": 1402654,
      "speaker": "C",
      "start": 1400174,
      "text": "So I've been, again, it can go both ways.",
      "id": "ep_78_ut_59"
    },
    {
      "end": 1406026,
      "speaker": "Mimi Onuoha",
      "start": 1402694,
      "text": "It goes, yeah, it goes. It's very nuanced. I've been trying to really pull that apart.",
      "id": "ep_78_ut_60"
    },
    {
      "end": 1406562,
      "speaker": "C",
      "start": 1406110,
      "text": "Interesting.",
      "id": "ep_78_ut_61"
    },
    {
      "end": 1421226,
      "speaker": "Mimi Onuoha",
      "start": 1406618,
      "text": "And working with different groups who have different needs who are like, oh, we don't have this. We want this, or we, we don't want this. And this is happening. And then also doing, being like, a weird artist and doing my own projects that are kind of investigations on it by myself. So that's my main topic of focus this year.",
      "id": "ep_78_ut_62"
    },
    {
      "end": 1424562,
      "speaker": "C",
      "start": 1421290,
      "text": "Fantastic. Yeah, yeah, that sounds great. Looking forward to see.",
      "id": "ep_78_ut_63"
    },
    {
      "end": 1440910,
      "speaker": "Mimi Onuoha",
      "start": 1424658,
      "text": "Yeah, I know things are gonna start coming up soon, so I've got, like, a GitHub up that's like, mimi anoha missing datasets and you can start to see, like, my thoughts on it and where I've begun. And then I've got some projects that we'll be launching in the next, a couple weeks around that. But, yeah, they just kind of tear, like, really forced us to look into the topic.",
      "id": "ep_78_ut_64"
    },
    {
      "end": 1445094,
      "speaker": "C",
      "start": 1440982,
      "text": "Yeah, nice. Yeah, much looking forward. So thanks so much. That's been great.",
      "id": "ep_78_ut_65"
    },
    {
      "end": 1446430,
      "speaker": "Mimi Onuoha",
      "start": 1445174,
      "text": "Yeah. Thank you.",
      "id": "ep_78_ut_66"
    },
    {
      "end": 1448406,
      "speaker": "C",
      "start": 1446622,
      "text": "Hope you have a safe trip back.",
      "id": "ep_78_ut_67"
    },
    {
      "end": 1452274,
      "speaker": "Mimi Onuoha",
      "start": 1448470,
      "text": "And you too. See you next year.",
      "id": "ep_78_ut_68"
    },
    {
      "end": 1464710,
      "speaker": "D",
      "start": 1455054,
      "text": "Hey, guys, thanks for listening to data stories again. Before you leave, we have a request if you can spend a couple of minutes rating us on iTunes, that would be extremely helpful for the show.",
      "id": "ep_78_ut_69"
    },
    {
      "end": 1495488,
      "speaker": "Moritz Stefaner",
      "start": 1464822,
      "text": "And here's also some information on the many ways you can get news directly from us. We're, of course, on twitter@twitter.com. Datastories. We have a Facebook page@Facebook.com. datastoriespodcast. All in one word. And we also have an email newsletter. So if you want to get news directly into your inbox and be notified whenever we publish an episode, you can go to our homepage datastory es and look for the link that you find on the bottom in the footer.",
      "id": "ep_78_ut_70"
    },
    {
      "end": 1507616,
      "speaker": "D",
      "start": 1495576,
      "text": "So one last thing that we want to tell you is that we love to get in touch with our listeners, especially if you want to suggest a way to improve the show or amazing people you want us to invite, or even projects you want us to talk about.",
      "id": "ep_78_ut_71"
    },
    {
      "end": 1510976,
      "speaker": "Moritz Stefaner",
      "start": 1507720,
      "text": "Yeah, absolutely. So don't hesitate to get in touch with us.",
      "id": "ep_78_ut_72"
    },
    {
      "end": 1512728,
      "speaker": "C",
      "start": 1511120,
      "text": "It's always a great thing for us.",
      "id": "ep_78_ut_73"
    },
    {
      "end": 1516924,
      "speaker": "Moritz Stefaner",
      "start": 1512856,
      "text": "And that's all for now. See you next time, and thanks for listening to data stories.",
      "id": "ep_78_ut_74"
    },
    {
      "end": 1539734,
      "speaker": "D",
      "start": 1519664,
      "text": "Data stories is brought to you by click, who allows you to explore the hidden relationships within your data that lead to meaningful insights. Let your instincts lead the way to create personalized visualizations and dynamic dashboards with Qlik sense, which you can download for free at www. Dot clic dot de stories.",
      "id": "ep_78_ut_75"
    }
  ],
  "confidence": 0.939127978923595,
  "audio_duration": 1540,
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_status_code": null,
  "webhook_auth": false,
  "webhook_auth_header_name": null,
  "speed_boost": false,
  "auto_highlights_result": null,
  "auto_highlights": false,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_audio_quality": null,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "content_safety": false,
  "iab_categories": true,
  "content_safety_labels": {
    "status": "unavailable",
    "results": [],
    "summary": {}
  },
  "language_detection": false,
  "language_detection_threshold": null,
  "language_confidence": null,
  "custom_spelling": null,
  "throttled": false,
  "auto_chapters": true,
  "summarization": false,
  "summary_type": null,
  "summary_model": null,
  "custom_topics": false,
  "topics": [],
  "speech_threshold": null,
  "speech_model": "best",
  "chapters": [
    {
      "summary": " Datastores is brought to you by Qlik, who allows you to explore the hidden relationships within your data. Let your instincts lead the way to create personalized visualizations and dynamic dashboards with Qlik sense.",
      "gist": "Qlik Sense: Finding the Hidden Links in Your Data",
      "headline": "Qlik sense lets you explore hidden relationships within your data that lead to meaningful insights",
      "start": 200,
      "end": 36204,
      "id": "ep_78_ch_0"
    },
    {
      "summary": "Mimi on Waha: Did you enjoy the festival? It was really good, very inspiring. Lots of good people. Very thought provoking. If you have a chance to go there one day, check it out, everyone should come.",
      "gist": "Interview",
      "headline": "We both attended EYEO festival, so I wanted to talk to Mimi",
      "start": 47264,
      "end": 93406,
      "id": "ep_78_ch_1"
    },
    {
      "summary": "Mimi is an artist and researcher at the Data and society research institute. Her latest project is a data storytelling project involving four groups of Londoners. She says she wanted to explore the idea of people's subjectivity as data.",
      "gist": "Interviews with Mimi Filippi",
      "headline": "Mimi is an artist and researcher working on data storytelling projects",
      "start": 93590,
      "end": 316770,
      "id": "ep_78_ch_2"
    },
    {
      "summary": "The project tracked four groups of people. The groups included a couple, a family, a group of co workers and friends. What did you learn about them? The data can't tell you everything at all.",
      "gist": "Quantum Intelligence: The Power of Data",
      "headline": "You analyzed four groups of people and what did you learn about them",
      "start": 316842,
      "end": 553782,
      "id": "ep_78_ch_3"
    },
    {
      "summary": "This week we feature a web application brought to you by Qlik. It compares the cost of living in the Asia Pacific region in many different categories. Let your instincts lead the way to create personalized visualizations and dynamic dashboards with Qlik sense.",
      "gist": "Sponsor: Qlik Deata",
      "headline": "Qlik sense allows you to explore hidden relationships within your data",
      "start": 553958,
      "end": 638162,
      "id": "ep_78_ch_4"
    },
    {
      "summary": "CNN's John Defterios has created a web app that turns data into data stories. The app uses slide-based software to walk users through the data. How did you put that whole application together?",
      "gist": "How To Tell a Data Story in a Slide",
      "headline": "You published your findings and little data stories basically you constructed on the web",
      "start": 638338,
      "end": 855934,
      "id": "ep_78_ch_5"
    },
    {
      "summary": "The project is on two levels. There's the story of the data, and then there's the stories of my experience and working with people. How was it received after you launched the project? Was it quiet overall, with some spikes?",
      "gist": "The Story of the Big Data project",
      "headline": "How did the project receive after launch? How did people react",
      "start": 856594,
      "end": 1107048,
      "id": "ep_78_ch_6"
    },
    {
      "summary": "The reactions varied according to what group you were from. The people from the first group were so much more likely to be uncomfortable. The second group, on the other hand, were almost data enthusiasts. There were different mixed reactions.",
      "gist": "The Creepy Data Project",
      "headline": "How did people react when you asked them for data on themselves",
      "start": 1107136,
      "end": 1317124,
      "id": "ep_78_ch_7"
    },
    {
      "summary": "I remain really interested in data collection. I have been working this year on a series of investigations into missing data sets. It's spaces where there are loads of data collected and then just something that's just notably absent. When is it really powerful to not have data?",
      "gist": "A Few Words on Missing Data Sets",
      "headline": "So you did the pathways project last year? Yeah, last year",
      "start": 1317204,
      "end": 1457862,
      "id": "ep_78_ch_8"
    },
    {
      "summary": "Before you leave, we have a request if you can spend a couple of minutes rating us on iTunes. Here's also some information on the many ways you can get news directly from us. We love to get in touch with our listeners, especially if you want to suggest a way to improve the show.",
      "gist": "Data Stories",
      "headline": "If you can spend a couple of minutes rating us on iTunes, that would be extremely helpful",
      "start": 1457998,
      "end": 1539734,
      "id": "ep_78_ch_9"
    }
  ],
  "disfluencies": false,
  "entity_detection": false,
  "sentiment_analysis": false,
  "sentiment_analysis_results": null,
  "entities": null,
  "speakers_expected": null,
  "summary": null,
  "custom_topics_results": null,
  "episode_num": 78,
  "episode_metadata": {
    "speakers": [
      "Mimi Onuoha",
      "Moritz Stefaner"
    ],
    "WPid": "662",
    "url": "https://datastori.es/podlove/file/2589/s/feed/c/mp3/78-mimi-onuoha.mp3",
    "episode_title": "Mimi Onuoha on Visualizing People's Lives through Mobile Data"
  }
}