{
  "id": "3ebb3a52-ed93-49d3-ab95-3c026af12345",
  "language_model": "assemblyai_default",
  "acoustic_model": "assemblyai_default",
  "language_code": "en_us",
  "status": "completed",
  "audio_url": "https://datastori.es/podlove/file/5328/s/feed/c/mp3/Datastories-126.mp3",
  "utterances": [
    {
      "end": 5650,
      "speaker": "Nathan Yau",
      "start": 160,
      "text": "The visualization has become more of like the article, people are telling stories with just the visualization itself.",
      "id": "ep_126_ut_0"
    },
    {
      "end": 31914,
      "speaker": "Moritz Stefaner",
      "start": 24630,
      "text": "Hi, everyone. Welcome to a new episode of data stories. My name is Moritz Stefaner, and I'm an independent designer of data visualizations.",
      "id": "ep_126_ut_1"
    },
    {
      "end": 38394,
      "speaker": "Enrico Bertini",
      "start": 32022,
      "text": "And I am Enrico Bertini. I am a professor at NYU in New York City, where I do research in data visualization.",
      "id": "ep_126_ut_2"
    },
    {
      "end": 49802,
      "speaker": "Moritz Stefaner",
      "start": 38562,
      "text": "Right. And on this podcast, we talk about data visualization together, about data analysis, statistics, and generally the role data plays in our lives. And usually we do that with a guest we invite on the show.",
      "id": "ep_126_ut_3"
    },
    {
      "end": 77294,
      "speaker": "Enrico Bertini",
      "start": 49866,
      "text": "But before starting, just a quick note. So our podcast is listener supported, so there's no ads anymore. And if you enjoy the show, please consider supporting us with recurringpayments on patreon.com Datastories. Or if you don't like this recurring payment model, you can also send us now one time donations on PayPal. You just go to PayPal me Datastories.",
      "id": "ep_126_ut_4"
    },
    {
      "end": 95790,
      "speaker": "Moritz Stefaner",
      "start": 77422,
      "text": "Yeah. And we got a few of these one time donations over the summer. Like $10, $15. Yeah. It's a great joy for us. Whenever that email arrives. I'm super happy. Keep those coming in. Yeah. So we took a little break over summer. Enrico, how was your summer? All good?",
      "id": "ep_126_ut_5"
    },
    {
      "end": 97094,
      "speaker": "Enrico Bertini",
      "start": 95910,
      "text": "It was too good.",
      "id": "ep_126_ut_6"
    },
    {
      "end": 98090,
      "speaker": "Moritz Stefaner",
      "start": 97182,
      "text": "Too good.",
      "id": "ep_126_ut_7"
    },
    {
      "end": 105806,
      "speaker": "Enrico Bertini",
      "start": 99910,
      "text": "Too short and too good. Yeah, I need more, but I can relate.",
      "id": "ep_126_ut_8"
    },
    {
      "end": 114070,
      "speaker": "Moritz Stefaner",
      "start": 105998,
      "text": "I took much of July off, and I will take some time off in October again. So now I squeezed everything into August and September.",
      "id": "ep_126_ut_9"
    },
    {
      "end": 117486,
      "speaker": "Enrico Bertini",
      "start": 114150,
      "text": "I'm super stressed out, but I did.",
      "id": "ep_126_ut_10"
    },
    {
      "end": 120024,
      "speaker": "Moritz Stefaner",
      "start": 117518,
      "text": "Have a good July, admittedly.",
      "id": "ep_126_ut_11"
    },
    {
      "end": 121968,
      "speaker": "Enrico Bertini",
      "start": 120112,
      "text": "That's something. That's something already.",
      "id": "ep_126_ut_12"
    },
    {
      "end": 131104,
      "speaker": "Moritz Stefaner",
      "start": 122064,
      "text": "Yeah. And now conference season is coming up, so in fall we have the big Berlin weeks of data visualization in October. Right.",
      "id": "ep_126_ut_13"
    },
    {
      "end": 133064,
      "speaker": "Enrico Bertini",
      "start": 131272,
      "text": "I'm so excited. Yeah.",
      "id": "ep_126_ut_14"
    },
    {
      "end": 138728,
      "speaker": "Moritz Stefaner",
      "start": 133192,
      "text": "So there's information plus October, I think, 20 to 21.",
      "id": "ep_126_ut_15"
    },
    {
      "end": 139080,
      "speaker": "Enrico Bertini",
      "start": 138784,
      "text": "Yeah.",
      "id": "ep_126_ut_16"
    },
    {
      "end": 148296,
      "speaker": "Moritz Stefaner",
      "start": 139120,
      "text": "It's the weekend before IEEE viz, the big academic conference, which is right in the week after. And we will both be there, Enrico, right?",
      "id": "ep_126_ut_17"
    },
    {
      "end": 148792,
      "speaker": "Nathan Yau",
      "start": 148328,
      "text": "Yeah.",
      "id": "ep_126_ut_18"
    },
    {
      "end": 149620,
      "speaker": "Moritz Stefaner",
      "start": 148896,
      "text": "Yes.",
      "id": "ep_126_ut_19"
    },
    {
      "end": 160436,
      "speaker": "Enrico Bertini",
      "start": 150160,
      "text": "Every four years at least. Right. Last time we did it, I think this in Europe is every 40 years. So last time we did it in Paris.",
      "id": "ep_126_ut_20"
    },
    {
      "end": 161596,
      "speaker": "Moritz Stefaner",
      "start": 160548,
      "text": "In Paris, yeah.",
      "id": "ep_126_ut_21"
    },
    {
      "end": 165972,
      "speaker": "Enrico Bertini",
      "start": 161748,
      "text": "I don't remember if it's three or four years, but that's the rule.",
      "id": "ep_126_ut_22"
    },
    {
      "end": 179038,
      "speaker": "Moritz Stefaner",
      "start": 166036,
      "text": "Anyways, we use the opportunity and do a listener meetup. So mark your calendars with a big red pen. October 22, evening. Come to Berlin and hang out with us.",
      "id": "ep_126_ut_23"
    },
    {
      "end": 184770,
      "speaker": "Enrico Bertini",
      "start": 179204,
      "text": "Yeah. Even if you're not attending any of these conferences and you're around and you want to meet, you can just come.",
      "id": "ep_126_ut_24"
    },
    {
      "end": 187514,
      "speaker": "Moritz Stefaner",
      "start": 184890,
      "text": "No, sure. We just hang out, have a beer and have a chat.",
      "id": "ep_126_ut_25"
    },
    {
      "end": 187890,
      "speaker": "Enrico Bertini",
      "start": 187562,
      "text": "Yeah.",
      "id": "ep_126_ut_26"
    },
    {
      "end": 202010,
      "speaker": "Moritz Stefaner",
      "start": 187970,
      "text": "Details to follow. So this will be fun. Anyways, let's bring our guest on. So today we have a super special guest. We always say we have a special guest, but this one is actually really super special because it's Nathan Yao from flowing data. Hi, Nathan.",
      "id": "ep_126_ut_27"
    },
    {
      "end": 202794,
      "speaker": "Enrico Bertini",
      "start": 202090,
      "text": "Hi, Nathan.",
      "id": "ep_126_ut_28"
    },
    {
      "end": 204114,
      "speaker": "Nathan Yau",
      "start": 202882,
      "text": "Hey, how's it going?",
      "id": "ep_126_ut_29"
    },
    {
      "end": 213662,
      "speaker": "Moritz Stefaner",
      "start": 204242,
      "text": "Thanks for joining us. And it's so special because we literally had you on our list since the beginning of the podcast. We finally have your answer. This is super amazing.",
      "id": "ep_126_ut_30"
    },
    {
      "end": 219158,
      "speaker": "Nathan Yau",
      "start": 213726,
      "text": "Yeah, I've been listening since you started, so it's weird to be on the show.",
      "id": "ep_126_ut_31"
    },
    {
      "end": 229958,
      "speaker": "Moritz Stefaner",
      "start": 219334,
      "text": "So this has been a long time coming, but it's very good. So Nathan, can you tell us a bit about yourself? What's your background? What are you doing? Anything our listeners might be interested in?",
      "id": "ep_126_ut_32"
    },
    {
      "end": 243818,
      "speaker": "Nathan Yau",
      "start": 230054,
      "text": "Sure. So my official title is statician. I run flowingdata.com. i've been doing it for a little over a decade. I went to grad school in statistics, background statistics, and I specialize in visualization.",
      "id": "ep_126_ut_33"
    },
    {
      "end": 253650,
      "speaker": "Moritz Stefaner",
      "start": 243954,
      "text": "Right, right. Yeah. And flowing data. I assume most people know the blog, but if you don't know it, stop listening. Go to flowingdata.com.",
      "id": "ep_126_ut_34"
    },
    {
      "end": 255354,
      "speaker": "Enrico Bertini",
      "start": 253810,
      "text": "You lost ten years of.",
      "id": "ep_126_ut_35"
    },
    {
      "end": 273598,
      "speaker": "Moritz Stefaner",
      "start": 255482,
      "text": "Yeah, right. Just spend a week there. I mean, as Nathan said, it's been around for ten years, and he's been continuously posting. And I would say it's the most comprehensive overall resource you can find about data visualization today. Right. I mean, just in amount of what you have covered. I mean, that's, that's my opinion at least.",
      "id": "ep_126_ut_36"
    },
    {
      "end": 274430,
      "speaker": "Nathan Yau",
      "start": 273734,
      "text": "Thanks.",
      "id": "ep_126_ut_37"
    },
    {
      "end": 281446,
      "speaker": "Moritz Stefaner",
      "start": 274590,
      "text": "So do you have any stats? Like do you have any stats on the blog? Like how many posts and, you know, any, any KPI's you can share with.",
      "id": "ep_126_ut_38"
    },
    {
      "end": 296014,
      "speaker": "Nathan Yau",
      "start": 281478,
      "text": "Us for having a data blog? I actually know very few numbers about my blog, but I. So ten years and I do it. I've had at least one post per day or every weekday for those ten years. Wow, look at that. So you can do the math on that.",
      "id": "ep_126_ut_39"
    },
    {
      "end": 297668,
      "speaker": "Moritz Stefaner",
      "start": 296102,
      "text": "Thousands. Thousands.",
      "id": "ep_126_ut_40"
    },
    {
      "end": 298136,
      "speaker": "Enrico Bertini",
      "start": 297774,
      "text": "Yeah.",
      "id": "ep_126_ut_41"
    },
    {
      "end": 314660,
      "speaker": "Moritz Stefaner",
      "start": 298208,
      "text": "Yeah. Wow. Yeah. And this tenacity is very admirable, and I think we'll come back to that. How you keep that rhythm. I'm really, really interested. So this is the main thing you do also, right? It's running the blog and anything around it, or do you also have another job?",
      "id": "ep_126_ut_42"
    },
    {
      "end": 325450,
      "speaker": "Nathan Yau",
      "start": 315080,
      "text": "Flowing data is my main job. I have an appointment with the Census Bureau, but I put in very little time with that. So the flowing data is my full time job.",
      "id": "ep_126_ut_43"
    },
    {
      "end": 347530,
      "speaker": "Moritz Stefaner",
      "start": 325560,
      "text": "Cool. And I think that's really interesting that you were able to turn that. I mean, of course, hobby in the beginning as any block into somewhat sustainable main occupation which is really cool. So how does a normal weekday or a week look for you? Is it like, do you do pretty much the same thing every day, or how do you structure your work?",
      "id": "ep_126_ut_44"
    },
    {
      "end": 404842,
      "speaker": "Nathan Yau",
      "start": 348110,
      "text": "It's pretty scattered because I have kids and then my wife has an irregular schedule, so we don't have, we both have irregular schedules as a result. So my schedule revolves around when my wife has a day off. And so usually I'll have at least two days of full time work where my kids are in school. That's guaranteed. And then there's overlapping days where I can work and my wife is working. So usually I try at the beginning of the week to have things prepared for the week as far as public facing posts. So I have a, there's a public side and then there's a membership site. And so usually I have, I have a lot of bookmarks and I try to write things and schedule things, and then on the full days I'll work on tutorials or projects and things that are interesting me at whatever time.",
      "id": "ep_126_ut_45"
    },
    {
      "end": 440840,
      "speaker": "Moritz Stefaner",
      "start": 404986,
      "text": "Right. So yeah, maybe we should also explain. So you have the blog which has posts about interesting developments and data visualization, interesting projects. Then you have your own projects. So sometimes you do data visualization projects. So you have this data under load series, which I always enjoy. Then you have a members section of the site where people can join the flowing data club, basically. And then you have access to, I think, tutorials and a special newsletter. Things like this, right?",
      "id": "ep_126_ut_46"
    },
    {
      "end": 499106,
      "speaker": "Nathan Yau",
      "start": 441220,
      "text": "Yeah, it's kind of, it's evolved over the years because it started as, it was just a notebook where I could write things. So I was in grad school and I had just finished my second year at UCLA, and then I had to move to Buffalo on the other side of the country. And so I didn't have classmates to talk to anymore other than phone calls. So I started flowing data and I just started cataloging things that I liked and trying to document some kind of thoughts or critical thinking in there. And then it just kind of went from there and somehow it grew. And then eventually the membership side started maybe six years ago. And that part is about helping people learn how to visualize data and how to maybe make some of the projects that I make or try to break it down into more basic steps where people can use that to apply it to their own data.",
      "id": "ep_126_ut_47"
    },
    {
      "end": 503350,
      "speaker": "Enrico Bertini",
      "start": 499258,
      "text": "You also have been publishing a few books during this time, right?",
      "id": "ep_126_ut_48"
    },
    {
      "end": 524570,
      "speaker": "Nathan Yau",
      "start": 504690,
      "text": "Yeah, that was a really long time ago. And for me at least, I think I wrote two books. They were both during grad school, so one was in my second year of grad school, 2010, I think. And the most recent one was I was writing it in 2012, got published in, in 2013.",
      "id": "ep_126_ut_49"
    },
    {
      "end": 525710,
      "speaker": "Moritz Stefaner",
      "start": 524990,
      "text": "Okay.",
      "id": "ep_126_ut_50"
    },
    {
      "end": 537926,
      "speaker": "Nathan Yau",
      "start": 525830,
      "text": "But those were both kind of fed off flowing data. And the first one is more tutorialish. It has r code and a little bit of JavaScript, a little bit of flash. So that's what the time was back.",
      "id": "ep_126_ut_51"
    },
    {
      "end": 541010,
      "speaker": "Moritz Stefaner",
      "start": 537958,
      "text": "Then that dated clearly.",
      "id": "ep_126_ut_52"
    },
    {
      "end": 577064,
      "speaker": "Enrico Bertini",
      "start": 541590,
      "text": "So I think what is really interesting about your work is that I think at the beginning, when visualization started getting popular, there were a few blogs around. Right. And now after ten plus years, there's basically almost nothing out there. I think the only person has been going on for a long time as well has been Robert Kosaro with Eagereyes.org. So what's the, yeah, so how did you do that? Right. I think many people failed. Right. What's the, what's the formula?",
      "id": "ep_126_ut_53"
    },
    {
      "end": 578464,
      "speaker": "Moritz Stefaner",
      "start": 577152,
      "text": "Last man standing.",
      "id": "ep_126_ut_54"
    },
    {
      "end": 580128,
      "speaker": "Enrico Bertini",
      "start": 578592,
      "text": "Yeah, last man standing.",
      "id": "ep_126_ut_55"
    },
    {
      "end": 596804,
      "speaker": "Nathan Yau",
      "start": 580224,
      "text": "The formula is to have fun. Yeah. So that's a little bit sad to me because when I first got into visualization, I googled visualization the first time I heard of it, and then that brought me to information aesthetics with Andrew Vande Moere.",
      "id": "ep_126_ut_56"
    },
    {
      "end": 597396,
      "speaker": "Enrico Bertini",
      "start": 596932,
      "text": "Yeah.",
      "id": "ep_126_ut_57"
    },
    {
      "end": 598924,
      "speaker": "Nathan Yau",
      "start": 597468,
      "text": "And that it's still there.",
      "id": "ep_126_ut_58"
    },
    {
      "end": 604004,
      "speaker": "Enrico Bertini",
      "start": 598972,
      "text": "But infosthetics.com.com was actually was born earlier than flowing data. I didn't realize that.",
      "id": "ep_126_ut_59"
    },
    {
      "end": 605412,
      "speaker": "Nathan Yau",
      "start": 604012,
      "text": "Yeah, I think maybe by a couple.",
      "id": "ep_126_ut_60"
    },
    {
      "end": 608202,
      "speaker": "Enrico Bertini",
      "start": 605436,
      "text": "Of years in my memory they were not. Okay.",
      "id": "ep_126_ut_61"
    },
    {
      "end": 613126,
      "speaker": "Nathan Yau",
      "start": 608316,
      "text": "Yeah. Oh, and I think I found Moritz. I think I found well formed data.",
      "id": "ep_126_ut_62"
    },
    {
      "end": 616014,
      "speaker": "Moritz Stefaner",
      "start": 613318,
      "text": "I had a blog too. Yeah, yeah.",
      "id": "ep_126_ut_63"
    },
    {
      "end": 619918,
      "speaker": "Nathan Yau",
      "start": 616062,
      "text": "Cause you were there before already, right? What with well formed data.",
      "id": "ep_126_ut_64"
    },
    {
      "end": 628686,
      "speaker": "Moritz Stefaner",
      "start": 620094,
      "text": "Yeah. But I think we started off pretty much the same time in my recollection, but maybe, yeah, maybe a few weeks or months before you or something.",
      "id": "ep_126_ut_65"
    },
    {
      "end": 629438,
      "speaker": "Enrico Bertini",
      "start": 628758,
      "text": "Yeah.",
      "id": "ep_126_ut_66"
    },
    {
      "end": 681250,
      "speaker": "Nathan Yau",
      "start": 629614,
      "text": "Okay. Yeah. And I saw Robert, and so infosthetics was kind of more on the art side and Eagereyes.org with Robert was more on the technical visualization side. So I was coming from statistics. I was more interested in the data. I guess I've always been more interested in the data than the forms of the data. And visualization just happens to be the best medium to communicate data to a large number of people. So I guess because I like the data part so much, I don't get too bored because the topics for data change. And then I can look at the methods, but I can also look at the topics and I focus probably a little bit less, maybe less than I should then on visualization research and kind of like perception studies and things like that.",
      "id": "ep_126_ut_67"
    },
    {
      "end": 706072,
      "speaker": "Enrico Bertini",
      "start": 682110,
      "text": "So I think a large proportion of the things that you post on flowing data is basically. Yeah. Things that you find around on the web. Right. So you're basically making people aware of what is happening in this world. So I'm just curious to hear from you. How do you do that? How do you keep track of what is going on? If you feel comfortable revealing that.",
      "id": "ep_126_ut_68"
    },
    {
      "end": 708420,
      "speaker": "Nathan Yau",
      "start": 706216,
      "text": "Sure, sure. No, it's great.",
      "id": "ep_126_ut_69"
    },
    {
      "end": 719074,
      "speaker": "Enrico Bertini",
      "start": 709640,
      "text": "I can say that. Right? Because if you want to know what is going on, you just go on flowing data. Right. You'll find it there.",
      "id": "ep_126_ut_70"
    },
    {
      "end": 719398,
      "speaker": "Moritz Stefaner",
      "start": 719192,
      "text": "Yeah.",
      "id": "ep_126_ut_71"
    },
    {
      "end": 730530,
      "speaker": "Enrico Bertini",
      "start": 719414,
      "text": "But you cannot do that kind of radar. Radar out there. If something is happening, you're gonna capture it. So, yeah. You must have some system to make this possible.",
      "id": "ep_126_ut_72"
    },
    {
      "end": 784724,
      "speaker": "Nathan Yau",
      "start": 731070,
      "text": "I guess it's not really a secret. I just. I subscribe to a lot of blogs through RSS, and then I look at Twitter. Twitter, I have, like, a love hate thing with. It's. It helps me find things, but when I go on, I end up feeling mad about something. But there's usually things that start on Twitter or through other people's blogs, and then I can kind of either go deeper or I can google things. And a lot of my own projects are just from my everyday experiences, and I'll have a question and then I'll just try to answer it with data. So that's why a lot of my projects are kind of. They're pretty benign. They're about just regular stuff, like waiting for a table, things like that. But I think a lot of it, it just happens to be like, I'm trying to learn how to visualize data myself, and then everything that kind of feeds into that, that helps me, I post because it will probably help someone else.",
      "id": "ep_126_ut_73"
    },
    {
      "end": 819064,
      "speaker": "Moritz Stefaner",
      "start": 784812,
      "text": "Yeah, yeah, yeah. I think that's also part of the tone of your blog is that it always sounds a bit like you thinking out loud. Right. It's like, oh, let's see what we can do here. Or let's see how that was made. Or also, if you read an article, you have some. Yeah, here's some thoughts around them. But it's always very straightforward writing. I really appreciate that. And I think you found both in your visuals, but also in your text, a certain style. Obviously by now, after ten years, one would expect. That seems to work.",
      "id": "ep_126_ut_74"
    },
    {
      "end": 825540,
      "speaker": "Nathan Yau",
      "start": 819192,
      "text": "Yeah. My main writing style is I pretend I'm talking to my friend from high school.",
      "id": "ep_126_ut_75"
    },
    {
      "end": 827584,
      "speaker": "Enrico Bertini",
      "start": 825840,
      "text": "Right, that's perfect. Yeah.",
      "id": "ep_126_ut_76"
    },
    {
      "end": 830384,
      "speaker": "Nathan Yau",
      "start": 827632,
      "text": "Yeah. So he doesn't know data, and then I just. I just write. Yeah.",
      "id": "ep_126_ut_77"
    },
    {
      "end": 841984,
      "speaker": "Moritz Stefaner",
      "start": 830392,
      "text": "But that might be part of why it's so approachable. Right. It's like it doesn't talk down on you or anything, or. But it's just straightforward conversation about what's. What's going on, right?",
      "id": "ep_126_ut_78"
    },
    {
      "end": 894554,
      "speaker": "Nathan Yau",
      "start": 842072,
      "text": "Yeah, I think so. Through the ten years there's always, blogs have come up and then have faded away and a lot of them were saying they would open like their very first post would be about how there needs to be a more serious part of visualization and how it's not about just having fun. You have to be more critical, ask questions and, and which is you definitely need to have, but you can't have it all the time. From a research perspective you can, but you can't just write about that every single day because I think at some point you kind of realize that you're, you're repeating yourself a lot because you're going after the same insights or same aesthetics or same baseline. You're trying to get people to reach a baseline of understanding and there's only so many ways that you can kind of talk about it or explain the data, especially if it's just you.",
      "id": "ep_126_ut_79"
    },
    {
      "end": 947462,
      "speaker": "Moritz Stefaner",
      "start": 894722,
      "text": "Yeah. And I think our scene is maybe also prone a bit too. Yeah, it depends. So some people say it's prone to not really think about what we do, but just celebrate anything that's sort of colorful. But I mean from my perspective it's also prone to being overly critical of them like of ourselves and like overthinking things. Often, you know, it's like, you know, it's like, and I know quite a lot of people who have good projects in their drawer and I've seen them and I know they don't push them out because somehow they feel it's like, ah, maybe it's not good enough yet. You know, it's not, it looks like this other project I've seen, I didn't find a way to make it really unique. You know, it's like sometimes it's better to just push things out and move on. Right. And so maybe this overly like meta, mega sophisticated debate scares people off as well, right?",
      "id": "ep_126_ut_80"
    },
    {
      "end": 952078,
      "speaker": "Nathan Yau",
      "start": 947526,
      "text": "Yeah, it seems like people, especially beginners, they're worried that they're doing it wrong.",
      "id": "ep_126_ut_81"
    },
    {
      "end": 952622,
      "speaker": "Moritz Stefaner",
      "start": 952174,
      "text": "Right.",
      "id": "ep_126_ut_82"
    },
    {
      "end": 995250,
      "speaker": "Nathan Yau",
      "start": 952726,
      "text": "And a lot of the time it's, maybe the form doesn't even matter so much. It's that they're, they have a really interesting data set and they have like they found something really interesting, but they don't want to publish the chart or publish a graph because maybe someone might tell them that it's the wrong type of graph or wrong color scheme or something like that. Yeah, you kind of just, but that's the way you learn is you publish things and then you get that feedback and then you kind of go from there you decide which one you want to take seriously and what you kind of want to ignore, put in the back of your head instead of leading forward with every single project.",
      "id": "ep_126_ut_83"
    },
    {
      "end": 1011446,
      "speaker": "Moritz Stefaner",
      "start": 995630,
      "text": "And I must say, your tutorials often show how, okay, here's something interesting in the data, and here's a little trick, how to make it more neat or like, how to find a nice way to display it. So, and I think that's exactly the spirit. And that's so often it's already, like, totally enough.",
      "id": "ep_126_ut_84"
    },
    {
      "end": 1012210,
      "speaker": "Nathan Yau",
      "start": 1011558,
      "text": "Right?",
      "id": "ep_126_ut_85"
    },
    {
      "end": 1041830,
      "speaker": "Moritz Stefaner",
      "start": 1012710,
      "text": "Yeah, I mean, now that we. Okay, we are in the meta discussion, why not stay there? I mean, you followed the field for so long, like, what's your perception of, what's the big arc? Like? Is there a big arc? Like, thinking back ten years, five years, do you feel like, are we making progress? Have things changed? How have they changed? Where do you see things headed? What's your take on the development?",
      "id": "ep_126_ut_86"
    },
    {
      "end": 1154308,
      "speaker": "Nathan Yau",
      "start": 1042650,
      "text": "So I think it's a couple, there's a lot of things, but there's. With visualization specifically, I remember starting at the beginning, and it was kind of people putting, it was a, what was it? It was like a substitute for. It was the online version of PowerPoint. So people were posting slides and kind of very basic things, and they had words, and the slides were a supplement to the words. And then it's kind of moved toward, oh, yeah, it got, went into really big infographics at some point for a few years. So the words found themselves onto the graphic because everything was encapsulated in the graphic. And so now the visualization has become more of like the article, or people are telling stories with just the visualization itself, and then the words are also there to complement, so they kind of are more intertwined. And so I think that has to do with people getting used to the visual form, but they're also used to thinking about data a little bit more beyond kind of those PowerPoint spreadsheets. I think with data literacy, there's still a lot, a long way to go, but people are kind of understanding it a little bit better, maybe, or grasping uncertainty a little bit better, especially since 2016, where there was a whole bunch of uncertainty going on during one night. And so people started kind of paying attention to those things and being more wary of estimates and forecasts. And so when people become more data literate, understanding the concepts, then the understanding of the visualization can feed off of that. But if you don't understand the data, then us as visualization, people can do as much as we want. But if people don't understand the data, then there's no point in doing the visualization.",
      "id": "ep_126_ut_87"
    },
    {
      "end": 1163662,
      "speaker": "Moritz Stefaner",
      "start": 1154364,
      "text": "Yeah, but do you feel like this has improved, that people have a better grasp on what data does and what it can do or what it does? In a concrete case, yeah, I think.",
      "id": "ep_126_ut_88"
    },
    {
      "end": 1231362,
      "speaker": "Nathan Yau",
      "start": 1163766,
      "text": "It's becoming more part of their lives. So my dissertation was on personal data collection and using visualization to communicate that in an everyday sense. And so people would collect data about themselves, like how many times they went to the bathroom, how many times they coughed their weight, things like that. And so people are collecting data about themselves through apps, gps, food, a lot of health related things. But they also understand that there's an overall trend with your weight and your exercise, but there's also kind of like these blips and a lot of noise that change things, but they don't change the overall patterns. And so it seems like that can feed into more general things, more general types of data that aren't necessarily related to them. But so one thing is that a lot of visualization now is kind of coming back to the individual. So you have these really big data sets, and it seems like the hook of those to get people into it is by pointing to their geographic region or people talking about their demographics and things like that. And then you kind of go off that.",
      "id": "ep_126_ut_89"
    },
    {
      "end": 1236194,
      "speaker": "Moritz Stefaner",
      "start": 1231546,
      "text": "So make it personal, even if you have a huge dataset, try and find the personal link.",
      "id": "ep_126_ut_90"
    },
    {
      "end": 1270112,
      "speaker": "Nathan Yau",
      "start": 1236282,
      "text": "Yeah. Because there was a research paper by Jeff Heer maybe a decade ago, he did a, he did like a network visualization of a friendster. And even then, like people, he found that people would spend more time with the visualization if they found themselves and their friends first. But if it was like, if they weren't in the network, there wasn't much to see, then they wouldn't go any further. But so you want to encourage people to poke around. So you try to try to show them, show people how they relate to the data or how, where they rested within the larger data set or scheme of things.",
      "id": "ep_126_ut_91"
    },
    {
      "end": 1339050,
      "speaker": "Enrico Bertini",
      "start": 1270296,
      "text": "Yeah. Personal data is one of those things that happened over the last few years. And I think it's really interesting. Right. I think I vaguely remember you had a few posts of yourself visualizing personal data. Right. That's another of those things that you've been posting about. It's been a lot of true, a lot of fun and interesting and. Yeah. And I really like what you say because I think that the data literacy of people in general is such an important element for our society. And I'm not aware of any study that actually shows that people are being exposed to more data or more information based on data. Whether this has actually led to an increase in data literacy, probably it has, I don't know. But, yeah, I think that's a really, really relevant aspect of anything related. What happened during the last ten years regarding data is much more democratized and visualization itself because it exposes data in a way that is, as you just said, engaging and interesting.",
      "id": "ep_126_ut_92"
    },
    {
      "end": 1341190,
      "speaker": "Moritz Stefaner",
      "start": 1339430,
      "text": "Which reminds me, Georgia and Stephanie.",
      "id": "ep_126_ut_93"
    },
    {
      "end": 1342050,
      "speaker": "Enrico Bertini",
      "start": 1341230,
      "text": "Yeah, right.",
      "id": "ep_126_ut_94"
    },
    {
      "end": 1362194,
      "speaker": "Moritz Stefaner",
      "start": 1342590,
      "text": "Have a book coming out also in fall, observe, collect, draw, or something, you know. And so they, I think, wrapped all these personal data collection thoughts into that dear data project became sort of the figure project, sort of for this whole movement, in a way.",
      "id": "ep_126_ut_95"
    },
    {
      "end": 1387428,
      "speaker": "Nathan Yau",
      "start": 1362242,
      "text": "Yeah, the book is on my desk right now. They framed visualization or personal data in a more, almost like a poetic sense, or they framed data in a more feeling, an emotional point of view. And that is, people miss that in the data a lot. And so it's nice to have something with the kind of the personal aspect to it.",
      "id": "ep_126_ut_96"
    },
    {
      "end": 1402026,
      "speaker": "Enrico Bertini",
      "start": 1387484,
      "text": "Yeah. Maybe we should clarify. We're talking about dear data and. Yeah. Giorgia Lupi and Stephanie Posavec. In the unlikely case that you've never heard of it, you can just Google Dear data and you'll find it.",
      "id": "ep_126_ut_97"
    },
    {
      "end": 1426966,
      "speaker": "Moritz Stefaner",
      "start": 1402148,
      "text": "Or listen to the episode. Listen to our episode from the fifties, sixties, I think. So we will link it in the show. Yeah, yeah, yeah. But that's interesting because the quantified self was more this idea, like your life as a lab experiment, measure yourself and like, treat yourself almost like a scientist. But the dear data approaches, as you say, much more like personal, poetic fuzzy.",
      "id": "ep_126_ut_98"
    },
    {
      "end": 1487458,
      "speaker": "Nathan Yau",
      "start": 1427038,
      "text": "And yeah, we had that, but the whole quantified self thing, that was a large part of my PhD work. And there were a lot of promises that you would find automatic insights if you just log your data or let the data feed in. And then I think that didn't totally pan out or is still being worked on. And then you had kind of like Nicholas Felton, who was collecting data about himself manually and then automatically, and his reports were, people really liked them, but I felt like they were more amazed by the amount of data that he collected. You would look at his charts and you would get something out of the topics, but they were reported in a business fashion. So it was sort of getting a different type of insight about who he is. But then when you look at dear data, which is more abstract, then you're kind of looking at things that are more emotional. It seems like they're sitting down with you and telling a story about themselves somehow.",
      "id": "ep_126_ut_99"
    },
    {
      "end": 1487770,
      "speaker": "Moritz Stefaner",
      "start": 1487514,
      "text": "Yeah.",
      "id": "ep_126_ut_100"
    },
    {
      "end": 1491506,
      "speaker": "Nathan Yau",
      "start": 1487810,
      "text": "Whereas versus presenting a PowerPoint slide about yourself, I guess.",
      "id": "ep_126_ut_101"
    },
    {
      "end": 1545000,
      "speaker": "Moritz Stefaner",
      "start": 1491578,
      "text": "Yeah, yeah. And I must say that also the quantified self, you're right, there was this promise that just collecting the data in itself will lead to interesting breakthroughs. But I think you also hit that wall that either it's just confirming something fairly obvious about your life that you knew already, or you see some pattern in the data, but you can't explain it. And I think, I mean educational as well. But yeah, sometimes it's a dead end. It's like, yeah, so, so what I'm tracking now, my bees. So I don't know if everybody knows, but I'm keeping bees for a few years also. And now this year I have this bee tracking app that like, logs temperature and moisture and stuff like this. And I'm curious again, like, will it deliver something interesting or will it be just another toy in my toolbox? We'll see.",
      "id": "ep_126_ut_102"
    },
    {
      "end": 1563388,
      "speaker": "Enrico Bertini",
      "start": 1545500,
      "text": "But I think what is interesting of quantified self type of things is that even if when you look back, it may be obvious, but the act of tracking actually makes you much more self aware of some of the things that happen. Right. So it is actually useful anyway.",
      "id": "ep_126_ut_103"
    },
    {
      "end": 1564920,
      "speaker": "Moritz Stefaner",
      "start": 1563444,
      "text": "You can justify anything.",
      "id": "ep_126_ut_104"
    },
    {
      "end": 1586420,
      "speaker": "Nathan Yau",
      "start": 1565220,
      "text": "There's a lot of studies that where people have lost weight or improve their studies just by keeping track of things and not actually looking at them. But the act of journaling, I guess. But if they're not, even if you're not even looking at it, then you can also like, that's where dare data kind of comes in, where it's more like you're writing a diary than a journal.",
      "id": "ep_126_ut_105"
    },
    {
      "end": 1622930,
      "speaker": "Enrico Bertini",
      "start": 1586720,
      "text": "We have a few listeners questions. We are back to having that on the show. I'm really happy about that. So let's start with the first one. This is from Tim Becker. And Tim wrote, I would also be interested to hear selfishly, if he has any perspective on how the medical field could be, could best learn from data visualization. Having been in the field for over ten years, we have not moved from bar charts and KM curves. I don't know what KM is. Maybe I histogram here and there, but that's it. I think it's a big topic in many fields.",
      "id": "ep_126_ut_106"
    },
    {
      "end": 1630850,
      "speaker": "Moritz Stefaner",
      "start": 1623790,
      "text": "How can we push innovation, right? And should we break up the routine?",
      "id": "ep_126_ut_107"
    },
    {
      "end": 1702820,
      "speaker": "Nathan Yau",
      "start": 1631710,
      "text": "So my wife is an emergency room physician, and so I have kind of a sense, but I think it comes down to more about the data understanding side of things. And so when they understand data, they can look at more charts or look at more advanced charts. I was talking to my wife's coworker who, he's an ER physician, and they're trying to improve the flow of patients from the waiting room through to triage and then getting people out, trying to decrease the amount of time that people are waiting. And so you have to, you have these schemes of how people get from one room to another and when the doctor should come in, when the nurse should come in. So they have all this data that they've collected about that because everything is digital. So they have all these visiting times and I. Entrance and exit times, but they didn't really know what to do with it because the analysis, sort of pretty rudimentary, is just kind of. They're probably going more off anecdotes than the actual analysis because they don't know what to do with the analysis. So if they knew more about analysis, more about how to do something with that data, then they could do something more with the visualization part as making things flow in and out.",
      "id": "ep_126_ut_108"
    },
    {
      "end": 1723702,
      "speaker": "Moritz Stefaner",
      "start": 1702860,
      "text": "Yeah, but it's so funny because, like, redesigning these patient cards is like one of the standard, like, database exercises. Right. It's like, for product designers redesigning the chair. It has been done so many times, I think even Tufte did one. Right. So. Yeah, but why don't these things catch on? I do think it's interesting.",
      "id": "ep_126_ut_109"
    },
    {
      "end": 1752128,
      "speaker": "Nathan Yau",
      "start": 1723766,
      "text": "Yeah. It seems like maybe in the, like the higher ups, the managers don't want to look at data too much. They want to go off the stories of patients because it's a little different with health, because you have all these individual patients and they have. The cases are extreme and everyone is sort of unique and all these. So it's like a collection of edge cases and you're trying to find a pattern within all the edges. And so it's something weird like that.",
      "id": "ep_126_ut_110"
    },
    {
      "end": 1787660,
      "speaker": "Moritz Stefaner",
      "start": 1752224,
      "text": "But you don't want to make it all just about the numbers because that would be a mistake, and I can see that. Yeah, yeah, yeah. So maybe we do need to show them, dear data and. And more qualitative ways of plotting data. Yeah, yeah, we can see, we can see. There was another question Adam Evans wrote on Twitter. What do you think about when designing interactivity into database? How to allow for discovery and exploration without overwhelming readers with options. That's a classic question. One of the internal, internal, warm.",
      "id": "ep_126_ut_111"
    },
    {
      "end": 1792030,
      "speaker": "Nathan Yau",
      "start": 1789450,
      "text": "That seems like a better question for Moritz.",
      "id": "ep_126_ut_112"
    },
    {
      "end": 1798310,
      "speaker": "Moritz Stefaner",
      "start": 1793490,
      "text": "Yeah, but I haven't figured it out myself yet, so I was hoping for your input.",
      "id": "ep_126_ut_113"
    },
    {
      "end": 1844690,
      "speaker": "Nathan Yau",
      "start": 1800010,
      "text": "I think you have it better figured out than most of us for me, because I'm going from the analysis side, so I'm always starting with static graphics and r, and then the interaction that I build in is usually how I explore the data during the static charts. So a lot of my interaction is getting subsets of populations and narrowing down to certain subpopulations. So I think when I add interaction, I'm thinking back to my analysis and how I got to a certain point, and then I try to let users use that interaction in the way that I interacted with the data. But in JavaScript, we're in the browser.",
      "id": "ep_126_ut_114"
    },
    {
      "end": 1845578,
      "speaker": "Enrico Bertini",
      "start": 1844810,
      "text": "Yeah.",
      "id": "ep_126_ut_115"
    },
    {
      "end": 1874710,
      "speaker": "Moritz Stefaner",
      "start": 1845754,
      "text": "And I think in your approach, it shows you come from, you are a statistician, so you come from statistics. So you think a lot about how can we break things down. Right? It's like what can we compare to what? And like what's the big picture? And what are these subgroups, as you say? Right. So, and I think that is actually a good idea to think about. When you think about interactivity, what will people want to compare with each other? If you get that down, then you're.",
      "id": "ep_126_ut_116"
    },
    {
      "end": 1915276,
      "speaker": "Nathan Yau",
      "start": 1874750,
      "text": "Quite close, probably, yeah, because I think a big thing is that people have a data set, or they have a lot of data, and they get intimidated by how much data there is and they want to show it all at once. But statisticians, when we're analyzing data, we just produce a whole bunch of graphics at once, or just one after the other, one after the other and throw them out of. So when you get to the presentation side, you kind of filter out what you made or filter through what you made and then present what the interesting parts. And if interaction makes it easier to go through those interesting parts, then kind of implement those, and if not, don't.",
      "id": "ep_126_ut_117"
    },
    {
      "end": 1963120,
      "speaker": "Enrico Bertini",
      "start": 1915468,
      "text": "Yeah, exactly right. I think my take on it is that in general, there is much less a need for interaction when the main goal is to communicate something to the reader. Right. But as you said, when you're using visualization as an analysis tool, then you may need to interact a lot more with the data and the visualization. And by the way, tell me what you think about it. But I was thinking some time ago that when you are actually creating graphics in r and exploring, say, a new data set, that's also interaction. When you just change one parameter in a GGplot statement and you see a new graphics, that's interaction. It's less direct, but it's interaction.",
      "id": "ep_126_ut_118"
    },
    {
      "end": 2019938,
      "speaker": "Nathan Yau",
      "start": 1963660,
      "text": "I guess the overarching theme of flowing data is trying to help people understand data in some way or another. You're trying to get people to indirectly analyze data or think about it. A lot of like when I write something. Sometimes my goal is to get people thinking to themselves about what other things they could ask about a certain data set, or why a different form or different visualization could apply to a different finding or a different aspect of the data set. Because I guess a lot of things, you see a lot of projects and then you kind of just stop there and just go, that's interesting, and that looks neat, but the natural next step is always, how does that apply to my own data set? Or how does that. Is there anything else that's interesting about that dataset? And so I always try to point to the dataset itself and then hope that people feel welcome to just kind of poke at it from there.",
      "id": "ep_126_ut_119"
    },
    {
      "end": 2047350,
      "speaker": "Moritz Stefaner",
      "start": 2019994,
      "text": "Yeah, no, that's a great tip and a great, great perspective. We have to wrap up soon. One very last question, because I know many of our listeners are just getting started. I know many of your readers are just getting into the field. Is there anything like a practical tip or any other tips you can give to people just getting started? Are there any tools you're currently excited about that seem to make it easy, or any ways to get into the field in a good way?",
      "id": "ep_126_ut_120"
    },
    {
      "end": 2079890,
      "speaker": "Nathan Yau",
      "start": 2048890,
      "text": "I guess there's a lot of things, a lot of people ask what they recommend to get started with visualization, and the main thing is usually to ask back what they want to do with visualization because you can do so much with it. Are you in, are you in business? Are you in statistics and science? Or are you doing presentation or journalism? So you have to start with that question, what you want to do with it, and find examples of what you're trying to do or what you think is good. And you can kind of work from there. So you try to.",
      "id": "ep_126_ut_121"
    },
    {
      "end": 2086250,
      "speaker": "Moritz Stefaner",
      "start": 2079930,
      "text": "I think that's a good tip. Try to copy the why before you do the how, maybe and the what.",
      "id": "ep_126_ut_122"
    },
    {
      "end": 2092873,
      "speaker": "Enrico Bertini",
      "start": 2086330,
      "text": "Yeah, I think most people approach this problem with, like, which tool should I use? And I'm not sure it's the I.",
      "id": "ep_126_ut_123"
    },
    {
      "end": 2097401,
      "speaker": "Moritz Stefaner",
      "start": 2092881,
      "text": "Want to make a sankey dive. I love sankeys.",
      "id": "ep_126_ut_124"
    },
    {
      "end": 2103869,
      "speaker": "Enrico Bertini",
      "start": 2097465,
      "text": "No, I mean, having good tools is important, but I'm not sure it's the best way to approach the problem.",
      "id": "ep_126_ut_125"
    },
    {
      "end": 2105065,
      "speaker": "Nathan Yau",
      "start": 2104689,
      "text": "Cool.",
      "id": "ep_126_ut_126"
    },
    {
      "end": 2111857,
      "speaker": "Moritz Stefaner",
      "start": 2105097,
      "text": "That's great advice. So think about the why. Yeah, doesn't hurt. And. Yeah, thanks so much, Nathan, for joining us.",
      "id": "ep_126_ut_127"
    },
    {
      "end": 2112753,
      "speaker": "Nathan Yau",
      "start": 2111913,
      "text": "Thanks for having me.",
      "id": "ep_126_ut_128"
    },
    {
      "end": 2125620,
      "speaker": "Moritz Stefaner",
      "start": 2112841,
      "text": "This was great. Yeah, great talking to you. Thanks for like, documenting the whole field for all these years. Please keep going. If you get tired, still keep going. Don't stop.",
      "id": "ep_126_ut_129"
    },
    {
      "end": 2131700,
      "speaker": "Nathan Yau",
      "start": 2126200,
      "text": "We need you. I'm going until the Internet dies or until I die, whichever comes first.",
      "id": "ep_126_ut_130"
    },
    {
      "end": 2143866,
      "speaker": "Moritz Stefaner",
      "start": 2133200,
      "text": "That's the spirit. By the way, we said, like, nobody blogs but Lisa Charlotte Muth (formerly Lisa Rost) has been killing it this year and the data rapper blog. And this gives me hope.",
      "id": "ep_126_ut_131"
    },
    {
      "end": 2145230,
      "speaker": "Enrico Bertini",
      "start": 2143938,
      "text": "Oh, yeah, absolutely.",
      "id": "ep_126_ut_132"
    },
    {
      "end": 2156682,
      "speaker": "Moritz Stefaner",
      "start": 2146050,
      "text": "So blogging is coming back. That's my theory. Mark my words. We'll check again next year. In the meantime, thanks so much for joining us, Nathan.",
      "id": "ep_126_ut_133"
    },
    {
      "end": 2157242,
      "speaker": "Nathan Yau",
      "start": 2156746,
      "text": "Thanks again.",
      "id": "ep_126_ut_134"
    },
    {
      "end": 2157666,
      "speaker": "Moritz Stefaner",
      "start": 2157306,
      "text": "Bye bye.",
      "id": "ep_126_ut_135"
    },
    {
      "end": 2184094,
      "speaker": "Enrico Bertini",
      "start": 2157698,
      "text": "Thanks, Nathan. Bye bye bye. Hey, folks, thanks for listening to data stories again. Before you leave, a few last notes, this show is now completely crowdfunded, so you can support us by going on Patreon. That's patreon.com Datastories. And if you can spend a couple of minutes reading us on iTunes, that would be extremely helpful for the show.",
      "id": "ep_126_ut_136"
    },
    {
      "end": 2209952,
      "speaker": "Moritz Stefaner",
      "start": 2184222,
      "text": "And here's also some information on the many ways you can get news directly from us. We are, of course, on twitter@twitter.com. Datastories. We have a Facebook page@Facebook.com. datastoriespodcast all in one word. And we also have a Slack channel where you can chat with us directly. And to sign up you can go to our homepage datastory eas, and there is a button at the bottom of the page.",
      "id": "ep_126_ut_137"
    },
    {
      "end": 2225818,
      "speaker": "Enrico Bertini",
      "start": 2210096,
      "text": "And we also have an email newsletter. So if you want to get news directly into your inbox and be notified whenever we publish an episode, you can go to our home page data store readdez and look for the link you find at the bottom in the footer.",
      "id": "ep_126_ut_138"
    },
    {
      "end": 2237978,
      "speaker": "Moritz Stefaner",
      "start": 2225914,
      "text": "So one last thing we want to tell you is that we love to get in touch with our listeners, especially if you want to suggest a way to improve the show or amazing people you want us to invite or even projects you want us to talk about.",
      "id": "ep_126_ut_139"
    },
    {
      "end": 2247160,
      "speaker": "Enrico Bertini",
      "start": 2238074,
      "text": "Yeah, absolutely. And don't hesitate to get in touch with us. It's always a great thing to hear from you. So see you next time, and thanks for listening. Today. The stories.",
      "id": "ep_126_ut_140"
    }
  ],
  "confidence": 0.932257925784966,
  "audio_duration": 2257,
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_status_code": null,
  "webhook_auth": false,
  "webhook_auth_header_name": null,
  "speed_boost": false,
  "auto_highlights_result": null,
  "auto_highlights": false,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_audio_quality": null,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "content_safety": false,
  "iab_categories": true,
  "content_safety_labels": {
    "status": "unavailable",
    "results": [],
    "summary": {}
  },
  "language_detection": false,
  "language_detection_threshold": null,
  "language_confidence": null,
  "custom_spelling": null,
  "throttled": false,
  "auto_chapters": true,
  "summarization": false,
  "summary_type": null,
  "summary_model": null,
  "custom_topics": false,
  "topics": [],
  "speech_threshold": null,
  "speech_model": "best",
  "chapters": [
    {
      "summary": "Moritz Stefaner and Enrico Bertini talk about data visualization. In fall we have the big Berlin weeks of data visualization in October. We use the opportunity and do a listener meetup. If you enjoy the show, please consider supporting us with recurring payments on patreon. com.",
      "gist": "Data Stories: A Summer Meeting",
      "headline": "This podcast is listener supported, so there's no ads anymore",
      "start": 160,
      "end": 190066,
      "id": "ep_126_ch_0"
    },
    {
      "summary": "Today we have a super special guest. It's Nathan Yao from flowing data. We've had you on our list since the beginning of the podcast. This has been a long time coming, but it's very good.",
      "gist": "A Very Special Guest",
      "headline": "Today we have a super special guest, Nathan Yao from flowing data",
      "start": 190178,
      "end": 222646,
      "id": "ep_126_ch_1"
    },
    {
      "summary": "Nathan: I run flowingdata. com. i've been doing it for a little over a decade. I went to grad school in statistics, background statistics, and I specialize in visualization. It's the most comprehensive overall resource you can find about data visualization today.",
      "gist": "A Minute With Nathan's Data Blog",
      "headline": "Nathan's blog has been around for ten years and he continuously posts",
      "start": 222798,
      "end": 306500,
      "id": "ep_126_ch_2"
    },
    {
      "summary": "Flowing data is my main job. I have an appointment with the Census Bureau, but I put in very little time with that. Cool. I mean, of course, hobby in the beginning as any block into somewhat sustainable main occupation which is really cool.",
      "gist": "Flowing Data: A Full-Time Job",
      "headline": "So this is the main thing you do also, right? It's running the blog and anything around it",
      "start": 308840,
      "end": 338006,
      "id": "ep_126_ch_3"
    },
    {
      "summary": "The site has a public side and a membership side. The public side is about helping people learn how to visualize data. The membership side started maybe six years ago. You also have been publishing a few books during this time, right? The formula is to have fun.",
      "gist": "Flowing Data: How do you organize your work?",
      "headline": "Robert Kosaro has been working on data visualization since 2010",
      "start": 338158,
      "end": 681250,
      "id": "ep_126_ch_4"
    },
    {
      "summary": "A large proportion of the things that you post on flowing data is basically. Things that you find around on the web. So you're basically making people aware of what is happening in this world. How do you do that?",
      "gist": "A Taste of Flowing Data",
      "headline": "A large proportion of your blog posts are based on flowing data",
      "start": 682110,
      "end": 1012210,
      "id": "ep_126_ch_5"
    },
    {
      "summary": " visualization has become more of like the article, or people are telling stories with just the visualization itself. With data literacy, there's still a lot, a long way to go, but people are understanding it a little bit better.",
      "gist": "The Future of Data Visualization",
      "headline": "With visualization specifically, are we making progress or have things changed significantly",
      "start": 1012710,
      "end": 1154308,
      "id": "ep_126_ch_6"
    },
    {
      "summary": "My dissertation was on personal data collection and using visualization to communicate that in an everyday sense. A lot of visualization now is kind of coming back to the individual. Whether this has led to an increase in data literacy, probably it has.",
      "gist": "The Personalization of Data",
      "headline": "Nicholas Felton's dissertation was on personal data collection and visualization",
      "start": 1154364,
      "end": 1586420,
      "id": "ep_126_ch_7"
    },
    {
      "summary": "Tim Becker asks how the medical field could best learn from data visualization. He says it comes down to more about the data understanding side of things. Why don't these things catch on? Maybe managers don't want to look at data too much.",
      "gist": "What the Medical Field Can Learn From Data Visualization",
      "headline": "Tim Becker asks what medical field could best learn from data visualization",
      "start": 1586720,
      "end": 1767740,
      "id": "ep_126_ch_8"
    },
    {
      "summary": "There was another question Adam Evans wrote on Twitter. What do you think about when designing interactivity into database? How to allow for discovery and exploration without overwhelming readers with options.",
      "gist": "In the World of Interactivity",
      "headline": "What do you think about when designing interactivity into database",
      "start": 1768480,
      "end": 1844690,
      "id": "ep_126_ch_9"
    },
    {
      "summary": "In general, there is much less a need for interaction when the main goal is to communicate something to the reader. But when you're using visualization as an analysis tool, then you may need to interact a lot more with the data and the visualization.",
      "gist": "Interactivity in Data Visualization",
      "headline": "When using visualization as an analysis tool, you may need to interact more",
      "start": 1844810,
      "end": 2025970,
      "id": "ep_126_ch_10"
    },
    {
      "summary": "Nathan: Is there anything like a practical tip or any other tips you can give to people just getting started with visualization. Try to copy the why before you do the how, maybe and the what. If you get tired, still keep going. We need you.",
      "gist": "Getting Started in Data Visualization",
      "headline": "I know many of our listeners are just getting started with visualization",
      "start": 2026090,
      "end": 2159350,
      "id": "ep_126_ch_11"
    },
    {
      "summary": "This show is now completely crowdfunded, so you can support us by going on patreon. com Datastories. Here's also some information on the many ways you can get news directly from us. We love to get in touch with our listeners, especially if you want to suggest a way to improve the show.",
      "gist": "Data Stories",
      "headline": "This show is now completely crowdfunded, so you can support us on Patreon",
      "start": 2163650,
      "end": 2247160,
      "id": "ep_126_ch_12"
    }
  ],
  "disfluencies": false,
  "entity_detection": false,
  "sentiment_analysis": false,
  "sentiment_analysis_results": null,
  "entities": null,
  "speakers_expected": null,
  "summary": null,
  "custom_topics_results": null,
  "episode_num": 126,
  "episode_metadata": {
    "speakers": [
      "Nathan Yau",
      "Moritz Stefaner",
      "Enrico Bertini"
    ],
    "WPid": "1252",
    "url": "https://datastori.es/podlove/file/5328/s/feed/c/mp3/datastories-126.mp3",
    "episode_title": "FlowingData with Nathan Yau"
  }
}