{
  "id": "6c9cb811-a2b8-4806-a260-229e2bc6633e",
  "language_model": "assemblyai_default",
  "acoustic_model": "assemblyai_default",
  "language_code": "en_us",
  "status": "completed",
  "audio_url": "https://datastori.es/podlove/file/427/s/feed/c/mp3/Datastories-38.mp3",
  "utterances": [
    {
      "end": 21110,
      "speaker": "Enrico Bertini",
      "start": 17160,
      "text": "Hi, everyone. Data stories number 38. I'm Moritz.",
      "id": "ep_38_ut_0"
    },
    {
      "end": 22854,
      "speaker": "Moritz Stefaner",
      "start": 21270,
      "text": "Hey, Enrico, how are you doing?",
      "id": "ep_38_ut_1"
    },
    {
      "end": 24406,
      "speaker": "Enrico Bertini",
      "start": 23022,
      "text": "I'm doing great. And you?",
      "id": "ep_38_ut_2"
    },
    {
      "end": 26170,
      "speaker": "Moritz Stefaner",
      "start": 24478,
      "text": "Cool, yeah, good, good, good.",
      "id": "ep_38_ut_3"
    },
    {
      "end": 27780,
      "speaker": "Enrico Bertini",
      "start": 26480,
      "text": "Enjoying summer?",
      "id": "ep_38_ut_4"
    },
    {
      "end": 29576,
      "speaker": "Moritz Stefaner",
      "start": 28440,
      "text": "Enjoying the World cup.",
      "id": "ep_38_ut_5"
    },
    {
      "end": 31912,
      "speaker": "Enrico Bertini",
      "start": 29648,
      "text": "The World cup. Ah, come on, stop it.",
      "id": "ep_38_ut_6"
    },
    {
      "end": 34060,
      "speaker": "Manuel Lima",
      "start": 31976,
      "text": "That was a taboo. That was a taboo.",
      "id": "ep_38_ut_7"
    },
    {
      "end": 39176,
      "speaker": "Moritz Stefaner",
      "start": 34920,
      "text": "How is Italy doing? Oh, yeah. Oh, sorry.",
      "id": "ep_38_ut_8"
    },
    {
      "end": 47688,
      "speaker": "Enrico Bertini",
      "start": 39248,
      "text": "Oh, this will never end for Germans. It's always like, they're always thinking about Italy. But I can understand that. I can understand why you can support.",
      "id": "ep_38_ut_9"
    },
    {
      "end": 49740,
      "speaker": "Moritz Stefaner",
      "start": 47744,
      "text": "The us team now. Isn't that great?",
      "id": "ep_38_ut_10"
    },
    {
      "end": 51820,
      "speaker": "Enrico Bertini",
      "start": 50080,
      "text": "It is fantastic, actually.",
      "id": "ep_38_ut_11"
    },
    {
      "end": 57734,
      "speaker": "Moritz Stefaner",
      "start": 53520,
      "text": "Yeah. Let's hope the Mecca pass this round tonight. We'll see.",
      "id": "ep_38_ut_12"
    },
    {
      "end": 61574,
      "speaker": "Enrico Bertini",
      "start": 57902,
      "text": "You know, I lived a few years in Germany and that was fun, I can tell you.",
      "id": "ep_38_ut_13"
    },
    {
      "end": 66530,
      "speaker": "Moritz Stefaner",
      "start": 61622,
      "text": "Yeah, I know. I've been doing it for my whole life.",
      "id": "ep_38_ut_14"
    },
    {
      "end": 72690,
      "speaker": "Enrico Bertini",
      "start": 69150,
      "text": "Yeah, you have an interesting way of watching games.",
      "id": "ep_38_ut_15"
    },
    {
      "end": 78398,
      "speaker": "Moritz Stefaner",
      "start": 74870,
      "text": "Yeah, we're like. We're known for our playfulness, right?",
      "id": "ep_38_ut_16"
    },
    {
      "end": 83930,
      "speaker": "Enrico Bertini",
      "start": 78574,
      "text": "Yes. Okay, let's stop it there.",
      "id": "ep_38_ut_17"
    },
    {
      "end": 85846,
      "speaker": "Moritz Stefaner",
      "start": 84230,
      "text": "Let's stop the national cliches.",
      "id": "ep_38_ut_18"
    },
    {
      "end": 87170,
      "speaker": "Enrico Bertini",
      "start": 85878,
      "text": "It's still an open boon.",
      "id": "ep_38_ut_19"
    },
    {
      "end": 90498,
      "speaker": "Moritz Stefaner",
      "start": 88130,
      "text": "Yeah, at least we're winning. I mean, just saying.",
      "id": "ep_38_ut_20"
    },
    {
      "end": 91430,
      "speaker": "Enrico Bertini",
      "start": 90674,
      "text": "Yeah.",
      "id": "ep_38_ut_21"
    },
    {
      "end": 96230,
      "speaker": "Moritz Stefaner",
      "start": 94690,
      "text": "Anyways, let's move on.",
      "id": "ep_38_ut_22"
    },
    {
      "end": 103470,
      "speaker": "Enrico Bertini",
      "start": 98730,
      "text": "We have a special guest today, Emmanuel Lima, on the show. Hi, Emmanuel.",
      "id": "ep_38_ut_23"
    },
    {
      "end": 105066,
      "speaker": "Manuel Lima",
      "start": 103850,
      "text": "Hey, guys, how's it going?",
      "id": "ep_38_ut_24"
    },
    {
      "end": 106074,
      "speaker": "Moritz Stefaner",
      "start": 105138,
      "text": "Hey, Emmanuel.",
      "id": "ep_38_ut_25"
    },
    {
      "end": 107962,
      "speaker": "Enrico Bertini",
      "start": 106202,
      "text": "Hey. Great to have you here.",
      "id": "ep_38_ut_26"
    },
    {
      "end": 109122,
      "speaker": "Moritz Stefaner",
      "start": 108066,
      "text": "Yeah, finally.",
      "id": "ep_38_ut_27"
    },
    {
      "end": 115254,
      "speaker": "Enrico Bertini",
      "start": 109266,
      "text": "Finally. After we've been chasing you for months. Monthses. Right.",
      "id": "ep_38_ut_28"
    },
    {
      "end": 116174,
      "speaker": "Moritz Stefaner",
      "start": 115422,
      "text": "Decades.",
      "id": "ep_38_ut_29"
    },
    {
      "end": 116558,
      "speaker": "Enrico Bertini",
      "start": 116262,
      "text": "Months.",
      "id": "ep_38_ut_30"
    },
    {
      "end": 116710,
      "speaker": "Manuel Lima",
      "start": 116614,
      "text": "Months.",
      "id": "ep_38_ut_31"
    },
    {
      "end": 120150,
      "speaker": "Enrico Bertini",
      "start": 116710,
      "text": "Months. I don't know. Yeah, yeah, decades.",
      "id": "ep_38_ut_32"
    },
    {
      "end": 121890,
      "speaker": "Manuel Lima",
      "start": 120190,
      "text": "Yeah, centuries. Why not?",
      "id": "ep_38_ut_33"
    },
    {
      "end": 124210,
      "speaker": "Moritz Stefaner",
      "start": 122710,
      "text": "It's the eternal fight.",
      "id": "ep_38_ut_34"
    },
    {
      "end": 126010,
      "speaker": "Manuel Lima",
      "start": 124950,
      "text": "Exactly.",
      "id": "ep_38_ut_35"
    },
    {
      "end": 136238,
      "speaker": "Enrico Bertini",
      "start": 126550,
      "text": "So, usual intro. We ask our guests to introduce themselves just in case somebody doesn't know. Manuel Lima. Manuel, you want to say a few words about yourself?",
      "id": "ep_38_ut_36"
    },
    {
      "end": 163390,
      "speaker": "Manuel Lima",
      "start": 136334,
      "text": "Sure, yeah. That's always the hardest thing, how to sort of characterize or introduce yourself, I guess. I'm a designer by trades. I'm also an authorization, a researcher. I do a bit of lectures and I also teach about design and visualization. And I also work as design lead, a UX design lead for a startup in New York City called Code Academy. And that's about it.",
      "id": "ep_38_ut_37"
    },
    {
      "end": 164578,
      "speaker": "Enrico Bertini",
      "start": 164170,
      "text": "Wow.",
      "id": "ep_38_ut_38"
    },
    {
      "end": 165786,
      "speaker": "Moritz Stefaner",
      "start": 164634,
      "text": "Quite a lot of things.",
      "id": "ep_38_ut_39"
    },
    {
      "end": 171122,
      "speaker": "Manuel Lima",
      "start": 165938,
      "text": "Quite a lot of things. Yeah. That's why it's so hard to, like, point out exactly what you do.",
      "id": "ep_38_ut_40"
    },
    {
      "end": 177800,
      "speaker": "Enrico Bertini",
      "start": 171306,
      "text": "How about, maybe we should start from what Scott asked on Twitter, how does he do it all?",
      "id": "ep_38_ut_41"
    },
    {
      "end": 182080,
      "speaker": "Manuel Lima",
      "start": 179500,
      "text": "A lot of coffee. A lot of coffee.",
      "id": "ep_38_ut_42"
    },
    {
      "end": 188156,
      "speaker": "Enrico Bertini",
      "start": 184140,
      "text": "No, it was yerba mate. Do you try? Did you try that?",
      "id": "ep_38_ut_43"
    },
    {
      "end": 189676,
      "speaker": "Manuel Lima",
      "start": 188308,
      "text": "Did I try what? Sorry?",
      "id": "ep_38_ut_44"
    },
    {
      "end": 192068,
      "speaker": "Enrico Bertini",
      "start": 189828,
      "text": "Yerba mate. Yerba mate.",
      "id": "ep_38_ut_45"
    },
    {
      "end": 200320,
      "speaker": "Manuel Lima",
      "start": 192204,
      "text": "No, I don't. Oh, yeah, I haven't tried that one. Yeah, I like to stick with coffee, you know, all natural products.",
      "id": "ep_38_ut_46"
    },
    {
      "end": 228162,
      "speaker": "Enrico Bertini",
      "start": 203410,
      "text": "That's great. Yeah. So, Manuel, you've done so many things. I don't know exactly where to start. Maybe we should start from visual complexity. Right. I think that many people out there know you for visual complexity, and that was a remarkable website that you started in very early on. When was it? 2000, what I started on?",
      "id": "ep_38_ut_47"
    },
    {
      "end": 242464,
      "speaker": "Manuel Lima",
      "start": 228266,
      "text": "I think it was the summer of 2005. I started working on that. It was just after I graduated from the master of fine arts at Parsons school of Design in New York. Yeah, sorry.",
      "id": "ep_38_ut_48"
    },
    {
      "end": 244352,
      "speaker": "Enrico Bertini",
      "start": 242512,
      "text": "That's gonna be ten years soon.",
      "id": "ep_38_ut_49"
    },
    {
      "end": 271910,
      "speaker": "Manuel Lima",
      "start": 244496,
      "text": "That's gonna be ten years soon. Exactly. Exactly. Which is intense. Yeah. Actually, I've been talking about this. I was actually talking to Santiago Ortiz about this, of the possibility. And this is something, like, still fresh in my head, but maybe doing something next year, like the ten year celebration of visual complexity and who knows what could happen? And I invite all of you guys over. We can have drinks over it and then see some old projects, some relics from the past.",
      "id": "ep_38_ut_50"
    },
    {
      "end": 274870,
      "speaker": "Enrico Bertini",
      "start": 272970,
      "text": "Is it going to be in a rooftop?",
      "id": "ep_38_ut_51"
    },
    {
      "end": 278858,
      "speaker": "Manuel Lima",
      "start": 275930,
      "text": "It better be, right? It depends on the roof. Yeah.",
      "id": "ep_38_ut_52"
    },
    {
      "end": 282710,
      "speaker": "Enrico Bertini",
      "start": 278874,
      "text": "Otherwise I cannot come. I come only if it's a rooftop.",
      "id": "ep_38_ut_53"
    },
    {
      "end": 284746,
      "speaker": "Manuel Lima",
      "start": 283210,
      "text": "Exactly, exactly.",
      "id": "ep_38_ut_54"
    },
    {
      "end": 286724,
      "speaker": "Moritz Stefaner",
      "start": 284778,
      "text": "And if it's a full week of celebrations.",
      "id": "ep_38_ut_55"
    },
    {
      "end": 287264,
      "speaker": "Enrico Bertini",
      "start": 286882,
      "text": "Yeah.",
      "id": "ep_38_ut_56"
    },
    {
      "end": 289736,
      "speaker": "Moritz Stefaner",
      "start": 287312,
      "text": "Otherwise the flight is just too much for me.",
      "id": "ep_38_ut_57"
    },
    {
      "end": 291240,
      "speaker": "Manuel Lima",
      "start": 289888,
      "text": "It's not worth it. Yeah.",
      "id": "ep_38_ut_58"
    },
    {
      "end": 292180,
      "speaker": "Moritz Stefaner",
      "start": 291320,
      "text": "No, please.",
      "id": "ep_38_ut_59"
    },
    {
      "end": 296820,
      "speaker": "Enrico Bertini",
      "start": 293200,
      "text": "I cannot talk about other requests. I'm gonna ask him private.",
      "id": "ep_38_ut_60"
    },
    {
      "end": 321772,
      "speaker": "Moritz Stefaner",
      "start": 298360,
      "text": "Very good. No, but I also remember your thesis. So it was about meme tracking, which is, I think, still a very interesting topic. And you were looking like, how stories spread on the web and the networks that and the trees that occur when people share stories. That's a very timely issue and has been quite prophetic for your further, like.",
      "id": "ep_38_ut_61"
    },
    {
      "end": 530898,
      "speaker": "Manuel Lima",
      "start": 321796,
      "text": "The two books wrote. Yeah, I guess it was, actually, to be honest, I fell in love with data visualization during that program at Parsons School of design. And actually, it goes back to this diagram of a teacher of mine that showed us he was actually a very captivating speaker, Christopher Curranite. But he showed us this diagram called the understanding spectrum by Nathan Shedroff. You've seen it. It's also known as the pyramid, the knowledge pyramid. It's how data transforms into information. Information leads into knowledge, and ultimately knowledge leads into wisdom. And this was the first time I sort of started thinking about this deeply as what is our role as designers in this spectrum, especially in converting information into knowledge and hopefully wisdom in the end. And that stuck with me forever. And I think then, towards my thesis, I knew I wanted to do something related to visualization, at least that could explore the value and benefits of data visualization. And as you pointed out more, it was very much about memetics it was trying to understand the idea of word of mouth, the idea of information diffusion, which is actually something that has been intriguing to social sciences for a long, long time. This way for centuries now, we can actually use the word centuries. But with the Internet, especially with the blogosphere, the blog space, this sort of behavior, information spreads from person to person, became a lot easier to track. And the most obvious analogy we made in that process was one specific topic starts being spread in one specific blog, and now it's appropriated by other blogs who sort of retweeted and reposted. And this creates a huge diffusion of that meme. It's the definition of mematics, which for me was very interesting, and I wanted to visualize that, which, as you were saying, Moritz, is actually something that has been going, it's been constantly surfacing, even recently about what, two years ago, I was actually involved in a project at Microsoft research, trying to do exactly the same thing, but in this case, using Twitter, seeing how someone tweets something for the very first time, and then seeing how that meme, that piece of information, spreads across Twitter, which is really, really fascinating, again, for social sciences to understand. And then during that process, I was trying to visualize this in the most meaningful way. And this is how my thesis was born. Blogviz, mapping the patterns of diffusion across blogspace, which actually is a website that I still maintain, even though I haven't done any changes at all since I graduated, which it's always that sense of, I want to go back to it, I want to expand, I want to improve it. But then you just never find yourself the time to do it. But afterwards, after graduating and after done the thesis, I was finding myself with a lot of time on my hands. I started working for RGA, which is sort of the designed additional agency here in New York. And then all of a sudden, I have entire weekends with nothing else to do because I was used to one full year of hardcore work working on my thesis for school. So all of a sudden, I, like all this time in my hands, which was really kind of strange. For the first time in one year or so, you're the first man, I.",
      "id": "ep_38_ut_62"
    },
    {
      "end": 535818,
      "speaker": "Moritz Stefaner",
      "start": 530914,
      "text": "Mean, who starts working at an ad agency and says, like, he has too much time.",
      "id": "ep_38_ut_63"
    },
    {
      "end": 608910,
      "speaker": "Manuel Lima",
      "start": 535994,
      "text": "I know, says a lot to how busy we were. I thought about you, maybe. And then during that research, one of the things that was really fascinating to me, as I was trying to sort of understand the logic of the blog space and how information spreads across the particular network that comprises the World Wide Web, I was collecting all these really cool, interesting examples of networks, of people visualizing networks, but not just the web. I was collecting things like food webs, computer systems, social networks, protein networks, biological networks, etcetera, etcetera. I was really trying to understand the variety of ways people, using the variety of models and approaches people are using to visualize any type of network. And I found that that research was so interesting that I should probably open it up to the public. And this is why, in many ways, visual complexity was born just straight after graduating from Parsons, just to open it up. A lot of that knowledge, a lot of that research to the general public. And then, of course, I started expanding it considerably over months and years.",
      "id": "ep_38_ut_64"
    },
    {
      "end": 616910,
      "speaker": "Moritz Stefaner",
      "start": 609410,
      "text": "So it was first your personal archive of project references and then at some point you decided to put it online.",
      "id": "ep_38_ut_65"
    },
    {
      "end": 619070,
      "speaker": "Manuel Lima",
      "start": 617490,
      "text": "Exactly. That's exactly.",
      "id": "ep_38_ut_66"
    },
    {
      "end": 625950,
      "speaker": "Moritz Stefaner",
      "start": 622250,
      "text": "It's been a hugely popular resource, I think, on the web. Right.",
      "id": "ep_38_ut_67"
    },
    {
      "end": 640670,
      "speaker": "Manuel Lima",
      "start": 626690,
      "text": "I think it was. I think at the time there was not, as you guys can probably recall ten years ago, there was not a lot of things online about visualization. I think info statics had just came out like maybe six months or a year before.",
      "id": "ep_38_ut_68"
    },
    {
      "end": 643090,
      "speaker": "Moritz Stefaner",
      "start": 641570,
      "text": "There was no flowing data.",
      "id": "ep_38_ut_69"
    },
    {
      "end": 678950,
      "speaker": "Manuel Lima",
      "start": 643210,
      "text": "There was no flowing data. There was no, I think eager eyes was not there yet. Maybe, I don't know. But a lot of the new blogs that are major references right now for the community were probably not there at the time. So I think that's one. I think the reasons why info statics and visual complexity were so important for people starting and initiating themselves into this field to have those points of reference, of projects that have been made in the past, but also projects that people were involved all around the world in different areas, showcasing different styles and approaches and so on.",
      "id": "ep_38_ut_70"
    },
    {
      "end": 697754,
      "speaker": "Enrico Bertini",
      "start": 680810,
      "text": "So I'm just curious to hear, how did visual complexity evolve since when you started? So visual complexity the way it is today, is it very similar to the way it was when you started, or there was some kind of development through the years?",
      "id": "ep_38_ut_71"
    },
    {
      "end": 766810,
      "speaker": "Manuel Lima",
      "start": 697842,
      "text": "Yeah, quite similar. I mean, I remember one time I changed the design of the site a little bit, just to be a little bit more friendly, just to show sort of better resolution images up front on the homepage. And I think over time, I just added more categories, more metadata to all the projects. So now you can filter projects in a variety of ways. By the year they were created, by the author's name, by the tools that they are using, by the generous theme or topic that they are exploring. So that was most of the things that I added. And then I think slowly I added other categories like referential books, that people might be interested in and a few other enhancements and of course a blog at some point, but it hasn't really evolved that much. I think it was just like small additions over time, of course, it's been pretty hard, as you guys can probably notice, and some people who are watching us can notice. It hasn't been updated very frequently since over. I think maybe, maybe actually, probably since the book came out, since visual complexity came out.",
      "id": "ep_38_ut_72"
    },
    {
      "end": 769030,
      "speaker": "Enrico Bertini",
      "start": 767670,
      "text": "I think that's fine. Right?",
      "id": "ep_38_ut_73"
    },
    {
      "end": 814170,
      "speaker": "Manuel Lima",
      "start": 769070,
      "text": "I mean, yeah, I think it's fine because I think one of the things that was very positive for me was at least to kind of like minimize my sort of pressure to always be posting stuff on visual complexity, is that visual complexity, in a way. Some people call it a blog, but I've never thought of it as a blog per se, in the sense that you have this sort of bits of information that are always chronologically organized with the most up to date on the top, and then you really eagerly wait for the next post to come out. I think we never, I think I never sort of served for that sort of pressure to constantly put stuff out. It was always seen as an archive that can grow and sort of expand over time, but it's not sort of committed to a given timeframe for it to sort of constantly.",
      "id": "ep_38_ut_74"
    },
    {
      "end": 851430,
      "speaker": "Moritz Stefaner",
      "start": 814210,
      "text": "It's not a new site in any way. It's like you can also add an old project. Right. And nobody will complain. Yeah. And I think that's a great quality of the site also, as compared to, let's say, flowing data or info statics, which have always followed the blogging model. And then once you have a few hundred posts or so. Right. How do you organize them and how do you make that an archive as well? That's a very, it's a tough challenge if you start off with this like constant output and the blogging model and. Yeah, yeah. And I like how you always, how you very early already saw it as an archive and just designed the whole site around that.",
      "id": "ep_38_ut_75"
    },
    {
      "end": 885580,
      "speaker": "Manuel Lima",
      "start": 852050,
      "text": "Yeah. And to be honest, I have actually a list of things that I've been maintaining over the years and adding to it over the years, a list of things that I want to do on the side, enhancements I want to do on the side. There's a variety of ideas and things I want to expand upon, but time is always an issue. And I think over time, also the fact that this was never my full time job, you know, I got a little bit of money out of, you know, some, some Google Ads and whatnot, but it doesn't really like pay the bills at all. You might pay for a dinner at once a month, you know.",
      "id": "ep_38_ut_76"
    },
    {
      "end": 893616,
      "speaker": "Enrico Bertini",
      "start": 887280,
      "text": "So as everyone who ever attempted this knows very well, it's not as easy as it looks like.",
      "id": "ep_38_ut_77"
    },
    {
      "end": 924048,
      "speaker": "Manuel Lima",
      "start": 893728,
      "text": "Exactly. Well, but then of course we have, you know, the case of full time bloggers, you know, people that reach the threshold of like really, you know, in the order of like thousands and millions of readers. So when you reach that level, you can probably make, you know, comfortable living out of the blog. And then of course the motivation to keep updating it and maintaining it in a, in a, in a proper way is an entirely different game. Right. I think that was never the case for me. So I think over time you have a tendency to just, I wouldn't say abandon it, but leaving it in the periphery somehow.",
      "id": "ep_38_ut_78"
    },
    {
      "end": 925660,
      "speaker": "Enrico Bertini",
      "start": 924104,
      "text": "Yeah, yeah.",
      "id": "ep_38_ut_79"
    },
    {
      "end": 929632,
      "speaker": "Moritz Stefaner",
      "start": 926240,
      "text": "Right now you have 777 projects.",
      "id": "ep_38_ut_80"
    },
    {
      "end": 930336,
      "speaker": "Manuel Lima",
      "start": 929816,
      "text": "Correct?",
      "id": "ep_38_ut_81"
    },
    {
      "end": 947344,
      "speaker": "Moritz Stefaner",
      "start": 930408,
      "text": "So that's hard to. Like to add one to that beautiful number. No, but anyway, I mean there is only a limited amount of things you can do for the network. Right. And I think probably, you know, you're covering the ground pretty well, so I don't think there's so much pressure also to add stuff. I think it totally.",
      "id": "ep_38_ut_82"
    },
    {
      "end": 955176,
      "speaker": "Manuel Lima",
      "start": 947392,
      "text": "Yeah, yeah, you're right, you're right, I think. But to be honest, like, I was thinking about this lately about, you know, reaching the thousand, you know, that would be the final mark.",
      "id": "ep_38_ut_83"
    },
    {
      "end": 956060,
      "speaker": "Moritz Stefaner",
      "start": 955208,
      "text": "That would be nice.",
      "id": "ep_38_ut_84"
    },
    {
      "end": 957680,
      "speaker": "Enrico Bertini",
      "start": 956560,
      "text": "Yeah, yeah.",
      "id": "ep_38_ut_85"
    },
    {
      "end": 971298,
      "speaker": "Manuel Lima",
      "start": 957720,
      "text": "But reaching 1000 projects and reaching that, that milestone next year, the summer of 2015, which is like the ten year anniversary of that would be awesome. And then like doing the party around that and then, you know, and then.",
      "id": "ep_38_ut_86"
    },
    {
      "end": 972670,
      "speaker": "Enrico Bertini",
      "start": 971314,
      "text": "You freeze it forever.",
      "id": "ep_38_ut_87"
    },
    {
      "end": 1020596,
      "speaker": "Manuel Lima",
      "start": 973130,
      "text": "Yeah, exactly. Then it's like frozen in time. But at least it's always available. People, you know, get to sort of play with it and. Well actually one of the things that. Yeah, one of the things that's pretty hard actually, about a digital archive, which could be a segue for like visual complexity of the book, is actually the amount of dead links over time that you start accumulating. I don't know right now what is the percentage? But probably if you go to, if you explore all the projects on visual complexity, maybe, I would argue maybe ten if not more. 10% of more are entirely dead links. Projects that have been abandoned. People have removed the URL's from the websites. There's a bunch of projects like that, which is very unfortunate, but at least we got the thumbnail. So at least we have a very small sort of visual representation of that project that sounds like the kind of.",
      "id": "ep_38_ut_88"
    },
    {
      "end": 1025800,
      "speaker": "Enrico Bertini",
      "start": 1020628,
      "text": "Thing that you can try to outsource to crowdsource and try to fix it. Right?",
      "id": "ep_38_ut_89"
    },
    {
      "end": 1044274,
      "speaker": "Moritz Stefaner",
      "start": 1027260,
      "text": "Yeah, but some projects are actually gone. So I also realized that. So I did, for a few projects, research on older stuff. And as you said, a lot of the early stuff is actually gone. Like the domain is gone or the whole, I don't know, they switched to a new system and the project isn't there anymore. It happens.",
      "id": "ep_38_ut_90"
    },
    {
      "end": 1056322,
      "speaker": "Manuel Lima",
      "start": 1044322,
      "text": "Yeah, yeah, it happens. I mean, even recently when I was doing my second book, the Book of Trees, I was actually trying to look for the Project Ecotonoa. You guys remember that one from Yugo Nakamura?",
      "id": "ep_38_ut_91"
    },
    {
      "end": 1057690,
      "speaker": "Moritz Stefaner",
      "start": 1056386,
      "text": "Yeah, the nice tree.",
      "id": "ep_38_ut_92"
    },
    {
      "end": 1115430,
      "speaker": "Manuel Lima",
      "start": 1057850,
      "text": "The nice tree that you can post sort of messages on the tree and then the URL was gone. It was actually sponsored, I think, by NaC, by the technology company. And it was just like abandoned. It was just, you know, it was not in their own interest to maintain that website because, as you know, like it. It costs time and money to maintain a lot of those domains. And then people, over time, just don't see any value and then abandon it. And the unfortunate thing is that I guess all of us kind of lose part of that process, us, our species, because a lot of these projects are really interesting cultural artifacts that reflect the way of thinking of a given time, of a given moment in time. When you start losing a lot of that stuff is problematic because you don't have ways of retrieving it again, which is slightly concerning. At least I don't lose sleep nights over it, but still, it's something that has been very much of a concern for myself.",
      "id": "ep_38_ut_93"
    },
    {
      "end": 1129630,
      "speaker": "Enrico Bertini",
      "start": 1115730,
      "text": "Sure, sure. And I'm just curious to hear, is there a reason why from the very early. So when you started, you already focused on exclusively networks, on visual complexity?",
      "id": "ep_38_ut_94"
    },
    {
      "end": 1136228,
      "speaker": "Manuel Lima",
      "start": 1130300,
      "text": "Yeah, I don't know what draw me necessarily to networks. I think it was the challenge, the.",
      "id": "ep_38_ut_95"
    },
    {
      "end": 1137920,
      "speaker": "Moritz Stefaner",
      "start": 1136244,
      "text": "Fact that everything's connected.",
      "id": "ep_38_ut_96"
    },
    {
      "end": 1152852,
      "speaker": "Manuel Lima",
      "start": 1138260,
      "text": "Yeah, but I think it was also the challenge. Yeah, exactly. Everything is connected and. Yeah, maybe I was actually. I probably know exactly what it was. I actually, I read Barabbasi's linked even before I started working on my thesis. Right.",
      "id": "ep_38_ut_97"
    },
    {
      "end": 1153956,
      "speaker": "Moritz Stefaner",
      "start": 1152876,
      "text": "It's a dangerous read.",
      "id": "ep_38_ut_98"
    },
    {
      "end": 1209030,
      "speaker": "Manuel Lima",
      "start": 1154028,
      "text": "Yeah, yeah, I remember the difference. So it was a, like Moritz was saying, like the realization of everything is totally interconnected and interdependent. I think that was. And then I read, I think following that book, or even before that book, I read emergence by Stephen Johnson, which also plays this idea of networks. It actually goes deep into networks and interdependence and emergent behavior, all that. And I think I was really getting really so interested but I think it was also from a visualization point of view, it was also because it's probably the most challenging of every topic you might think about visualizing. Networks tend to be the most complex one, the most harder to sort of decipher. I think it was that element of difficulty that sort of engaged me. It's like, you know, I'm not so interested in, like, you know, simple things. I'm. I think the complex ones are the ones that, you know, makes you sort of engaged and passionate and sort of like the strive for understanding. And I think that was really what sort of motivated me the most about networks.",
      "id": "ep_38_ut_99"
    },
    {
      "end": 1215280,
      "speaker": "Moritz Stefaner",
      "start": 1209700,
      "text": "Just a random thought. But did you know there's a German author who published a book called visual simplexity?",
      "id": "ep_38_ut_100"
    },
    {
      "end": 1242400,
      "speaker": "Manuel Lima",
      "start": 1215900,
      "text": "I heard about it. I heard about it. Thank you. Actually, that was. I think there was even a blog. There might even be a blog called visual simplicity or something. But, yeah, it's an open invitation for a fight, obviously. Exactly. Maybe it's going to be the ten year anniversary. We invite those and then have like a panel it out. Exactly.",
      "id": "ep_38_ut_101"
    },
    {
      "end": 1247280,
      "speaker": "Enrico Bertini",
      "start": 1243980,
      "text": "So, Manuel, how did you transition to the book, then?",
      "id": "ep_38_ut_102"
    },
    {
      "end": 1388900,
      "speaker": "Manuel Lima",
      "start": 1248780,
      "text": "The book? Well, I think the book was. I was. I think was the motivation was really much what we talked about. I think at some point I realized that this archive was growing, that people were, you know, at least some people were interested in its content. And just a realization of a lot of these projects being gone as we were talking, a lot of URL's being abandoned, domains being closed, servers being down, et cetera. And the realization that a lot of these interesting cultural artifacts, which they are, all of them, in each different way, is a cultural artifact. They were being gone forever. I think the book came as an idea of not just expanding the audience of the website, which was growing, but still, I think with the book, you can reach other types of audience as other types of users that are interested in this type of material. And the second reason was, again, saving this material for posterity. And I think it goes back to the realization of. I think I talked to Moritz, actually, about this, the idea of the digital dark ages. Yeah, so I don't know if you heard about this, Enrico, but the digital dark ages is something really interesting to me. It's this theory of this prospect that some point in the future, we're going to look back to the current time and not being able to understand what we are producing, all the digital artifacts that we are creating. This is not really that hard to imagine. As plugins keep on disappearing formats, file formats keep on changing proprietary formats keeps on changing. All of that is really not that difficult to understand. Again, a lot of these projects vanishing from services and so on. I think that's something that was definitely concern to me. And the benefit of a book still in a printed format is that it can probably outlast by, by far any website that we create nowadays. It has this sort of like, in temporal sort of presence that a website, I think most websites will be, will struggle to have in many different ways. So I think that was, you know, the ultimate sort of goal of like putting all this material in a book that can, people can use, not just of this generation, but hopefully other generations in the future, and look back at the kind of interesting work that we were doing right now.",
      "id": "ep_38_ut_103"
    },
    {
      "end": 1413282,
      "speaker": "Enrico Bertini",
      "start": 1390000,
      "text": "Okay, so did you. So I really want to understand. So did you conceptualize the book as some sort of printed archive then? So did you picture it as a. As a way for people to just flip through the pages and look at these images or, I mean, or you had a broader character?",
      "id": "ep_38_ut_104"
    },
    {
      "end": 1416922,
      "speaker": "Moritz Stefaner",
      "start": 1413386,
      "text": "The first book especially had a big text part to it as well.",
      "id": "ep_38_ut_105"
    },
    {
      "end": 1417510,
      "speaker": "Enrico Bertini",
      "start": 1416946,
      "text": "Yeah.",
      "id": "ep_38_ut_106"
    },
    {
      "end": 1429914,
      "speaker": "Moritz Stefaner",
      "start": 1418330,
      "text": "The attempt to sort of categorize all these different ways to visualize networks and reflect on. Yeah. Why is it the age of networks and what does that mean and things like that?",
      "id": "ep_38_ut_107"
    },
    {
      "end": 1524702,
      "speaker": "Manuel Lima",
      "start": 1429962,
      "text": "Totally. I think that's a really good point. That's a really good point, Enrico. And to be honest, I never saw it in entirely as an archive. And I think it was an opportunity to also reflect, as Moritz is pointing out, a little bit on the role of networks, on the change that network is bringing. Not just as a visualization, metaphor or model, but as a way of looking at thinking about the world around us. So that sort of shift in this paradigm shift in the way that we are understanding the world around us and networks and network science is a great drive for that shift. And I wanted to reflect a little bit upon that. But now thinking about it after the book is done, I think I did the worst thing you could ever, ever do, which is you do a bit of a coffee table book and a lot of, like every textbook, which is probably the worst any author can do in the sense that. So writing is really hard enough, right. And you spend a lot of time writing and, you know, putting your thoughts together and organizing it in a meaningful way. And then. And that's, you know, already a lot of work. And then if you decide to do just a coffee table book, then you lose a lot of time also, like collecting images, you know, managing rights and permissions and all that, you know, cleaning up the images at a time, all that, which is another huge chunk of work. So doing those two things in tandem for one single volume, it's a nightmare, especially because it was my first one and I did know all the shortcuts and the processes to minimize amount of rework and so on. So it was definitely like looking in inside. It was really, really hard.",
      "id": "ep_38_ut_108"
    },
    {
      "end": 1529386,
      "speaker": "Moritz Stefaner",
      "start": 1524806,
      "text": "How long did it take you? I remember you were working at Nokia, Nokia at the time in London, right?",
      "id": "ep_38_ut_109"
    },
    {
      "end": 1572948,
      "speaker": "Manuel Lima",
      "start": 1529458,
      "text": "Yeah. Yes, I was working at Nokia at the time. And then I got an invite to actually talk at TED Global in Oxford, UK. And then it was, as you guys can imagine, it was like one of the most sort of mind blowing experiences of my lifetime. And not just being there in Oxford, which is sort of a city sort of heavy with history and knowledge and wisdom, but also like being surrounded by all those minds and talking to all of those minds. After that, I remember being on the train back to London on that train. I decided to leave my job, my current well paid, very comfortable job at Nokia and dedicate myself for six months writing the book on my own.",
      "id": "ep_38_ut_110"
    },
    {
      "end": 1573828,
      "speaker": "Enrico Bertini",
      "start": 1573004,
      "text": "That's awesome.",
      "id": "ep_38_ut_111"
    },
    {
      "end": 1599730,
      "speaker": "Manuel Lima",
      "start": 1573964,
      "text": "And that's what I did. So the following Monday, I went to my manager at the time in Nokia, say, I love working here. It's a great job and I love the work we're doing. I would love to dedicate myself to, like, for six months just writing the book. And that's what happened. So it was, yeah, it was a really hard time, as my wife can attest to. It was really tough. Six months.",
      "id": "ep_38_ut_112"
    },
    {
      "end": 1607710,
      "speaker": "Enrico Bertini",
      "start": 1600030,
      "text": "So do you mean tough because it was a lot of work or because it was demanding from the psychological point of view or both?",
      "id": "ep_38_ut_113"
    },
    {
      "end": 1686000,
      "speaker": "Manuel Lima",
      "start": 1607870,
      "text": "Both. Both. Absolutely both. I think it was, you know, the pressure of nothing, not knowing if what you're doing is the right thing. But also, it was my first book, so I don't know, like the editing part, I realized very naively at the time that the book, when it comes to the writing part, has to be perfect. Every single dot needs to be in place. And of course, that's not the case. There's like three or four editing processes that happen afterwards. So I wouldn't say that you have to be sloppy in the first draft, but you don't have to be that perfectionist with the first draft. You know, things like that you learn over time. And I think for the second book now, it was a lot easier because I knew, I knew a lot of these processes and sort of shortcuts. So it was tough because of that, because I didn't know, all the shortcuts and just amount of work was impressive. Just the writing part, but also getting all the images and permissions. And it was really, really time consuming. I think my email inbox is always for any book. Actually for both books is really, really tricky. I have like flags of every color. I try to do like color coordination and all of that. Somehow trying to find ordering, the chaos of my email inbox because it's really hard, just. But again, without many of those authors, this couldn't really exist.",
      "id": "ep_38_ut_114"
    },
    {
      "end": 1701048,
      "speaker": "Enrico Bertini",
      "start": 1688340,
      "text": "Yeah. But I'm just wondering. So for your first book, for visual complexity, you've basically been using the archive that you already had on the website. Oh, you've been doing additional research there?",
      "id": "ep_38_ut_115"
    },
    {
      "end": 1789080,
      "speaker": "Manuel Lima",
      "start": 1701224,
      "text": "Oh, I did a lot of additional research, yeah. So I did, yeah. I mean, one of the sort of initial research that actually became sort of the, I guess the building blocks for what ended up becoming my second book was a research I did on trees, on ancient trees, and tree visualization, which was the first chapter of visual complexity, which is called the tree of life. So all of that was entirely new. Even the second chapter was fairly new. I think I had given a few lectures on that topic, but it was all about the paradigm shift between trees and networks. And for centuries, even millennia, we have used the tree metaphor, the tree model, as a way of visualizing and explaining the world around us. From the areas of science to how the brain operates, to how cities operate, to religion, to sort of moral conduct, to systems of law, we have used this metaphor of the tree. And what's interesting is our networks are actually replacing the metaphor entirely in many of these topics, in many of these sort of areas of human knowledge. So that's why I mentioned sort of this paradigm shift. And I need to introduce trees. And I had to introduce trees as a first chapter of the book to then provide a little bit more guidance towards the shift and then expand deeply into networks. And I think that was the corpus of visual complexity. The website on the following chapters.",
      "id": "ep_38_ut_116"
    },
    {
      "end": 1789488,
      "speaker": "Moritz Stefaner",
      "start": 1789160,
      "text": "Yeah.",
      "id": "ep_38_ut_117"
    },
    {
      "end": 1790032,
      "speaker": "Enrico Bertini",
      "start": 1789544,
      "text": "Okay.",
      "id": "ep_38_ut_118"
    },
    {
      "end": 1798660,
      "speaker": "Moritz Stefaner",
      "start": 1790096,
      "text": "But still, you had to go back and make a project selection and get print ready graphics, all this. I can totally see how that's.",
      "id": "ep_38_ut_119"
    },
    {
      "end": 1837990,
      "speaker": "Manuel Lima",
      "start": 1799480,
      "text": "Yeah, I think the hardest one. Yeah, totally. I think the hardest one was the taxonomy. I think it was on chapter five, you know, the syntax of a new language which has been, I think, the most loved and the most criticized by some people, which is always hard as any taxonomy, any sort of type of ontology that you want to create on any given topic, especially being the first, you always going to go through some holes and some problems, but it was an attempt of trying to understand all the different models and visualization approaches and methodologies that people are using and try to organize and categorize them in a meaningful way.",
      "id": "ep_38_ut_120"
    },
    {
      "end": 1845150,
      "speaker": "Enrico Bertini",
      "start": 1840570,
      "text": "So did you have something, some reviews before the paper was published?",
      "id": "ep_38_ut_121"
    },
    {
      "end": 1849682,
      "speaker": "Manuel Lima",
      "start": 1846370,
      "text": "No, it was before the book was published.",
      "id": "ep_38_ut_122"
    },
    {
      "end": 1854630,
      "speaker": "Enrico Bertini",
      "start": 1849786,
      "text": "Yeah. Oh, sorry. What did I say? Paper? Yeah, sorry.",
      "id": "ep_38_ut_123"
    },
    {
      "end": 1856550,
      "speaker": "Moritz Stefaner",
      "start": 1855650,
      "text": "Guess what?",
      "id": "ep_38_ut_124"
    },
    {
      "end": 1910490,
      "speaker": "Manuel Lima",
      "start": 1860090,
      "text": "No, I had. I had some reviews afterward, which was great. I mean, it was fairly well received. I got reviews from the New York Times and a few others. So it was definitely well received. And people could realize the importance of this discussion, this topic of visualizing networks, because it's still very present in many of the things we address and think about on a daily basis. When you think about political ties and networks of influence in biology, network really pervades any sort of field we can think of. So it is so present and so important. And I think this book somehow contributed to that discussion and made people sort of reflect a little bit more, I guess, about the importance of visualizing many of these, of these territories and platforms and domains.",
      "id": "ep_38_ut_125"
    },
    {
      "end": 1940854,
      "speaker": "Moritz Stefaner",
      "start": 1912510,
      "text": "Yeah. And I think it opened like a whole new audience for this whole, like, this nerdy data visualization world, because I think you managed so well to, to bring in, like, the art aspect and the science aspect. And, and I think in the end, it worked out that it's both a coffee table as well as a theory book. You know, like, from the end product, it might not have been the smartest thing, like, for your, like, work life balance, but I think for the book. For the book, it worked.",
      "id": "ep_38_ut_126"
    },
    {
      "end": 2014734,
      "speaker": "Manuel Lima",
      "start": 1940902,
      "text": "Yeah, that was good. Yeah, that's a good point. Yeah, I think actually probably my favorite chapter, and I think some people say the same, was the chapter, the complex beauty chapter, which goes deep into art and comparisons with fractals and pollocks. And that one was also really hard, because how can you sort of try to explain if there is any sort of intricate sort of attachment in this sort of appeal for networks on a visual, sort of emotional level? How can you explain that when you see a great network visualization, there's almost this intricate, visceral appeal that it has on us as human beings? How can you explain that? I pose a few theories on possible theories on how to explain that in errand appeal, taking that work of Pollock and other scientists and whatnot. I think it was a really interesting chapter and also to see, again, this boundary between science and art. And now many artists are being influenced by a lot of the visualization work we are doing as scientists, researchers and designers are doing. So it is a very symbiotic process, which is really interesting to me as well.",
      "id": "ep_38_ut_127"
    },
    {
      "end": 2035304,
      "speaker": "Moritz Stefaner",
      "start": 2014822,
      "text": "Yeah, cool. And you hinted at it a bit, but in the end I found it really funny that at some point you said, now I'm writing a book about trees. And I was like, you were bashing trees in the first. This is the thing of the past, you know, it's gone totally. Nobody needs them anymore, cares about trees.",
      "id": "ep_38_ut_128"
    },
    {
      "end": 2036616,
      "speaker": "Manuel Lima",
      "start": 2035432,
      "text": "Yeah, exactly.",
      "id": "ep_38_ut_129"
    },
    {
      "end": 2043840,
      "speaker": "Moritz Stefaner",
      "start": 2036728,
      "text": "And then you were like, yeah, might write a book about trees. So how did that happen? Was it like, did you want to escape?",
      "id": "ep_38_ut_130"
    },
    {
      "end": 2044336,
      "speaker": "Manuel Lima",
      "start": 2043880,
      "text": "Yeah, you're right.",
      "id": "ep_38_ut_131"
    },
    {
      "end": 2046100,
      "speaker": "Moritz Stefaner",
      "start": 2044368,
      "text": "Yourself or what's going on?",
      "id": "ep_38_ut_132"
    },
    {
      "end": 2352010,
      "speaker": "Manuel Lima",
      "start": 2046440,
      "text": "No, no, no. Well, I mean, you're right, you're right. I mean, I was, I was bashing the trees not so much as, again, a visualization model, but as a way of understanding the world around us in the sense that if you think about systems or domains that are highly centralized and dependent on that core of that CEO and that centralized command, and you think about this very hierarchical processes, all of us involved in technology and the new digital age, we realized some of those concepts are already outdated. It's more about networks and decentralization and sort of flatten out the process because there's a lot of benefits that can come from that. But still, it's really interesting to me. All trees were again used for centuries and millennia, even as the visualization model of choice of numerous researchers and authors and illustrators and so on. So there's something really, really appealing about trees at the same time that even though we are facing this paradigm shift, there's something really, again, appealing to us at a very intricate level. So I think the book, and because I did that introduction for visual complexity, the Tree of Life, in the first chapter, I think I immediately realized that this story was too beautiful, too powerful, too strong to be left to a single chapter on a book about networks. Right. And I felt it was a, that chapter needed a whole volume and a whole entire book dedicated to that specific visual metaphor. And that's why it was born. I think it was. I think I want two reasons, I think was, one was really to tell this untold story, because in many ways, some people reference trees, and there's other very philosophical books talk about tree as a metaphor and so on. But there has never been, at least to my knowledge, a dedicated book on this metaphor, one that covers so much space and time and so many different domains of knowledge. So that was a beautiful story that I think had to be told. And that was my main motivation to putting the book together, just again, telling this untold story and tell it in a very sort of pluralistic, universal way. And then I think the second point, that was very much the goal of putting this book together, my latest one, the Book of Trees, was also to somehow oppose our present bias, the idea of presentism, which I think all of us are very eager to open our Twitter app or our Facebook app and just eagerly wait for the latest post. And I think that could be fun, but at the same time, it could be problematic because it somehow blinds us from seeing the big picture, and the big picture being all the stuff that happened in the past. And I think I wanted to sort of convey this sort of long history of information visualization. And I think if you look at most of the books that are written in this topic, they go probably, if they want to have. They want to provide any sort of contextual sort of information, they go maybe as far as the 18th or 19th century as a foundation of information visualization, right? And true. I mean, there's a lot of really interesting people back then that was doing a lot of interesting work. But I think it's really unfair to think there was nothing else before that time. There was just not a blank state. It's impossible to think that was just a blank state. So I think the book tries to sort of prove that this is not a new thing. I think it's too easy for us to think of visualization as this new discipline rising to meet the demands of the new century, which is very poetic, but at the same time not true. So I think the book tries to sort of show this long evolution of visualization through the lens of the tree figure through the lens of the tree visual metaphor. And it's also like telling this meta narrative. What I think is really interesting for me is that if you look at many books on history, they concentrate either on a very specific civilization or space, ancient Babylon, ancient Rome, the Incas, etcetera. Or they focus on a very specific time. Right. The 12th century, the 15th century, the age of enlightenment, the digital age. But I think those books tend to suffer from being too self contained, right. And so for me, those stories are interesting to a given point. But the most interesting stories for me are the ones that really traverse time and space. They're the ones that really are narratives of narratives. You know, this idea of a meta narrative, and I think the tree is one of those meta narratives. It's again, a model that, again, traverses time and space that you can find in any society across the world and almost any given point in time. So there's something really, really appealing about this, which, again, had to be conveyed in the book. Sorry if I extended a little bit too long.",
      "id": "ep_38_ut_133"
    },
    {
      "end": 2375614,
      "speaker": "Moritz Stefaner",
      "start": 2352050,
      "text": "No, that totally makes sense. And I think it's a great, a great perspective. And you are right. It's fascinating, not just as a visualization model, but actually because I think it's a tool for thought. Like, you know, the whole tree model is. Yeah, it's a basic way of thinking. And with you, like, exploring all these connections in the past, we get to learn so much about how people thought in the past and.",
      "id": "ep_38_ut_134"
    },
    {
      "end": 2376038,
      "speaker": "Manuel Lima",
      "start": 2375702,
      "text": "Yeah.",
      "id": "ep_38_ut_135"
    },
    {
      "end": 2378046,
      "speaker": "Moritz Stefaner",
      "start": 2376094,
      "text": "And I hadn't seen it from that way. Yeah, it's very nice.",
      "id": "ep_38_ut_136"
    },
    {
      "end": 2390850,
      "speaker": "Manuel Lima",
      "start": 2378078,
      "text": "Yeah. Well, as you're saying, Moritz, it's actually, it has even influenced the way we talk and communicate with each other. You know, when you say the bank opened a new branch or you're going to branch out to this new thing or the root of a problem.",
      "id": "ep_38_ut_137"
    },
    {
      "end": 2392238,
      "speaker": "Moritz Stefaner",
      "start": 2391430,
      "text": "Exactly.",
      "id": "ep_38_ut_138"
    },
    {
      "end": 2436040,
      "speaker": "Manuel Lima",
      "start": 2392374,
      "text": "All those metaphors we use, well, even like biology is a branch of science, all those metaphors we use on a day to day basis are based on that visual metaphor. On the metaphor of all these topics being organized as a tree, as you find, for instance, the idea of science or knowledge being organized as a tree goes back to Raman Loul, one of the Spanish schoolers, one of the scholars that actually talk extensively on the book of trees, because it was really the foundation of many of these concepts. But, yeah, it's really interesting how it's not just like a visual model to represent knowledge. It's really so ingrained in our brains and the way we think about the world around us and many of the subjects we like to debate.",
      "id": "ep_38_ut_139"
    },
    {
      "end": 2477780,
      "speaker": "Enrico Bertini",
      "start": 2437380,
      "text": "Yeah. And I think what is really interesting is that today we are so entrenched into this idea that visualization is about visualizing data and possibly a lot of data. But some of these examples show that actually visuals have been used for a long time just as a way to take some information that is in your head and put it out there so that you can see it with your eyes and go through much deeper reasoning. And also, of course, for communication of important ideas. So I think that's another interesting angle for. Or things that you actually realize when you see these old images that are really, really beautiful.",
      "id": "ep_38_ut_140"
    },
    {
      "end": 2540520,
      "speaker": "Manuel Lima",
      "start": 2478480,
      "text": "Absolutely. I mean, that's the thing for me, that if you bypass entirely this discussion about what is the right label to call our discipline, if you bypass that entirely, you're going to realize that the goals of all these people doing this magnificent work back in the 12th century or the 13th century, the goals, the motivations, was entirely the same as our motivations right now. They were trying, by means of visualization, to simplify and clarify, to provide insight, to educate an audience, to provide. They were really, a lot of the metaphors that we're using, primarily the tree, were strong visualization metaphors and models to provide and to solve the same problems as we're facing now. It's really not that different. So again, if you bypass all the idea of nomenclature and what is the right name to call what we do, which is always like a tricky subject, you find out that at least from a sort of purpose point of view, it's entirely the same. It doesn't really change that much at all.",
      "id": "ep_38_ut_141"
    },
    {
      "end": 2551520,
      "speaker": "Moritz Stefaner",
      "start": 2541700,
      "text": "Here's a practical question. How did you find all these old graphic. Did you just type a cool old tree into Google and take the first page? How do you do that?",
      "id": "ep_38_ut_142"
    },
    {
      "end": 2669714,
      "speaker": "Manuel Lima",
      "start": 2551910,
      "text": "Really hard. Yeah, the new ones are fairly easy because I think all of us are exposed to new projects that are coming out. And we know, like the main ones that deal with trees or any sort of other visualization metaphors, the old ones. As you pointed out, Moritz is definitely one of the hardest. And I think, fortunately for researchers or curious researchers like myself, it's great. And the Internet is providing this sort of new platform and seeing how many museums and galleries like the British Library, the Library of France, France, the Spanish Library, the Metropolitan Museum, a lot of these critical institutions are finally opening up their archives and putting all this material online and available for free for people to use and research, which is great, but that's just the beginning. The beginning is knowing what resources you can use. A lot of those references. The British Library, for instance, has been an invaluable resource, as well as the national Library of France. But then it's also knowing what to look for, as you're saying, Moritz, I think I had to know how to spell tree in maybe ten languages, from German to Italian to Portuguese to Spanish to every single language that could be important to retrieve that information. And then sometimes, even when you find the illustration, there's no more information about it. That's it. If you're lucky, maybe there's, like, the ear, there's maybe the altar. And then this is where the real fun begins, you know, like when the really sort of hard core research starts trying to sort of find more information about the author, about, you know, his life or life, about the context surrounding that person, you know, what was happening around him, etcetera. It's just, you know, historical research, basically to sort of like, portray this, you know, why that person made this chart in such a way, the influences and so on.",
      "id": "ep_38_ut_143"
    },
    {
      "end": 2670630,
      "speaker": "Moritz Stefaner",
      "start": 2669882,
      "text": "Wow.",
      "id": "ep_38_ut_144"
    },
    {
      "end": 2682098,
      "speaker": "Enrico Bertini",
      "start": 2671570,
      "text": "So you've been relying exclusively on digital media, or you've been also going to into places and looking at the original file. The original documents did.",
      "id": "ep_38_ut_145"
    },
    {
      "end": 2687658,
      "speaker": "Manuel Lima",
      "start": 2682154,
      "text": "But you know what? I think, unfortunately, it's actually a lot harder to go to physical places, not.",
      "id": "ep_38_ut_146"
    },
    {
      "end": 2690906,
      "speaker": "Enrico Bertini",
      "start": 2687674,
      "text": "Just because from your world, but it's.",
      "id": "ep_38_ut_147"
    },
    {
      "end": 2743796,
      "speaker": "Manuel Lima",
      "start": 2690938,
      "text": "Also like, it's just so lost in time. It's just like the processes. There's so much bureaucracy to, like, even sort of requests one of those ancient manuscripts. There's a lot of processes. I mean, I remember when I was in London and I was doing some research on that, I went to the British library, which is, I think, the second biggest library in the world. They have a lot of. A ton of really interesting material and old manuscripts, but it was just so hard to get it sent then you cannot copy it. There's nothing you can do because, of course, a lot of these materials are extremely sort of valuable. It was just a lot harder. So I think you can do that, but I think you waste a lot more time in doing so. And that's. That's. Therefore. But again, before, that was the only option. You know, fortunately, now a lot of these, you know, critical institutions are releasing to the general public a lot of this material, which is great for, again, people like myself interested in a lot of this material.",
      "id": "ep_38_ut_148"
    },
    {
      "end": 2762372,
      "speaker": "Moritz Stefaner",
      "start": 2743868,
      "text": "Yeah. There's like a million images from the British Library and the Rijksmuseum. And in Holland, in the Netherlands, has opened a lot of images. And I'm also still waiting until, like, really nice collections of historical, like, illustrations and diagrams and so on are compiled based on that.",
      "id": "ep_38_ut_149"
    },
    {
      "end": 2763132,
      "speaker": "Manuel Lima",
      "start": 2762436,
      "text": "Yeah.",
      "id": "ep_38_ut_150"
    },
    {
      "end": 2767960,
      "speaker": "Enrico Bertini",
      "start": 2763316,
      "text": "So did you ever think about having exhibitions.",
      "id": "ep_38_ut_151"
    },
    {
      "end": 2795026,
      "speaker": "Manuel Lima",
      "start": 2770460,
      "text": "As a picture about, like, this old? Yeah, I think I was approached by a few people. I think there was an idea of curating maybe an exhibit on this. Yeah, I would definitely. I don't think why? Now that I try to think about. I don't know why that actually never happened, but I think it could be something that might happen in the future. I think that would be great, actually, like, fantastic. Yeah, yeah. Gathering a lot of this, like real. The real thing, right?",
      "id": "ep_38_ut_152"
    },
    {
      "end": 2795498,
      "speaker": "Enrico Bertini",
      "start": 2795138,
      "text": "Yeah.",
      "id": "ep_38_ut_153"
    },
    {
      "end": 2798450,
      "speaker": "Manuel Lima",
      "start": 2795554,
      "text": "Showcase it to people. Yeah, that would be actually great. Yeah, yeah.",
      "id": "ep_38_ut_154"
    },
    {
      "end": 2817270,
      "speaker": "Moritz Stefaner",
      "start": 2798490,
      "text": "There's actually two good connections. So, you know, Michael Stoll, the professor from Augsburg, he has a huge collection of. Huge collection, historical stuff. And I think if you would dig through his archives specifically for trees and networks, that would be very, like, there could be a lot of stuff already nice, nice.",
      "id": "ep_38_ut_155"
    },
    {
      "end": 2819710,
      "speaker": "Manuel Lima",
      "start": 2818930,
      "text": "Yeah.",
      "id": "ep_38_ut_156"
    },
    {
      "end": 2821950,
      "speaker": "Enrico Bertini",
      "start": 2820890,
      "text": "To have fun.",
      "id": "ep_38_ut_157"
    },
    {
      "end": 2826790,
      "speaker": "Manuel Lima",
      "start": 2824850,
      "text": "Exactly, exactly.",
      "id": "ep_38_ut_158"
    },
    {
      "end": 2874900,
      "speaker": "Enrico Bertini",
      "start": 2827170,
      "text": "So, Manuel and. Yeah, so you've been doing this thing for a very long time now, right? So we just said that visual complexity started almost ten years ago. So I'm curious to hear from you. I'm wondering if you feel like giving us a broad perspective on how you see this developing. Right. So you've been watching for many years and I'm sure that you've been seeing this thing developing. Right. I think it's the same for everyone here. And so do you have any thoughts about how this was when you started, how it is now? Do you think that everything, that something important has changed since then? And how do you see this developing in the future as well?",
      "id": "ep_38_ut_159"
    },
    {
      "end": 2979060,
      "speaker": "Manuel Lima",
      "start": 2876640,
      "text": "That's a good point. I don't know. Definitely a lot of things have changed since we were talking about this ten years ago. That was almost like maybe just a few blogs, a couple of blogs talking about this subject. And now you probably, I don't even know how many exist out there. Some of them are actually very specific. They concentrate only one specific methodology, methodology and so on. So that's really the change. I think the major change is like the level of interest, you know, like this has been growing exponentially, right. Not just the people involved in the field, but also the interest from people outside the field, you know, from media to like, you know, again, political parties to like. Anyone you can think of has probably already heard of this term visualization when ten years ago that was definitely not the case. So that's one positive aspect. Just the growth of sort of awareness of this discipline has grown a lot, considerably, I think partly due to the reason that is being somehow attached to the big data phenomenon this side of first of interest for big data. So there's definitely a positive thing. I think as the community grows, as more people get involved in this battle for understanding, I think there's a lot of benefits that can come from it, because we need as many brains as possible to face the challenges of this new society, this new complex, interconnected world that we are living on. So that's a great thing. But of course, with the growth of a field, then you have aspects that are not so great, like the birth of this infographic with capital letters or things of that kind.",
      "id": "ep_38_ut_160"
    },
    {
      "end": 2983020,
      "speaker": "Moritz Stefaner",
      "start": 2980440,
      "text": "But those are all infographic.",
      "id": "ep_38_ut_161"
    },
    {
      "end": 3069566,
      "speaker": "Manuel Lima",
      "start": 2983100,
      "text": "Exactly. The old caps infographic. Yeah, exactly. So. But I think all of that is just a byproduct of any field growing. There's always those kind of byproducts which for me it's just only naturally that those will occur and will continue occurring. When it comes to the future, I really don't know. I think one of the things I would like to see a lot more is, and I think that's happening as technology also, like, follows us, which is, you know, leaving these small screens behind. I think we are still very constrained and limited by the size of our screens. And that ultimately limits what we can do from a visualization standpoint and an interaction standpoint as well, exploring large platforms that we can explore information in a much deeper, immersive way. I think that could be definitely the future moving forward. If we extrapolate that you can think about intelligence and intelligence systems and objects around us conveying information. Maybe the color white on my wall right now is not white, just arbitrarily white. It's probably conveying some level of information. Then, of course, you have these deeply immersive systems like the allosphere. Have you guys heard of the allosphere? Yeah, sure. In the University of Santa. I've never been there. I wish I actually meth the main researcher at one of the conferences a while back, but I never actually went there in person. But I would love to go to.",
      "id": "ep_38_ut_162"
    },
    {
      "end": 3070878,
      "speaker": "Enrico Bertini",
      "start": 3069718,
      "text": "I'm not aware of that.",
      "id": "ep_38_ut_163"
    },
    {
      "end": 3135516,
      "speaker": "Manuel Lima",
      "start": 3071014,
      "text": "Yeah. So the allosphere is like a two story high sphere they created in the University of Santa Barbara in California. And it's meant to be this, like, super high tech ally immersive environment for visualizing different aspects of science. And the interesting thing is that they don't only visualize, but they play with other senses. So they play, I think, with sound and they play with other things. So it's truly like an all immersive, multisensorial experience. And I think those are signs of change that are really interesting to me when it comes to leaving these small screens behind and really getting ourselves immersed with meaningful sort of information and data. I think those are the signs of. Of some future interest for me. And also, I think, when it comes to visual metaphors, one of the things I've been sort of realizing by doing a lot of this research is how many of the metaphors we consider to be new, created very recently are actually quite old.",
      "id": "ep_38_ut_164"
    },
    {
      "end": 3136588,
      "speaker": "Enrico Bertini",
      "start": 3135588,
      "text": "None of them.",
      "id": "ep_38_ut_165"
    },
    {
      "end": 3215450,
      "speaker": "Manuel Lima",
      "start": 3136764,
      "text": "None of them, like, if you think about arc diagrams, that Martin Wattenberg famously sort of populated, sort of became sort of. The project became really famous by introducing this arc diagram metaphor. I think it was the shape of song. That metaphor has been used in medieval times to actually map, guess what, music. And there's, like, tons of examples when you think about tree maps. Of course, Ben Shneiderman invented the sort of the modern version of the tree map, the one that can actually sort of subdivide in multiple, multiple ways. He created the algorithm that allows that sort of process to exist. But the idea of a tree map is much older. It goes back to the 19th, if not the 18th century. So a lot of these metaphors that we somehow think are new and reflect this new age of visualization, many of them have also existed for centuries. So I think that the next challenge for us is to get away of this cyclicality of reusing the same metaphor on and on and on. And somehow. And this is. I know it seems pretty easy to say, but I think, yeah, we need hard challenges to solve. I think one of those hard challenges is like, coming up with new visual metaphors that can really solve the problems that we are facing in a much better way. I think a lot of the visual.",
      "id": "ep_38_ut_166"
    },
    {
      "end": 3217278,
      "speaker": "Enrico Bertini",
      "start": 3215990,
      "text": "Sorry for interrupting. Go ahead.",
      "id": "ep_38_ut_167"
    },
    {
      "end": 3218294,
      "speaker": "Manuel Lima",
      "start": 3217294,
      "text": "Yeah, no, please.",
      "id": "ep_38_ut_168"
    },
    {
      "end": 3229010,
      "speaker": "Enrico Bertini",
      "start": 3218462,
      "text": "No, I'm just asking. So you think that the design space is still. So there are parts of the design space that have not been explored yet?",
      "id": "ep_38_ut_169"
    },
    {
      "end": 3249624,
      "speaker": "Manuel Lima",
      "start": 3230040,
      "text": "Oh, yes, absolutely. Yeah. There's so much more to explore. Absolutely, I will. I would like to believe that's the case. Otherwise, that's not like so much of a future that, you know, the future prospect of, like, continually sort of regurgitating the same metaphors is not super appealing to me or to future generations. Right. I would imagine.",
      "id": "ep_38_ut_170"
    },
    {
      "end": 3253520,
      "speaker": "Moritz Stefaner",
      "start": 3249712,
      "text": "And then I would imagine in a way.",
      "id": "ep_38_ut_171"
    },
    {
      "end": 3276300,
      "speaker": "Enrico Bertini",
      "start": 3253560,
      "text": "I mean, in a way, you can see maybe that's just the way humanity evolves. Right. Every time a new idea is just repurposing an old idea, but every time we do that, we make it more refined and maybe better. Maybe that's the same with ideas themselves. Right?",
      "id": "ep_38_ut_172"
    },
    {
      "end": 3280096,
      "speaker": "Manuel Lima",
      "start": 3276600,
      "text": "That's a great point. You're totally right. And I think that might.",
      "id": "ep_38_ut_173"
    },
    {
      "end": 3290668,
      "speaker": "Enrico Bertini",
      "start": 3280128,
      "text": "Well, I mean, if you look at history of philosophy or whatever, even politics or ways to organize society or, I don't know, I think you can name so many different things.",
      "id": "ep_38_ut_174"
    },
    {
      "end": 3291644,
      "speaker": "Manuel Lima",
      "start": 3290744,
      "text": "Fashion. Fashion?",
      "id": "ep_38_ut_175"
    },
    {
      "end": 3311444,
      "speaker": "Enrico Bertini",
      "start": 3291692,
      "text": "Yeah, fashion and so on. So we, maybe it's just in human nature, the fact that we are reinventing stuff that have been invented already, but every time we do that, we do it in a different. In a slightly different way, or we learn something new, or it's just that it adapts to the new context. I don't know. I mean, I'm not an expert on this topic.",
      "id": "ep_38_ut_176"
    },
    {
      "end": 3408460,
      "speaker": "Manuel Lima",
      "start": 3311532,
      "text": "That's a super valid. That's a super valid point. And I think that's also the value of looking at history, which is something that, as you guys probably can tell by now I'm a strong advocate of history because it allows us to really understand this cyclical nature, these cyclical patterns of many disparate fields. And visualization is definitely one of those fields that's probably going to suffer from that same cyclical nature of things evolving. It's almost like when you join a new company. Well, I guess you guys are slightly independent, but Enrico or Moritz, let's say you would like to join a company tomorrow. If you are involved in any sort of creative job, the first thing you want to know is, okay, so what have you guys done in the past and what was well received? If it was abandoned, why was it abandoned? You want to have as much knowledge as possible so that when you try and propose something else, something new, it doesn't repeat the mistakes from the past. And I think that's the value of looking at history. That's why societies, in many societies, the elders are held to such a high standard because they have that increasing sort of knowledge of past mistakes, and that's the only way we can evolve them because we have that sort of collective memory. We are actually the only species that have this collective memory that, you know, that can adapt and change generation after generation. So for me, that's really the value of history that provides us that meaningful understanding of the cyclical nature of things. And our subjects change and happen throughout a lot of these very intrinsic patterns.",
      "id": "ep_38_ut_177"
    },
    {
      "end": 3446950,
      "speaker": "Moritz Stefaner",
      "start": 3409240,
      "text": "Yeah. And I mean, some things in culture and tradition are the way they are because they're universal principles and they just make sense. Right. So maybe the trees are a good example there, and other things are just like that because there's, I don't know, there's certain technological limitations at a given time, or there's just. Yeah, stuff has happened and it's been repeated, but it doesn't have to be that way. And so these things, you can, like, start to question and sort of innovate on these. So I'm not. So I think there's lots of space for innovation, even if we all play the same songs all over.",
      "id": "ep_38_ut_178"
    },
    {
      "end": 3452562,
      "speaker": "Manuel Lima",
      "start": 3448290,
      "text": "I agree. I agree. I would definitely like to hope so. Yeah, I definitely agree. That's the case.",
      "id": "ep_38_ut_179"
    },
    {
      "end": 3458560,
      "speaker": "Moritz Stefaner",
      "start": 3452626,
      "text": "Can you tell us what you're doing now? Like, you're working as a user experienced designer mostly, is that right?",
      "id": "ep_38_ut_180"
    },
    {
      "end": 3508270,
      "speaker": "Manuel Lima",
      "start": 3458940,
      "text": "That's right. Well, yeah, that's my nine to five. Well, nine to seven job at code Academy. Yeah. So I'm leading a small team of product designers, or UX designers, trying to grow the team, hire more designers, and really change and affect the product in a positive way. We actually just launched a massive redesign of the products from a branding standpoint, but also like a massive redesign of the interface, the website and so on. So it's a really, really interesting challenge because you have a chance for great impact and it's very direct. You don't have all the layers of decision making and sort of bureaucracy that you have in other places. So the impact is straight.",
      "id": "ep_38_ut_181"
    },
    {
      "end": 3513330,
      "speaker": "Moritz Stefaner",
      "start": 3508350,
      "text": "Yeah. If you change something on the website, people will complain or like it or not.",
      "id": "ep_38_ut_182"
    },
    {
      "end": 3558404,
      "speaker": "Manuel Lima",
      "start": 3513870,
      "text": "Exactly, exactly. It's so fast. I think that's one of the things that. But it's really this idea when we talk about creativity and technology and look upon the future, I think startups are so interesting phenomenons because they allow us to try and fail really fast. Try, fail, learn from that mistake and then repeat it and change it. Change one small component every time. That's the best way to learn, that's the best way to evolve. Large companies don't have that luxury. That's why they are so slow to adapt. That's why they're so sort of, you know, big, small, sort of big slow elephants, which makes it really harder to compete with all those, you know, new startups.",
      "id": "ep_38_ut_183"
    },
    {
      "end": 3577010,
      "speaker": "Moritz Stefaner",
      "start": 3558532,
      "text": "Right, right. And so, yeah, how does your, like, your experiences from the visualization things and visual complexity, how does it influence your job? Is that more like the one thing is, is play and the other one is work or between these worlds? Like, how does it work together?",
      "id": "ep_38_ut_184"
    },
    {
      "end": 3666670,
      "speaker": "Manuel Lima",
      "start": 3577350,
      "text": "Yeah, they've always been separate and I never intentionally sort of, I never intentionally try to merge them. Maybe there's that aspect of, you know, if you start having lobster every single day, you might get sick of it. So there is that element of, there is that element of like, you know, leaving something that you really like as a hobby, you know, that you do on the side of, because that's where your passion is coming from. That's your free, private moment that you have to yourself. So there's something really interesting about that. But at the same time, I have to say, and you probably know this pretty well, Moritz, because I think your background is actually interaction design. There's a lot of overlaps between visualization, data visualization and interaction design and UX design. I think a lot of the UX principles that we have, universal principles of design like flexibility versus usability, trade off things like progressive disclosure, things like x law, the principle of chunking, I don't know, signal to noise ratio, the 80 20 rule. Yeah. All those universal principles are equally relevant on interaction design and UX design as they are for information visualization. So I think from sort of a knowledge point of view that knowledge is shareable between the disciplines. It's only the practice that might change a little bit, but you're driven by very similar sort of, again, goals and principles in many different ways.",
      "id": "ep_38_ut_185"
    },
    {
      "end": 3680990,
      "speaker": "Moritz Stefaner",
      "start": 3667530,
      "text": "Yeah. And I'd actually like to see more influx from the UX world into information visualization. I mean, I myself, always a bit defensive there. So whenever I meet a user experience designer, I'm always like, yeah, you know, database, it works a bit different, you know?",
      "id": "ep_38_ut_186"
    },
    {
      "end": 3681678,
      "speaker": "Manuel Lima",
      "start": 3681010,
      "text": "No, it's not.",
      "id": "ep_38_ut_187"
    },
    {
      "end": 3697182,
      "speaker": "Moritz Stefaner",
      "start": 3681814,
      "text": "You can't do it the same way. But as you say, a lot of stuff is overlapping. You know, it's just like, we like to be these special ponies, but, I mean, 90% is universal design principles, right. And.",
      "id": "ep_38_ut_188"
    },
    {
      "end": 3697846,
      "speaker": "Manuel Lima",
      "start": 3697326,
      "text": "Absolutely.",
      "id": "ep_38_ut_189"
    },
    {
      "end": 3703170,
      "speaker": "Moritz Stefaner",
      "start": 3697878,
      "text": "So I'd like to see more, more influence from the user experience people in the infamous world, actually.",
      "id": "ep_38_ut_190"
    },
    {
      "end": 3716674,
      "speaker": "Manuel Lima",
      "start": 3703630,
      "text": "I agree. I agree. I think there's a huge overlap there that we should capitalize upon. I think, you know, even the audience that you have, there's noise in the background. It's okay, man.",
      "id": "ep_38_ut_191"
    },
    {
      "end": 3718990,
      "speaker": "Moritz Stefaner",
      "start": 3716722,
      "text": "Yeah, yeah, yeah, I'm visiting.",
      "id": "ep_38_ut_192"
    },
    {
      "end": 3749184,
      "speaker": "Manuel Lima",
      "start": 3721850,
      "text": "Yeah. But even the audience, like, the, one of the things that I like about visualization, you guys probably feel the same is the diversity of backgrounds that you have in this community. Right. And the UX somehow feels a little bit like that as well. Probably not as diverse. I would say maybe as visualization, but still, you tend to have people from psychology, cognitive science, from computer science. So there's quite a diversity there as well, which I think is important to any discipline.",
      "id": "ep_38_ut_193"
    },
    {
      "end": 3760848,
      "speaker": "Enrico Bertini",
      "start": 3749352,
      "text": "Yeah. I personally believe that there is so much more to do in terms of interaction design there because most visualizations out there, they are not very interactive anyway. Right?",
      "id": "ep_38_ut_194"
    },
    {
      "end": 3761272,
      "speaker": "Manuel Lima",
      "start": 3760984,
      "text": "Yeah.",
      "id": "ep_38_ut_195"
    },
    {
      "end": 3770920,
      "speaker": "Moritz Stefaner",
      "start": 3761296,
      "text": "Or use really obscure interaction techniques without even explaining them, like something you wouldn't get away with as a UI UX designer. Everybody would be like, what the fuck is going on here?",
      "id": "ep_38_ut_196"
    },
    {
      "end": 3773292,
      "speaker": "Manuel Lima",
      "start": 3772940,
      "text": "Yeah.",
      "id": "ep_38_ut_197"
    },
    {
      "end": 3785740,
      "speaker": "Enrico Bertini",
      "start": 3773316,
      "text": "But my guess is that as visualization turns more and more interactive, then we will find ourselves adopting more of these rules that have been there for ages from interaction design. Right?",
      "id": "ep_38_ut_198"
    },
    {
      "end": 3803944,
      "speaker": "Manuel Lima",
      "start": 3785900,
      "text": "Yes. Well, yeah, I certainly hope so. And I think I talk about this all the time, and I think, you know, you know, in a given class, you know, I might say to my students, hey, interaction is key, but it doesn't solve everything. You know, you cannot just rely on interaction to, like, you know, just interact.",
      "id": "ep_38_ut_199"
    },
    {
      "end": 3805128,
      "speaker": "Enrico Bertini",
      "start": 3803992,
      "text": "Can actually be a correction.",
      "id": "ep_38_ut_200"
    },
    {
      "end": 3867296,
      "speaker": "Manuel Lima",
      "start": 3805184,
      "text": "Right, yeah, exactly. That's why I actually remember, like, bringing to one of my classes, I decided to intentionally bring Giorgia Lupi as you guys both know, to the class, to show that, you know, you can achieve great work and provide a great level of insight without one single interactive element on the screen, in this case, on paper. So I think it's, you know, interaction can also be. Can be somehow demystified in a way which. Cause it's not. It's not the solution that solves all our problems. But still, there's issues, and complex networks is one of them, that if you don't embrace some level of interactivity, it becomes really, really hard to do any sort of meaningful visualization of a given network, especially a really large one. So I think it's. Yeah, but like you're saying, Enrico, I think we can learn a lot from those, you know, from cognitive science, from interaction design, from UX design. A lot, because we are actually share a lot of interesting principles, universal design principles that are equally benefit for all the disciplines.",
      "id": "ep_38_ut_201"
    },
    {
      "end": 3877516,
      "speaker": "Enrico Bertini",
      "start": 3867448,
      "text": "Yeah. And I think as we start, as you said before, as we start moving our visualization to different devices and environments, that's going to be a key component there, right?",
      "id": "ep_38_ut_202"
    },
    {
      "end": 3887160,
      "speaker": "Manuel Lima",
      "start": 3877708,
      "text": "Absolutely, absolutely. Yeah. And traction, then it's going to become the norm, right. A de facto sort of way of exploring data and information, for sure.",
      "id": "ep_38_ut_203"
    },
    {
      "end": 3899726,
      "speaker": "Enrico Bertini",
      "start": 3888500,
      "text": "So, should we wrap it up? We've been talking for, wow, more than 1 hour now. I don't know, Moritz, you have other questions that you want to ask to Manuel?",
      "id": "ep_38_ut_204"
    },
    {
      "end": 3906350,
      "speaker": "Moritz Stefaner",
      "start": 3899828,
      "text": "Oh, no, not really. It's super, super interesting. I loved the time trip. It took me down to memory lane myself.",
      "id": "ep_38_ut_205"
    },
    {
      "end": 3908042,
      "speaker": "Manuel Lima",
      "start": 3907210,
      "text": "That's good.",
      "id": "ep_38_ut_206"
    },
    {
      "end": 3937990,
      "speaker": "Moritz Stefaner",
      "start": 3908146,
      "text": "We didn't mention the manifesto, so if you haven't read the manifesto post, we'll link it. It's really good. And it's fun because it's five years old. And I think a lot of the discussion around that manifesto still resonates, and it's still, like, largely unresolved. And I think it's. That was really an interesting point. So we'll link that one, and you can send us comments. Or maybe we have to do a follow up with Manuel on the manifesto.",
      "id": "ep_38_ut_207"
    },
    {
      "end": 3943234,
      "speaker": "Manuel Lima",
      "start": 3940210,
      "text": "Especially on aesthetics. I think that was the most contentious issue.",
      "id": "ep_38_ut_208"
    },
    {
      "end": 3947002,
      "speaker": "Moritz Stefaner",
      "start": 3943322,
      "text": "How far can you go? And form follows function or form follows data.",
      "id": "ep_38_ut_209"
    },
    {
      "end": 3951074,
      "speaker": "Manuel Lima",
      "start": 3947106,
      "text": "Oh, yeah, that was the genesis of the whole conversation.",
      "id": "ep_38_ut_210"
    },
    {
      "end": 3953590,
      "speaker": "Moritz Stefaner",
      "start": 3951202,
      "text": "Yeah. Horrible. Horrible.",
      "id": "ep_38_ut_211"
    },
    {
      "end": 3977490,
      "speaker": "Manuel Lima",
      "start": 3953750,
      "text": "In that sense. I can leave you guys with, like, one of my favorite quotes when it comes to aesthetics, which is this dutch designer, Wim Crouwel, that said, I'm a functionalist troubled by aesthetics, and I think that's very much how I feel. I feel exactly like this, like him. Right? I'm a functionalist but always constantly troubled. Tormented by aesthetics.",
      "id": "ep_38_ut_212"
    },
    {
      "end": 3996368,
      "speaker": "Enrico Bertini",
      "start": 3980000,
      "text": "Yeah, yeah. But I think that manifesto was. Was great. So before starting the episode, we had a little chat, and I. And I said, Manuel, didn't you write this kind of information visualization manifesto so many years ago? Right. And then we checked, and it was 2009. Right?",
      "id": "ep_38_ut_213"
    },
    {
      "end": 3996720,
      "speaker": "Moritz Stefaner",
      "start": 3996464,
      "text": "Right.",
      "id": "ep_38_ut_214"
    },
    {
      "end": 3996976,
      "speaker": "Manuel Lima",
      "start": 3996760,
      "text": "Wow.",
      "id": "ep_38_ut_215"
    },
    {
      "end": 4002768,
      "speaker": "Moritz Stefaner",
      "start": 3997008,
      "text": "Yeah. And if you read, nobody writes manifestos anymore. Everybody's like, whatever, you know?",
      "id": "ep_38_ut_216"
    },
    {
      "end": 4007034,
      "speaker": "Enrico Bertini",
      "start": 4002944,
      "text": "I mean, just the idea itself of writing one was great. Right?",
      "id": "ep_38_ut_217"
    },
    {
      "end": 4007870,
      "speaker": "Manuel Lima",
      "start": 4007162,
      "text": "Yeah.",
      "id": "ep_38_ut_218"
    },
    {
      "end": 4012394,
      "speaker": "Enrico Bertini",
      "start": 4008730,
      "text": "At that time, I was so much influenced by that. That was great.",
      "id": "ep_38_ut_219"
    },
    {
      "end": 4014698,
      "speaker": "Manuel Lima",
      "start": 4012562,
      "text": "Yeah. Thanks, man. Yeah.",
      "id": "ep_38_ut_220"
    },
    {
      "end": 4034580,
      "speaker": "Enrico Bertini",
      "start": 4014794,
      "text": "Some of it sounds still so. I mean, so important. I actually like every single point you wrote, it's still very relevant. Start with a question. Interactivity is key. Cite your source. The power of narrative, man. You wrote these things in 2009. It's still so important.",
      "id": "ep_38_ut_221"
    },
    {
      "end": 4036136,
      "speaker": "Manuel Lima",
      "start": 4035400,
      "text": "No, thank you.",
      "id": "ep_38_ut_222"
    },
    {
      "end": 4038832,
      "speaker": "Moritz Stefaner",
      "start": 4036168,
      "text": "Good stuff. And so is there a third book coming up?",
      "id": "ep_38_ut_223"
    },
    {
      "end": 4040768,
      "speaker": "Enrico Bertini",
      "start": 4038896,
      "text": "Yeah, I was going to ask the same.",
      "id": "ep_38_ut_224"
    },
    {
      "end": 4041856,
      "speaker": "Manuel Lima",
      "start": 4040944,
      "text": "I mean, two books.",
      "id": "ep_38_ut_225"
    },
    {
      "end": 4044480,
      "speaker": "Moritz Stefaner",
      "start": 4041888,
      "text": "That sounds like a bit imbalanced, right? Two books.",
      "id": "ep_38_ut_226"
    },
    {
      "end": 4077830,
      "speaker": "Manuel Lima",
      "start": 4044520,
      "text": "Yeah. Let's put it this way. I need a break, but I definitely have ideas about the third book. But it's too early to say. But I'm probably gonna take a break and just, like, get some. Some time to spend to enjoy life a little bit, because this is, like, you know, putting a book together. It's, like, really one of the most time consuming things you can do in your life. So as much as I like it, it's still very exhausting. So I definitely have ideas for a third one, but it's probably going to be on the back burner for a bit. For a bit of time.",
      "id": "ep_38_ut_227"
    },
    {
      "end": 4081370,
      "speaker": "Moritz Stefaner",
      "start": 4077870,
      "text": "First, do the week of celebrations in 2015 for OVC.",
      "id": "ep_38_ut_228"
    },
    {
      "end": 4082334,
      "speaker": "Manuel Lima",
      "start": 4081710,
      "text": "Exactly.",
      "id": "ep_38_ut_229"
    },
    {
      "end": 4084470,
      "speaker": "Moritz Stefaner",
      "start": 4082382,
      "text": "And then you can start your book later on.",
      "id": "ep_38_ut_230"
    },
    {
      "end": 4086610,
      "speaker": "Manuel Lima",
      "start": 4085210,
      "text": "Exactly. Exactly.",
      "id": "ep_38_ut_231"
    },
    {
      "end": 4091818,
      "speaker": "Enrico Bertini",
      "start": 4086690,
      "text": "Start guessing, Moritz. It's gonna be what? The book of sets.",
      "id": "ep_38_ut_232"
    },
    {
      "end": 4092978,
      "speaker": "Manuel Lima",
      "start": 4091914,
      "text": "The book of.",
      "id": "ep_38_ut_233"
    },
    {
      "end": 4096858,
      "speaker": "Moritz Stefaner",
      "start": 4093154,
      "text": "It's an interesting question. Yeah, sets are a good topic, actually.",
      "id": "ep_38_ut_234"
    },
    {
      "end": 4100698,
      "speaker": "Enrico Bertini",
      "start": 4097034,
      "text": "Well, you can focus on so many things. Timelines, book of time.",
      "id": "ep_38_ut_235"
    },
    {
      "end": 4103162,
      "speaker": "Manuel Lima",
      "start": 4100834,
      "text": "Oh, that. There's been a book about cartographies of.",
      "id": "ep_38_ut_236"
    },
    {
      "end": 4106498,
      "speaker": "Moritz Stefaner",
      "start": 4103186,
      "text": "Time, which is already.",
      "id": "ep_38_ut_237"
    },
    {
      "end": 4107354,
      "speaker": "Enrico Bertini",
      "start": 4106634,
      "text": "Yeah.",
      "id": "ep_38_ut_238"
    },
    {
      "end": 4109604,
      "speaker": "Manuel Lima",
      "start": 4107522,
      "text": "Yeah. It's a really good one.",
      "id": "ep_38_ut_239"
    },
    {
      "end": 4111660,
      "speaker": "Enrico Bertini",
      "start": 4109762,
      "text": "Yeah, I'm looking forward to it.",
      "id": "ep_38_ut_240"
    },
    {
      "end": 4113424,
      "speaker": "Manuel Lima",
      "start": 4112800,
      "text": "All right.",
      "id": "ep_38_ut_241"
    },
    {
      "end": 4114864,
      "speaker": "Moritz Stefaner",
      "start": 4113512,
      "text": "Yeah, let us know.",
      "id": "ep_38_ut_242"
    },
    {
      "end": 4118220,
      "speaker": "Manuel Lima",
      "start": 4114992,
      "text": "Yeah, of course. Of course. I will keep you guys posted for sure.",
      "id": "ep_38_ut_243"
    },
    {
      "end": 4122260,
      "speaker": "Moritz Stefaner",
      "start": 4118960,
      "text": "And thanks so much for being on show. It's been fantastic.",
      "id": "ep_38_ut_244"
    },
    {
      "end": 4126424,
      "speaker": "Manuel Lima",
      "start": 4123240,
      "text": "Thanks so much, guys. Thanks for everything. Yeah, thanks a lot.",
      "id": "ep_38_ut_245"
    },
    {
      "end": 4127592,
      "speaker": "Moritz Stefaner",
      "start": 4126472,
      "text": "Thank you, Manuel. Bye bye.",
      "id": "ep_38_ut_246"
    },
    {
      "end": 4127800,
      "speaker": "Enrico Bertini",
      "start": 4127616,
      "text": "Thanks.",
      "id": "ep_38_ut_247"
    },
    {
      "end": 4128200,
      "speaker": "Manuel Lima",
      "start": 4127840,
      "text": "Thank you.",
      "id": "ep_38_ut_248"
    },
    {
      "end": 4129208,
      "speaker": "Enrico Bertini",
      "start": 4128240,
      "text": "Bye bye.",
      "id": "ep_38_ut_249"
    },
    {
      "end": 4130400,
      "speaker": "Manuel Lima",
      "start": 4129384,
      "text": "Thanks. Bye bye, guys.",
      "id": "ep_38_ut_250"
    }
  ],
  "confidence": 0.918076241880336,
  "audio_duration": 4138,
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_status_code": null,
  "webhook_auth": false,
  "webhook_auth_header_name": null,
  "speed_boost": false,
  "auto_highlights_result": null,
  "auto_highlights": false,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_audio_quality": null,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "content_safety": false,
  "iab_categories": true,
  "content_safety_labels": {
    "status": "unavailable",
    "results": [],
    "summary": {}
  },
  "language_detection": false,
  "language_detection_threshold": null,
  "language_confidence": null,
  "custom_spelling": null,
  "throttled": false,
  "auto_chapters": true,
  "summarization": false,
  "summary_type": null,
  "summary_model": null,
  "custom_topics": false,
  "topics": [],
  "speech_threshold": null,
  "speech_model": "best",
  "chapters": [
    {
      "summary": "Moritz: How is Italy doing? Moritz: This will never end for Germans. I can understand why you can support the us team now. Let's hope the Mecca pass this round tonight.",
      "gist": "Germany vs Italy",
      "headline": "Moritz: How is Italy doing at the World cup right now",
      "start": 17160,
      "end": 91430,
      "id": "ep_38_ch_0"
    },
    {
      "summary": "We have a special guest today, Emmanuel Lima, on the show. Finally. After we've been chasing you for months. Decades. Months. Why not? It's the eternal fight.",
      "gist": "Emmanuel Lima On The Show",
      "headline": "We have a special guest today, Emmanuel Lima on the show",
      "start": 94690,
      "end": 126010,
      "id": "ep_38_ch_1"
    },
    {
      "summary": "Manuel Lima is a designer by trades. He also teaches about design and visualization. Lima works for a startup in New York City called Code Academy. He says it's hard to explain exactly what he does.",
      "gist": "How to Introduce Yourself",
      "headline": "We ask guests to introduce themselves just in case somebody doesn't know",
      "start": 126550,
      "end": 171122,
      "id": "ep_38_ch_2"
    },
    {
      "summary": "How does he do it all? A lot of coffee. No, it was yerba mate. Do you try? Did you try that? Did I try what?",
      "gist": "How Does He Do It All?",
      "headline": "How does he do it all? A lot of coffee",
      "start": 171306,
      "end": 206298,
      "id": "ep_38_ch_3"
    },
    {
      "summary": "Manuel: Maybe next year, like the ten year celebration of visual complexity. Is it going to be in a rooftop? It better be, right? It depends on the roof. I come only if it's a rooftop.",
      "gist": "Visual complexity's 10th anniversary",
      "headline": "Manuel has been working on visual complexity since 2000",
      "start": 206394,
      "end": 298952,
      "id": "ep_38_ch_4"
    },
    {
      "summary": "I fell in love with data visualization during that program at Parsons School of design. I wanted to explore the value and benefits of data visualization. Blogviz mapping the patterns of diffusion across blogspace was born. I've decided to open it up to the public.",
      "gist": "Your Ph.D. in Networks and the Design Process",
      "headline": "Your thesis was about how stories spread on the web",
      "start": 298976,
      "end": 678950,
      "id": "ep_38_ch_5"
    },
    {
      "summary": "How did visual complexity evolve since when you started? Over time, I just added more categories, more metadata to all the projects. It hasn't been updated very frequently since over. There's a variety of ideas and things I want to expand upon, but time is always an issue.",
      "gist": "How VISCUE has evolved over the years",
      "headline": "How did visual complexity evolve since when you started",
      "start": 680810,
      "end": 1115430,
      "id": "ep_38_ch_6"
    },
    {
      "summary": "When you started, you already focused on exclusively networks, on visual complexity. Networks tend to be the most complex one, the most harder to sort of decipher. The complex ones are the ones that makes you sort of engaged and passionate.",
      "gist": "What Initially Motivated You to Study Networks?",
      "headline": "When you started, you focused on exclusively networks, on visual complexity",
      "start": 1115730,
      "end": 1209030,
      "id": "ep_38_ch_7"
    },
    {
      "summary": "Did you know there's a German author who published a book called visual simplexity? I think there was even a blog. It's an open invitation for a fight, obviously. Maybe it's going to be the ten year anniversary.",
      "gist": "A Random Thought on Visual Simplicity",
      "headline": "There's a German author who published a book called visual simplexity",
      "start": 1209700,
      "end": 1242400,
      "id": "ep_38_ch_8"
    },
    {
      "summary": "Manuel: The motivation was the realization that a lot of these interesting cultural artifacts were being gone forever. The benefit of a book still in a printed format is that it can probably outlast by, by far any website that we create nowadays. It was an opportunity to reflect on the role of networks.",
      "gist": "The book about networks: A cultural artifact",
      "headline": "Enrico: How did you transition from website to book",
      "start": 1243980,
      "end": 1524702,
      "id": "ep_38_ch_9"
    },
    {
      "summary": "Six months. I decided to leave my job, my current well paid, very comfortable job at Nokia and dedicate myself for six months writing the book. It was a really hard time, as my wife can attest to. But for the second book now, it was a lot easier.",
      "gist": "How To Write a Novel",
      "headline": "How long did it take you to write your first book",
      "start": 1524806,
      "end": 1689196,
      "id": "ep_38_ch_10"
    },
    {
      "summary": "The book is all about the paradigm shift between trees and networks. For centuries, even millennia, we have used the tree metaphor as a way of visualizing and explaining the world around us. I think this book somehow contributed to that discussion and made people reflect more on the importance of visualization.",
      "gist": "The Hard Work of Visual Complexity",
      "headline": "Your first book was about trees and networks. It was well received",
      "start": 1689388,
      "end": 1943466,
      "id": "ep_38_ch_11"
    },
    {
      "summary": "The Book of Trees is a new book about visualization. Author says he wanted to tell the untold story of the visualization of the world. He says many artists are influenced by the visualization work of scientists and designers. The book aims to tell this story in a pluralistic, universal way.",
      "gist": "The Book of Trees: Visual Complexity",
      "headline": "The Book of Trees explores the appeal of network visualization on a human level",
      "start": 1943538,
      "end": 2540520,
      "id": "ep_38_ch_12"
    },
    {
      "summary": "Moritz: How did you find all these old graphic. How do you do that? Moritz: The Internet is providing this sort of new platform. A lot of critical institutions are finally opening up their archives and putting all this material online. Moritz: Did you ever think about having exhibitions.",
      "gist": "How did you find all these old trees?",
      "headline": "A lot of critical institutions are finally opening up their archives for research",
      "start": 2541700,
      "end": 2826790,
      "id": "ep_38_ch_13"
    },
    {
      "summary": "Manuel: Visual complexity started almost ten years ago. Do you think that everything has changed since then? And how do you see this developing in the future? Manuel: A lot of things have changed. exploring large platforms that we can explore information in a much deeper, immersive way.",
      "gist": "Visual complexity 10 years on",
      "headline": "Manuel: Visual complexity started almost ten years ago",
      "start": 2827170,
      "end": 3120720,
      "id": "ep_38_ch_14"
    },
    {
      "summary": "Many of the metaphors we consider to be new, created very recently are actually quite old. The idea of a tree map is much older. The next challenge for us is to get away of this cyclicality of reusing the same metaphors.",
      "gist": "The New Visual Metaphors",
      "headline": "Many of the metaphors we consider to be new are actually quite old",
      "start": 3121180,
      "end": 3313420,
      "id": "ep_38_ch_15"
    },
    {
      "summary": " visualization is definitely one of those fields that's probably going to suffer from that same cyclical nature of things evolving. And I think that's also the value of looking at history. There's lots of space for innovation, even if we all play the same songs all over.",
      "gist": "The cyclical nature of history",
      "headline": "History allows us to understand cyclical patterns of many disparate fields",
      "start": 3313460,
      "end": 3452562,
      "id": "ep_38_ch_16"
    },
    {
      "summary": "I'm leading a small team of product designers, or UX designers, at code Academy. We just launched a massive redesign of the products. It's a really, really interesting challenge because you have a chance for great impact. I think startups are so interesting because they allow us to try and fail really fast.",
      "gist": "What Do You Do As a Product Designer at a Startup?",
      "headline": "Code Academy is where you work as a user experienced designer mostly",
      "start": 3452626,
      "end": 3559440,
      "id": "ep_38_ch_17"
    },
    {
      "summary": "There's a lot of overlaps between visualization, data visualization and interaction design and UX design. I'd like to see more influx from the UX world into information visualization. I think there's a huge overlap there that we should capitalize upon.",
      "gist": "How to merge visualization and UX Design",
      "headline": "There are a lot of overlaps between visualization, data visualization and interaction design",
      "start": 3560220,
      "end": 3887160,
      "id": "ep_38_ch_18"
    },
    {
      "summary": "Manuel: I think a lot of the discussion around that manifesto still resonates. Especially on aesthetics. Interactivity is key. The power of narrative, man. You wrote these things in 2009. It's still so important.",
      "gist": "Manuel's Information visualization Manifesto",
      "headline": "Manuel wrote an information visualization manifesto five years ago",
      "start": 3888500,
      "end": 4036696,
      "id": "ep_38_ch_19"
    },
    {
      "summary": "And so is there a third book coming up? Yeah, I was going to ask the same. I definitely have ideas for a third one, but it's probably going to be on the back burner for a bit. I will keep you guys posted for sure.",
      "gist": "Bookmark",
      "headline": "Is there a third book coming up? Moritz says he has ideas",
      "start": 4036768,
      "end": 4130400,
      "id": "ep_38_ch_20"
    }
  ],
  "disfluencies": false,
  "entity_detection": false,
  "sentiment_analysis": false,
  "sentiment_analysis_results": null,
  "entities": null,
  "speakers_expected": null,
  "summary": null,
  "custom_topics_results": null,
  "is_deleted": null,
  "episode_num": "38",
  "episode_metadata": {
    "speakers": [
      "Enrico Bertini",
      "Moritz Stefaner",
      "Manuel Lima"
    ],
    "WPid": "195",
    "url": "https://datastori.es/podlove/file/427/s/feed/c/mp3/datastories-38.mp3",
    "episode_title": "Visual Complexity w/ Manuel Lima"
  }
}