{
  "id": "e6b5babf-48ef-4b75-b6ea-a5d43be11cd1",
  "language_model": "assemblyai_default",
  "acoustic_model": "assemblyai_default",
  "language_code": "en_us",
  "status": "completed",
  "audio_url": "https://datastori.es/podlove/file/6292/s/feed/c/mp3/152-year-in-review.mp3",
  "utterances": [
    {
      "end": 16370,
      "speaker": "Various",
      "start": 160,
      "text": "The big challenge for visualization designers and for everyone working with data is to recognize how our own decisions to depict neutrality are just that, they're just decisions. And since we're already making decisions, the challenge is to ask how we might make different decisions that could help work towards justice.",
      "id": "ep_152_ut_0"
    },
    {
      "end": 217430,
      "speaker": "B",
      "start": 36210,
      "text": "Hi, everyone. Welcome to a new episode of Data Stories. My name is Enrico Bertini, and I am a professor at NYU in New York City, where I teach and do research in data visualization. That's right, and I'm Moritz Stefaner, and I'm an independent designer of data visualizations. In fact, I work as a self employed truth and beauty operator out of my office here in the countryside in the beautiful north of Germany. Yes, and on this podcast, we talk about data visualization, analysis, and more generally the role data plays in our lives. And usually we do that together with a guest we invite on the show. Except this time, that's a special episode for the end of the year. That's true. So we don't have a guest, but a couple of guests, and you'll hear from all of them later on. But before we start, just a quick note. Our podcast is listener supported, so there are no ads. But that also means if you do enjoy the show, please consider supporting us. It's the end of the year. It's a good time to give. You can do that with other recurring payments on patreon.com Datastories, or you can send us one time donations. It's like a little present almost on PayPal me Datastories. Yes. We have to create a virtual Christmas tree. That would be something. So what I was saying is that it's not the usual episode, it's the end of the year episode. And if you are an old timer of this show, you know that at the end of the year we always do something different. And for this year, what we did was to ask a number of professionals around the world to comment on specific areas of development of data visualization. So what we're going to do is to play the recordings that these great people sent to us about the major developments in a given area in data visualization. Yeah. And we asked them for three trends in this specific area and what they found noteworthy in the year, but also one central challenge. And that was super fun to compare what everybody talked about. Some things popped up in every second statement almost. You'll see when you listen to all of them. And we just love to have all this variety of people represented in the past. Sometimes we did like smaller year end rounds with a couple of guests, and then we did the around the world episodes. But this time we have, I think, ten or twelve people, and we just love to bring a variety of perspectives on the show. Yeah, without further ado, I think we can just bring on our first guest. Basically, it's a bit like a mailbox message. You'll hear. And first up is Alberto Cairo, who some of you might be familiar with. He's been a guest of the show a few times. He's written numerous books on data visualization, most lately how charts lie, and we asked him to comment on the topic of developments in data literacy and visualization education.",
      "id": "ep_152_ut_1"
    },
    {
      "end": 750330,
      "speaker": "C",
      "start": 217850,
      "text": "Hi Enrico. Hi Moritz. Thank you so much for inviting me to talk a little bit about new developments in visualization literacy and education. My name is Alberto Cairo. I teach at the University of Miami. I teach data visualization and information design. I've been a journalist for many years, working in news organizations in Brazil and in Spain and in the United States. And I'm also the author of several books. The latest one is titled how chats Lie. So anyway, so new developments in literacy. I think that 2019 has been a very exciting year for many different reasons. There have been new books, new tools, new publications being launched, and new educational initiatives, and I fear that I would not be able to cover all of them. So I apologize in advance if I forget I anyone who has done anything significant in these areas. It is difficult to keep up with all the new things in the world of visualization these days. But I will do my best. First of all, publications, the first one that I would like to talk about is Nightingale from the data Visualization Society. If I'm not wrong, Nightingale was launched in the middle of the year, and what they do, it's a publication that appeared on medium. It's easy to find on medium, and they publish articles every single week by different authors. And I think that is a great initiative because it shows the scope and also the depth of the different fields that use visualization on a regular basis. I follow them very, very closely and I try to read every single article that they publish. And the quality level in general is, on average is quite great. I think that it really contributes to the democratization of data visualization, which, as you know, is one of the aims. One of the main aims of my career is precisely to make visualization more visible and more accepted and more widely adopted by the general public. Another online publication that I would like to highlight, although I don't remember if it was launched in 2019, but I'm going to mention it anyway, it's also on medium, and it's called multiple views visualization research explained, and several friends of the podcast are involved in this initiative. So if you visit it, you will see names such as Robert Kosara, Jessica Hullman, Matt Kay, etcetera, multiple views. What it does, I think that is wonderful. What they do is to essentially take research that originates in academia, in departments of computer science, data science, statistics, etcetera, related to data visualization, and they try to translate that research. They try to explain what those papers, those posters, etcetera, what they mean and how what they say can be applied to the practice, to the daily practice of visualization. So I would encourage people to take a look at it if they can. We should also mention tools, new developments, new libraries, new programming languages, etcetera. I could spend the entire time that you gave me talking about these, but I think that I would just focus on new developments in point and click tools, such as, for example, I don't know. Tableau, for example, now allows you to do animation within the tool, which is kind of interesting. I have not tried that out, but apparently I've seen some examples and it looks really great. And then freemium tools such as data wrapper or flourish, they have incorporated new abilities and they have made a lot of progress. And then open source tools, for example, row graphs. Row graphs, originally created by the density design lab in Italy at Politecnico de Milano. They launched a crowd sourcing campaign recently, and they reached their goal. They wanted to get around €30,000, if I'm not wrong, and the last time that I checked, they already got €35,000, which is more than they needed. And apparently they are going to use this money to greatly improve the tool. You can still contribute to this crowdsourcing campaign, by the way. So if you have ever used a raw graphs in your daily practice, and I know that many people have done that, you know, I would consider giving them, you know, $10, $20, $5, whatever you can afford. I contributed myself just because I use rugrats in my classes and I teach the tool to my students, and so I feel that I shouldn't take advantage of the tool without giving back a little bit. Right? I could also mention new books. There have been tons of new books being published in 2019. There is the second edition of Andy Kirk's book, for example. But I would also like to emphasize books that I believe contribute to this goal of popularizing and democratizing data visualization, books that can be read not only by specialists in data visualization, but by anybody who wants to enter the field. So the most recent one that I have seen is Ben Jones's avoiding data pitfalls. I think that it's a great introduction to the main mistakes that we may make whenever we analyze or we visualize the data. It's a fun book to read, and it is also a very. It's a very warm book, a very personal one, because Ben is great at highlighting the mistakes that he has made. He's very good at recognizing those mistakes and learning from them. So the book reads as sort of like a personal story. And I think that that is wonderful. I think that we need more personal stories in data visualization books that feel, again, more humane in one way, or, you know, closer to the daily practices of people, rather than being sort of like, you know, general introduction to data visualization principles. I like to see the person who's writing the book, and I think that Ben's book is great at that. You can really hear Ben describing mistakes that he has made throughout his career. I could also mention Stephanie Evergreens a data visualization sketchbook and called Nurse Bombers storytelling with data. Let's practice these two books basically focus on the practical side of things. So they encourage you to draw graphics and to learn from that, from that drawing. If you have read Stefani's or Cole's previous books, I would encourage you to take a look at these as well, because they work really well as complements to their original books. I would also mention my own how shots lie, which is an introduction to data visualization for the general public. It's not a book for specialists. It's more for general readers. Is more than being a book about how to become a better visualization designer. Is more a book about how to become a better visualization reader, a better reader of charts. So it's a manual. A manual on how to read charts. I would also like to highlight, you know, podcasts. So, not that any new podcast has appeared this year, if I'm not wrong. But, you know, it's always good to acknowledge and recognize and highlight the work of people who publish their podcasts with interviews and comments on a regular basis. So called newsbombers podcasts, Ali Torban's, Jon Schwabish's, Mico Yuk's analytics on fire, or even your own, your own podcast you think that you are publishing. I think that once a month, or even a couple of times a month. So I think that's encouraging, and that is absolutely great. And then my recent MOOC so recently I did a massive open online course called data journalism and visualization with free tools, which is basically an introduction to how to gather data, download data, analyze data, and then visualize data, which was, it was a MOOC hosted by the Knight center at the University of Texas in Austin, and it was sponsored by Google, and more than 12,000 people participated. That doesn't mean that 12,000 people completed the course, but more than 12,000 people signed up for the course and at least took a look at part of its materials. And I think that that really shows that visualization, or so I hope, is becoming mainstream. And it really encourages me to keep working on this task of democratizing it even further and popularizing it even further.",
      "id": "ep_152_ut_2"
    },
    {
      "end": 820004,
      "speaker": "B",
      "start": 751590,
      "text": "Yeah, I think this last point that Alberto covered, the success of courses, of course, this is also very close to my art. And knowing that more than 12,000 people took is MOOC is amazing. There's such a huge interest right now in Dataviz, and this is also reflected by the data visualization Society. So if there is one thing that stands out, it's like Dataviz going big this year. Yeah, that's absolutely true. And it's sort of interesting, all these numbers, like 12,000 people in a moOc. The Datavis society has 10,000 people. We have like 15,000 listeners. So I think there's like a really solid five figures, number of total data nerds out there, which is really cool, and it's just growing. I totally agree. Yeah. Yeah. Which brings us to our next guest, or our next mailbox message, if you will. This one's from Amelia Wattenberger. Amelia is sort of a newcomer in the field. She's a great front end developer, and she's now super excited about data visualization and does great work. And I think she's also a big fan of the data visualization society, but we'll hear from her herself.",
      "id": "ep_152_ut_3"
    },
    {
      "end": 1001030,
      "speaker": "D",
      "start": 820172,
      "text": "Hi, my name is Amelia Wattenberger, and I'm a developer and designer focused on data visualization. 2019 was a fantastic year for Dataviz, and one of the most exciting new developments is a new organization called the Data Visualization Society. And if you're not already a member, I'd highly recommend checking it out. The main way I interact with it is a slack channel, which currently has something like 8000 members, and it's a great resource for things like like asking questions, seeing work from Dataviz professionals of different walks of life, learning about upcoming events, getting feedback on your own work, and connecting with other Dataviz newcomers and maybe even finding people to team up with. Another thing I'm really excited about is especially great for designers. So there's a vector design tool called Figma that's essentially a modern collaborative Adobe illustrator, and they opened up their platform a few months ago to let developers create plugins. So right away I and a few others have created data visualization plugins so a designer can start playing with data in their designs without ever leaving their design tool. And this is huge for designers who want to work with data to instantly see how any dataset looks as a timeline or a scatterplot or a bar chart. And it really cuts down the feedback loop between ideation and seeing how their actual data looks in that format. The last thing I want to mention is a little bit more general. I'm constantly impressed by the sheer number of great tutorials and resources that are available for free online, whether it's a walkthrough of a specific project or a tutorial of a specific technique. So for example, D3 js is the de facto library for creating Dataviz on the web. But it's massive and can be super overwhelming to people who are just starting to learn it. So I created a resource that gives a bird's eye view of the library so people can understand what D3 can be used for, what the different parts are and focus on learning specific parts without getting lost. So while they might not be new, there were tons of fantastic free resources created this year for learning and growing your Dataviz skills. One challenge that I would love to see get more attention is cultivating an awareness of where data comes from. I know a lot of people who aren't necessarily well versed in Dataviz consider data a kind of ground truth, so for example, they'll see a visualization and encode any insights as facts without wondering how the data were collected. So if it were from a survey, they don't think about how those questions were worded, or what biases might be present in a political poll, or even thinking about where the traffic data on Google Maps comes from. So I would love for data visuals to put more emphasis on the source of the data and maybe even detail the ways in which it might be biased or misconstrued instead of, say, just putting a footnote at the bottom of an article.",
      "id": "ep_152_ut_4"
    },
    {
      "end": 1133970,
      "speaker": "B",
      "start": 1001490,
      "text": "Yeah, great points. And for me, it's super interesting to hear from newcomers in the field, like how they perceive now what's going on, and also how they find a start in data visualization. I think it's really encouraging to hear that there's this really, really great community with the data visualization society that helps people get started. There's new tools and also people start out already with a critical perspective straight from the get go, which we had to acquire after our initial optimism in the hard way. And thinking back about the decade, to me it's really, you know, it's 2020, so it's even a decade change, I was really thinking. Yeah. And it's sort of like the rise and the fall of nerd culture or hacker culture, I think. Right. I mean, if you think back ten years ago, how optimistic everybody was and now it's all a bit different, at least more complicated. At least more complicated, yeah. But exciting to see new people like move into the field and kicking ass. Yeah. I just want to say it's also great what she mentioned, that there's so much material out there if you want to learn how to do Dataviz. I mean, there's so much out there and I think. So Amelia didn't actually mention her book, but I want to do it because I really like her book. It's called full Stack D3 and data visualization. It's a different angle from other books, very much more on the technical side of it, but it's a beautiful book with a lot of additional material and code that you can reuse or review. So, yeah, great, great resource. Yeah, definite recommendation. Yeah. So next one is an old friend of data stories. That's Andy Kirk. Andy Hoof. So Andy has been around forever. He's the person behind visualizing data and he's also been teaching data visualization for a long time. He has this workshop that he gives around the world and we asked him to focus explicitly on data tools or data visualization tools. So coming up next, Andy Kirk.",
      "id": "ep_152_ut_5"
    },
    {
      "end": 1414720,
      "speaker": "E",
      "start": 1134430,
      "text": "Hi, Enrico Moritz. This is Andy Kirk offering a reflection on some of the key developments in the area of Dataviz tools during 2019. I think the biggest news this year was probably the acquisition of Tableau software by Salesforce and also the acquisition of Looker by Google. Now I'm sure most listeners are aware of Tableau and its standing in the field, its history, its capabilities. And itll be very interesting to see how this merger, this integration of Tableau into the salesforce technical infrastructure goes, but also how these two different corporate cultures come together, especially given how much reliance and value Tableau has placed on its success through the perhaps exploitation in a positive way of the community of users, the practitioners out there who are constantly sharing new ideas, new techniques, and the way that the vibrancy of Tableau public in particular has helped to showcase its capabilities. Looker is a tool I was unfamiliar with before this announcement. It's a business intelligence and analytics tool, and perhaps it is less mature as an offering than tabla would be, and this may offer Google a slightly more greater scope to bend and stretch and adapt. Looker and its offerings within the architecture and the ecosystem of visualization and analytics tools that Google are clearly seeking to develop elsewhere. Across the landscape of tools and applications, I feel that two in particular have demonstrated significant growth. They are flourish and data wrapper for those who are not familiar. Both these tools offer accessible means to create complex and elegant data visualizations simply and over the last twelve months, both have added a wide range of new charting, mapping and table techniques and templates. Flourish has also added more enhanced interactive techniques and both tools have bolstered their methods for handling, preparing and connecting to data. Another significant development, or potentially significant development, I believe relates to one of my favorite tools, which is raw graphs, which is the free web application. They recently announced a campaign to fundraise towards the development of raw graphs 2.0 and they're seeking to offer a richer set of potential enhanced features such as the saving of projects, greater control over the design appearance, and further enhancements of the chart libraries. The fundraising campaign is coming to a close soon, and hopefully they'll hit their targets to enact these changes, and hopefully the tool will continue to be free into 2020. We have these rich enhancements that I personally will be very excited about seeing. With regards to a central unsolved challenge, perhaps. I think looking back on 20 eighteen's developments, we were quite excited as a field and community around the developments of data illustrator from Adobe and charticulator from Microsoft. I feel that over 2019, neither of those tools have really moved forward yet. In terms of the version 2.0 nature of what you'd expect and hope, perhaps that's inevitable because they are both initially free offerings and perhaps are waiting to find out how users are employing these tools into their workflows. But I think hopefully the excitement of raw graph developments will also be seen in terms of where both data illustrator and charticular go in the next twelve months. And just one final footnote. I think personally speaking, my unsolved challenges with regards to desktop and enterprise tools relates to two key things, how you seamlessly create outputs fit for flexible multiple digital platforms such as mobile ready, tablet ready and desktop ready, and also a very small thing. But I wish there were further techniques and features available to allow me to use further encodings easily without hacks or workarounds, such as using the stroke or outline of a mark, more ways to use labeling and tie that to different data appearances or attributes, and also different textures that might be helpful for things like portraying certainties or uncertainties. Okay guys, thanks very much and all the best to everyone for the next twelve months.",
      "id": "ep_152_ut_6"
    },
    {
      "end": 1863962,
      "speaker": "B",
      "start": 1415420,
      "text": "So it's true that as Andy said, these new tools like data illustrator and charticulator could be developed further. And I suspect something is going to happen right in the, in the next future. Overall though, I think the major trend is that everything is getting so solid, right? The acquisition of Tableau by Salesforce and looker from Google and other tools getting much, much more mature, like data wrapper and raw graphs, everything is becoming much, much more solid. So I think that's a great trend. Flourish is amazing, really, too. We haven't really featured, but it's. Yeah, it's. So many people are getting a start now with visualizing data with flourish and there's so much you can achieve with just a few clicks. It's amazing. Next up is David Bauer. I know David for a long time, actually, and he's been the head of, I think, graphics at NZZ in Zurich, and he has a lot to tell about the development of visual data journalism and I'm super curious to hear what he has to say. Let's bring him on. Hi, I'm David, head of visuals at NZZ in Zurich, but only until the end of the year, actually, after that, I'm taking some time off before taking on the next challenge. So the one big development in data journalism in 2019 has been no doubt, bar chart races. No, I'm kidding. I still hate them. Actually. To me, 2019 didn't bring any major leaps forward in data journalism. I think it was rather a continuation of trends that I have seen over the past years, maybe. So. First, I'm seeing a move away from data driven stories to more data informed or data inspired stories. And what I mean by that is it's now pretty much a given that data journalists know how to work with data and visualize a bunch of numbers. So instead there is more focus on people behind the data, on storytelling in general, on finding new ways to communicate data. There might even be some sort of reckoning that just because you're showing data doesn't mean you're making a point or that your message resonates with the people you're trying to reach. This kind of blends into the second trend, which is climate change, obviously this has been the year that finally brought climate change into mainstream awareness, I think. And to me, climate change is a good example for an issue where just showing the data doesn't quite do the trick. It's maybe not a coincidence, also that the warming stripes, probably the most iconic visualization on climate change, has in fact not been done by a data journalist. It was done by a climate scientist, Ed Hawkins. And I mean, I'm not saying data journalists did a bad job. I've seen a lot of great pieces on climate change, but I do think that we can do better. Data journalists are in a great position to explain and report on climate change, and again, think data informed, not data driven. Third trend, which I see become ever stronger, is that data journalism teams invest in tools and in making their work reusable. Obviously, my team at NZZ has invested a lot in this, but we're far from alone. SRf data, the Spiegel, Quartz, FT, also the Times in London. I like this trend. I think it makes data journalism more sustainable and also more accessible to all sorts of people in newsrooms. And speaking of tools. But this is almost a trend of itself. Data wrapper is just getting better and better. I think there's hardly a team that has contributed so much to data journalism as they have. It's not just their tools, actually. Also how they raise awareness and help people make good graphics with tutorials, with their weekly charts. One big unsolved issue for data journalism that I see. What should its role in newsrooms be? Most newsrooms have now hired data journalists, but few have figured out what exactly to do with them. Are they wizards who do all kinds of crazy stuff with numbers? Are they reporters, essentially, that are just better with numbers than others? Are they a desk like sports, or a help desk for arithmophobic journalists? To be honest, I'm not sure. Different newsrooms will certainly find different best answers, but I do think that you will not find a good answer if you just look at the data journalists and then somehow try to figure out what their role should be. Newsrooms as a whole need to decide what level of data literacy they want to expect from everyone who's working there. And once this is clear, you will know whether you, you need expert data reporters or more of a data assistant. The one thing that you will never have is a great data journalist who can work on major investigations and do crazy stuff in r and at the same time help other journalists sort a table in excel. Right, right. Yeah, super fascinating to hear. And I think, again, it points to really this professionalization of the field and seeing how newsroom, like the NZZ or others, are really now developing the tools and using professional tools to really streamline their workflows. And I think we are on the brink of really newsrooms being now digital driven. And we see the first newsroom switching over from doing in parallel print graphics and web graphics to the print graphics being a side product of the web publishing process, which is finally the case. There's so much change in the area and so much really solid work being done. And, yeah, I think so much good input into the whole field has come from data journalism the last few years. Yeah, and I think he also mentioned data wrapper again, and others have mentioned it. And again, I think it's one of the major trends that we said is like this idea that tools are getting much more solid. The data wrapper team has been amazing, awesome. And it's not only the tool. Right? It's publishing all these blog posts, additional material, spreading a culture in a way, which I think it's a great development. And yeah, speaking of spreading a culture, the next one is from Elijah Meeks. He's also been making a lot of noise and being around for a long time. One of the major database figures around, definitely. And we asked Elijah to specifically comment on industry, since he's a very authoritative person from industry. And so let's see what he has to say about that.",
      "id": "ep_152_ut_7"
    },
    {
      "end": 2173790,
      "speaker": "F",
      "start": 1864146,
      "text": "I think 2019 was a banner year for data visualization. You saw a couple of major trends that were prominent to me. One was that data visualization is hitting the mainstream. And by that, I mean that we have our first data visualization president. And I've made this claim a few times. And people have sort of debated with me because, for instance, Thomas Jefferson famously produced a chart that was quite interesting. But by that, I mean that Donald Trump doesn't seem to be very interested in the actual systems and processes being represented by a chart. He's actually only interested in the chart itself. He doesn't treat it as a supplemental figure. He treats it as the primary source. And you can see that because if he does like the data being represented, he just says, well, use a different kind of chart. Use this kind of map that makes it look like that. I have a lot of support. And also, if he doesn't like a particular kind of chart, he thinks, well, if I just change the graphic, then that will change the phenomenon. So, for instance, the hurricane map, where he took a Sharpie and he added to it. And so I think that's a real remarkable situation. And very different from previous leadership, at least in the United States that I've seen. You also see Michelle Rial's book, where instead of it being one of these sort of classic data visualization coffee table books, which is typically a collection of historical charts or modern design work, you see this from, for instance, the Book of Trees and the Book of circles by Manuel Lima, that are trying to show you interesting data visualization design for you to either be inspired by or just to sort of enjoy the. Instead, Michelle Rial has put together custom data visualizations using rather standard charts, Venn diagrams and line charts and bar charts and those kind of things to represent aspects of her life and aspects of politics and society and things like that that she finds particularly interesting. I think it's incredibly compelling, and it's another one of these emanations of data humanism that we just see more and more. On that topic, you see Giorgia Lupi, who not only has taken a very prominent role at a major design firm in New York, but also has released a fashion line that has all of these data visualization elements in it. And even though we've seen work like this in the past, for instance, with Rachel Binx data visualization jewelry, this seems to be of a different prominence, not only to the community, the data visualization community, but to the world at large. And I think that's really exciting. We have this idea that data visualization is a secondary player, and instead now it's becoming very front and center in the world. And I think that ties into another aspect, which is that rather than just being seen as a sort of supplemental skill, data visualization, I think, is finally becoming an equal partner to the other data disciplines in industry. So you see data science, data engineering, and data analytics already being extremely prominent. And data visualization, which has always been sort of presented as a skill possessed by people who are analysts, scientists, and engineers, is now starting to develop into its own full fledged area within industry. And I think that's represented not only by the founding of the data Visualization Society, which has had an enormous amount of popularity, it has nearly 10,000 members. It might have 10,000 members signed up by the time this podcast comes out, but also the purchases of Tableau and Looker, big budget purchases by major industry players trying to get large scale data visualization talent and technology in house. I think this is in sharp contrast. This might seem very natural, but it's in sharp contrast to the way that people like Stephen Few and others have presented data visualization not as a fully fledged profession but as simply a skill. And finally, I think the other major theme of 2019 is the technical maturity of data visualization. I don't think we're seeing the kind of growth in amazing new forms of charts, amazing new tools, amazing new technologies in data visualization. If you look at the offerings of bi tools like Tableau, but also of libraries like D3 or like plotly, we're not seeing new and exciting charts. It's not like a few years back when everybody was trying to get sankeys into their libraries or when people would show a new compositional chart that, that wowed data visualization insiders. So instead, I think we see that people are optimizing now. These technologies, they're focused more on how they're being used and how you're designing from the problem space. And I think all of these just added together really point to an exciting new phase in data visualization that's going to enable not just analysts to look at industry data sets, but I think human beings to better understand their lives and interact with each other. I think it's going to dramatically increase the penetration of data visualization across professional and social areas. I think we're going to see it just more and more. And I think that it's just an exciting time to be involved in this field.",
      "id": "ep_152_ut_8"
    },
    {
      "end": 2276400,
      "speaker": "B",
      "start": 2174730,
      "text": "Yeah. There are so many interesting things that Elijah mentioned here. I just want to say, yeah, I agree with him when he says that we are now in the phase where we are more optimizing than trying to come up with crazy new stuff, which in a way makes me nostalgic. But it's also good. It means that things are getting much more solid and related to that, I also like this idea that even more than before, this is not limited to technical people. Right. And because of that, people are also developing new methods and tools that are specifically targeting people that are not necessarily too technical, which I think is great. We want to see more of that. Yeah. And again, data visualization society, Tableau and looker acquisition, people independently coming up with the same big trends, which is super interesting. Could also mean that we are either living in a bubble or are really well connected. Yes, exactly. Yeah. I totally agree about the consolidation and this increasing, like, going mainstream. I think that keeps going, and it's such an important development. Yeah. Next up, some science. Yes. Finally. You were waiting already. Right. So first we have Jen Christensen. Jen is art director at the Scientific American for many years, and we had a whole episode with her. She does wonderful work and has a really, really good big picture view of what's going on? So let's see what she'll have to say.",
      "id": "ep_152_ut_9"
    },
    {
      "end": 2543970,
      "speaker": "G",
      "start": 2276700,
      "text": "Hi, I'm Jen Christensen, senior graphics editor at Scientific American. To my mind, the top two biggest developments in data visualization as it relates to science communication go hand in hand. First, the increased level of comfort and ease with which scientists are sharing their data. And second, scientists and full time data designers are speaking the same language in a way that I haven't seen to this extent in the last 20 odd years working with scientists and artists. For example, an article in the January 2020 issue of Scientific American includes a data visualization that is the result of directly connecting data designer Nadieh Bremer with computational researcher Jonathan Carol Nellenbach. Although Nadieh's role for this project was as a data designer, she studied astronomy and university. Jonathan was part of the research team that published the astronomy paper that was at the heart of our article, but he also produces visualizations as a part of his own research collaborations, Jonathan was willing and able to quickly transfer a huge dataset over to Nadieh. Nadieh was able to efficiently assess the data set and ask insightful follow up questions. Their tools and languages overlap, and the pretense of proprietary information had dropped. I think that we've reached a point where that's now the rule rather than an exception. Scientists have become more generous with their data, and science communicators have become more fluent in the language and tools of computational analysis. As far as the third development goes, ill have to nod to a science inspired Dataviz statement that infiltrated popular culture, specifically warming stripes by Ed Hawkins, which debuted and garnered attention in 2018 but really gained traction as a science communication and engagement tool in 2019, thanks in part to the show your Stripes website and social media campaign. They are those rectangular visualizations made up of a series of chronologically ordered vertical stripes colored according to a region's annual temperature. Essentially every region's version of the climate stripe pattern progresses from cool blue to a warm red. No labels are needed, no caption is needed. It's a visceral and accessible nod to our warming planet, with color representing annual temperature. And it prints legibly on everything from social media profiles to pins, neckties, magazine covers, mugs and concert screensh. I think that a central, unsolved data visualization challenge in the area of science communication is addressing the fact that data is messy and is an artifact of our own biases. I think that often, especially in the context of science, we look at data as cold, hard, indisputable facts. I mean, I think it's accepted within science savvy audiences that additional studies will add more information and help shift the shape of the larger data set. It may result in shifting interpretations over time. I mean, that's pretty much how the practice of science works. But I fear that we too often create and interpret charts with a sense that they represent undisputable truth at that moment in time. But it really only represents the outputs of a specific line of questioning, or a specific model, or a specific experimental setup. I think that scientists and science communicators need to get better at nodding to those parameters directly when visualizing data for the public, in part to demystify the practice of doing science, but also to provide the tools to the public so that they can become more informed and critical thinkers. But I think that the best ways to efficiently do that aren't yet terribly clear. But I also think that this is a challenge that the broader data and visualization communities have been grappling with as well, as evidenced by the idea of missing data as explored by Mimi Onuoha, writings on data humanism by Giorgia Lupi and Jer Thorpe, Data for Black Lives and its executive director, Yeshimabeit Milner. Data feminism as written by Catherine D'Ignazio and Lauren Klein action towards decolonizing health data by Abigail Echo Hawk, and visualizing uncertainty by folks including Jessica Hullman, Matthew Kay and Lace Padilla. So I have hope that we'll get there.",
      "id": "ep_152_ut_10"
    },
    {
      "end": 2729370,
      "speaker": "B",
      "start": 2547390,
      "text": "Yeah, great points. Again. First of all, I'm super happy that she observes that scientists and designers are sort of still converging and we haven't given up and things are getting better. And my feeling is the same, that by now we have the technical tools and the scientists have the design. I by now that we can really do substantial things together, which is cool. And the other thing Jen mentioned is really, I think, also really a mega trend almost, is this how do we deal with uncertainty? The things we measure, what do they actually mean? What is truth anyways? And all these really big questions in a way that can also be very challenging if you always question everything at the same time. It's so important to really talk about the foundations of a whole approach. And I think that's great that it's happening. Yeah, no, absolutely. And actually, her remark here made me think about, while recording data stories over the years, one of the biggest transformation in my mind has been exactly that. Speaking with people, it's like, oh, data is actually not truth. It's so much. Oh my God, it's so much more complicated. Right? And then part of me was like, okay, but if something is coming from a scientist, this is much, much more solid. Right? It's much more truer, right? No, no, it's not like that. And I think even recently I've been listening to a few podcasts where there are people who have a very solid scientific background, but they have different positions on a topic. And even there, two experts that have different positions, and they are the kind of like debating with facts, quote unquote, facts in their hands can disagree completely. Right. So it's like, yeah. There are also these studies where they give researchers the same basic research task, like written in verbal language, and then they all come up with wildly different methods and results. Right. And they see how fuzzy things can be in the end. Yeah. Yeah. I think there was a wired article a few days ago. Exactly. Reporting on that. Exactly. It's scary in a way, but maybe it's also a sign that we are evolving and that's necessary to create better science. So it's not bad. It's not bad. Post modern data science. Post modern data science. Yeah, exactly. So, speaking of science and research, right. That's a perfect segue for the next person. Another old friend of our show, we have Jessica Hullman, professor at Northeastern University, and Jessica is a data visualization researcher. And not surprisingly, we asked her to comment on data visualization research.",
      "id": "ep_152_ut_11"
    },
    {
      "end": 3329850,
      "speaker": "H",
      "start": 2729750,
      "text": "Hi, this is Jessica Hullman. I'm an assistant professor at Northwestern University in computer science. I also have an appointment in journalism. I co direct the MeUx collective, or Midwest uncertainty collective, with Matt Kay, and I'm happy to be able to share my highlights from 2019 from the standpoint of vis research, which is what I do. So the first highlight I want to mention is kind of most based in a paper from CHI's ACM computer human interaction from 2019 by Pierre Dragachevic, Yvonne Jansen, Matt Kay, Abhraneel Sarma, Fanny Chevalier and this paper basically took this idea that statistical reformers have been promoting that rather than presenting a single analysis, when we publish, say, a research paper where we did some statistical analysis, we should actually be presenting a universe or a multiverse of analyses. This idea stems from the fact that often when we're doing a statistical analysis, say we've done some experiment, etcetera, and we're analyzing our data, all of these arbitrary decisions that we make along the way about, you know, what model we're going to use, how we're going to parameterize our model, how we're going to transform our input data, and those can have implications for our final results. And so the idea of a multiverse has been promoted by statistical reformers, as we should actually be communicating an entire universe of analyses choices, rather than just one single path through this set of possible analyses. What was exciting about this chi paper is that they looked at kind of, or started to explore what would an interactive, kind of visualization based representation of a multiverse analysis look like. So rather than a static PDF for your research paper, imagine that the research paper itself is interactive. The reader can kind of, you know, use sliders or drag over text in order to see the implications or the differences in the final analysis based on things like a different model or a different transformation of the input data. And visualizations, obviously play a big role. So how do you show not just, you know, single models results, which is already complicated, but a whole universe of models? And so they use animated hypothetical outcome plots as one example, which is a technique I'm fond of because I originally promoted this a bit, where you're showing basically animations where each frame is a different analysis result, but I think there's also static depiction. So how do you create a diagram that shows not just one analysis, but a bunch of them, and how that impacts the final outcome, whether that's a p value or whatever else you're looking at? And I think there's also interesting visualization challenges that this idea brings up from the standpoint of helping the analyst or the scientist understand and see through a visual representation kind of the impacts of their analysis choices, even as they're trying to specify this analysis. So I think, psychologically, it adds a lot of complexity to think about a universe of analyses. How do we help the reader do that through visualization, and how do we help the analyst think through this as well? And others are working on this as well. So Yong Liu from the University of Washington IdL, is doing some work, as well as the original authors of the paper. So I think it's an area that we'll see more of. So the second highlight, I think, from 2019, is work modeling people's prior beliefs in visualization. And so this is something my lab has been doing for a while. We've been asking people basically to predict what data might look like, or asking them to actually give us sort of a prior distribution over what they think are plausible values for data before we show them data. But in 2019, I think there's been several developments to this line of work that I think are exciting. So kind of late 2018, early 2019, Nina McCurdy and Mariah Meyer published a design study where they worked with global health experts. So people who worked with Zika virus and what they found in doing this design study, trying to build a visualization system for these analysts, was that they often kind of adjusted the data mentally that they were seeing in order to decide what they really thought was true, in this case, about, you know, Zika outbreak. And so this idea that people, you know, when they look at a visualization, they're not just taking the data at face value, but they're combining it with other things that they know is an idea that I think is. Is kind of obvious. You know, of course people have prior knowledge, but the idea that we can elicit this, I think, is exciting. And so in 2019, there were two papers at CHI's. One was my student Yea-Seul Kim's paper where we actually developed a bayesian model of cognition. So we're basically eliciting people's prior beliefs, showing them data, and then eliciting their posterior beliefs. So what do they believe after they've seen the data and comparing that to what you would expect someone to believe if they had updated their beliefs in a bayesian way. So we're applying these bayesian models of cognition to visualization interpretation. And I think it's just, you know, it's still work that we're just in the early stages of. But I think it's incredibly exciting in terms of how many things this opens up the ability to do. So it's a way of kind of looking at visualization, understanding, or interpretation in a more systematic way so we can, you know, compare to a normative bayesian standard. If people updated like true Bayesians, what would they do? And gain insight into how people are different in the way they treat data. We can also do things like vary the visualization and then use this sort of, you know, rational belief updating as a standard for evaluation, which I think is a big improvement over things like just evaluating for perceptual accuracy. We can also try to do things like quantify other factors that might affect belief updating, like how much does someone trust the source of the data? And we can even then start customizing or personalizing visualizations based on what people believed beforehand. So if we know that your prior beliefs make you unlikely, maybe to accept certain aspects of this data set because it conflicts with what you would have expected, we can emphasize that data more or do some sort of intervention. So I think our work at CHI 2018 is particularly exciting with first author Yea-Seul Kim. And then there was another paper at CHI 2019, same kind of idea about eliciting beliefs, but this was by Kyrie Reddy and students, or Redda and students, and they basically did kind of a Wizard of Oz study where in an analysis setting they had people basically make predictions about data, and then they kind of simulated the visualization tool, kind of giving people feedback to see kind of how might this affect things like exploratory data analysis. So I think that's all exciting in that it moves our understanding of how visualizations actually work and what we can do with them forward by quite a bit. My third highlight is just the idea that in visualization research, we're increasingly trying to partner with areas like machine learning and AI. And one example of this that I saw was at the IEEE Vis conference in 2019 back in October, where there were workshops in particular that kind of highlighted this. There was a bunch of papers as well, but a couple notable talks. Bean Kim, who does a lot of important work on machine learning interpretability, gave a keynote about interpretability that I think was really great for visualization audience because it can inspire us to work more on this. Chris Olah, who is also quite known for things like explaining deep learning, did another talk where he basically argued that we should be using feature visualization, so visualizing features of deep neural nets in order to try to understand the basic units of neural networks almost. He made an analogy to when people discovered the microscope and really used it to look at cells and make all of these discoveries at a very low level. Like we're at a point where we could do the same for deep learning to really understand what it's doing. So kind of very motivating talks from leaders in ML that I think is a good trend or a cool thing that's happened in 2019. Finally, an unsolved challenge. I'm going to point to these discussions that have been happening just over the last year that I've noticed a lot about kind of data visualization and power relations and how data visualization empowers certain people and not others. This is obviously like a big topic and not something that I think we in visualization, as kind of a bunch of computer scientists are well equipped to solve. But there have been a few researchers really kind of bringing attention to this. So Michael Correll of Tableau research did a keynote at the 2019 viz conference. It was at a digital humanities workshop, but it was basically about ways in which visualization researchers might bring in certain assumptions or kind of biases in how we think data should be treated when we work with people in the humanities, and how some of our ways of looking at data, in particular the way we really emphasize counting and detecting patterns, kind of at an abstract level, is kind of fundamentally opposed to some of these humanist ideologies, things like the idea of designing with people rather than just for them. Joanna Drucker also gave a capstone at 2019 viz. That was kind of about the same. Ideas about visualizations are often the way in which we think about the designing them. It kind of works against these humanists aims or ethical sort of aims that, you know, the way the schemas that we have just for organizing data itself are often inheriting biases or flaws from the institutions that create them. Others. Catherine D'Ignazio has been doing kind of feminist critique of visualization, and I think there's other examples as well. But the general challenge is just how do we reconcile and, and become more humanist in the way we use data, and how do we recognize that visualizations are always kind of biased and kind of begin to account for the way in which we're perpetuating biases? So, very hard challenge. I don't know how to solve it, but I think it's one that's important.",
      "id": "ep_152_ut_12"
    },
    {
      "end": 3427110,
      "speaker": "B",
      "start": 3330310,
      "text": "Yeah, that was perfect segue to our previous comments. It's exactly about what do we do with the fact that even when we look into scientific, quote unquote, facts, people can disagree, or maybe even the same type of analysis. If you change a little parameter here and there, you get different results. And so this is definitely one of the major trends this year. Like, people are realizing how much harder this whole thing, this whole enterprise is. And. Yeah, but we're making progress. So I think that's great. And this whole idea of multiverse analysis just blew my mind. It's like so cool to say, like, it's not just one paper, but it's like a whole manifold of paper. I. So insane. And it's wild. It's just wild. I love that. Yeah, it's wild. Yeah, yeah. And it's so funny. So we decided to go in alphabetical order, but now we have the third comet in a row, and they all really go hand in hand because Jessica Hullman, she ended with mentioning the fantastic data feminism book by Catherine D'Ignazio and Lauren Klein. And guess what? Laurie Klein is next up. She's an associate professor in the department of English and quantitative theory and methods at Emory University, and she also directs the digital humanities lab. And yeah, she wrote this great book. I think we mentioned in our conversation with Katherine a few dozen episodes back, and now it's finally out and really highly recommended. Let's hear what she has to say on the topic of data ethics.",
      "id": "ep_152_ut_13"
    },
    {
      "end": 3746572,
      "speaker": "Various",
      "start": 3427470,
      "text": "Thanks so much to Sandra and to the rest of the data stories team for including me. My name is Lauren Klein, and I'm an associate professor at Emory University in Atlanta, where I'm jointly appointed between the Department of English and the Department of Quantitative Theory and Methods. And that's a department that combines data science with the liberal arts. My own work is on the history of data and data visualization, which I then incorporate into my own data science work. And with Catherine D'Ignazio, I've just written a book called Data Feminism, which offers a way of thinking about data science and data ethics that is informed by the ideas of intersectional feminism. I think that's why I've been asked to talk about the significant developments in the area of data ethics, as well as a central unresolved challenge. So I'm going to start with the challenge, which is what ethics should even mean in the context of data and data visualization. So a lot of people fixate on the notion of fairness, referring to the goal of making opportunities equal for everyone. Or in the case of data visualization, making any particular visualization simply sort of reflect the data at hand. So this is a podcast, so you can't see my air quotes around the word simply reflect. So, to be clear about what I mean, it's that data science and data visualization are never neutral. There are choices being made at all times. So we know this intuitively as data scientists and as data visualization designers. And now there's actually a bunch of research that shows how viewers actually, actually attribute sort of undue authority to clean and minimal visualization design. So the big challenge for visualization designers and for everyone working with data is to recognize how our own decisions to depict neutrality are just that. They're just decisions, right? And since we're already making decisions, the challenge is to ask how we might make different decisions that could help work towards justice. There's been some great work in this area in the past year, so now I'll turn to my three exciting developments. The first is a new book by Doctor Ruha Benjamin, a professor in the department of African American Studies at Princeton who studies the social dimensions of science and technology. Her book is called race after abolitionist tools for the new Jim code, and it's a brilliant synthesis of everything we know about how data and the algorithms they power are racist and discriminatory. I think by now we're accustomed to these news articles about this or that discriminatory algorithm. We've heard about predictive policing we've heard about pretrial flight risk assessment algorithms, even the neural network that Amazon tried to develop recently to screen job resumes. And what Doctor Benjamin shows us is how these algorithms are all part of a larger system. This is what she calls the new Jim code and the references to the new Jim Crow, which is a phrase coined by Doctor Michelle Alexander to describe the us prison system. And Doctor Alexander is in turn referencing the original Jim Crow laws of the post civil War United States, which enforced segregation and therefore unequal access to opportunities, even though slavery had been abolished. And so not only does Doctor Benjamin point out how data driven systems are amplifying inequality and sort of preventing access to opportunity, but she also offers us tools for resistance. And it's a major contribution in no small part because it shows us how this resistance can sort of clear a path forward. A second contribution I want to highlight is the ACM's fairness, accountability and transparency in machine learning group. And actually I want to talk specifically about the work that they've undertaken in rethinking their own assumptions and exploring their own possible paths forward. So, similar to what I was talking about earlier with respect to data ethics, this group has been open to the critique that maybe an emphasis on fairness is actually made of making us pay less attention to issues of equity, which is what's really required if we're going to work against oppression. And so in response to these criticisms, they organized a conference called Craft, which stands for critiquing and rethinking, which is the C and the R. Accountability, fairness and transparency. The accepted papers for the next conference. This is actually taking place in 2020, in January or February. So sneaking in under the wire, they're posted online and you can google them and read about how scholars and practitioners are attempting to revise this sort of fairness framework. So now we'll talk about an actual visualization project, which is Kate Crawford and Vladan Joler's Anatomy of an AI system. This is a project that seeks to describe and diagram the human labor, data dependencies and material resources that contribute to the making of an Amazon echo. The project was published online as this. It's sort of like beautiful and enormous and overwhelming. It's a diagram. If you've ever readdez the Borges story about the map that is so detailed and specific that it actually becomes the size of the place itself it's trying to document. It's sort of like that. It's also accompanied by a 9000 word essay. And what it does is lead us through the incredibly complex and incredibly exploitative processes that contribute to making a single echo device. And what the diagram shows is how underneath that sort of small, beautiful cylindrical object is the labor and exploitation of thousands of people and also the environment for that matter. And this diagram is one way to bring that exploitation to light again so that we can sort of recognize what we're dealing with and we can think about how to take action. Those are my three developments. Thanks so much for including me in this end of your wrap up and have a great new year.",
      "id": "ep_152_ut_14"
    },
    {
      "end": 4279340,
      "speaker": "B",
      "start": 3746716,
      "text": "Thank you. You too. Yeah, so many good points. Amazing. And I mean, I think with just the last few years, all these super important issues have, you know, have gotten so much weight and now there's so much like structured activity around it. You know, all this whole topic of biases, fairness, accountability, algorithm critique, you know, this whole idea that we could criticize, you know, these practices in that way, you know, it hasn't been around like five years ago. Right, Enrico? Well, we had a few early episodes back then. I think we had Kate Crawford a few years back. Right? She was already talking about this. Yes. But now it's kind of like mainstream, right? Yeah, yeah, absolutely. Yeah. And the shout out to Kate Crawford's anatomy of an AI system is really a good reminder. It's a fantastic, huge illustration of how this algorithm works. Definitely worth checking out. Yeah, yeah, absolutely. And I think one of the biggest challenges for me in this area is to kind of like trying to find the right balance between acknowledging these issues and fixing them, but at the same time remaining excited about the endless possibilities. So there's a constant battle in my mind between these two things. It's definitely not easy. Yeah. But it's like accessibility. You can either see it as a limitation, it's like, oh, no, it's really big. Or you understand that it's really an opportunity, you know, to do something really interesting and novel also in that field. And like this whole idea of, okay, how can we do fair like machine learning? Yeah, I think that can also be very inspiring. Right? Yeah, yeah, yeah, absolutely. Absolutely. So talking of novel, right, the next person is Marteen Lambrechts. He's an independent data visualization designer. And he's another person who's been around for quite a while. And lately he has been working on this idea of xenographics, which again is about novel or even somewhat weird or innovative data visualizations or data representations. And he created this very nice collection of xenographics visualization. And because of that, we asked him to comment exactly on xenographics. He sort of nailed that trick of first inventing a field and then become the world's leading expert in it. Exactly. That's perfect, right? Hellofax. Let's see what he has to say. Hi there, I'm Martin Lambrechts and I am the author of Xenographics, a website that contains a collection of what I think are techniques that you don't see every day but still can be very effective. So I'm a lover of weird charts and data stories asked me to talk a little bit about three significant developments in the area of unusual data visualizations during the past year. The first trend I noticed this year is unfortunately not a very big trend, but I did see some of the charts and xenographics collection pop up in the wilds. So there is some adoption of Xenographics in mainstream data visualization, but it isn't really a very rapid adoption. But I still wanted to highlight one example of one of those adoptions, and that is an origin destination map, also called an OD map. That was this summer published by the City of London in their London industrial strategic report. The OD map is one of my favorite scenographics and it is a kind of map containing mini versions of itself that you can use to show flows of things between origins and destinations. And the map in the report shows commute movements in and around London, and it was developed by Mike Bronbjerg, who does data visualization for the London City Hall. I did see other examples of xenographics popping up in the wild as well. So I'm definitely going to promote xenographics further in the future to have more adoption, both by toolmakers and by practitioners. But we have to be honest here, casino graphics are still very niche and mostly loved by people who are already quite knowledgeable about visualization. So the second trend is a trend I am quite happy about. Xenographics are mentioned in one of the nicest books on data visualization I've seen in the last couple of years, the data Visualization Handbook by Juuso Koponen and I, Jonathan Hilden from Finland, and the book appeared this year in English. And I also know of at least one other data visualization book that will be published next year that will also reference xenographics. And every once in a while xenographics gets a mention by some high profile people in the field, like for example, Alberto Cairo, who has mentioned xenographics already several times on his blog. And then there is also Lisa Waananen Jones, an assistant professor at Washington State University. She teaches an introduction to data visualization class, and she wrote me that she uses the xenographics website in her class, and in her words, it helps students think more creatively, but also more critically about all chart forms and our assumptions about how things are supposed to be. So the awareness that there's more out there than just bars, pies and lines is definitely there, especially among data visualization professionals. And then, before talking about the third trend I wanted to highlight, I want to mention, in my view, most important unsolved issue in the area of unusual data visualization, and that is data visualization in education. And this puts at lower, as in higher levels of education. I think there is more attention paid to data visualization in education as there used to be. But I think we need to do a lot more still to lift the level of graphic in the general public in an age where data is so very present in many aspects of life. And this brings me to the third trend next to education. We also need accessible visualization tools. And one of the tools I use a lot, and that I have recommended many times, is raw graphs. Raw graphs is an open source and free visualization tool in Italy, and it has been around since 2013, and it offers a lot of templates to make less common charts for people who don't code. And the people behind raw graphs have just successfully closed the crowdfunding campaign to find €33,000 to develop the tool further. So their plans are to add more charts, both basic but also unconventional ones, to make it possible to save projects which at the moment is still not possible, to add more controls for things like labels and general better performance. So I'm glad that many people see value in a tool like raw graphs, and I'm also very looking forward to the evolution of the tool in the coming time. I think raw graphs is one of the causes of less conventional chart types becoming more popular, and I am very curious to see which genographics they are going to add to the tool. So those are some of the things I noticed in the field of xenographics in 2019, and I would like to thank data stories for having me and bye. Yes, so we're going to see some of these xenographics being hopefully adopted by several tools. I'm really curious to see what is going to happen there. I just want to remark again on this idea of data visualization in education. It's so important. Not only how can we create better education tools to teach data visualization, but also how can data visualization be used more effectively in education I think there's a huge, huge potential there. Yeah. And again, this whole idea of also collecting all these weird chart types for me, that came so at the right time, there was this, yeah, as you say, like this professionalization and the tools and the platforms, but in a way that also leads to this really extreme streamlining of design. I also find web design extremely boring right now. And so I just really enjoyed his wild circles of crazy graphics. I like these types of things. Oh, let's hope more cinegraphics. Yeah. Are you featured in xenographics? Did you create your. I'm not sure I should try harder to do something weird, maybe? Yeah, I thought I have tried already, but yeah. Do you have something in there? I suspect I do. I think there is a thing that is called flow straights that we did many years back, and I think it featured their flow straights.",
      "id": "ep_152_ut_15"
    },
    {
      "end": 4280200,
      "speaker": "C",
      "start": 4279460,
      "text": "Yes.",
      "id": "ep_152_ut_16"
    },
    {
      "end": 4320250,
      "speaker": "B",
      "start": 4282260,
      "text": "Sounds weird to me. Yeah. Well designed. Next up, keeping database weird. Maral Pourkazemi. Maral is also an old friend of mine. I know her from back in the day in Potsdam. Meanwhile, she's founded a couple of studios, done a lot of great work. She co ran the really great visualized conference series. And yeah, now for a few years she's been in London and done some really interesting work. And we asked her to comment a bit on interesting developments in diversity and inclusion. Let's see.",
      "id": "ep_152_ut_17"
    },
    {
      "end": 4765020,
      "speaker": "G",
      "start": 4320710,
      "text": "Hello, data stories. This is Maral, your design activist from London. Thank you very much for letting me speak on the matter of diversity, a matter that is very close to my heart and a big part and driver of inspiration in my personal and professional life. So I take this with great responsibility. I would like to first speak about gender diversity in the field because my own point of reference from when I started my career here in this field about, let's say, seven years ago, I would like to compare it to that time when it didn't feel like the women were unionized enough as they were today. It feels like the women in the field, they hear each other and they speak to each other more, which leads to creating community, which leads to being a stronger front, which leads to being seen. That's a great development that I can see, and I think it manifests itself, let's say, for example, at conferences, it shows itself today by women leading departments, leading big projects, leading organizations, leading their own businesses. And this obviously has been the case five years, six years ago, too. But it wasn't as apparent. It wasn't maybe as frequent either. And I personally, as a woman today, feel a lot more empowered and I feel like what I have got to say will be listened to more than, and taken more into consideration than if I had said a certain thing seven years ago when I started my career. So in that regard, I think we all deserve to clap hands or like, be happy about that fact, but not to stop where we are now, because there are still a couple of things, of course, that could be improved. Let's say workplace gender equality is still an issue. So to the employers out there, make sure that you make a conscious effort. Keep hiring women. Don't just have sausage vests sitting behind your desk, because that's a, first of all, you're going against the zeitgeist. And secondly, there is no excuse anymore to say that women aren't talented or whatever, because that used to be a misconception anyways, and that men do a better job. That's. That is lifting, that thing is shedding, and that's a good thing. So for that, that actually all the women out there, that's all you, so clap your hands for that. It's amazing. On the other hand, the one thing that we really, really need to do so much work in is to making aerospace inclusive so it's attractive to non white people. We are a primarily white scene, and that hasn't, in my eyes, changed at all since I started my career. And it's obviously not an issue that is exclusive to the data visualization field, but. But it's one that I really want to believe that we, as an intellectual and very intelligent, friendly community, can solve. The only thing that I would always say, and I keep saying this in this context, is wanting more diversity doesn't bring you more diversity. Wanting to be non white doesn't make you non white. You have to make conscious effort. You have to back up your desires with actions. What could those actions look like? I mean, we could draw inspiration from, for example, data for change, a women run organization that hosts workshops frequently outside of the UK where they are based, for example, in Uganda, in Beirut, and most recently also in Estonia. And they fuse local talent with, with western talent to work on datasets that are local to their communities, to solve problems that are local to their communities, and to create data driven projects together. The collaborations that happen in that space are incredibly inspiring. The bridges that are built in those events, I haven't seen them built anywhere else yet, to be honest. And it opens up our world to them so they actually get more involved. I really think that the leaders of our field have to use their power of influence in a similar way to either shed light on initiatives like that, to give them air time to speak about this, these kind of things that they create, these kind of spaces that they create so that people let people of colour from around the world hear it and see it, so that people from religious minority backgrounds or lgbt backgrounds see it and hear it and feel like they are heard. And that is the most important thing, right? So preaching to the choir is not going to help. We really have to find ways and channels in order to make others feel heard and not just to be heard. One good, actually, inspiration on that note is Zach Lieberman's school for poetic computation. He told me in a conversation around diversity and inclusivity. In order to get the school for poetic computation to be more inclusive, they had to make a couple of design decisions that would even be visual design decisions on the website and copy design decisions in regards of what kind of language is being used to make the program more accessible to people that are non white. And if you go to their site, you'll see all the talented folks that are there that absolutely come from all corners of the world. So there's a little bit of inspiration to draw from that. And I really hope that we will see a positive change in that sphere pretty soon and not just only talk about it. I should probably also say I myself with my friends have started a studio. We are queer, we are trans, we are non binary, we are people of color and we are white. We are all creatives from all parts of the spectrum of creativity and creative talent. And once you pop, you don't stop. It feels hard to walk the first step, but really, there is so much talent out there. And to discover new talent, it can become a hobby. We ourselves, when we start new initiatives of projects in our studio, we always and always and always have to make sure that the people that we work with are either female identifying or people of color and or people of color, trans people, non binary people, queer people. And it's not hard once you do it, once you open up a path, once you open up a stream, once you become a community, and that is something that Dataviz community already is. We are a community. We are just a little bit too exclusive. It's possible. It's not rocket science. Thank you and good night, dear people.",
      "id": "ep_152_ut_18"
    },
    {
      "end": 4865848,
      "speaker": "B",
      "start": 4767520,
      "text": "Yeah, so nice. And she's so right, right? I mean, just simple as that. And we all profit if we keep mixing things more up. It's kind of difficult not to fall into the same traps of going the comfortable route of keeping things as they are. But there's so much to be gained, I think, if we keep opening the field even more. Yeah, absolutely. And we've been discussing these issues several times on the show and also privately. And I think me and you often discuss this idea on how do we go behind. Sorry, not behind, beyond. Like having, like, we are very much focused on even geographically, right, where everyone, most people are either from the US or the EU, and we're like, there must be something happening around the world. Right. That's why sometimes we organize the around the world episodes and. Yeah, so that's. That's even another axis of diversity that is really interesting and our probably many more. And, yeah, I think it's very important to look into that. Yeah, yeah, yeah, absolutely. And in fact, our next guest presents a new local perspective. We have Mitchell Whitelaw. He has a really interesting academic, but also practitioner, designer, artist. Yeah, I really like his mix of interest and skills. And he's an associate professor at the Australian national university. And he wanted to comment specifically on data localism and local projects. So let's see.",
      "id": "ep_152_ut_19"
    },
    {
      "end": 5183938,
      "speaker": "I",
      "start": 4866024,
      "text": "Hey, it's Mitchell Whitelaw here in Canberra, Australia. I'm going to use my vantage point on the other side of the world to talk about data localism, the kind of renewed attention to local concerns and perspectives that we're seeing in data practice at the moment. The first one's a beautiful book that's recently come out by Chris McDowall and Tim Denee. It's called we are here, an atlas of Aotearoa. It's an exquisite work of visualization that looks at the country of New Zealand through a whole lot of different topics. Biodiversity, demographics, culture, music, landscape, exquisite maps. But the thing that makes it special to me is the kind of the love, I guess, that comes out in the book. It's of intensely local focus and it shows a kind of depth and attentiveness and a care about place, which I think is quite moving. And, yeah, really interesting. It's a big, chunky atlas full of beautiful visualizations about a smallish country in the southern hemisphere with a relatively small population. And yet there's so much love and effort has been lavished upon this. The visualizations are great, but they're not technically radical, I guess they're extremely well made and beautifully designed, but they are never celebrations of technique for its own sake. It's really about content. Another nice example of data localism for me are Sydney based studio small multiples. They do lots of great data views, lots of maps of geospatial stuff. What's special about them, I think, is that they really own their position in their place and in their local perspective. So they're in Sydney. Both Jack Zhao and Andrea Lau, the founders, are second generation chinese Australians. And they take a focus on kind of ancestry and ethnicity and apply that to a lot of the work that they do. Their work is sort of activist. It's focusing on a specific urban context. It looks at issues of wealth inequality, social kind of change, in Sydney, one of the most expensive cities in the world. And, yeah, again, they deliver a lot through this local perspective by virtue of their own position in that. The third project for me that's really strong, and it's not a southern hemisphere project, is from Tega Brain. Her project, Bushwick Analytica. There's just a gorgeous project that was done at Bushwick Library in Brooklyn, New York, where Tega worked with a group of primary school kids to develop and then launch targeted ad campaigns. It's like by making these ad campaigns, which are gorgeous in that they focus on really specific concerns. One of the kids makes an ad campaign to try and convince parents to get their kids a pet. Another one targets parents with the message that, you know, there should be no school on Mondays and so on. And they come with little drawings. They're just great. But again, it's this specificity of these concerns, and often they're very targeted to the neighbourhoods that the kids live in themselves. Shows us how the local can kind of speak back to this very abstracted kind of global networks that we find ourselves in. Something that illustrates the change in visualization practice really well, I think is in the work of Jer Thorpe, whose work I've followed for ages. In 2009, he made a work called just Landed, which was a Twitter visualization that it visualized flight paths or journey trajectories by looking for the words just landed in Twitter streams. And so it made these beautiful arcs that flew across the globe. Compare that with a project that Jia's been working on more recently, which is called the Map Room. The first one was the St. Louis map room, which is a kind of grassroots community mapping project, working in town halls, working with communities to track and represent issues that are very local, issues that are of concern to them, and using mapping and visualisation as a tool for a kind of community engagement with their environment. Big bank, I think it was. Merrill lynch recently declared that in the 2020s, globalization was going to go into reverse. And they're not the only person who is saying that. There's a lot of kind of a backlash against the changes that globalization has seen, and we're seeing the resurgence of nationalism and protectionist trade and stuff like that. So there's a lot of reasons to be skeptical or to be concerned about a resurgent kind of localism. I think that I'm more glass half full than that. John Thackara for ages has been talking about what he calls sort of bioregional design, which is the idea that a designer or creative practitioner should really be in the place where they are. They should acknowledge the kind of food and water systems that their life actually depends on, and they should focus on that in their work. So I think there are prospects for a kind of more positive localism coming out of this practice. A localism which doesn't cut itself off or turn inwards, but actually stays networked and connected.",
      "id": "ep_152_ut_20"
    },
    {
      "end": 5184322,
      "speaker": "H",
      "start": 5184074,
      "text": "Yeah.",
      "id": "ep_152_ut_21"
    },
    {
      "end": 5186230,
      "speaker": "I",
      "start": 5184346,
      "text": "Which is maybe something to aspire to.",
      "id": "ep_152_ut_22"
    },
    {
      "end": 6553290,
      "speaker": "B",
      "start": 5186730,
      "text": "Yeah, great perspective. And I mean, this whole idea of connecting more to where we are and what we do and our bodies and our surroundings, you know, that's been a big theme. And then again, the whole ecological approach to anything, which you can't ignore right now. Right. And if you. Yeah, if you blend all that together, I think there could be a whole new genre of activities coming out of that. Yeah, no, I agree. It's not only about where, from where a person is working, but also whether the data is actually collected at the local level. And there's so much to do in a global world. There is a lot to do locally. So that's definitely important. Next, we have another good friend of ours. We have Paolo Ciuccarelli, an Italian here. Yeah, and the quota Italian. So Paolo is also been around for, for a long time. And what I really like of his work is he's been, he's been a core Dataviz person for a long time, but always with this very strong design background. And he used to be at Politecnico di Milano, and now he moved to the US. He's at Northe Northeastern university and doing great things there. And we asked him to comment specifically, surprise, surprise. On design. Hello, everyone. Here is Paolo Ciuccarelli from Northeastern University. And the first significant development I see as a designer is a genuine interest in design, design as a discipline. And I see a kind of a quest to try to understand its nature. It's not only about looking at what practitioners are doing. I see more investigations around design processing methods, often guided by other disciplines. I see more focus on design studies. I think it's a sign of the time and times are ripe for a more articulated relationship with data and beyond the technical dimension with a human in the loop and actually at its very center and connected to that, I see a growing interest for the humanities, both as a field of study and a source of inspiration for a kind of a different way to look at data. And it goes together with the trend around the idea of humanism, of data. And actually, it was really cool to see Joanna Drucker closing the vis conference in Vancouver this year. I mean, she's the one that very clearly pointed out the human made nature of data ten years ago or so. And I'm sure this cultural shift towards the human can only get stronger thanks to big data, and the nature of algorithms and design can definitely help with it. The second development I see, and I'm actually following it very closely in the context of the broader relationship with, between design, creativity and AI, is automated chart production. And the first experiments are very simple and they could look naive, but it's really interesting, and I'm sure it will develop very quickly as technologies in AI and machine learning will do. Of course, I see it more as a push to rise the bar and to focus on what machines will never be able to do, and less as a threat for our job as information designers. I mean, we don't have to be scared about that and just push and rise the bar. And as a third development, I really want to mention the crowdfunding campaign launched by density design and the other partners to develop raw graph and the open source tool that I'm sure many of you know, and if not, use. And it's a success. Actually, I was surprised by the fact that it didn't read reached the goal yet few days ago, but then it happened, hopefully. And I see this, the final rise of these recent days, as a measure of the interest and a very promising concrete sign of support for a culture of open and accessible resources that are definitely needed in the field. Connected to this, and this is my central and unsolved challenge that certainly deserves more attention, is the issue of data literacy, meaning the capacity to systematically and correctly use the basic components of the visualization grammar, but also to understand its issues and implications. And it's honestly surprising how simple and reductive that grammar could be. And even within important organizations where people are supposed to make important decisions based on evidences and data that are often very poorly represented. A related issue is education in data visualization pedagogy. And I'm seeing here in northeastern disciplines, others than design and computer science, starting to teach data visualization in their programs. And I really think it's time to develop, not only here, certainly shared frameworks, vocabularies and methods and tools to really create a common culture around it. And that's it. Nice. He's so right. And I was super interested to hear him mention automating design. It's something I've been thinking about over this year as well. I had a project that went into this direction, and this could be the next big thing. And I think a lot of really smart people are working on it already. So this is something I'm really curious about. So when you say automating design, what would you mean? Yeah, a lot of like, design is actually repetitive tasks or like that. I think that the key in design is choosing. Well, like as you do in generative design, you create a hundred different variations, but then which ones do you pick? And maybe we can do the same for chart design or UI design or, you know, and. Yeah, I know for a fact a few big companies are working on that because I'm involved a bit. So, yeah, I think that there will be interesting developments there. So kind of like making the most tedious aspects of design, let's say, more automated and also those that are more amenable to automation. Right, sure. Yeah, yeah. I think that there's a similar trend into this idea of kind of like in data analysis, trying to have recommendation from the system so that you. Yeah, you don't have to do everything yourself. The system is kind of like trying to non intrusively suggest to you things that you might want to do. Yeah, that's an interesting trend. Again, ties to the big topic, how we interact with smart systems and two clever algorithms. Exactly right. It might be the challenge for the next decade as things get more and more automated, how are we supposed to interact with them? That's a huge topic. Yeah, just be friendly with the robots. Nothing will happen. Do you feel bad when you see those videos where robots get beaten up? Yeah, that's gonna be a problem. This is gonna come back. They will watch these videos and go after us. If we keep doing that. Anyways, we can see what the 2029 review brings in terms of robot wars. But before that, probably final mailbox message, there is a wild card still in the game. So we might have one or two messages left. But first from Thomas Dahm on the topic of conferences. Thomas runs a super interesting site called Neon Moire. Great name, also great purple, as we have in the stories. And he's just a very avid observer of the design conference scene. And so I was super curious to hear what he has to see from this semi outside view, like inside and outside view, on how the data visualization conference world is currently developing. So let's hear it. Hi Mauritan Enrico, thank you for having me. Three significant developments in data visualization conferences in 2019. Let's see, the first trend that I see would be that Dataviz conferences have a good gender and ethnic mix of speakers in comparison to some other design, creative and tech conferences around the world. So that's really a positive thing. Second trend that I see is that there are more and more Datavis creators speaking at the more regular design or UX conferences. Good examples are Nadia Brahma and Giorgia Lupi, Stephanie Posavec and Emona Charlabi, if I pronounce that correctly. So the third, more general trend is that design tools and design agencies set up their own one or multiple day conference. Some are invite only, others are with low ticket fees and some have high ticket fee but give a lot of scholarships. And of course there is the Tableau conference. But recently agencies like UE now organized a one day conference in Brooklyn and last November was the first no code conference organized by Webflow. And in 2025, the popular collaborative design tool is organizing their own one day conferences in San Francisco. So yeah, you see a lot of happening on that field. And one other trend that I would like to share is that the start time of the events is slowly shifting from early in the morning to beginning of the afternoon, evening and ends very late at night and then closing with DJ and VJ sets to give another experience and more party ending of a conference end that over multiple days. So it's more festival like our own self challenge. I think there are a couple. SWag is always a big thing. Everybody wants it and everybody says they don't like it. But yeah, SWAg is complicated and the only thing that I really can say is that make it sustainable and not too heavy. Another challenge that I hear from organizers is that finding the right spot sponsors is becoming harder and harder every year because of the massive growth of design conferences around the world. For example, in 2019 I had 150 events listed on Neomar and our list is far from complete. There are more than 250 in total. So yeah, it's a lot. So it's complicated to find the money and the right sponsors for their events. And lastly, on self challenge, or at least in my opinion everybody is struggling with, is the question of do people record the conference and live stream? And I think you should do this for sure, or at least record the conference in total and then share it later the year for free or behind the paywall because it's good for the speaker to have a video to get new speaking gigs. And for the conference it's good because they can share the whole year long their content. And that's always interesting because you, as a conference, you stay on top of mind of everybody. So yeah, that's it. Yes, I'm looking forward to all the conferences in 2020, and especially the ones that are celebrating their 5th, 10th or 20th birthday, like us by night in Antwerp and beyond, Tallerant in Dusseldorf and off by night in Barcelona. People can follow me on Twitter Thomas Dahm www.neonmoire.com and I also have a podcast called the Neon Moire show where I talk with speakers and conference organizers about what makes them tick. The latest was with Dion Lee. She's the art director@fox.com. video on www.neonmoire.com you can find the best design, UX and datafish conferences around the world. So please have a look. And thanks again, Moritz and Enrico for having me on your show. Bye. Yeah, great. Love to have that perspective and I can really, first of all, it's great to hear that things also look alright from that angle. And I wasn't aware of this trend of agencies doing conferences and so on. It's super interesting. Yeah, I think conferences now are, again, I think the trend is somewhat similar here. The main conferences have been around for a while. They're getting more and more solid. And I was not aware of this idea that agencies are now organizing conferences, which I think is really good. They're really interesting. Of course, one of the biggest things here is the blow conference, which I have to confess, I've never been there, but I would love to. Apparently it's huge, right? And it's a lot of fun. They organize amazing activities and every time I see on Twitter comments and photos and videos, I'm kind of like jealous. Seems to be like super fun to be there and, yeah, and it's huge. So once again, it means that there are lots of people out there who are either already working in visualization or at the very least they are super enthusiastic about it, at least enough to go to a conference. That's great. Yeah. The other really thing that struck me is sometimes people ask, well, where do you get data vis inspiration? And for me it's really not from data vis activities or exhibition, but just the neighboring field. So if you look at architecture or if you look at graphic design or you look at illustration or music or whatnot, I think there you can find the best inspiration. So maybe if you plan your conference year 2020, take a look at Neon Moore and find something that's not quite data visualization, but almost. That's a great, inspiring environment, actually. That's great advice. I have to say that in a way, it's somewhat similar for me. I mean, I worked, I mean, my research work is mostly in computer science, but I have a similar strategy. I try to look into the tangential. How do you say that in English? Similar fields. Right. Say, in my case would be databases or machine learning or other things. Right. It's like, what's going on there? And how can I borrow some ideas to do more work in visualization? So I think that's great advice. Yeah. And then you can justify anything as research. That's great. Yeah. Fantastic. So I think we're wrapping it up over here. Yeah, yeah. It's been a good year. Very full. It's been a good year. Yeah. But striking that people keep mentioning the same things. It's so crazy, right? It's like we tried to really like invite a wide range of. Of people, and in the end, it's all raw graphs and. Well, but I like this, I don't know, emerging themes. Right. This way we can see that some things are really, are really going on. Right. And so some of these things have been mentioned by multiple guests, and these are probably some of the major things happening that happened in this year. So that's great. Do we have any resolutions for the next episode? No, except, yeah, I don't know. This year passed by so quickly, it seems like I can clearly remember when we recorded our previews end of the year episode. Maybe we should just say that. But there are still some great data visualization podcasts out there, and they are kicking and it is great. So what do we have? We have data Vista day with Elliot Torban. Is it Torban? Yes, we have Cole Nussbaumer Knaflic's podcast storytelling with data. There's John Schwartz, Policyvis Policyvis. Are you forgetting somebody? Probably. We probably forget somebody, but these are those that we had as guests last year, and I think they're doing great. So that's. We want to see more. So if you're listening to this and you are uncertain, start new podcasts. Maybe we should mention that Robert started a YouTube channel that is called EagerEyes TV ( youtube.com/@eagereyes ). Nobody mentioned that. I think we should. He's a famous tv star now is the first real Dataviz channel I'm aware of. So I'm curious to see what is gonna happen with it next year. So, Robert, if you're listening to get a late night show. Yeah, exactly. Yeah. Yeah. And finally, big shout out and thank you to Florian, our audio engineer, who has just witnessed at least, and if you listen to it, also completed his 100th episode for data stories, which is amazing. I have no idea how he can, how he managed to cope with us this long and just hope he keeps being that stubborn and sticks around for another hundred people. Don't know what happens behind the scenes, but I can tell you every single episode is a struggle one way or another, even after so many years. Absolutely. So thank you, Florian. Yay. Yeah. And then we should definitely mention Sandra. Sandra is our work and development of the year. Right. It's probably the biggest significant development of the year. So Sandra joined our team and she's been so much help and I'm super happy that she's helping us. And she's also been featured in one of our recent episodes. So you also had an opportunity to listen to her voice. But she's doing a fantastic work behind the scenes, including, among many other things, taking care of the Patreon channel that we have and sending updates to everyone and trying to make the show much more solid since when she joined. I feel like, oh, this is getting so much better. So thanks. Thanks. Thanks a lot, Sandra. That's great. It's great to have you on. Yeah. And finally, this is all building on Destry's fantastic work all the years. And Destry just had a super cute little baby this year, I think in spring ish. Yeah, yeah. I've been following it a bit and it's so cute. It's just so great to see. And big shout out to Destry as well, who prepared all this and helped us really get on track with a professional workflow. Semi professional, maybe. Yeah. Yeah, it's true. The year passed by so quick. But again, as you say, it's so exciting to also see all these developments and the field growing up and us being a part of it, like sort of swimming in that sea of data busyness. Yes. Maybe we should also thank all the people that, all the guests that we had this year. When I scrolled through the link, I'm like, whoa, that was so cool. Yeah. Great guests, great listeners. Without you, there would be no podcast. It would just be weird. So that's good. And thanks to all our supporters, I think we have around 100 patreons or so. Let me check it. That was our initial target and I think after a while we are basically almost there. So thanks, everyone, for supporting the show that's now our dream is basically realized. The show is completely supported by our listeners. Exactly how amazing is that, right? Yeah, it's amazing. I can't believe we made it. So the show is going on thanks to you. That's true. That's true. And yeah, really looking forward to next year. We have a few really cool guests lined up already. We have good intentions to keep things mixed up and weird and funny and informative. And meanwhile, we'll take a little, little break. But yeah, we'll be back in 2020. Oh, man, that sounds like the future. See you on the other side then. That's right. Bye bye. Happy new year to everyone. Bye bye. Bye bye. Hey folks, thanks for listening to data stories again. Before you leave, a few last notes, this show is crowdfunded and you can support us on patreon@patreon.com Datastories, where we publish monthly previews of upcoming episodes for our supporters. Or you can also send us a one time donation via PayPal at PayPal Dot Me Datastories or as a free way to support the show. If you can spend a couple of minutes rating us on iTunes, that would be very helpful as well. And here's some information on the many ways you can get news directly from us. We are on Twitter, Facebook and Instagram, so follow us there for the latest updates. We have also a slack channel where you can chat with us directly. And to sign up, go to our homepage at Datastory ES and there you'll find a button at the bottom of the page. And there you can also subscribe to our email newsletter if you want to get news directly into your inbox and be notified whenever we publish a new episode. That's right, and we love to get in touch with our listeners. So let us know if you want to suggest a way to improve the show or know any amazing people you want us to invite or even have any project you want us to talk about. Yeah, absolutely. Don't hesitate to get in touch. Just send us an email at mailatastory es. That's all for now. See you next time, and thanks for listening to data stories.",
      "id": "ep_152_ut_23"
    }
  ],
  "confidence": 0.928584758751726,
  "audio_duration": 6562,
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_status_code": null,
  "webhook_auth": false,
  "webhook_auth_header_name": null,
  "speed_boost": false,
  "auto_highlights_result": null,
  "auto_highlights": false,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_audio_quality": null,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "content_safety": false,
  "iab_categories": true,
  "content_safety_labels": {
    "status": "unavailable",
    "results": [],
    "summary": {}
  },
  "language_detection": false,
  "language_detection_threshold": null,
  "language_confidence": null,
  "custom_spelling": null,
  "throttled": false,
  "auto_chapters": true,
  "summarization": false,
  "summary_type": null,
  "summary_model": null,
  "custom_topics": false,
  "topics": [],
  "speech_threshold": null,
  "speech_model": "best",
  "chapters": [
    {
      "summary": "This is a special episode for the end of the year. We asked a number of professionals around the world to comment on specific areas of development of data visualization. If you do enjoy the show, please consider supporting us.",
      "gist": "Data Stories: End of the Year Edition",
      "headline": "This podcast features interviews with experts in data visualization and analysis",
      "start": 160,
      "end": 189890,
      "id": "ep_152_ch_0"
    },
    {
      "summary": "Alberto Cairo teaches data visualization at the University of Miami. He's written numerous books on data visualization, most lately how charts lie. We asked him to comment on the topic of developments in data literacy and visualization education.",
      "gist": "Interview",
      "headline": "Alberto Cairo writes numerous books on data visualization and information design",
      "start": 190050,
      "end": 247632,
      "id": "ep_152_ch_1"
    },
    {
      "summary": " 2019 has been a very exciting year for many different reasons. There have been new books, new tools, new publications being launched, and new educational initiatives. One of the main aims of my career is to make visualization more visible and more accepted by the general public.",
      "gist": "New developments in the world of data visualization in 2019",
      "headline": "It is difficult to keep up with all the new developments in visualization these days",
      "start": 247816,
      "end": 411440,
      "id": "ep_152_ch_2"
    },
    {
      "summary": "We should also mention tools, new developments, new libraries, new programming languages. Tableau now allows you to do animation within the tool. And then open source tools, for example, row graphs. You can still contribute to this crowdsourcing campaign.",
      "gist": "Economic developments in the past decade",
      "headline": "We should also mention tools, new developments, new libraries, new programming languages",
      "start": 412100,
      "end": 516360,
      "id": "ep_152_ch_3"
    },
    {
      "summary": "I would like to emphasize books that contribute to this goal of popularizing and democratizing data visualization. I would also like to highlight, you know, podcasts. There's such a huge interest right now in Dataviz, and this is also reflected by the data visualization Society.",
      "gist": "Top 10 books in data visualization for 2019",
      "headline": "There have been tons of new data visualization books being published in 2019",
      "start": 516520,
      "end": 820004,
      "id": "ep_152_ch_4"
    },
    {
      "summary": "Amelia Wattenberger is a developer and designer focused on data visualization. 2019 was a fantastic year for Dataviz. One of the most exciting new developments is a new organization called the Data Visualization Society. There were tons of fantastic free resources created this year for learning and growing your data visualization skills.",
      "gist": "A taste of Dataviz in 2019",
      "headline": "Amelia Wattenberger: 2019 was a fantastic year for Dataviz",
      "start": 820172,
      "end": 1099674,
      "id": "ep_152_ch_5"
    },
    {
      "summary": "Andy Hoof is the person behind visualizing data. He's also been teaching data visualization for a long time. We asked him to focus explicitly on data tools or data visualization tools. Coming up next, Andy Kirk.",
      "gist": "Andy Kirk",
      "headline": "Next up is Andy Kirk, the person behind visualizing data",
      "start": 1099802,
      "end": 1135622,
      "id": "ep_152_ch_6"
    },
    {
      "summary": "Andy Kirk offers a reflection on some of the key developments in the area of Dataviz tools during 2019. The biggest news this year was probably the acquisition of Tableau software by Salesforce and also the acquired of Looker by Google. Kirk's unsolved challenges with regards to desktop and enterprise tools relates to how you seamlessly create outputs fit for multiple platforms.",
      "gist": "Dataviz: The Year in Data Visualization",
      "headline": "Andy Kirk offers a reflection on some of the key developments in Dataviz tools",
      "start": 1135646,
      "end": 1485186,
      "id": "ep_152_ch_7"
    },
    {
      "summary": "To me, 2019 didn't bring any major leaps forward in data journalism. I'm seeing a move away from data driven stories to more data informed or data inspired stories. Third trend is that data journalism teams invest in tools and in making their work reusable.",
      "gist": "What's happening in data journalism in 2019?",
      "headline": "To me, 2019 didn't bring any major leaps forward in data journalism",
      "start": 1485348,
      "end": 1676010,
      "id": "ep_152_ch_8"
    },
    {
      "summary": "Most newsrooms have now hired data journalists, but few have figured out what exactly to do with them. Newsrooms as a whole need to decide what level of data literacy they want to expect from everyone. Once this is clear, you will know whether you need expert data reporters or more of a data assistant.",
      "gist": "What Should Data Journalism's Role in Newsrooms?",
      "headline": "Most newsrooms have hired data journalists, but few have figured out roles",
      "start": 1676430,
      "end": 1829940,
      "id": "ep_152_ch_9"
    },
    {
      "summary": "Elijah Meeks: I think 2019 was a banner year for data visualization. He says data visualization is now starting to develop into its own full fledged area within industry. Meeks says it's becoming an equal partner to the other data disciplines in industry.",
      "gist": "Data Visualization's Rise in Industry",
      "headline": "Elijah Meeks says 2019 was a banner year for data visualization",
      "start": 1830640,
      "end": 2094700,
      "id": "ep_152_ch_10"
    },
    {
      "summary": "The other major theme of 2019 is the technical maturity of data visualization. We are now in the phase where we are more optimizing than trying to come up with crazy new stuff. I think it's going to dramatically increase the penetration ofdata visualization across professional and social areas.",
      "gist": "Analyzing the Future of Data Visualization",
      "headline": "Another major theme of 2019 is the technical maturity of data visualization",
      "start": 2095080,
      "end": 2249382,
      "id": "ep_152_ch_11"
    },
    {
      "summary": "Jen Christensen is senior graphics editor at Scientific American. She says scientists and full time data designers are speaking the same language. The biggest challenge is addressing the fact that data is messy and is an artifact of our own biases. Christensen: Scientists need to get better at nodding to those parameters directly when visualizing data for the public.",
      "gist": "Top 3 trends in data visualization in 2019",
      "headline": "Jen Christensen: Two biggest developments in data visualization relate to science communication",
      "start": 2249526,
      "end": 2543970,
      "id": "ep_152_ch_12"
    },
    {
      "summary": "Scientists and designers are sort of still converging. How do we deal with uncertainty? The things we measure, what do they actually mean? What is truth anyways? It's so important to talk about the foundations of a whole approach. It's scary in a way, but maybe it's also a sign that we are evolving.",
      "gist": "Jen Wilcox on the Need for Collaboration in Science",
      "headline": "Jen says scientists and designers are still converging on data science",
      "start": 2547390,
      "end": 2701740,
      "id": "ep_152_ch_13"
    },
    {
      "summary": "Jessica Hullman is a data visualization researcher at Northeastern University. She shares her highlights from 2019 from the standpoint of vis research. The idea of a multiverse has been promoted by statistical reformers. It's an area that we'll see more of.",
      "gist": "Data-visualization research in 2019",
      "headline": "Jessica Hullman is an assistant professor at Northwestern University in computer science",
      "start": 2702440,
      "end": 2917196,
      "id": "ep_152_ch_14"
    },
    {
      "summary": "In 2019, there's been several developments to this line of work that I think are exciting. Work modeling people's prior beliefs in visualization. In visualization research, we're increasingly trying to partner with areas like machine learning and AI.",
      "gist": "The Boundaries of Data Visualization in 2019",
      "headline": "Work modeling people's prior beliefs in visualization is exciting in 2019",
      "start": 2917268,
      "end": 3203530,
      "id": "ep_152_ch_15"
    },
    {
      "summary": "How do we reconcile and, and become more humanist in the way we use data? How do we recognize that visualizations are always kind of biased? And how do we account for the way in which we're perpetuating biases?",
      "gist": "Data visualization's humanist challenge",
      "headline": "Finally, an unsolved challenge. I don't know how to solve it, but I think it's important",
      "start": 3204030,
      "end": 3383096,
      "id": "ep_152_ch_16"
    },
    {
      "summary": "Laurie Klein is an associate professor in the department of English and quantitative theory and methods at Emory University. Let's hear what she has to say on the topic of data ethics.",
      "gist": "Next Up: Laurie Klein on Data Ethics",
      "headline": "Jessica Hullman discusses data feminism with Laurie Klein on data ethics",
      "start": 3383128,
      "end": 3431854,
      "id": "ep_152_ch_17"
    },
    {
      "summary": "Lauren Klein is an associate professor at Emory University in Atlanta. She says data science and data visualization are never neutral. Klein: The challenge is to ask how we might make different decisions that could help work towards justice.",
      "gist": "Data Ethics in the Learning of Data Science",
      "headline": "Lauren Klein talks about data ethics in data science and data visualization",
      "start": 3432022,
      "end": 3541070,
      "id": "ep_152_ch_18"
    },
    {
      "summary": "New book by Ruha Benjamin shows how data driven systems are amplifying inequality and preventing access to opportunity. ACM's fairness, accountability and transparency in machine learning group is rethinking their own assumptions. The accepted papers for the next conference will take place in 2020.",
      "gist": "Two major contributions to data ethics",
      "headline": "Doctor Ruha Benjamin's new book shows how algorithms are racist and discriminatory",
      "start": 3541410,
      "end": 3677530,
      "id": "ep_152_ch_19"
    },
    {
      "summary": "Kate Crawford and Vladan Joler's Anatomy of an AI system seeks to describe and diagram the human labor, data dependencies and material resources that contribute to the making of an Amazon echo. The diagram is one way to bring that exploitation to light again.",
      "gist": "An Anatomy of an Amazon Echo",
      "headline": "Kate Crawford and Vladan Joler's Anatomy of an AI system",
      "start": 3678550,
      "end": 3741052,
      "id": "ep_152_ch_20"
    },
    {
      "summary": "Enrico: The topic of biases, fairness, accountability, algorithm critique has become mainstream. One of the biggest challenges for me in this area is to find the right balance between acknowledging these issues and fixing them, but at the same time remaining excited about the endless possibilities.",
      "gist": "AI Decisions: The Right Balance",
      "headline": "Those are my three developments. Thanks so much for including me in your wrap up",
      "start": 3741236,
      "end": 3851066,
      "id": "ep_152_ch_21"
    },
    {
      "summary": "Marteen Lambrechts is an independent data visualization designer. He has been working on this idea of xenographics, which is about novel or even somewhat weird or innovative data visualizations. We asked him to comment exactly on xenographics.",
      "gist": "In the Elevator With Marteen Lambrechts",
      "headline": "We asked Marteen Lambrechts to comment on xenographics",
      "start": 3851258,
      "end": 3904640,
      "id": "ep_152_ch_22"
    },
    {
      "summary": "Martin Lambrechts is the author of Xenographics. He talks about three significant developments in the area of unusual data visualizations. Xenographics are mentioned in one of the nicest books on data visualization. But casino graphics are still very niche and mostly loved by people.",
      "gist": "The rise of unusual data visualizations",
      "headline": "Martin Lambrechts: Three significant developments in unusual data visualizations this year",
      "start": 3905180,
      "end": 4074638,
      "id": "ep_152_ch_23"
    },
    {
      "summary": "The most important unsolved issue in the area of unusual data visualization is data visualization in education. We also need accessible visualization tools. Raw graphs is an open source and free visualization tool in Italy. We're going to see some of these xenographics being hopefully adopted by several tools.",
      "gist": "The future of data visualization in education",
      "headline": "Third trend in data visualization is data visualization in education",
      "start": 4074814,
      "end": 4286840,
      "id": "ep_152_ch_24"
    },
    {
      "summary": "Next up, keeping database weird. Maral Pourkazemi is your design activist from London. We asked her to comment on interesting developments in diversity and inclusion.",
      "gist": "Interview",
      "headline": "We asked Maral Pourkazemi to comment on diversity and inclusion",
      "start": 4288760,
      "end": 4325490,
      "id": "ep_152_ch_25"
    },
    {
      "summary": "Data visualization expert speaks out on gender diversity in the field. Says women today feel more empowered than when she started her career. Calls on employers to make a conscious effort to hire more women. Also wants to make aerospace more attractive to non white people.",
      "gist": "On Diversity in the Data Visualization Field",
      "headline": "Zach Lieberman speaks on gender diversity in the data visualization field",
      "start": 4326310,
      "end": 4835854,
      "id": "ep_152_ch_26"
    },
    {
      "summary": "Our next guest presents a new local perspective. Mitchell Weitler is an associate professor at the Australian national university. He talks about data localism, the kind of renewed attention to local concerns and perspectives in data practice.",
      "gist": "Data localism: New local perspectives",
      "headline": "Mitchell Weitler discusses data localism and local projects",
      "start": 4835982,
      "end": 5008810,
      "id": "ep_152_ch_27"
    },
    {
      "summary": "The third project for me that's really strong, and it's not a southern hemisphere project, is from Tega Brain. Shows us how the local can kind of speak back to this very abstracted kind of global networks. There are prospects for a kind of more positive localism coming out of this practice.",
      "gist": "Localism in Visualisation",
      "headline": "I think there are prospects for a resurgent localism in visualization practice",
      "start": 5009430,
      "end": 5231440,
      "id": "ep_152_ch_28"
    },
    {
      "summary": "Next, we have another good friend of ours. We have Paolo Ciuccarelli, an Italian here. And we asked him to comment specifically, surprise, surprise. On design.",
      "gist": "Paolo Ciuccarelli on Design at Dataviz",
      "headline": "Next, we have another good friend of ours. We have Paolo Ciuccarelli on design",
      "start": 5232620,
      "end": 5277130,
      "id": "ep_152_ch_29"
    },
    {
      "summary": "Paolo Ciuccarelli: The first significant development I see as a designer is a genuine interest in design. He sees a growing interest for the humanities, both as a field of study and a source of inspiration for a different way to look at data. This cultural shift towards the human can only get stronger thanks to big data.",
      "gist": "Paolo Ciuccarelli on Big Data and Design",
      "headline": "Paolo Ciuccarelli sees growing interest in design around big data",
      "start": 5277550,
      "end": 5364194,
      "id": "ep_152_ch_30"
    },
    {
      "summary": "The second development I see is automated chart production. A related issue is education in data visualization pedagogy. I see this as a measure of the interest and a very promising concrete sign of support for a culture of open and accessible resources.",
      "gist": "Three developments in the world of data visualization",
      "headline": "The second development I see, and I'm actually following it very closely, is automated chart production",
      "start": 5364322,
      "end": 5513300,
      "id": "ep_152_ch_31"
    },
    {
      "summary": "The key in design is choosing. Making the most tedious aspects of design more automated. How are we supposed to interact with smart systems? That's a huge topic for the next decade.",
      "gist": "In the Elevator With Artefact",
      "headline": "I was super interested to hear him mention automating design",
      "start": 5513880,
      "end": 5652002,
      "id": "ep_152_ch_32"
    },
    {
      "summary": "Thomas Dahm talks to Mauritan Enrico about how the data visualization conference world is developing. Third trend is that design tools and design agencies set up their own one or multiple day conferences. Finding the right spot sponsors is becoming harder and harder every year.",
      "gist": "Dataviz Conference World View",
      "headline": "Three significant developments in data visualization conferences expected in 2019, says Enrico",
      "start": 5652186,
      "end": 6109212,
      "id": "ep_152_ch_33"
    },
    {
      "summary": "It's been a good year. But striking that people keep mentioning the same things. These are probably some of the major things happening that happened in this year. So that's great.",
      "gist": "A Year in the Life",
      "headline": "It's striking that people keep mentioning the same things this year",
      "start": 6109276,
      "end": 6156150,
      "id": "ep_152_ch_34"
    },
    {
      "summary": "This year passed by so quickly, it seems like I can clearly remember when we recorded our previews end of the year episode. Sandra joined our team and she's been so much help and I'm super happy that she's helping us. Looking forward to next year.",
      "gist": "A Year in the Life",
      "headline": "This year passed by so quickly, it seems like I can clearly remember",
      "start": 6157370,
      "end": 6467190,
      "id": "ep_152_ch_35"
    },
    {
      "summary": "This show is crowdfunded and you can support us on patreon@patreon. com Datastories. We are on Twitter, Facebook and Instagram, so follow us there for the latest updates. Let us know if you want to suggest a way to improve the show.",
      "gist": "Data Stories",
      "headline": "This show is crowdfunded and you can support us on patreon",
      "start": 6471650,
      "end": 6553290,
      "id": "ep_152_ch_36"
    }
  ],
  "disfluencies": false,
  "entity_detection": false,
  "sentiment_analysis": false,
  "sentiment_analysis_results": null,
  "entities": null,
  "speakers_expected": null,
  "summary": null,
  "custom_topics_results": null,
  "episode_num": 152,
  "episode_metadata": {
    "speakers": [
      "Various"
    ],
    "WPid": "1496",
    "url": "https://datastori.es/podlove/file/6292/s/feed/c/mp3/152-year-in-review.mp3",
    "episode_title": "Year in Review 2019"
  }
}