{
  "id": "4f64fc7c-6291-4ec5-8d88-7b7e4060e557",
  "language_model": "assemblyai_default",
  "acoustic_model": "assemblyai_default",
  "language_code": "en_us",
  "status": "completed",
  "audio_url": "https://datastori.es/podlove/file/6654/s/feed/c/mp3/159-viz-agencies-dataveyes-and-accurat.mp3",
  "utterances": [
    {
      "end": 4730,
      "speaker": "Gabriele Rossi",
      "start": 160,
      "text": "Three months ago, the number of engineers at accurate surpassed the number of designers.",
      "id": "ep_159_ut_0"
    },
    {
      "end": 34320,
      "speaker": "Enrico Bertini",
      "start": 24070,
      "text": "Hi, everyone. Welcome to a new episode of data stories. My name is Enrico Bertini and I am a professor at NYU in New York City, where I teach and do research in data visualization.",
      "id": "ep_159_ut_1"
    },
    {
      "end": 44400,
      "speaker": "Moritz Stefaner",
      "start": 34440,
      "text": "Yeah, and I'm Moritz Stefaner. I'm an independent designer of data visualizations. In fact, I work as a self employed truth and beauty operator out of my office here in the countryside in the north of Germany.",
      "id": "ep_159_ut_2"
    },
    {
      "end": 56780,
      "speaker": "Enrico Bertini",
      "start": 44480,
      "text": "And on this podcast we talk about data visualization, analysis, and more generally the role data plays in our lives. And usually we do that together with a guest, or maybe sometime even two or three guests.",
      "id": "ep_159_ut_3"
    },
    {
      "end": 82236,
      "speaker": "Moritz Stefaner",
      "start": 58480,
      "text": "That's right. And we have actually two guests today. But before we start, just a quick note. Our podcast is listener supported. That means there are no ads, which is great. We think that also means if you do enjoy the show, you could consider supporting us. You can do that either with recurring payments on Patreon.com Datastories, or you can also send us a one time donation on Paypal me Datastories.",
      "id": "ep_159_ut_4"
    },
    {
      "end": 108120,
      "speaker": "Enrico Bertini",
      "start": 82388,
      "text": "So I think we're ready to start. This episode is a follow up of our previous episode, and we are now focusing on a topic that I think we neglected for some time, which is about data visualization agencies. And today we have two people from two different agencies. We have Caroline Goulard from Dataveyes. Hi, Caroline.",
      "id": "ep_159_ut_5"
    },
    {
      "end": 111592,
      "speaker": "Caroline Goulard",
      "start": 108200,
      "text": "Hi, everyone. Thank you, Moritz. Thank you, Enrico, for the invitation.",
      "id": "ep_159_ut_6"
    },
    {
      "end": 112472,
      "speaker": "Moritz Stefaner",
      "start": 111696,
      "text": "Thanks for coming.",
      "id": "ep_159_ut_7"
    },
    {
      "end": 117872,
      "speaker": "Enrico Bertini",
      "start": 112576,
      "text": "Thanks for coming. And then we have Gabriele Rossi from accurate. Hi, Gabriele.",
      "id": "ep_159_ut_8"
    },
    {
      "end": 120776,
      "speaker": "Gabriele Rossi",
      "start": 117976,
      "text": "Hello. Hello. Thank you, Enrico. Thank you, Moritz.",
      "id": "ep_159_ut_9"
    },
    {
      "end": 126120,
      "speaker": "Enrico Bertini",
      "start": 120888,
      "text": "When I say Gabriele, it's hard to say it in a pronunciation that is not Italian.",
      "id": "ep_159_ut_10"
    },
    {
      "end": 128188,
      "speaker": "Gabriele Rossi",
      "start": 126280,
      "text": "Yeah, Gabriele.",
      "id": "ep_159_ut_11"
    },
    {
      "end": 148100,
      "speaker": "Enrico Bertini",
      "start": 128364,
      "text": "Gabriele. So, can you briefly introduce yourself and give us a little bit of a background? And in this case, also can you briefly introduce also your company? We want to know a little bit about what kind of company you have and what you do. Caroline, you want to start?",
      "id": "ep_159_ut_12"
    },
    {
      "end": 222350,
      "speaker": "Caroline Goulard",
      "start": 148220,
      "text": "Yeah, sure. So, I'm one of the co founders of Dataveyes with Léo Gourven and Benoit Vidal. So, Dataveyes, we are a french studio, a small agency of eight people, and we are specialized in data visualization. We like to say that our core activity is human data interactions, which includes data visualization and more generally everything that help users understand the data and do something useful with it. At Dataveyes, I share my time between management tasks, running the studio and doing data visualization. Part of the conception team inside Dataveyes, I'm doing user research, data exploration, data storytelling, information architecture and so I was a student when we started Dataveyes, so I've never really worked anywhere else. I was studying data journalism at that time, more broadly, social science, information and communication sciences. And so, yes, I've always been a mathematics lover. And so data visualization was the perfect way for me to combine my two patients, math and information. So, yes, that's to introduce. That's all.",
      "id": "ep_159_ut_13"
    },
    {
      "end": 226130,
      "speaker": "Enrico Bertini",
      "start": 224130,
      "text": "That's perfect. Gabriele.",
      "id": "ep_159_ut_14"
    },
    {
      "end": 324110,
      "speaker": "Gabriele Rossi",
      "start": 226290,
      "text": "Yeah. And I'm Gabriele Rossi. I'm Italian, as we previously noted, and I'm a recovering designer. I like to say in the sense that I majored in design. I worked as a designer in the past, but I actually never worked as a designer at Accurat, the company that I co founded with Giorgia Lupi, Simone Cuadre, and Paolo La Bozzetta, who are my partners. And, yeah, it just happened. I was in a transitioning phase, in a transition phase in my career after I realized that I wasn't as good as a designer as I thought I was and that I liked the idea of designing a company more than designing projects. And just like a joke, we were a designer myself and an architect, a sociologist and an economist walked into a bar. Exactly. Exactly. Just like a joke. And what brought us together was, like, design and numbers, basically, and an interest for qualitative data. So that's how it came together. And we're now a company that has been founded in Milan, in Italy, and we are 40 people between our main office in Milan, where most of the design team is, and New York, where I live, and where we opened a few years ago, a small commercial outpost to work with our American clients. And that's it.",
      "id": "ep_159_ut_15"
    },
    {
      "end": 333078,
      "speaker": "Moritz Stefaner",
      "start": 324650,
      "text": "Yeah. It's quite a unique setup with the two different time zones and the split team. It's amazing how it has worked out. Right?",
      "id": "ep_159_ut_16"
    },
    {
      "end": 333830,
      "speaker": "Enrico Bertini",
      "start": 333234,
      "text": "Yeah.",
      "id": "ep_159_ut_17"
    },
    {
      "end": 337730,
      "speaker": "Gabriele Rossi",
      "start": 333950,
      "text": "I'm still surprised it works, but somehow it works.",
      "id": "ep_159_ut_18"
    },
    {
      "end": 346510,
      "speaker": "Enrico Bertini",
      "start": 338950,
      "text": "I believe, Gabriele, now that you're talking, I believe that once we recorded a data stories episode in your office in New York.",
      "id": "ep_159_ut_19"
    },
    {
      "end": 346982,
      "speaker": "Gabriele Rossi",
      "start": 346630,
      "text": "Yes.",
      "id": "ep_159_ut_20"
    },
    {
      "end": 348126,
      "speaker": "Enrico Bertini",
      "start": 347046,
      "text": "Many years ago.",
      "id": "ep_159_ut_21"
    },
    {
      "end": 353254,
      "speaker": "Moritz Stefaner",
      "start": 348198,
      "text": "That is true. We should remember that more. That's a few years ago. Yeah. With Georgia, of course.",
      "id": "ep_159_ut_22"
    },
    {
      "end": 354478,
      "speaker": "Gabriele Rossi",
      "start": 353382,
      "text": "Yeah, yeah, I remember.",
      "id": "ep_159_ut_23"
    },
    {
      "end": 355142,
      "speaker": "Moritz Stefaner",
      "start": 354614,
      "text": "Yeah.",
      "id": "ep_159_ut_24"
    },
    {
      "end": 377226,
      "speaker": "Enrico Bertini",
      "start": 355246,
      "text": "So I think what we want to start with, I think it's always hard to summarize exactly all the projects that you work on, what type of project you do. So we were wondering if you can talk about the quintessential project of the type of project that you have done or you normally do in your company. Caroline, maybe you want to start.",
      "id": "ep_159_ut_25"
    },
    {
      "end": 623752,
      "speaker": "Caroline Goulard",
      "start": 377378,
      "text": "Yes. That's always difficult to pick up one project. None of our project is perfect. So maybe I can take just two short to illustrate the different sides of what we do. The first one I can choose is a project for Leboncoin, Leboncoin. It's the number one platform for sales between private individuals in France, but it's also one of the biggest actors, the biggest actor for classified ads on car markets and real estate in France. And so they have also a lot of professional users, and they asked us to design and to develop the dashboard for their professional accounts. And their initial idea was to give to these professional users some information about their ads and their ads performance. For example, number of views, number of click, so these kind of things. And so we started this project, and when we were doing our user research, we discovered that the real final users, they were not at all interested about this kind of thing. They were not at all interested about this kind of KPI's, because they were salesmen in some small structures, for example, small car dealerships, or they were garage owners, or they were assistants or secretaries in very small real estate offices. And all those people, sometimes they had some very old computers, and they don't have time to follow KPI's. They are not looking to this kind of thing. They don't like reporting, they are not interesting about checking if they are good or not at Leboncoin every day. And they just want to sell. They want to sell their cars, they want to sell their real estate. So the most interesting part of this project was the user research part, the user centric approach, because at the end, we transformed the initial idea of this performance monitoring dashboard into a dashboard dedicated to ads that don't work on Leboncoin, because, in fact, we were working closely with the data science team, and we collaborated with them to be able to identify ads that are less performing than others for the same kind of good. For example, ads that have less views or that have less clicks than other ads for the same kind of flat in the same region, or the same kind of car with the same model and so on. And this was much more interesting for our final users, because an ad that is not seen on Leboncoin, it's a car that may stay in their garage or flat or house that will stay longer. And this is really concrete stuff for them because it's lots of business opportunities. And so when we tested this idea with the final users, they love it. And so the visualization part of this project, it was really, really simple. It was not interesting at all. But I like this project because it illustrates an important part of our job, which is to find the right information inside the data to make something useful and something that as a real use value. And maybe the second project I would like to mention, it's a project for Michelin in France, and it's exactly the opposite, because in this case, the data visualization was really key from the beginning to find what's interesting inside the data set. And in fact, Michelin gave us an anonymized data set with the daily journeys of 50,000 car drivers. Those drivers were equipped with the plugs inside their car, and we get one year of data. And the id for Michelin was, yes, let's do something interesting with that. We don't really know what's interesting inside this data set, but if you try to visualize it, I'm sure you will find something cool with that.",
      "id": "ep_159_ut_26"
    },
    {
      "end": 625672,
      "speaker": "Moritz Stefaner",
      "start": 623856,
      "text": "The typical wow me brief.",
      "id": "ep_159_ut_27"
    },
    {
      "end": 630614,
      "speaker": "Caroline Goulard",
      "start": 625776,
      "text": "Yeah, exactly. Yes.",
      "id": "ep_159_ut_28"
    },
    {
      "end": 634206,
      "speaker": "Moritz Stefaner",
      "start": 630742,
      "text": "Did it work out? Because sometimes these projects can be difficult.",
      "id": "ep_159_ut_29"
    },
    {
      "end": 724180,
      "speaker": "Caroline Goulard",
      "start": 634358,
      "text": "Yeah, but at the end, yes, the interesting part is not really the result, but more the process, as we say. The idea was the dataset was really, really huge, so it was naturally possible to look at the data first and define what we want to do with that. So we were doing prototypes, data visualization prototypes, my prototypes, with the real data from the beginning of the project. And we have been working two months on the project, and each week we were trying something different, testing a new prototype, a new visualization. And at the end, we managed to deliver something that was functional, because little by little, we came to something interesting. And at the end, the final prototype, it was quite helpful to understand mobility pattern. And Michelin was finding good to discuss with, with local authorities or cities to discuss about mobility pattern. And so this illustrates the other part of what we do, which is using data visualization as a knowledge tool to find interesting patterns, to find some new information and make everyone able to make it their own, not only developers or not only experts. And so, yes, that's the two side of what we do, finding the right information and trying to discover something new with the data, something useful.",
      "id": "ep_159_ut_30"
    },
    {
      "end": 745660,
      "speaker": "Moritz Stefaner",
      "start": 724720,
      "text": "Yeah, I love how you're not stopping at just making it look good or doing the first thing the client has in band, but it seems like you're really pushing to getting the best out of a project. So that's awesome. Gabriele, how about you and Accurat? Is there like a typical accurate project? I know you have a lot going on.",
      "id": "ep_159_ut_31"
    },
    {
      "end": 769350,
      "speaker": "Gabriele Rossi",
      "start": 747160,
      "text": "I'd say there are families of projects, because we started mostly doing data visualization, of course, but now I think it's limiting to say that we do data visualization, I'd say that we mostly do like data driven design or however you or design driven data, depending on the perspective you take.",
      "id": "ep_159_ut_32"
    },
    {
      "end": 770870,
      "speaker": "Moritz Stefaner",
      "start": 769390,
      "text": "Depending on who drives whom.",
      "id": "ep_159_ut_33"
    },
    {
      "end": 829516,
      "speaker": "Gabriele Rossi",
      "start": 770990,
      "text": "Exactly. And we end up in very different situations where, like, I'd say the common denominator is always, they have to do with design, they have to do with data. And I'd say all of our projects can be divided into two main families. So communication and experience design projects and more functional work and business oriented tools and solutions. So, like, a few examples of the first family could be all of activities related to reporting. For example, we work extensively with the World Economic Forum, United Nations, World bank, doing static, interactive reporting for them. But also, for example, we did a project for Starbucks that opened their first roastery in Milan. That is a very particular story.",
      "id": "ep_159_ut_34"
    },
    {
      "end": 834044,
      "speaker": "Moritz Stefaner",
      "start": 829548,
      "text": "Quite a political issue, right, to like to have an American coffee company in Italy.",
      "id": "ep_159_ut_35"
    },
    {
      "end": 881908,
      "speaker": "Gabriele Rossi",
      "start": 834092,
      "text": "Yeah. And not just that. I mean, the story says that Howard Schultz, the founder, was inspired to create a place like Starbucks when he visited Milan. Yeah. He was really afraid of opening there because, of course, potential criticism. But also he wanted to give an homage, like a homage to me, to Milan. And so what we did for them was to create like a sculptural installation inside the rosary, where we created a wall that is like 30 meters wide, like 90ft wide, that it's all made of like brass panels that have been etched and carved according to data about Starbucks. So three overlaying, just your run of.",
      "id": "ep_159_ut_36"
    },
    {
      "end": 883716,
      "speaker": "Moritz Stefaner",
      "start": 881924,
      "text": "The mill database project, right?",
      "id": "ep_159_ut_37"
    },
    {
      "end": 889316,
      "speaker": "Gabriele Rossi",
      "start": 883788,
      "text": "Yeah, exactly. Carving data in bronze. Carving in brass, yeah, as you normally.",
      "id": "ep_159_ut_38"
    },
    {
      "end": 890280,
      "speaker": "Caroline Goulard",
      "start": 889388,
      "text": "Exactly.",
      "id": "ep_159_ut_39"
    },
    {
      "end": 892428,
      "speaker": "Moritz Stefaner",
      "start": 890940,
      "text": "Again, really?",
      "id": "ep_159_ut_40"
    },
    {
      "end": 895520,
      "speaker": "Gabriele Rossi",
      "start": 892604,
      "text": "Yeah. Bread and butter.",
      "id": "ep_159_ut_41"
    },
    {
      "end": 916656,
      "speaker": "Moritz Stefaner",
      "start": 896020,
      "text": "Exactly. Yeah, yeah, yeah. But I think what many people don't know, because also Georgia Lupi's work is so widely known, and rightfully so, but there's also a lot of, like, tools and all kinds of projects that Accurat has put out over the years, and it's really the, like, database, the full spectrum of what data visualization can be. And I think that's quite cool.",
      "id": "ep_159_ut_42"
    },
    {
      "end": 1067400,
      "speaker": "Gabriele Rossi",
      "start": 916808,
      "text": "Yeah. And it ranges from like this, physical installations and digital projects, to actually business oriented work like we have been building for the past three years. Cloud based data science platform for a mortgage data provider. So it's basically based on the idea of like a Python notebook. It's like a solution that helps them sell their data in a cloud based environment. Instead of just shipping a hard drive with their data on, they're providing access in real time to the data and the tools that data scientists need to work with this data so to load different models, play with them. And we have been building this platform for the past three years, we're still improving it, and it's very different from other types of projects because we have a longstanding relationship with the client where our teams are integrated. So our design and engineer team works with their engineering team and we have been working remotely with them for the past three years building this incredibly big platform. That was a heavy lift on the technical side. And of course it includes data visualization that we designed. But data visualization is just like the tip of the iceberg in this case. Or for example, one of our biggest clients is IBM, and we've been working with them for the past four years consulting on like creating Dataviz branding guidelines for them. So we're responsible to write, create, maintain and keep updated this data visualization guidelines for the entire company. So for all of IBM Worldwide, and we are now integrated with their team, working with their designers and engineers in creating both guidelines rules, but also samples, examples, snippets of code and even actual JavaScript visualizations that are used in their libraries. So it's, the range of projects is pretty wide and different. And also now I think an interesting aspect of our company is that I think three months ago the number of engineers at accurate surpassed the number of designers. There was this huge shift. We started just designing and now we're basically a software company.",
      "id": "ep_159_ut_43"
    },
    {
      "end": 1117770,
      "speaker": "Moritz Stefaner",
      "start": 1068460,
      "text": "That's something I wanted to ask, because on the one hand you have all these, both of you, these very visible, experimental, crazy, let's say projects. And then at the same time, if you want to run an agency, or also if you want to bring maybe real value to some clients, you also need to think about tools and ongoing relationships and more, maybe the bread and butter type projects, right? And I was wondering, do you think about it this way or what's the division like? Maybe between these more crazy and the more solid projects? Do you do a lot of first experimentation, maybe on yourself, and then later try to find a client, maybe for more experimental projects. How do you balance this innovation versus stability part? Caroline maybe, yeah.",
      "id": "ep_159_ut_44"
    },
    {
      "end": 1142262,
      "speaker": "Caroline Goulard",
      "start": 1120110,
      "text": "I would say that about all of our client projects there is an experimentation part. It's quite rare that a project, there is nothing new, nothing complicated. So most part of the time we are doing a bit of experimentation. In each client's project you always try.",
      "id": "ep_159_ut_45"
    },
    {
      "end": 1145350,
      "speaker": "Moritz Stefaner",
      "start": 1142286,
      "text": "To innovate, never tick the boxes and move on, but just.",
      "id": "ep_159_ut_46"
    },
    {
      "end": 1177540,
      "speaker": "Caroline Goulard",
      "start": 1145430,
      "text": "Yeah, but it's also reason why a client come to us, because if it, if it will be simple, they will find somewhere else. To be realistic, I think doing a project with us at Dataveyes, it's more expensive than doing the project with a more classic agency. So if they come to us, it's really because there is something too complicated or that. That needs more expertise in data visualization. They can't find somewhere else in France.",
      "id": "ep_159_ut_47"
    },
    {
      "end": 1187380,
      "speaker": "Moritz Stefaner",
      "start": 1179240,
      "text": "So the clients that come to, you know already the type of work you like to do, and they say, we need data wise, otherwise this won't work.",
      "id": "ep_159_ut_48"
    },
    {
      "end": 1245200,
      "speaker": "Caroline Goulard",
      "start": 1187680,
      "text": "Yes. And although if they are ready to pay for this kind of work, which has a cost, that means that they're ready for experimentation. That's a bit too optimistic. It's not that easy. And sometimes, yes, the project is not really interesting, or the data is not really interesting, or not good enough, or some clients are. The project is not that good at the end. But yes, there is always experimentation part, and also the difference inside database. It's not between interesting or experiment project for clients and more classic project for clients, but between client work and internal projects. Because we dedicate half a day per week for everyone in the team for internal experimentation. So everyone.",
      "id": "ep_159_ut_49"
    },
    {
      "end": 1256420,
      "speaker": "Moritz Stefaner",
      "start": 1245780,
      "text": "I should do that? Yeah, it's a good idea. Is it always the same half day, like Friday afternoon, or like Tuesday morning or something like this?",
      "id": "ep_159_ut_50"
    },
    {
      "end": 1258920,
      "speaker": "Caroline Goulard",
      "start": 1256500,
      "text": "Yeah, Monday. Monday morning. Cool.",
      "id": "ep_159_ut_51"
    },
    {
      "end": 1261250,
      "speaker": "Moritz Stefaner",
      "start": 1259310,
      "text": "That's a perfect start for the week.",
      "id": "ep_159_ut_52"
    },
    {
      "end": 1269982,
      "speaker": "Enrico Bertini",
      "start": 1262310,
      "text": "Monday is a good choice. Normally it's either Monday or Friday. Right? But Monday I think it's a better choice.",
      "id": "ep_159_ut_53"
    },
    {
      "end": 1281690,
      "speaker": "Moritz Stefaner",
      "start": 1270166,
      "text": "I also have a routine that I have zero expectations for myself on a Monday morning, especially, like, you know, it's totally fine if I do nothing. It's also very relaxing.",
      "id": "ep_159_ut_54"
    },
    {
      "end": 1347806,
      "speaker": "Caroline Goulard",
      "start": 1283190,
      "text": "Yeah. And yes, that's a very good system we found, because it's during this half day, anyone can work on an internal project of its choice. Or also people are learning things, making some learning formation. And at the end, this is the way we can try some new technologies, develop some internal projects that give us visibility. Because most part of our clients work at the moment, it's confidential, so we can show much of what we do. Project. It's really a good thing for communication material, and also it's a way to test something we cannot sell for the moment, and to stay up to date with the technologies. So it's not at all something we give to the team to play or just to relax, or to do something more interesting. Alpha day. It's really something that is an investment for the future of the studio and which really work really well.",
      "id": "ep_159_ut_55"
    },
    {
      "end": 1348418,
      "speaker": "Moritz Stefaner",
      "start": 1347948,
      "text": "Nice.",
      "id": "ep_159_ut_56"
    },
    {
      "end": 1486730,
      "speaker": "Gabriele Rossi",
      "start": 1348514,
      "text": "Yeah, I absolutely agree with what Caroline said. And yeah, every project has its own component of innovation, because ultimately, if a client ends up working with us, it's because there's a problem that they cannot solve without data visualization, specific expertise, or an expertise in working with large amounts of data, in creating digital experiences that leverage this data. So there's. We're often tasked with problems that couldn't be solved by the client. So I'd say there's a component of innovation and experimentation in every project. And I agree it's valid for most of the projects. Sometimes it doesn't happen. Usually the relationship doesn't work when there is little space for experimentation, because it means that we're not needed to solve the problem. So it becomes a commodity, basically. And so these projects usually either don't happen because if it's something that doesn't require highly trained staff to do it, probably not going to be paid much. And also, if the client doesn't value the expertise of our stuff, probably the relationship is not going to work ultimately. So even for the most business oriented work, we actually do a lot of experimentation, sometimes even more, because it's a deeper level of experimentation, because it's not just on the surface on how you present information, but it has a lot to do with how you solve structural issues in dealing with information. So, like information density and working with interfaces on multiple devices, with visual information, with multiples, like input interfaces and different screen ratios. So, yeah, I think it's a common denominator of our work is the fact that we always have to do something different from the project before.",
      "id": "ep_159_ut_57"
    },
    {
      "end": 1517110,
      "speaker": "Moritz Stefaner",
      "start": 1488030,
      "text": "And is that easy for clients to understand, or do you find yourself explaining the process a lot and having to explain a lot that you can't really make a mock up before you have looked at the data in detail and all these other truisms of data driven design, what's your experience? Do you have to educate your clients a lot, or is by now everybody pretty much on board with an open experience data exploratory design process?",
      "id": "ep_159_ut_58"
    },
    {
      "end": 1560966,
      "speaker": "Caroline Goulard",
      "start": 1517970,
      "text": "We have to explain a lot, and we explain a lot at the beginning. We try to be as clear as possible at the start of the project, so there is no surprise. But what's cool is that when they come to us, they need expertise, so they rely on us, and they don't try to push their methodology, or they just accept the way we want to work, as long as it gives them enough reassurance. Because sometimes they have to show some steps to their boss, or they have to. How will it look?",
      "id": "ep_159_ut_59"
    },
    {
      "end": 1564130,
      "speaker": "Moritz Stefaner",
      "start": 1561158,
      "text": "Yeah. What is it that we are paying so much for?",
      "id": "ep_159_ut_60"
    },
    {
      "end": 1650512,
      "speaker": "Caroline Goulard",
      "start": 1566730,
      "text": "As long as it's clear at the beginning what they will get, at which period of the project, how we will work. After that, they are able to agree or not, to work with us or not. And if they want to work with us, it's going to be this way. But it's true that you need to give lots of information, lots of reassuring them at any part of the the project, showing them stuff. And also because it's a good way to onboard the client inside the complexity of the project, and other way at the end, it's going to be difficult for him to evaluate what you have done if you don't explain to him all along the project what you are doing, why it's complex, why it doesn't work, and things like that. So usually I like this kind of relationship with the client because it's nothing client giving order, but it's more a relation where you have to explain him a lot, train him on something. So the client is learning something new with you and you are working with him in a trust relationship. And it's the best way to work with clients and doing data visualization, we are more able to work like that than if we were doing something more classic.",
      "id": "ep_159_ut_61"
    },
    {
      "end": 1658580,
      "speaker": "Enrico Bertini",
      "start": 1650676,
      "text": "Yeah. I think an advantage of Dataviz is that at least you can probably even early on start showing something, right?",
      "id": "ep_159_ut_62"
    },
    {
      "end": 1672544,
      "speaker": "Moritz Stefaner",
      "start": 1660040,
      "text": "Yeah. But sometimes then it looks ugly, it comes out of Tableau or r or something, and then people are confused and they get afraid. So you do have to explain a bit what things are in general.",
      "id": "ep_159_ut_63"
    },
    {
      "end": 1718694,
      "speaker": "Gabriele Rossi",
      "start": 1672632,
      "text": "It's also why I think we work better with long standing clients, because after a while, like, the relationship evolves and as soon as we are recognized as the experts and you need to show it, you need to prove it with your work. But as soon as we develop a relationship that allows us to do what we think it's best for the project and where the client trusts our method, then it's when we really get to interesting results, because we're able to forget about showing the client that we're working in the right way, but just it's all about focusing on providing value.",
      "id": "ep_159_ut_64"
    },
    {
      "end": 1772604,
      "speaker": "Enrico Bertini",
      "start": 1718822,
      "text": "Yeah. So one thing we wanted to ask you is you are very valuable representatives of those agencies who've been around for a long time. And how do you think the database field has changed over the years? And yeah, before starting the interview with you, I was thinking, wow, when we started even the podcast, very few people were around. I think actually one of the reasons why me and Moritz got together the first time was like I was wondering, oh, there is such a thing as a Dataviz freelancer. That's so interesting. So a lot has changed. So I was wondering if you could share your perspective on what happened over the years.",
      "id": "ep_159_ut_65"
    },
    {
      "end": 1944720,
      "speaker": "Caroline Goulard",
      "start": 1772692,
      "text": "Yeah, the kind of project we are working on really changed a lot along these nine past years. At the beginning, we were doing a communication project a lot. So data storytelling projects for brands or for organization, who were looking for something attractive, information experience that can be attractive. And then we have been doing less and less communication projects and more and more business oriented tools for big companies who have massive data sets, who have data challenges. They need business tools, they need to work better with that data. And we have been doing more and more tools like that. And nowadays, since I would say one year and half, more and more, we are working with smaller companies. Their core business is a product, most part of the time, that relies on data. And those companies, they already have some designers and some developers to build the product, to build their software, but they do not have any expertise in data visualization or in data design. And they don't know where to find this expertise. They can't hire people with this expertise because there are too few and they need to build their product with us. And so we are working with them. We are joining their team for three months or six months, and we build the product with them. And after that we leave and we train their team at the same time. And this is something new. And maybe this is something interesting, because in my opinion, in the future, any product or any new application software will be dealing with data in one way or another, because it's like the new way. It's not the new way, but it's the way information will be encoded. Maybe the expertise we have, any people working on applications or softwares will need to get this expertise for the future, to be able to deal with our new information overload environment and so on. So maybe this is just the preliminary step for a world where any designer will be a data visualization designer, or at least a human data interaction designer. And maybe we are just at the beginning and we are making the transition. But yeah, this is quite interesting to see that from communication to business tools, to building a product with people.",
      "id": "ep_159_ut_66"
    },
    {
      "end": 2121642,
      "speaker": "Gabriele Rossi",
      "start": 1946860,
      "text": "Yeah, I think it's also like the future will probably be shaped around two of the key components I think agencies have is that, that they integrate a multidisciplinary team, often so people that have been working together for a while, but that have different expertise, but know how to combine these expertise and also the exposure to multiple projects, that's something our clients value a lot, because you can start a data visualization team in your company, but it will most likely be focused on one specific task or a set of tasks. And sometimes bringing in someone who has seen different types of visualization, who has dealt with that specific situation, or with similar, but slightly different situations that provide different challenges can bring an outside perspective that it's very useful for the company. What we've seen during our evolution is that initially we were hired for anything that had to do with data visualization. As Caroline said, like a lot of storytelling projects, one off visualizations, the single report, a single image or a poster, or a single interactive visualization. More and more I see that this like part of work now is being developed internally within organizations, and what's left is the very high end stuff. So the very complex problems that need people who have been working on similar challenges for many years and need integrated teams with different skills that range from data scientists to the experience designer, the front end developer developer that all have an experience with data, but also, interestingly, a lot of very basic work that now it's done manually, that needs to be automated in some way, that needs to scale. And this requires sometimes the expertise of someone from the outside who can help guide the process of scaling. If you hire one designer, this designer can output ten data visualizations a day. But what if you need 10,000 a day? How can you set up a system that allows you to replicate a very simple job at scale? And I think that's also an aspect. So the very low and the very high end of the spectrum remains. Probably what's in the middle will be developed internally by organizations. And to create the teams that develop this work, you need training. And this is also something that is growing for us. We do a lot of training of internal resources. We help organizations hire people and set up teams, so we do interviews for them. We help them pick the right people, form the right teams who will ultimately end up working with us. And it's evolving.",
      "id": "ep_159_ut_67"
    },
    {
      "end": 2130110,
      "speaker": "Moritz Stefaner",
      "start": 2121706,
      "text": "It's so interesting because you think you're thinking about color scales or chart types, but then you find yourself becoming a digital transformation advisor.",
      "id": "ep_159_ut_68"
    },
    {
      "end": 2160512,
      "speaker": "Gabriele Rossi",
      "start": 2131130,
      "text": "And sometimes problems have been already solved. Like you want to start your data visualization guidelines in your company, you hire a new designer, and this designer needs to come up with ideas for colors, for stuff that has already been sold and that we have sold somewhere else so we can be quicker. So it doesn't make sense that the designer or engineer you hired focuses on that because we can be more effective. Having seen multiple of those projects I'd.",
      "id": "ep_159_ut_69"
    },
    {
      "end": 2213450,
      "speaker": "Moritz Stefaner",
      "start": 2160536,
      "text": "Like to ask a bit about the scaling part, because this is something I'm super curious about. So I think a lot of the work we see, like prominent data visualization projects, often are done by individuals or, like, small, tight knit teams, maybe also, like, data wise. You guys have been working together for many years in a very similar constellation. You know each other very well. But then we also have companies like accurate or clever Franke, which scale beyond the magical five to seven people. And how do you manage the scaling process, and how do you put your teams together? How do you make sure knowledge is also transferred across, I don't know, departments or now that if you hire a lot of engineers, how do you keep things, as you say, interdisciplinary and unified and connected?",
      "id": "ep_159_ut_70"
    },
    {
      "end": 2220766,
      "speaker": "Gabriele Rossi",
      "start": 2213750,
      "text": "Yeah, you have to force it, because, in a way. Yeah, it doesn't just happen.",
      "id": "ep_159_ut_71"
    },
    {
      "end": 2221770,
      "speaker": "Moritz Stefaner",
      "start": 2220918,
      "text": "Exactly.",
      "id": "ep_159_ut_72"
    },
    {
      "end": 2243610,
      "speaker": "Gabriele Rossi",
      "start": 2222110,
      "text": "Yeah, it doesn't just happen. And also, most projects don't require more than five people. So it means that our. Your team is divided in smaller teams that work on multiple projects. And what we do is we try as much as possible to mix these teams so that you get to work with different people every time, up to a certain.",
      "id": "ep_159_ut_73"
    },
    {
      "end": 2250398,
      "speaker": "Moritz Stefaner",
      "start": 2244870,
      "text": "So you would never throw ten or 15 people on a project because you would say, unless they work.",
      "id": "ep_159_ut_74"
    },
    {
      "end": 2250806,
      "speaker": "Enrico Bertini",
      "start": 2250454,
      "text": "Probably.",
      "id": "ep_159_ut_75"
    },
    {
      "end": 2388254,
      "speaker": "Gabriele Rossi",
      "start": 2250878,
      "text": "No, unless there's a lot of manual work to do. Even the most complex engineering tasks, they rarely involve more than four or five engineers, because over that, it becomes unmanageable. And what we try to do is we force a process to share information between people. So, like, for example, we have a weekly dataviz recap and a weekly experience design recap, a weekly software like front end recap, which means that everyone that's interested, not necessarily the people that have a label attached to their name, deals with experience design, but, like, everyone who's working on a project that involves experience design in the company joins. And the idea is that each person has five minutes to share what they're working on and the challenges they're facing. So there's a roundtable on how that challenge could be solved so that people learn about other projects in the firm and chime in on how they would approach the problem. So you get the advantage of having many experts around the table, but then you can keep a smaller team to run the single project. Then we also have, like, we offer lunch one day, like, every Thursday. We have this, like, learning burgers. Now, it's not not just burgers anymore. They get what they want. We're not forcing the burgers. It started with burgers, but now it's learning with what you want to order and roll your tongue. The team has a program as a schedule, and each one in the team comes up with a topic they want to talk about to the entire company, and they just give a lesson about something that they had to study for a project or something they know. So, for example, our data scientists talk about a specific topic that might be of interest for designers working with machine learning tools, or like, creating interfaces for artificial intelligence. And then a designer talks about problems with tooltips in data visualization, or that's.",
      "id": "ep_159_ut_76"
    },
    {
      "end": 2390006,
      "speaker": "Moritz Stefaner",
      "start": 2388302,
      "text": "Actually one of the hardest ones.",
      "id": "ep_159_ut_77"
    },
    {
      "end": 2410730,
      "speaker": "Gabriele Rossi",
      "start": 2390078,
      "text": "Yeah, exactly. So we have this rotation of, like, lectures done by the team for the team to go deeper on topics. And that's also an added value for clients in this sense, because, because we're leveraging the size of the team while keeping the small teams, the small project teams, more agile.",
      "id": "ep_159_ut_78"
    },
    {
      "end": 2443944,
      "speaker": "Caroline Goulard",
      "start": 2411990,
      "text": "My experience is that it's hard to scale. We are just eight at database. But my feeling is that if you can scale it only with small teams working together, because doing data visualization, you need to work really closely. Designers and developers, I think to be able to scale, you need two things. First, I think you need partners to be dedicated to that, which is not our case at the device, to also.",
      "id": "ep_159_ut_79"
    },
    {
      "end": 2446512,
      "speaker": "Moritz Stefaner",
      "start": 2443992,
      "text": "Really manage that process and think about.",
      "id": "ep_159_ut_80"
    },
    {
      "end": 2516916,
      "speaker": "Caroline Goulard",
      "start": 2446616,
      "text": "The culture and the collaboration at database, the partners, we are sharing our time between doing client work, working with the team, and running the studio. And this is not enough time to focus on scaling because unity has to be dedicated to that. And also, I feel that we would be quickly limited by the difficulty of hiring people inside this field. Yeah, we feel that it's really complicated to find people who have already worked in the field of data visualization, who are already trained, who know how to do data visualization inside a studio. And so you need to train people a lot. When we are hiring people, designers or developers, they don't really know data visualization. They sometimes are a bit interested about that, but they have to learn when they arrive, and it takes some time, and it's really a limit to scale this kind of theme, in my opinion. But it may be different.",
      "id": "ep_159_ut_81"
    },
    {
      "end": 2527660,
      "speaker": "Moritz Stefaner",
      "start": 2516988,
      "text": "I mean, there's many ways you can grow. You can grow bigger or you can grow better. And so I think that's the beauty of it, that there's so many ways you can take this.",
      "id": "ep_159_ut_82"
    },
    {
      "end": 2630310,
      "speaker": "Gabriele Rossi",
      "start": 2528240,
      "text": "Yeah, but it requires time. Yeah, indeed. We're four partners, but just two of us work full time at the company. So it's me here in New York and Simone in Milano, and we're full time, not on projects, so we're not involved on projects. Then we have a head of operations who also is not involved on projects. And we have like six now directors that only involve half of their time on projects. Everything else is just managing teams, managing the entire company and organizing this. But it like, one thing that gets easier with scale is the training component. Because it was very hard for us initially when we hired someone, we needed to hire someone who already had a specific skill set. So we needed to be more picky on the previous experience. Now we are much freer. We can focus on the individual characteristics and not necessarily on the background, because having a large team provides many opportunities for training. And so it gets easier. So we're now focusing more on people that we think have the right mindset, rather than that already know how to use react, or that already know how to design a bar chart. They will get it if they are curious and if they have the individual personal skills, they can learn it thanks to the size of the company. So it gets easier with scale. That's an advantage.",
      "id": "ep_159_ut_83"
    },
    {
      "end": 2732762,
      "speaker": "Caroline Goulard",
      "start": 2631130,
      "text": "And it's something that is quite complex to make people like designers and developers work together on a data visualization project. And in my opinion, this is really a barrier to entry for other kind of company. For example, in France we see lots of consultancy firms, big firms, consulting big firms who are hiring developers, data scientists, and who are also hiring designers. And they just cannot do what we are doing because they don't know how to make those people work together. And so they have data scientists, they have user experience designers, but they can't do the kind of projects we are doing. And yes, this is something really specific and very hard to explain how you make those talented people work together. Because at, at the beginning, designers that are doing data visualization in database team, they know how to cut, they are also developers and at the same time developers inside our team, they are also designers, or part of their brain is also a designer brain and they are talented people. And also they have a mix of skill that is quite unique, each of them, and which is really difficult to replicate or to train. It will be really hard for me to explain how we make the team work together at that. It's something a bit magic, but that's.",
      "id": "ep_159_ut_84"
    },
    {
      "end": 2755790,
      "speaker": "Enrico Bertini",
      "start": 2732866,
      "text": "Maybe what's the strength of agencies, right? With the real value behind companies like yours is the actual culture and system that you created. And you can't really, it's not a simple ingredient, right? You maybe, as you just said, you can even explain it. And that's the real value, and it's what is really hard to replicate.",
      "id": "ep_159_ut_85"
    },
    {
      "end": 2832472,
      "speaker": "Gabriele Rossi",
      "start": 2756330,
      "text": "Yeah. And also, I think, in general, European work culture helps us because, I mean, we have people in our team that have been with us for seven years, eight years, and, like, in a fast moving market, like the United States, for example, it's hard to find people that want to focus for a good part of their career on one company. And this creates, like, helps creating a culture. So now we have people that have been working on accurate projects for many years that know our methodology inside out, and this multiplies the opportunity to train people on how we work. And I, and I think it's an advantage of how we're culturally used to work, as opposed to changing job every year, moving from tech company to tech company, that clearly makes it harder to create this connection between different disciplines and create a culture that is not. Yeah. That allows this permeation of skills and knowledge.",
      "id": "ep_159_ut_86"
    },
    {
      "end": 2838820,
      "speaker": "Enrico Bertini",
      "start": 2832576,
      "text": "Yeah. Yeah. That's really interesting. It's actually something I never really thought about, but it's. It's a really good point.",
      "id": "ep_159_ut_87"
    },
    {
      "end": 2847672,
      "speaker": "Gabriele Rossi",
      "start": 2839360,
      "text": "Yeah. And it's not because, like, opportunities miss. It's just that people, like, people don't feel that they have to change job to grow.",
      "id": "ep_159_ut_88"
    },
    {
      "end": 2848264,
      "speaker": "Enrico Bertini",
      "start": 2847736,
      "text": "Yeah.",
      "id": "ep_159_ut_89"
    },
    {
      "end": 2852752,
      "speaker": "Gabriele Rossi",
      "start": 2848392,
      "text": "So if you give them opportunities, I think it's. It's also cultural.",
      "id": "ep_159_ut_90"
    },
    {
      "end": 2874532,
      "speaker": "Enrico Bertini",
      "start": 2852936,
      "text": "You know, that. That's a really good point. So I think we have to wrap it up soon. But, but we want to conclude with a couple of questions. So we want Gabriele to ask a question to Caroline and then Caroline to ask a question to Gabriele. So, Gabriele, you want to start?",
      "id": "ep_159_ut_91"
    },
    {
      "end": 2898560,
      "speaker": "Gabriele Rossi",
      "start": 2874676,
      "text": "Yes. Yes. One question that I ask myself a lot and that I always like to ask, like, dataviz entrepreneurs fellows, is, why are you still doing this? So what keeps you doing this even after, like, ten years you've been at it? Like, what's the motivation, the drive that keeps you there?",
      "id": "ep_159_ut_92"
    },
    {
      "end": 2977190,
      "speaker": "Caroline Goulard",
      "start": 2899380,
      "text": "Yeah. Maybe the first one is I just like doing data visualization, maybe because I feel that it's the only place where I can express the two parts of my brain. The one centered on information, empathy, and the one centered on math, science, maybe also because I'm still learning a lot at Dataveyes. I'm learning a lot every day because we are working on interesting projects and complex stuff, but also because running a small company with talented people, it's something that is challenging and that makes you learn a lot about yourself, about others. And maybe it's something that is so interesting, and it takes a lot of time, and it's really a big part of your life doing this kind of thing and running a studio like this, that at the end you feel that it's impossible to do something else because you won't find anywhere else the same interest. It will never be as interesting somewhere else.",
      "id": "ep_159_ut_93"
    },
    {
      "end": 2978598,
      "speaker": "Moritz Stefaner",
      "start": 2977230,
      "text": "You're spoiled for life.",
      "id": "ep_159_ut_94"
    },
    {
      "end": 3004350,
      "speaker": "Caroline Goulard",
      "start": 2978734,
      "text": "Yeah. Maybe you get a bit blind. You are not realistic about what's outside because you are absolutely convinced that your place is the best place on earth. It cannot be a school somewhere else. But, yeah, maybe it's because we are too much deep inside the game.",
      "id": "ep_159_ut_95"
    },
    {
      "end": 3010058,
      "speaker": "Moritz Stefaner",
      "start": 3006130,
      "text": "Yeah, but it's amazing if you still enjoy it. Like, why. Why change, right?",
      "id": "ep_159_ut_96"
    },
    {
      "end": 3010910,
      "speaker": "Caroline Goulard",
      "start": 3010194,
      "text": "Yeah.",
      "id": "ep_159_ut_97"
    },
    {
      "end": 3015066,
      "speaker": "Gabriele Rossi",
      "start": 3013290,
      "text": "Yeah. And it's the same for me.",
      "id": "ep_159_ut_98"
    },
    {
      "end": 3015642,
      "speaker": "Moritz Stefaner",
      "start": 3015138,
      "text": "Same, yeah.",
      "id": "ep_159_ut_99"
    },
    {
      "end": 3016394,
      "speaker": "Gabriele Rossi",
      "start": 3015666,
      "text": "Wonderful.",
      "id": "ep_159_ut_100"
    },
    {
      "end": 3019350,
      "speaker": "Moritz Stefaner",
      "start": 3016562,
      "text": "Do you also have a question for Gabriele in return?",
      "id": "ep_159_ut_101"
    },
    {
      "end": 3037210,
      "speaker": "Caroline Goulard",
      "start": 3019730,
      "text": "Yeah, and it's also a question I ask myself a lot and I never know know what to answer. The question is, what would you be doing if you hadn't founded accurate? Where were you at the moment if accurate did not exist?",
      "id": "ep_159_ut_102"
    },
    {
      "end": 3063802,
      "speaker": "Gabriele Rossi",
      "start": 3038590,
      "text": "That's a good question. I can say what I wouldn't be like, what I'm sure I would not be doing. Definitely I would not be a designer. I think because it was like a big moment in my life when I realized that, yeah, I studied design, I started working as a designer, but I don't like it. I'm not. That's not my.",
      "id": "ep_159_ut_103"
    },
    {
      "end": 3069002,
      "speaker": "Moritz Stefaner",
      "start": 3063906,
      "text": "Can be a really important realization to understand what you don't want to do. That's good.",
      "id": "ep_159_ut_104"
    },
    {
      "end": 3193780,
      "speaker": "Gabriele Rossi",
      "start": 3069066,
      "text": "I like to work in design, so I love it. And I like to design, but I like to design systems. So, like, I really love to design. I love designing my company and like, best moment in my week is our partners meeting on Monday evening when we get to think about what we need to do to improve the company, to work on it. That's where when I'm a designer and I like solving these challenges, but definitely I don't like the actual design task on a project. I'm fascinated by product companies, but I'm definitely not fascinated by Silicon Valley culture. So, like, I know I would love to work on a product, but not in the stereotypical VC funded way where you have to run to own the market and if you don't do it, you're done. Because I feel there is space for digital products, companies that aim not at conquering a huge market and make billions, but that can create sustainable businesses. But like our company, like lifestyle businesses, something I will never become a billionaire with. Accurate. And that's not the point. There's no way this could happen because it can only scale with the amount of hours people can dedicate to the world. So there is no magical trick. And I think this idea can be applied. There are many successful product companies that are not VC backed or not entirely VC backed that are, I think, a good opportunity for the future. And I'd like to explore, like how you can create a software or a digital product without the logic of scaling for the sake of it, because you need to provide an economical return to who put money in your venture. So that's something that I would like to explore. Or maybe teaching.",
      "id": "ep_159_ut_105"
    },
    {
      "end": 3195140,
      "speaker": "Moritz Stefaner",
      "start": 3194360,
      "text": "Yeah.",
      "id": "ep_159_ut_106"
    },
    {
      "end": 3202448,
      "speaker": "Enrico Bertini",
      "start": 3197840,
      "text": "You're making me think, like, after slow food, you can do slow business.",
      "id": "ep_159_ut_107"
    },
    {
      "end": 3208352,
      "speaker": "Gabriele Rossi",
      "start": 3202544,
      "text": "Yeah. I mean, they're very successful companies. Base camp. Basecamp is an example.",
      "id": "ep_159_ut_108"
    },
    {
      "end": 3211008,
      "speaker": "Moritz Stefaner",
      "start": 3208416,
      "text": "Basecamp is a nice example. Yeah, that's true.",
      "id": "ep_159_ut_109"
    },
    {
      "end": 3211920,
      "speaker": "Gabriele Rossi",
      "start": 3211184,
      "text": "There are many.",
      "id": "ep_159_ut_110"
    },
    {
      "end": 3212728,
      "speaker": "Moritz Stefaner",
      "start": 3212000,
      "text": "It can be done.",
      "id": "ep_159_ut_111"
    },
    {
      "end": 3213496,
      "speaker": "Gabriele Rossi",
      "start": 3212784,
      "text": "For sure.",
      "id": "ep_159_ut_112"
    },
    {
      "end": 3214900,
      "speaker": "Enrico Bertini",
      "start": 3213648,
      "text": "It can be done.",
      "id": "ep_159_ut_113"
    },
    {
      "end": 3218040,
      "speaker": "Gabriele Rossi",
      "start": 3216460,
      "text": "I might be doing that.",
      "id": "ep_159_ut_114"
    },
    {
      "end": 3233868,
      "speaker": "Enrico Bertini",
      "start": 3218700,
      "text": "Thanks so much for sharing your wisdom with us. We are very happy to have you on the show and yeah, looking forward to seeing what else is going to come from your great companies. Thanks so much for joining us.",
      "id": "ep_159_ut_115"
    },
    {
      "end": 3234620,
      "speaker": "Caroline Goulard",
      "start": 3234004,
      "text": "Thank you.",
      "id": "ep_159_ut_116"
    },
    {
      "end": 3235228,
      "speaker": "Gabriele Rossi",
      "start": 3234700,
      "text": "Thank you.",
      "id": "ep_159_ut_117"
    },
    {
      "end": 3236036,
      "speaker": "Moritz Stefaner",
      "start": 3235284,
      "text": "Thank you, too.",
      "id": "ep_159_ut_118"
    },
    {
      "end": 3237524,
      "speaker": "Enrico Bertini",
      "start": 3236148,
      "text": "Bye bye bye.",
      "id": "ep_159_ut_119"
    },
    {
      "end": 3238292,
      "speaker": "Gabriele Rossi",
      "start": 3237612,
      "text": "Thanks so much.",
      "id": "ep_159_ut_120"
    },
    {
      "end": 3239040,
      "speaker": "Caroline Goulard",
      "start": 3238356,
      "text": "Bye.",
      "id": "ep_159_ut_121"
    },
    {
      "end": 3266792,
      "speaker": "Moritz Stefaner",
      "start": 3243720,
      "text": "Hey folks, thanks for listening to data stories again. Before you leave, a few last notes. This show is crowdfunded and you can support us on patreon@patreon.com Datastories, where we publish monthly previews of upcoming episodes for our supporters. Or you can also send us a one time donation via PayPal at PayPal me Datastories or as a free way.",
      "id": "ep_159_ut_122"
    },
    {
      "end": 3294158,
      "speaker": "Enrico Bertini",
      "start": 3266816,
      "text": "To support the show. If you can spend a couple of minutes rating us on iTunes, that would be very helpful as well. Well, and here's some information on the many ways you can get news directly from us. We are on Twitter, Facebook and Instagram, so follow us there for the latest updates. We have also a slack channel where you can chat with us directly. And to sign up, go to our home page at Datastory ES and there you'll find a button at the bottom of the page.",
      "id": "ep_159_ut_123"
    },
    {
      "end": 3302172,
      "speaker": "Moritz Stefaner",
      "start": 3294294,
      "text": "And there you can also subscribe to our email newsletter if you want to get news directly into your inbox and be notified whenever we publish a new episode.",
      "id": "ep_159_ut_124"
    },
    {
      "end": 3314848,
      "speaker": "Enrico Bertini",
      "start": 3302286,
      "text": "That's right, and we love to get in touch with our listeners. So let us know if you want to suggest a way to improve the show or know any amazing people you want us to invite or even have any project you want us to talk about.",
      "id": "ep_159_ut_125"
    },
    {
      "end": 3321512,
      "speaker": "Moritz Stefaner",
      "start": 3314984,
      "text": "Yeah, absolutely. Don't hesitate to get in touch. Just send us an email at mailatastory es.",
      "id": "ep_159_ut_126"
    },
    {
      "end": 3325820,
      "speaker": "Enrico Bertini",
      "start": 3321656,
      "text": "That's all for now. See you next time and thanks for listening to data stories.",
      "id": "ep_159_ut_127"
    },
    {
      "end": 3330900,
      "speaker": "Caroline Goulard",
      "start": 3330160,
      "text": "You.",
      "id": "ep_159_ut_128"
    },
    {
      "end": 3334520,
      "speaker": "Gabriele Rossi",
      "start": 3334200,
      "text": "Our channel.",
      "id": "ep_159_ut_129"
    }
  ],
  "confidence": 0.931560033983638,
  "audio_duration": 3334,
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_status_code": null,
  "webhook_auth": false,
  "webhook_auth_header_name": null,
  "speed_boost": false,
  "auto_highlights_result": null,
  "auto_highlights": false,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_audio_quality": null,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "content_safety": false,
  "iab_categories": true,
  "content_safety_labels": {
    "status": "unavailable",
    "results": [],
    "summary": {}
  },
  "language_detection": false,
  "language_detection_threshold": null,
  "language_confidence": null,
  "custom_spelling": null,
  "throttled": false,
  "auto_chapters": true,
  "summarization": false,
  "summary_type": null,
  "summary_model": null,
  "custom_topics": false,
  "topics": [],
  "speech_threshold": null,
  "speech_model": "best",
  "chapters": [
    {
      "summary": "On this podcast we talk about data visualization, analysis, and more generally the role data plays in our lives. And we have actually two guests today. Our podcast is listener supported. If you do enjoy the show, you could consider supporting us.",
      "gist": "Data Stories",
      "headline": "This podcast discusses data visualization, analysis, and more generally the role data plays",
      "start": 160,
      "end": 84284,
      "id": "ep_159_ch_0"
    },
    {
      "summary": "This episode is a follow up to our previous episode about data visualization agencies. Today we have two people from two different agencies. Caroline Goulard from Dataveyes and Gabriele Rossi from accurate. com.",
      "gist": "Data Visualization Agencies",
      "headline": "This episode is a follow up on our previous episode about data visualization agencies",
      "start": 84412,
      "end": 129400,
      "id": "ep_159_ch_1"
    },
    {
      "summary": "Gabriele Rossi is one of the co founders of Dataveyes, a company specialized in data visualization. The company has 40 people between its offices in Milan and New York. It's quite a unique setup with the two different time zones and the split team.",
      "gist": "Introducing Dataveyes",
      "headline": "Can you briefly introduce yourself and give us a little bit of a background",
      "start": 131540,
      "end": 355142,
      "id": "ep_159_ch_2"
    },
    {
      "summary": "Caroline: What is the quintessential project of the type of project that you have done or you normally do in your company? The data visualization was really key from the beginning to find what's interesting inside the data set. Did it work out? Because sometimes these projects can be difficult.",
      "gist": "The quintessential project of your company",
      "headline": "We were wondering if you can talk about quintessential project that you have done",
      "start": 355246,
      "end": 737420,
      "id": "ep_159_ch_3"
    },
    {
      "summary": "Gabriele: All of our projects can be divided into two main families. Communication and experience design projects and more functional work and business oriented tools and solutions. It ranges from physical installations and digital projects to actually business oriented work.",
      "gist": "How Do You Do Data Visualization?",
      "headline": "Accurat mostly does data visualization, but also does design projects",
      "start": 738200,
      "end": 1067400,
      "id": "ep_159_ch_4"
    },
    {
      "summary": "Dataveyes has a division between client work and internal projects. Half a day per week for everyone in the team for internal experimentation. Monday morning is the perfect start for the week.",
      "gist": "Dataveyes: Between Innovation and Stability",
      "headline": "About all of our client projects there is an experimentation part, right",
      "start": 1068460,
      "end": 1719366,
      "id": "ep_159_ch_5"
    },
    {
      "summary": "How do you think the database field has changed over the years? The kind of project we are working on really changed a lot along these nine past years. From communication to business tools, to building a product with people. Any new application software will be dealing with data in one way or another.",
      "gist": "Dataviz freelancer: How the field has changed",
      "headline": "How do you think the database field has changed over the years",
      "start": 1719478,
      "end": 2160512,
      "id": "ep_159_ch_6"
    },
    {
      "summary": "Most projects don't require more than five people. Your team is divided in smaller teams that work on multiple projects. What we try to do is we force a process to share information between people. My experience is that it's hard to scale. If you can scale it only with small teams.",
      "gist": "How Do You Scale the Data Visualization Team?",
      "headline": "A lot of prominent data visualization projects are done by small teams",
      "start": 2160536,
      "end": 2527660,
      "id": "ep_159_ch_7"
    },
    {
      "summary": "One thing that gets easier with scale is the training component. It's something that is quite complex to make people like designers and developers work together on a data visualization project. The real value behind companies like yours is the actual culture and system you created.",
      "gist": "How to build a large team with a European culture",
      "headline": "One thing that gets easier with scale is the training component",
      "start": 2528240,
      "end": 2854860,
      "id": "ep_159_ch_8"
    },
    {
      "summary": "Gabriele: What keeps you doing this even after, like, ten years you've been at it? Caroline: What's the motivation, the drive that keeps you there? John: Maybe it's something that is so interesting. Why change?",
      "gist": "What Keeps You Working At Dataviz?",
      "headline": "What keeps you doing data visualization even after ten years at Dataveyes",
      "start": 2855640,
      "end": 3016394,
      "id": "ep_159_ch_9"
    },
    {
      "summary": "Gabriele: What would I be doing if I hadn't founded accurate? She says there is space for digital products that aim not at conquering a huge market and make billions. Gabriele would like to explore how you can create a digital product without the logic of scaling.",
      "gist": "What Would You Be Doing If You Didn't Start Accurate?",
      "headline": "What would you be doing if accurate did not exist",
      "start": 3016562,
      "end": 3239040,
      "id": "ep_159_ch_10"
    },
    {
      "summary": "This show is crowdfunded and you can support us on patreon@patreon. com Datastories. We are on Twitter, Facebook and Instagram, so follow us there for the latest updates. Let us know if you want to suggest a way to improve the show.",
      "gist": "How to support Datastories",
      "headline": "This show is crowdfunded and you can support us on patreon",
      "start": 3243720,
      "end": 3334520,
      "id": "ep_159_ch_11"
    }
  ],
  "disfluencies": false,
  "entity_detection": false,
  "sentiment_analysis": false,
  "sentiment_analysis_results": null,
  "entities": null,
  "speakers_expected": null,
  "summary": null,
  "custom_topics_results": null,
  "episode_num": 159,
  "episode_metadata": {
    "speakers": [
      "Gabriele Rossi",
      "Enrico Bertini",
      "Moritz Stefaner",
      "Caroline Goulard"
    ],
    "WPid": "1588",
    "url": "https://datastori.es/podlove/file/6654/s/feed/c/mp3/159-viz-agencies-dataveyes-and-accurat.mp3",
    "episode_title": "Viz Agencies: Dataveyes and Accurat"
  }
}