{
  "id": "5473190b-72d2-4b22-834c-cafaac56c54b",
  "language_model": "assemblyai_default",
  "acoustic_model": "assemblyai_default",
  "language_code": "en_us",
  "status": "completed",
  "audio_url": "https://datastori.es/podlove/file/2999/s/feed/c/mp3/81-freelance-or-company-with-mahir-yavuz-and-jan-willem-tulp.mp3",
  "utterances": [
    {
      "end": 3674,
      "speaker": "Mahir Yavuz",
      "start": 200,
      "text": "The reason why people hire me is to find out what works.",
      "id": "ep_81_ut_0"
    },
    {
      "end": 9430,
      "speaker": "Moritz Stefaner",
      "start": 8014,
      "text": "Data stories is brought to you by.",
      "id": "ep_81_ut_1"
    },
    {
      "end": 30474,
      "speaker": "Jan Willem Tulp",
      "start": 9462,
      "text": "Qlik, who allows you to explore the hidden relationships within your data that lead to meaningful insights. Let your instincts lead the way to create personalized visualizations and dynamic dashboards with Qlik sense, which you can download for free at Qlik Datastories. That's Qlik Datastories.",
      "id": "ep_81_ut_2"
    },
    {
      "end": 104792,
      "speaker": "Moritz Stefaner",
      "start": 49844,
      "text": "Hey, everyone, it's a new data stories. So this time it's only me. No, Enrico. Enrico is on vacations, but I have a good set of guests here, two very special guests. And what we want to discuss today is, is a topic that to me is very close to my heart because it affects me every day and it's about the actual practice and the business of doing data visualizations for other people. Like how do you actually manage that process? How do you find new projects? How do you go about figuring out what a client needs? And yeah, how do you come up with good end results? Like all these practical considerations that go into that. And yeah, for that topic I have to really special guests, two experts in the area. One is Jan Willem Tulp. He's a freelance information designer from the Netherlands. Hi, Jan. Hi.",
      "id": "ep_81_ut_3"
    },
    {
      "end": 105120,
      "speaker": "Mahir Yavuz",
      "start": 104888,
      "text": "Hi.",
      "id": "ep_81_ut_4"
    },
    {
      "end": 119544,
      "speaker": "Moritz Stefaner",
      "start": 105152,
      "text": "Moritz and Mahir Yavuz, who we had on a few dozens of episodes before, maybe. So it's been a few years and he's now. Can you say what your job is?",
      "id": "ep_81_ut_5"
    },
    {
      "end": 124764,
      "speaker": "D",
      "start": 119664,
      "text": "Creative director of data science and visualization at RGA in New York City.",
      "id": "ep_81_ut_6"
    },
    {
      "end": 125436,
      "speaker": "Jan Willem Tulp",
      "start": 124884,
      "text": "Exactly.",
      "id": "ep_81_ut_7"
    },
    {
      "end": 183754,
      "speaker": "Moritz Stefaner",
      "start": 125500,
      "text": "RGA is a big company and I especially invited the two of you because I was interested in this contrast. Like how is it like to work as an individual solo freelancer versus Mahir now in a big company? Mahir, you also have some experience as a freelancer, but now you're sort of working in one of the big ships and I'm really interested in what the differences are and maybe which type of things work well in one setting, which don't work so well in another setting, and so on. So thanks so much to coming on the show. And yeah, I'm really curious to hear about how things work for you. And yeah, so how do we start? Maybe we can talk about which types of projects you typically do and which types of projects you're looking for, how that has evolved maybe, or where you want to steer, like your profile. All these important questions, Jan, maybe if you want to start.",
      "id": "ep_81_ut_8"
    },
    {
      "end": 241790,
      "speaker": "Mahir Yavuz",
      "start": 184174,
      "text": "Yeah, sure. So the work that I do is I only do kind of custom data visualizations. So the type of projects that I look for are projects where I need to write code, because that's what I do. And with this code, I create a custom visualization specifically for that particular situation. So that means that sometimes it's a little bit more artistic. Sometimes, really, it's a kind of communication tool, and sometimes it's a really serious visual analysis tool that's used internally in an organization. So those are the kind of projects that I do, and what I typically look for is that there should be enough challenge for me. So new things, enough complexity on the data side, on the design side, and things like that project is usually very interesting for me.",
      "id": "ep_81_ut_9"
    },
    {
      "end": 251694,
      "speaker": "Moritz Stefaner",
      "start": 241982,
      "text": "And how do you acquire these projects? Do people typically come to you, or do you reach out to potential clients? How does that work for you?",
      "id": "ep_81_ut_10"
    },
    {
      "end": 279724,
      "speaker": "Mahir Yavuz",
      "start": 251814,
      "text": "Well, so far, clients reach out to me, which makes me very lucky, I guess. Yeah, sometimes I do reach out to clients myself, but that's basically because I would like to work with that particular client because I like what they do, or I think they have an interesting data set or something like that. But most of the time, yeah. More. There's more clients coming to me than I can work for, actually.",
      "id": "ep_81_ut_11"
    },
    {
      "end": 299774,
      "speaker": "Moritz Stefaner",
      "start": 280264,
      "text": "Yeah. I mean, you're in the lucky position to have been doing this type of job for a few years now, and you have a good reputation and a really nice portfolio. So people know by now what you do, and so they can say, oh, we would like something like that, too. Mahir, how does that work for you? Like, what types of projects are you doing with RGA, and how do you get to do them?",
      "id": "ep_81_ut_12"
    },
    {
      "end": 404324,
      "speaker": "D",
      "start": 299894,
      "text": "Well, right now at RGA, obviously, RGA is a big agency, and it's a global one. There's offices everywhere, but the headquarters is in New York, and our team is relatively small for the rest of the company. I mean, it's a big team. We are about, like, 1011 people. But the interesting thing for me, like, the experience in the agency and doing data visualization, data science related stuff, is the acquisition of the work is completely different. So you don't have any identity online anymore. People don't really come to you because you are Jan or Moritz. They come to the agency, and the hustle aspect of getting the work and getting the work done is a little bit different, I think. There is two main channels of acquisition. The first channel is obviously with existing clients. There's already some clients, they do some other work with RGA, and then we find an opportunity that they might need some help in the field of data science and visualization. So then we proactively approach them, or they come to us, but not for our name. Like for the other projects that we have done before, it's kind of similar to being a person, in my opinion. But RGA wins some awards and in different big competitions around the world. So they see those type of work and hopefully they get inspired with them. And then they approach the RGA and the right people, they put them in contact with us.",
      "id": "ep_81_ut_13"
    },
    {
      "end": 429562,
      "speaker": "Moritz Stefaner",
      "start": 405584,
      "text": "So with how much knowledge or how much information do clients approach you typically? And conversely, how will you figure out if a project is worthwhile, you know, pursuing or going deeper into, like, what are your first, like, what's your strategy in this very first moments of contact in figuring out if something is seems promising or not?",
      "id": "ep_81_ut_14"
    },
    {
      "end": 504546,
      "speaker": "D",
      "start": 429738,
      "text": "So I think this changed dramatically for me because when I was doing freelancing or working with small studios, we always wanted to explore the opportunity a little bit longer. Right now at RGA, I mean, there is like more concrete facts of business. So if it's not a good opportunity, unfortunately, we cannot spend so much time on it. I mean, with this, what I mean is like a good commercial opportunity. Obviously, sometimes, you know, there is a few situations that clients, they have great ideas, but either they don't have the right data. I mean, that's, I think it's a very common problem that we all experience. Sometimes they just don't have data. I mean, and first you need the data or they don't have enough money, and then in that case, we have to skip that project? When I was freelancing, it was a little bit more organic. I would say there was no concrete business decision about the scale and volume of the opportunity. It was more like, okay, let's see what they have and explore a little bit. Maybe we can do something with it. It was a little bit more organic. Now it's a little bit more process driven for me.",
      "id": "ep_81_ut_15"
    },
    {
      "end": 518344,
      "speaker": "Moritz Stefaner",
      "start": 504650,
      "text": "Do you have a fixed set of criteria, little checklist where you say, okay, we need at least this type of budget, we need at least this type of commitments from the client? Or is it more a judgment call depending on how the concrete situation is?",
      "id": "ep_81_ut_16"
    },
    {
      "end": 522912,
      "speaker": "D",
      "start": 518424,
      "text": "I would say there are three main domains. It's not a real checklist.",
      "id": "ep_81_ut_17"
    },
    {
      "end": 527208,
      "speaker": "Moritz Stefaner",
      "start": 523048,
      "text": "We check things off, but some things you're looking for maybe.",
      "id": "ep_81_ut_18"
    },
    {
      "end": 570138,
      "speaker": "D",
      "start": 527336,
      "text": "Yeah, I think the first thing is definitely the budget because they're hiring a team of people and the team of specialists more than like just hiring a regular team. So it comes with a price. And then the second thing, so if they're completely out of the range, it's, to be honest, it's not very much possible to do something. And then the second thing I think is we don't check about the data because if you get it there, it's too complex sometimes there's so many details. We believe in goodwill that we will find a way to work with their datasets. But you have a strong belief.",
      "id": "ep_81_ut_19"
    },
    {
      "end": 573654,
      "speaker": "Moritz Stefaner",
      "start": 570306,
      "text": "Yeah, we have a strong religious, I think. Exactly.",
      "id": "ep_81_ut_20"
    },
    {
      "end": 649474,
      "speaker": "D",
      "start": 575594,
      "text": "We can talk about that part, I think later, a little bit more in detail. And I think the second thing is the setup. So mostly we have to integrate with the client folks, tech people and designers, if there's any, on the client side, and business alignment and stuff. So that is a little bit critical. Like if they ask all of our team to move somewhere else and work with them, obviously we cannot do that either or completely. They don't have anyone who can run the project on the client side. That's also not very ideal. And I think the third thing is what is in it for us? Right. So obviously we just don't want to do like not promising projects just because it pays well. I think it's important criteria to develop the portfolio of the team and the company. Even though that, you know, it is an established business, we should always keep in mind what we are doing and whether we can really, so to say, you know, catch the spread of the time. Right. So I think these are three domains that how we evaluate the business opportunity.",
      "id": "ep_81_ut_21"
    },
    {
      "end": 657034,
      "speaker": "Moritz Stefaner",
      "start": 650614,
      "text": "How does that work for you, Jan? Like, how do you fish for information early? What are you looking for?",
      "id": "ep_81_ut_22"
    },
    {
      "end": 702456,
      "speaker": "Mahir Yavuz",
      "start": 657654,
      "text": "Yeah, I do think that it is a little bit more organic. At the same time, it's also I do most of my projects alone, I do collaborate every now and then, but there are quite a few projects that I do on my own, which automatically sets a few limitations. So one of the things is my own availability. So that's one thing that I try to figure out real soon. How soon do they want to have a project? Because otherwise it's not even useful to discuss any further if it's not possible. And the same goes for budget and the same goes also for data, because sometimes clients think you can create a data visualization without data. But yeah, that's not really possible.",
      "id": "ep_81_ut_23"
    },
    {
      "end": 709598,
      "speaker": "Moritz Stefaner",
      "start": 702560,
      "text": "You can just plug it in in the last minute. Yeah, that's right. Just right before the deadline. Plug in some data.",
      "id": "ep_81_ut_24"
    },
    {
      "end": 714994,
      "speaker": "D",
      "start": 709726,
      "text": "Are we going to have a section for dirty tips and tricks at the end of that?",
      "id": "ep_81_ut_25"
    },
    {
      "end": 763824,
      "speaker": "Mahir Yavuz",
      "start": 719654,
      "text": "But the data itself, that is something I would like to get a sense of really soon, if it's possible. I would like to get a glimpse of the data just even before we sign the contract, if that's possible. Just to get a sense of, is it big, small, what's the quality of the data, what type of dimensions are in the data set and things like that. So that gives me a little bit of sense of the complexity and also, of course, what they have in mind themselves for a project. Do they want to have something interactive? Not interactive. Is it going to be something that needs to communicate insights? Is going to be a tool? Well, things like that.",
      "id": "ep_81_ut_26"
    },
    {
      "end": 821498,
      "speaker": "Moritz Stefaner",
      "start": 764904,
      "text": "And then there's always, it's one of the phases in a project I enjoy the most, but it's also the most horrible because it's the one where the whole thing sort of gets decided and you don't even know what it is. And this is often like a real catch 22. Like, you know, the client says they want to have something interesting with data, but they don't know exactly the data, they don't know exactly what they need, but still they want a commitment. You want a commitment from them. And, you know, it's always this very strange situation, a project that can go horribly wrong or can like set the whole project right on the right track, and it's this sort of thing, like, yeah, in order to figure out what to do, we would have to have, we would have to work with the data already, but before we can start working, we should have a contract. Right. So how do you deal with this, this whole situation, this black art of pricing and scoping and how to get something going, you know, and, and at the same time making sure you're getting.",
      "id": "ep_81_ut_27"
    },
    {
      "end": 822524,
      "speaker": "Jan Willem Tulp",
      "start": 821546,
      "text": "Paid for your work?",
      "id": "ep_81_ut_28"
    },
    {
      "end": 845096,
      "speaker": "Moritz Stefaner",
      "start": 822634,
      "text": "Like, do you sometimes just work for free until you know what the project is like? Or do you more have a fixed project scope and say, like, I want amount x, and then you figure out what to put into that box with amount x later on? What's your usual process there? Or does it differ every time? I think that's the most interesting question.",
      "id": "ep_81_ut_29"
    },
    {
      "end": 1010234,
      "speaker": "Mahir Yavuz",
      "start": 845160,
      "text": "Yeah, well, it is indeed very interesting because, yeah, you don't know in advance what the end result will be and also if it's going to work out with the data and things like that. So that is really tricky. But in general, I don't think I start working on a project before I have a contract. It's also my experience that sometimes, even though you've seen a glimpse of the data, you may have some idea of what may work. But once you start working with the actual data or the full data set, and it turns out, well, there's too much overlap for this idea we had in mind or whatever. So most of the time, your initial ideas, they can work partially at best. And so I think that part of the reason why people hire me is to find out what works. And it really depends on the client and the size of the project. If we decide just for small projects, for instance, and if I worked with a client for several times, then we can say, okay, this project, maybe for this amount, we can do this, and I'm sure that we can do it. But there are also projects where there's much more uncertainty, and then I, or a much bigger project, for instance. And then I try to have several phases of a project where in many cases, you also sometimes pay for several phases. So one of the things you typically want to do in the first stages of a project is find out what's inside a dataset and what's the potential for a visualization. Sometimes, luckily not most of the time, but sometimes you come to the conclusion, this is not going to work, and then sometimes the project stops because you just cannot make things up. Visualization is driven by the data. So if there's no data, yeah, it just stops. But after that, for larger projects, there's still some uncertainty what the end result will be, because you can come up with different ways to visualize the same data set. And so what I always emphasize in initial talks is that for every project, I need to have some room to play around with the data and try things out, and then we can have revisions and we can have discuss the results, and then we establish a basic concept that may work, and then, well, that will turn into the end result.",
      "id": "ep_81_ut_30"
    },
    {
      "end": 1032544,
      "speaker": "Moritz Stefaner",
      "start": 1011164,
      "text": "But do you usually, like you say you would price a first exploration and design phase and then maybe price the rest later. But usually the clients, they will still want to have, in my experience, they often want to have a fixed number fairly early because they need to sell that in house and reserve the budget and are not so comfortable with too much insecurity there.",
      "id": "ep_81_ut_31"
    },
    {
      "end": 1040936,
      "speaker": "Mahir Yavuz",
      "start": 1033804,
      "text": "That's usually the case. But what we actually will do for, for a part of the project that will be specified later.",
      "id": "ep_81_ut_32"
    },
    {
      "end": 1047496,
      "speaker": "Moritz Stefaner",
      "start": 1041000,
      "text": "Yeah, yeah, yeah. That makes a lot of sense. Mahir, how do you approach that, these early project phases?",
      "id": "ep_81_ut_33"
    },
    {
      "end": 1076182,
      "speaker": "D",
      "start": 1047600,
      "text": "I think it's pretty similar what Diane described, obviously, like, there's more people involved and the process is a little bit more intricate in some details because, like, you know, company to company engagement, especially, like, if the organizations are big and if they're working for the first time, it can really turn into a nightmare of paper pushing. Like, seriously, like, it can take months, like, just to, just to start talking about the contract. You have to sign another agreement and.",
      "id": "ep_81_ut_34"
    },
    {
      "end": 1082774,
      "speaker": "Moritz Stefaner",
      "start": 1076198,
      "text": "Stuff like that, set up five meetings, sign two NDAs, and then the whole team has changed in the meantime.",
      "id": "ep_81_ut_35"
    },
    {
      "end": 1157070,
      "speaker": "D",
      "start": 1082854,
      "text": "And obviously people resign and they get sold off. So I think, but, you know, once you, either you are good with that bureaucracy or once you can, you know, get away with it with the right lawyers and whoever. I'm quite lucky because we also have very skilled producers. They know this domain of business. So I usually work with them because the creative input comes from me, the overall project vision and what we can do and what is the opportunity here and how we can basically align with the client. But the business side also is very much supported and run by the producers. But in a way that we do something fairly similar to what Jan just described. We do a discovery phase most of the time. So this discovery phase is technically helping us to define a couple of things. We define the business objective, which I believe is very critical because every client actually has a business objective. That's the reason why they spend money on this thing. If you don't understand their objective well enough, then we most likely can fail. So we should avoid, or you don't.",
      "id": "ep_81_ut_36"
    },
    {
      "end": 1162230,
      "speaker": "Moritz Stefaner",
      "start": 1157102,
      "text": "Even know if you have failed or have, you know, if you have been successful, if you don't know what the goal was. Right?",
      "id": "ep_81_ut_37"
    },
    {
      "end": 1242464,
      "speaker": "D",
      "start": 1162302,
      "text": "Yeah. What is the definition of success? Right. So we want to understand that a little bit better. You cannot just understand it over a simple phone call or like just some emails. The second thing, like how we are going to get this data, like it might be sometimes just like a file or a series of flat files and whatever, but sometimes they have all these big and antiquated systems and oracle systems running into SAP systems, giving an output of.NET frameworks and whatever. It can be a big mess of cables all around. So we should understand it, integration points of it. And also we want to just basically give them our initial creative strategy. This is what we would do with this data or in this project. What do you think about this? What would be your reaction to this? And then we also tie all these things into an execution approach, which is more like a kind of more detailed project plan for the execution phase so they know what they're going to buy. And this is the ideal scenario. So let's now talk about the reality. I just realized it sounds so good, right?",
      "id": "ep_81_ut_38"
    },
    {
      "end": 1245044,
      "speaker": "Moritz Stefaner",
      "start": 1243164,
      "text": "Very orderly. I'm impressed.",
      "id": "ep_81_ut_39"
    },
    {
      "end": 1402554,
      "speaker": "D",
      "start": 1245084,
      "text": "Yeah. So what happens most of the time, Moritz, as you just said. So clients, they have their own worlds and they have their own problems going on in their own world. So what this means is sometimes they have a bulk amount of money. And they just want to spend this money on that particular business objective by doing data visualization or some data driven art or data driven platform, whatever they need. And they don't like this phased approach because it opens them up to a lot of risks. And they might realize at the end of discovery it's like $5 million more than what they originally thought. And that's a nightmare because they already spent some money. They're not going to get anything at the end because they don't have enough. So what we do is, I mean, we have a very frank and honest conversation and we try to convince them that this is the right approach also for them because, not because of any, you know, I think, arrogance or anything, but if it's not just gonna work, it's not gonna work anyway. So you also need to spend some time and money to understand whether your project is a really realistic and grounded idea or is just a dream. Right. So mostly it works. I would say sometimes, obviously some clients, they have their own deadlines and like, you know, fiscal years and everything, then we, we try to make it work. I think that where the hustling comes into play, you take some risks and you say, in goodwill, we can make this work. What we do, usually in those cases, we give them a list of potential risks, like what might happen. Okay, we are signing this basically combined phases of scope with you. And this is completely unknown as of today, what's going to happen. Right. You know, at the end of the project. So these are the potential risks. Based on our experience in such projects, I think client relationship is pretty critical. I also know this from my freelancing years. You know, I think working with someone is also getting to know them a little bit. Right. So some clients, they're always late with emails. Some clients, you know, they're always very prompt with emails. Some of them are more aggressive. Some of them like you to be more proactive. So if we have a relationship with that particular client, we also can optimize these scoping and budgeting and signing contracts based on that relationship.",
      "id": "ep_81_ut_40"
    },
    {
      "end": 1442032,
      "speaker": "Moritz Stefaner",
      "start": 1403054,
      "text": "Yeah, that's a huge part is building this trusted relationship. And as you said, it's also something I realized quite late, is that, well, the client is not a black box, but the people you are working with, they're also working again inside their company and need to present your results to somebody else. And if you realize that, then you can decide to become their ally also and say, like, you know what, we are going to help each other succeeding here. Right? And I deliver something to you. That helps you succeed in house and you help me do my job really well. And if that works out, then you have a strong combo. But yeah, it took me a while to realize.",
      "id": "ep_81_ut_41"
    },
    {
      "end": 1446226,
      "speaker": "D",
      "start": 1442168,
      "text": "Yeah, like they say in the US, everybody has a boss.",
      "id": "ep_81_ut_42"
    },
    {
      "end": 1446966,
      "speaker": "Moritz Stefaner",
      "start": 1446360,
      "text": "Exactly.",
      "id": "ep_81_ut_43"
    },
    {
      "end": 1454914,
      "speaker": "D",
      "start": 1447030,
      "text": "Like that person has a boss too. So everybody needs to explain to someone like why and how they spend this money.",
      "id": "ep_81_ut_44"
    },
    {
      "end": 1456494,
      "speaker": "Mahir Yavuz",
      "start": 1455774,
      "text": "Right?",
      "id": "ep_81_ut_45"
    },
    {
      "end": 1461954,
      "speaker": "Moritz Stefaner",
      "start": 1456654,
      "text": "Yeah, that's all very interesting. And that's all nobody teaches you at school anywhere.",
      "id": "ep_81_ut_46"
    },
    {
      "end": 1500164,
      "speaker": "D",
      "start": 1463614,
      "text": "Yeah, that's. But to me, I don't want to sound like so business oriented, but it is very critical, you know, like I see that my role and obviously our producers role to bring a good and well funded project to the team. So team can do good work. Right. So it is very critical. If we don't pay attention to that initial scoping and like, you know, how much funding we can get and what this project is going to be, then it can be a very unpleasant experience for everyone involved, like including client, including yourself and the team and everyone.",
      "id": "ep_81_ut_47"
    },
    {
      "end": 1508984,
      "speaker": "Moritz Stefaner",
      "start": 1500324,
      "text": "Yeah, no, it's absolute basis for anything is to have a good setup and a good personal relationship and also straightforward communication.",
      "id": "ep_81_ut_48"
    },
    {
      "end": 1587264,
      "speaker": "Jan Willem Tulp",
      "start": 1513554,
      "text": "This is a good time to take a little break and talk about our sponsor this week. Click who allows you to explore the hidden relationships within your data that lead to meaningful insights. Let your instincts lead the way to create personalized visualizations and dynamic dashboards with Qlik Sense, which you can download for free at Qlik Datastories. And this week we would like to feature a special initiative from Qlik. You might know the website Circle of Blue. It's a website dedicated to relevant, reliable and actionable on the ground information about the world's resource crisis, and Qlik has partnered with them in order to fulfill a multi year commitment to the Clinton Global Initiative to study water scarcity through analyzing California groundwater data. And with the help of Columbia Water Center, University of California, Irvine, Pacific Institute and Twitter, they have built a couple of visualizations and dashboards around that important topic. For instance, one shows how the price of water has risen over the last seven years in 30 cities in the United States. Actually, the average price climbed 48% since 2010. So you might want to check out your city and see how the price has developed there. Try it out for yourself on the circle of Bloop website.",
      "id": "ep_81_ut_49"
    },
    {
      "end": 1588984,
      "speaker": "Moritz Stefaner",
      "start": 1587384,
      "text": "The link is in the show notes.",
      "id": "ep_81_ut_50"
    },
    {
      "end": 1601224,
      "speaker": "Jan Willem Tulp",
      "start": 1589144,
      "text": "And make sure to also try out Qlik sense for free at Qlik Datastories. That's Qlik Datastories. And now back to the show.",
      "id": "ep_81_ut_51"
    },
    {
      "end": 1632214,
      "speaker": "Moritz Stefaner",
      "start": 1604524,
      "text": "Let's come to a few typical problems or challenges let's say along the way. So one we mentioned already is the data is coming soon syndrome. And then when the data arrives two months late, it's totally different and super flaky, and it does not support what your mock ups say. Like, how do you deal with this situation that often the data just arrives late and is maybe in contradiction to anything else anybody has told you?",
      "id": "ep_81_ut_52"
    },
    {
      "end": 1681374,
      "speaker": "Mahir Yavuz",
      "start": 1632634,
      "text": "Well, for me, I really try to avoid this situation. So, yeah, to be honest, I always emphasize early in the process that I would like to work with the actual data, not just a part of it or mock up data or something. I would like to work with the final results. Yeah. And also not making designs and sketches before I actually get started. I just need to have data to get started. And otherwise, I think it's a much better way to spend your time if you postpone the project, once you have the data, then working on a project which is all based on assumption and eventually will not work.",
      "id": "ep_81_ut_53"
    },
    {
      "end": 1815706,
      "speaker": "D",
      "start": 1683194,
      "text": "I think you were at the presentation during visualized, because that's like, you know, I think is the first real public presentation of our team in the scene of data visualization. And we started our presentation by saying that data is debrief, and that's our motto in the agency with the clients and everyone. So I think in reality, we also try to avoid. Definitely. Like we. And I think it's getting much better. Like, in the former times, I remember, like, this coming soon syndrome is it was a really, really permanent thing. Almost every project, it's a calling egg. Yeah, yeah. I think partly it was related to the. It structures of the systems of clients. Like, you know, there are always some it people blocking the data or whatever. It's getting better, but sometimes we still don't have the data timely enough. Personally, I started developing a lot of strategies against that even before RGA. So one thing that I'm trying to do more and more is holding client workshops to talk about the structure of the data. This still doesn't help to the situation. If the structure at the end is completely different, obviously that's not very helpful, but it helps to a degree. You know, like, so you can imagine, I mean, if you really think truly about it. Right? So there is maybe, you know, I just skip, like, you know, the most radical or extraordinary data sets. But in terms of the nature of data, there's always, like, you know, certain things that you can feel about it. I think it's almost like working with a material for some years. Right. I think we all share similar feelings, maybe like, you know, there's some number ranges, there's some maybe images coming from somewhere. So you, you can start dreaming about what will come and basically simulate on what you dream. So that's one very useful tactic we try to put in place in some projects.",
      "id": "ep_81_ut_54"
    },
    {
      "end": 1824054,
      "speaker": "Moritz Stefaner",
      "start": 1815850,
      "text": "Will you do mood boards or just collect visual references? Here's a crazy map. Here's another crazy map. Here's a network, this type of thing.",
      "id": "ep_81_ut_55"
    },
    {
      "end": 1857714,
      "speaker": "D",
      "start": 1825554,
      "text": "That has been also done. But what I'm saying is more like seriously simulating data from scratch, like being realistic about the thresholds and the distribution and ranges and creating a solid structure, whether if it's JSON structure or whatever we need, and just simulating it. It's not easy and it can be really hairy, like in certain cases. But I see sometimes it works well.",
      "id": "ep_81_ut_56"
    },
    {
      "end": 1870354,
      "speaker": "Moritz Stefaner",
      "start": 1858014,
      "text": "Sometimes maybe you find comparable public data sources, right. So like anything's correlated with population density and GDP anyway. So you could also just visualize that for the time being.",
      "id": "ep_81_ut_57"
    },
    {
      "end": 1911164,
      "speaker": "D",
      "start": 1871134,
      "text": "Exactly. So another thing that I like to mention, like this is something that I started to observe more and more too. If the data is like really critical for the business, then clients, even though that technically it's possible they don't want to share, and I cannot blame them because I don't know, some data sets, I think they can be very critical for the business. And then they need so many approvals from so many different departments even just to send a sample of that data. So in that case, we never ask for the full data set because, I don't know, you can impact their stock market value or something.",
      "id": "ep_81_ut_58"
    },
    {
      "end": 1913798,
      "speaker": "Moritz Stefaner",
      "start": 1911624,
      "text": "It could also be too large sometimes. Right.",
      "id": "ep_81_ut_59"
    },
    {
      "end": 1914838,
      "speaker": "D",
      "start": 1913926,
      "text": "That's another thing.",
      "id": "ep_81_ut_60"
    },
    {
      "end": 1917794,
      "speaker": "Moritz Stefaner",
      "start": 1914926,
      "text": "You can't really have the full data sets anywhere.",
      "id": "ep_81_ut_61"
    },
    {
      "end": 1937514,
      "speaker": "D",
      "start": 1918574,
      "text": "I feel like in our industry we should develop better strategies like how to deal with this in the future too. We are doing a little bit ad hoc tactical stuff, but what is a better way to do data visualization without the data? I think it's a great question.",
      "id": "ep_81_ut_62"
    },
    {
      "end": 1939794,
      "speaker": "Mahir Yavuz",
      "start": 1938374,
      "text": "Yeah, absolutely.",
      "id": "ep_81_ut_63"
    },
    {
      "end": 1969876,
      "speaker": "Moritz Stefaner",
      "start": 1940094,
      "text": "What are some typical. So I feel there's some things that some clients always want, but that are super hard to do and like, you know, make the whole project ten times more expensive. And sometimes there's like really elegant solutions, you know, to do something almost as good with much simpler means. Like did you have any situations like this or do you have a few of. Yeah, a few, like red flags where client says, I don't know, real time dashboard or something where you say like, yeah, does it need to be a dashboard? Does it need to be real time? Something like this.",
      "id": "ep_81_ut_64"
    },
    {
      "end": 1970860,
      "speaker": "D",
      "start": 1969980,
      "text": "Real time?",
      "id": "ep_81_ut_65"
    },
    {
      "end": 1976590,
      "speaker": "Moritz Stefaner",
      "start": 1970972,
      "text": "Yeah, yeah. Like what is real time? Anyways, is that like. Yeah, yeah. To the millisecond or daily updates?",
      "id": "ep_81_ut_66"
    },
    {
      "end": 1978198,
      "speaker": "Mahir Yavuz",
      "start": 1976662,
      "text": "Yeah, right.",
      "id": "ep_81_ut_67"
    },
    {
      "end": 1993614,
      "speaker": "Moritz Stefaner",
      "start": 1978286,
      "text": "Jan, how about you? Like, are there some things everybody wants where you say, like, why does everybody want that? I don't get it. Or let's say the client comes to you and says, like, I want this huge thing, but I have only a small budget. Like how, how could, how can you make it work?",
      "id": "ep_81_ut_68"
    },
    {
      "end": 2020594,
      "speaker": "Mahir Yavuz",
      "start": 1993694,
      "text": "Well, in that case, yeah, yeah, if you want to. In that case, it really comes down to, to a good discussion because you have to strip down the concept they have in mind. Either use smaller data set or reduce the functionality or less interactivity or something like that. I guess it comes down to something like this.",
      "id": "ep_81_ut_69"
    },
    {
      "end": 2033924,
      "speaker": "Moritz Stefaner",
      "start": 2023654,
      "text": "I feel it's often like they want something very soft, very. With a CMS and connect it to live data and in ten languages. And this actually costs like 95% suddenly of the project.",
      "id": "ep_81_ut_70"
    },
    {
      "end": 2034268,
      "speaker": "Jan Willem Tulp",
      "start": 2034004,
      "text": "Right.",
      "id": "ep_81_ut_71"
    },
    {
      "end": 2044384,
      "speaker": "Moritz Stefaner",
      "start": 2034316,
      "text": "And then if you tell them, well, you're building a thing that maybe five people look at once per month, we could do a really nice PDF report or something.",
      "id": "ep_81_ut_72"
    },
    {
      "end": 2047236,
      "speaker": "D",
      "start": 2046204,
      "text": "Spend the rest of the.",
      "id": "ep_81_ut_73"
    },
    {
      "end": 2055060,
      "speaker": "Moritz Stefaner",
      "start": 2047260,
      "text": "Money somewhere else, you know. So sometimes I feel it's also like being smart about, yeah, are we talking about the right thing here?",
      "id": "ep_81_ut_74"
    },
    {
      "end": 2065554,
      "speaker": "Mahir Yavuz",
      "start": 2055092,
      "text": "Actually, I don't know if I have that many request for projects that have, that also involve developing a very large backend side.",
      "id": "ep_81_ut_75"
    },
    {
      "end": 2076574,
      "speaker": "Moritz Stefaner",
      "start": 2066574,
      "text": "So people usually approach you with right sized projects already in a sense that they see what you do and then they have a sense of, yeah, my type of project, more or less.",
      "id": "ep_81_ut_76"
    },
    {
      "end": 2117864,
      "speaker": "Mahir Yavuz",
      "start": 2076654,
      "text": "Or sometimes on the client side they also have developers. And for instance, sometimes I work on a project where, and that's actually kind of good situation where the data is in a database, but for the visualization specifically, the data is not accessible yet. But on the client side, there's someone working to develop an API specifically for the visualization. So then you collaborate a lot and then you can discuss on what we should build and what we should not build. And that's actually quite a good situation, I think, because then it becomes something specifically for the visualization.",
      "id": "ep_81_ut_77"
    },
    {
      "end": 2170624,
      "speaker": "Moritz Stefaner",
      "start": 2118524,
      "text": "Maybe moving on a bit from the commissioning situation. I mean, one other strategy to escape this whole conundrum is to do more self commissioned work or build an app yourself that you will sell or do something like self initiate it. I know, Jan, you have been experimenting with, for instance, setting up a certain corporate data art format where you say like, this is a certain type of thing I can do, this is something I offer, and then people can approach you already and say, yeah, I would like to have one of these how is this working out? Is this complementing your usual business? Could it be a whole business at some point? And in general, how do you balance, because I feel it's important to do also self initiated projects from time to time. How do you balance that with the more inbox driven approach?",
      "id": "ep_81_ut_78"
    },
    {
      "end": 2330224,
      "speaker": "Mahir Yavuz",
      "start": 2171244,
      "text": "Right. Well, I think there are two things. So you have the corporate data thing. That's really something I offer separately besides the regular projects that I do. And I must admit that I didn't recently give it a lot of effort with regards to marketing after to the initial launch. So it's a little bit quiet. There's one potential client now who's interested in this, but the idea came from one of my first projects I did for Nielsen, and basically what they wanted was visualizations based on actual data, but it had to be just nice looking pictures so that they could use this in their brochures as a kind of illustration and you didn't have to see what it was about. So, and I really enjoyed this project. So I built a tool for myself which allowed me to explore the data set. And then once I, and with several options, I could influence the appearance of the visualization. And then once I had something that I thought looked nice, I could generate a PDF. And so this way I generated a whole lot of PDF's and we discussed what worked and things like that. So it was a really great and fun project, and it was not about communicating insights, but creating nice images. And so that's where the idea came from. So I started setting this up and I launched this after some very nice words from people. I didn't really turn into actual projects yet, but the other thing is doing self initiated projects and things like that, and I do think that is very, very important. It's personally, for instance, I don't really go to trainings or things like that. So one of the things that I really like about it is that it's an opportunity to learn new things, to try things out, to learn new technologies. And I think that's very important because especially if you do something with technology, developments are so fast that you just have to spend time in keeping up and learning new things. Things. The other thing is that although I really like doing client projects, clients do set some limitations on what you should be doing, and doing personal projects allows you to set your own limits and constraints and challenges and things like that. And it's just complete freedom. And yeah, I've been building a list of ideas, which is very long by now, and I have way too little time to do all of them, but.",
      "id": "ep_81_ut_79"
    },
    {
      "end": 2332664,
      "speaker": "Moritz Stefaner",
      "start": 2330884,
      "text": "Maybe you need to pay some people.",
      "id": "ep_81_ut_80"
    },
    {
      "end": 2365140,
      "speaker": "Mahir Yavuz",
      "start": 2333684,
      "text": "Yeah, maybe, maybe. But, yeah, it's really great fun to do. And also, what I do notice myself is that some of these self initiated projects, they do get a lot of exposure. So you can put it in your portfolio and people can see it, and it could be another way to attract clients. So, yeah, all in all, I think it's very good and important to work on those kind of projects and actually make some time to do it.",
      "id": "ep_81_ut_81"
    },
    {
      "end": 2369548,
      "speaker": "Moritz Stefaner",
      "start": 2365212,
      "text": "Mahir, how do you handle that in the agency? Do you have time for that at all, or is there a weekend thing?",
      "id": "ep_81_ut_82"
    },
    {
      "end": 2547852,
      "speaker": "D",
      "start": 2369596,
      "text": "Definitely not. This is one thing that I definitely miss a lot. And, you know, I think most of the people in the agency world or like, working in large organizations, this is maybe one thing that makes them to think about, like, you know, what they do like and whether they want to keep doing this, because we don't have time, like, to do anything more experimental or, you know, like something that we can just try and figure out or test something new. What we, what, what I do personally and my team is very flexible and agile in that regard. We try to embed those experiments into projects. Right, right. So we basically, even the client is not asking us. Maybe this also relates to the previous question that you asked. Even that they don't ask, like, to do something very difficult. We always try to convince them we should do something difficult in that project, and so we can try. Right. So we can push the bar a little bit higher. Otherwise, you know, it will turn into a kind of, of just a typical service business. Then the client comes and then they know what they want. You just do the. You are being the hands of the client, and that's it. But we definitely try that in real projects. And sometimes trying in the real projects brings a lot of learning experience, a lot of failure, which I believe is good because you learn with the clients sometimes. You should understand that the time that you spend on something that nobody's asked you to do should be limited. Let's say it like that. Right. But I think learning is a big part of what we do in many fronts, and it's becoming very difficult to follow every front because I think if you're a web designer or if you are a print related creative, there is a field, I believe there's a lot of things going on in those fields, too, but it is somewhat, you know, focused. What we are trying to do, in my opinion, is these platforms, and it is evolved into platforms by the years. Everything is connected. There's a lot of inbound data traffic. And then visualization by itself is a different domain. Like how people perceive visualizations is another domain. Like standard rules of design for screen is changing every day. Frameworks are completely a different world. You know, like I'm jungle out there. Yeah, it is jungle. And I, I'm trying to basically, so to say, like, you know, get the signal from the noise and I'm miserably failing sometimes on Twitter. But I think it's another challenge that comes with the learning and trying to learn new things.",
      "id": "ep_81_ut_83"
    },
    {
      "end": 2601274,
      "speaker": "Moritz Stefaner",
      "start": 2548028,
      "text": "But I can also totally support this notion of doing self commissioned work and really making space for it. As you say, you build reputation, you build a repertoire of things you can suddenly use in a project. Sometimes you need something you need to pull out of a head, basically, because it's a difficult situation. Time is tight. If you don't have a few things that you can somehow conjure up, then you're in trouble. And lastly, you can also explore what else you could do, right, because let's say you're always booked for a certain type of visualization and you always have the technical role or something like this. You will never, and you think, like, I might be good at concept or design as well, you know, you will only find out if you actually do it in your own projects, I think. And so, yeah, or if you think like, I'd like to go more into data science, how do I do that? Well, you can do a few data science projects, but you need to make space for that, of course.",
      "id": "ep_81_ut_84"
    },
    {
      "end": 2631714,
      "speaker": "D",
      "start": 2601814,
      "text": "I think it's also important and sometimes difficult to explain what this thing is still. I mean, there's a lot of, like, you guys are doing a great podcast for several years. There's amazing blogs and, you know, columns and articles written about the field. But some clients, they still like, you know, they're having difficulties to imagine what data science will deliver or what data visualization is going to be. So it's always good to show some examples and some previous work.",
      "id": "ep_81_ut_85"
    },
    {
      "end": 2663632,
      "speaker": "Moritz Stefaner",
      "start": 2632254,
      "text": "Yeah. So guys, we need to wrap up soon. Time flies as usual. But I have, I think I have two more questions for both of us. So the first one is Tuyan, why? So if somebody just, let's say, graduated datavis school, yeah, if it exists, why should they become a freelancer? Like, what are the advantages of being a freelancer? Maybe Mahir, maybe you can pitch the agency situation, like, what makes working in an agency really cool? That's the nice course you want to start.",
      "id": "ep_81_ut_86"
    },
    {
      "end": 2664176,
      "speaker": "Mahir Yavuz",
      "start": 2663688,
      "text": "Yeah, sure.",
      "id": "ep_81_ut_87"
    },
    {
      "end": 2667164,
      "speaker": "Moritz Stefaner",
      "start": 2664240,
      "text": "Yeah. And then I will give scores, of course.",
      "id": "ep_81_ut_88"
    },
    {
      "end": 2727146,
      "speaker": "Mahir Yavuz",
      "start": 2668784,
      "text": "Okay. Well, what I personally really love the most, and actually maybe even more than doing the work itself, is freedom to do what I want, not having a boss telling me what to do. And so this freelancing work also leads to a lot of diversity and variety. So right now I also have the workshops. Sometimes your work gets published in books or magazines, and then you talk at a conference, and so there's a lot of variety and you can all decide by yourself what you want to do. And I think that's absolutely the greatest thing about being a freelancer. And yeah, obviously data visualization itself is great, but I. Yeah, that's the same for exactly. Freedom. Absolutely.",
      "id": "ep_81_ut_89"
    },
    {
      "end": 2731194,
      "speaker": "Moritz Stefaner",
      "start": 2727330,
      "text": "Main motivation for you, Mahir, how can you counter that?",
      "id": "ep_81_ut_90"
    },
    {
      "end": 2768804,
      "speaker": "D",
      "start": 2731354,
      "text": "I think agency comes with two things. The first thing is the team. I'm sure we all experienced that, you know, sometimes working with other people is a really good experience. There are like, you know, some days and projects that you really need, someone holding your hand telling you that everything is gonna be fine. That's really important. And obviously you need a good team. I can't talk on behalf of all the agency life, but I think we have a great team at RGA. And the second thing is, I realized certain projects is only comes to certain size of companies.",
      "id": "ep_81_ut_91"
    },
    {
      "end": 2769808,
      "speaker": "Mahir Yavuz",
      "start": 2769224,
      "text": "That's true.",
      "id": "ep_81_ut_92"
    },
    {
      "end": 2815134,
      "speaker": "D",
      "start": 2769856,
      "text": "Like, and this is a reality. And I think it has a lot to do with legal issues. It has a lot to do with like, you know, trust and relationship and so on and so on. So some projects as a freelancer, I never had the chance to get a hold on, but in the agency, they come to you and they say, we really respect your agency. Maybe not because of the work our team did, but some other work. And we have a great relationship. So this is a very special project for us and we want to do it with you. So I think that experience is valuable. Maybe not for a lifetime, but you know, it is interesting to see that special projects and working with those special teams on the client side, right? Yeah.",
      "id": "ep_81_ut_93"
    },
    {
      "end": 2838284,
      "speaker": "Moritz Stefaner",
      "start": 2815834,
      "text": "So I would say there's something to both arguments. I tend to lean on the freelance side, but that's my personal bias and the very final question. So in case, do you have any advice for people just getting started out? Like, what is the thing you wish somebody had told you before you got into this whole mess?",
      "id": "ep_81_ut_94"
    },
    {
      "end": 2861218,
      "speaker": "Mahir Yavuz",
      "start": 2838784,
      "text": "Well, I think the most important thing is just to practice and to get experience if you want to become good at this, because you can read a lot of books or do trainings or whatever, but if you don't practice it yourself, it's really hard to become very good at it. So I think that's the most important thing.",
      "id": "ep_81_ut_95"
    },
    {
      "end": 2865814,
      "speaker": "Moritz Stefaner",
      "start": 2861346,
      "text": "And also not just practicing database, but also practicing doing a project, right?",
      "id": "ep_81_ut_96"
    },
    {
      "end": 2869294,
      "speaker": "Mahir Yavuz",
      "start": 2866754,
      "text": "Yeah, exactly. Just getting experience.",
      "id": "ep_81_ut_97"
    },
    {
      "end": 2874722,
      "speaker": "Moritz Stefaner",
      "start": 2870114,
      "text": "Okay, so not everything can be handled through books and checklists. I guess that's true.",
      "id": "ep_81_ut_98"
    },
    {
      "end": 2875814,
      "speaker": "Mahir Yavuz",
      "start": 2874818,
      "text": "I guess so.",
      "id": "ep_81_ut_99"
    },
    {
      "end": 2878838,
      "speaker": "Moritz Stefaner",
      "start": 2876534,
      "text": "Mahir, how about you? Do you have any tips?",
      "id": "ep_81_ut_100"
    },
    {
      "end": 2937500,
      "speaker": "D",
      "start": 2878886,
      "text": "I agree. I think the tip, maybe two tips. The first tip is people like we do business with other people. Personalities are important. Their work style is important. Their work ethics are important. Even if it's a data visualization work, maybe it's not so much different than doing a restaurant business or doing any other service business. So personalities. And then the second thing is this, even if you graduated from the business school, I think certain aspects of the business can only be practiced in real life. Like that hustling or when the scope is just somewhere in between. You have a gut feeling and you follow it, and sometimes you fail, sometimes you don't. Those kind of things can only learn by practice. And it's not only about, it comes to a point that it's not only about data visualization. This is a business. You should also practice the other sides.",
      "id": "ep_81_ut_101"
    },
    {
      "end": 2960172,
      "speaker": "Moritz Stefaner",
      "start": 2937532,
      "text": "Of the business as well and take them serious as well. Right. So that's something I learned over the years. It's like, yeah, this is all part of the whole package, as you say, the whole people aspect, the whole planning aspect, the communications. And suddenly you realize, well, I only think, well, a small percentage of time about the colors or if I use like an area chart or a line chart here.",
      "id": "ep_81_ut_102"
    },
    {
      "end": 2962344,
      "speaker": "D",
      "start": 2960348,
      "text": "Exactly right.",
      "id": "ep_81_ut_103"
    },
    {
      "end": 2984672,
      "speaker": "Moritz Stefaner",
      "start": 2964184,
      "text": "Interesting. Thanks so much for joining us. I think people can reach you on Twitter. So we will put your Twitter handles in the blog post. So if you have questions for Jan and Mahir beyond what we discussed, just ping them. They will gladly answer, I'm sure. And thanks so much again, guys, for coming on the show and hope to see you in person soon.",
      "id": "ep_81_ut_104"
    },
    {
      "end": 2986064,
      "speaker": "Mahir Yavuz",
      "start": 2984768,
      "text": "Yeah, yeah, I do, too.",
      "id": "ep_81_ut_105"
    },
    {
      "end": 2987032,
      "speaker": "D",
      "start": 2986104,
      "text": "Thanks for having us.",
      "id": "ep_81_ut_106"
    },
    {
      "end": 2987600,
      "speaker": "Moritz Stefaner",
      "start": 2987088,
      "text": "Bye bye.",
      "id": "ep_81_ut_107"
    },
    {
      "end": 2988648,
      "speaker": "D",
      "start": 2987672,
      "text": "Bye bye bye.",
      "id": "ep_81_ut_108"
    },
    {
      "end": 2989844,
      "speaker": "Moritz Stefaner",
      "start": 2988776,
      "text": "Thanks so much.",
      "id": "ep_81_ut_109"
    },
    {
      "end": 3006700,
      "speaker": "E",
      "start": 2997004,
      "text": "Hey, guys, thanks for listening to data stories again. Before you leave, we have a request if you can spend a couple of minutes rating us on iTunes, that would be extremely helpful for the show.",
      "id": "ep_81_ut_110"
    },
    {
      "end": 3037468,
      "speaker": "Jan Willem Tulp",
      "start": 3006812,
      "text": "And here's also some information on the many ways you can get news directly from us. We're, of course, on twitter@twitter.com. Datastories we have a Facebook page@Facebook.com. datastoriespodcast. All in one word. And we also have an email newsletter. So if you want to get news directly into your inbox and be notified whenever we publish an episode, you can go to our homepage datastory es and look for the link that you find on the bottom in the footer.",
      "id": "ep_81_ut_111"
    },
    {
      "end": 3049556,
      "speaker": "E",
      "start": 3037556,
      "text": "So one last thing that we want to tell you is that we love to get in touch with our listeners, especially if you want to suggest a way to improve the show or amazing people you want us to invite or even projects you want us to talk about.",
      "id": "ep_81_ut_112"
    },
    {
      "end": 3050444,
      "speaker": "Jan Willem Tulp",
      "start": 3049660,
      "text": "Yeah, absolutely.",
      "id": "ep_81_ut_113"
    },
    {
      "end": 3054732,
      "speaker": "Moritz Stefaner",
      "start": 3050484,
      "text": "So don't hesitate to get in touch with us. It's always a great thing for us.",
      "id": "ep_81_ut_114"
    },
    {
      "end": 3084324,
      "speaker": "Jan Willem Tulp",
      "start": 3054868,
      "text": "And that's all for now. See you next time, and thanks for listening to data stories data stories is brought to you by Qlik, who allows you to explore the hidden relationships within your data that lead to meaningful insights. Let your instincts lead the way to create personalized visualizations and dynamic dashboards with Qlik sense, which you can download for free at click de data stories. That's Qlik deries.",
      "id": "ep_81_ut_115"
    }
  ],
  "confidence": 0.936899545898437,
  "audio_duration": 3084,
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_status_code": null,
  "webhook_auth": false,
  "webhook_auth_header_name": null,
  "speed_boost": false,
  "auto_highlights_result": null,
  "auto_highlights": false,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_audio_quality": null,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "content_safety": false,
  "iab_categories": true,
  "content_safety_labels": {
    "status": "unavailable",
    "results": [],
    "summary": {}
  },
  "language_detection": false,
  "language_detection_threshold": null,
  "language_confidence": null,
  "custom_spelling": null,
  "throttled": false,
  "auto_chapters": true,
  "summarization": false,
  "summary_type": null,
  "summary_model": null,
  "custom_topics": false,
  "topics": [],
  "speech_threshold": null,
  "speech_model": "best",
  "chapters": [
    {
      "summary": "Qlik Datastories allows you to explore the hidden relationships within your data. Let your instincts lead the way to create personalized visualizations and dynamic dashboards with Qlik sense.",
      "gist": "Data Stories: The Story of Qlik",
      "headline": "Let your instincts lead the way to create personalized visualizations with Qlik sense",
      "start": 200,
      "end": 30474,
      "id": "ep_81_ch_0"
    },
    {
      "summary": "Jan Willem Tulp is a freelance information designer from the Netherlands. Mahir Yavuz is the creative director of data science and visualization at RGA in New York City. How do you find new projects and how do you come up with good end results?",
      "gist": "How to Get a Job as a Freelancer",
      "headline": "This episode focuses on the business of doing data visualizations for other people",
      "start": 49844,
      "end": 293376,
      "id": "ep_81_ch_1"
    },
    {
      "summary": "RGA is a big agency, and it's a global one. The acquisition of the work is completely different. How will you figure out if a project is worthwhile? There are three main domains.",
      "gist": "Working at RGA, Data Science Projects",
      "headline": "The acquisition of data science work at RGA is completely different from freelancing",
      "start": 293480,
      "end": 704724,
      "id": "ep_81_ch_2"
    },
    {
      "summary": "The data itself, that is something I would like to get a sense of really soon, if it's possible. I don't think I start working on a project before I have a contract. How do you deal with this, this whole situation, this black art of pricing and scoping?",
      "gist": "Projects and the Data",
      "headline": "You start working on a project before you have a contract",
      "start": 705144,
      "end": 1234466,
      "id": "ep_81_ch_3"
    },
    {
      "summary": "Moritz: I think client relationship is pretty critical. If we have a relationship with that particular client, we also can optimize scoping and budgeting and signing contracts based on that relationship. You also need to spend some time and money to understand whether your project is a really realistic and grounded idea or is just a dream.",
      "gist": "The Data Visualization Proposal",
      "headline": "Moritz: Building trust with clients is very critical for successful projects",
      "start": 1234570,
      "end": 1508984,
      "id": "ep_81_ch_4"
    },
    {
      "summary": "This week we would like to feature a special initiative from Qlik. Let your instincts lead the way to create personalized visualizations and dynamic dashboards with Qlik Sense. Make sure to also try out Qlik sense for free at Qlik Datastories.",
      "gist": "Qlik for Water Scarcity",
      "headline": "Qlik allows you to explore hidden relationships within your data that lead to meaningful insights",
      "start": 1513554,
      "end": 1599156,
      "id": "ep_81_ch_5"
    },
    {
      "summary": "I always emphasize early in the process that I would like to work with the actual data, not just a part of it or mock up data or something. It's getting better, but sometimes we still don't have the data timely enough. One thing that I'm trying to do more and more is holding client workshops to talk about the structure of the data.",
      "gist": "The Data & Visualization Process",
      "headline": "Sometimes the data arrives late and contradicts what your mock ups say",
      "start": 1599320,
      "end": 1871774,
      "id": "ep_81_ch_6"
    },
    {
      "summary": "If the data is like really critical for the business, then clients don't want to share. What is a better way to do data visualization without the data? I think it's a great question.",
      "gist": "Full data sets for business visualization",
      "headline": "If the data is really critical for the business, then clients might not share",
      "start": 1871814,
      "end": 1939794,
      "id": "ep_81_ch_7"
    },
    {
      "summary": "Some clients always want things that are super hard to do and make the whole project ten times more expensive. Sometimes there's like really elegant solutions, you know, to do something almost as good with much simpler means.",
      "gist": "The Big Things",
      "headline": "There are some things that some clients always want, but are super expensive",
      "start": 1940094,
      "end": 2117864,
      "id": "ep_81_ch_8"
    },
    {
      "summary": "Janice has been experimenting with corporate data art format. How do you balance that with the more inbox driven approach? Do more self commissioned work or build an app yourself. Could it be a whole business at some point?",
      "gist": "Self-Commissioned Work",
      "headline": "One strategy is to do more self commissioned work or build an app yourself",
      "start": 2118524,
      "end": 2365140,
      "id": "ep_81_ch_9"
    },
    {
      "summary": "Mahir, how do you handle that in the agency? Do you have time for that at all, or is there a weekend thing? Definitely not. What we, what, what I do personally and my team is very flexible and agile in that regard. Sometimes trying in the real projects brings a lot of learning experience.",
      "gist": "Experimental work in the agency",
      "headline": "Learning is a big part of what we do in many fronts",
      "start": 2365212,
      "end": 2636694,
      "id": "ep_81_ch_10"
    },
    {
      "summary": "Tuyan: What I personally love the most is freedom to do what I want, not having a boss telling me what to do. Mahir: Agency comes with two things. The first thing is the team. I tend to lean on the freelance side, but that's my personal bias.",
      "gist": "Both freelancers and agency pros: What's the difference?",
      "headline": "Tuyan: What are the advantages of being a freelancer",
      "start": 2636774,
      "end": 2828952,
      "id": "ep_81_ch_11"
    },
    {
      "summary": "Jan: The most important thing is just to practice and to get experience. Mahir: Personalities are important. Certain aspects of the business can only be practiced in real life. If you have questions for Jan and Mahir beyond what we discussed, just ping them.",
      "gist": "Data Visualization Start-Up Advice",
      "headline": "Jan and Mahir share their advice on starting a data visualization business",
      "start": 2829048,
      "end": 2989844,
      "id": "ep_81_ch_12"
    },
    {
      "summary": "Hey, guys, thanks for listening to data stories again. We have a request if you can spend a couple of minutes rating us on iTunes. Here's also some information on the many ways you can get news directly from us. Don't hesitate to get in touch with us.",
      "gist": "Data Stories",
      "headline": "Before you leave, we have a request if you can spend a couple of minutes rating data stories",
      "start": 2997004,
      "end": 3084324,
      "id": "ep_81_ch_13"
    }
  ],
  "disfluencies": false,
  "entity_detection": false,
  "sentiment_analysis": false,
  "sentiment_analysis_results": null,
  "entities": null,
  "speakers_expected": null,
  "summary": null,
  "custom_topics_results": null,
  "episode_num": 81,
  "episode_metadata": {
    "speakers": [
      "Mahir Yavuz",
      "Moritz Stefaner",
      "Jan Willem Tulp"
    ],
    "WPid": "750",
    "url": "https://datastori.es/podlove/file/2999/s/feed/c/mp3/81-freelance-or-company-with-mahir-yavuz-and-jan-willem-tulp.mp3",
    "episode_title": "The Hustle with Mahir Yavuz and Jan Willem Tulp"
  }
}