{
  "id": "cb150ac7-217a-42bb-8c2b-d6cf074db547",
  "language_model": "assemblyai_default",
  "acoustic_model": "assemblyai_default",
  "language_code": "en_us",
  "status": "completed",
  "audio_url": "https://datastori.es/podlove/file/6836/s/feed/c/mp3/164-edward-tuftes-complete-work-with-sandra-rendgen.mp3",
  "utterances": [
    {
      "end": 8490,
      "speaker": "Sandra Rendgen",
      "start": 120,
      "text": "What I liked about his work was that he said design. You know, the fact that it looks good is not just a luxury, it's a necessity.",
      "id": "ep_164_ut_0"
    },
    {
      "end": 50090,
      "speaker": "Moritz Stefaner",
      "start": 28310,
      "text": "Hi everyone. Welcome to a new episode of Data stories. We are back. It's incredible. After months of silence, we finally made it. Anyways, glad to be back. My name is Mauritsh Stefaner. I'm an independent designer of data visualizations and I work as a self employed truth and beauty operator out of my office here in the countryside in the beautiful north of Germany.",
      "id": "ep_164_ut_1"
    },
    {
      "end": 64686,
      "speaker": "Enrico Bertini",
      "start": 50470,
      "text": "And I am Enrico Bertini. I am a professor at New York University, where I teach, teach and do research in data visualization. And I'm not in New York right now, but it's fine. Normally I'm there in normal.",
      "id": "ep_164_ut_2"
    },
    {
      "end": 66918,
      "speaker": "Moritz Stefaner",
      "start": 64718,
      "text": "Where did you go? Where did you escape to?",
      "id": "ep_164_ut_3"
    },
    {
      "end": 68010,
      "speaker": "Enrico Bertini",
      "start": 67014,
      "text": "It's a secret.",
      "id": "ep_164_ut_4"
    },
    {
      "end": 72414,
      "speaker": "Moritz Stefaner",
      "start": 68870,
      "text": "In a secret location, but I hear snow in it.",
      "id": "ep_164_ut_5"
    },
    {
      "end": 74890,
      "speaker": "Enrico Bertini",
      "start": 72462,
      "text": "I'm hiding in the mountains.",
      "id": "ep_164_ut_6"
    },
    {
      "end": 91682,
      "speaker": "Moritz Stefaner",
      "start": 75990,
      "text": "Very good, as one should in these times. Anyways, on this podcast together we talk about data visualization, data analysis, and generally the role data plays in our lives. Usually we do that together with the guests we invite on the show.",
      "id": "ep_164_ut_7"
    },
    {
      "end": 120680,
      "speaker": "Enrico Bertini",
      "start": 91786,
      "text": "That's right. But before we start, a usual quick note. Our podcast is listed as supported, so there's no ads, which is quite nice. And if you enjoy the show, please consider supporting us with recurring payments on patreon.com Datastories. Or if you prefer, you can also send us one time donations on Paypal following this URL. PayPal me Datastories.",
      "id": "ep_164_ut_8"
    },
    {
      "end": 206460,
      "speaker": "Moritz Stefaner",
      "start": 120840,
      "text": "Yeah. So the topic today is one we had on our list for a long time. We are going to discuss Edward Tufte's work and his new book. So he has a new book out. It's called seeing with Fresh Eyes. And yeah, we'll use the opportunity to talk about this whole body of work and his influence on the data we've seen. And I'm sure many of you will have heard of him. And if not, you will hear about what this man has contributed to our little Datavis scene. And we have a special guest we want to bring on later. But before, we wanted to mention a few quick projects we've been working on in the meantime. So the first thing what kept me busy, and honestly also sort of kept us a bit from recording, I'll have to admit, was I was involved. I still am in the German Covid-19 vaccination dashboard. So it's the IMF dashboard. Vaccination dashboard. And yeah, we built an interactive mobile first site showing all the vaccination statistics in Germany. Launch it like six weeks ago and now keep updating it and keep refining it. And yeah, it's great to be involved in something as important as this, but also quite demanding, of course, as you can imagine. Anyways, you can check it out, we'll put the link in the show notes and it should hopefully translate well also to other languages. At least that was our goal.",
      "id": "ep_164_ut_9"
    },
    {
      "end": 216976,
      "speaker": "Enrico Bertini",
      "start": 206630,
      "text": "Yeah, that's a big project. More. It's. Congratulations. I mean, with this you're reaching I don't know how many people, but it's must be exciting and frightening at the same time.",
      "id": "ep_164_ut_10"
    },
    {
      "end": 244632,
      "speaker": "Moritz Stefaner",
      "start": 217128,
      "text": "Yeah, and it's really like relevant information. We want to get everything right and one of our goals was really to make it so accessible that everybody can consume it well. And so we didn't like try to do super fancy Sankey diagrams or cool interactive charts, but really nail the basics really well and have really good text and generate text automatically and have really accessible and responsive charts and yeah, I'm sort of also a bit proud how it turned out.",
      "id": "ep_164_ut_11"
    },
    {
      "end": 247780,
      "speaker": "Enrico Bertini",
      "start": 244696,
      "text": "Of course. Yeah, you should be.",
      "id": "ep_164_ut_12"
    },
    {
      "end": 252928,
      "speaker": "Moritz Stefaner",
      "start": 248720,
      "text": "And it's worked together with studio NAND and cosmonauts and kings, I should mention.",
      "id": "ep_164_ut_13"
    },
    {
      "end": 255672,
      "speaker": "Enrico Bertini",
      "start": 252984,
      "text": "Oh yeah, the usual suspects.",
      "id": "ep_164_ut_14"
    },
    {
      "end": 258408,
      "speaker": "Moritz Stefaner",
      "start": 255776,
      "text": "Yeah, that's true. That's true.",
      "id": "ep_164_ut_15"
    },
    {
      "end": 258928,
      "speaker": "Enrico Bertini",
      "start": 258464,
      "text": "Yeah.",
      "id": "ep_164_ut_16"
    },
    {
      "end": 260248,
      "speaker": "Moritz Stefaner",
      "start": 259024,
      "text": "By now, yes.",
      "id": "ep_164_ut_17"
    },
    {
      "end": 261916,
      "speaker": "Enrico Bertini",
      "start": 260424,
      "text": "By now, yeah.",
      "id": "ep_164_ut_18"
    },
    {
      "end": 263680,
      "speaker": "Moritz Stefaner",
      "start": 262008,
      "text": "What have you been up to, Enrico?",
      "id": "ep_164_ut_19"
    },
    {
      "end": 334276,
      "speaker": "Enrico Bertini",
      "start": 264860,
      "text": "Lots of crazy things in my life, of course, but on the more professional side of things, I just want to quickly mention a couple of things. There's a tool that we are publishing online that is called slice lens, and it's part of our larger effort to create data visualization tools to help people understand machine learning models. And so how do you support, say data, data scientists or even domain experts in understanding how a model behaves before you actually put it in production, which as you can imagine is quite important. And slice lens is one of the first thing that we are publishing out there. It's a little tool where you can select the attributes or variables of your data set and see how the model behaves in specific subsets. And the idea is that the system guides you in selecting these subsets so you're not just aimlessly browsing, the system tells you, oh, since you're selecting this, why don't you look at that? So there's a little bit of a recommendation engine behind it. So I'm really excited about it.",
      "id": "ep_164_ut_20"
    },
    {
      "end": 344532,
      "speaker": "Moritz Stefaner",
      "start": 334348,
      "text": "Yeah, I like that a lot. It's really simple but really clever. And I think the general paradigm of oh, here's a split of the data you might want to look at. It is really powerful and that's that's.",
      "id": "ep_164_ut_21"
    },
    {
      "end": 407110,
      "speaker": "Enrico Bertini",
      "start": 344556,
      "text": "What I love of the project. Even though sometime in the research community people say this is too simple, which should be a positive thing. Right? It's too simple. What is too simple? Anyway, so the second thing I want to briefly mention is that my excellent PhD student Danyel Kerrigan has been helping me over the last two years with my infovis course, and he's been developing over times observable notebooks for teaching. And I started publishing some of these notebooks online and I'm so happy with it. And as a general remark, observable for teaching has been a godsend for us. I absolutely love it. I could talk for hours about it. But if you want to take a look, we will put the links in the show notes and I'm happy to share because they can be used by other teachers or people who want to learn through these notebooks. And the collection is growing, so it's a good resource. I like it a lot.",
      "id": "ep_164_ut_22"
    },
    {
      "end": 435142,
      "speaker": "Moritz Stefaner",
      "start": 407810,
      "text": "That's awesome. That's another thing that happened in the meantime. D3 turned ten years old and the most influential data visualization library. As some of you know, Mike Boston, the original author of D3, moved on to working on observable a few years ago. And it's really turning out to be a really promising platform for creating cool interactive Dataviz and sharing Dataviz. And sharing the makings of Dataviz. Right.",
      "id": "ep_164_ut_23"
    },
    {
      "end": 435926,
      "speaker": "Enrico Bertini",
      "start": 435286,
      "text": "Exactly.",
      "id": "ep_164_ut_24"
    },
    {
      "end": 443870,
      "speaker": "Moritz Stefaner",
      "start": 435998,
      "text": "That might be worth another whole episode observable in specific or interactive notebooks. Interactive documents. Such a cool.",
      "id": "ep_164_ut_25"
    },
    {
      "end": 445170,
      "speaker": "Enrico Bertini",
      "start": 443910,
      "text": "Oh, yeah, absolutely.",
      "id": "ep_164_ut_26"
    },
    {
      "end": 475062,
      "speaker": "Moritz Stefaner",
      "start": 445700,
      "text": "Yeah. Anyways, that's for another day. Yeah. Today we want to discuss more classical stuff than futuristic interactive notebooks. We want to talk about Edward Tufte's work and his perspective on Dataviz. And we have a special guest that some of you might be familiar with from previous episodes or because she was part of the data stories team even. And so. Hi and special welcome to Sandra Rendgen. Hi.",
      "id": "ep_164_ut_27"
    },
    {
      "end": 479078,
      "speaker": "Sandra Rendgen",
      "start": 475206,
      "text": "Hi. Hi, Moritz. Hi, Enrico. It's really great to be back. Hi.",
      "id": "ep_164_ut_28"
    },
    {
      "end": 480974,
      "speaker": "Moritz Stefaner",
      "start": 479214,
      "text": "Thanks for joining us once again.",
      "id": "ep_164_ut_29"
    },
    {
      "end": 483718,
      "speaker": "Sandra Rendgen",
      "start": 481022,
      "text": "Yeah. Yes. It's really fun.",
      "id": "ep_164_ut_30"
    },
    {
      "end": 500494,
      "speaker": "Moritz Stefaner",
      "start": 483814,
      "text": "Yeah. And I think you're a perfect match for this episode. You're an acclaimed author yourself. You know a lot about historical database as well. And yeah, you have followed the scene for a long time. So we are really interested in hearing your thoughts about Edward Tufte's work.",
      "id": "ep_164_ut_31"
    },
    {
      "end": 510402,
      "speaker": "Sandra Rendgen",
      "start": 500622,
      "text": "Yeah, I think we can throw a good mix of opinions together also because we come from different backgrounds like the three of us. So I think it's going to be a good mixture.",
      "id": "ep_164_ut_32"
    },
    {
      "end": 514570,
      "speaker": "Moritz Stefaner",
      "start": 510466,
      "text": "Yeah. Yeah, absolutely. What is your background, by the way, for other people who don't follow you?",
      "id": "ep_164_ut_33"
    },
    {
      "end": 565738,
      "speaker": "Sandra Rendgen",
      "start": 514650,
      "text": "My background, yeah, that's a good question. I should note here right at the beginning, I'm more of a humanities person, actually. I've studied art history and cultural theory. So that's more of, you know, that's sort of the background I'm coming from. And as some of you may know, I've started looking at the field of infovis, Dataviz some twelve years ago, looking more at contemporary work in the field and trying to observe how it evolves, how the whole data scene evolves. And then a few years ago, I also turned into looking at the history, and I've published two books about that as well. And that was really interesting. And that's also, you know, very related to Edward Tufte's work because he's also done a lot about making us observe the history of the field.",
      "id": "ep_164_ut_34"
    },
    {
      "end": 571198,
      "speaker": "Moritz Stefaner",
      "start": 565794,
      "text": "So. Yeah, yeah. And your last book looked at Charles Minard's work called the Minard System.",
      "id": "ep_164_ut_35"
    },
    {
      "end": 572590,
      "speaker": "Sandra Rendgen",
      "start": 571374,
      "text": "Exactly. Yeah.",
      "id": "ep_164_ut_36"
    },
    {
      "end": 580078,
      "speaker": "Moritz Stefaner",
      "start": 572670,
      "text": "You went into great depth discussing all this great historical works from Charles Minard from the 19th century.",
      "id": "ep_164_ut_37"
    },
    {
      "end": 602682,
      "speaker": "Sandra Rendgen",
      "start": 580254,
      "text": "Exactly. And yeah, it was really Tufte and also Michael friendly who sort of paved the ground for this kind of research. So I guess we can look into a little bit into how they started threads of research with their books. And so Edward Tufte has certainly provided a lot of impulses for that.",
      "id": "ep_164_ut_38"
    },
    {
      "end": 619498,
      "speaker": "Moritz Stefaner",
      "start": 602786,
      "text": "Yeah. I mean, maybe to provide a bit of background. So he used to be a professor for political science and statistics and computer science at Yale. And I think he wrote his first books in the eighties, I would say. Right. Sandra, do you know when the series started like he's famous for?",
      "id": "ep_164_ut_39"
    },
    {
      "end": 633782,
      "speaker": "Sandra Rendgen",
      "start": 619554,
      "text": "Yeah, the first book came out in 1982. That was the publishing date. But I know he's been working on it a few years earlier. So the research and the concept for the book goes back to the seventies.",
      "id": "ep_164_ut_40"
    },
    {
      "end": 644286,
      "speaker": "Moritz Stefaner",
      "start": 633926,
      "text": "Yeah, yeah, yeah. That first book is the visual display of quantitative information. I think, without spoiling anything, I think it's one of the cornerstone books in data visualization, or maybe.",
      "id": "ep_164_ut_41"
    },
    {
      "end": 645030,
      "speaker": "Sandra Rendgen",
      "start": 644438,
      "text": "Absolutely.",
      "id": "ep_164_ut_42"
    },
    {
      "end": 690450,
      "speaker": "Moritz Stefaner",
      "start": 645070,
      "text": "It's like one of these lonely island books. If you can only bring three books, I think for many of us it would be one of the ones. The first few pages are just a home run. He starts with Anscombe's quartet. Why do we even visualize? And he has so good examples, like why visuals are so much more powerful than any other form of representing information. Then Jon Snow, the cholera map. Charles Minard is the famous march to Moscow diagram. It's all there just on the first few pages. And for a lot of people, that was the first exposure, as you said to oh, there has been data visualization before excel, right?",
      "id": "ep_164_ut_43"
    },
    {
      "end": 691482,
      "speaker": "Sandra Rendgen",
      "start": 690610,
      "text": "Yeah, totally.",
      "id": "ep_164_ut_44"
    },
    {
      "end": 717010,
      "speaker": "Moritz Stefaner",
      "start": 691506,
      "text": "And it's actually super interesting what people did in the 19th century. And I think roughly speaking, I would say half of the people I know in data visualization say this book sort of opened their eyes or that made them move into data visualization from some other field. Right. Or at least one of the Tufte books. Is that fair to say? Is that your perception as well, or is that just my little bubble of Tufte fans?",
      "id": "ep_164_ut_45"
    },
    {
      "end": 719250,
      "speaker": "Sandra Rendgen",
      "start": 717670,
      "text": "Enrico, what would you say?",
      "id": "ep_164_ut_46"
    },
    {
      "end": 786254,
      "speaker": "Enrico Bertini",
      "start": 720190,
      "text": "Well, that was definitely the case for me. I can say if it was the first book I readdeze on visualization, but one of the firsts, and it had a huge impact on the way I saw visualization and its relevance in the world. And also just being fascinated, completely fascinated by it. I clearly remember this idea. I want to do this. When I discovered this, I had no doubts. I wanted to work on this. I never had a doubt. So in this sense, Tufte was, was a huge influence. And especially the first book, I have to say, I still refer back to those concepts. And I think it's also worth mentioning and fair to say that it's the most structured book, right, where Tufte really tries to come up with principles, guidelines, things that stuck right in your mind and you keep reminding yourself all the time or finding examples that match those guidelines. Right?",
      "id": "ep_164_ut_47"
    },
    {
      "end": 867420,
      "speaker": "Sandra Rendgen",
      "start": 786302,
      "text": "Yeah. Also in a way that he's very good in putting observation into succinct words, basically into succinct rules that you can follow. And that's sort of, as you said, that sort of stick in your mind. And the other thing that I think is really interesting about this book is that it's a very rare, up to this date. It's a very rare combination of design. I mean, a lot like a huge part of the book is about design excellence. And it's not just that he writes about it, he, like the book, embodies this concept. Right. And this is very up to this date. It's very rare to have this like really close combination of scientific rigor that he's also campaigning for throughout the book. That's also a huge part of the book, campaigning for statistical rigor and scientific rigor, but also for design excellence. And the book is, the way it's laid out and the way it's arranged is also very, very convincing in that sense. And I don't know, very many other books who've achieved that. Right. This combination of intellectual rigor and design. So I guess that's the German word.",
      "id": "ep_164_ut_48"
    },
    {
      "end": 869156,
      "speaker": "Moritz Stefaner",
      "start": 867460,
      "text": "Gesamtkunstwerk comes.",
      "id": "ep_164_ut_49"
    },
    {
      "end": 927940,
      "speaker": "Sandra Rendgen",
      "start": 869308,
      "text": "Yeah, Gesundfec. And that's probably also part of why it was so influential. And what I was gonna add was that. I know, because. Because, Moritz, you said that many people got into the field through this book. What I want to add is that, interestingly, I think he made a huge step into the design community. Who saw a first, you know, who saw a book that was very well laid out very well, that had a lot of design principles in it, but was tackling a field that the design community wasn't really interested in before this book came out, before the eighties. So I think that the people who looked at design in visualization, that was really just a very few people. And so I guess this is one very big achievement of this first book, having made popular the whole database field in the design community.",
      "id": "ep_164_ut_50"
    },
    {
      "end": 940316,
      "speaker": "Moritz Stefaner",
      "start": 928100,
      "text": "Yeah, we'll discuss his key concepts also later, but we can also first give a bit of an overview of his total series of books and then sort of dive into the details there. Sorry, Enrico, I cut you off.",
      "id": "ep_164_ut_51"
    },
    {
      "end": 959346,
      "speaker": "Enrico Bertini",
      "start": 940388,
      "text": "Go ahead. No, that's fine. I just wanted to say that still today, I think people who are not working directly in visualization, but when they talk about information design or give suggestions about information design, that would refer anyone to Tufte, right?",
      "id": "ep_164_ut_52"
    },
    {
      "end": 1000540,
      "speaker": "Moritz Stefaner",
      "start": 959458,
      "text": "Yeah, yeah. First book, visual display of quantitative information. True classic. Second one, envisioning information. Yeah, this one's a bit more qualitative and a bit more varied, a bit more illustration heavy. Also, like it's more colorful and more pictorial, is my recollection. Right. So it's a really nice compliment because the first one was really about data and little dots and lines and, you know, numbers. And the second was more about concepts and categories and topics, themes, thematic illustration. Yeah, really nice one, too. I love this one as well.",
      "id": "ep_164_ut_53"
    },
    {
      "end": 1018190,
      "speaker": "Enrico Bertini",
      "start": 1001080,
      "text": "The third one, I think what it does there. Sorry, just briefly, I think what he does there still somewhat systematically talks about color in a system somewhat systematic way. And he has this concept of layering and separation that I think it's hard to grasp.",
      "id": "ep_164_ut_54"
    },
    {
      "end": 1019238,
      "speaker": "Moritz Stefaner",
      "start": 1018270,
      "text": "Hierarchy.",
      "id": "ep_164_ut_55"
    },
    {
      "end": 1033866,
      "speaker": "Enrico Bertini",
      "start": 1019414,
      "text": "Visual hierarchy. So there are some. And if I'm not mistaken, correct me if I'm wrong, I believe that the idea of small multiples appears there first and not in the first book. Maybe I'm wrong in the first book.",
      "id": "ep_164_ut_56"
    },
    {
      "end": 1055042,
      "speaker": "Moritz Stefaner",
      "start": 1033898,
      "text": "But it's called Philip's plot. Oh, no, the Philips plot was the connected scatter plot that appeared there out of nowhere. And I was like, wow, it's a connected scatter plot from the seventies. And now everybody thinks it's a new invention. But Tufte had it, like, on page, I don't know, 17 in his first book. That's fun. But, yeah, the small multiples. Maybe they came in the second book.",
      "id": "ep_164_ut_57"
    },
    {
      "end": 1057114,
      "speaker": "Enrico Bertini",
      "start": 1055226,
      "text": "I think he has a whole chapter.",
      "id": "ep_164_ut_58"
    },
    {
      "end": 1064194,
      "speaker": "Moritz Stefaner",
      "start": 1057202,
      "text": "I know it's on page 48. He has a small multiples page. Oh, small multiples of connected scatter plot.",
      "id": "ep_164_ut_59"
    },
    {
      "end": 1067910,
      "speaker": "Enrico Bertini",
      "start": 1064282,
      "text": "Oh, my God, 80. What?",
      "id": "ep_164_ut_60"
    },
    {
      "end": 1099734,
      "speaker": "Moritz Stefaner",
      "start": 1070890,
      "text": "Yeah, from the seventies. So, you know, that's the thing. So we keep rediscovering all this stuff that Tufte has already discovered in the eighties. Yeah, that's the way things go. Anyways, good book, too. Then we have two follow up books, visual explanations and beautiful evidence. I would say it's fair to say these get a bit more anecdotal. Like, each chapter presents one idea, but it's not an overarching argument anymore. But it's more like, hey, here's another thing I'm interested in now.",
      "id": "ep_164_ut_61"
    },
    {
      "end": 1103530,
      "speaker": "Enrico Bertini",
      "start": 1099782,
      "text": "Yeah, yeah. There's less of an overarching theme. Right.",
      "id": "ep_164_ut_62"
    },
    {
      "end": 1114580,
      "speaker": "Moritz Stefaner",
      "start": 1104070,
      "text": "He goes into sculptures or he goes into, I don't know, individual techniques he's interested in, but it becomes more a collection of interests.",
      "id": "ep_164_ut_63"
    },
    {
      "end": 1188192,
      "speaker": "Sandra Rendgen",
      "start": 1115760,
      "text": "What is something that is new in those later books is sort of an interest in pictorial strategies, sort of like how can you use images to sort of persuade or bring evidence or something? So, but as you said, it has a bit of an anecdotal character and that he just sort of finds, and I think generally that that's sort of one of his strengths, really, through all of his books, that he's very. Well, very good in curating stuff, in finding information, finding examples and showing their relevance for the whole practice of visualization. And sometimes a bit more synthesis would be revealing to see how you could use this particular strategy or how you could this particular method and device. But overall, it's very good to have all this knowledge or all these examples collected. And I think, yeah, we are now with the third one. Right. Visual explanations, images and quantities, but beautiful evidence.",
      "id": "ep_164_ut_64"
    },
    {
      "end": 1192660,
      "speaker": "Moritz Stefaner",
      "start": 1188256,
      "text": "I see these two as very similar in a way that they present the same style of arguments.",
      "id": "ep_164_ut_65"
    },
    {
      "end": 1207214,
      "speaker": "Sandra Rendgen",
      "start": 1194040,
      "text": "Exactly. So for the listener, maybe the third one was called visual explanations, images, quantities, evidence and narrative. It came out in 2006. And the title of the last one is beautiful evidence.",
      "id": "ep_164_ut_66"
    },
    {
      "end": 1208342,
      "speaker": "Moritz Stefaner",
      "start": 1207342,
      "text": "Good title.",
      "id": "ep_164_ut_67"
    },
    {
      "end": 1210770,
      "speaker": "Sandra Rendgen",
      "start": 1208486,
      "text": "Good title. Yeah, I don't.",
      "id": "ep_164_ut_68"
    },
    {
      "end": 1214130,
      "speaker": "Enrico Bertini",
      "start": 1212510,
      "text": "How come you like it?",
      "id": "ep_164_ut_69"
    },
    {
      "end": 1232688,
      "speaker": "Moritz Stefaner",
      "start": 1214910,
      "text": "He has a thing for good names, so maybe one of his big contributions also just finding catchy names for an already existing stuff like small multiples, sparklines. So he has this thing with finding it characteristic names, which is, it sounds.",
      "id": "ep_164_ut_70"
    },
    {
      "end": 1279388,
      "speaker": "Sandra Rendgen",
      "start": 1232744,
      "text": "Maybe like as if you just put some. Some tarnish on something that was already there. But I think there's also a cognitive thing in that because, you know, giving these things a good title is, you know, as you said before, it makes. It makes people remember those concepts. And that's. That's. That there's an achievement in that because, you know, in. In the sense of these books are books that many people read who want to go into the field and have done so over the past two, three decades, basically. So if these titles make people remember those concepts, then there's something good about that. Really? Because he's really good at pointing his finger at it and say, hey, look, there's some really good stuff in that, and it can do something on a cognitive level that is true.",
      "id": "ep_164_ut_71"
    },
    {
      "end": 1320114,
      "speaker": "Moritz Stefaner",
      "start": 1279444,
      "text": "Yeah. And being precise about what you mean with a certain new concept you coined, I think that can be super helpful. At the same time, sometimes people think just because you coined a term, you invented the whole concept or the whole genre. And I think that's not true in some cases, like, small multiples existed before or Sparklines existed before, but just weren't called that way. And now, because it would have decoined the term and sort of illustrated the concept really well, people think he invented the whole thing, which is not true. But I see your point as well. Yeah. That there's a whole merit in being able to providing a succinct definition and a good name to something that's complex.",
      "id": "ep_164_ut_72"
    },
    {
      "end": 1324142,
      "speaker": "Sandra Rendgen",
      "start": 1320232,
      "text": "Yeah. And making people remember the concept and.",
      "id": "ep_164_ut_73"
    },
    {
      "end": 1326974,
      "speaker": "Moritz Stefaner",
      "start": 1324246,
      "text": "You know, almost like a data vis strategy in itself.",
      "id": "ep_164_ut_74"
    },
    {
      "end": 1335158,
      "speaker": "Enrico Bertini",
      "start": 1327062,
      "text": "Yeah, yeah. No, I think. Look at that. Some people have this amazing skill of coining some terms that stick.",
      "id": "ep_164_ut_75"
    },
    {
      "end": 1335774,
      "speaker": "Moritz Stefaner",
      "start": 1335294,
      "text": "Yeah.",
      "id": "ep_164_ut_76"
    },
    {
      "end": 1360270,
      "speaker": "Enrico Bertini",
      "start": 1335862,
      "text": "And it's useful. I think it's useful. It can also be detrimental to some extent, of course. Right. But I agree with Sandra. The mere fact that you attach a label to a concept, now people remember that. Right. I'm thinking other examples from other people. Right. I don't know. System. System one, system two, thinking. Right. Once you. Once you understand, it's super simple, but.",
      "id": "ep_164_ut_77"
    },
    {
      "end": 1362810,
      "speaker": "Moritz Stefaner",
      "start": 1360690,
      "text": "It's not really a bad name, but it works.",
      "id": "ep_164_ut_78"
    },
    {
      "end": 1386010,
      "speaker": "Enrico Bertini",
      "start": 1362890,
      "text": "It's horrible. It's horrible. Right. But here we go. Right. And we all know what we're talking about. Or, I don't know, another Ben Shneiderman is really good at doing that. For instance, he always comes up with really good acronyms. Right. Or overview first and details on demand. Once you hear it, it's like here we go. Yeah, you see it everywhere. You see it everywhere.",
      "id": "ep_164_ut_79"
    },
    {
      "end": 1432346,
      "speaker": "Sandra Rendgen",
      "start": 1387150,
      "text": "But it's so true. And you know what the funny thing is that overview, first, details on demand. I have often used it in presentations about historical stuff, like way before interaction design, because basically this is a strategy that people have used in old maps. Like, right. If you have a huge wall map, you can go back, you can step back and see it from a distance and get the whole picture, and then you can go in and zoom in. I mean, you can do that. You could do that before, before digital media. But it's really good to put this concept into this phrase because it makes people remember it and also puts a light on this or sheds a light on this specific strategy, which is cool.",
      "id": "ep_164_ut_80"
    },
    {
      "end": 1512494,
      "speaker": "Moritz Stefaner",
      "start": 1432418,
      "text": "Yeah, absolutely true. And finally, then we have the seeing with fresh eyes, meaning space, data, truth book, which I personally must say, I find it maybe the weakest of the five. So that's why I wanted to sort of lay out the full sequence for a. Because the other ones are so strong that the expectations are really high. And this one really seems like a collection of not totally finished, like, chapters, is my feeling. Again, there's really good thoughts in there. There's a really cool chapter on typography, which is something that's often undervalued in data visualization or not looked at systematically. And it's so important. And it is a form of data visualization, how you arrange a sentence on a page, where do you do the line breaks and what do you make? Bold or nothing super powerful. There's stuff on annotations. It opens really wild, loose, stream of consciousness type thoughts. So he clearly tries something new, in a way. Also with the layout. The layout is sort of weird, actually, but experimental, let's say, to frame it positively. But for me, it didn't quite click as the other books. How about you guys?",
      "id": "ep_164_ut_81"
    },
    {
      "end": 1576830,
      "speaker": "Sandra Rendgen",
      "start": 1512662,
      "text": "Well, I think it was in terms of layout, I think it looks deliberate to me that it's more. How do you say that? It's more like a web of associations, collage kind of style, which is sometimes hard to, like to cut through the mist. It doesn't have the very clear structure and thread of basically that you have. For instance, in the first book, it just guides you through. But also, maybe you could see. At first I had the same feeling, like you, Moritz, that I was basically overwhelmed with the layout. I just couldn't really find my way through it. But it also may have been. I think it may have an association to. Yeah, or it is a web of associations that you are presented with. And what I'm missing a little bit is sort of the guide, the guideline that takes you through and the synthesis.",
      "id": "ep_164_ut_82"
    },
    {
      "end": 1585362,
      "speaker": "Moritz Stefaner",
      "start": 1580370,
      "text": "Maybe his first two books are, like, really modernist, and now he's entered the postmodern age. Is that what happened?",
      "id": "ep_164_ut_83"
    },
    {
      "end": 1655720,
      "speaker": "Sandra Rendgen",
      "start": 1585386,
      "text": "Exactly. That's sort of how it feels to me. And in that sense, there's a huge wealth in it, a huge wealth of examples and ideas. Ideas. As you said, I didn't really understand who it was for. In the sense of, is it like a textbook? Is it for people who are looking to go into Dataviz? Is it for, you know, is it more for an advanced audience? I wouldn't really be able to tell because there's also, I. I guess, for instance, it starts with some remarks on what I would call scientific rigor and rigorous thinking, trying to question assumptions, things like that. Remodeling conventional models is remodeled. Conventional models is one of its phrases and claims. And that, for me, goes into something that, what I would call general scientific hygiene, that students should be taught and that students and everybody who's in academia should follow.",
      "id": "ep_164_ut_84"
    },
    {
      "end": 1668596,
      "speaker": "Moritz Stefaner",
      "start": 1657580,
      "text": "How academia is broken, or why so many. The replication crisis and all of that. That seems to be the biggest part of the book, actually taking science apart. Yeah.",
      "id": "ep_164_ut_85"
    },
    {
      "end": 1709988,
      "speaker": "Sandra Rendgen",
      "start": 1668628,
      "text": "And then we have, as you said, we have the content responsive typography and the whole notion of annotation and how you can do that, which has a lot of interesting concepts. Then there's a lot of data analysis, remarks about data analysis when truth matters, and some remarks about lists, some remarks about instructions at point of need. Again, something that I thought was an interesting concept to have annotations and instructions at what he called the point of need, so that they're placed precisely. Yeah.",
      "id": "ep_164_ut_86"
    },
    {
      "end": 1716396,
      "speaker": "Enrico Bertini",
      "start": 1710004,
      "text": "That's another element that is often overlooked in visualization. Very often and super important.",
      "id": "ep_164_ut_87"
    },
    {
      "end": 1735080,
      "speaker": "Sandra Rendgen",
      "start": 1716588,
      "text": "Yeah. And again, I thought it's a very good phrasing that sort of directs attention to the problem, which is an achievement. And then the last chapter is on remodeling non fiction presentations. So how to get smarter and shorter meetings.",
      "id": "ep_164_ut_88"
    },
    {
      "end": 1775330,
      "speaker": "Moritz Stefaner",
      "start": 1735410,
      "text": "So it's sort of a mixed bag, let's say. My recommendation would be, if you have the other four ones, you need to buy it just to complete the series. If you don't own any of the Tufte bookstores at the beginning, that would be my, like, you know, the quick summary review, maybe. Yeah. And I mean, maybe just to make sure, because not everybody might be familiar with his main concepts from the earliest books. Maybe we should go through his key contributions. Right. Just to make sure. People are familiar with them. So what would you say are the main concepts he presents in the first books?",
      "id": "ep_164_ut_89"
    },
    {
      "end": 1911530,
      "speaker": "Sandra Rendgen",
      "start": 1775990,
      "text": "I think I've said it before. What I think is a huge achievement, and that's really what made him famous, is the combination of claiming. And that really happened in the first book. And as you said, Moritz, it happened on the very first pages. So it's like you go into the book and you're drawn into that. And that is the combination of claiming scientific and or statistical rigor, claiming rigor in treating and how the data are treated in visualization. So just to what I like to call hygiene sometimes, yeah, just a good way of working. And that combined with a high. With the. With claiming a very high design standard. And what I liked about his work was that he said, you know, we need a good design, not just, as, you know, it's not about decoration, it's not about luxury design. You know, the fact that it looks good is not just a luxury, it's a necessity, because it helps perception, it helps the way, you know, data is mediated. And so this contribution of him showing the importance of design and embodying this by self publishing his book, just as a side note, because we haven't really said it, he tried to find a publisher that he had been researching the topics of the book. He was also connected with a few other people, such as Howard Wehner and Micah friendly and others who were sort of trying to rediscover older ideas about data visualization. He had been researching for the book sometime in the seventies, ready didn't find a publisher who was willing to make sure the design standards that he wanted. And, like, the placing of images with the text and the quality of images, like, you know, the quality in which images are printed, all that stuff. And I know that it's up to this day, academic publishing and images is a difficult question. And so he didn't find a publisher who would do that, who was willing to do that, who was willing to invest that money also. And so he took out a second mortgage on his home to. In order to.",
      "id": "ep_164_ut_90"
    },
    {
      "end": 1914270,
      "speaker": "Moritz Stefaner",
      "start": 1911870,
      "text": "Quite the move. No, it's like quite a move.",
      "id": "ep_164_ut_91"
    },
    {
      "end": 1922516,
      "speaker": "Sandra Rendgen",
      "start": 1914350,
      "text": "And I mean, imagine, how did you know that? Yeah, he did. I don't know where I have it from. He said it in some of his books. Like, it's.",
      "id": "ep_164_ut_92"
    },
    {
      "end": 1926120,
      "speaker": "Moritz Stefaner",
      "start": 1922708,
      "text": "I recall that detail, too, and I was impressed with it as well.",
      "id": "ep_164_ut_93"
    },
    {
      "end": 1969012,
      "speaker": "Sandra Rendgen",
      "start": 1926900,
      "text": "I think I have this second. I have the second edition of the first book, the visual display of quantitative. And he says that in the introduction to the second edition. So it's quite you must be very, you must be very convinced and very, you know, it must be a very important topic to you. And he's done that. And I think he's really shown, I think his wife is a designer, so he does have this knowledge, you know, close by. And I don't know if they work together on the book, but you see this in the first book, this level of design excellence, and he's also talking about it. And this combination statistical rigor, design rigor together. That's like, like also practice what you.",
      "id": "ep_164_ut_94"
    },
    {
      "end": 1974018,
      "speaker": "Moritz Stefaner",
      "start": 1969036,
      "text": "Preach in the sense that you have a theory, but you prove the theory by doing it sort of.",
      "id": "ep_164_ut_95"
    },
    {
      "end": 2096529,
      "speaker": "Sandra Rendgen",
      "start": 1974074,
      "text": "Yeah. And I think that really gave a huge push to the whole field also in making it appeal to a lot more people, rather than just, you know, a few statisticians, basically. And, yeah, and just making it also, for a huge public, making it more attractive. So the other thing that, that was personally, for me, super interesting and super exciting also was that he went about and tried finding historical stuff. So he really wanted to go back and see, hey, where does this all come from? I know that practically back in the eighties, it was actually quite a bit of work to find historical database, because there were no specialized libraries. There were no online digitized archives of anything he and a few other people actually went through, actually went through catalogs of map dealers and rare book dealers to find historical atlases of data vis to find historical broadsheet prints, et cetera. And so much of this has gone into his first book. Some of you will know that he has also collected, he's built a collection of historical stuff, some of which has made its way into the book. And he, I don't recall the exact year, but I think around 2010, he sold this collection with the auction house Christie's. But just like, the fact that he's put so much effort and probably money into building this collection and just trying to get a sense of what is the history that we have behind us was really revealing to me personally, and I think to many, many other people in the field. And he's also made it popular. Like, the whole idea of me looking into Minard, for instance, goes back to.",
      "id": "ep_164_ut_96"
    },
    {
      "end": 2106393,
      "speaker": "Moritz Stefaner",
      "start": 2096569,
      "text": "His first book, and there's like a whole young generation now of folks looking into the historical side of Dataviz and, like, finding obscure books and.",
      "id": "ep_164_ut_97"
    },
    {
      "end": 2153448,
      "speaker": "Sandra Rendgen",
      "start": 2106561,
      "text": "Exactly. And that's, again, that's something that is, it always was a collective effort. Like, he was not the only one. As I said, some other people were always also involved. And also, now, also today, like, I've published some stuff. But there's also other people like Jason Forrest and RJ Andrews and many people who are really digging to find stuff. And like, the more we dig, it's like, it's huge. It's becoming ever bigger. So we see all of this tradition that we have behind us and all of what we can build upon. But it's Tufte who really made this popular, who really, who really said, hey, let's look at that. That's so interesting, and we need to know about that.",
      "id": "ep_164_ut_98"
    },
    {
      "end": 2174060,
      "speaker": "Enrico Bertini",
      "start": 2153544,
      "text": "Yeah, I think it would be. If I'm not mistaken, he never really describes in his books what is the process that he followed to do that. Right. Are there any accounts about how he got started or what process he followed? It must be a huge amount of work.",
      "id": "ep_164_ut_99"
    },
    {
      "end": 2179368,
      "speaker": "Sandra Rendgen",
      "start": 2176840,
      "text": "You mean the historical research or.",
      "id": "ep_164_ut_100"
    },
    {
      "end": 2181620,
      "speaker": "Enrico Bertini",
      "start": 2179464,
      "text": "Yeah, the historical research. Yeah.",
      "id": "ep_164_ut_101"
    },
    {
      "end": 2276898,
      "speaker": "Sandra Rendgen",
      "start": 2182280,
      "text": "Well, as I said, I think back in the eighties, it was really a lot of traveling, talking to dealers like rabbit dealers, antiquarians, map dealers, and just like being in touch with a number, like a network of people. There's also a community in France of people who was looking into that. So those, of course, the french rare book dealers who also had the, like the statistical atlases of the late 19th century were collecting them and stuff. So there was a lot of exchange between France and the US and between Michael friendly and Edward Tufte. So several people were working on that, and I think they also worked together. Like, they saw one piece there with this rare book dealer, and one of them would buy that and then somebody else would buy another piece from another dealer. And so they sort of had, as I said, it was really a collective effort and you could, they actually had to buy that stuff because you couldn't, you know, as I said, there weren't any kind of digitized archives or something or. Yeah, other, otherwise you would just have to travel to Paris to look at something in a real archive. And so, yeah, as I said, he was not the only one to do that, but he certainly, through his books, he's really managed to popularize the whole topic and make us aware that it's not something new and that there's, that there's people who have done, done research on this, like, since way back when.",
      "id": "ep_164_ut_102"
    },
    {
      "end": 2277514,
      "speaker": "Enrico Bertini",
      "start": 2277034,
      "text": "Yeah.",
      "id": "ep_164_ut_103"
    },
    {
      "end": 2284314,
      "speaker": "Sandra Rendgen",
      "start": 2277602,
      "text": "Yeah. So these, I think, are the main contributions that made him resonate for me.",
      "id": "ep_164_ut_104"
    },
    {
      "end": 2480522,
      "speaker": "Moritz Stefaner",
      "start": 2284482,
      "text": "Yeah, yeah. I think I'd like to move the discussion a bit also to what Tufte thinks makes a good data graphic because I think he has a very clear theory there. And I personally have a bit of a torn relationship, like in some aspects of the theory I totally find myself, and in other aspects I find like, ah, maybe that went a bit too far, or sort of in the way it was then executed in the world, took things too much to an extreme. And I'm curious about your thoughts there as well. And I think the main idea he presents in his first books is really every single pixel in a graphic should be connected to data and present data. So it's this sort of really extreme purism, minimalism, which is great and which can lead to really super elegant and clean, clever and really rich graphics. So I think if it's done well, it can also lead to something centrally very rich. So it doesn't have to be deprived of experience just because you're minimal. But he also introduces these ideas of a lie factor, like how much is a graphic misleading? Or he talks about chunk charts. So he has certain types of graphics, data graphics that he says are really, actually bad or trash in a way, and often that's connected to non data illustration elements, or like cutesy ideas, or like not totally super highly functional stuff, or not obviously functional stuff. Right. And I think that led to a certain austerity in data visualization for a few years, or that sort of over, like exaggerated. But Tufte said we cannot add icons. That would be confusing to the people. That would sort of ruin our data Inc ratio. So I think Tufte himself enjoys interesting visuals, even if they're not data based. So clearly he has all these examples, but just the theory he presents at the books. And that theory is not proven empirically. So that's another point I want to make later. But in the theory he presents in the books, I think it comes across very much as very restrictive and very no fun allowed. And I would argue history has proven him wrong, because we have seen really, really successful data visualization that when not every single data point is directly connected to data, and that has illustrated illustrative elements, that's like very handmade. Maybe think of Giorgia Lupi's work, or Nigel Holmes, who he really bashes in his books and who is definitely a really influential data illustrator, right. And who is sort of, he does great work. And if you look at what's today, let's say the standard for data visualization in magazines, on websites, it's not very tuftian. Right. And I think we have moved on from that pure idea of, or that maybe idealized idea of the pure data chart, that is ideal in any way. What's your take on that, Enrico?",
      "id": "ep_164_ut_105"
    },
    {
      "end": 2481670,
      "speaker": "Sandra Rendgen",
      "start": 2480546,
      "text": "Do you want to go first.",
      "id": "ep_164_ut_106"
    },
    {
      "end": 2490710,
      "speaker": "Enrico Bertini",
      "start": 2482210,
      "text": "Yeah. Yeah. I don't know where to start because I have so many things. I'm like, I'm overwhelmed by my thoughts.",
      "id": "ep_164_ut_107"
    },
    {
      "end": 2493050,
      "speaker": "Moritz Stefaner",
      "start": 2491650,
      "text": "Take it one by one.",
      "id": "ep_164_ut_108"
    },
    {
      "end": 2551176,
      "speaker": "Enrico Bertini",
      "start": 2493210,
      "text": "No, a couple of things is part of me is. I don't disagree with you, Moritz. One thing is, I'm wondering if partly his whole theory is a reaction. It's a strong reaction to what he was seeing or how he was seeing data, graphics being used in the world. Right. I suspect that he came from this whole idea that statistical graphs are mostly being presented to the large public through newspapers, and they're often like complete garbage, for lack of a better word, to say it bluntly. And maybe probably overcompensated for. Right. As a reaction to what he was seeing around. I don't know. It's unhypothesis. Honestly spoke with Tuftiso. How do I know?",
      "id": "ep_164_ut_109"
    },
    {
      "end": 2552580,
      "speaker": "Moritz Stefaner",
      "start": 2551248,
      "text": "But it seems plausible.",
      "id": "ep_164_ut_110"
    },
    {
      "end": 2635412,
      "speaker": "Enrico Bertini",
      "start": 2553000,
      "text": "I think it seems plausible. What else did I want to say? Yeah, he has all these concepts like data ink ratio, line factor, junk charts. I think everyone has been influenced by that, and I certainly have been influenced by that a lot. I think part of me is also, I think visualization has changed quite a lot over the years. These. I think maybe another way to look at this tension, so to speak, is that I think Tufte was mostly addressing the idea of having efficient graphics, this idea of efficiency, whereas we now use visualization for different kind of purposes. So visualization can also be used as having an experience. Right? Yeah, I think there are lots of really good designers. I think you mentioned Georgia. I think it's an excellent example there. In her work, you are not only extracting information from a piece of graphics, but you are having an experience. And if you want to maximize for experience, now, maybe data Inc. Ratio is not your most important parameter.",
      "id": "ep_164_ut_111"
    },
    {
      "end": 2643340,
      "speaker": "Moritz Stefaner",
      "start": 2635476,
      "text": "Or memorability, showing that more embellished graphics can be more effective in terms of memorability.",
      "id": "ep_164_ut_112"
    },
    {
      "end": 2657420,
      "speaker": "Enrico Bertini",
      "start": 2643840,
      "text": "Exactly. Exactly. Yeah. That's my take on it. I just want to say, I'm going to throw a challenge at you, Moritz.",
      "id": "ep_164_ut_113"
    },
    {
      "end": 2659616,
      "speaker": "Moritz Stefaner",
      "start": 2658040,
      "text": "I love challenges.",
      "id": "ep_164_ut_114"
    },
    {
      "end": 2679900,
      "speaker": "Enrico Bertini",
      "start": 2659808,
      "text": "Your work looks to me mostly like striving for or. I think I know you well enough to say that you know me well in your. I'm cheating here, but every element in your graphic has to matter, right?",
      "id": "ep_164_ut_115"
    },
    {
      "end": 2681756,
      "speaker": "Moritz Stefaner",
      "start": 2679940,
      "text": "I know. Yeah, that's right.",
      "id": "ep_164_ut_116"
    },
    {
      "end": 2694716,
      "speaker": "Enrico Bertini",
      "start": 2681828,
      "text": "So I think you're kind of faking it. I know it sounds to me you're kind of faking it to some extent, because your work is very tough test in some sense.",
      "id": "ep_164_ut_117"
    },
    {
      "end": 2697160,
      "speaker": "Moritz Stefaner",
      "start": 2694828,
      "text": "That's why the love hate relationship.",
      "id": "ep_164_ut_118"
    },
    {
      "end": 2702820,
      "speaker": "Sandra Rendgen",
      "start": 2700320,
      "text": "Yeah. But maybe yeah, maybe.",
      "id": "ep_164_ut_119"
    },
    {
      "end": 2707112,
      "speaker": "Enrico Bertini",
      "start": 2703640,
      "text": "No, yeah, I don't have anything to add. I just wanted to make fun of.",
      "id": "ep_164_ut_120"
    },
    {
      "end": 2907262,
      "speaker": "Sandra Rendgen",
      "start": 2707136,
      "text": "Maybe I can give it some more. I feel like we don't see this, or let me say it differently, I think we should see this more in a historical development. The first book came out in 1982. And I said the research goes back to the seventies. I think you're right in saying much of it was a reaction to what he saw. But generally what we can say is the field was always, at least at that point, the field. In the second part of the 20th century, the field was already at least differentiated into something that was the media. Newspapers, magazines. They had been using graphics for a long time. We also have this other field of scientific, like, you know, diagrams in scientific contexts. And he doesn't really, I mean he has examples from both ends, but he never really differentiates between those two fields. And that's what you said earlier, we use visualization for different ends. And that has been the case back then already. And I think some of his criticism is more related to the media graphics. From which he asked more statistical rigor and said, hey people, you cannot do that this way. It's just statistical crap what you're doing just to make it look interesting. That was targeted at media graphics, at media newsroom departments. But then the other stuff, much of the design excellence, the graphical excellence, I think much of that goes for the more scientific community that were using diagrams, for whom I believe, I haven't really seen large collections of that. But I would assume that back in the seventies, sixties, eighties, much of the scientific graphics were just looking like hell. And so I would assume, but that's a speculation that it would have been helpful to sort of just differentiate this more and say like, hey, these people need more of that. These people need more of that. And you know, we had graphics for different uses back then already. And I guess also we need to look at the fact that again the book came out in 82. And he just managed to build himself such a reputation, which is great. But through this and through those sentences being repeated all over again, again and again and again they sort of had this, you know, the ten commandments of database status. And that sort of theme being repeated all over again. Which had something good, I'm pretty sure. And as you said Enrico to Moritz, it had an influence on our generation, like a deep influence. But at some point it just became carved into stone. And at that point I think we had some criticism coming up where people would say, well it is true and there is some truth to it. But you need to see this more in context, or there's more to it.",
      "id": "ep_164_ut_121"
    },
    {
      "end": 2977100,
      "speaker": "Moritz Stefaner",
      "start": 2907326,
      "text": "And always take it with a grain of salt and understand that it originated in a certain context, that his mindset is very print centered also. And by now we have digital design and we have all kinds of media. We have motion graphics. Right? And I think he to some degree acknowledges that, but doesn't really quite grasp what a fundamental change that can make to a design, that it's presented on a totally different medium. I recall in his books he criticizes these thunderstorm graphics, but that were on really crappy tv sets. And he makes these beautiful print redesigns, right? Which of course, it looks awesome in print, you know, or like these iPhone weather app redesigns that really would work on an iPhone. And I think understanding, like, yeah, the context is coming from, and what he was arguing against at the time maybe makes one realize, oh, okay, it's a super interesting, total package of thoughts and theory, but it also has sort of a limited applicability, maybe. And it's not the single truth about data visualization or the ten Commandments. I love that.",
      "id": "ep_164_ut_122"
    },
    {
      "end": 3073344,
      "speaker": "Sandra Rendgen",
      "start": 2979080,
      "text": "But you know what, when I looked through the last book, interestingly, I mean, we said earlier that, but we were having a bit of trouble with the fact that it's basically a collection of, a collection of ideas or thoughts where we felt, where's the overarching argument? Like, what is it aimed for? But I had a moment. I mean, there's very interesting examples of what he calls graphical sentences, which is basically relating to sentences, or lines of text which are taken out of a text grid and just basically applied freewheeling in space wherever they help the content that is being mediated. So that's one of the concept. He also talks about, what is it? Content sensitive. Content sensitive, content responsive typography, and how line breaks that refer to specific content elements could help meaning, could help creating or could help understanding also. And I was thinking, like, at reading it, I was like, I was missing the reference to the specific media technologies in which this could be used. I mean, of course you can make, he quotes one of the famous caligrams by Apollinaire, the french poet. And of course it's a beautiful thing. And of course you can do that by hand, manually, and like arrange the typography. In a sense that helps the meaning.",
      "id": "ep_164_ut_123"
    },
    {
      "end": 3078180,
      "speaker": "Moritz Stefaner",
      "start": 3073392,
      "text": "Of course, when the first typewriters came out, there was a lot of, of these concrete poetry experiments, right?",
      "id": "ep_164_ut_124"
    },
    {
      "end": 3153814,
      "speaker": "Sandra Rendgen",
      "start": 3078340,
      "text": "And it's beautiful. And I understand the thing, and I also understand how, you know, how it could relate to helping mediating meaning in database. But you know, this is not practical. How are you ever going to use that in one of the current contemporary database tools, softwares, whatever. But maybe we, maybe this is something that's more pointing towards the future, let's say like this. If you have something like responsive type, if you have, you know, if you have more flexible things coming up, maybe this is a pool of ideas that people can come back to with later stages of technology development. Yeah, maybe because this is ideas that many of them are based in the print universe. But I don't know what we, we have seen a very fast technological development in vistools overdose past ten years. I don't know what's coming up. So maybe there's, maybe there's a pool. And that's what I like about the last book. Maybe it can be seen as sort of a bit of a wild pool of ideas that could inform future solutions.",
      "id": "ep_164_ut_125"
    },
    {
      "end": 3200208,
      "speaker": "Moritz Stefaner",
      "start": 3153862,
      "text": "I mean, the last book is more on the art side. Again, he's always like jumping between art and science anyways. And I think that the last book swung the pendulum, again, to the art side. The relation to science is interesting too, I think, because as you said, he presents this rigor and he has this ask for clarity and really being really strict about what everything means. And I do think he lays out his thoughts really well in that way. But he never proves anything with empirical findings. Right. I think that's another interesting observation. I think that he's all about science, except the science of data visualization. Right, Enrico, does that match your perspective or what's your thought on that?",
      "id": "ep_164_ut_126"
    },
    {
      "end": 3237100,
      "speaker": "Enrico Bertini",
      "start": 3200264,
      "text": "I think it's interesting because some of the basic perceptual studies done in visualization started again in the eighties, right? The work of Cleveland and McGill. He must have been or is familiar with this body of work, especially because it's been hugely influential. I don't know why. I think he never really talks about empirical evidence. He might actually sometimes even support, sometimes contradict or sometimes support his intuitions. I don't know, it's interesting. I think it would be interesting to ask him.",
      "id": "ep_164_ut_127"
    },
    {
      "end": 3253070,
      "speaker": "Moritz Stefaner",
      "start": 3237880,
      "text": "But there's a weird tension in saying, oh, we need to be rigorous about our process and justify everything, you know really well what we do in our graphics, but then just come up with opinions, you know. It's sort of a weird tension, isn't it?",
      "id": "ep_164_ut_128"
    },
    {
      "end": 3272920,
      "speaker": "Enrico Bertini",
      "start": 3253490,
      "text": "It is, it is, yeah. I think it's also true that a lot of additional evidence has been collected later on in the years. But again, he never mentions that in the in the newer books. So I don't know. I honestly don't know. It's interesting.",
      "id": "ep_164_ut_129"
    },
    {
      "end": 3293876,
      "speaker": "Moritz Stefaner",
      "start": 3274380,
      "text": "Maybe it's also fine. I mean, everybody has a different role to play in such a community or in such a constellation. Right. Maybe his role is just opening up all these doors, and then other people need to see what's exactly inside and to sort of organize his trail of connections. I don't know. It's funny.",
      "id": "ep_164_ut_130"
    },
    {
      "end": 3334648,
      "speaker": "Enrico Bertini",
      "start": 3293908,
      "text": "Yeah. I think when I think about his way of communicating his thoughts, I think he really approaches this with the, the way designers would do it. Right. I mean, Moritz, you can correct me, but I think designers have more of. They want to communicate things by example, not by saying, this is what science says. Right? So I'll give you a concept, and then I'll give you a bunch of, a bunch of examples that show the application of that concept. Maybe it's just a different way of learning. Teaching and learning things. Right.",
      "id": "ep_164_ut_131"
    },
    {
      "end": 3370180,
      "speaker": "Moritz Stefaner",
      "start": 3334744,
      "text": "And by the way, he is like a design teacher. I would agree. And he does a lot of teaching in workshops as well. And he has taught, like hundreds of thousands of students. And I would agree that the style of teaching he probably has, like, coming from the book, then it is. Yeah, it's not a scientific way of teaching, but more a practical perspective and sharpening one's intuitions. Right. But again, I think it's weird because the content itself is so much about rigor and absolute truths, which seems.",
      "id": "ep_164_ut_132"
    },
    {
      "end": 3378788,
      "speaker": "Enrico Bertini",
      "start": 3370220,
      "text": "Yeah, yeah, yeah. No, I agree. There's definitely attention there. But I have to say, even you.",
      "id": "ep_164_ut_133"
    },
    {
      "end": 3382080,
      "speaker": "Moritz Stefaner",
      "start": 3378804,
      "text": "Can'T do everything right. What can one person do?",
      "id": "ep_164_ut_134"
    },
    {
      "end": 3389052,
      "speaker": "Enrico Bertini",
      "start": 3382620,
      "text": "Maybe as well, personality as well, who knows? Yeah.",
      "id": "ep_164_ut_135"
    },
    {
      "end": 3442844,
      "speaker": "Sandra Rendgen",
      "start": 3389116,
      "text": "But I'm lacking the general overview. But I would assume that he has played quite a role in just what we said, like gathering examples and gathering concepts and ideas, not just for Datavis in the more narrow sense, but also for the larger culture of this whole idea of visual thinking. Thinking. And again, in the last book, I was missing references to researchers who have contributed to that line of thought. But I would just assume that he has contributed to this whole idea. I mean, now it's everywhere. Everybody's sketchnotes. And visual thinking is sort of like a practical thing that's pervasive. Yeah, maybe he has contributed with his collections as well.",
      "id": "ep_164_ut_136"
    },
    {
      "end": 3457800,
      "speaker": "Moritz Stefaner",
      "start": 3442892,
      "text": "Yeah. Maybe we all wouldn't have a job if he hadn't written the visual display of quantitative information in 1982. I think it's totally possible. I'm not joking. I am grateful for that.",
      "id": "ep_164_ut_137"
    },
    {
      "end": 3495904,
      "speaker": "Enrico Bertini",
      "start": 3460700,
      "text": "I have to say, Moritz, that going back to the idea of empirical evidence in fact, there is a lot of additional empirical evidence that could be gathered by just sifting through his books and trying to figure out what holds and what doesn't. Right? Oh, yeah, the same is true for many other. Yeah, right. Think about, I'm now thinking about the work of Jacques Bertin is the same thing. Right. Even Bertin has been producing a whole theory in a way much more structured than tuftis.",
      "id": "ep_164_ut_138"
    },
    {
      "end": 3500784,
      "speaker": "Sandra Rendgen",
      "start": 3496032,
      "text": "I was just gonna say it's, yeah, it's much more detailed and structured and laid out.",
      "id": "ep_164_ut_139"
    },
    {
      "end": 3528272,
      "speaker": "Moritz Stefaner",
      "start": 3500912,
      "text": "I think it's also important that we move on from this practice of, okay, there's this father figure that comes up with like strong convictions about what is good. And everybody keeps nodding and saying, yeah, that's good. Yeah, the other things are bad, you know, and I think it's important that we also move on and see every, everybody's perspective on Datavis as one perspective, not the perspective. And I think the field is there.",
      "id": "ep_164_ut_140"
    },
    {
      "end": 3528584,
      "speaker": "Enrico Bertini",
      "start": 3528296,
      "text": "I agree.",
      "id": "ep_164_ut_141"
    },
    {
      "end": 3542900,
      "speaker": "Moritz Stefaner",
      "start": 3528632,
      "text": "But for a few years, I was a bit worried that everybody would adopt the same dogma type views, you know, and sort of all the interesting stuff would be shut down by these. But Person X said this and that, and that's why it's dog mind. We can't do anything else.",
      "id": "ep_164_ut_142"
    },
    {
      "end": 3608818,
      "speaker": "Sandra Rendgen",
      "start": 3544040,
      "text": "Well, it's a bit of a pity that, I mean, what is great for Ebert, Tufte, is that he was hugely successful and influential. And I admire that, like, as an author. Like, wow. On the other hand, yeah, respect. But on the other hand, this may also have, how do you say that? Distorted the research field in the sense that through all the attention put on his books, other voices may have been, may have not gotten the attention that they were, that they deserve. Because for like 20 years, I felt everybody like there was a sense that these were the books of database and nobody else was writing about it, and that was not the case. So he sort of took a bit of light away from other authors, researchers who were not so popular and whose books may not have been so beautiful. So maybe it's just our task for the future to sort of redistribute, discover that line of research as well.",
      "id": "ep_164_ut_143"
    },
    {
      "end": 3621610,
      "speaker": "Moritz Stefaner",
      "start": 3608914,
      "text": "Yeah. And maybe true thought leadership is not like dominating a space and leaving no room for anybody else, but sort of also elevating others voices or even dissenting voices the same way. Right.",
      "id": "ep_164_ut_144"
    },
    {
      "end": 3626402,
      "speaker": "Sandra Rendgen",
      "start": 3621730,
      "text": "Referencing voices, also referencing your book, because that also makes a community.",
      "id": "ep_164_ut_145"
    },
    {
      "end": 3628226,
      "speaker": "Moritz Stefaner",
      "start": 3626546,
      "text": "Yeah, yeah, I totally agree.",
      "id": "ep_164_ut_146"
    },
    {
      "end": 3686284,
      "speaker": "Enrico Bertini",
      "start": 3628258,
      "text": "Yeah. And I think, again, I never met him and never had had an interaction with him, so I really don't know the man. Right. In a way, it seems to be a missed opportunity that doesn't seem to engage with the larger community. Right. I mean, by now, Dataviz is super popular. There are amazing designers out there. Why is he not engaging with their work or these people? I don't know. I mean, it seems to me mostly a missed opportunity. It would be really interesting to have a better sense of. I mean, a figure like that could actually play a much bigger role in the end, and maybe a positive one. I don't know. It seems to be a missed opportunity. But again, who knows? I never interacted with him. Can say, yeah, and it's totally true.",
      "id": "ep_164_ut_147"
    },
    {
      "end": 3694840,
      "speaker": "Moritz Stefaner",
      "start": 3686332,
      "text": "But on the other hand, the man has written five amazing books. So let's first do that ourselves and then we talk again.",
      "id": "ep_164_ut_148"
    },
    {
      "end": 3696800,
      "speaker": "Sandra Rendgen",
      "start": 3695660,
      "text": "Exactly.",
      "id": "ep_164_ut_149"
    },
    {
      "end": 3698880,
      "speaker": "Enrico Bertini",
      "start": 3697180,
      "text": "Yes. Absolutely.",
      "id": "ep_164_ut_150"
    },
    {
      "end": 3709812,
      "speaker": "Moritz Stefaner",
      "start": 3701100,
      "text": "Cool. I think that pretty much concludes it. Except you have burning thoughts or theories, I think we didn't mention.",
      "id": "ep_164_ut_151"
    },
    {
      "end": 3716630,
      "speaker": "Enrico Bertini",
      "start": 3709996,
      "text": "Yeah, we didn't mention his workshops. I don't know if any of. Have you ever been in one of his workshops or.",
      "id": "ep_164_ut_152"
    },
    {
      "end": 3753270,
      "speaker": "Moritz Stefaner",
      "start": 3717010,
      "text": "No, but there's a really fun review by Robert Kosara from 2012. He was part of one of the workshops. He didn't really enjoy it. So if you're looking for a good rant, that's a really nice one, we can link that one. And I think it's mixed things. So some people say it's amazing, has, like, opened their eyes in, like, new ways. They're now enlightened. And others say, well, I read the books. It was last, like, you know, sensational, new, but it was good to hear it again. So I think that's mixed, but I haven't taken part in one, too. I would be curious, though, there's an online version now. You can take part.",
      "id": "ep_164_ut_153"
    },
    {
      "end": 3795102,
      "speaker": "Sandra Rendgen",
      "start": 3754290,
      "text": "I was just going to say they're online now. I mean, they have been since Corona times, I think. And I have the sense that they're generally good for, like, opening up the field to somebody who is not so much into it. Like Robert Kosara at the time he wrote the review, was like, and had been an esteemed researcher at one of the big software companies in the field. So he was like. He was as much as an insider as you could get. So for him, this may have not been the right course, but I think it's more targeted to people who are more set, let's say, on the outskirts, trying to get more of an insight, like a general insight.",
      "id": "ep_164_ut_154"
    },
    {
      "end": 3800740,
      "speaker": "Moritz Stefaner",
      "start": 3795246,
      "text": "Maybe that's something for our listeners. If you have taken part in a Tufte course, let us know if you liked it or not.",
      "id": "ep_164_ut_155"
    },
    {
      "end": 3802800,
      "speaker": "Sandra Rendgen",
      "start": 3800820,
      "text": "Right, exactly. Good.",
      "id": "ep_164_ut_156"
    },
    {
      "end": 3817116,
      "speaker": "Moritz Stefaner",
      "start": 3804300,
      "text": "Cool. I think we should wrap it up. We are over an hour or maybe if we manage to edit it down. We are not, but at least we've been recording for a while. Thanks so much for joining us. Yeah, that was a great experience.",
      "id": "ep_164_ut_157"
    },
    {
      "end": 3818220,
      "speaker": "Sandra Rendgen",
      "start": 3817148,
      "text": "That was a lot of fun.",
      "id": "ep_164_ut_158"
    },
    {
      "end": 3823560,
      "speaker": "Moritz Stefaner",
      "start": 3818340,
      "text": "And get the books. I mean, everybody in database should have a couple of them at least.",
      "id": "ep_164_ut_159"
    },
    {
      "end": 3833384,
      "speaker": "Sandra Rendgen",
      "start": 3824240,
      "text": "Exactly. And the first one, really, as we've said like many times, the first one is a classic. That's a must have.",
      "id": "ep_164_ut_160"
    },
    {
      "end": 3853220,
      "speaker": "Moritz Stefaner",
      "start": 3833432,
      "text": "Basically pour a glass of wine and go on the right. That is visual display of quantitative information. It's totally recommended. Yeah. Cool. And we hope we will record soon again, not just in half a year or something. So we try to keep the rhythm now going. Hopefully again a bit more.",
      "id": "ep_164_ut_161"
    },
    {
      "end": 3855984,
      "speaker": "Enrico Bertini",
      "start": 3853800,
      "text": "Yes, yes, yes, yes.",
      "id": "ep_164_ut_162"
    },
    {
      "end": 3858552,
      "speaker": "Moritz Stefaner",
      "start": 3856112,
      "text": "Fingers keeping us crossed. It will work out.",
      "id": "ep_164_ut_163"
    },
    {
      "end": 3860432,
      "speaker": "Sandra Rendgen",
      "start": 3858736,
      "text": "And thanks so much for having me.",
      "id": "ep_164_ut_164"
    },
    {
      "end": 3861040,
      "speaker": "Moritz Stefaner",
      "start": 3860496,
      "text": "Wonderful to have you.",
      "id": "ep_164_ut_165"
    },
    {
      "end": 3862496,
      "speaker": "Sandra Rendgen",
      "start": 3861040,
      "text": "It's really fun to get back together.",
      "id": "ep_164_ut_166"
    },
    {
      "end": 3864704,
      "speaker": "Enrico Bertini",
      "start": 3862608,
      "text": "Yeah, it's great to have you on.",
      "id": "ep_164_ut_167"
    },
    {
      "end": 3868904,
      "speaker": "Moritz Stefaner",
      "start": 3864752,
      "text": "Hopefully we can repeat that by times. That would be nice. Wonderful.",
      "id": "ep_164_ut_168"
    },
    {
      "end": 3869368,
      "speaker": "Enrico Bertini",
      "start": 3868952,
      "text": "Okay.",
      "id": "ep_164_ut_169"
    },
    {
      "end": 3871480,
      "speaker": "Moritz Stefaner",
      "start": 3869424,
      "text": "Thanks so much and talk to you soon.",
      "id": "ep_164_ut_170"
    },
    {
      "end": 3872408,
      "speaker": "Enrico Bertini",
      "start": 3871600,
      "text": "Bye bye.",
      "id": "ep_164_ut_171"
    },
    {
      "end": 3873700,
      "speaker": "Sandra Rendgen",
      "start": 3872464,
      "text": "Bye bye, everybody.",
      "id": "ep_164_ut_172"
    },
    {
      "end": 3901066,
      "speaker": "Moritz Stefaner",
      "start": 3878170,
      "text": "Hey folks, thanks for listening to data stories again. Before you leave a few last notes, this show is crowdfunded and you can support us on patreon@patreon.com Datastories where we publish monthly previews of upcoming episodes for our supporters. Or you can also send us a one time donation via PayPal at PayPal Dot me Datastories or as a free.",
      "id": "ep_164_ut_173"
    },
    {
      "end": 3928628,
      "speaker": "Enrico Bertini",
      "start": 3901098,
      "text": "Way to support the show. If you can spend a couple of minutes rating us on iTunes, that would be very helpful. Helpful as well. And here's some information on the many ways you can get news directly from us. We are on Twitter, Facebook and Instagram, so follow us there for the latest updates. We have also a Slack channel where you can chat with us directly. And to sign up, go to our home page at Datastory ES and there you'll find a button at the bottom of the page.",
      "id": "ep_164_ut_174"
    },
    {
      "end": 3936654,
      "speaker": "Moritz Stefaner",
      "start": 3928764,
      "text": "And there you can also subscribe to our email newsletter if you want to get news directly into your inbox and be notified whenever we publish a new episode.",
      "id": "ep_164_ut_175"
    },
    {
      "end": 3949294,
      "speaker": "Enrico Bertini",
      "start": 3936742,
      "text": "That's right, and we love to get in touch with our listeners. So let us know if you want to suggest a way to improve the show or know any amazing people you want us to invite or even have any project you want us to talk about.",
      "id": "ep_164_ut_176"
    },
    {
      "end": 3955966,
      "speaker": "Moritz Stefaner",
      "start": 3949422,
      "text": "Yeah, absolutely. Don't hesitate to get in touch. Just send us an email at mailatastory es.",
      "id": "ep_164_ut_177"
    },
    {
      "end": 3960250,
      "speaker": "Enrico Bertini",
      "start": 3956118,
      "text": "That's all for now. See you next time. And thanks for listening to data stories.",
      "id": "ep_164_ut_178"
    }
  ],
  "confidence": 0.921682272637012,
  "audio_duration": 3970,
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_status_code": null,
  "webhook_auth": false,
  "webhook_auth_header_name": null,
  "speed_boost": false,
  "auto_highlights_result": null,
  "auto_highlights": false,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_audio_quality": null,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "content_safety": false,
  "iab_categories": true,
  "content_safety_labels": {
    "status": "unavailable",
    "results": [],
    "summary": {}
  },
  "language_detection": false,
  "language_detection_threshold": null,
  "language_confidence": null,
  "custom_spelling": null,
  "throttled": false,
  "auto_chapters": true,
  "summarization": false,
  "summary_type": null,
  "summary_model": null,
  "custom_topics": false,
  "topics": [],
  "speech_threshold": null,
  "speech_model": "best",
  "chapters": [
    {
      "summary": "This is a new episode of Data stories. Mauritsh Stefaner and Enrico Bertini talk about data visualization, data analysis, and the role data plays in our lives. If you enjoy the show, please consider supporting us with recurring payments on patreon. com.",
      "gist": "Data Stories",
      "headline": "Data stories podcast is back after months of silence",
      "start": 120,
      "end": 121456,
      "id": "ep_164_ch_0"
    },
    {
      "summary": "Edward Tufte has a new book out. It's called seeing with Fresh Eyes. We'll use the opportunity to talk about his body of work and his influence on the data we've seen. And we have a special guest we want to bring on later.",
      "gist": "Edward Tufte",
      "headline": "We are going to discuss Edward Tufte's work and his new book",
      "start": 121568,
      "end": 158250,
      "id": "ep_164_ch_1"
    },
    {
      "summary": "I still am in the German Covid-19 vaccination dashboard. We built an interactive mobile first site showing all the vaccination statistics in Germany. One of our goals was to make it so accessible that everybody can consume it well.",
      "gist": "A few projects that we're working on",
      "headline": "We have some quick projects we've been working on in the meantime",
      "start": 158330,
      "end": 261916,
      "id": "ep_164_ch_2"
    },
    {
      "summary": "Enrico: There's a tool that we are publishing online that is called slice lens. It's a little tool where you can select the attributes or variables of your data set and see how the model behaves in specific subsets. Even though some people say it's too simple, Enrico says it's powerful.",
      "gist": "Machine Learning: Slices Lens",
      "headline": "A tool called slice lens helps people understand machine learning models",
      "start": 262008,
      "end": 358206,
      "id": "ep_164_ch_3"
    },
    {
      "summary": "Danyel Kerrigan has been developing over times observable notebooks for teaching. D3 turned ten years old and the most influential data visualization library. It's really turning out to be a really promising platform for creating cool interactive Dataviz.",
      "gist": "Observable for Teaching",
      "headline": "Danyel Kerrigan has been developing observable notebooks for teaching",
      "start": 358358,
      "end": 449652,
      "id": "ep_164_ch_4"
    },
    {
      "summary": "Today we want to discuss more classical stuff than futuristic interactive notebooks. We want to talk about Edward Tufte's work and his perspective on Dataviz. We have a special guest that some of you might be familiar with from previous episodes. Sandra Rendgen.",
      "gist": "Edward Tufte",
      "headline": "Today we want to discuss more classical stuff than futuristic interactive notebooks",
      "start": 449716,
      "end": 511810,
      "id": "ep_164_ch_5"
    },
    {
      "summary": "What is your background, by the way, for other people who don't follow you? My background, yeah, that's a good question. I'm more of a humanities person, actually. I've studied art history and cultural theory. It was really Tufte and also Michael friendly who sort of paved the ground for this kind of research.",
      "gist": "In the Elevator With Dataviz's History",
      "headline": "Your last book looked at Charles Minard's work called the Minard System",
      "start": 511890,
      "end": 596630,
      "id": "ep_164_ch_6"
    },
    {
      "summary": "Edward Tufte's first book on data visualization came out in 1982. Half of the people I know in data visualization say this book opened their eyes. It had a huge impact on the way I saw visualization and its relevance in the world.",
      "gist": "Edward Tufte's Data Visualization: The First Book",
      "headline": "Edward Tufte's seminal book on data visualization is hugely influential",
      "start": 596670,
      "end": 803046,
      "id": "ep_164_ch_7"
    },
    {
      "summary": "Moritz: Tufte's first book, Gesamtkunstwerk, is a very rare combination of design and scientific rigor. He says it made popular the whole database field in the design community. Moritz: Still today, when people talk about information design, that would refer anyone to this book.",
      "gist": "A Taste of Tufte's Design in Visualization",
      "headline": "Moritz: This is a very rare combination of design and scientific rigor",
      "start": 803198,
      "end": 1020694,
      "id": "ep_164_ch_8"
    },
    {
      "summary": "The idea of small multiples appears there first and not in the first book. Then we have two follow up books, visual explanations and beautiful evidence. What is something that is new in those later books is an interest in pictorial strategies.",
      "gist": "Philip's Plot: Visual Explanations and Beautiful Evidence",
      "headline": "The idea of small multiples appears first and not in the first book",
      "start": 1020782,
      "end": 1180256,
      "id": "ep_164_ch_9"
    },
    {
      "summary": "Sandra: Give these things a good title is, you know, as you said before, it makes. people remember those concepts. Being precise about what you mean with a certain new concept can be super helpful. But sometimes people think just because you coined a term, you invented the whole concept.",
      "gist": "The Good Names of Conceptual Studies",
      "headline": "Giving concepts a good title makes people remember them, Sandra says",
      "start": 1180328,
      "end": 1434442,
      "id": "ep_164_ch_10"
    },
    {
      "summary": "The book is a collection of not totally finished, like, chapters. The layout is sort of weird, actually, but experimental. For me, it didn't quite click as the other books. My recommendation would be, if you have have the other four, you need to buy it.",
      "gist": "Seeing With New Eyes: Data, Truth, and Classification",
      "headline": "I find this book weakest of the five. Because the other ones are so strong",
      "start": 1434586,
      "end": 1770726,
      "id": "ep_164_ch_11"
    },
    {
      "summary": "Moritz: What I think is a huge achievement is the combination of claiming. scientific and or statistical rigor, claiming rigor in treating and how the data are treated in visualization. With the. With claiming a very high design standard. And that really gave a huge push to the whole field.",
      "gist": "The Design of Quantitative Data Visualization",
      "headline": "Moritz: The combination of claiming and claiming is what made him famous",
      "start": 1770878,
      "end": 1996762,
      "id": "ep_164_ch_12"
    },
    {
      "summary": "Edward Tufte has built a collection of historical stuff, some of which has made its way into the book. He's really managed to popularize the whole topic and make us aware that it's not something new. There are other people like Jason Forrest and RJ Andrews who are also digging to find stuff.",
      "gist": "How Did the Book Collection Get Started?",
      "headline": "Edward Tufte has amassed a huge collection of historical books",
      "start": 1996946,
      "end": 2285682,
      "id": "ep_164_ch_13"
    },
    {
      "summary": "Tufte's theory is that every single pixel in a graphic should be connected to data and present data. But in the theory he presents in the books, I think it comes across very much as very restrictive and very no fun allowed. I would argue history has proven him wrong.",
      "gist": "What Makes a Good Data Visualization?",
      "headline": "Tufte has a very clear theory about what makes a good data graphic",
      "start": 2285706,
      "end": 2478386,
      "id": "ep_164_ch_14"
    },
    {
      "summary": "Enrico: I think Tufte was mostly addressing the idea of having efficient graphics. But we now use visualization for different kind of purposes. So visualization can also be used as having an experience. I think we should see this more in a historical development.",
      "gist": "In the Elevator With Tufte",
      "headline": "Enrico: I think Tufte's theory is a reaction",
      "start": 2478498,
      "end": 2976104,
      "id": "ep_164_ch_15"
    },
    {
      "summary": "Enrico: The last book is more on the art side. He's always like jumping between art and science. Maybe it can be seen as a wild pool of ideas that could inform future solutions.",
      "gist": "Quantum Design: Art and Science",
      "headline": "Enrico: The last book is more on the art side than science",
      "start": 2976152,
      "end": 3372732,
      "id": "ep_164_ch_16"
    },
    {
      "summary": "Moritz: There is a lot of additional empirical evidence that could be gathered by just sifting through Datavis' books. He says it's also important that we move on and see every, everybody's perspective on Datavis as one perspective, not the perspective. Moritz: It seems to be a missed opportunity that Dataviz doesn't seem to engage with the larger community.",
      "gist": "A Lesson on the Datavis Collection",
      "headline": "Moritz: I think Datavis' books have distorted the research field",
      "start": 3372756,
      "end": 3703660,
      "id": "ep_164_ch_17"
    },
    {
      "summary": "There's a really fun review by Robert Kosara from 2012. He was part of one of the workshops. He didn't really enjoy it. There's an online version now. You can take part. If you have taken part in a Tufte course, let us know if you liked it.",
      "gist": "Tufte Course Review by Robert Kosara",
      "headline": "We didn't mention Robert Kosara's Tufte workshops",
      "start": 3703700,
      "end": 3802800,
      "id": "ep_164_ch_18"
    },
    {
      "summary": "Cool. I think we should wrap it up. Thanks so much for joining us. And get the books. The first one is a classic. Basically pour a glass of wine and go on the right. That is visual display of quantitative information. We hope we will record soon again.",
      "gist": "A Taste of the Data",
      "headline": "We hope to record soon again, not just in half a year or something",
      "start": 3804300,
      "end": 3873700,
      "id": "ep_164_ch_19"
    },
    {
      "summary": "This show is crowdfunded and you can support us on patreon@patreon. com Datastories. You can also subscribe to our email newsletter to get news directly into your inbox. Let us know if you want to suggest a way to improve the show.",
      "gist": "Data Stories",
      "headline": "This show is crowdfunded and you can support us on patreon",
      "start": 3878170,
      "end": 3960250,
      "id": "ep_164_ch_20"
    }
  ],
  "disfluencies": false,
  "entity_detection": false,
  "sentiment_analysis": false,
  "sentiment_analysis_results": null,
  "entities": null,
  "speakers_expected": null,
  "summary": null,
  "custom_topics_results": null,
  "episode_num": 164,
  "episode_metadata": {
    "speakers": [
      "Sandra Rendgen",
      "Moritz Stefaner",
      "Enrico Bertini"
    ],
    "WPid": "1634",
    "url": "https://datastori.es/podlove/file/6836/s/feed/c/mp3/164-edward-tuftes-complete-work-with-sandra-rendgen.mp3",
    "episode_title": "Edward Tufte's complete work with Sandra Rendgen"
  }
}