{
  "id": "b036eac9-2de9-48c2-b130-80e77e22e469",
  "language_model": "assemblyai_default",
  "acoustic_model": "assemblyai_default",
  "language_code": "en_us",
  "status": "completed",
  "audio_url": "https://datastori.es/podlove/file/375/s/feed/c/mp3/Datastories-35.mp3",
  "utterances": [
    {
      "end": 17038,
      "speaker": "Enrico Bertini",
      "start": 11920,
      "text": "Hi everyone. Data stories number 35. Hi, Moritz, how are you?",
      "id": "ep_35_ut_0"
    },
    {
      "end": 18654,
      "speaker": "Moritz Stefaner",
      "start": 17214,
      "text": "Great. How are you, Enrico?",
      "id": "ep_35_ut_1"
    },
    {
      "end": 27090,
      "speaker": "Enrico Bertini",
      "start": 18742,
      "text": "I'm doing fine. I'm doing great, actually. Finally we have some warm weather down here. How is it going in Germany?",
      "id": "ep_35_ut_2"
    },
    {
      "end": 30990,
      "speaker": "Moritz Stefaner",
      "start": 27790,
      "text": "Nice. It's super warm. Well, actually, I just spent a week.",
      "id": "ep_35_ut_3"
    },
    {
      "end": 31334,
      "speaker": "Enrico Bertini",
      "start": 31030,
      "text": "Come on.",
      "id": "ep_35_ut_4"
    },
    {
      "end": 31902,
      "speaker": "Robert Kosara",
      "start": 31382,
      "text": "Super warm.",
      "id": "ep_35_ut_5"
    },
    {
      "end": 33810,
      "speaker": "Enrico Bertini",
      "start": 31926,
      "text": "I cannot believe it. Yeah.",
      "id": "ep_35_ut_6"
    },
    {
      "end": 37318,
      "speaker": "Moritz Stefaner",
      "start": 34830,
      "text": "At least it's above zero. Oh, okay.",
      "id": "ep_35_ut_7"
    },
    {
      "end": 40446,
      "speaker": "Enrico Bertini",
      "start": 37414,
      "text": "Oh, sure. You Germans call this super warm, right?",
      "id": "ep_35_ut_8"
    },
    {
      "end": 71514,
      "speaker": "Moritz Stefaner",
      "start": 40598,
      "text": "Exactly. That's our summer. No, actually I just came back from a week in Belgrade for the resonate festival and we actually wore t shirts, so that was nice. Yeah, it was a good festival. I taught together with my colleague Dominicus, a three day workshop on data visualization. So we built visualizations mostly with Tableau and raw, actually. And people actually built really nice graphics. I hope we can upload them soon.",
      "id": "ep_35_ut_9"
    },
    {
      "end": 77530,
      "speaker": "Enrico Bertini",
      "start": 71642,
      "text": "Cool, cool. Yeah, I'm using Tableau as well in my class, and students like it a lot.",
      "id": "ep_35_ut_10"
    },
    {
      "end": 78738,
      "speaker": "Moritz Stefaner",
      "start": 77570,
      "text": "Yeah, cool.",
      "id": "ep_35_ut_11"
    },
    {
      "end": 82258,
      "speaker": "Enrico Bertini",
      "start": 78834,
      "text": "It's super fast. Robert is there.",
      "id": "ep_35_ut_12"
    },
    {
      "end": 86310,
      "speaker": "Alberto Cairo",
      "start": 82314,
      "text": "Sorry, not supposed to jump in yet. Sorry about that.",
      "id": "ep_35_ut_13"
    },
    {
      "end": 88906,
      "speaker": "Moritz Stefaner",
      "start": 87650,
      "text": "Robert agrees.",
      "id": "ep_35_ut_14"
    },
    {
      "end": 90510,
      "speaker": "Enrico Bertini",
      "start": 89058,
      "text": "Okay, Robert goes back.",
      "id": "ep_35_ut_15"
    },
    {
      "end": 115246,
      "speaker": "Moritz Stefaner",
      "start": 94070,
      "text": "No, it worked well. And raw is also really nice. It's already out from density design. It's a web based application. You can just paste in the CSV and produce all kinds of charts. It's actually quite similar to Tableau in a sense that you drag your variables to visual variables and they have a new version coming up. That's super dope. It's really good.",
      "id": "ep_35_ut_16"
    },
    {
      "end": 116942,
      "speaker": "Enrico Bertini",
      "start": 115318,
      "text": "I haven't tried it yet. I should.",
      "id": "ep_35_ut_17"
    },
    {
      "end": 120446,
      "speaker": "Moritz Stefaner",
      "start": 117006,
      "text": "Yeah, we received a preview and it's really, really great.",
      "id": "ep_35_ut_18"
    },
    {
      "end": 123502,
      "speaker": "Enrico Bertini",
      "start": 120598,
      "text": "Cool. Does it work on the web?",
      "id": "ep_35_ut_19"
    },
    {
      "end": 132530,
      "speaker": "Moritz Stefaner",
      "start": 123646,
      "text": "Can you use it on a web page based application? Free, open source and quite extensible and quite powerful. Cool.",
      "id": "ep_35_ut_20"
    },
    {
      "end": 136942,
      "speaker": "Enrico Bertini",
      "start": 133630,
      "text": "Should we start? We have some special guests on the show.",
      "id": "ep_35_ut_21"
    },
    {
      "end": 138246,
      "speaker": "Moritz Stefaner",
      "start": 137086,
      "text": "We have a big topic.",
      "id": "ep_35_ut_22"
    },
    {
      "end": 143730,
      "speaker": "Enrico Bertini",
      "start": 138358,
      "text": "Big topic we're gonna talk about. We're gonna not talk. We're gonna fight about storytelling.",
      "id": "ep_35_ut_23"
    },
    {
      "end": 152724,
      "speaker": "Moritz Stefaner",
      "start": 146350,
      "text": "If everybody agrees with me, everything's good. Otherwise, who in trouble?",
      "id": "ep_35_ut_24"
    },
    {
      "end": 159556,
      "speaker": "Enrico Bertini",
      "start": 152892,
      "text": "Yeah. So we have two special, special guests today. We have Robert Kosara from Tableau. Hi, Robert.",
      "id": "ep_35_ut_25"
    },
    {
      "end": 160880,
      "speaker": "Alberto Cairo",
      "start": 159748,
      "text": "Hi, Rico.",
      "id": "ep_35_ut_26"
    },
    {
      "end": 170580,
      "speaker": "Enrico Bertini",
      "start": 161620,
      "text": "With probably cappuccino coffee in his hands. 07:00 in the morning there. Sorry, Robert, for waking you up so early.",
      "id": "ep_35_ut_27"
    },
    {
      "end": 171600,
      "speaker": "Alberto Cairo",
      "start": 170700,
      "text": "That's good.",
      "id": "ep_35_ut_28"
    },
    {
      "end": 182600,
      "speaker": "Enrico Bertini",
      "start": 173380,
      "text": "And. Oh, I'm stuck. Sorry, maybe it's too early for me as well. And we have Alberto Cairo on the show. Hi, Alberto.",
      "id": "ep_35_ut_29"
    },
    {
      "end": 184160,
      "speaker": "Robert Kosara",
      "start": 182900,
      "text": "Hey, how are you?",
      "id": "ep_35_ut_30"
    },
    {
      "end": 187268,
      "speaker": "Enrico Bertini",
      "start": 184540,
      "text": "I'm good, I'm good. So it's not too early there.",
      "id": "ep_35_ut_31"
    },
    {
      "end": 193476,
      "speaker": "Robert Kosara",
      "start": 187324,
      "text": "Right now it's ten something in Miami, something like that. So it's great. And the weather is very nice.",
      "id": "ep_35_ut_32"
    },
    {
      "end": 195644,
      "speaker": "Enrico Bertini",
      "start": 193588,
      "text": "Yeah, as usual. We are on the same.",
      "id": "ep_35_ut_33"
    },
    {
      "end": 197332,
      "speaker": "Moritz Stefaner",
      "start": 195772,
      "text": "Yeah, no surprise there.",
      "id": "ep_35_ut_34"
    },
    {
      "end": 231480,
      "speaker": "Enrico Bertini",
      "start": 197436,
      "text": "No surprise there. No surprise there. Okay, so we want to talk about storytelling. And, Moritz, you want to start with, I think that these whole things started with your talk and post later, visualized, when you've been arguing for. No, against storytelling or something like that. You said that people shouldn't actually tell story or only stories with visualization, but more explore worlds, right?",
      "id": "ep_35_ut_35"
    },
    {
      "end": 353572,
      "speaker": "Moritz Stefaner",
      "start": 232340,
      "text": "Yeah, yeah, yeah. For me, it's been a topic I've been thinking about longer. I mean, we also had Robert on the show already, like a year or two ago, and I think we started talking about storytelling, especially narrative techniques. And since then, also, the topic has really, it's been popping up everywhere. Right. Like whenever there was, let's say, whenever data visualization or information graphics was designed in a wider context, for me, it felt like it's always connected to storytelling, and it was also, or it's still sort of the default explanation why we do this. Often people will say, yeah, we're telling stories with data, and that's the ultimate goal. And in the beginning, I thought like, yeah, that's cool, and that's what it's all about. But then the more I thought about the term and the more I also realized how people use it and also what external people to have seen connect with the term stories and what they then expect from our information graphics. I felt like maybe the term doesn't really apply all that well, and maybe it's, maybe there's something story like to visualizations, but maybe it's much different from what actually traditional storytelling does, like the kind at the campfire, you know, or the kind of storytelling we know from novels or the kind of storytelling we know, maybe even from newspapers. And so the more I discussed and thought about it, for me personally, the less I think the term is a good definition of what we actually do. And by now, I'm so cranky and so, like, you know, I've over discussed it. I think we should even not use that term anymore. But that might just be a very personal frustration with getting to grips with it. So, and I hope today maybe we find better ways of getting to grips with the term and maybe define a bit more clearly, like what that type of storytelling is that we do in data visualization, if we do it at all.",
      "id": "ep_35_ut_36"
    },
    {
      "end": 453310,
      "speaker": "Robert Kosara",
      "start": 353676,
      "text": "Storytelling is certainly a very loaded word, right? And it's, everybody has his or her own definition of it, but I discovered that it was a very, very loaded word. I mean, we in journalism, as you know, I have a background in journalism. We in journalists like to throw out, you know, storytelling all the time. We do stories, we write stories, we draw stories, etc. Etcetera. But I discovered that it's a very, very loaded word in other areas when I co wrote a column for Nature Methods magazine a while ago, which I discussed in my blog a while ago, along with Martin Krezwinski. And Martin is a scientist, and we co wrote that column to basically explain to scientists that journalistic and storytelling techniques could be applied to the communication of science, particularly using graphics. So it was a column about storytelling with visualization. It was about that. And some people received that column quite well. But we also got some pushback from several scientists saying that the scientific method itself had been created to fight human's natural tendency to create stories about everything, meaning, making connections between unconnected points in order to make sense of those points. And I think that there is some, you know, something interesting to take from that, from that conversation. I'm not going to get into that right now, because then I will spoil the entire conversation.",
      "id": "ep_35_ut_37"
    },
    {
      "end": 464354,
      "speaker": "Enrico Bertini",
      "start": 454970,
      "text": "Yeah, but that's a very interesting angle, actually, the objectivity of whatever we put out there. I think that's a huge topic, and it's very much related to storytelling. Yeah.",
      "id": "ep_35_ut_38"
    },
    {
      "end": 472906,
      "speaker": "Moritz Stefaner",
      "start": 464482,
      "text": "Which type of storytelling, like, did you write about in the scientific context? Was it like illustrating abstract findings with a concrete scenario?",
      "id": "ep_35_ut_39"
    },
    {
      "end": 528219,
      "speaker": "Robert Kosara",
      "start": 473058,
      "text": "We said that, for instance, it was actually a very, very short column. But what we are trying to advocate or to propose was that, for instance, when you write a research paper or when you create your research poster or something, you could apply techniques that are borrowed and are well developed in journalism and traditional graphic design, meaning sequencing the information, layering the information, showing cause and effect, etcetera, etcetera. So those kinds of very simple techniques which we believe at that point that there were, you know, basically no brainers, very common sense. When you write anything, you need to have some sort of a structure, narrative structure. And when you draw something, perhaps you should also use that narrative structure. So we were trying to propose that method that went. But basically we discovered that scientists disagree with that. And for good reason. For good reason.",
      "id": "ep_35_ut_40"
    },
    {
      "end": 568796,
      "speaker": "Moritz Stefaner",
      "start": 528259,
      "text": "I believe maybe we can discuss or collect a bit all the different uses of the term story. We have found we should do that, actually. Yeah, yeah. And one that I come across quite often, and I think that is also. It's part of our toolbox, is exactly what you mentioned is, let's say, maybe applying tricks that guide readers in certain directions, like establishing pathways, in a sense that I make sure this is seen first and then this other thing is seen second, and this third thing is seen third. And together, that establishes some, maybe some temporal order.",
      "id": "ep_35_ut_41"
    },
    {
      "end": 633250,
      "speaker": "Alberto Cairo",
      "start": 568908,
      "text": "Yeah, that's a trick. That's what's called a narrative. I mean, that's the whole point of a story, that you. That you sequence things and that you have a reason for putting one thing first, another thing next, and then have some kind of path through your information. So that discussion about scientific kind of storytelling strikes me as a bit odd, because the question isn't so much about how you discover things, but how you communicate them. And those should be, if not entirely separate, then at least distinct things and ways of doing those things. So you don't have the same processes for communicating your findings, that you have for actually making those findings or discovering your information. So, to me, there's a lot of confusion about those processes and not really clear separation of what you're trying to achieve in each of those. And that's true not just for science, certainly it's true for all kinds of visualization as well.",
      "id": "ep_35_ut_42"
    },
    {
      "end": 636478,
      "speaker": "Enrico Bertini",
      "start": 634750,
      "text": "This actually resonates better.",
      "id": "ep_35_ut_43"
    },
    {
      "end": 636926,
      "speaker": "Robert Kosara",
      "start": 636614,
      "text": "Sorry.",
      "id": "ep_35_ut_44"
    },
    {
      "end": 638662,
      "speaker": "Enrico Bertini",
      "start": 636958,
      "text": "Sorry. Go ahead, Alberto.",
      "id": "ep_35_ut_45"
    },
    {
      "end": 748966,
      "speaker": "Robert Kosara",
      "start": 638846,
      "text": "I was about to say that after that. After that article was published and the pushback and then our replies, et cetera, were published in Nature Methods magazine, I actually have been thinking a lot about how to define the terms that I use in my own writing. I threw out storytelling carelessly in many previous writings, but I'm much more careful right now, now. And I try to make a distinction, and I know that it's an unnatural distinction. There's not a clear boundary between the two things, but a boundary between. Create a boundary between narrative techniques and storytelling. And I actually was reading a book the other day, actually yesterday, that gave me, or at least suggested what the difference may be between one thing and the other thing. And it's actually that you point out in several of your writings. And the book is this one. I have it in front of me because I highlighted the part in which it talks about it. It's called the Unpersuadables, which is about, you know, it's called. It's subtitled Adventures with the Enemies of science. So it's about cognitive biases, all that kind of thing, thinking fast and slow, these kinds of stuff. But in one of the parts, the author talks about patronicity, which is a term that Michael Shermer uses a lot in the book, The Believing Brain. And he also talks about stories, stories, in the sense of how the brain processes information and creates sequential, connects events in a sequential manner, even if there is not a causal connection between those events. And he defines a story, a story as we traditionally know it. He says that a story is a description of something happening that contains some form of sensation or drama. That is the key thing.",
      "id": "ep_35_ut_46"
    },
    {
      "end": 750758,
      "speaker": "Moritz Stefaner",
      "start": 749078,
      "text": "Drama is an interesting point.",
      "id": "ep_35_ut_47"
    },
    {
      "end": 779062,
      "speaker": "Robert Kosara",
      "start": 750854,
      "text": "That is the thing it says. It's an explanation of cause and effect. But it is not just an explanation of cause and effect. That is a narrative. A narrative is a cause and effect connection of events that leads you through the process of understanding information. It becomes a story, according to this author, obviously, when it is soaked in emotion. So when you bring the drama, when you create a conflict, that's a fantastic point.",
      "id": "ep_35_ut_48"
    },
    {
      "end": 780530,
      "speaker": "Enrico Bertini",
      "start": 779206,
      "text": "Yeah. Sorry. Sorry.",
      "id": "ep_35_ut_49"
    },
    {
      "end": 806150,
      "speaker": "Robert Kosara",
      "start": 781270,
      "text": "No, you say you just put things together in a sequential manner. That is something that I do all the time in my work, and everybody does that. I believe that in this creed and a narrative. Yeah, but when you do. When you do a narrative in which you have an opening, a conflict, the consequences of that conflict and the closure or the resolution of that conflict, that's a story. It's not just a narrative.",
      "id": "ep_35_ut_50"
    },
    {
      "end": 821238,
      "speaker": "Moritz Stefaner",
      "start": 806230,
      "text": "If you just have a cooking recipe, you know, you don't have a story. You just have a sequence of things that follow each other. But if you have a person cooking and then they drop the egg or, you know, the neighbor rings at the door and suddenly you have a story.",
      "id": "ep_35_ut_51"
    },
    {
      "end": 914298,
      "speaker": "Enrico Bertini",
      "start": 821294,
      "text": "But at the same time, I think that's a very, very fine line. I think it's hard to distinguish between. Always distinguish between these two things, right? Every single narrative is soaked into some kind of story in the end. Right? I think that in. So my point of view is that it's very, very hard to strip away people's point of view and personality. It's much, much better to make it obvious and clear. What's your position on everything, right. Rather than trying to chase this myth of objectivity. I think even the argument made by the scientists is somewhat weird. Looks somewhat weird to me. And especially, I think I leave this thing myself because I, in a way, I am a scientist myself, and I know that when I present the results of whatever I study or any scientific experiment, there is always basically impossible to remove yourself from what you've done. Much, much better is to develop. It cannot be done. It's just not possible. So I think how much a much better way is to be aware that there is always your point of view there and make it as explicit as possible and be skeptical with yourself as well. I think that's the best way to go. But this myth that we can be super objective on everything looks somewhat weird and I see a connection with journalism as well. I mean, Alberto, you can tell me if this is true or not. I mean, a journalist, I mean, journalists are always striving for objectivity, right? But there's no objectivity out there.",
      "id": "ep_35_ut_52"
    },
    {
      "end": 1035228,
      "speaker": "Robert Kosara",
      "start": 914474,
      "text": "I mean, I was about to say that what you're saying applies directly to my world, to journalism. There has been this ongoing discussion about objectivity. Yes or no? If objectivity needs to be dropped as a concept or as a. Or as a guide or as a goal, etcetera, I don't believe that it needs to. I do believe that we need to think about objectivity, but we need to redefine what objectivity is. Obviously, absolute objectivity is impossible just because we are not objects, we are subjects. So we soak things with emotion. But at the same time, as you said, if you are aware or try to be aware of your own biases, you try to curb those biases somehow, etcetera. You are tending to be objective in that sense. And I think that obviously, the boundary between what we were describing before narrative and story, is very, very fuzzy. I am very aware of that. But there are certain examples that we can use to explain where that boundary might be. And I'm going to make an analogy. I love to make analogies to reason. Think about a documentary, a documentary that shows or talks about a very poor neighborhood in a city like Miami. And I'm putting this example because I saw a project by a student of mine yesterday. That project described or showed the lives of people who live in that neighborhood. The student interviewed those people. You hear those people talking about how hard it is for them to live there, etcetera, etcetera, etcetera. But then it has music, very sentimental music in the background. If the project didn't have music, I would consider it a narrative. It is still soaked in emotion, but the emotion arises from the content of the story, from the content itself, from what those people are saying. The music is an intervention from the designer.",
      "id": "ep_35_ut_53"
    },
    {
      "end": 1036660,
      "speaker": "Moritz Stefaner",
      "start": 1035324,
      "text": "It's a dramatization.",
      "id": "ep_35_ut_54"
    },
    {
      "end": 1060810,
      "speaker": "Robert Kosara",
      "start": 1036820,
      "text": "It's a dramatization that the designer applies. So there is a difference, I believe, between the emotions that readers or their viewers take from the story that you're telling, from the narrative that you're taking, and the emotions that you attract, that you try to push or that you try to instill in the story that you're telling. I believe that the boundary lies in there. And we have seen examples of visualizations recently that do that.",
      "id": "ep_35_ut_55"
    },
    {
      "end": 1115760,
      "speaker": "Moritz Stefaner",
      "start": 1061470,
      "text": "It's interesting. So you could talk about, like, maybe the most, like, abstract or distanced way would be just to report averages of poverty and let's say, countrywide statistics. And the middle ground would be to show individual, actual poor people and tell a bit about their lives. And then you have the most extreme case of doing that and adding additional emotional triggers, let's say, just to make sure everybody gets that the situation is really bad. So that is probably the spectrum. And maybe on the one hand, you have, like, just seeing the world as something you measure and like a lab. On the other hand, you have this, the pure emotion and you don't. Yeah. You sort of switch off all rationality and just follow your, your instincts and your heart. Right.",
      "id": "ep_35_ut_56"
    },
    {
      "end": 1118908,
      "speaker": "Robert Kosara",
      "start": 1116100,
      "text": "I know that Robert has a different definition of story.",
      "id": "ep_35_ut_57"
    },
    {
      "end": 1119500,
      "speaker": "Moritz Stefaner",
      "start": 1119044,
      "text": "Yeah.",
      "id": "ep_35_ut_58"
    },
    {
      "end": 1351220,
      "speaker": "Alberto Cairo",
      "start": 1119580,
      "text": "Yeah. Well, I was going to say there's also a danger, of course, when you maybe that's also why people are a bit skeptical about story. It's because what you're just describing can also become a bit of a tear jerker. And you're just kind of, you're going for this full kind of emotional effect rather than really talking about facts and making the facts the thing that really is your story or that becomes the main part of what you're trying to say. You're going for full on emotion and just kind of crying babies and whatever. So it's just a bit too, it's too easy in a sense. Sometimes I feel cheated by those stories because it can become too easy to make it dramatic with certain kind of triggers, in a way. So, yeah, I've been thinking about this, and of course, in response to more, it's kind of arguing against story. In his posting a while ago, I've been thinking about how this, how this should work. And maybe I'm not clear about the definition here between, or the distinction, I should say, between story and narrative. But either way, maybe even if we just go with narrative, what I think is important is to lead people into a story or into, I shouldn't say into a story. Lead people into insights. Well, lead them into a new, a new collection of data, a new collection of facts that they haven't seen before. So if I've never heard about some part of Miami, or if I have never heard about, if I've never thought about certain data because it's about, I don't know, you know, trying to come up with a good example here, climate. So, for example, there was one story a while ago, this is in the New York Times in 2007 or so, about the Copenhagen talks on climate change. And they were interested in showing how different countries were arguing for different kinds of limits on CO2 production based on different ways of measuring that. And so if you've never thought about that, of course, the obvious thing is you measure the amount of stuff that gets produced, right? CO2 that gets put out. But that's not necessarily how people think about that, because these discussions, a lot of those are about how do you measure that relative to something like relative to population, relative to GDP and so on. And so then you want to introduce people to these different perspectives because they're important. That's the whole thing. This is what they spend a week doing, is they argue about what way of measuring this is the right way. And then, of course, there are lots and lots of little things as well. But you introduce people to something different and new that they haven't seen before. And so here, this is where I see the narrative coming in. It doesn't just throw you in there and say, well, here's data. And you have to figure out, well, why are there 15 different ways of measuring this thing? But here is a reason why different countries and different, whatever stakeholders, whatever people who have different interests here want to measure things differently, because the data looks better seen from one way than from the other way. And so you can show that. And this is what that particular graphic did. I'm going to add a link to that in the notes for this podcast. And when you see that, it becomes very clear. And so you kind of let into this, and then you can do a video for your own exploration from there. And so this is where I see narrative being really important. It tells you, it gives you a bit of introduction. It can give you some of that cause and effect. It's also very dangerous when you talk to scientists about it because they were going to tell you, well, have you proven this? Is there actual causality here? And of course, most of the time there isn't. But the point is that you use that to imply the causality, or you claim the causality, and then you use that to kind of lead people into that, and then they can follow up on those claims themselves and figure out if they believe you or not.",
      "id": "ep_35_ut_59"
    },
    {
      "end": 1384030,
      "speaker": "Moritz Stefaner",
      "start": 1351720,
      "text": "Is there something that also a good teacher maybe would do, like have a sequence of factors and or like complex constellations of something and explain to you why he or she would first show this and what insights you can gain and then go into details of the problem or show another side of the same metal, let's say. Or maybe also something Hans Rosling will do. Like he has complex, you know, talks about global economics and guides you through a whole sequence of complex constellations there.",
      "id": "ep_35_ut_60"
    },
    {
      "end": 1481500,
      "speaker": "Robert Kosara",
      "start": 1384490,
      "text": "This resonates a lot to me, obviously, being a journalist, obviously, when you're one of. Alright, let me go back a little bit. One of the main mistakes or one of the things that worried me the most about the recent discussion about storytelling. Yes. Storytelling, no. Is that we are. I believe that people, we people who are writing about this discussion are not thinking about. I'm not thinking enough about the purpose of what we do and who the audience for the things that we do is. Because it is not the same thing to do a visualization for scientists than doing the same visualization for a general audience. And I think actually that this is one of the main mistakes that is inherited from the past. It's one of the main mistakes that I believe that Edward Tufte makes in all his books. He basically assumes in the background, you can notice that, that he assumes that everybody is a statistician, and that everybody cares a lot about the data and everybody is going to spend half an hour exploring the very complex graphic that you have in front of you. That is not true. It's untrue. You have to somehow seduce readers, particularly if you're addressing your product or your visualization to a general audience. You have to guide them, as Robert said, through the process of understanding the foundations or the basics of the story. Let's use that word in a loose sense there. And then you let them explore the data if they want to. If they don't, at least they will walk away with a basic understanding what the main messages are.",
      "id": "ep_35_ut_61"
    },
    {
      "end": 1557468,
      "speaker": "Moritz Stefaner",
      "start": 1482640,
      "text": "Yeah, that's the point. Why I don't agree anymore, I think. And you said something interesting, and I mean, we all have our background, right? And I come more maybe from a technology slash design background, and you come from a journalistic background and you said readers. And so, of course, you know, you think in terms of media, publications, and you have people producing them, and then you have an audience that you're addressing. And I think that sort of formula implies the inverted pyramid, that you make sure people get the gist of a story, even if they just read the headline, and if they jump off after the first paragraph, they should still have the most basic facts. And then you get into the details. I think that applies really well when there is a fixed or a pre made news story to be communicated. In fact, in a classical media communication situation, where you have like a broadcaster and a recipient, more or less, and I think that applies to a lot of cases where we use data visualization, where it can be used very successfully. But I think it's not all. I think there's also many cases where thinking about it as a specific message has to be broadcasted. It leads us maybe into the wrong direction.",
      "id": "ep_35_ut_62"
    },
    {
      "end": 1591746,
      "speaker": "Alberto Cairo",
      "start": 1557524,
      "text": "Well, not necessarily. It doesn't have to be a particular measure. I think what you're getting to is what if you have a large collection of data and you don't want to necessarily give people just that? So throw them in there, but give them a reason to explore. I think this was also what Alberto was talking about. So it's not just that I'm telling you the whole story, but I want to hear a lot of stuff. Here's a lot of data, and I want you to give you a few starting points, because otherwise, how are you going to know where to start or whether there is actually.",
      "id": "ep_35_ut_63"
    },
    {
      "end": 1653670,
      "speaker": "Moritz Stefaner",
      "start": 1591818,
      "text": "But let's look at, for instance, a concrete example. So map of the market is one of my, really my all time favorite visualizations. So it's a tree map. We had Ben Schnardman on the show. He invented this of all the stock market movements, I think, in a certain time period. And you can use it just to quickly get an overview of the stock market situation right now. You will immediately see maybe technology stocks doing really well today and other stocks doing really badly, and it will change every day. And on some days it looks boring, on other days it looks exciting. But it's always a display. You know, it's a different window into the world, let's say. And it's a specific thing. You can look. Yeah, a certain window. You can look through how the world looks on that particular day. And I don't even see how that would benefit or how it would need storytelling. You know, it's a beautiful, very effective and a very, like, exciting tool to look at the world. And I think it's a very fine use of visualization.",
      "id": "ep_35_ut_64"
    },
    {
      "end": 1716900,
      "speaker": "Robert Kosara",
      "start": 1653820,
      "text": "It may not benefit from storytelling per se, but it can benefit from annotation and highlighting the main points of today. Because otherwise, I mean, again, it all depends on the audience. If you do that visualization and you just have stock market analysts in mind, that is the thing to do. You just present the data. They will figure it out themselves, just because they have the right knowledge to approach that visualization. And they will be, beforehand, they will be interested in that topic. So they will be invited, and they will feel invited and compelled to explore the visualization. But if you want to broaden the scope and bring in people that are not necessarily interested in that topic, you should present the entire complexity of the data. So I'm not against that. I love exploratory visualizations as much as anyone else here, but it doesn't hurt to write a headline and several pointers saying, hey, see what's going on today? Take a look at this company here. Take a look at this company.",
      "id": "ep_35_ut_65"
    },
    {
      "end": 1745220,
      "speaker": "Moritz Stefaner",
      "start": 1717640,
      "text": "Isn't this a different notion of story then? I mean, to me that is why, you know, that's why I mean, the term to me that's. That's annotation and contextualizing the information, or as you said, highlighting. But, you know, to me, that's so fundamental, like user interface design in a way. I don't even think about storytelling at that. I don't feel like I'm making a Hollywood.",
      "id": "ep_35_ut_66"
    },
    {
      "end": 1777280,
      "speaker": "Enrico Bertini",
      "start": 1754560,
      "text": "So I think there is a key question here. Are we arguing for saying that every visualization is, in a way or another, storytelling? I don't think so. I'm not. No, I would never. I think, I'm sure that everyone agrees that there are many, many other visualization out there that are not storytelling, right? So I think that. I totally believe that. So I think.",
      "id": "ep_35_ut_67"
    },
    {
      "end": 1780132,
      "speaker": "Moritz Stefaner",
      "start": 1779020,
      "text": "I'd like to establish that.",
      "id": "ep_35_ut_68"
    },
    {
      "end": 1812220,
      "speaker": "Enrico Bertini",
      "start": 1780156,
      "text": "That's my standpoint. There are many, many visualizations out there that are not storytelling and they are good. So I don't. Or in other ways there. Not every visualization has to be a storytelling visualization. I think that's in a way also the problem I have with the term myself is that if you look around, it looks like that visualization is almost only about storytelling. And I think it's not. There is so much more out there. Right. I think that's the only risk I see on this over this big hype around storytelling.",
      "id": "ep_35_ut_69"
    },
    {
      "end": 1824766,
      "speaker": "Robert Kosara",
      "start": 1812880,
      "text": "But let's talk about discover interesting data or interesting information. If you do it through a story or through other means, I don't mind, but it's a process of discovery. Sorry, interrupted Robert.",
      "id": "ep_35_ut_70"
    },
    {
      "end": 1869274,
      "speaker": "Alberto Cairo",
      "start": 1824798,
      "text": "No, that's fine. So I just wanted to talk a bit about this example a bit more because I think it's a really good one. So the map of the market, as Moritz was just saying, is it can be really interesting and it can be totally random, right? And so the reason you think it's interesting is because you've seen it in configurations and it was interesting. If somebody goes there and just looks at it and just sees a random red and green there, they're going to say, well, this doesn't make any sense to me, and that's going to be it. So the way you can show people that this can be interesting is you give them an introduction, you show them, look, on this day it was all red and there were two green spots. It was really interesting because there were those two things that were the only ones that were okay on that day. And then you show some other tied.",
      "id": "ep_35_ut_71"
    },
    {
      "end": 1871114,
      "speaker": "Moritz Stefaner",
      "start": 1869322,
      "text": "Back to the real world and sort.",
      "id": "ep_35_ut_72"
    },
    {
      "end": 1959138,
      "speaker": "Alberto Cairo",
      "start": 1871122,
      "text": "Of explain why configurations. And actually I have some screenshots like that. I used it when I was teaching, because that's how you introduce people to, in this case, to the visualization mostly, is to say, look, this is a way of showing data that's really interesting, that in some cases can give you some really interesting insights that you wouldn't be able to get any other way. And so here's my little story that shows you a few examples, or narrative, or whatever you want to call it. And now I've introduced you not so much to the data, because the stock market is something that most people know, at least have some idea of. But here's an introduction to this technique and to this way of working with the data and why it can be a good idea, but that can be really important if you want to get people to understand why a lot of people think that this was a really brilliant way of showing the data. Because if you just go there, I don't know, today perhaps, though, today is probably going to be interesting because all the tech stocks are down, but you're going to, so you're going to see a structure, but if you go there on a day when it's all, all random stuff, then it's not going to be interesting. So giving people a sense of why they should care and why a certain visualization can be a good thing, and why a different way of looking at the data, other than the usual stock market line charts is a good thing to do. You need good examples, and you need to guide them into this. And that's exactly where this notion of narrative comes in. And even if that's really interesting story.",
      "id": "ep_35_ut_73"
    },
    {
      "end": 1999538,
      "speaker": "Moritz Stefaner",
      "start": 1959194,
      "text": "As such, I mean, Gepminder is really boring software, let's be honest, it's like dry as the desert. But when it's performed, and I'm saying performed by Hans Rosling, it's like he's playing Gapminder. You know, he plays a Gapminder for you, then it becomes exciting. No? And I think that's interesting. And this distinction is interesting, that there might be the visualization itself, and then a person contextualizing it, or a person showing you why it's interesting, or a person performing it for you. So this idea of software performance is very interesting, or information performances I think in this context.",
      "id": "ep_35_ut_74"
    },
    {
      "end": 2008978,
      "speaker": "Enrico Bertini",
      "start": 1999714,
      "text": "So are you, in a way suggesting that storytelling could be a way to actually teach people how to play the visualization instrument?",
      "id": "ep_35_ut_75"
    },
    {
      "end": 2009930,
      "speaker": "Moritz Stefaner",
      "start": 2009074,
      "text": "Sure. For instance?",
      "id": "ep_35_ut_76"
    },
    {
      "end": 2151722,
      "speaker": "Alberto Cairo",
      "start": 2009970,
      "text": "Absolutely. I think it's actually really important because a lot of people aren't familiar with visualization at all, and they have a lot of trouble understanding things. And that's also why, and really reading a visualization, especially one that's a bit more complicated. Like, I know, years ago, five years ago or so, Matt Erickson gave a talk at the Viz conference, and he did the keynote of the capstone, and he said, I'm not sure if he said it in the talk or when we talked afterwards, but he said that the New York Times would never print a scatterplot, and they've done scatter plots in the meantime. And those have had explanations, they've had annotations, they've had lines in them to show you where the main diagonal was and so on. So you could read it even if you didn't understand or if you didn't know how to read a scatterplot. So telling people, giving them hints, even if they're very, and actually, especially when they're very subtle and when they're kind of leading you through what this tells you why the points are a certain point and what that actually means, that can be really extremely, I mean, this is almost crucial if you're talking to a broad audience, and that's where the story comes in, because you're looking at a whole bunch of points or a whole bunch of lines. Charleston Coram had this fantastic visualization of, or this fantastic piece, this infographic, I guess, whatever you want to call it, in the New York Times a few years ago about prisoners in Guantanamo that won the best of show at Malofiej two years ago that had lines for each prisoner in there, and reading that actually took a while. There was actually a lot of data, and it wasn't very clear what the payoff was, but there were annotations that guided you through. And so now there suddenly was a reason for you to care and to look through it and really get a sense of just how many people there were there and how long they'd been there and so on. So you started to understand the data. Just showing the lines by themselves wasn't pretty boring. But having that annotation, having a visual guide through that just made that really effective. So it's obviously not just about the data. Data is important. Obviously, without data, there's just nothing. But you have to guide people into it. Both into what the data is and how it's shown, and give them a way to understand what you're trying to tell them, why they should care about it. So there's more than just few data.",
      "id": "ep_35_ut_77"
    },
    {
      "end": 2152338,
      "speaker": "Robert Kosara",
      "start": 2151786,
      "text": "Just to summarize.",
      "id": "ep_35_ut_78"
    },
    {
      "end": 2153074,
      "speaker": "Alberto Cairo",
      "start": 2152354,
      "text": "You have to figure it out.",
      "id": "ep_35_ut_79"
    },
    {
      "end": 2164498,
      "speaker": "Robert Kosara",
      "start": 2153082,
      "text": "Just to summarize a little bit. Just to be clear, we are talking about several different things here. All of them. All these techniques are related or are intended to help readers. Sorry, Moritz.",
      "id": "ep_35_ut_80"
    },
    {
      "end": 2165986,
      "speaker": "Moritz Stefaner",
      "start": 2164634,
      "text": "Participants, please.",
      "id": "ep_35_ut_81"
    },
    {
      "end": 2166642,
      "speaker": "Enrico Bertini",
      "start": 2166058,
      "text": "Participants.",
      "id": "ep_35_ut_82"
    },
    {
      "end": 2167550,
      "speaker": "Robert Kosara",
      "start": 2166706,
      "text": "Participants.",
      "id": "ep_35_ut_83"
    },
    {
      "end": 2170402,
      "speaker": "Moritz Stefaner",
      "start": 2168010,
      "text": "People. Yeah, exactly. Friends and colleagues.",
      "id": "ep_35_ut_84"
    },
    {
      "end": 2202278,
      "speaker": "Robert Kosara",
      "start": 2170426,
      "text": "For me, viewing a visualization is reading the visualization. So anyway, people helping people understand the data better, you can do that, you know, by many different means. And if we talk about the techniques that we are discussing here, one of them is annotating things to highlight the things that are important. When you connect those annotations. Annotations in a logical sequence, you may be creating a narration, and when you somehow instill some emotion in it, you will have, you may have a story. I mean, there will be some disagreements in here, but I think that we should make a difference here, or be.",
      "id": "ep_35_ut_85"
    },
    {
      "end": 2225674,
      "speaker": "Moritz Stefaner",
      "start": 2202294,
      "text": "Clear, two different things, like the emotional part and the sequence part, I think, or the annotation part. I absolutely agree. I think there's also a third dimension we haven't discussed yet. Maybe you wanted to come to that, but stories often also seen as information of relevance. Like a journalist, a journalist might ask, is there a story there? Asking for? Is that something people want to know?",
      "id": "ep_35_ut_86"
    },
    {
      "end": 2234060,
      "speaker": "Robert Kosara",
      "start": 2225762,
      "text": "You know, a test that we can apply to any visualization I believe is the so what test?",
      "id": "ep_35_ut_87"
    },
    {
      "end": 2238100,
      "speaker": "Moritz Stefaner",
      "start": 2234520,
      "text": "I hate this question. Oh, man, I hate this question.",
      "id": "ep_35_ut_88"
    },
    {
      "end": 2258722,
      "speaker": "Robert Kosara",
      "start": 2238880,
      "text": "I know that you were going to hate it, but, you know, I myself, as a visualization designer, so someone who knows how to read complex charts, navigate complex interfaces, you know, read a lot of data, I see some visualizations come out that make me ask myself, oh, don't tell.",
      "id": "ep_35_ut_89"
    },
    {
      "end": 2261794,
      "speaker": "Enrico Bertini",
      "start": 2258786,
      "text": "I just wrote a little piece about that, a little random.",
      "id": "ep_35_ut_90"
    },
    {
      "end": 2262810,
      "speaker": "Moritz Stefaner",
      "start": 2261802,
      "text": "I'm very frustrated.",
      "id": "ep_35_ut_91"
    },
    {
      "end": 2263306,
      "speaker": "Enrico Bertini",
      "start": 2262850,
      "text": "Yeah, yeah.",
      "id": "ep_35_ut_92"
    },
    {
      "end": 2264970,
      "speaker": "Robert Kosara",
      "start": 2263338,
      "text": "It was a very good rant, actually.",
      "id": "ep_35_ut_93"
    },
    {
      "end": 2267594,
      "speaker": "Enrico Bertini",
      "start": 2265090,
      "text": "Yeah, yeah. I actually feel a bit guilty.",
      "id": "ep_35_ut_94"
    },
    {
      "end": 2270562,
      "speaker": "Moritz Stefaner",
      "start": 2267682,
      "text": "But, Enrico, which visualization was it? Will you tell me?",
      "id": "ep_35_ut_95"
    },
    {
      "end": 2271550,
      "speaker": "Enrico Bertini",
      "start": 2270586,
      "text": "I cannot know.",
      "id": "ep_35_ut_96"
    },
    {
      "end": 2273850,
      "speaker": "Moritz Stefaner",
      "start": 2272410,
      "text": "But was it one of mine?",
      "id": "ep_35_ut_97"
    },
    {
      "end": 2312484,
      "speaker": "Enrico Bertini",
      "start": 2273930,
      "text": "No, of course not. But I don't know. I was frustrated because it was. I mean, some people afterwards said, so I don't want to talk too much about that post. But anyway, some people afterward commented, oh, junk chart. This looks like the usual junk chart thing, but I think it's different because there are some quite clever visualization out there right now that looks really, really good in principle, but after you've been watching them. There's nothing really interesting to get out of it. And this worries me because sometimes these are very well crafted in terms of user interface, being clean and neat, using some nice data. It doesn't look like junk chart.",
      "id": "ep_35_ut_98"
    },
    {
      "end": 2316764,
      "speaker": "Moritz Stefaner",
      "start": 2312532,
      "text": "Okay, but can I ask you one thing? When you read the newspaper.",
      "id": "ep_35_ut_99"
    },
    {
      "end": 2317588,
      "speaker": "Enrico Bertini",
      "start": 2316932,
      "text": "Yeah?",
      "id": "ep_35_ut_100"
    },
    {
      "end": 2341690,
      "speaker": "Moritz Stefaner",
      "start": 2317724,
      "text": "How many of the articles really touch you? I could ask for 95% of newspaper articles. So what? But at the same time, I know for other people it will be different. So they are there for a reason. Some people are interested in the oil industry or insurances or whatever, but I'm nothing. You know, I still. I'm okay with them being there. I just don't read these articles.",
      "id": "ep_35_ut_101"
    },
    {
      "end": 2347982,
      "speaker": "Robert Kosara",
      "start": 2342030,
      "text": "But they still try to make clear why you should care. If you read international, if you read.",
      "id": "ep_35_ut_102"
    },
    {
      "end": 2350934,
      "speaker": "Moritz Stefaner",
      "start": 2348006,
      "text": "A newspaper, I mean, they just present the stuff and that's.",
      "id": "ep_35_ut_103"
    },
    {
      "end": 2413470,
      "speaker": "Robert Kosara",
      "start": 2350982,
      "text": "Well, but sometimes, I mean, or in many cases, they try at least to suggest the very fact that the articles are. There is just, you know, a suggestion that the journalist is thinking that you should care to. But sometimes that is explicit in the article. This is affecting people in other countries, or this may affect the economy. The very fact or the very action of writing the story in a particular way makes you put the explanation of why the story matters inside. I don't see that in visualization or in many visualizations. Or at least I believe that even if the designer has a particular purpose in mind, or even the designer knows why that matters, there is a misconnection there between what she's trying to say and what I get from the visualization. All those tones of lines and bubbles and beautiful objects, etcetera. They may not say or tell anything.",
      "id": "ep_35_ut_104"
    },
    {
      "end": 2449430,
      "speaker": "Enrico Bertini",
      "start": 2413630,
      "text": "To me as a greater, can I tell something else? I think my standpoint is more like, I feel pity for people who spend, of course, you have to have spent quite a lot of time gathering the data, writing the code, making it beautiful, create a webpage. And I'm sure that people behind that are clever people, right? So I feel bad for these people that they are spending so much time trying to do something beautiful. It's something that, from the aesthetic point of view, it looks beautiful, but it doesn't communicate anything. And I think it's a waste of time. I see Robert laughing.",
      "id": "ep_35_ut_105"
    },
    {
      "end": 2450450,
      "speaker": "Moritz Stefaner",
      "start": 2449470,
      "text": "I see one.",
      "id": "ep_35_ut_106"
    },
    {
      "end": 2452410,
      "speaker": "Enrico Bertini",
      "start": 2450790,
      "text": "Robert, you want to say something?",
      "id": "ep_35_ut_107"
    },
    {
      "end": 2563342,
      "speaker": "Alberto Cairo",
      "start": 2457150,
      "text": "No. So I have a couple of things to say about that. There's one part to this is that there are, of course, different audiences. And so, for example, I couldn't care about the whole, you know, sports section of most newspapers. So I'm not going to read any of that. But that doesn't mean that nobody cares about that kind of stuff. Then there's the question of if you're, if you have an audience that cares about the general topic, can you make something interesting for them? And that, of course, that's what journalists do. Hopefully, otherwise they're not going to be in business for very long. But then there's also, and this is kind of the third part to this is that sometimes there's data and somebody decides, let's do something with this data. And that very often turns into a total nightmare because you have, there's just, and especially when you look at, and this, what bugs me so much about many of these open data things like data dot gov and many others, there's, I don't know how many, 300,000 datasets there now or whatever it is, but most of it is just totally boring data nobody cares about. I mean, really nobody cares about unless you're, I don't know, your job is to run the, because the garbage collection is just outside here and making a lot of noise. I hope you're not hearing that in my microphone. But if you care about garbage collection in some part of Seattle, then that's what you want to do. And maybe at some point this is going to be interesting to somebody because maybe there's some issue and somebody digs up that data and it's actually interesting. But most of the time, in many cases, I've seen this, somebody then says, well, let's just go out, find some data and make something with it. And then they wonder why nobody cares about what they've created. So you can create something really cool and really beautiful out of data that isn't interesting, that doesn't have any interesting insights in it. And then I think that's where the. So what? Question comes in. So if you don't tell me, I.",
      "id": "ep_35_ut_108"
    },
    {
      "end": 2583922,
      "speaker": "Moritz Stefaner",
      "start": 2563366,
      "text": "Think that can be a value per se. Like if you established that a data set is boring, a, it's not surprising. Most data sets are boring. And second, at least you have established that facts, yeah, people might get a sense of the general distribution of values or, you know, or at least we have learned. Yeah, it's pretty much as expected.",
      "id": "ep_35_ut_109"
    },
    {
      "end": 2593114,
      "speaker": "Alberto Cairo",
      "start": 2584066,
      "text": "You know, I don't care to hear about 10,000 data sets that you found that aren't interesting. Right. So I want to read about in.",
      "id": "ep_35_ut_110"
    },
    {
      "end": 2597590,
      "speaker": "Robert Kosara",
      "start": 2593122,
      "text": "The morning, I want to learn before why you think.",
      "id": "ep_35_ut_111"
    },
    {
      "end": 2639760,
      "speaker": "Moritz Stefaner",
      "start": 2598180,
      "text": "Yeah. Now in general, of course I agree, but just to play advocatos the other. Maybe. Maybe. It's also sometimes worthwhile to teach people that not every data set is super exciting. So this is something when I teach, people have often too high expectations. Like, you know, they will visualize this excel sheet and there will be like a sensation in every single chart. And I'm like, a sensation is maybe one out of 100 charts. You know, you need to do a few more of these before you get like a real. A smoking gun. Yeah, exactly. And people have lost that sense because everything they're presented with on the web or somewhere is always like, you won't believe. One weird trick to make a list out of ten things. Yeah.",
      "id": "ep_35_ut_112"
    },
    {
      "end": 2769510,
      "speaker": "Robert Kosara",
      "start": 2640740,
      "text": "When you analyze data, when you visualize data, if you want to call yourself a visualization designer, not a visualization artist, if you want to be an artist and visualize data and create something incredibly beautiful and amazing with data, that's great. And I will enjoy your visualization just because I know that your goal is not to communicate clearly, is to somehow make some emotions arise by displaying those data in an interesting way. But if you're going to do visualization, you have to think about that. So what question, what you're trying to show, why the thing matters, what the story, let's use that word again, matters and convey that clearly at first. Hey, here's why you should care about this and present that and show that. And this is not something, by the way. This is a point that I wanted to make before. This is not something that relates or that is inherited or borrowed from the world of journalism or traditional graphic design. Statisticians do that as well. A book that I mentioned in a podcast on Friday is statistics, as principal argument from Robert Abelson. Abelson was a statistician at the University of Yale. And in the introduction to that book, he basically says, when I'm explaining statistics to my students or analysis to my students, one of the first things that I tell them is don't just open the data set and start playing around with it. Think about if you were going to report your research in the newspaper, what would the headline be? That is the so what question. So it's not just designers or journalists, even statisticians. And it doesn't need to be just a single headline. It could be several headlines, several different insights that you can extract from the data. You have to ask yourself what those are and then present those clearly to people, to your audiences, particularly if you're creating your visualization too, for general audiences, not for specialized audiences. Yeah, yeah.",
      "id": "ep_35_ut_113"
    },
    {
      "end": 2817570,
      "speaker": "Moritz Stefaner",
      "start": 2770610,
      "text": "I think there is talk about statistics. There's a whole branch of statistics that's called descriptive statistics. And it's just about characterizing how the texture, let's say, of different data sets is. It's not about proving something scientifically or like determining probabilities. You know how probably it is that a certain hypothesis is just about characterizing the nature of a certain data set. And many of the insights you gather there are not very suited for headlines. You know, they're hard to verbalize. They don't often surprise you. I mean, a headline is usually should be new, relevant information that is also a bit surprising. And so anything that already confirms existing knowledge is not headline worthy. But it can be good to know it.",
      "id": "ep_35_ut_114"
    },
    {
      "end": 2854750,
      "speaker": "Robert Kosara",
      "start": 2818320,
      "text": "It could be headline worthy. We have discovered the evidence of this preconceived idea that everybody thinks about. Here is the data that confirms that. That is a headline, it could be a headline. And at the same time we have to remember that we may be talking about different kinds of visualizations here. It is not the same to create a visualization to communicate than to create a visualization to explore the dataset yourself. It's not the same thing. What I'm saying is that if you want to communicate with general audiences, that is something that I advise to do to think about this. So what factor? Why should people care?",
      "id": "ep_35_ut_115"
    },
    {
      "end": 2856858,
      "speaker": "Alberto Cairo",
      "start": 2855570,
      "text": "But I think that's what you're talking about.",
      "id": "ep_35_ut_116"
    },
    {
      "end": 2883028,
      "speaker": "Moritz Stefaner",
      "start": 2856874,
      "text": "Of course I agree to some degree. But I think if we over stress this point, the relevant, or to justify your work always in one sentence, just focus on the elevator pitch. I think then we're, we're losing a whole, or we are narrowing our spectrum of what we allow ourselves to do in a way that is very. I think it's a pity, because another one of my favorites, you don't need.",
      "id": "ep_35_ut_117"
    },
    {
      "end": 2887764,
      "speaker": "Robert Kosara",
      "start": 2883044,
      "text": "To have just one dimension before.",
      "id": "ep_35_ut_118"
    },
    {
      "end": 2925110,
      "speaker": "Moritz Stefaner",
      "start": 2887892,
      "text": "Look at Aaron Koblin's flight patterns, for instance. It's something that works straight away, I think, on a very visceral level. I think it touches you personally to just see thousands of planes, abstractions of these planes in motion. And I do think you get a hard to verbalize, but a very visceral sense of what flight traffic is and how it feels like, how the flight traffic of a day over the United States feels like. And this is not headline worthy. It's an experience of information that is hard to put in words. But I think it's valuable.",
      "id": "ep_35_ut_119"
    },
    {
      "end": 2971050,
      "speaker": "Robert Kosara",
      "start": 2925270,
      "text": "Oh, of course it is valuable. But think about that's a very beautiful example as it is right now. It is a very good visualization. But again, would it hurt to show me the exceptions, the surprising facts there. The things that I was expecting but are not true, or the things that I was expecting are true and unconfirmed by the data. You can only do that through annotation or by highlighting important things. So you can have both. You can have the emotional experience that Aaron created, which is wonderful, and then you can have the more, you know, let's say the editorial voice in there that points out a commentator.",
      "id": "ep_35_ut_120"
    },
    {
      "end": 2988210,
      "speaker": "Moritz Stefaner",
      "start": 2972830,
      "text": "But then you have the, you have the soccer game and the commentator. And for me, it, you know, it's a different, and it could even be different persons creating that. And I'm not sure if we should oblige the soccer players to comment their own game all the time. You know what I mean?",
      "id": "ep_35_ut_121"
    },
    {
      "end": 2990926,
      "speaker": "Robert Kosara",
      "start": 2988750,
      "text": "You mean that they are not articulate enough.",
      "id": "ep_35_ut_122"
    },
    {
      "end": 2998290,
      "speaker": "Moritz Stefaner",
      "start": 2991118,
      "text": "Yeah, they're busy playing. Anyways, Robert, what's your idea?",
      "id": "ep_35_ut_123"
    },
    {
      "end": 3092738,
      "speaker": "Alberto Cairo",
      "start": 2999350,
      "text": "I'm thinking a few different things here. One is there is certainly something here about the experience and kind of the magnitude of something, especially when you're talking about the flight patterns one. So I'm not arguing that you need a story for everything. And there are things, especially the flight patterns and maybe also like the wind map, that are, I don't want to say obvious, but they're so kind of self explanatory. And you know enough about them. You can understand them if you spend a second thinking about what you're seeing and how this is shown to you. So they're almost obvious. And then you can kind of experience just the amount of stuff that's happening or the interestingness of the wind patterns and the structures you can see there. And maybe even use your existing knowledge about geography to figure out, okay, why is there a ridge line here and there and so on? And then maybe with the flight patterns you can see things like why are there flights starting on the east coast of the US, going west earlier than the other way around and so on. So you can use a lot of existing knowledge to figure that out. And it's actually kind of fun to explore that. Plus, there's this whole thing about just look how much stuff there is. So there is this actually a posting I'm going to be writing pretty soon. There's this video about flights in Europe, and you can see all these planes going around Europe. It's just about the amount of stuff that's going on, the number of flights, the number of planes that are in the air at any one time.",
      "id": "ep_35_ut_124"
    },
    {
      "end": 3096642,
      "speaker": "Moritz Stefaner",
      "start": 3092794,
      "text": "It's a common briefing for data visualization. Jobs just show how much stuff.",
      "id": "ep_35_ut_125"
    },
    {
      "end": 3230774,
      "speaker": "Alberto Cairo",
      "start": 3096706,
      "text": "Right? Exactly. But that's a different way of doing things. So this is not about any kind of specific thing because all the specific things are actually really hard to see. In particular, this is part of my argument there is that when you look at, for example, I forget what they're called, but this is some company in the UK that did that, made that, and you have this kind of slightly moving 3d map where you see the planes coming into London and they all line up and then land in Heathrow and Gatwick and that's fine, but you don't actually see that because they're all taking the same path. So you're losing a lot of information there about how many are landing in the same spot. You can see them when they're spread out and they're going into different places, but when they're actually landing, they all merge into one thing, essentially. So there's a lot of, if you're looking for actual information about how many planes there are taking off and landing at Heathrow or what, you also see if you know it and you can kind of see that pattern. Is this the way they kind of slot the planes that go to the US into these lanes and how they're kind of layered and how they're spaced out? It's pretty interesting to see. But once you've seen that, that famous infographic and forget who did that, this is from like a decade ago or so, that describes how that works. Then you know what to look for and then you can kind of see that pattern and you're going to recognize that. So there's a lot of information here that's not actually given to you, but if you have that, if you know what that is, you can read that. And other than that, it's mostly just look at how much stuff there is, is it's like stacking up cups and saying, well, look at how much this would fill up Manhattan most cups ever. Right? So you get that sense, but it's not that much. So the data, there's a lot of detail here that mostly just shows you magnitude overall, but it doesn't actually give you detailed information. So it's about, it's really more about experience of kind of being thrown into all this data and saying, wow, there's so much stuff here, as opposed to here are 15 facts that I can show you here because I have this data now, I could actually point things out to you that you wouldn't actually probably see unless you know about them.",
      "id": "ep_35_ut_126"
    },
    {
      "end": 3235630,
      "speaker": "Moritz Stefaner",
      "start": 3230902,
      "text": "And when he presents, like when Aaron Copland presents the flight patterns, he points out. Exactly.",
      "id": "ep_35_ut_127"
    },
    {
      "end": 3237110,
      "speaker": "Alberto Cairo",
      "start": 3235670,
      "text": "Exactly right. This is the performance point.",
      "id": "ep_35_ut_128"
    },
    {
      "end": 3250950,
      "speaker": "Moritz Stefaner",
      "start": 3237150,
      "text": "Now the west coast goes asleep. Watch out now all the planes from Europe coming in. And that makes it, again with his performance. You know, he performing it makes it the complete piece in a way, I sort of agree.",
      "id": "ep_35_ut_129"
    },
    {
      "end": 3253746,
      "speaker": "Robert Kosara",
      "start": 3251290,
      "text": "But still, you're moving toward our side.",
      "id": "ep_35_ut_130"
    },
    {
      "end": 3255378,
      "speaker": "Moritz Stefaner",
      "start": 3253818,
      "text": "Yeah, I have a hard time here.",
      "id": "ep_35_ut_131"
    },
    {
      "end": 3256818,
      "speaker": "Robert Kosara",
      "start": 3255434,
      "text": "Should be careful with that.",
      "id": "ep_35_ut_132"
    },
    {
      "end": 3288620,
      "speaker": "Moritz Stefaner",
      "start": 3256994,
      "text": "Can we talk about the fourth thing, because I think it's important. And you pointed out also, Robert, in your blog post is what actually happens in people's minds. And we also had a listener question from Aldo, and I think that's the most, let's say, powerful mechanism in storytelling, but also the most dangerous one is the fact that, but we have a rich imagination and we need just little cues and a little situation to be presented with, and we think it further or we extrapolate from the facts that are presented. That's one thing, but how does that work?",
      "id": "ep_35_ut_133"
    },
    {
      "end": 3363390,
      "speaker": "Alberto Cairo",
      "start": 3288660,
      "text": "The other thing is also that memory has this very strong narrative component, so you remember things much more clearly when you've been told a story rather than just individual facts. There's quite a bit of research on that, specific to visualization at this point, but I think that we're going to see more of that coming out also for visualization. But essentially what happens is that if you, and this is so, that also kind of plays into this whole causality thing. So if somebody tells you a story that even if it's a very simple story and it's got a couple of things happening, you know, somebody does this and that, if those are connected facts and there's a reason why the later actions happens because of the earlier action, then you're going to remember the story and you're going to be able to retell it much more clearly than if somebody just gives you facts that are disconnected. That's one thing. The other thing is when you throw in additional data. So if there was an experiment a while ago where they told people a story or they gave them a story and that had kind of a very barebone structure, and I just told them something, and then they added lots of irrelevant detail to it that had like, you know, little embellishments about what people were wearing, whatever, but it wasn't relevant.",
      "id": "ep_35_ut_134"
    },
    {
      "end": 3365006,
      "speaker": "Moritz Stefaner",
      "start": 3363430,
      "text": "To the actual adjectives, basically.",
      "id": "ep_35_ut_135"
    },
    {
      "end": 3412812,
      "speaker": "Alberto Cairo",
      "start": 3365078,
      "text": "Right, right. Just little chart chunk in a way. And then what happened is that people didn't remember those embellishments, but they did remember the story more clearly, so they had a better memory of the story. So it helps your memory to have more little hooks to kind of hook into your memory and to kind of tie things together, even if you don't remember the actual little pieces there. So there's a lot of to be said if you care about people remembering your message and your concern and your story, to tell them a story rather than just give them a few facts. So we like to think that if you explore something yourself, you can remember it and it's true to an experience, but when it's a lot of data and you explore different things, you're going to forget the things you explored earlier. And so if somebody.",
      "id": "ep_35_ut_136"
    },
    {
      "end": 3414540,
      "speaker": "Robert Kosara",
      "start": 3412836,
      "text": "You see the trees, but you don't see the fruit.",
      "id": "ep_35_ut_137"
    },
    {
      "end": 3479540,
      "speaker": "Alberto Cairo",
      "start": 3414580,
      "text": "Right? Exactly. So that can be. That's a big danger. And so having somebody piece together a story and making, turning it into a sequence and having that sequence be well structured, well designed, is actually very valuable. And that can help you a lot if you're, if you're trying to gain a better understanding and also kind of gently be introduced to something and then also to remember it later. So that's a big part of it. And there's some work on that because the question was about, I think, work on cognition in visualization with storytelling, and there hasn't, I don't think there's anything yet, except maybe for this paper by Jessica Hullman and the folks at Microsoft Research that's called the deeper understanding of sequence in narrative visualization. That has a bit of that. From what I remembered, the study was about, they had a study in there, but I'm not sure if that was actually measuring memory so much or it was mostly ratings that people gave. But there is a bit of work, and it's starting, but I think we're going to see a lot more of that going forward.",
      "id": "ep_35_ut_138"
    },
    {
      "end": 3534236,
      "speaker": "Moritz Stefaner",
      "start": 3480360,
      "text": "Memories is a really interesting topic. There's also other research suggesting that if you tell people a story, they will, of course, fill in the blanks with the plausible explanations and for the motivations of the characters or what is a good continuation of or. Yeah. How to fill in the steps you have told them, like the space between the comic panels, more or less. And one of the problems is with memory is we don't remember the, the facts we were presented with, but only the whole thing, and we cannot separate anymore. What have we extrapolated or guessed at that time to be a plausible continuation and what was presented exactly. And that's a huge problem in trials like, you know, when a jury has to decide. And it's a well known phenomenon that we, in the end, the memories we have are the stories we constructed at in real time, more or less, yeah.",
      "id": "ep_35_ut_139"
    },
    {
      "end": 3636100,
      "speaker": "Robert Kosara",
      "start": 3534428,
      "text": "But I mean, one of the things to remember also, and again, taking a step back, is that we create stories no matter what. So even as you are saying, and this relates to visualization, even if you present a visualization in which you just show, just show flight patterns all over the world with tons of different lines, people will create their own stories. They will start making connections. They will see a pattern here, another pattern there, and they will start unconsciously connecting those points in a narrative way or in a storytelling way. So I wonder if we should be aware of that as well. When design, when we design visualizations, creating visualizations for exploration may not be enough. Particularly when you, again, when you're creating something for a general audience, if you're creating it for a specialized audience, fine. The kind of insights or the kind of connection that they will make will probably be right, just because they go to the visualization with the right knowledge in order to extract meaning from that visualization. But if you're talking to a general audience, that in which you cannot assume that kind of previous knowledge, the potential for errors and mistakes on the part of the audience are huge. The potential is huge in there. They will start seeing patterns and connections and stuff. And I wonder if, you know, again, if storytelling, annotation, narrative and storytelling are not very useful tools to avoid those kinds of mistakes. Hey, you may be seeing a pattern here, but that pattern is not really there. Right? It looks really interesting, but it's not the right thing to look for. That's what I mean.",
      "id": "ep_35_ut_140"
    },
    {
      "end": 3639740,
      "speaker": "Enrico Bertini",
      "start": 3638520,
      "text": "We are speechless.",
      "id": "ep_35_ut_141"
    },
    {
      "end": 3642576,
      "speaker": "Robert Kosara",
      "start": 3640200,
      "text": "Yeah. Wow.",
      "id": "ep_35_ut_142"
    },
    {
      "end": 3685690,
      "speaker": "Moritz Stefaner",
      "start": 3642688,
      "text": "It's even more complicated than I thought. But one question, like, have we covered all the meanings, the potential meanings of stories? So we had the emotional aspect, like anecdotes, or like human stories we can relate to. We had the sequencing, we had presentation, performance, some commentator, somebody guiding you through things. We had the relevance, we had the so what factor, which I only halfway subscribed to. Is there another relevant meaning of the term, or have we covered all bases?",
      "id": "ep_35_ut_143"
    },
    {
      "end": 3703170,
      "speaker": "Robert Kosara",
      "start": 3686230,
      "text": "I cannot think of anything else, but perhaps people writing comments underneath the podcast will come up with other possible meaning. And obviously, this is a very open ended discussion. We are at very early stages of the conversation.",
      "id": "ep_35_ut_144"
    },
    {
      "end": 3719066,
      "speaker": "Moritz Stefaner",
      "start": 3704310,
      "text": "Which meaning of the word would you recommend that we actually use as the right one? Or are they all like, okay, or all good? What's your take on how I think we should debate a bit like how we use the word, because we should come up with like a. I mean.",
      "id": "ep_35_ut_145"
    },
    {
      "end": 3775570,
      "speaker": "Robert Kosara",
      "start": 3719098,
      "text": "I can explain how, I will try to use the word storytelling in my own future writing. I'm not saying that it's a right definition, but as I said before, I see a difference, you know, not very clear, blurry boundaries, whatever you want, but with. Between annotation, narrative, and storytelling. So annotation is just highlighting important things. Narrative is when you create a connection, a sequential connection, perhaps, between those points and story is when you instill or when you introduce the drama in there, the conflict, the characters. You try to, let's say, artificially quotation marks in there, artificially introduce the drama into the narration. You just don't let the narration talk by itself, but you force that, let's say, downrides throats, Riddler's throat or something like that.",
      "id": "ep_35_ut_146"
    },
    {
      "end": 3784886,
      "speaker": "Moritz Stefaner",
      "start": 3776350,
      "text": "But then you couldn't make a story, let's say, about a very abstract topic, let's say, maybe, let's say, stock market. Oh, yes, you can.",
      "id": "ep_35_ut_147"
    },
    {
      "end": 3785662,
      "speaker": "Robert Kosara",
      "start": 3784918,
      "text": "Of course you can.",
      "id": "ep_35_ut_148"
    },
    {
      "end": 3788022,
      "speaker": "Moritz Stefaner",
      "start": 3785766,
      "text": "Unless you brought in like human fates.",
      "id": "ep_35_ut_149"
    },
    {
      "end": 3809160,
      "speaker": "Robert Kosara",
      "start": 3788126,
      "text": "Not necessarily. You can create very dramatic stories talking about technology. Otherwise science would not be possible as a literary genre, particularly a hard science fiction, which tries to create emotions based on description of alien technologies and, you know, discoveries and stuff. But the human factor is not absolutely necessary.",
      "id": "ep_35_ut_150"
    },
    {
      "end": 3837910,
      "speaker": "Alberto Cairo",
      "start": 3809240,
      "text": "Well, if you read, if you read all the tech stuff that I read, you know, there's all this drama about Google versus Apple and Apple versus Samsung and Microsoft and Google. And, you know, these are characters all have. Right? These are all characters and they're in a battle, and there's, you know, there's stuff going on there all the time. So there is absolutely. You can always tell a story. You can always make it interesting, I think no matter what your data is about. So I don't think that that's a problem.",
      "id": "ep_35_ut_151"
    },
    {
      "end": 3865756,
      "speaker": "Moritz Stefaner",
      "start": 3838530,
      "text": "By adding human motivations or humanity. Like, if you say, like, apple and Motorola are in a fight, you know, it's like, how do you say there's like a scientific word for that? But you impose human nature on something non human, like, anthropomorphizing, you know, morphologizing. Yeah, and I think that's totally valid. It's just we need to be aware that this sort of artificial, you know.",
      "id": "ep_35_ut_152"
    },
    {
      "end": 3914630,
      "speaker": "Robert Kosara",
      "start": 3865788,
      "text": "It's like explaining that is something that we do nothing and unconsciously. And as you know, there's a lot of research with babies in which babies are presented with three random abstract shapes, a circle, a triangle, and a cube or a triangle or whatever, and they see the triangle approach the square and pushing quotation marks in there, the square to the side, and they impose, or they infer a purpose to the abstract shape. Oh, the triangle is trying to push the square because he doesn't like the square for some reason. So we anthropomorph our size or whatever. We should look that up in Google.",
      "id": "ep_35_ut_153"
    },
    {
      "end": 3929422,
      "speaker": "Moritz Stefaner",
      "start": 3916650,
      "text": "Yeah, but it can be like. It can be a misleading rule, of course. So let's say you can explain thunder by gods being angry, or you have some knowledge of electromagnetism and acoustics.",
      "id": "ep_35_ut_154"
    },
    {
      "end": 3954220,
      "speaker": "Robert Kosara",
      "start": 3929526,
      "text": "Well, that is paternicity and unconscious storytelling. As I said before, it's something that we do that everybody does naturally. There is a lot of potential for mistakes and errors in there. One way to avoid them is, or several ways to avoid them are annotation narratives, in some cases, and stories. So you tell the story beforehand just to avoid the mistaken stories that readers can come up with.",
      "id": "ep_35_ut_155"
    },
    {
      "end": 3958660,
      "speaker": "Moritz Stefaner",
      "start": 3954600,
      "text": "Oh, man, there's no way. I've been this argument.",
      "id": "ep_35_ut_156"
    },
    {
      "end": 3960820,
      "speaker": "Robert Kosara",
      "start": 3959560,
      "text": "Sorry about that.",
      "id": "ep_35_ut_157"
    },
    {
      "end": 3974432,
      "speaker": "Moritz Stefaner",
      "start": 3962120,
      "text": "Robert, what's your take on the annotation narration story spectrum? Is that a categorization you could adopt or is that aligns with your thoughts?",
      "id": "ep_35_ut_158"
    },
    {
      "end": 4014380,
      "speaker": "Alberto Cairo",
      "start": 3974456,
      "text": "Yeah, no, that makes a lot of sense to me. So my thinking is mostly along, I guess, what Alberto calls the narrative part. So that certainly ends. And the annotations, so the drama and what then really becomes a story is not so much what I've been looking at so far, but that's something interesting, and that's a good distinction, I think. It's not one that people are going to actually use because everybody uses that term storytelling and they don't care that much. But it's a clear thing, I think you're having. But having clear distinctions and having clear definitions and terms that really are a bit more. More well defined, it's obviously a good idea. And so that makes a lot of sense to me. I totally agree with that.",
      "id": "ep_35_ut_159"
    },
    {
      "end": 4036300,
      "speaker": "Moritz Stefaner",
      "start": 4016360,
      "text": "I think we can shape how we use the language. I mean, at least for us. I think a lot of progress in science is actually like just talking about how you use a certain word, and this is one of the most important words probably we have in our field right now. I'm glad we made a little progress there.",
      "id": "ep_35_ut_160"
    },
    {
      "end": 4037740,
      "speaker": "Robert Kosara",
      "start": 4036600,
      "text": "I hope so.",
      "id": "ep_35_ut_161"
    },
    {
      "end": 4042180,
      "speaker": "Moritz Stefaner",
      "start": 4038880,
      "text": "Enrico, what's your take? You have been quiet. You have been watching.",
      "id": "ep_35_ut_162"
    },
    {
      "end": 4068116,
      "speaker": "Enrico Bertini",
      "start": 4042800,
      "text": "I've been enjoying the battle unfolding. No, I really like the sequence. I agree with Alberto. The idea of taking into account these three levels of annotations, narrative and the old story. I don't know if, Alberto, you are necessarily implying that the third level might be somewhat bad. I don't know the way you, I mean, instilling the drama is not necessarily bad, right?",
      "id": "ep_35_ut_163"
    },
    {
      "end": 4157090,
      "speaker": "Robert Kosara",
      "start": 4068228,
      "text": "Not necessarily. If you remember, if you remember one of the examples I include in my first book, which is one about population in Brazil versus fertility rates, that is so it's a graphic that tells you, well, the population in Brazil grew. We can link to that. We can link to that graphic, but it says, well, the population in Brazil grew between this year and that year. So that is the opening. Then you have the conflict, but fertility rates are below expected, and then these are the consequences of fertility rate being so low, which is that the population will grow older and it will start shrinking. These are the consequences. And here's how to face that situation. Invest more on education now. Educate the workforce. That's a story, and it has drama in it. It has an opening, it has the conflict, it has the consequences and the closure or the engine of the story. That's a story. So I'm not saying that it's necessarily wrong. It's only that you have to be careful with it and only use it when it is appropriate. And when structuring the story in a dramatic way makes sense and respects, respects people's intelligence, that is the first thing. Don't try to unnaturally, you know, make emotions arise in ruthless, just for the sake of making them appear in there. I mean, just use this story, you know, with a purpose and when it is appropriate. Otherwise, stick to narrative or to annotation. So annotation, narrative, story.",
      "id": "ep_35_ut_164"
    },
    {
      "end": 4158142,
      "speaker": "Enrico Bertini",
      "start": 4157550,
      "text": "Yeah.",
      "id": "ep_35_ut_165"
    },
    {
      "end": 4219498,
      "speaker": "Moritz Stefaner",
      "start": 4158246,
      "text": "And, you know, another reason for, like, not to do that too extensively in data visualization is just a very pragmatic one, because I think if you're in that very emotional like realm and you have a very clear cut message to convey, I think there might be even other media that might be more effective, like actually film or illustration or photography or, you know, something with an actual human voice, you know? So if. Yeah, if you have already identified your communication goal is highly emotional and very personal, maybe a data visualization isn't your premier choice of medium at all. And I think, like, let's say the, the home turf for visualization is, in my view, in any ways, in the more exploratory and the data heavy parts. And this is where it's really strong and where no other medium can compete. So just from a, let's say, media competition perspective, I think there's an argument to be made not to go all crazy with emotive data visualization.",
      "id": "ep_35_ut_166"
    },
    {
      "end": 4242430,
      "speaker": "Enrico Bertini",
      "start": 4219554,
      "text": "But, you know, Moritz, I personally believe that it's going to take some time before people will be at large exposed to this more exploratory kind of visualizations. I think that for people like us, it comes so natural to think about visualization as an exploratory tool because we've been doing that for ages. I mean, well, not ages, but at least for ten years. Ten years is quite, it's quite a lot, right.",
      "id": "ep_35_ut_167"
    },
    {
      "end": 4244610,
      "speaker": "Moritz Stefaner",
      "start": 4242590,
      "text": "And still I don't get meditative.",
      "id": "ep_35_ut_168"
    },
    {
      "end": 4247774,
      "speaker": "Robert Kosara",
      "start": 4247270,
      "text": "But.",
      "id": "ep_35_ut_169"
    },
    {
      "end": 4351316,
      "speaker": "Enrico Bertini",
      "start": 4247862,
      "text": "At the same time, we have, we have such a strong push for. So there is a large segment of the population right now has been exposed to a lot of visualization from the communication point of. Right. So for most people out there, those who have been exposed to visualization, visualization for them is a communication means. Right. And they're, and I guess that there is a large part of them are still learning the language itself. Right. As Robert said, even a simple scatterplot can be somewhat problematic for some people. So I think in a way. So I used to be much more concerned in the past about this dichotomy, dichotomy between exploratory tools and visualization, mostly described as a communication tool. But I also realized that that's gonna come with time. I mean, it's, it's just a whole process. And I think we have to be much, much more patient. Right. Because I remember, for instance, when we had, do you remember when we had Ben Shneiderman on the show, one thing that he said really struck me. Right. Because he was kind of like, look, guys, we have to wait the next 50 years or 100 years or that's the kind of perspective that we have to use. And in a way, I kind of agree with him. It's going to take some time. So. Yeah, but especially this exploratory angle. So I am all for it. I think that visualization is a very, very powerful tool when we give it in the hands of people to explore their own data for their own purposes. But that's going to take a very long time. And in between, the only thing that we can do is to, in a way, educate people to use these tools in a way that is useful for them and at the same time develop tools that they are able to use. Right. That's gonna take a long, long time, I guess.",
      "id": "ep_35_ut_170"
    },
    {
      "end": 4354556,
      "speaker": "Moritz Stefaner",
      "start": 4351348,
      "text": "Sure. And it has long been neglected, no doubt.",
      "id": "ep_35_ut_171"
    },
    {
      "end": 4415782,
      "speaker": "Robert Kosara",
      "start": 4354668,
      "text": "Perhaps not that long. I think if you see the progress that has been made in my own realm in journalism ten years ago, it was almost impossible or it was very unusual to see a scatterplot in the newspaper. It was very, very unusual. I mean, people just, designers stick to bar graphs, line charts, and that was it today you see scatter plots, you see slope graphs, you see dot plots. And in many cases those are completely interactive and exploratory. And depending on what the topic is, if the topic is relevant to the audience, the audience is willing to explore the data. Just think about the many visualizations about election results published by the main us newspapers recently. Many of them are extremely complicated and have different layers of depths. And you can go deeper, go to the county level, etcetera, and readers or audiences explore them just because the topic matters.",
      "id": "ep_35_ut_172"
    },
    {
      "end": 4416990,
      "speaker": "Moritz Stefaner",
      "start": 4415846,
      "text": "They care about the topic.",
      "id": "ep_35_ut_173"
    },
    {
      "end": 4424610,
      "speaker": "Robert Kosara",
      "start": 4417030,
      "text": "They care about the topic. So what, this is something that affects me or may affect me. That is the so what factor.",
      "id": "ep_35_ut_174"
    },
    {
      "end": 4450720,
      "speaker": "Enrico Bertini",
      "start": 4425110,
      "text": "No, but look, I think that another interesting aspect of this is people exploring their own data for their own purposes. When you have some kind of attachment to this data, the SWAT comes natural, right? Because whatever you see there, it's very much connected to your own, maybe even to your personal life. Right? So there are some data sets out there that talk about yourself. And these are the most powerful ones, right?",
      "id": "ep_35_ut_175"
    },
    {
      "end": 4452608,
      "speaker": "Robert Kosara",
      "start": 4451140,
      "text": "The quantified self.",
      "id": "ep_35_ut_176"
    },
    {
      "end": 4459064,
      "speaker": "Enrico Bertini",
      "start": 4452724,
      "text": "Yeah. If you think about the old quantified self movement, that's huge, right? And there is bar chart is suddenly.",
      "id": "ep_35_ut_177"
    },
    {
      "end": 4460816,
      "speaker": "Moritz Stefaner",
      "start": 4459112,
      "text": "Super exciting because it's you.",
      "id": "ep_35_ut_178"
    },
    {
      "end": 4466648,
      "speaker": "Enrico Bertini",
      "start": 4460928,
      "text": "Yeah, it's you. Right? And then this what comes. Very natural trick. Yeah.",
      "id": "ep_35_ut_179"
    },
    {
      "end": 4492908,
      "speaker": "Moritz Stefaner",
      "start": 4466664,
      "text": "And one thing, I mean, it has long been neglected to actually communicate your own visualization. So you can do a very exploratory visualization if, as Alberto says, also communicate what it's about, why it's interesting and how to get started. And, you know, and maybe this is also like a very obvious takeaway that no matter how, how complex or exploratory your visualization is, you will at least need some user guidance anyways.",
      "id": "ep_35_ut_180"
    },
    {
      "end": 4496640,
      "speaker": "Robert Kosara",
      "start": 4492964,
      "text": "You know, you're moving to the dark side, Moritz.",
      "id": "ep_35_ut_181"
    },
    {
      "end": 4514620,
      "speaker": "Moritz Stefaner",
      "start": 4497100,
      "text": "No, no, no. I'm totally fine with that. I just want to keep these levels sort of apart, you know, and not so. I think if flight patterns were made today, it would probably come with, with a little guided tour and a few annotations.",
      "id": "ep_35_ut_182"
    },
    {
      "end": 4604560,
      "speaker": "Alberto Cairo",
      "start": 4517680,
      "text": "If this had been made by a journalist for a newspaper news medium, there would have been some sort of introduction to show you. Look, here are a few interesting things to look at and also something else here to turn this around and say, just because there is a lot of value in having narrative and having a story doesn't mean that we want to do away with exploration. So I think that this is also something that may also be kind of get a bit over dramaticized here, is that it's not about one or the other, but both really work together really well. And I think that's what I was trying to also say in my postings, is that it's not about, oh, exploration is over. We don't need it anymore because we have stories. That's not the point. The point is that exploration is great, but to get people in there and to have them understand what this is about, to understand why they should care. So even the. So what can be answered in part by a story and to introduce them to the data and to the visualization and to the interaction and all the different pieces they need to successfully explore and kind of the overall background of the whole thing. That's where the narrative can be extremely helpful, and a story, and I guess a bit of a drama as well, can be very helpful. And that's where this comes in. It's not about one thing being better or, you know, a different thing than the other. It's just about those pieces all fitting together and making sense together.",
      "id": "ep_35_ut_183"
    },
    {
      "end": 4622100,
      "speaker": "Robert Kosara",
      "start": 4606540,
      "text": "I wonder what Santiago Ortiz thinks about this conversation. He listens to this podcast and writes something in the comments or records his, you know, his take on these, because I believe that he will have a completely different view.",
      "id": "ep_35_ut_184"
    },
    {
      "end": 4624340,
      "speaker": "Enrico Bertini",
      "start": 4622520,
      "text": "Never provoke Santiago.",
      "id": "ep_35_ut_185"
    },
    {
      "end": 4631504,
      "speaker": "Robert Kosara",
      "start": 4625480,
      "text": "I did that in tapestry, in the tapestry conference. I remember that he was very.",
      "id": "ep_35_ut_186"
    },
    {
      "end": 4645450,
      "speaker": "Moritz Stefaner",
      "start": 4631632,
      "text": "We should have him back on, I think. I do agree. I think he has a more liberal reading of the word story, and one that is probably closer to my world notion than a traditional story notion. And there's something to it as well, for sure.",
      "id": "ep_35_ut_187"
    },
    {
      "end": 4650118,
      "speaker": "Enrico Bertini",
      "start": 4649310,
      "text": "Yeah.",
      "id": "ep_35_ut_188"
    },
    {
      "end": 4654390,
      "speaker": "Moritz Stefaner",
      "start": 4650294,
      "text": "Cool. I think we need to wrap it up here, otherwise people's ears will fall.",
      "id": "ep_35_ut_189"
    },
    {
      "end": 4655758,
      "speaker": "Robert Kosara",
      "start": 4654430,
      "text": "Off more than an hour.",
      "id": "ep_35_ut_190"
    },
    {
      "end": 4657250,
      "speaker": "Enrico Bertini",
      "start": 4655854,
      "text": "They're bleeding.",
      "id": "ep_35_ut_191"
    },
    {
      "end": 4660366,
      "speaker": "Moritz Stefaner",
      "start": 4658150,
      "text": "Yeah. But this was amazing. Thank you, guys.",
      "id": "ep_35_ut_192"
    },
    {
      "end": 4660814,
      "speaker": "Enrico Bertini",
      "start": 4660438,
      "text": "Amazing.",
      "id": "ep_35_ut_193"
    },
    {
      "end": 4666250,
      "speaker": "Moritz Stefaner",
      "start": 4660862,
      "text": "Very insightful. For me, it's now much better. I mean, I feel much better. That's something.",
      "id": "ep_35_ut_194"
    },
    {
      "end": 4670430,
      "speaker": "Enrico Bertini",
      "start": 4668150,
      "text": "Yeah, we found something.",
      "id": "ep_35_ut_195"
    },
    {
      "end": 4678540,
      "speaker": "Moritz Stefaner",
      "start": 4670470,
      "text": "Send us your comments, mail at data stories, leave some comments on the blog. Tweet us on Twitter, Facebook, us on Facebook.",
      "id": "ep_35_ut_196"
    },
    {
      "end": 4682480,
      "speaker": "Enrico Bertini",
      "start": 4679720,
      "text": "Send comments, emails, whatever channel is good.",
      "id": "ep_35_ut_197"
    },
    {
      "end": 4683696,
      "speaker": "Moritz Stefaner",
      "start": 4682520,
      "text": "Plus us on Google.",
      "id": "ep_35_ut_198"
    },
    {
      "end": 4688100,
      "speaker": "Enrico Bertini",
      "start": 4683808,
      "text": "Yeah. And greet us on the street.",
      "id": "ep_35_ut_199"
    },
    {
      "end": 4689960,
      "speaker": "Moritz Stefaner",
      "start": 4688880,
      "text": "Hear you all soon.",
      "id": "ep_35_ut_200"
    },
    {
      "end": 4690780,
      "speaker": "Enrico Bertini",
      "start": 4690080,
      "text": "Yeah.",
      "id": "ep_35_ut_201"
    },
    {
      "end": 4692016,
      "speaker": "Moritz Stefaner",
      "start": 4691200,
      "text": "Okay.",
      "id": "ep_35_ut_202"
    },
    {
      "end": 4693128,
      "speaker": "Enrico Bertini",
      "start": 4692168,
      "text": "Thank you, guys.",
      "id": "ep_35_ut_203"
    },
    {
      "end": 4693776,
      "speaker": "Alberto Cairo",
      "start": 4693264,
      "text": "Thank you.",
      "id": "ep_35_ut_204"
    },
    {
      "end": 4695208,
      "speaker": "Enrico Bertini",
      "start": 4693848,
      "text": "It's been great, as usual.",
      "id": "ep_35_ut_205"
    },
    {
      "end": 4696320,
      "speaker": "Alberto Cairo",
      "start": 4695304,
      "text": "Okay, bye.",
      "id": "ep_35_ut_206"
    }
  ],
  "confidence": 0.922670881353366,
  "audio_duration": 4703,
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_status_code": null,
  "webhook_auth": false,
  "webhook_auth_header_name": null,
  "speed_boost": false,
  "auto_highlights_result": null,
  "auto_highlights": false,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_audio_quality": null,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "content_safety": false,
  "iab_categories": true,
  "content_safety_labels": {
    "status": "unavailable",
    "results": [],
    "summary": {}
  },
  "language_detection": false,
  "language_detection_threshold": null,
  "language_confidence": null,
  "custom_spelling": null,
  "throttled": false,
  "auto_chapters": true,
  "summarization": false,
  "summary_type": null,
  "summary_model": null,
  "custom_topics": false,
  "topics": [],
  "speech_threshold": null,
  "speech_model": "best",
  "chapters": [
    {
      "summary": "Hi everyone. Hi, Moritz, how are you? Great. How are you, Enrico? I'm doing great, actually. Data stories number 35.",
      "gist": "Top 10 Data Stories of 2015",
      "headline": "Data stories number 35: Enrico and Moritz are healthy",
      "start": 11920,
      "end": 21650,
      "id": "ep_35_ch_0"
    },
    {
      "summary": "Germany is finally experiencing some warm weather. The author teaches a workshop on data visualization. He shows how to use Tableau and raw visualizations. Free, open source and quite extensible and quite powerful.",
      "gist": "Tableau vs. Raw: data visualization",
      "headline": "Finally we have some warm weather down here. You Germans call this super warm, right? Exactly. It's super warm. At least it's",
      "start": 22230,
      "end": 132530,
      "id": "ep_35_ch_1"
    },
    {
      "summary": "We have two special, special guests today. We have Robert Kosara from Tableau. And we have Alberto Cairo on the show. We're gonna fight about storytelling. If everybody agrees with me, everything's good. Otherwise, who in trouble?",
      "gist": "TALKING",
      "headline": "We have some special guests on the show. We have a big topic we're talking about",
      "start": 133630,
      "end": 200120,
      "id": "ep_35_ch_2"
    },
    {
      "summary": "Moritz: For me, it's been a topic I've been thinking about longer. Whenever there was, let's say, whenever data visualization or information graphics was designed in a wider context, it felt like it's always connected to storytelling. I hope today maybe we find better ways of getting to grips with the term.",
      "gist": "Data Visualization: Storytelling",
      "headline": "Moritz: For me, data visualization has always been connected to storytelling",
      "start": 200980,
      "end": 353572,
      "id": "ep_35_ch_3"
    },
    {
      "summary": "Storytelling is certainly a very loaded word, right? And it's, everybody has his or her own definition of it. I co wrote a column for Nature Methods magazine a while ago. It was a column about storytelling with visualization. There is some interesting to take from that, from that conversation.",
      "gist": "Storytelling in the science",
      "headline": "Storytelling is certainly a very loaded word, right?",
      "start": 353676,
      "end": 464354,
      "id": "ep_35_ch_4"
    },
    {
      "summary": "Scientist: Create a boundary between narrative techniques and storytelling. The question isn't so much about how you discover things, but how you communicate them. This is true not just for science, certainly it's true for all kinds of visualization.",
      "gist": "What is storytelling in science?",
      "headline": "There's a lot of confusion about scientific storytelling and storytelling techniques",
      "start": 464482,
      "end": 674786,
      "id": "ep_35_ch_5"
    },
    {
      "summary": "A narrative is a cause and effect connection of events that leads you through the process of understanding information. It becomes a story, according to this author, when it is soaked in emotion. This myth that we can be super objective on everything looks somewhat weird.",
      "gist": "On Truth and Objectivity",
      "headline": "Alberto Cardona: I think there's a fine line between narrative and objectivity",
      "start": 674938,
      "end": 963170,
      "id": "ep_35_ch_6"
    },
    {
      "summary": "There is a difference between the emotions that readers or their viewers take from the story that you're telling. Sometimes it can become too easy to make it dramatic with certain kind of triggers. What is important is to lead people into a story or into, I shouldn't say into, a story. Lead people into insights.",
      "gist": "Between Story and Narrative",
      "headline": "The boundary between narrative and story is very, very fuzzy",
      "start": 963250,
      "end": 1392434,
      "id": "ep_35_ch_7"
    },
    {
      "summary": "It is not the same thing to do a visualization for scientists than doing the same visualization for a general audience. You have to somehow seduce readers, particularly if you're addressing your product or your visualization to ageneral audience. Many cases where thinking about it as a specific message has to be broadcasted.",
      "gist": "Data Literacy and Storytelling",
      "headline": "One of the main mistakes about data visualization is assuming audience is general",
      "start": 1392482,
      "end": 1825230,
      "id": "ep_35_ch_8"
    },
    {
      "summary": "Theory could be a way to teach people how to play the visualization instrument. Give people a sense of why they should care and why a certain visualization can be a good thing. You need good examples, and you need to guide them into this.",
      "gist": "Using Story in Data Visualization",
      "headline": "Coram: Storytelling can help teach people how to use visualization",
      "start": 1825270,
      "end": 2208754,
      "id": "ep_35_ch_9"
    },
    {
      "summary": "Enrico: Stories often also seen as information of relevance. Some visualizations come out that make me ask myself, oh, don't tell. Sometimes these are very well crafted in terms of user interface. But after watching them, there's nothing really interesting to get out of it.",
      "gist": "The Problem with Beautiful Visualizations",
      "headline": "I think there's also a third dimension we haven't discussed yet. When you read newspaper, stories often seen as information of relevance",
      "start": 2208882,
      "end": 2603668,
      "id": "ep_35_ch_10"
    },
    {
      "summary": "It's also sometimes worthwhile to teach people that not every data set is super exciting. What question, what you're trying to show, why the thing matters, what the story matters. You have to ask yourself what those are and then present those clearly to people. This is for general audiences, not for specialized audiences.",
      "gist": "Headlines in Data Visualization",
      "headline": "When you analyze data, when you visualize data, you have to think about headlines",
      "start": 2603724,
      "end": 2992610,
      "id": "ep_35_ch_11"
    },
    {
      "summary": "There are things, especially the flight patterns and maybe also like the wind map, that are kind of self explanatory. You can understand them if you spend a second thinking about what you're seeing and how this is shown to you. It's really more about experience of kind of being thrown into all this data.",
      "gist": "Flight patterns and the wind map",
      "headline": "Robert Copland: There are things about flight patterns that are obvious",
      "start": 2996230,
      "end": 3256818,
      "id": "ep_35_ch_12"
    },
    {
      "summary": "Robert: Memory has this very strong narrative component, so you remember things much more clearly when you've been told a story rather than just individual facts. Having somebody piece together a story and making, turning it into a sequence is actually very valuable.",
      "gist": "4 Things That Make Storytelling Fun",
      "headline": "Memory has this very strong narrative component, so you remember things much more clearly",
      "start": 3256994,
      "end": 3479540,
      "id": "ep_35_ch_13"
    },
    {
      "summary": "When design, when we design visualizations, creating visualizations for exploration may not be enough. Even if you present a visualization, people will create their own stories. The potential for errors and mistakes on the part of the audience are huge.",
      "gist": "How to Tell a Story in Visualizations",
      "headline": "Even if you present a visualization, people will create their own stories",
      "start": 3480360,
      "end": 3645100,
      "id": "ep_35_ch_14"
    },
    {
      "summary": "Between annotation, narrative, and storytelling. Narrative is when you instill or when you introduce the drama in there, the conflict, the characters. Which meaning of the word would you recommend that we actually use as the right one?",
      "gist": "In the Elevator: Narrative",
      "headline": "There is a difference between annotation, narrative, and storytelling",
      "start": 3648530,
      "end": 3960820,
      "id": "ep_35_ch_15"
    },
    {
      "summary": "Robert: My thinking is mostly along, I guess, what Alberto calls the narrative part. And the annotations, so the drama and what then really becomes a story. Enrico: You have to be careful with it and only use it when it is appropriate.",
      "gist": "In the Elevator: The Narrative Dimension",
      "headline": "Robert Moritz: The annotation narration story spectrum makes a lot of sense",
      "start": 3962120,
      "end": 4388440,
      "id": "ep_35_ch_16"
    },
    {
      "summary": "If the topic is relevant to the audience, the audience is willing to explore the data. Just think about the many visualizations about election results published by the main us newspapers recently. Readers or audiences explore them just because the topic matters.",
      "gist": "Videograms and the topic",
      "headline": "If the topic is relevant to the audience, readers are willing to explore data",
      "start": 4388780,
      "end": 4424610,
      "id": "ep_35_ch_17"
    },
    {
      "summary": "Moritz: It has long been neglected to actually communicate your own visualization. He says that just because there is a lot of value in having narrative and having a story doesn't mean that we want to do away with exploration. Moritz: Both really work together really well.",
      "gist": "In the Elevator With Data",
      "headline": "You can do very exploratory visualization if you also communicate what it's about",
      "start": 4425110,
      "end": 4696320,
      "id": "ep_35_ch_18"
    }
  ],
  "disfluencies": false,
  "entity_detection": false,
  "sentiment_analysis": false,
  "sentiment_analysis_results": null,
  "entities": null,
  "speakers_expected": null,
  "summary": null,
  "custom_topics_results": null,
  "is_deleted": null,
  "episode_num": "35",
  "episode_metadata": {
    "speakers": [
      "Enrico Bertini",
      "Moritz Stefaner",
      "Robert Kosara",
      "Alberto Cairo"
    ],
    "WPid": "176",
    "url": "https://datastori.es/podlove/file/375/s/feed/c/mp3/datastories-35.mp3",
    "episode_title": "Visual Storytelling w/ Alberto Cairo and Robert Kosara"
  }
}