{
  "id": "95f00b06-cf12-4723-884c-649299f9709e",
  "language_model": "assemblyai_default",
  "acoustic_model": "assemblyai_default",
  "language_code": "en_us",
  "status": "completed",
  "audio_url": "https://datastori.es/podlove/file/600/s/feed/c/mp3/data-stories-48-vis-going-mainstream-w-stamens-ceo-eric-rodenbeck.mp3",
  "utterances": [
    {
      "end": 36748,
      "speaker": "Moritz Stefaner",
      "start": 200,
      "text": "Data stories is brought to you by Qlik, who allows you to explore the hidden relationships within data that lead to insights that ignite good ideas. Let your instincts lead the way to create personalized visualizations and dynamic dashboards with Qlik sense, which you can download for free at Qlik.de/datastories . That's Qlik.de/datastories. Hey, everyone. Datastore is 48. Moritz here. Hey, Enrico, how are you doing?",
      "id": "ep_48_ut_0"
    },
    {
      "end": 39276,
      "speaker": "Enrico Bertini",
      "start": 36916,
      "text": "Hi. I'm doing great.",
      "id": "ep_48_ut_1"
    },
    {
      "end": 39940,
      "speaker": "Moritz Stefaner",
      "start": 39460,
      "text": "Yeah.",
      "id": "ep_48_ut_2"
    },
    {
      "end": 41860,
      "speaker": "Enrico Bertini",
      "start": 40012,
      "text": "Very good by snow. Yeah.",
      "id": "ep_48_ut_3"
    },
    {
      "end": 45764,
      "speaker": "Moritz Stefaner",
      "start": 41892,
      "text": "Yeah. I was about to ask you about the weather. Finally. I have a good reason to ask.",
      "id": "ep_48_ut_4"
    },
    {
      "end": 48124,
      "speaker": "Enrico Bertini",
      "start": 45804,
      "text": "You because there's a big.",
      "id": "ep_48_ut_5"
    },
    {
      "end": 50756,
      "speaker": "Moritz Stefaner",
      "start": 48284,
      "text": "There's bliss in New York, right?",
      "id": "ep_48_ut_6"
    },
    {
      "end": 68264,
      "speaker": "Enrico Bertini",
      "start": 50820,
      "text": "Yeah. Yeah. I don't know. It didn't seem to happen. I'm so disappointed. I don't know. I mean, the news were very bad yesterday, but. I don't know. Doesn't look like a big storm so far. And the kids are having lots of fun around here playing with the snow.",
      "id": "ep_48_ut_7"
    },
    {
      "end": 72248,
      "speaker": "Moritz Stefaner",
      "start": 68384,
      "text": "So everybody takes a time off work and plays in the snow. Nothing better.",
      "id": "ep_48_ut_8"
    },
    {
      "end": 90596,
      "speaker": "Enrico Bertini",
      "start": 72296,
      "text": "That was just perfect. Yesterday I was supposed to teach at six and NYU sent me a message saying around noon or so, saying that after 04:00 p.m. everything is canceled. So I just try to have some fun with the kids. Nothing special. Well, actually it's special. How about you?",
      "id": "ep_48_ut_9"
    },
    {
      "end": 98300,
      "speaker": "Moritz Stefaner",
      "start": 90780,
      "text": "Yeah, nothing special. Just catching up with projects and, I mean, we just recorded the other episodes, so there's no big updates from me.",
      "id": "ep_48_ut_10"
    },
    {
      "end": 99364,
      "speaker": "Enrico Bertini",
      "start": 98452,
      "text": "Yeah, yeah.",
      "id": "ep_48_ut_11"
    },
    {
      "end": 135010,
      "speaker": "Moritz Stefaner",
      "start": 99404,
      "text": "But if you listen to that, you know what I'm up to. I think we can dive right in. And today we have a really super special guest. And it came when I was just catching up on EYEO Talk, so I missed last year's I O. I don't know how that happened, but somehow it did. And so I had to catch up on Vimeo and I saw Eric Rodenbeck's talk. And the minute after I finished the talk, I wrote him an email to invite him to data stories because it touched on so many things that are important to me and I've been thinking about, and it was a very personal, very. Just a great talk. And so I thought we should have him on the show. And here he is. Hey, Eric.",
      "id": "ep_48_ut_12"
    },
    {
      "end": 136882,
      "speaker": "Enrico Bertini",
      "start": 135082,
      "text": "Hi, Eric. Welcome.",
      "id": "ep_48_ut_13"
    },
    {
      "end": 137814,
      "speaker": "Eric Rodenbeck",
      "start": 137058,
      "text": "Hello.",
      "id": "ep_48_ut_14"
    },
    {
      "end": 181874,
      "speaker": "Moritz Stefaner",
      "start": 138274,
      "text": "Great to have you here. It's really fantastic. I mean, Steven has been on our list for a long time, Mike Migurski, so it was sort of halfway covered. But of course, now with Eric, we have the real deal and it can sort of follow up on the second half. And all of our listeners, you should. Now, if you have the chance. Now, if you're not on the bus or somewhere, ideally pause and go to the Vimeo link we put in the blog post and first watch the EYEO Talk, because I think we will just pick up where you left off at this point and we will refer to many of the points there. And as I said, it's a great overview of the last ten years of stamen. Or how long does stamen exist yet? Eric?",
      "id": "ep_48_ut_15"
    },
    {
      "end": 187334,
      "speaker": "Eric Rodenbeck",
      "start": 183574,
      "text": "Since 2001. So, gosh, it's going to be 14 years.",
      "id": "ep_48_ut_16"
    },
    {
      "end": 188194,
      "speaker": "Moritz Stefaner",
      "start": 187374,
      "text": "14 years?",
      "id": "ep_48_ut_17"
    },
    {
      "end": 201594,
      "speaker": "Eric Rodenbeck",
      "start": 191494,
      "text": "Yeah. I thought we only had maybe four or five years before Google came in and the machines took over. Turns out there was a lot more turns out there was a lot more to do.",
      "id": "ep_48_ut_18"
    },
    {
      "end": 262854,
      "speaker": "Moritz Stefaner",
      "start": 202414,
      "text": "There were many really great issues you touched on in your talk. And the one that was really where I got the most curious and also one that I keep pondering about and discussing with people is this whole issue. If there is a market, or let's say the changing role of creating bespoke data visualizations, very creative, crafty data visualizations. Because of course, on the one hand, it's the business I'm in, so I have a strong personal interest. And I think there's also something very interesting happened in that field over these last 15 years. And obviously stamen has been a huge part of that, maybe even leading the whole development. And so I think that's the first topic I would really like to discuss with you. How do you see that? Is there still a need for creating highly bespoke and crafty data visualizations? Or do you feel 95% of data visualization challenges maybe can be tackled now in standard tools? What's your take there?",
      "id": "ep_48_ut_19"
    },
    {
      "end": 335430,
      "speaker": "Eric Rodenbeck",
      "start": 265674,
      "text": "Yeah, so on the one hand I think about it all the time, and on the other hand, I have no answers, only in the sense that so close and personal that it's almost like I can't see the whole field because I'm so connected to it. But I mean, I think very clearly there is still a need for this. And when I say this, I mean the creation of these custom experiences. I think that the way that I think about it on a good day is that if you think about data visualization as a technical exercise primarily driven by code, there's clearly a lot less work than there used to be. Just in the sense that plotly and Tableau and all these companies and our friends at CardoDB make the basic get your data visible much easier or import. IO is now doing things like having desktop based web scripts.",
      "id": "ep_48_ut_20"
    },
    {
      "end": 342326,
      "speaker": "Moritz Stefaner",
      "start": 335462,
      "text": "When you started out, there wasn't cookie maps, right? Let's keep that in mind as a cookie. Maps came only 2005.",
      "id": "ep_48_ut_21"
    },
    {
      "end": 395324,
      "speaker": "Eric Rodenbeck",
      "start": 342390,
      "text": "Yeah, this is all fairly recent stuff. And so I think about it. Just because there's a program called Photoshop doesn't mean that people don't need to take pictures anymore and doesn't mean that there isn't a need for highly custom work in this area. Now, maybe if you're somebody who made a living designing blur filters, maybe you need to find something else to do. But I think that the practice of data visualization is about more than the creation of a suite of filters or the creation of tools. I think that if we think about visualization and mapping as a creative field and as a communications field and as a field that has to do with the kind of communication of information, not just kind of in a neutral sense, but in a kind of active, open sense, then it seems clear to me that there's a whole lot more to do.",
      "id": "ep_48_ut_22"
    },
    {
      "end": 412168,
      "speaker": "Moritz Stefaner",
      "start": 398144,
      "text": "I tend to agree absolutely. But at the same time, I feel like maybe the whole market is changing and maybe our roles are also changing more. As you say, from in the beginning, it was even hard to get anything on a map or to do something that's not a line chart or a.",
      "id": "ep_48_ut_23"
    },
    {
      "end": 418514,
      "speaker": "Eric Rodenbeck",
      "start": 412176,
      "text": "Bar chart, much less to get hired for it. Right. I mean, you have to explain to people what this stuff is.",
      "id": "ep_48_ut_24"
    },
    {
      "end": 454014,
      "speaker": "Moritz Stefaner",
      "start": 418934,
      "text": "Right, right. And in the beginning, I mean, I vividly recall the dig labs visualizations because they were sort of, for me, the first time I saw something really unusual from a big company, let's say, and not just from an art school or. So was it there that how did that these projects develop? Did the clients come and say, like, we want something mind blowing new? Or did they come and just say, let's see what you can come up with? And how do clients frame projects? Maybe today, is there a change? Or how did that develop?",
      "id": "ep_48_ut_25"
    },
    {
      "end": 602334,
      "speaker": "Eric Rodenbeck",
      "start": 457514,
      "text": "So I don't want to sound like too much of an old guy, but it was very much something that was in the mind of Kevin Rose. When you're talking about the big labs project, I mean, he was so excited about, you know, having his, basically his finger on the live wire of what was happening on the Internet. It was just such an amazing feeling to think that you could kind of in real time get a sense of what kind of news was breaking. And, you know, it was really his vision to have a couple of visualizations that would really shine a light on what was going on because the front page was just much too quick for anybody to pay attention to. You know, we tried to bring our own vision to that and to come up with our own take on that and then also our own kind of, you know, Kevin, to his credit, was very open to experimentation, and so we came up with multiple other visualization types beyond the first two that he came to us with. So I really have to give him a lot of credit for having that vision and believing in us. He was a real, real visionary. But, you know, it's really a. I would say it's really a mixed bag as far as how people come to us for this work. I think that, you know, 14 years is a long time. And if you look at the kinds of expectations that people have now around data visualizations, it's just total night and day from what it was before. You know, I can remember going to the New York Times and talking to them about mapping and data visualization, and they were really resistant to it. They had this idea that people didn't understand how to zoom and pan and click on a Google map. You know, remember that? And. And now they're just, like, doing amazing work. I mean, you look at what Noah Weltman is doing over there. You look at what, like, Bostock is doing, you know, you know, this is. And it's being done at the highest level, you know, in real time, you know, as part of a. As part of a newsmaking exercise. So, I mean, the. You used to have to explain to people what this was, and now the field is basically just completely opened up. So there's a much higher level of sophistication when people are coming to us and asking for this work, it's not about can you get our data on the map. It's more about, can you communicate this thing that I'm having a hard time communicating using all the technology and design tools at your disposal, which is much more interesting.",
      "id": "ep_48_ut_26"
    },
    {
      "end": 614114,
      "speaker": "Enrico Bertini",
      "start": 602414,
      "text": "Yeah. Do you think there is a specific reason why this happened? Is it more, do you think this is due mostly by a technological transformation or what?",
      "id": "ep_48_ut_27"
    },
    {
      "end": 647894,
      "speaker": "Eric Rodenbeck",
      "start": 616934,
      "text": "Yeah, the technology has gotten much, much easier, but also the set of expectations that people bring to it. As my friend Ben Servani used to say, that the literacy level around this has all gone up partially as a result of work that we've done and very much because of work that the people like you are doing. The people like Ben Fry are doing, Casey Reas. I mean, all these practitioners have been kind of banging this drum of making data visible. And so the market is just more sophisticated than it used to be.",
      "id": "ep_48_ut_28"
    },
    {
      "end": 679844,
      "speaker": "Moritz Stefaner",
      "start": 649394,
      "text": "Yeah, I think. And this development is still going on, right? I mean, and if you think back five years or three years, even, as you say, what people expect from data visualization, but also what they know already and what we can all build upon as a pattern or as an established, like, cultural thing, like narrative techniques or, as you say, map ui. Like, we can presuppose that now and do something with it. And a few years ago, you had to explain it and experiment.",
      "id": "ep_48_ut_29"
    },
    {
      "end": 751204,
      "speaker": "Eric Rodenbeck",
      "start": 682424,
      "text": "Yeah. And so this is in some ways, what I was trying to get at in the talk that I gave was that, you know, what do you do when suddenly the thing that used to be your own special little secret sauce that only you and a few other people knew how to do becomes something very widespread? Do you pack up and go home? Do you find something else to do? What else is there? And I think this is a really good moment for us as practitioners in this field to really step back and take a look at what we're actually trying to make happen, because it's not just about poking a stick in the eye of the establishment. It's not just about something that no one has ever seen before. It's about generating and maintaining real value through this work and becoming a kind of vital part of a conversation about what's happening in the world. And that's just very different from uncovering a shiny new thing for the first time and holding it up. And there's a lot of freedom and latitude in doing it for the first time. Doing it for the third and fourth time, and doing it well and demonstrating mastery is, I think, just a different proposition.",
      "id": "ep_48_ut_30"
    },
    {
      "end": 790594,
      "speaker": "Moritz Stefaner",
      "start": 752504,
      "text": "Ken? It's much more long term and slow and often invisible process. Right. So it's, of course, much easier to impress somebody with a 1 minute video of this beautiful thing. But often it's much harder to explain why a year long dialogue with a client was interesting or worthwhile. So do you feel this? So do you feel it's getting harder to do sexy types of projects or sexy work in that sense? Like something that everybody finds immediately compelling?",
      "id": "ep_48_ut_31"
    },
    {
      "end": 855120,
      "speaker": "Eric Rodenbeck",
      "start": 793894,
      "text": "I think I'll come back to my friend Ben here. He talked about thinking about what we do, and when I say we are, I mean you and we also less as designing software and more about designing fashion, kind of situating this work less as a kind of, like, you know, I make this tool, then I make this tool, then I'm finished. And more about engaging in a practice of kind of making new things within. Within a culture that's moving forward. So you kind of situated both in a kind of technical context and in a creative context, but then also in a cultural context. Certain things resonate at different times. It's less about a kind of quantifiable, this is what's next from a development perspective, and it's more about a kind of cultural, this is what's next from a kind of societal perspective. And I'll just say that. I'm going to say this a bunch. I think it's a much more interesting time now than it was then. There's so much more to do.",
      "id": "ep_48_ut_32"
    },
    {
      "end": 895700,
      "speaker": "Enrico Bertini",
      "start": 855232,
      "text": "So while watching your talk, I was always thinking about, is it going mainstream a good thing or bad thing? And I think going mainstream, I mean, we should celebrate that, right? I mean, we've been doing this thing for quite many years now, and the fact that it's going mainstream is probably the fact that due to the fact that it's very successful. But at the same time, I think my opinion is that if it goes, if something goes mainstream, it doesn't mean that many more good things are gonna happen. Right? I mean, probably there would be a lot of new ideas, new transformations. So probably it's going to be very exciting. Anyway, I'm curious to hear, what's your take on that?",
      "id": "ep_48_ut_33"
    },
    {
      "end": 973136,
      "speaker": "Eric Rodenbeck",
      "start": 895772,
      "text": "Just thinking about it a lot. Not just in terms of data visualization, but also in terms of what's happening to cities. I don't know if it's happening in Europe so much, but I know that in the United States, we've reached this point where cities are going mainstream, where they used to be these kind of edgy places where you moved to as a young person and you helped develop something or you moved to as an artist. And now all the people are here and it's getting kind of weird for those of us who have kind of been on the kind of developing edge of cities for a while, I'm kind of looking around at a lot of these places that I used to think of as kind of hip and edgy, and they're just kind of. Not anymore. There's something else. And I'm not willing to just simply say cities are over or which no one is saying the cities are over. But I guess what I'm finding in the world to be quite interesting as a kind of zone of discovery is just what happens when, like, really what happens when these edgy things become, become well settled? What is the opportunity there? It might be because I'm getting older and I have a kid and I'm less interested in kind of moving to the next new hip neighborhood, but I'm just really starting to think about kind of putting down roots and thinking about kind of having a way of working that works in the long term.",
      "id": "ep_48_ut_34"
    },
    {
      "end": 1004134,
      "speaker": "Moritz Stefaner",
      "start": 973200,
      "text": "I think this gentrification perspective is a really good one. I have never seen it like this, but probably it's true that, yeah, like everything fresh and hip and totally edgy and cutting edge at some point needs to settle down. And then it's becoming interesting. Does it just become a watered down version of the original? Or is it actually like a transformation into something just more solid, more sustainable, more reasonable, really, and maybe more grown up, as you say? It's a good question.",
      "id": "ep_48_ut_35"
    },
    {
      "end": 1137994,
      "speaker": "Eric Rodenbeck",
      "start": 1004254,
      "text": "Yeah, I hope it's the latter, not the former. But, you know, my kid is going to be 18 at some point and he'll tell me, I mean, something else that's sort of useful, and I've used this as a rhetorical device in other conversations, is when we're talking about data visualization as a field that's changing, like to go back to some other fields of endeavor, both creative and technical, and just put the word, take the word, say photography out and put data visualization in. Right. Because. Or to think about painting and not just to slavishly kind of repeat the. But just to kind of put ourselves in the position of, you know, people who are at the moment of a transformation of a medium. And you can, if you look back over the history of technology and the philosophy of technology, you can see these things kind of repeat themselves. Right? So people used to have, I mean, they literally used to say the same things about data visualization or rather about photography than we're saying about data visualization. And you used to have these big arguments about whether it was okay to move a branch, you know, because you, photography was about supposedly capturing what was actually real. And these kinds. So I think it's actually quite, it's worth going back and looking at the history of kind of art criticism because photography just kind of dropped down in that like a bomb, right? And we're sort of seeing a similar moment in mapping where the kind of things that, it's so funny, you read these blogs by these supposed professional photograph or cartographers, and they're really concerned about the kind of dumbing down of their craft and very concerned that, you know, people don't have the proper focus and that they're really, you know, they haven't been trained in the way that color and form need to work together in order to communicate the most optimal message. And you look at the work that they're doing and it's like, I mean, I don't want to just like, start being mean to people. But I mean, it's, you know, it's the most boring thing you think about, right? And so on. And yes, it's. Yes, it's true that everybody's like ten things you can learn from this map on Buzzfeed, you know, and that's kind of cool crap. But I don't know, I would prefer. I prefer living in the Buzzfeed world, where there's just so much more volume and so much more action than in this kind of rarefied work only being done by professional highbrow stuff.",
      "id": "ep_48_ut_36"
    },
    {
      "end": 1211642,
      "speaker": "Moritz Stefaner",
      "start": 1139414,
      "text": "It also reminded me, I don't know if you mentioned that, but there's this great text from Michael Neymar on first word art, last word art. I can't recall if we ever discussed it on the podcast, but I have it from Golan Levin, and he passed it around a few times, and I think it matches often so well. And the texture briefly sketches or sort of posits that there's two great ways to do a great artwork. And the first one is to do something for the first time really well and, like, break that ground and do something radically new. And then there's this other way where you take something existing and try to sort of build on the culture and. Yeah, and do the definite symphony or write the definite crime story. Right. So take something that's existing and well established and then work within that rich context and that it's. Yeah, both types are super interesting to work with. And maybe we're just right in between. Like the first word art has been done in many ways, I guess, in data visualization. Now we need to maybe work on how to take it to the next level really well.",
      "id": "ep_48_ut_37"
    },
    {
      "end": 1287434,
      "speaker": "Eric Rodenbeck",
      "start": 1211698,
      "text": "And then you start to talk about genre. When you start to think about a crime novel or even a novel as a genre, there's a great book by Michael Chabon called Maps and Legends, and he talks a lot about the use of maps and comic books and all these kind of popular forms of writing as a way of exciting people and of getting people just excited about the material that you're working in. And you sort of, you get to a place with a lot of these things where it's not necessarily about inventing new forms, but really inhabiting the ones that exist. And you start to be able to play them off each other. You start to be able to make inside jokes. You start to be able to make kind of progress over time. I mean, there's a whole way of thinking about literature that I think if we were to start to think about, if we started to hold, if we started to hold our data visualizations to the same standard as we held our comic books, I think we would really have some wonderful, some wonderful work and just, you know, I mean, and my wife has talked about this, like, how do we. Maybe we do pop up books of data visualization? You can't, you guys can't steal that idea. But that's something I want to do at some point, is to do a pop up book. That's pretty nice, you know, and you get like Minard and you get like, you get like Aaron Koblin's flight pattern, you know, that happens as you like, open and close the pages of a book or dig labs, like in a, in a brilliant.",
      "id": "ep_48_ut_38"
    },
    {
      "end": 1289894,
      "speaker": "Moritz Stefaner",
      "start": 1287474,
      "text": "You need to do it. That's good.",
      "id": "ep_48_ut_39"
    },
    {
      "end": 1291402,
      "speaker": "Eric Rodenbeck",
      "start": 1290434,
      "text": "Thanks, man.",
      "id": "ep_48_ut_40"
    },
    {
      "end": 1447124,
      "speaker": "Moritz Stefaner",
      "start": 1291538,
      "text": "Yeah, but the genres is a really, really good idea. And I think there's even a talk by Martin Fernandez Viegas. I somehow recall they had something on what if this visualization is the crime story and this is the horror story and this is the love story? Right? And what if you build on that and sort of work with these existing genres? It's really nice. Yeah. So that's a great time to take a minute and talk about our sponsor. Click. Imagine an analytics tool so intuitive, anyone in your company could easily create personalized visualizations and dynamic dashboards to find meaningful insights. Well, that's Qlik sense. Qlik itself. The company was founded in 1993 in Sweden, so they've been around for a while. They are now headquartered in Pennsylvania after going public at the Nasdaq, their newest product, Qlik Sense, was launched in July 2014 and pairs Qlik's market proven data indexing engine with the ability to drag and drop visualizations into your dashboard. Above all, Qlik Sense is intuitive. It lets you rapidly create visualizations, explore data deeply, reveal connections instantly, and see opportunity from every angle. It's highly interactive and very fluid to explore data. Qlik Sense's data storytelling functionality is noteworthy as well. It makes it easy to share analysis with colleagues and collaborate more effectively. Also, if you ever lost your place culling the data, Qlik Sense also now features a smart search function that queries the entire dataset for the values you misplaced. Most importantly, Qlik Sense isn't limited to just the desktop. You can access your analytics on the go or on a tablet and a smartphone and find your intels literally everywhere in real time. So thanks so much to Qlik for supporting us. And now back to the show. How about the practical side? That's also something I was really interested in. What I keep discussing and also keep figuring out for me what's the best way to build data visualization? What's the best team size? What's the best methodology? Is there something, is it different to build data visualizations process wise than doing media projects in general? Any advice there for anybody getting started? Or what's your experience now over all these years of doing projects? What are the things that worked from an organization point of view, what didn't work? I'm super curious to hear all that.",
      "id": "ep_48_ut_41"
    },
    {
      "end": 1569694,
      "speaker": "Eric Rodenbeck",
      "start": 1447244,
      "text": "So there's a lot of talk about agile software development practices and I think all that's super important and iterative development and kind of scrums and all that kind of thing. I think that that's, that's good. I guess I would say, in my experience, I found that if you try and rely on a process where, whether it's rigid or not, but it's sort of defined, you wind up always pointing back to the process and there's a sort of attempt to kind of take the people out of the equation and I've just never found that to work. I think that if you can find the right project manager, for example, you can be head and shoulders above where you were before. And partially it's because they have processes, but it's also because they're willing to kind of step up and figure out what needs to be figured out. There's a kind of spirit of being able to make it happen no matter what. And so when I think about the kind of people that are required to do this work and do it well, I think about more people who are kind of friendly and engaged with each other. Committed to the craft certainly, but committed to each other as well. Part of what I've been thinking about is how to have a studio that continues to run, a studio that continues to be supportive and not just a kind of flash in the pan, jump in with both feet and then move on kind of plays. So it's just that I've talked about it with a number of different people that kind of is it important to have a kind of way of working that's kind of systematized and where you can kind of drop people in and out? And I just don't feel like that's a good way to do creative work and I also just don't feel like it's a good way to do kind of work that's got staying power.",
      "id": "ep_48_ut_42"
    },
    {
      "end": 1617142,
      "speaker": "Moritz Stefaner",
      "start": 1570034,
      "text": "Yeah, but I mean, at the same time, I think there's some character to statement projects or probably, I could imagine there's also some repeating patterns in the processes that sort of ensure that the outcome is actually sound and is also interesting and so on. So how do you do it? Do you like, when you have new team members, sit down and show them past projects and tell them how you did them? Or will you coach them in the first few projects they do? Or do you just say you're cool and you're cool tool the two of you work together and keep me updated? Or how do you usually approach this challenge of, I mean, you never know how people, if you don't give them a process, how they will actually approach the project. Right.",
      "id": "ep_48_ut_43"
    },
    {
      "end": 1753992,
      "speaker": "Eric Rodenbeck",
      "start": 1617278,
      "text": "Suppose it's a character flaw of mine, is that I'm much more interested in, a lot of times in other people's ideas and responding to their ideas, rather than coming in and saying, it absolutely has to be done in this way. That can cause problems and strife. But I guess I've just always found it more interesting, and it's part of how I've gotten involved in data visualization. I feel like the world and the data in it is much more interesting than any sort of preconceived notions that I've had of it in a process of responding and molding, much more than I am in sort of determining from the beginning. Having said that, the work needs to get done. And so my project managers and design directors will have a very different sense of this. They've got a, they're in the business of kind of teasing out what that process should be and how it ought to be, how it ought to be applied. I'm aware this is somewhat unorthodox, and I would, when I start to think about the process of doing this work, I think much more about things like embracing early uncertainty and experimenting and encouraging play. I mean, those are kind of, those are not things that you get to do at stamen. Those are things that you have to do. That's a big part of the work. And really, the way that when we first started doing this, I thought I wanted to combine experimental work and commercial work together. You know, I wanted to be like Santiago Calatrava or one of these, like, big shot architects that kind of do experimental work. And what I've found is that in this practice, the process of open source software development and open data have been a really kind of fertile bridge between these two, and then also a way to develop best practices for doing creative data visualization. I mean, just in a sense, on the most basic level, from being able to share IP with your employees, but then also just the level of commitment that encourages new things and the kind of way of working that's both experimental and yet has to work is a kind of vital part of the process that's going on.",
      "id": "ep_48_ut_44"
    },
    {
      "end": 1790284,
      "speaker": "Moritz Stefaner",
      "start": 1754168,
      "text": "Okay. Yeah, it's tricky. It's super challenging, and, I mean, personally, for me, I never felt I can scale my process over a team of more than two or three people, actually. So I felt anytime more people were actually, like, deeply involved with the project, like, things are getting complicated and are in trouble. And just out of curiosity, how large are the teams in stamen? Do you also have sometimes projects where you have seven people or ten in one project? Or is it always small, very agile teams?",
      "id": "ep_48_ut_45"
    },
    {
      "end": 1858634,
      "speaker": "Eric Rodenbeck",
      "start": 1793464,
      "text": "It's mostly fairly small. You know, three, four. You know, the thing I like to say about stamen is that if any one of us can do it on their own, it's not really a stamen project. You know, I want all of us to be learning from each other and surprising each other. And there's stuff that, you know, the back end people can do that the front end people can't, and there's stuff that the designers can do that the technologists can't. And, you know, we're all in a. In a situation of always learning from one another. We're working on a project right now for the University of Richmond. That's one of the larger projects that we've done, and that's got more than. That's got a larger team on it. And that's. It is a challenge to be in a place where the code is not just all in your hands or where the design needs to be handed back and forth a bunch of time. But I'm very much of the mind that collaboration and learning is better than kind of, at least in this context, it's better than kind of lone wolf, kind of individual authorship.",
      "id": "ep_48_ut_46"
    },
    {
      "end": 1874914,
      "speaker": "Moritz Stefaner",
      "start": 1861214,
      "text": "Yeah. And, I mean, end of the day, not how many of the big and also worthwhile projects cannot be done by two or three people just hacking something together. I think that's also something which is just a reality. Yeah.",
      "id": "ep_48_ut_47"
    },
    {
      "end": 1912674,
      "speaker": "Eric Rodenbeck",
      "start": 1876534,
      "text": "Yeah. And if you're going to be, you know, if you're doing a project about climate change, you know, and this needs to be factually accurate, and you need to design and build a map of the entire western seaboard, you know, that's not. That's not something that gets done, you know, at night and on the weekends, because someone's feeling creative. Right. It's something that gets done during the day with people, gets communicated about, is, you know, is. Goes through revisions. You know, all those kinds of things. You know, I like that. I like, I like having, I like having things that are, that are kind of subject to scrutiny.",
      "id": "ep_48_ut_48"
    },
    {
      "end": 1986294,
      "speaker": "Enrico Bertini",
      "start": 1912974,
      "text": "Yeah. And Eric, I wanted to ask you, since you introduced the, you just mentioned the climate change project, I was really impressed by the part where you said, I think it's toward the end of your talk, you say, why I'm still here. Right. And I'm really curious to hear. I mean, I don't mean seriously because, I mean, I think this is probably one of the most interesting parts for me because I think it's so easy to just, I don't know, lose your vision on the day to day kind of activities that we all have. Right. I mean, I go to work every single day. We come back home. I have a family. So. But from time to time, I like to stop and think about why am I exactly doing that? And even more, I mean, is there a way I can have some sort of impact on the world with what I'm doing? So I'm really curious to hear from you, what's your take on that? Because, I mean, from what you said in the talk, it looks to me that you have some ideas about that. Right. I mean, you must have at least one answer why you are still there. Right. And I think that's really, really important because this goes very well beyond any problems with, I mean, any technicalities, learning this or that, being cool or whatever. Right. It's trying to have a real impact.",
      "id": "ep_48_ut_49"
    },
    {
      "end": 2156974,
      "speaker": "Eric Rodenbeck",
      "start": 1990654,
      "text": "Yeah. So, I mean, the one that springs most to mind is this climate work. There is an urgency that I feel and that scientists have felt for a long time, that, I mean, this climate change that is occurring is gigantic and is too abstract a lot of times to be understood. And the people that have the best understanding of it are often the people that aren't necessarily the best communicators about it because they've got their arms around all the facts. And I think that there's an urgency that I feel around conservation, around climate change, around communicating what's going on on the planet that keeps me up at night. And it's really important and urgent that we do stuff about this now. And it's not enough to leave it to the scientists, it's not enough to leave it to the politicians. There has to be a groundswell of understanding about what's going on and then also what to do. That's something I'm super motivated by to try and affect some change here. I think this whole issue of cities and how to live in them is also something that's one of the kind of dominant, if not the dominant issues of our time. I mean, when I talk with my partner John Christensen about this, we both have this sense that, and the numbers are showing that the world is going to, everybody's going to move to cities. You know, there's going to be about 9 billion people in the world. Everything is going to get super dense, and then it's kind of going to stay that way, right? I mean, barring kind of catastrophic stuff that the world's population is going to max out at wherever it's going to max out, and then we're going to have to need to figure out how to live that way. And so it's really important that we have dialogue around cities that's informed by data that's not just about the kind of, you know, connected city, smart city. You know, everybody's got sensors in all the walls kind of conversation to have a kind of robust conversation about what, how we want cities to be and how we want to use maps and visuals to communicate about those kinds of things. So I'm, you know, thinking much less about, you know, any particular, you know, new software contribution or any new particular kind of design innovation that I'm starting to just really think about kind of what's a way to, to make these processes more human and to make the communication about them more human, more literate, better informed.",
      "id": "ep_48_ut_50"
    },
    {
      "end": 2166362,
      "speaker": "Enrico Bertini",
      "start": 2157674,
      "text": "Yeah. So you just mentioned climate change. So do you think there are some other areas that might actually be crucial for data visualization, for having an impact in the world?",
      "id": "ep_48_ut_51"
    },
    {
      "end": 2322264,
      "speaker": "Eric Rodenbeck",
      "start": 2166418,
      "text": "Well, you know, I think that when this stuff works really well, it takes something that is hidden or invisible or complex or difficult and makes it extremely clear. I mean, I'm thinking about the work that my friend Wes Grubbs did at pitch interactive where they mapped out. It was a visualization of all the drone strikes that the US and our allies have been carrying out in Afghanistan and Pakistan. And it's just this incredibly impactful, gentle pounding over the head of what's going on over there. Right. And it really kind of, it really kind of brings to light something that you had never really thought about or that maybe not necessarily never thought about, but more it brings to the fore and it makes clear, and it makes visible something that was previously behind locked doors. There's a project that James Bridle has put together. I think it's dronestagram. He finds the locations of all of the drone strikes, and then he publishes satellite imagery of the places where those things have happened. You know, these kind of, these kind of very. I don't even want to call them subtle, but they're very sort of direct reminders through visuals of. Of what's happening in the world. And I don't mean to be overly political about that. The issue of drones is a quite complicated one, and there's a lot of things to talk about there. But I just feel like if you can find something that hasn't been, that you care about, that hasn't been adequately mapped, that hasn't been adequately brought to light, I think it's really worth grabbing onto with both hands. We're doing a project right now about slavery in the American south, and the kind of the maps and visualizations that are coming out of that will just chill your soul to think about how many people were forcibly kind of taken from their families and moved around. I feel like these kinds of issues, a lot of times you can read about them and that's one thing, and you can be told about them and that's another. But if you can be shown, if you could be shown them in a way that kind of short circuits your brain and kind of makes a real impact, I mean, that's really the goal. That's the reason to get up in the morning.",
      "id": "ep_48_ut_52"
    },
    {
      "end": 2338884,
      "speaker": "Enrico Bertini",
      "start": 2322424,
      "text": "I think ultimately, this is also connected to how people consume this kind of information. So I'm just curious to hear, do you actually. So when you publish a project on the web, do you have any specific method through which you know exactly how people use your information?",
      "id": "ep_48_ut_53"
    },
    {
      "end": 2393594,
      "speaker": "Eric Rodenbeck",
      "start": 2343454,
      "text": "We don't do a whole lot of tracking. I mean, a little bit here with Google and that kind of thing, what we've done, we make sure that it goes onto Twitter and those kinds of things. And I watch that quite carefully. There's an energy from having this work out in the world and having it on the Internet, especially with Hash URL's and things, so you can really tell where people are looking. It's not just they look at the project, but they're looking at Afghanistan or whatever. So really the work there is to put as many kind of hooks into it as you possibly can so that people can refer to it in whatever ways they need to.",
      "id": "ep_48_ut_54"
    },
    {
      "end": 2402374,
      "speaker": "Enrico Bertini",
      "start": 2393714,
      "text": "So do you have any success story of people doing something special, taking action after using your, your applications?",
      "id": "ep_48_ut_55"
    },
    {
      "end": 2414914,
      "speaker": "Eric Rodenbeck",
      "start": 2407354,
      "text": "You know, I should have a much better answer to this question. Well, you know, I think I remember a lot of different things. I mean, right.",
      "id": "ep_48_ut_56"
    },
    {
      "end": 2416214,
      "speaker": "Enrico Bertini",
      "start": 2414954,
      "text": "You had a crime one.",
      "id": "ep_48_ut_57"
    },
    {
      "end": 2503118,
      "speaker": "Eric Rodenbeck",
      "start": 2417634,
      "text": "Yeah, there was, that was, that was one that we had heard some really good things about. It was when we, when we did the crime spotting project. You know, the formerly, people were showing up to these police meetings, excuse me, showing up to these police meetings, and the police were showing them kind of badly photocopied maps and charts about what was happening in the neighborhood. And after we, after we made the crime data public, we heard that people were going to these meetings with their own maps and their own data and asking questions about why there was a rash of burglaries around Solano Avenue and those kinds of things. That's one that's kind of impactful in people's brains. I think that the more kind of general issues around climate, for the Audubon project, where we map the changing ranges of birds under circumstances of climate change, the anecdotal evidence was kind of similar that people, you know, really, when you say, you mean there's not going to be any more owls in this forest or, you know, we might actually lose the balloons in Minnesota. Those kinds of things are also pretty impactful. You know, if you can show people, it's like this is happening at your house again, it makes it a little bit sort of more. If you can. If you can make these issues personal, you can start to have more of an impact.",
      "id": "ep_48_ut_58"
    },
    {
      "end": 2564954,
      "speaker": "Moritz Stefaner",
      "start": 2503206,
      "text": "Yeah, but I think that's a really interesting point, and it's something, I mean, we are all aware now, okay, we need to make individual views in the application shareable and build smart mechanisms for actually annotating maybe the data or sharing specific views. But I think there's not enough culture yet to actually ensure that this is happening afterwards, or, as you say, understand how it's happening in detail. And I think part of the problem is, as an agency or for me as an individual, it's just not feasible to, to follow up on projects like years afterwards and sort of help train people to use it. Right. Or sort of do workshops with the tools you develop. You know, you would actually have to keep being part of that conversation. And the client often is probably also not capable, or it depends highly on which types of people you have there, if they are, like, in the position to do that even. And I think for years now we've been debating that, but it's. I'm not sure if it's happening the right way yet.",
      "id": "ep_48_ut_59"
    },
    {
      "end": 2699396,
      "speaker": "Eric Rodenbeck",
      "start": 2567174,
      "text": "I mean, we sponsor an educational initiative called Map Time, and that's something that we've. If there's sort of been a change in how we've been operating in the last couple years, it's very much been about this, that it's less about kind of demonstrating virtuosity to a small circle of initiates and more about kind of inviting the broader public into this work. So Beth and Alan started this chapter, and Lizzie at CFA started this chapter where they basically invited people to do very basic map making work. And it's expanded now on a volunteer basis. I think there's 40 chapters on four continents where people get together once a week or every two weeks and learn about the kind of basic mapping framework for us. That's been a core of what I've been interested in at the shop since we started was making this stuff much more available to regular people and being part of a very mainstream conversation. What started to happen is that for certain kinds of clients who are interested in education, the fact that we're going out and fundraising and supporting these educational initiatives has been kind of a selling point almost for us. I mean, it's not just about the work, but it's also about having enough of infrastructure and enough of a kind of capacity to be able to teach other people about it. And I'm really interested in that way of working. So it's not just about doing something and then releasing it and then walking away to something else, but it's about kind of developing these longer term relationships and having relationships with universities and being able to go out and teach people about this kind of stuff and really be embedded in the conversation in the long term. So I think there's ways to do it. It's hard, and it's not always clear what the path is. And especially the path about how to pay for it is one that I'm actively working on right now. But I'm glad to know that you're thinking about this as well. I mean, it sounds like you're saying it's a. So it's an active topic of conversation among you guys.",
      "id": "ep_48_ut_60"
    },
    {
      "end": 2756264,
      "speaker": "Moritz Stefaner",
      "start": 2699460,
      "text": "Yeah, I feel so. And I feel we need to take the next leap there because everybody, it's a bit like climate change. Like everybody's aware it's there, it should be tackled, but, you know, it needs to take. It requires a change of habits and a change of behavior, simply, you know, also for us, like how we approach these projects. And I was reminded of that when I read this text by depth chakra on making. And she has this great text on the Atlantic, why she has trouble identifying with the maker scene. I think it's specific now, this argument to the maker scene, but can also be generalized, that there's maybe has been over the last years or so, maybe a bit of an obsession with people who make stuff and produce stuff that is cool and fancy and awesome and not enough work that's being valued that actually builds competence or creates communities or all the people side of things, let's say.",
      "id": "ep_48_ut_61"
    },
    {
      "end": 2798888,
      "speaker": "Eric Rodenbeck",
      "start": 2757564,
      "text": "Yeah, I'm looking at this now. The sort of, you know, walk through a museum, look around the city. Almost all the artifacts that we value as a society were made by or at the order of men. But behind everyone is an invisible infrastructure of labor, primarily caregiving in its various aspects that is mostly performed by women. I mean, this is. This is huge, you know, and I'm. I think that that's, you know, there is this kind of maker culture, which, which is great and wonderful. I think there's also a kind of pizza and beer mentality to a lot of this kind of work where, you know, you have a, you know, you show up in your hoodie, and you've. You're of a certain class, and you're able to, you know, you're able to spend the time, you know, hacking on stuff, and then you get rewarded for your.",
      "id": "ep_48_ut_62"
    },
    {
      "end": 2800484,
      "speaker": "Moritz Stefaner",
      "start": 2798936,
      "text": "Save the world in a hackathon.",
      "id": "ep_48_ut_63"
    },
    {
      "end": 2877364,
      "speaker": "Eric Rodenbeck",
      "start": 2802224,
      "text": "Yeah. And so, you know, I'm. I'm just not. I mean, I'm interested in that, sure, but. And I think it's great, but I'm so, like, for example, we've done work with the San Francisco Museum of Modern Art, and they're about. About working with their API, and they were much less interested in a kind of, like, let's go to some tech office and invite a bunch of dudes to show up with and provide them pizza and beer after hours and more in reaching out to their. Reaching out to their community and getting involved in the kind of curation process, discussing these things together, you know, turning it into a much more kind of collaborative, let's see what we can figure out together, rather than a kind of lone wolf, kind of see what you can hack up, break things, move quickly kind of thing. And I think that that's. We're having something similar with the Berkeley, the School of Informatics. They've got a whole ton of data, and they're really interested in finding ways to kind of both make their data more available, but also kind of give people a sense of what's possible with it. And I just feel like this whole idea of kind of nurturing and gardening, rather than just kind of coming in and moving quickly and breaking things, is another aspect to data visualization and the kind of field and the culture that I want to nurture.",
      "id": "ep_48_ut_64"
    },
    {
      "end": 2898604,
      "speaker": "Moritz Stefaner",
      "start": 2881664,
      "text": "Do you think this is also the long term trajectory for stamen as a company as a whole? Or do you think there will always be this mixture of maybe making and community building? Probably. It has always been a bit like that. Do you see the weight shifting there? What's your feeling?",
      "id": "ep_48_ut_65"
    },
    {
      "end": 2953724,
      "speaker": "Eric Rodenbeck",
      "start": 2901744,
      "text": "I don't know. I don't know. I can't speak to what's happening in the world. I can speak to what my personal interests are. And I'm at a place where I'm certainly interested in encouraging the making and the breaking, but not to the exclusion of the growing and the nurturing. I'm really interested in, for example, gender parity. That's Damon. And this kind of, this idea that it's not just about. I mean, you look at Silicon Valley and it's just disgusting, you know, like, it's just like 90% men or whatever. It's just gross. And so, and it's so clear, you know? And so I just feel like that's. Anyway, that's. I'm very interested in the kind of in a working model that encourages both sides of our humanity, or all sides of our humanity, I should say, not to be so heteronormative.",
      "id": "ep_48_ut_66"
    },
    {
      "end": 2986834,
      "speaker": "Moritz Stefaner",
      "start": 2953804,
      "text": "I think the map time project is really interesting, too. And Enrico and I have also been talking about visual literacy and how to get more people to do the data part and be excited about data analysis and data science, things like this. What do you think is the biggest gap we need to fill? Or what's the big obstacle? Tools seem to be there. The people seem to be interested. It's a sexy topic. What do you think? What do we need to do?",
      "id": "ep_48_ut_67"
    },
    {
      "end": 3060324,
      "speaker": "Eric Rodenbeck",
      "start": 2993534,
      "text": "I'm not sure that there are obstacles so much as there are challenges now. I think it's about engaging, finding other people who have some of the similar mindset. We're starting to find them in the foundation world. We're starting to find them in the education world. So I think it's about being very intentional about that, about wanting to move the field in that direction. One of the things that I've learned is that you get the kind of work that you've already done and that you don't ask for something, you won't get it. And so part of what I'm trying to do is to, is to be very public about this desire that we have at the studio to build a technological and creative practice that's more inclusive, less about a kind of, if I may, a kind of bro culture of Silicon Valley, and more about. More about a sustainable way of. Of doing business and being in the world.",
      "id": "ep_48_ut_68"
    },
    {
      "end": 3086000,
      "speaker": "Enrico Bertini",
      "start": 3061544,
      "text": "I'm very much interested in the educational part of this as well. And I think when, when we talk about visual literacy, I think we implicitly mean the idea of teaching people how to create visualizations or deal with data. But I think there is also another aspect. How do we actually expect people just to read this thing correctly or just be able to reason through that, draw.",
      "id": "ep_48_ut_69"
    },
    {
      "end": 3087400,
      "speaker": "Moritz Stefaner",
      "start": 3086032,
      "text": "Their own conclusions and so on?",
      "id": "ep_48_ut_70"
    },
    {
      "end": 3128614,
      "speaker": "Enrico Bertini",
      "start": 3087432,
      "text": "Yeah, exactly. I don't know. My impression is that the more people will be exposed to visualizations or anything that comes out of things like data journalism, the more they will realize that, I mean, they will be pretending more information about whatever is, I don't know, thrown at them. Right. I think we come from a very long time of journalism where people just take facts as they are. Right. And probably, I don't know, in a bright future people will be able to, first of all, I mean, they will be pretending more information, not just taking everything from granted. And I don't know, I think that's an interesting trend. I hope it's true.",
      "id": "ep_48_ut_71"
    },
    {
      "end": 3238426,
      "speaker": "Eric Rodenbeck",
      "start": 3130914,
      "text": "Well, I mean, and if you think about it again, I think this is why it's a good idea to switch out the words data visualization with other practices, right? Because, for example, journalism now is in crisis in the sense that people don't believe that there's any one sort of single truth and that there's a sort of willful kind of change in the facts and or willful kind of obstruction of the facts. And you look at what happens with climate change where the facts simply don't matter. And the fact that we're in some ways we are living in our bright future, right? Of like everybody is literate, everybody can read, everybody has access to the Internet. And in some ways it's a shambles because everything is just kind of fragmented and everybody's got their own reality. So I want to be careful not to sort of make claims for data visualization just because there's going to be, I just think we have to be really careful because we don't want to go down that same road of like, just because people are more visually literate doesn't mean the world gets any better, you know? I mean, I think we sort of, especially when we were first as a practice, starting to get our legs under, underneath us. And I mean, the kind of whole field of data visualization, there was a sense that if you could just make the data clearer than everything else falls into place. And what that doesn't do is address power, is address politics, any of the kind of real world messy problems. So for me, the issue is less how to make all the data much clearer, but how to kind of be. How to use that newfound clarity, you know, in the world, with the world engaged with the world and the processes that happen in it to make good things happen. So. And I think that's actually worth. It's worth being explicit about that, because we have. We haven't as a field.",
      "id": "ep_48_ut_72"
    },
    {
      "end": 3267624,
      "speaker": "Enrico Bertini",
      "start": 3238610,
      "text": "And one thing I'm always wondering is also, I remember in the early days of Internet, there was a lot of talking about digital literacy or something like that. I think there might be actually. There was a big divide, right. You can actually find large segments of the. Of the population. That was illiterate. Right. And I'm wondering if in the future we will have this problem with data literacy. We might actually see that some parts of the population are not literate enough and there might actually be a big divide there.",
      "id": "ep_48_ut_73"
    },
    {
      "end": 3276028,
      "speaker": "Eric Rodenbeck",
      "start": 3272364,
      "text": "Fascinating. I mean. Yeah, it's. We gotta. We gotta work on that.",
      "id": "ep_48_ut_74"
    },
    {
      "end": 3293638,
      "speaker": "Enrico Bertini",
      "start": 3276076,
      "text": "Yeah, absolutely. Yeah, yeah, yeah. I had a similar discussion, I think, in the previous episode with Moritz. The idea of trying to teach something already to kids, because they're probably ready to learn a lot of these things. Right. I don't know if you have any experience teaching school.",
      "id": "ep_48_ut_75"
    },
    {
      "end": 3294166,
      "speaker": "Moritz Stefaner",
      "start": 3293726,
      "text": "Right.",
      "id": "ep_48_ut_76"
    },
    {
      "end": 3296494,
      "speaker": "Enrico Bertini",
      "start": 3294270,
      "text": "Yeah, they should start in school, ideally.",
      "id": "ep_48_ut_77"
    },
    {
      "end": 3310584,
      "speaker": "Eric Rodenbeck",
      "start": 3296574,
      "text": "Yeah, yeah, totally. Yeah. No, I have a. I have a three year old boy, and I have a number of atlases for children in the house. And it's just, you know, when he comes to me and says, papa, will you read a map? That's awesome.",
      "id": "ep_48_ut_78"
    },
    {
      "end": 3312740,
      "speaker": "Enrico Bertini",
      "start": 3312124,
      "text": "Yeah.",
      "id": "ep_48_ut_79"
    },
    {
      "end": 3314588,
      "speaker": "Eric Rodenbeck",
      "start": 3312852,
      "text": "Papa, can we look at maps together?",
      "id": "ep_48_ut_80"
    },
    {
      "end": 3319572,
      "speaker": "Enrico Bertini",
      "start": 3314756,
      "text": "Yeah. We should write something about how to teach this to kids. That would be really, really great.",
      "id": "ep_48_ut_81"
    },
    {
      "end": 3323180,
      "speaker": "Eric Rodenbeck",
      "start": 3319708,
      "text": "No, I know, man. It's just like, it's so cool. It's like, it's. And why not?",
      "id": "ep_48_ut_82"
    },
    {
      "end": 3328060,
      "speaker": "Enrico Bertini",
      "start": 3323252,
      "text": "Yeah. Yeah. Okay. I think we should wrap it up. Right?",
      "id": "ep_48_ut_83"
    },
    {
      "end": 3328500,
      "speaker": "Moritz Stefaner",
      "start": 3328212,
      "text": "Cool.",
      "id": "ep_48_ut_84"
    },
    {
      "end": 3328692,
      "speaker": "Eric Rodenbeck",
      "start": 3328532,
      "text": "Yeah.",
      "id": "ep_48_ut_85"
    },
    {
      "end": 3330984,
      "speaker": "Moritz Stefaner",
      "start": 3328708,
      "text": "That was fantastic. Thanks so much, Eric.",
      "id": "ep_48_ut_86"
    },
    {
      "end": 3332674,
      "speaker": "Enrico Bertini",
      "start": 3331574,
      "text": "Thanks a lot.",
      "id": "ep_48_ut_87"
    },
    {
      "end": 3335154,
      "speaker": "Eric Rodenbeck",
      "start": 3333934,
      "text": "Nice talking to you.",
      "id": "ep_48_ut_88"
    },
    {
      "end": 3336434,
      "speaker": "Enrico Bertini",
      "start": 3335494,
      "text": "Thank you.",
      "id": "ep_48_ut_89"
    },
    {
      "end": 3339074,
      "speaker": "Eric Rodenbeck",
      "start": 3337574,
      "text": "Bye bye.",
      "id": "ep_48_ut_90"
    },
    {
      "end": 3372454,
      "speaker": "Enrico Bertini",
      "start": 3345134,
      "text": "Data stories is brought to you by click, who allows you to explore the hidden relationships within data that lead to insights that ignite good ideas. Let your instincts lead the way to create personalized visualizations and dynamic dashboards with Qlik sense, which you can download for free at www. Dot clic dot de stories. That's q l I K Datastories.",
      "id": "ep_48_ut_91"
    }
  ],
  "confidence": 0.93271489288326,
  "audio_duration": 3388,
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_status_code": null,
  "webhook_auth": false,
  "webhook_auth_header_name": null,
  "speed_boost": false,
  "auto_highlights_result": null,
  "auto_highlights": false,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_audio_quality": null,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "content_safety": false,
  "iab_categories": true,
  "content_safety_labels": {
    "status": "unavailable",
    "results": [],
    "summary": {}
  },
  "language_detection": false,
  "language_detection_threshold": null,
  "language_confidence": null,
  "custom_spelling": null,
  "throttled": false,
  "auto_chapters": true,
  "summarization": false,
  "summary_type": null,
  "summary_model": null,
  "custom_topics": false,
  "topics": [],
  "speech_threshold": null,
  "speech_model": "best",
  "chapters": [
    {
      "summary": "Data stories is brought to you by Qlik, who allows you to explore the hidden relationships within data that lead to insights that ignite good ideas. Everybody takes a time off work and plays in the snow. That was just perfect. Nothing special.",
      "gist": "Snow and Data Stories",
      "headline": "Data stories is brought to you by Qlik, who allows you to explore hidden relationships",
      "start": 200,
      "end": 103740,
      "id": "ep_48_ch_0"
    },
    {
      "summary": "Today we have a really super special guest. Eric Rodenbeck talks about the last ten years of stamen. Now, if you have the chance, go to the Vimeo link and first watch the EYEO Talk.",
      "gist": "Super Special Guest",
      "headline": "Today we have a really super special guest, Eric Rodenbeck",
      "start": 103772,
      "end": 201594,
      "id": "ep_48_ch_1"
    },
    {
      "summary": "Is there still a need for creating highly bespoke and crafty data visualizations? Or do you feel 95% of data visualization challenges maybe can be tackled now in standard tools?",
      "gist": "The need for bespoke data visualizations",
      "headline": "Is there still a need for bespoke and crafty data visualizations",
      "start": 202414,
      "end": 433754,
      "id": "ep_48_ch_2"
    },
    {
      "summary": "The field of data visualization has changed a lot in the last 14 years. The technology has gotten much, much easier, but also the set of expectations that people bring to it. The market is just more sophisticated than it used to be.",
      "gist": "The Big Labs Project",
      "headline": "Data visualization has become much more sophisticated than it used to be",
      "start": 434174,
      "end": 855120,
      "id": "ep_48_ch_3"
    },
    {
      "summary": "In the United States, we've reached this point where cities are going mainstream. What happens when these edgy things become, become well settled? What is the opportunity there?",
      "gist": "Data visualization: Has it Gone Mainstream?",
      "headline": "Is data visualization going mainstream a good thing or bad thing",
      "start": 855232,
      "end": 1137994,
      "id": "ep_48_ch_4"
    },
    {
      "summary": "There's this great text from Michael Neymar on first word art, last word art. He posits that there's two great ways to do a great artwork. Both types are super interesting to work with. Maybe we're just right in between.",
      "gist": "First Word Art vs. Last Word Art",
      "headline": "Michael Neymar says there are two great ways to do great artwork",
      "start": 1139414,
      "end": 1211642,
      "id": "ep_48_ch_5"
    },
    {
      "summary": "If we started to hold our data visualizations to the same standard as we held our comic books, I think we would really have some wonderful, some wonderful work. Maybe we do pop up books of data visualization?",
      "gist": "Data Visualization: The Genres",
      "headline": "You start to talk about genre. When you start to think about a crime novel",
      "start": 1211698,
      "end": 1315914,
      "id": "ep_48_ch_6"
    },
    {
      "summary": "Qlik Sense pairs Qlik's market proven data indexing engine with the ability to drag and drop visualizations into your dashboard. It lets you rapidly create visualizations, explore data deeply, and reveal connections instantly. You can access your analytics on the go or on a tablet and a smartphone.",
      "gist": "Qlik Sense",
      "headline": "Qlik Sense lets you easily create personalized visualizations and dynamic dashboards",
      "start": 1317494,
      "end": 1405236,
      "id": "ep_48_ch_7"
    },
    {
      "summary": "What is the best way to build data visualization? What's the best team size? Is there something different to building data visualizations process wise than doing media projects in general? Any advice there for anybody getting started?",
      "gist": "How to Build a Data Visualization Project",
      "headline": "Any advice there for anybody getting started with data visualization projects",
      "start": 1405300,
      "end": 1778116,
      "id": "ep_48_ch_8"
    },
    {
      "summary": "How large are the teams in stamen? Do you also have sometimes projects where you have seven people or ten in one project? Or is it always small, very agile teams?",
      "gist": "What Makes a Stamen Project?",
      "headline": "How large are the teams in stamen? Do you also have sometimes projects",
      "start": 1778180,
      "end": 1913446,
      "id": "ep_48_ch_9"
    },
    {
      "summary": "Eric Schmidt: I was really impressed by the part where you said, I think it's toward the end of your talk, you say, why I'm still here. And I'm really curious to hear. is there a way I can have some sort of impact on the world with what I'm doing?",
      "gist": "Eric Schmidt on Why He's Still Here",
      "headline": "Eric Stern: I'm really curious about why you're still working",
      "start": 1913510,
      "end": 1986294,
      "id": "ep_48_ch_10"
    },
    {
      "summary": "There is an urgency that I feel around conservation, around climate change, around communicating what's going on on the planet. I think this whole issue of cities and how to live in them is also something that's one of the kind of dominant, if not the dominant issues of our time.",
      "gist": "In the Elevator With Scientists",
      "headline": "There's an urgency around conservation, around climate change, around cities",
      "start": 1990654,
      "end": 2158194,
      "id": "ep_48_ch_11"
    },
    {
      "summary": "When data visualization works really well, it takes something that is hidden or invisible or complex or difficult and makes it extremely clear. We're doing a project right now about slavery in the American south. If you can be shown them in a way that kind of short circuits your brain and kind of makes a real impact, that's the goal.",
      "gist": "Data visualization has an impact",
      "headline": "Data visualization can have a huge impact on the world, you say",
      "start": 2158274,
      "end": 2326888,
      "id": "ep_48_ch_12"
    },
    {
      "summary": "When you publish a project on the web, do you have any specific method through which you know exactly how people use your information? We sponsor an educational initiative called Map Time. There's not enough culture yet to ensure that this is happening afterwards.",
      "gist": "Mapping the Web: The Case for Public Participation",
      "headline": "When you publish a project on the web, do you know exactly how people use it",
      "start": 2327056,
      "end": 2718180,
      "id": "ep_48_ch_13"
    },
    {
      "summary": " Damon: There's a bit of an obsession with people who make stuff. But behind everyone is an invisible infrastructure of labor that is mostly performed by women. Damon: Do you think there will always be this mixture of maybe making and community building?",
      "gist": "Making and the Data Industry",
      "headline": "Damon: I think there's an obsession with making stuff",
      "start": 2718212,
      "end": 2969464,
      "id": "ep_48_ch_14"
    },
    {
      "summary": "The studio is trying to build a technological and creative practice that's more inclusive. The more people exposed to visualizations, the more they will realize they will be pretending more information. The issue is less how to make all the data much clearer, but how to use that newfound clarity in the world.",
      "gist": "Data Visualization: The Big Challenge",
      "headline": "What do you think is the biggest gap we need to fill in data visualization",
      "start": 2970204,
      "end": 3329732,
      "id": "ep_48_ch_15"
    },
    {
      "summary": "Data stories is brought to you by click, who allows you to explore the hidden relationships within data. Let your instincts lead the way to create personalized visualizations and dynamic dashboards with Qlik sense.",
      "gist": "Data Stories",
      "headline": "Data stories lets you explore hidden relationships within data that lead to insights",
      "start": 3329828,
      "end": 3372454,
      "id": "ep_48_ch_16"
    }
  ],
  "disfluencies": false,
  "entity_detection": false,
  "sentiment_analysis": false,
  "sentiment_analysis_results": null,
  "entities": null,
  "speakers_expected": null,
  "summary": null,
  "custom_topics_results": null,
  "episode_num": 48,
  "episode_metadata": {
    "speakers": [
      "Moritz Stefaner",
      "Enrico Bertini",
      "Eric Rodenbeck"
    ],
    "WPid": "247",
    "url": "https://datastori.es/podlove/file/600/s/feed/c/mp3/data-stories-48-vis-going-mainstream-w-stamens-ceo-eric-rodenbeck.mp3",
    "episode_title": "Vis Going Mainstream w/ Stamen's CEO Eric Rodenbeck"
  }
}