{
  "id": "ae36ee5a-dd84-43ef-a78c-609363c4e79d",
  "language_model": "assemblyai_default",
  "acoustic_model": "assemblyai_default",
  "language_code": "en_us",
  "status": "completed",
  "audio_url": "https://datastori.es/podlove/file/2886/s/feed/c/mp3/81-information-review.mp3",
  "utterances": [
    {
      "end": 43304,
      "speaker": "Enrico Bertini",
      "start": 4800,
      "text": "This episode of data stories is sponsored by Freshbooks, the small business accounting software that makes your accounting tasks easy, fast and secure. Freshbooks is offering a month of free and restricted use to all of our listeners. To claim your free month of freshbooks, go to freshbooks.com Datastories, where you can sign up for free and without the use of a credit card. Remember to enter data stories in the section titled I heard about freshbooks from at signup. Once again, the URL to claim your free month is freshbooks.com Datastories.",
      "id": "ep_82_ut_0"
    },
    {
      "end": 66018,
      "speaker": "Moritz Stefaner",
      "start": 62724,
      "text": "Hey, everyone. New data stories. Enrico.",
      "id": "ep_82_ut_1"
    },
    {
      "end": 74882,
      "speaker": "Enrico Bertini",
      "start": 66106,
      "text": "Hey, how's it going? Very good, very good, very good. This new title, music is energizing.",
      "id": "ep_82_ut_2"
    },
    {
      "end": 76610,
      "speaker": "Moritz Stefaner",
      "start": 74978,
      "text": "Yeah. Still grooving along?",
      "id": "ep_82_ut_3"
    },
    {
      "end": 79450,
      "speaker": "Enrico Bertini",
      "start": 76762,
      "text": "Yeah, it's good. It's good.",
      "id": "ep_82_ut_4"
    },
    {
      "end": 84706,
      "speaker": "Moritz Stefaner",
      "start": 79562,
      "text": "So today we are trying something new. It's just the two of us, like, back in the day.",
      "id": "ep_82_ut_5"
    },
    {
      "end": 86454,
      "speaker": "Enrico Bertini",
      "start": 84770,
      "text": "Back in the day, old days.",
      "id": "ep_82_ut_6"
    },
    {
      "end": 116318,
      "speaker": "Moritz Stefaner",
      "start": 88314,
      "text": "We're trying a new format. Yeah. So, because we like to go to conferences. Everybody likes to go to conferences, right? I mean, at least once in a while, but you cannot go to all of them. I tried it for a few years, but it doesn't work. And then you have this long list of videos you want to watch. Right? So maybe on Vimeo or on YouTube. Everybody has these really long queues of watch later videos.",
      "id": "ep_82_ut_7"
    },
    {
      "end": 117142,
      "speaker": "Enrico Bertini",
      "start": 116466,
      "text": "Yeah.",
      "id": "ep_82_ut_8"
    },
    {
      "end": 130794,
      "speaker": "Moritz Stefaner",
      "start": 117278,
      "text": "Of really long conference talks, but you never manage. Right. So if only somebody would go about and summarize them for you, that would be totally awesome. Right, Enrico?",
      "id": "ep_82_ut_9"
    },
    {
      "end": 132574,
      "speaker": "Enrico Bertini",
      "start": 131254,
      "text": "Yes. And that's.",
      "id": "ep_82_ut_10"
    },
    {
      "end": 135086,
      "speaker": "Moritz Stefaner",
      "start": 132614,
      "text": "That would be like a dream. A dream come true. No.",
      "id": "ep_82_ut_11"
    },
    {
      "end": 138554,
      "speaker": "Enrico Bertini",
      "start": 135190,
      "text": "Yeah. And that's exactly what we are about to do.",
      "id": "ep_82_ut_12"
    },
    {
      "end": 144208,
      "speaker": "Moritz Stefaner",
      "start": 138974,
      "text": "Oh, no, that's amazing. That's brilliant.",
      "id": "ep_82_ut_13"
    },
    {
      "end": 145244,
      "speaker": "Enrico Bertini",
      "start": 144256,
      "text": "That's brilliant.",
      "id": "ep_82_ut_14"
    },
    {
      "end": 176766,
      "speaker": "Moritz Stefaner",
      "start": 145664,
      "text": "Whose idea was that? Yeah, no, the idea came about because we had this episode on the information plus conference, which was really good. But Enrico, for instance, wasn't there. Right. And so we talked about it with Isabel and I've been there at the conference. And so we thought maybe we can do something with the videos and with the audio and try and summarize a few of the talks of that conference and. Yeah. So have you listeners take part in it and get the gist of some of the talks?",
      "id": "ep_82_ut_15"
    },
    {
      "end": 177594,
      "speaker": "Enrico Bertini",
      "start": 176870,
      "text": "Yeah.",
      "id": "ep_82_ut_16"
    },
    {
      "end": 180574,
      "speaker": "Moritz Stefaner",
      "start": 178134,
      "text": "Yeah. So shall we try that out?",
      "id": "ep_82_ut_17"
    },
    {
      "end": 200086,
      "speaker": "Enrico Bertini",
      "start": 180614,
      "text": "Yeah. We created a selection, right? We selected three main talks. And what we are going to do is to play, let's say, some excerpt or snippets from these talks and we will provide some comments at the end of them.",
      "id": "ep_82_ut_18"
    },
    {
      "end": 255074,
      "speaker": "Moritz Stefaner",
      "start": 200150,
      "text": "Yep. Yeah. And we just picked three of them. We could have picked three other ones. I mean, all of them are great. You should definitely, after you listen to this and you like the snippets we provide, go to the website, and I hope they have the videos up by then because there's full talk videos, and then you can also, like, view and listen to a view of the other ones. But these three we picked are really good, and I personally enjoyed them quite a bit. And it ranges from, like, the topics go really from data literacy, which we like to discuss quite a bit as well, to proving the value of visual design and science communication. So that's, for me, a recurring topic, really, like, how can we improve science visuals? Two, finally, how we can bring designers and Wikipedia together, and how these two worlds can play together or not. And so I think these were three really, really insightful talks on that.",
      "id": "ep_82_ut_19"
    },
    {
      "end": 256038,
      "speaker": "Enrico Bertini",
      "start": 255374,
      "text": "Yeah.",
      "id": "ep_82_ut_20"
    },
    {
      "end": 296444,
      "speaker": "Moritz Stefaner",
      "start": 256166,
      "text": "So starting with the first one. The first one is from Catherine D'Ignazio. She's an assistant professor of data visualization and civic media at Emerson College and a research affiliate at the MIT center for Civic Media. And Catherine is a really cool person. She's super energetic, very smart, and she gave a really, really good talk titled Creative Data Literacy, bridging the gap between the data haves and have nots. Yeah, let's listen to parts of it. We have a few minutes prepared, and then we can discuss it a bit. So let's dive right in.",
      "id": "ep_82_ut_21"
    },
    {
      "end": 787884,
      "speaker": "Catherine D’Ignazio",
      "start": 297824,
      "text": "What I want to talk about, really, today, when I'm talking about data literacy, I'm talking about it for a specific audience. I'm really talking about it for a more mainstream, less technical audience than probably is represented here. I think we have to remember William Gibson's awesome quote where he says, the future is already here. It's just not very evenly distributed, the folks who are working with data. So the folks, like probably those of us in this room, are not representative of the population as a whole. So that means, like women, racial, ethnic, sexual minorities, these folks are underrepresented in these spheres, just as they are in technology as a whole. So it's sort of not surprising, in a way. And so the argument for inclusion is, of course, that it's the right thing to do and to not just have part of the population holding the keys to producing knowledge for the rest of the population. But it's also that if we have more diversity at the table, the subjects that we study, the decisions that we make and visualize and represent to the world will represent a wider range of concerns. We'll choose different topics. So, given this, this is a kind of, like, background, and I want to kind of ground the background of data literacy in a kind of politics of, like, this is the background politics into which we enter when we think about how do we scale data literacy? How do we teach data literacy? Because I don't know about you guys, but I want to take seriously the aspirations of the open data movement, that it might empower people, that it might empower citizens. But this basic inequality of systems of data collection, sharing, analysis, and meaning making is something I think we can't ignore when we're talking about how do we scale up? How do we think about teaching people outside of this world? Tools of data gathering, analysis, and visualization. And so here's where I really want to just walk you all through five design strategies. Don't really have an answer, but I have some design strategies of how we might think about employing creative data literacy for empowerment. So, the first is such a no brainer, but in the context of broadening the scope and broadening the audience for data, we can think carefully about what data sets are used for teaching purposes. So, and working with community centered data, for example, there's this project, Local Lotto in 2014, which this used the theme of the state lottery to teach mathematical concepts and data analysis and probability. And so this was to high school students. And so high school students actually went out in their local neighborhood, a neighborhood that they have deep context for, they have relationships in, and they explored the social issues surrounding the lottery and analyzed the impact of the lottery on local neighborhoods with this idea of, like, they're learning simultaneously these quantitative skills, these data analysis and processing skills, but then they're also actually applying those to their real contextualized lives. The curriculum is based around the idea that connecting that quantitative data analysis with the impact of the lottery with qualitative research that the students did by interviewing shopkeepers and people purchasing tickets, could then help students connect large scale patterns with real world phenomena, the quantitative work in a context. Second design strategy is write data biographies. And so, what's a data biography? The data biography might be the story of how the data set came to be. And so often when we are teaching data literacy, we start with some of these test data sets. There's, like, here's some data. And it happens at the beginning of the process. And so then we work forwards from there, and we say, okay, let's find the story in the data, or find some multiple stories in the data. So, the issue with this is that it presumes the data is good. It presents it as this decontextualized object, and it seems to just have come from nowhere. And so what writing data biographies looks like is actually going backwards in time, a data biography will cover, like, who collected the data? How? For what purpose? How is it used? By whom? What are its impacts? What's it used for? What kinds of decision making processes is it used for? On whom? Who does it affect? And most importantly, maybe, what are its known limitations? This is often something that's so obscured to us when we just kind of download these random things from the Internet. Third design strategy is making data messy. This would seem really counter intuitive. And so in this case, this relates, again to this idea of not starting with teaching people about data by starting with a data set, but rather by reaching back in time to the point of collection and categorization and introducing people to this messy process of creating and categorizing data in the face of uncertainty and complexity. This process is important. It's important to understand how difficult it is to capture and categorize things about the world, how many different decisions you could have made about how you categorize things. Learners often, especially beginning people who are starting out, they have the impression that data is just true. Like, if it's in a spreadsheet, it's just true. And that particularly goes for quantitative data. But then if you take them through the process of data collection and categorization and creating standards, this introduces the way that goals, interest, politics, kind of the lens that you are focusing your attention on how these play out when you create data. All right, so building learner centered tools, this one's really for the developers and the designers in the rooms. So rather than building tools that generate these kind of quick, flashy visualizations, how can we think about prioritizing features that scaffold a learning process for people that are new in this space? What happens with a lot of the tools that are out there right now is that they really prioritize making quick pictures rather than introducing novices to terminology or to the process of doing data visualization and the behind the scenes we have outlined, my colleague Rahul and I have outlined, what does this mean to be learner centered in the space of tools for data? And so this is geared around this idea of being focused, guided, inviting and expandable. Finally, would be favoring creative, community centered outputs over sort of what we might call tuftian purity, which is not to say there's not something bad about being sort of economic or whatever, but it might just not be the right output for all people in all situations and being sensitive to that, that like we are doing cultural communication and we're not operating in a universal culture. And then there's this term, which I love called data visceralization. This is a term from a colleague of mine named Kelly Dobson at RISD. And this has to do with the ways in which we might make data felt at a more bodily level. It might not just be for our eyes, it might not just be for our heads, it might be for our bodies. And so a good example of this, together with an artist friend of mine, we did a walking data visualization where we actually noticed that the map of the coastline of Boston in 1630 is quite similar to what it's projected to look like in 2100 if we have the worst of the climate change models realized. And so what does that mean? Like, what does that mean for people? When you look at a map is one thing, but when you actually walk it and say, like, here you are in relation, the coast is very far away. We actually traced that coastline with our bodies, and we had little micro lectures along the way. So we had the guy who's the head of climate adaptation for the mayor, we had the head of research for the Boston harbor association. And, folks, were these signs that are contributed by my friend Erin day Sutton, and actually ended up stenciling messages on the Boston common about the future towards the end.",
      "id": "ep_82_ut_22"
    },
    {
      "end": 797614,
      "speaker": "Enrico Bertini",
      "start": 789384,
      "text": "Yeah. Oh, my God, Moritz. We could go on forever just walking through the five points.",
      "id": "ep_82_ut_23"
    },
    {
      "end": 801934,
      "speaker": "Moritz Stefaner",
      "start": 799514,
      "text": "Yeah, it's a whole PhD thesis.",
      "id": "ep_82_ut_24"
    },
    {
      "end": 804334,
      "speaker": "Enrico Bertini",
      "start": 802794,
      "text": "Even more than one.",
      "id": "ep_82_ut_25"
    },
    {
      "end": 850544,
      "speaker": "Moritz Stefaner",
      "start": 805354,
      "text": "I guess so, too. No, really dense talk, and also really good. I just love the perspective she brings to that and how she illustrates her points with examples really well. And this general idea to that. Yeah, we need to make sure data visualization is much more inviting to all kinds of people and not just a specific crowd, is a super important one. And, yeah, and she also has some really good ideas of how that can happen. There's also the website databasic IO, I think, that we will link from the show notes. And there you can find a lot of, like, very simple, robust tools to make sense out of data real quick and. Yeah. Which are great for workshops and getting people started in database.",
      "id": "ep_82_ut_26"
    },
    {
      "end": 852704,
      "speaker": "Enrico Bertini",
      "start": 850624,
      "text": "Yeah, no, absolutely.",
      "id": "ep_82_ut_27"
    },
    {
      "end": 854250,
      "speaker": "Moritz Stefaner",
      "start": 852824,
      "text": "What are your thoughts on this stuff?",
      "id": "ep_82_ut_28"
    },
    {
      "end": 987864,
      "speaker": "Enrico Bertini",
      "start": 854352,
      "text": "We've been discussing literacy for quite a while now, and it's one of the most important topics out there. I don't know. I remember when I was much, much younger, people used to talk about the digital literacy or digital divide. Now we are in the data literacy and data divide era. Right. And, yeah, I mean, I think one aspect is, on the one hand, we need to teach people how to read information that has been extracted out of data and think with data, even before being able to generate data, create new charts out of it, create an argument out of data. I think it's very important to work on the input side of literacy, helping people figure out that, as Catherine said, when you see numbers, it almost feels like it's true. Right. And it's not. Right. We all know, I mean, if you work in this space for a while, you know that a number is not necessarily a representation of reality. So I think that's one of the major points there. Yeah. And what else can I say? I like all the five design strategies that she talks about. As I said, we could talk forever about each one. I really like the idea of actually actively creating the data so that you understand that data is not necessarily reality. Right. I think that's a major thing. And another aspect that I think is interesting, I think for almost all of the five points, I kept thinking, oh, that's the same thing I would do with a kid. I would actually do exactly the same thing to teach a kid how to deal with data. So, yes, literacy is huge, and we need to figure out how to. Yeah. What kind of strategies work best. And I think that's a very good starting point.",
      "id": "ep_82_ut_29"
    },
    {
      "end": 995796,
      "speaker": "Moritz Stefaner",
      "start": 988484,
      "text": "Yeah. Really good perspectives there. And, yeah, maybe we should have on for a full episode at some point.",
      "id": "ep_82_ut_30"
    },
    {
      "end": 1105548,
      "speaker": "Enrico Bertini",
      "start": 995900,
      "text": "Yeah, yeah, absolutely. So looking at my notes, another thing that I really like is this idea of data biography. Right. Some people more technically call it data provenance. Provenance in technicales and. Yeah, but that's also huge and reminds me of a book that I read a few years back. It's called poor numbers. I don't know if you remember that, Moritz. I think we discussed that a few years back. It's a statistician who basically went around third world countries and trying to figure out how statistics are, are collected there. Right. And so you might think that that's a minor thing, but it's not because, yeah, organizations like the United nations are actually making decisions on what to do next and how to do it based on these numbers. Right. So it turns out that numbers in the west, or say, quote unquote, advanced countries are very detailed, very precise, and do reflect some reality. And when you look into how data is collected in these countries is not reliable at all. It's a huge mess. And it does have an impact on what kind of policies are then designed for these countries. And I think this is where Catherine has a point. The way we deal with literacy has a political aspect attached to it, we almost have to. Yeah, it's. It's a very important topic. Very, very important. With clear consequences.",
      "id": "ep_82_ut_31"
    },
    {
      "end": 1188324,
      "speaker": "Moritz Stefaner",
      "start": 1105716,
      "text": "Yeah, absolutely. Yeah. It also reminds me, I just read last week an article called three reasons counting is the hardest thing in data science. And, you know, it seems so basic, but, like, actually, all these little political or biased decisions that go into what do we count and how and what makes up these basic numbers that end up in a spreadsheet are super important. And this article is really nice we should link it to, and it just shows, for instance, just basic things like how many computer science students were they at UNC Charlotte last year? Even such a simple question you can think a lot about, do we count also part time students? What about students that enrolled super long? Or, you know, like, do we count all the unique individuals enrolled over the course of a year? Or what do we do if two students are enrolled for just half a year, you know, and they don't overlap, like, and you only get a sense for all these difficulties and how you might exclude some perspectives or, you know, how you leave something out if you actually do the counting yourself. And this. Yeah, and this is exactly this point. You need to at least have been in that situation a couple of times to understand how bad it might look in the rest of the datasets.",
      "id": "ep_82_ut_32"
    },
    {
      "end": 1236830,
      "speaker": "Enrico Bertini",
      "start": 1188744,
      "text": "Yeah, yeah, yeah. Absolutely. Absolutely. So, well, thanks, Catherine, for the amazing talk, and maybe we should try to gather on the show sometime soon and go more in depth through these points. These are all amazing points. So the next one we want to talk about is from Karen Cheng. She's a professor of visual communication, communication design at University of Washington. And the title of her talk is proving the value of visual design in scientific communication. And that's another very important topic. I have been working a little bit in this space myself, so that's one of the reasons why I really like this talk. So I think we can just dive right in.",
      "id": "ep_82_ut_33"
    },
    {
      "end": 1238634,
      "speaker": "Moritz Stefaner",
      "start": 1236902,
      "text": "Yeah, let's listen to it.",
      "id": "ep_82_ut_34"
    },
    {
      "end": 1578772,
      "speaker": "Karen Cheng",
      "start": 1239734,
      "text": "We together got an NSF grant, which was all about trying to help nanotechnology scientists and engineers improve visual communication, their own ability to communicate visually. So Marco is from Italy, and so Marco is always talking about Galileo and how Galileo is such a special kind of scientist because he had a degree in design from the University of Florence as well as a science degree from the University of Pisa. And that enabled him to utilize both of those parts of our culture in his drawings. And that if you look at this particular paper in nature, nanotechnology, which is one of the leading journals of nanotechnology, at least 40% of the paper is made up of figures. So. And I guess figures are now becoming seen by scientists and engineers as an important way to attract attention to your research. There is a new paper being published every 20 seconds, so that's just a tremendous increase in the volume of science being put out there. So it's very important as a scientific researcher to try to get people to see your science. And one of the ways that scientists and publishers have developed to kind of deal with the flood of information is this thing called graphical abstracts. They're also called table of contents images, and they're also called overview figures. So most of these journals in each issue would publish maybe like 70, 80, 90 individual papers, each of which would be accompanied by this TOC graphic. So a lot of these editors of journals have been really trying to convince scientific authors to take these TOC images seriously. So you can see, you know, not everybody likes this idea. And if you've tried to publish, you know, it is really a difficult thing to publish in a scientific journal. You have to come up with an idea for a study. You have to get money for that study, you have to run the study, you have to get data that's worth it to analyze. You have to analyze that data, then you have to write it up, then finally you submit it to a journal. So the fact that they were asking people to also make a ToC image is kind of a burden. A lot of scientists learn to make visual images simply by copying what they see. And sometimes they're copying what they see from people who also don't have visual design training. Felice Frankl, who is a MIT research scientist and a. A scientific photographer, she postulated in this commentary in nature a different reason why perhaps scientists have difficulty with the visual language in general. So she talked about in this that sometimes she'd be at conferences like these, and people would put up beautiful images of science, and that people would have to run them down and say, oh, here's another pretty picture. And that it was kind of a label for appealing images that really didn't have value in science, that there's this kind of understood sort of subtext that attractive representations of science shouldn't be taken seriously. This computer scientist, Doctor McNerney, also mentioned that a lot of people say, you know, scientists would say, if you spend time on your visuals, that's time you're not taking developing the actual science, you know, so that's kind of depressing as a visual designer. So part of our grant, Marco and I talked a lot about how can we explain what design is and prove that design matters? And actually, one of his graduate students, Yi Qi Chen, said, we should do a study. We should actually redesign scientific graphics and show that the redesign makes a significant difference to scientists. So we decided that we would try to do that. We chose ten that we thought had the most potential for redesign, that were ones that we had the ability to redo. And so, basically, first I would read the paper with Ichi, who is a chemistry post doc, and then we would try to usually work on the structure. You know, was there a way to basically reorganize the composition into just left to right, top to bottom, like, kind of really simple? And then, of course, try to use contrast to draw attention to the most important message. So, you can see, a lot of what we're doing is simply making the infographics as simple as possible. And so I think of this as just being a lot like this best selling book, you know, the magic of tidying up. And so I don't know if you know this book, but she says, get out everything you own, you know, and then thank it for helping you, and then get rid of it, you know? You know? So sometimes here, we're just cleaning up, you know, you're like, okay, let's put the glasses together. Let's put the cups together. Right? And that's a lot to do with chunking the idea that we remember a phone number better when we chunk it into those three parts as opposed to a series of seven numbers. So when I saw this one, I thought, this container is made of some purple stuff, and here's the purple stuff. Right? But then when we actually read the article, they just like purple. Right? Like, that's not. Yeah, like. Cause that's not it at all. This picture is this gold thing. Let's make the color of the thing the same as the color of the thing. So then the method, we got 50 participants, faculty, post docs, and grad students. And so there was an online survey. Ten pages. Researcher names were redacted. Basically, these are the results. So, with our redesign, there is statistically significant better sense of what the paper will be about, and the title and the figure make more sense together.",
      "id": "ep_82_ut_35"
    },
    {
      "end": 1579396,
      "speaker": "Moritz Stefaner",
      "start": 1578908,
      "text": "Okay.",
      "id": "ep_82_ut_36"
    },
    {
      "end": 1609584,
      "speaker": "Karen Cheng",
      "start": 1579460,
      "text": "And then people believed the paper would be written more clearly, which makes sense if you can understand the figure. You think, okay, they're probably better writers. And also, they thought the paper seemed more interesting. And then what was really neat is that they thought the authors were more intelligent, you know? And also they thought the science seemed more rigorous. So what's great is actually using these simple design principles actually made scientists look smarter. They were afraid they'd look pretty and dumb, but they actually looked good and smart.",
      "id": "ep_82_ut_37"
    },
    {
      "end": 1616744,
      "speaker": "Moritz Stefaner",
      "start": 1612924,
      "text": "Isn't this what every scientist wants, to look good and smart?",
      "id": "ep_82_ut_38"
    },
    {
      "end": 1622644,
      "speaker": "Enrico Bertini",
      "start": 1617684,
      "text": "Yeah. Lots of ego going on there.",
      "id": "ep_82_ut_39"
    },
    {
      "end": 1633860,
      "speaker": "Moritz Stefaner",
      "start": 1622804,
      "text": "Yeah, no, but it's such an interesting point she's making there. And I'm super happy they went through the effort of actually doing the study because, like, from a, like, plausibility point of view, everybody agrees.",
      "id": "ep_82_ut_40"
    },
    {
      "end": 1634052,
      "speaker": "Enrico Bertini",
      "start": 1633892,
      "text": "Yeah.",
      "id": "ep_82_ut_41"
    },
    {
      "end": 1672994,
      "speaker": "Moritz Stefaner",
      "start": 1634068,
      "text": "A better figure is probably, you know, or it's worth redesigning figures professionally, but that they would actually go through the effort of measuring the effect of, like, are these papers more successful in the end? Are they perceived better? I think that's really valuable. And I know that phenomenon, which I like to call the dump blonde syndrome quite well, that scientists feel if their figures look too good, they might come off as too polished, and then people don't take the science so serious.",
      "id": "ep_82_ut_42"
    },
    {
      "end": 1682656,
      "speaker": "Enrico Bertini",
      "start": 1673154,
      "text": "Yeah, no, I agree. Absolutely. And I mean, did you invent this idea of dumb, blunt phenomenon or you read it somewhere?",
      "id": "ep_82_ut_43"
    },
    {
      "end": 1685524,
      "speaker": "Moritz Stefaner",
      "start": 1682800,
      "text": "I think I read it some way, yeah. But it's quite striking.",
      "id": "ep_82_ut_44"
    },
    {
      "end": 1741818,
      "speaker": "Enrico Bertini",
      "start": 1686424,
      "text": "Yeah, no, absolutely. I've noticed it myself too. I've been working with a few scientists as well and trying to teach them or help them create better visualizations. But I have to say that I think good scientists are receptive to the idea of good strategies for visual communication. They do care very deeply about communicating complex ideas in a way that can be easily consumed. Right. I think the problem is to. I think one of the problems that there is not a lot of material out there that people can say, a scientist, a busy scientist, can very quickly go through and learn how to create better or effective charts. Right. Or visual representations in general.",
      "id": "ep_82_ut_45"
    },
    {
      "end": 1802710,
      "speaker": "Moritz Stefaner",
      "start": 1741866,
      "text": "I mean, there are not enough courses at universities for sure. And. Yeah, that's true. But one thing I can recommend, and Karen Chang also mentions it in the talk, I think, is the book by Feliz Franco, visual strategies. Yeah. And it features a lot of these case study like before and after redesigns with, like, a rationale, like what does the graphic try to show? What is problematic about the original figure and how did they improve it? And I think if you just go through that book really consciously, I think that a lot of the basic principles, as Karen also mentions, like a lot, is about chunking, that people see immediately what belongs together, sort of establishing these mental hooks or mental bridges in some form, being really conscious about. Yeah. Color and what people will just see when they first look at a graphic. And I also love this reference to the magic of tidying up, because it's such a nice.",
      "id": "ep_82_ut_46"
    },
    {
      "end": 1803334,
      "speaker": "Enrico Bertini",
      "start": 1802902,
      "text": "Yeah.",
      "id": "ep_82_ut_47"
    },
    {
      "end": 1807566,
      "speaker": "Moritz Stefaner",
      "start": 1803374,
      "text": "Way to think about these things. Like, yeah, it's a tidying exercise in many ways, too.",
      "id": "ep_82_ut_48"
    },
    {
      "end": 1943244,
      "speaker": "Enrico Bertini",
      "start": 1807630,
      "text": "So, yeah, there are lots of good parallels there. Yeah, yeah. Another thing I want to say is that, I mean, we are in a era where for science, there are a lot of big changes, and I think we are transitioning between a situation where science was very much something like that scientists did and very isolated. Right. And then maybe there is some people, like science journalists, who are translating what scientists do for the public. Right. But the problem is that right now we are, as she says, we are flooded with information coming from the labs throughout the country. So if you are a scientist, you have to find a way to make your papers and research material easily available and digestible and comprehensible and so on. This is true for myself as well. In our small niche of visualization research, you can clearly see that there are lots of efforts out there to make our papers, our ideas available on the web. Yeah. Say an image in the first page of the paper, so that it's a combination. I mean, part of it is advertising, and part of it is really trying to communicate better, complex ideas better. And you can also see it in some of the best scientists out there. Right. Some of the best scientists do really care really deeply about their communication strategy. So one person that comes to mind is Barabbasi, for instance. Right. He has an amazing strategy in his lab on how to communicate information coming from the lab. And he's also smart at hiring a person like Kim, who is a top notch person in. And so he goes right as far as hiring a really good designer for the lab so that this person can internally digest this information and translate it in a way that as many people as possible can consume it. I think that's very important.",
      "id": "ep_82_ut_49"
    },
    {
      "end": 1952244,
      "speaker": "Moritz Stefaner",
      "start": 1943664,
      "text": "Yeah, yeah. And also, props to the nano physics journal for having visual Abstract. Yeah, I think that's a really good idea.",
      "id": "ep_82_ut_50"
    },
    {
      "end": 1957282,
      "speaker": "Enrico Bertini",
      "start": 1952914,
      "text": "The visual table of contents is amazing. It should be a standard everywhere, right?",
      "id": "ep_82_ut_51"
    },
    {
      "end": 1966394,
      "speaker": "Moritz Stefaner",
      "start": 1957378,
      "text": "Yeah, that it's clear. This is one key figure for that paper. That is a really good summary. I mean, that's super smart. So I'm glad this thing exists.",
      "id": "ep_82_ut_52"
    },
    {
      "end": 1994244,
      "speaker": "Enrico Bertini",
      "start": 1966474,
      "text": "Yeah, yeah, yeah. And before we conclude, I just want to mention another resource that is, I always, always loved, and I think it should be more popular. There is an amazing set of articles published by Bengwa, who is a designer in the Broad institute at MIT. I guess he's still there. And he used to publish in nature. These very nice little articles called points of view.",
      "id": "ep_82_ut_53"
    },
    {
      "end": 1995816,
      "speaker": "Moritz Stefaner",
      "start": 1994584,
      "text": "It's just one page.",
      "id": "ep_82_ut_54"
    },
    {
      "end": 2031302,
      "speaker": "Enrico Bertini",
      "start": 1995880,
      "text": "It's one or two pages. One very specific topic. I guess there should be a collection of these articles somewhere. We will definitely link them in the show notes. And it's amazing. I think Beng did an amazing job at summarizing a few important practical concepts. And I guess a scientist wants to learn the basics, right? Very little rules on how to improve his or her design skills. That's a very, very, very good source.",
      "id": "ep_82_ut_55"
    },
    {
      "end": 2155532,
      "speaker": "Moritz Stefaner",
      "start": 2031438,
      "text": "Yeah, I agree. Really good one. This is a good time to take a little break and talk about our sponsor this week. So this episode of data stories is sponsored by Freshbooks, the small business accounting software that makes accounting tasks easy, fast, and secure. And this week I want to talk about invoicing a bit. If you're a freelancer or you run your own company, you know, the paperwork is always a huge hassle. And Freshbooks has created a super intuitive tool that makes creating and sending invoices extremely simple. Using freshbooks, it takes about 30 seconds to create and send an invoice invoice. You can customize them so you can add your own logo or your color scheme so that it's a bit more personal and the invoice reflects your brand. There's really nice features so the clients can pay you online, which can seriously improve how quickly you get paid. Obviously, freshbooks can even show you whether or not a client has even looked at the invoice you've emailed, so you might want to follow up if they don't even look at it. But freshbooks can also send late payments reminders to your clients automatically, which is nice. So that means you don't have to chase down clients personally, which is always a bit awkward. And you can also use the freshbooks deposits feature, which streamlines how you invoice for money upfront when you're kicking off a project. And this is, of course, always something you should do. Get a contract and get some payment upfront so you have less risk as a freelancer. So go to freshbooks.com Datastories and you can get a free month, totally free. No credit card required. Just entered data stories in the section titled I heard about freshbooks from at signup. And yeah, we hope you like the tool. And back to the show. So, shall we move on to the last talk? So this one's from Michele Mauri. He's a research fellow at the Polytechnic University of Milan Politecnico Milano Politecnico di Milano.",
      "id": "ep_82_ut_56"
    },
    {
      "end": 2161594,
      "speaker": "Enrico Bertini",
      "start": 2155708,
      "text": "Di Milano di Milano, yeah. Moritalian on the show, and he's with.",
      "id": "ep_82_ut_57"
    },
    {
      "end": 2180906,
      "speaker": "Moritz Stefaner",
      "start": 2161634,
      "text": "Paolo Ciuccarelli, who we also had on the show already he's heading the density design lab. And Michael is associated with that. And he presented a really interesting study or experiment they did. And the title was called why designers should care about Wikipedia. So let's dive right in.",
      "id": "ep_82_ut_58"
    },
    {
      "end": 2181614,
      "speaker": "Enrico Bertini",
      "start": 2180970,
      "text": "Yep.",
      "id": "ep_82_ut_59"
    },
    {
      "end": 2696264,
      "speaker": "Michele Mauri",
      "start": 2182954,
      "text": "The idea is that as assignment students, instead of writing a paper, they improve a Wikipedia page or they create a new one on the course topic. And we saw a great potential in bringing this kind of assignment. Also in design education, Wikipedia has plenty of diagrams and many of them are not the best one. So there is room to improve them and to create new ones. The assignment was really broad. So produce a useful diagram and we ask them to select something they know and look on Wikipedia. If there is a lack of diagram on that particular topic, and in the case, create a diagram and upload it. The second one is follow the standards. And actually on Wikipedia there are no standards. Rather there are good practices identified by the user. So we say to the standard student, try to identify which are the best practices. The third one is the most important is follow the ethic. Wikipedia is the encyclopedia that anyone can edit. And so this means that anyone can modify the contents. And so rather than authors, we are contributors. And this was something new, at least for our students, because they are used to be recognized as the author. And the last one is engage with the community. So the assignment is not over. When you create the diagram, you have to upload it on Wikipedia and engage with the community for its inclusion in the page. So which kind of discussion there were on Wikipedia? Kind of discussion was about clarity of the content of the diagram. So Wikipedia users were quite clear, if the diagram doesn't add new information, is not useful at all. Another kind of debate was about size of diagrams. So many diagrams were refused because the were too big for the Wikipedia user interface. It opened a question, so should we design diagrams for the current Wikipedia user interface? So keeping in mind this interface, or should we try to go beyond that in the creation of diagrams? Another kind of discussion was on the complexity of diagrams. Some diagrams were rejected because too complex. But the last kind of debate was the most interesting for me and it was about originality of the research. And we can frame it as a question, is the visual rearrangement of information, new information on itself? And, well, it's important because on Wikipedia no original research is one, one of the main pillar. Why? Because many people edit Wikipedia is not possible to verify their knowledge on the topic. So if you write a Wikipedia page, if you claim something, you have to cite a proper source. And I didn't expect it that this was so relevant also for images. And, well, there was a discussion of the originality of this research, research. But in the end, one of the users said, okay, but we should apply the usual Wikipedia rule, so this image can be improved, so we can include it in the page and then improve it over time. But in the end, it was rejected because according to the other Wikipedia users, the policy applies to text, which are simple to edit, not to images, because it's really difficult to edit images. And I think that it's really interesting because images are seen as black boxes, as something that you cannot really modify and improve. And actually it's true, because while we have some well known strategies for the collaborative creation of text, next, we don't have proper solution for the collaborative creation of diagrams. It's interesting because one of the main feedback from our student was about technical constraints, because on Wikipedia you can upload only PNG or SVG files. And even worse, on Wikipedia you can use just a subset of fonts, which are not really nice. And for our students, this was really crazy. Not being able to select the font that they prefer was something really, really difficult to accept. The second kind of feedback we had from our students is that the comments are not really constructive. This could be a sort of challenge, because at least our students are not used to get this kind of feedback on their work. And I think that we should see a sort of challenge for them, so to see how their work is accepted in the public. So, concluding what we learned from this experience. So, first of all, we want to involve other Wikipedia users before the exercitation. And on Wikipedia it's possible to create projects. The second one is try to adopt a more Wikipedia approach to the design of diagrams and so on. The design process, the question is, how can we create truly open diagrams? And I think that the answer is that, first of all, we have to change our perspective. So if we are contributors, we are doing just part of a bigger work that someone else will bring on, will continue to modify it, translate it, and do a lot of stuff. So we have to identify, for this reason, we have to identify proper technical and conceptual solutions. So technical solution means adopting technologies that are simple to edit, like SVG, are better than raster images. Okay, but in case of animations, what kind of technologies should we use on Wikipedia? Or in the case of diagrams with lot of images inside, what kind of solution we have to identify the technical solution for all these cases, and from the conceptual point of view, means that we have to create structures that are simple to be understood by other people, so they are able to download it, open it, and understand the structure and modify it. Well, the second reflection is still an open, open question is related to this question or this matter of original research. So if the creation of a diagram, how should we handle it on Wikipedia? So how can we provide solidity to our visual arguments? And or for example, is it possible to cite in a diagram, how can we do that? We cannot answer to this question on our own and we should get involved in the Wikipedia community to define both technical solution and also policies and new rules that applies specifically to diagrams.",
      "id": "ep_82_ut_60"
    },
    {
      "end": 2703676,
      "speaker": "Moritz Stefaner",
      "start": 2697524,
      "text": "Yes, very fascinating perspective. I never really thought about that. Have you thought about the diagrams on Wikipedia?",
      "id": "ep_82_ut_61"
    },
    {
      "end": 2705584,
      "speaker": "Enrico Bertini",
      "start": 2703740,
      "text": "No, not at all. No.",
      "id": "ep_82_ut_62"
    },
    {
      "end": 2753286,
      "speaker": "Moritz Stefaner",
      "start": 2706164,
      "text": "Same here. First of all, I really love this idea that this is a student assignment, that they need to go out there and sort of fight the good fight on Wikipedia. Wikipedia, I think it's tough, but it's really cool because they see how design is being perceived or they will need to defend their design also, not only towards their teacher, but to the people who are really invested in a topic. So I think that's pretty awesome. This general question, can diagrams and visualizations be made in a collaborative way? And what are the best formats, what are the best policies? Super interesting. I never thought about it this way. So to me that was a really inspiring talk in a way.",
      "id": "ep_82_ut_63"
    },
    {
      "end": 2779868,
      "speaker": "Enrico Bertini",
      "start": 2753350,
      "text": "Oh yeah, absolutely. I think that's somewhat unexplored space. How do you actually create diagrams collaboratively? And of course you have one problem that is purely technical. How do you do it from the technical standpoint point, right. Which means how do you actually create tools that facilitate these kind of collaborations? Right, that's clearly.",
      "id": "ep_82_ut_64"
    },
    {
      "end": 2800710,
      "speaker": "Moritz Stefaner",
      "start": 2779916,
      "text": "But I mean, SVG is a start in a sense that it's a text based format and it can be diffed. So you can determine what the changes were in an SVG file. It's fairly readable. So yeah, this could work. I mean, but yeah, we're not there at all. I mean, that's clear. But I could see how this could work in principle.",
      "id": "ep_82_ut_65"
    },
    {
      "end": 2844834,
      "speaker": "Enrico Bertini",
      "start": 2800862,
      "text": "Yeah, no, absolutely. And I think one question is whether diagrams become better and better the more people you have editing them. Right. That's another issue. But I think this reminds me a couple of initiatives that we have seen recently and in the past as well. I think there is of course the help me vis blog and that used to do something similar, posting a given data visualization problem. And having multiple peoples trying to redesign the chart and then figuring out which solution is best. Right. I don't know if it's still active, by the way.",
      "id": "ep_82_ut_66"
    },
    {
      "end": 2846350,
      "speaker": "Moritz Stefaner",
      "start": 2845414,
      "text": "I'm not sure either.",
      "id": "ep_82_ut_67"
    },
    {
      "end": 2907572,
      "speaker": "Enrico Bertini",
      "start": 2846422,
      "text": "Yeah, I'm not sure either. And I think there is another similar initiative from. So this is called. Let me see if I can find it. Makeover Monday. This is Andy Codgreeve from Tableau Software. Right. And they have been doing something similar, coming up with a small data set, a given chart that clearly doesn't look optimal. And a few people, I guess, use, I don't know if it's. You have to use Tableau to participate or not. I don't think so. And redesign the charts. Right. So these are two very interesting and related initiatives. But again, the technical problem is there, how do you facilitate this collaborative endeavor? Right, yeah. And I think another problem is versioning. I'm not aware of anything that gets closer to what we have with text for images in terms of versioning. Right.",
      "id": "ep_82_ut_68"
    },
    {
      "end": 2928010,
      "speaker": "Moritz Stefaner",
      "start": 2907628,
      "text": "Yeah. There were ideas. I remember the original visualized team. No, not visualizing.org dot. They were working on something where you could actually fork and change inversion data, graphics. I remember that. But it's a tough problem, of course.",
      "id": "ep_82_ut_69"
    },
    {
      "end": 2928934,
      "speaker": "Enrico Bertini",
      "start": 2928162,
      "text": "Yeah.",
      "id": "ep_82_ut_70"
    },
    {
      "end": 2956800,
      "speaker": "Moritz Stefaner",
      "start": 2929634,
      "text": "And this is just the technical part and the collaborative part. But then also what Michele talks about quite a bit is all these questions like, how do you cite diagrams? Or how do you say? Or how do you reference from a diagram into a text? Or how do you. Yeah. Make sure the information you show is, is accurate and. Yeah. How do you do the whole review process there? And so it's super interesting. Yeah, yeah.",
      "id": "ep_82_ut_71"
    },
    {
      "end": 2967164,
      "speaker": "Enrico Bertini",
      "start": 2956832,
      "text": "And by the way, it's not only the graphics. Every graphics has some data attached to it. Right, right. So exactly the same. You have exactly the same problem with the, with the data part of it.",
      "id": "ep_82_ut_72"
    },
    {
      "end": 2984388,
      "speaker": "Moritz Stefaner",
      "start": 2967244,
      "text": "Yeah, yeah, yeah. Very interesting. But I think, yeah, as a student exercise, it's perfect. They have to, like, find a complex topic, find a good illustration, and then fight for it. But then if it works, you know, maybe it gets translated into like 50 different languages and suddenly appears everywhere.",
      "id": "ep_82_ut_73"
    },
    {
      "end": 2984644,
      "speaker": "Michele Mauri",
      "start": 2984436,
      "text": "Right.",
      "id": "ep_82_ut_74"
    },
    {
      "end": 3005294,
      "speaker": "Moritz Stefaner",
      "start": 2984684,
      "text": "So it's. I think it can be super rewarding as well. So. Yeah. But it raises a lot of really interesting questions. Maybe we should redesign Wikipedia graphic yourself or listeners, if you have some time, grab your favorite article and see if you can remake the charts there. There's a lot to be done there, I think.",
      "id": "ep_82_ut_75"
    },
    {
      "end": 3007658,
      "speaker": "Enrico Bertini",
      "start": 3007194,
      "text": "Yeah.",
      "id": "ep_82_ut_76"
    },
    {
      "end": 3033372,
      "speaker": "Moritz Stefaner",
      "start": 3007706,
      "text": "So I think this concludes our little conference summary experiment. I hope you enjoyed it. Thanks so much to Destry Sibley for helping us with summarizing the talks down to this nice, concise form. Thanks so much. And yeah, let us know if you like the format. If we should cover more conferences in this form, we could do it once in a while. Well, if there's enough interest, of course. So let us know.",
      "id": "ep_82_ut_77"
    },
    {
      "end": 3042324,
      "speaker": "Enrico Bertini",
      "start": 3033428,
      "text": "Yeah, there are a few conferences coming up soon, so just let us know how much you like it and maybe even how we can improve it if something doesn't work.",
      "id": "ep_82_ut_78"
    },
    {
      "end": 3047868,
      "speaker": "Moritz Stefaner",
      "start": 3042364,
      "text": "Well, yeah, sounds good to me. That was fun. Thanks so much and see you soon.",
      "id": "ep_82_ut_79"
    },
    {
      "end": 3049052,
      "speaker": "Enrico Bertini",
      "start": 3047916,
      "text": "See you soon. Bye bye.",
      "id": "ep_82_ut_80"
    },
    {
      "end": 3050024,
      "speaker": "Moritz Stefaner",
      "start": 3049108,
      "text": "Bye bye.",
      "id": "ep_82_ut_81"
    },
    {
      "end": 3066670,
      "speaker": "Enrico Bertini",
      "start": 3057014,
      "text": "Hey guys, thanks for listening to data stories again. Before you leave, we have a request if you can spend a couple of minutes rating us on iTunes, that would be extremely helpful for the show.",
      "id": "ep_82_ut_82"
    },
    {
      "end": 3097468,
      "speaker": "Moritz Stefaner",
      "start": 3066782,
      "text": "And here's also some information on the many ways you can get news directly from us. We're, of course, on twitter@twitter.com. Datastories we have a Facebook page@Facebook.com, datastoriespodcast all in one word. And we also have an email newsletter. So if you want to get news directly into your inbox and be notified whenever we publish an episode, you can go to our homepage datastory es and look for the link that you find on the bottom in the footer.",
      "id": "ep_82_ut_83"
    },
    {
      "end": 3109560,
      "speaker": "Enrico Bertini",
      "start": 3097556,
      "text": "So one last thing that we want to tell you is that we love to get in touch with our listeners, especially if you want to suggest a way to improve the show or amazing people you want us to invite or even projects you want to us to talk about.",
      "id": "ep_82_ut_84"
    },
    {
      "end": 3155474,
      "speaker": "Moritz Stefaner",
      "start": 3109672,
      "text": "Yeah, absolutely. So don't hesitate to get in touch with us. It's always a great thing for us. And that's all for now. See you next time, and thanks for listening to data stories. This episode of data stories is sponsored by Freshbooks, the small business accounting software that makes accounting tasks easy, fast and secure. Freshbooks is offering a month of free, unrestricted use to all of our listings. To claim your free month, go to freshbooks.com Datastories where you can sign up for free and without a credit card. Remember to enter data stories in the section titled I heard about freshbooks from at signup. Once again, go to freshbooks.com Datastories to claim your free monthly.",
      "id": "ep_82_ut_85"
    }
  ],
  "confidence": 0.932683737067875,
  "audio_duration": 3155,
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_status_code": null,
  "webhook_auth": false,
  "webhook_auth_header_name": null,
  "speed_boost": false,
  "auto_highlights_result": null,
  "auto_highlights": false,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_audio_quality": null,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "content_safety": false,
  "iab_categories": true,
  "content_safety_labels": {
    "status": "unavailable",
    "results": [],
    "summary": {}
  },
  "language_detection": false,
  "language_detection_threshold": null,
  "language_confidence": null,
  "custom_spelling": null,
  "throttled": false,
  "auto_chapters": true,
  "summarization": false,
  "summary_type": null,
  "summary_model": null,
  "custom_topics": false,
  "topics": [],
  "speech_threshold": null,
  "speech_model": "best",
  "chapters": [
    {
      "summary": "Freshbooks is offering a month of free and restricted use to all of our listeners. To claim your free month, go to freshbooks. com Datastories. Remember to enter data stories in the section titled I heard about freshbooks from at signup.",
      "gist": "Free Month of Freshbooks for Small Businesses",
      "headline": "Freshbooks is the small business accounting software that makes your accounting tasks easy",
      "start": 4800,
      "end": 43304,
      "id": "ep_82_ch_0"
    },
    {
      "summary": "We're trying a new format. We selected three main talks. And what we are going to do is to play excerpt or snippets from these talks. We will provide some comments at the end of them. Have you listeners take part in it and get the gist of some of the talks?",
      "gist": " summation of the Information + Conference",
      "headline": "Today we are trying something new. We're trying a new format. Hey, how's it going",
      "start": 62724,
      "end": 256038,
      "id": "ep_82_ch_1"
    },
    {
      "summary": "Catherine D'Ignazio is an assistant professor of data visualization and civic media at Emerson College. She gave a talk titled Creative Data Literacy, bridging the gap between the data haves and have nots. Let's listen to parts of it and then discuss it a bit.",
      "gist": "Catherine D'Ignazio on Data Literacy",
      "headline": "Catherine D'Ignazio gave a talk on data literacy at Emerson College",
      "start": 256166,
      "end": 296444,
      "id": "ep_82_ch_2"
    },
    {
      "summary": "How do we scale data literacy? How do we teach data literacy for a more mainstream audience? Here are five design strategies of how we might think about employing creative data literacy.",
      "gist": "5 Design Strategies for Data Literacy",
      "headline": "How do we scale data literacy to reach a broader audience",
      "start": 297824,
      "end": 639580,
      "id": "ep_82_ch_3"
    },
    {
      "summary": "Moritz: How can we think about prioritizing features that scaffold a learning process for people that are new in this space? He says we need to make sure data visualization is much more inviting to all kinds of people. Moritz: Finally, would be favoring creative, community centered outputs.",
      "gist": "Building learner centered data visualization tools",
      "headline": "Building learner centered tools for data visualization is really important",
      "start": 639772,
      "end": 852704,
      "id": "ep_82_ch_4"
    },
    {
      "summary": "We are in the data literacy and data divide era. I think it's very important to work on the input side of literacy. I like all the five design strategies that she talks about. Maybe we should have on a full episode at some point.",
      "gist": "Data Literacy and the Digital Divide",
      "headline": "We've been discussing data literacy for quite a while now",
      "start": 852824,
      "end": 998424,
      "id": "ep_82_ch_5"
    },
    {
      "summary": "How data is collected in third world countries is not reliable at all. And it does have an impact on what kind of policies are then designed for these countries. All these little political or biased decisions that go into what do we count are super important.",
      "gist": "Data Bio and Its Political Dimension",
      "headline": "Political decisions that go into what do we count are super important in data science",
      "start": 999084,
      "end": 1204084,
      "id": "ep_82_ch_6"
    },
    {
      "summary": "Karen Cheng is a professor of visual communication, communication design at University of Washington. The title of her talk is proving the value of visual design in scientific communication. She and her colleague Marco got an NSF grant to help nanotechnology scientists and engineers improve visual communication.",
      "gist": "Karen Cheng on Visual Design in Scientific Communication",
      "headline": "Karen Cheng's talk proves the value of visual design in scientific communication",
      "start": 1204704,
      "end": 1741818,
      "id": "ep_82_ch_7"
    },
    {
      "summary": "One thing I can recommend is the book by Feliz Franco, visual strategies. If you are a scientist, you have to find a way to make your papers and research material easily available and digestible. Some of the best scientists do really care really deeply about their communication strategy.",
      "gist": "Visual Strategies for Scientists",
      "headline": "There are not enough courses on visual communication at universities, Karen Chang says",
      "start": 1741866,
      "end": 2033634,
      "id": "ep_82_ch_8"
    },
    {
      "summary": "This episode of data stories is sponsored by Freshbooks, the small business accounting software. Using freshbooks, it takes about 30 seconds to create and send an invoice invoice. Go to freshbooks. com Datastories and you can get a free month, totally free.",
      "gist": "Free File: Invoicing",
      "headline": "Data stories is sponsored by Freshbooks, the small business accounting software",
      "start": 2037374,
      "end": 2134460,
      "id": "ep_82_ch_9"
    },
    {
      "summary": "As assignment students, instead of writing a paper, they improve a Wikipedia page or they create a new one on the course topic. When you create the diagram, you have to upload it on Wikipedia and engage with the community for its inclusion in the page. Should we design diagrams for the current Wikipedia user interface?",
      "gist": "Why Design Students Should Care About Wikipedia",
      "headline": "Michael Moritalian presents a talk on why designers should care about Wikipedia",
      "start": 2134532,
      "end": 2736054,
      "id": "ep_82_ch_10"
    },
    {
      "summary": "Can diagrams and visualizations be made in a collaborative way? And what are the best formats and best policies? There's a lot to be done there, I think. But it raises a lot of really interesting questions.",
      "gist": "Can diagrams and visualizations be made in a collaborative way?",
      "headline": "This general question, can diagrams and visualizations be made in a collaborative way",
      "start": 2737634,
      "end": 3007658,
      "id": "ep_82_ch_11"
    },
    {
      "summary": "So I think this concludes our little conference summary experiment. Thanks so much to Destry Sibley for helping us with summarizing the talks down to this nice, concise form. Let us know if you like the format. If we should cover more conferences in this form.",
      "gist": " Conference Summary Experiment",
      "headline": "This concludes our little conference summary experiment. I hope you enjoyed it",
      "start": 3007706,
      "end": 3059822,
      "id": "ep_82_ch_12"
    },
    {
      "summary": "Before you leave, we have a request if you can spend a couple of minutes rating us on iTunes. Here's also some information on the many ways you can get news directly from us. We love to get in touch with our listeners, especially if you want to suggest a way to improve the show.",
      "gist": "How to Subscribe to Data Stories Podcast",
      "headline": "Before you leave, we have a request if you can spend a couple of minutes rating us on iTunes",
      "start": 3059958,
      "end": 3118884,
      "id": "ep_82_ch_13"
    },
    {
      "summary": "Freshbooks is offering a month of free, unrestricted use to all of our listings. To claim your free month, go to freshbooks. com Datastories. Remember to enter data stories in the section titled I heard about freshbooks from at signup.",
      "gist": "Data Stories",
      "headline": "Freshbooks is offering a month of free, unrestricted use to all listings",
      "start": 3122504,
      "end": 3155474,
      "id": "ep_82_ch_14"
    }
  ],
  "disfluencies": false,
  "entity_detection": false,
  "sentiment_analysis": false,
  "sentiment_analysis_results": null,
  "entities": null,
  "speakers_expected": null,
  "summary": null,
  "custom_topics_results": null,
  "episode_num": 82,
  "episode_metadata": {
    "speakers": [
      "Enrico Bertini",
      "Moritz Stefaner",
      "Catherine D’Ignazio",
      "Karen Cheng",
      "Michele Mauri"
    ],
    "WPid": "722",
    "url": "https://datastori.es/podlove/file/2886/s/feed/c/mp3/81-information-review.mp3",
    "episode_title": "Information+ Conference Review"
  }
}