{
  "id": "eb16d1ea-fce1-49a9-9fbb-ef157bd1fb39",
  "language_model": "assemblyai_default",
  "acoustic_model": "assemblyai_default",
  "language_code": "en_us",
  "status": "completed",
  "audio_url": "https://datastori.es/podlove/file/318/s/feed/c/mp3/Datastories-31.mp3",
  "utterances": [
    {
      "end": 13010,
      "speaker": "Enrico Bertini",
      "start": 4840,
      "text": "Hi everyone. Data stories number 31, the first episode in 2014. Hi, Moritz, how are you?",
      "id": "ep_31_ut_0"
    },
    {
      "end": 15214,
      "speaker": "Moritz Stefaner",
      "start": 13470,
      "text": "Hey, Enrico. Splendid.",
      "id": "ep_31_ut_1"
    },
    {
      "end": 15726,
      "speaker": "Andy Kirk",
      "start": 15302,
      "text": "How are you?",
      "id": "ep_31_ut_2"
    },
    {
      "end": 20410,
      "speaker": "Enrico Bertini",
      "start": 15758,
      "text": "Splendid. Wow. Fantastico.",
      "id": "ep_31_ut_3"
    },
    {
      "end": 29678,
      "speaker": "Moritz Stefaner",
      "start": 21550,
      "text": "I had long vacations and I feel really refreshed. So I was a bit down at the end of 2013. It was a long year for me and lots of work.",
      "id": "ep_31_ut_4"
    },
    {
      "end": 31250,
      "speaker": "Enrico Bertini",
      "start": 29734,
      "text": "Don't tell me. I'm jealous.",
      "id": "ep_31_ut_5"
    },
    {
      "end": 35106,
      "speaker": "Moritz Stefaner",
      "start": 32290,
      "text": "I tweeted already. Everything feels much snappier now.",
      "id": "ep_31_ut_6"
    },
    {
      "end": 37274,
      "speaker": "Enrico Bertini",
      "start": 35178,
      "text": "Of course, it's always like that, right?",
      "id": "ep_31_ut_7"
    },
    {
      "end": 38110,
      "speaker": "Moritz Stefaner",
      "start": 37402,
      "text": "Yeah.",
      "id": "ep_31_ut_8"
    },
    {
      "end": 39522,
      "speaker": "Enrico Bertini",
      "start": 38850,
      "text": "Good, good.",
      "id": "ep_31_ut_9"
    },
    {
      "end": 40122,
      "speaker": "Moritz Stefaner",
      "start": 39586,
      "text": "How are you?",
      "id": "ep_31_ut_10"
    },
    {
      "end": 123190,
      "speaker": "Enrico Bertini",
      "start": 40186,
      "text": "I'm good. I didn't take too much rest, but I'm good, I'm good. I've been working a bit. I had some stuff to finish and yeah, I'm still in my office doing my job, but I hope to get kind of like one week off next week. So let's see, hopefully before the semester starts. So 2014 is going to be another all year for data stories. Yeah, that's going to be fun. That's going to be fun. So one thing we discussed, me and Moritz, if you're listening to that, is that for 2014, nothing is going to change. No, I'm joking. So what we want to change a little bit, we would like to get. No, it's actually true. We are not going to change anything special. But it be nice to increase the engagement from our listeners. We don't know who you are, what you want, and we realize that there's not enough connection between us and you. So two things. Yeah. At the end of each episode, you can always comment on that on our blog, datastory. Yes, we have a Twitter channel that is data stories. And we also have a Facebook channel. Right, Moritz, you're mostly taken care of?",
      "id": "ep_31_ut_11"
    },
    {
      "end": 126310,
      "speaker": "Moritz Stefaner",
      "start": 123330,
      "text": "Yeah, yeah. We have a Facebook page, we have a Google page.",
      "id": "ep_31_ut_12"
    },
    {
      "end": 151010,
      "speaker": "Enrico Bertini",
      "start": 126430,
      "text": "So if you are more into Facebook, more into Google or whatever, just go there and feel free to ask questions. So if there is anything you want us to discuss during the show, this can be just a simple question we answered at the beginning or even suggesting a whole episode or a specific person you would like to see on the show. Just try to connect with us. We would be happy to hear more from you. Okay. Don't be shy.",
      "id": "ep_31_ut_13"
    },
    {
      "end": 155656,
      "speaker": "Moritz Stefaner",
      "start": 151520,
      "text": "You can also send us an email if you don't want to make it public, send us directly an email.",
      "id": "ep_31_ut_14"
    },
    {
      "end": 160820,
      "speaker": "Enrico Bertini",
      "start": 155728,
      "text": "You can even insult us. You can even send bad words and whatever.",
      "id": "ep_31_ut_15"
    },
    {
      "end": 162520,
      "speaker": "Moritz Stefaner",
      "start": 161240,
      "text": "Or a passenger pigeon.",
      "id": "ep_31_ut_16"
    },
    {
      "end": 189736,
      "speaker": "Enrico Bertini",
      "start": 162600,
      "text": "Whatever. Whatever. Whatever. So let's see how this works. So, since this is the first episode of the new year, we have the tradition of going back through the past year, right? And see what are the main highlights and for doing that, we have two old friends of data stories. We have Andy Kirk from visualizing data. I'm already laughing. I don't know why I. Andy, hi, I'm Rico.",
      "id": "ep_31_ut_17"
    },
    {
      "end": 191712,
      "speaker": "Robert Kosara",
      "start": 189768,
      "text": "It's your old friend Andy.",
      "id": "ep_31_ut_18"
    },
    {
      "end": 194340,
      "speaker": "Moritz Stefaner",
      "start": 191856,
      "text": "Do you laugh because of old or because of friends?",
      "id": "ep_31_ut_19"
    },
    {
      "end": 196100,
      "speaker": "Robert Kosara",
      "start": 194720,
      "text": "Hello, guys. How you doing?",
      "id": "ep_31_ut_20"
    },
    {
      "end": 197840,
      "speaker": "Enrico Bertini",
      "start": 197240,
      "text": "Good.",
      "id": "ep_31_ut_21"
    },
    {
      "end": 198992,
      "speaker": "Moritz Stefaner",
      "start": 197960,
      "text": "Yeah. Great to have you.",
      "id": "ep_31_ut_22"
    },
    {
      "end": 200952,
      "speaker": "Enrico Bertini",
      "start": 199016,
      "text": "Don't fall from your chair, from your charity.",
      "id": "ep_31_ut_23"
    },
    {
      "end": 201336,
      "speaker": "Robert Kosara",
      "start": 201016,
      "text": "I'll try.",
      "id": "ep_31_ut_24"
    },
    {
      "end": 202992,
      "speaker": "Enrico Bertini",
      "start": 201368,
      "text": "Okay. You'll try?",
      "id": "ep_31_ut_25"
    },
    {
      "end": 203944,
      "speaker": "Moritz Stefaner",
      "start": 203056,
      "text": "And hello, Robert.",
      "id": "ep_31_ut_26"
    },
    {
      "end": 208146,
      "speaker": "Enrico Bertini",
      "start": 203992,
      "text": "And we have Robert Kosara. Hi, eager eyes. Hi, Robert.",
      "id": "ep_31_ut_27"
    },
    {
      "end": 211498,
      "speaker": "Andy Kirk",
      "start": 208178,
      "text": "Hello. Are you doing great?",
      "id": "ep_31_ut_28"
    },
    {
      "end": 238924,
      "speaker": "Enrico Bertini",
      "start": 211554,
      "text": "We are doing great. So we will try to go through the old 2013, trying to see what were the highlights. And NDR robbers will help us doing that. We have a full list of stuff we want to talk about. I don't know if we will manage to go through the old list. Let's just start. Right, who wants to start? Andy, you want to start with something? Highlights?",
      "id": "ep_31_ut_29"
    },
    {
      "end": 361220,
      "speaker": "Robert Kosara",
      "start": 239092,
      "text": "Yeah. It was a great year, was 2013. As you know, each month I do a roundup of the best of the previous month. And it was a great year. I felt it was generally a little bit quieter relative to the ongoing growth of the field. Mainly, I think because we didn't have those big landmark events like we had the previous year. With the Olympics and major elections in 2013, there was nothing really of that magnitude. So maybe some of the public work that was there in the past was not so visible. But certainly the direction of travel is still very positive. I mean, the first project that I think is on most of our radars at the start of last year was the workaround the guns project. The guns murders in the US by periscopic, which was. Which. It was great project, very much self initiated in response to the. It was December, I think, wasn't the disaster. So this was a great start to the year and a trend of these, I guess what you might describe as emotional visualisation projects. And it's something that Robert's picked up in his roundup of the year as well. And it really tried to find a new way to connect with people on highly emotive subject matter. And the style, the tone of voice was very, very powerful. But the story that underlied it was this sense of shock and magnitude of all these gun murders. And it seemed to capture the. Not the imagination in a positive sense, but certainly the amount of discussion points and the amount of conversations that triggered about the patterns that the filters enabled in the tool. So it's a truly exploratory visualization. I think it should the field at its best, really.",
      "id": "ep_31_ut_30"
    },
    {
      "end": 368700,
      "speaker": "Enrico Bertini",
      "start": 362080,
      "text": "So, Andy just in case someone is listening to the episode and doesn't know what this visualization is about, can you briefly describe it?",
      "id": "ep_31_ut_31"
    },
    {
      "end": 436560,
      "speaker": "Robert Kosara",
      "start": 369290,
      "text": "I mean, it began as an animated piece, so each person who was killed was illustrated as a kind of a single life arc. And when their life was extinguished, the kind of little dot that was being traced dropped the x axis, and then their projected life was continued. They'd use various kind of data sets to project people's potential life that had been stolen. And that was the focus, the stolen years. And then as the animation built up the speed, because it kind of introduces you, it kind of coaches you into looking, into learning how to look and read what's about to emerge. And this kind of buildup of lines and lines, month by month, it's kind of shocking, really, in how it runs through the twelve month period. And then when the animation is finished, you can take control, grab the mouse, and do different filters and kind of explorations, but also see that these lines are actually real people. You hover over it, you see a little pop up with a detail about that person's demographic, and it really kind of lifts it off the pages. You know, this is real people, not just stats or data points.",
      "id": "ep_31_ut_32"
    },
    {
      "end": 440080,
      "speaker": "Enrico Bertini",
      "start": 437020,
      "text": "So do you think this is more of a general trend you've been?",
      "id": "ep_31_ut_33"
    },
    {
      "end": 468440,
      "speaker": "Robert Kosara",
      "start": 441020,
      "text": "I think it's a trend in the sense that it has clearly inspired other works. I mean, we'll probably discuss some of the other projects. I mean, certainly the work by Wes Grubbs.at pitch interactive around the drone strikes was something that was, that he actually acknowledged was inspired or influenced in some ways by the gun murders project. So it's something that I think will be seen as a bit of a landmark project in terms of the approach and the style that it took.",
      "id": "ep_31_ut_34"
    },
    {
      "end": 497770,
      "speaker": "Moritz Stefaner",
      "start": 470420,
      "text": "I absolutely agree. The human side of data, on the one hand, I think that's something that kept us all thinking over the whole year, but also the storytelling techniques and all these new ways of bridging interactive, open experiences with a more guided storytelling approach. I think these are all things that really, for many people, played a bigger role this year. Or, Robert, how do you see it? You're the storytelling expert here.",
      "id": "ep_31_ut_35"
    },
    {
      "end": 572810,
      "speaker": "Andy Kirk",
      "start": 499350,
      "text": "Well, one thing I thought was really interesting is that the Huffington Post did a similar project, or not a similar project, but they did a project that was about the same data, which was gun murders in the US, and that was a map that kind of started in Newtown, Connecticut, where this school shooting had been at the end of 2012, and then zoomed out from there to show where all the other places where these things were happening. And that was also interesting because it was so much more, to me, it was more emotive or maybe a bit more. Less journalistic in a sense, than it would have otherwise been. So I thought that that might have been an influence from the Periscope project. So I thought that was pretty interesting. So I'm hoping, and I'm thinking we're going to see more of that kind of thing and see more kind of opinionated pieces where you have a stronger message behind the data and not just trying to show the data like you do in journalism, but really be more upfront about what you're trying to say and also more visceral and more, you know, kind of in your face, perhaps, but I think in a good way.",
      "id": "ep_31_ut_36"
    },
    {
      "end": 591922,
      "speaker": "Moritz Stefaner",
      "start": 572890,
      "text": "I think that applies also for simple graphics. Right. So it's more a certain stance you take as a publisher or as an editor, not, let's say, to hide yourself behind the data and say, I'm just plotting the data, my job is done here. But to take position, really, I think that's, that's happened for sure. Yeah.",
      "id": "ep_31_ut_37"
    },
    {
      "end": 600034,
      "speaker": "Enrico Bertini",
      "start": 592066,
      "text": "So are we, in a sense, trying to move away from this kind of feeling of objective truth that data is always surrounded about?",
      "id": "ep_31_ut_38"
    },
    {
      "end": 625026,
      "speaker": "Moritz Stefaner",
      "start": 600122,
      "text": "I mean, yeah, I think in general, the journalistic side of what we do has become much more, let's say, important, but also much more refined. And I think the journalists are catching up tremendously with us. And also we are sort of starting to think much more and more of me, at least maybe just personally like a journalist. Maybe that's the thing.",
      "id": "ep_31_ut_39"
    },
    {
      "end": 630890,
      "speaker": "Enrico Bertini",
      "start": 625218,
      "text": "So what are some other great pieces from, from the storytelling point of view that you've seen in 2013?",
      "id": "ep_31_ut_40"
    },
    {
      "end": 764560,
      "speaker": "Robert Kosara",
      "start": 633790,
      "text": "I mean, it's hard to look beyond the influence of snowfall, which was specifically at the end of 2012, I think, in terms of its release, but I think it was like the 28 December, so we can still include it. It's okay. But I mean, this, you know, it's had a great impact, and once again, that I don't think that was by any means the, the first long form digital journalism piece. I know for a fact there were other, from the Wall Street Journal before that, but once again, it had such a, such an effect until it being cascaded around social media and around the web. And it has, you know, spawned a lot of, in some respects, imitations, but also some other standout pieces that, in their own right, are fantastic pieces of this kind of long form digital journalism that, you know, really draws you in. It's the multimedia experience. You know, a lot of kind of parallax. Parallax scrolling features, embedded movies that don't even need playing. They just kick in the minute you reach that part of the screen. So that was definitely a major trend throughout 2013, and I can only see it continuing throughout this year, really. But once again, it reinforced the power and the appetite for storytelling in journalism, but also something we can learn in visualization. And I guess the other standout project around storytelling that was very much a popular piece was a YouTube video by actually quite an elusive author. I don't think anyone's really understood who created this piece, but it was about the wealth inequality, and it was just a very simple kind of video graphic. And I think the narration that goes with it added a lot of value to the storytelling factor, but it just nailed it. This is what storytelling is. I don't think anyone could ever really say a bad thing about it. It would be great for the person who created it to come out the shadows and reveal themselves.",
      "id": "ep_31_ut_41"
    },
    {
      "end": 771950,
      "speaker": "Moritz Stefaner",
      "start": 766330,
      "text": "Maybe it was Stephen Few. You never know.",
      "id": "ep_31_ut_42"
    },
    {
      "end": 775670,
      "speaker": "Enrico Bertini",
      "start": 773050,
      "text": "And then writing a piece against himself.",
      "id": "ep_31_ut_43"
    },
    {
      "end": 804050,
      "speaker": "Moritz Stefaner",
      "start": 776970,
      "text": "Exactly. Yeah. But I think we saw a lot of great stuff, really, from news outlets and newspapers. New York Times obviously, still doing fantastic stuff. I think Mike Bostock also really proved he can, he can do great beyond writing great frameworks, also do great data visualizations, and all his colleagues. Any other notes noteworthy trends in the newspaper area?",
      "id": "ep_31_ut_44"
    },
    {
      "end": 855180,
      "speaker": "Andy Kirk",
      "start": 806510,
      "text": "Well, I think the whole snowfall thing is obviously a good innovation, but I'm also a bit worried that it gets distracting and sometimes it's just too much. But there have been some things that were a bit more subtle. Like, there was one, this was, again, the New York Times. They had one, a story which is like a travel story from, I think, St. Petersburg to Moscow. And the. And as you were reading, and it was like a long scrolling thing, but there was a piece on the side that would stay there, which was a map, and it would essentially work like a scroll bar or like a progress bar. So as you were scrolling, it would kind of show you where you were along that journey. And I thought it was actually really good. That was a very simple but very effective Accurat project, and it wasn't.",
      "id": "ep_31_ut_45"
    },
    {
      "end": 856960,
      "speaker": "Robert Kosara",
      "start": 856440,
      "text": "Yeah.",
      "id": "ep_31_ut_46"
    },
    {
      "end": 858136,
      "speaker": "Andy Kirk",
      "start": 857040,
      "text": "Yes, yes. I think that's one.",
      "id": "ep_31_ut_47"
    },
    {
      "end": 858424,
      "speaker": "Moritz Stefaner",
      "start": 858168,
      "text": "Yeah.",
      "id": "ep_31_ut_48"
    },
    {
      "end": 940410,
      "speaker": "Andy Kirk",
      "start": 858472,
      "text": "Yeah. I really like that. I also think that there's a bit more. So I'm like many other people I know, mostly the things that the New York Times does and the Guardian and the Washington Post and maybe a few others, but there are actually a lot of newspapers out there and news media out there that do a lot of interesting work. That's just harder and it's not as visible as some of the other work. So there I was in Portland over the holidays and there was a piece there in a newspaper, the Oregonian, that I actually liked. I used this image in my state of infovis posting that it's a very simple scatterplot, but it actually tells a really interesting story. And I was actually surprised to find a paper that isn't the New York Times or the Washington Post using a scatterplot on not the front page, but on one of the front pages of one of the sections. So that was quite interesting to see that. And so I think there's a lot more of that happening now that's kind of spreading from those few high profile places into lots of other places. And Andy has done a really good job also of tracking some of the people who have been moving around from the New York Times to other places or, you know, just in different ways. And there's some interesting movements going on there and I think those are also helping spread knowledge, spread pollinator skills that are floating around there.",
      "id": "ep_31_ut_49"
    },
    {
      "end": 956010,
      "speaker": "Moritz Stefaner",
      "start": 940490,
      "text": "Yeah, that's true also. I mean, I have a more eurocentric perspective, of course, but last year I think the Zeit in Germany did some really nice things and I think they're still even collecting momentum. And also, of course, Neue Zürcher Zeitung.",
      "id": "ep_31_ut_50"
    },
    {
      "end": 960686,
      "speaker": "Enrico Bertini",
      "start": 956050,
      "text": "Nzdinh, the other few fantastic pieces.",
      "id": "ep_31_ut_51"
    },
    {
      "end": 961374,
      "speaker": "Andy Kirk",
      "start": 960878,
      "text": "Right.",
      "id": "ep_31_ut_52"
    },
    {
      "end": 971574,
      "speaker": "Moritz Stefaner",
      "start": 961462,
      "text": "And it's been an ongoing collaboration with interactive things and a few of these were really, really fine pieces. And I'm really looking forward to what comes in 2014.",
      "id": "ep_31_ut_53"
    },
    {
      "end": 1023276,
      "speaker": "Robert Kosara",
      "start": 971702,
      "text": "And I think on the other side of that, from the UK's perspective, I guess the Guardian has always been the flagship newspaper around data journalism to a certain extent. The departure of Simon Rogers and Alistair Dant and I think Michael Robinson, the former head of graphics there, he's no longer working there. It feels like the Guardian is actually much quieter now. It doesn't feel as much of a force as it did maybe twelve months ago and filling that void for next year. And we will discuss next year shortly. There's been a few appointments for Nate Silver's new project at ESPN, which could be a new interesting place for seeing some good developments in 2014. But that's for later, of course.",
      "id": "ep_31_ut_54"
    },
    {
      "end": 1033560,
      "speaker": "Enrico Bertini",
      "start": 1023388,
      "text": "And I think they've been hiring for data visualization experts. That's right Robert, I think you had a tweet some time ago about that.",
      "id": "ep_31_ut_55"
    },
    {
      "end": 1091306,
      "speaker": "Andy Kirk",
      "start": 1034580,
      "text": "Yeah, well, and the other thing is. So that is one thing. He's hiring people to do analysis and to do visualization but also the New York Times is essentially because he was. So Nate Silver had this 538 posting or blog, I would say this website that then went to the New York Times, but now he's moving on to ESPN. But the void he's leaving at the New York Times is being filled by people at the New York Times. They are starting off a little group, and I forget who else is in there, but I know that Amanda Cox is one of the people there. So there should be some really interesting work coming out of that once that's spun up and running. And I'm assuming they're going to be mostly, I don't know, but I'm assuming they're certainly going to be doing interesting work around the elections in the US this year, which are minor elections, but still, and I don't know what else they're up to, but it looks like an interesting group of people from that posting I saw a while ago. But that's, I think, something to watch.",
      "id": "ep_31_ut_56"
    },
    {
      "end": 1095150,
      "speaker": "Robert Kosara",
      "start": 1091378,
      "text": "Hopefully it'll help raise the New York Times profile because it's lacking.",
      "id": "ep_31_ut_57"
    },
    {
      "end": 1114278,
      "speaker": "Moritz Stefaner",
      "start": 1099790,
      "text": "But I think that's been a general trend that more and more institutions also I'm in touch with, they create these dedicated data visualization jobs or data editor jobs or things like that. And I think all of that is part of data visualization arriving and sort.",
      "id": "ep_31_ut_58"
    },
    {
      "end": 1118850,
      "speaker": "Enrico Bertini",
      "start": 1114294,
      "text": "Of becoming, like, out there, right?",
      "id": "ep_31_ut_59"
    },
    {
      "end": 1120270,
      "speaker": "Andy Kirk",
      "start": 1119870,
      "text": "Yeah.",
      "id": "ep_31_ut_60"
    },
    {
      "end": 1126574,
      "speaker": "Moritz Stefaner",
      "start": 1120310,
      "text": "I mean, it's the same struggle everybody has. Like, how do you explain your mom, what you're doing? And then you come up with funky.",
      "id": "ep_31_ut_61"
    },
    {
      "end": 1129178,
      "speaker": "Enrico Bertini",
      "start": 1126622,
      "text": "Job titles, you know, how do you call yourself?",
      "id": "ep_31_ut_62"
    },
    {
      "end": 1130554,
      "speaker": "Moritz Stefaner",
      "start": 1129234,
      "text": "I heard some people do that.",
      "id": "ep_31_ut_63"
    },
    {
      "end": 1132710,
      "speaker": "Robert Kosara",
      "start": 1130602,
      "text": "I still say chef. It's just easier.",
      "id": "ep_31_ut_64"
    },
    {
      "end": 1135258,
      "speaker": "Moritz Stefaner",
      "start": 1134410,
      "text": "Data chef.",
      "id": "ep_31_ut_65"
    },
    {
      "end": 1136390,
      "speaker": "Enrico Bertini",
      "start": 1135354,
      "text": "Data chef.",
      "id": "ep_31_ut_66"
    },
    {
      "end": 1179520,
      "speaker": "Robert Kosara",
      "start": 1136890,
      "text": "But that's also interesting. You know, looking beyond newspapers and institutions, I think in businesses, I think it's just starting to get that little bit momentum going as well. I think there's just anecdotally from the people I've kind of interacted with on my training workshops and consultancy projects, there are now starting to be deliberate attempts to organize analysts who perhaps previously fragmented around organizations into something more of a dedicated unit. I think actually, data science at the moment is probably the badge that they're using more specifically than visualization, but certainly the kind of consciousness and the awareness of this field is definitely penetrating into those worlds, I would say.",
      "id": "ep_31_ut_67"
    },
    {
      "end": 1189384,
      "speaker": "Enrico Bertini",
      "start": 1180120,
      "text": "So what is your perception of how visualization has changed in the area of business? I think you are more in contact with these people. Right, Andy?",
      "id": "ep_31_ut_68"
    },
    {
      "end": 1224988,
      "speaker": "Robert Kosara",
      "start": 1189472,
      "text": "Yeah, I mean, obviously, a lot of it's kind of off the radar because it is commercially sensitive often, and you can get beyond the doors to learn. But what I find from a market perspective is that they're still, or they are currently looking more towards self sufficiency. They're looking to be helped, coached, guided, trained into how to optimise the staff. They've already got more so than look outside for outsourcing of projects with agencies or studios. I'm sure that will come in time.",
      "id": "ep_31_ut_69"
    },
    {
      "end": 1240162,
      "speaker": "Moritz Stefaner",
      "start": 1225044,
      "text": "But that also means they see a long perspective there. Yeah, I think that's the good part. Maybe two years ago everybody was excited, but didn't know. Maybe it goes away. I think now it's much more like, okay, it will not go away. We have to.",
      "id": "ep_31_ut_70"
    },
    {
      "end": 1255950,
      "speaker": "Robert Kosara",
      "start": 1240226,
      "text": "And I think also as the awareness of what this is, they kind of think, actually, we're doing this already, we're just not doing it in a deliberate or sophisticated way. So I think it's more of an awareness issue as much as a need for it to be solved to them, really.",
      "id": "ep_31_ut_71"
    },
    {
      "end": 1270990,
      "speaker": "Enrico Bertini",
      "start": 1259010,
      "text": "Okay. So why don't we move on more into the area of new techniques or tools and stuff? You've seen that happening in 2013 that it's worth talking about.",
      "id": "ep_31_ut_72"
    },
    {
      "end": 1273322,
      "speaker": "Moritz Stefaner",
      "start": 1271610,
      "text": "Have we discovered a new diagram?",
      "id": "ep_31_ut_73"
    },
    {
      "end": 1274070,
      "speaker": "Enrico Bertini",
      "start": 1273426,
      "text": "Yeah.",
      "id": "ep_31_ut_74"
    },
    {
      "end": 1279154,
      "speaker": "Moritz Stefaner",
      "start": 1276290,
      "text": "Well, I think the knowledge nuggets.",
      "id": "ep_31_ut_75"
    },
    {
      "end": 1281682,
      "speaker": "Robert Kosara",
      "start": 1279162,
      "text": "Accurate studio are doing that every single week. Are they?",
      "id": "ep_31_ut_76"
    },
    {
      "end": 1283110,
      "speaker": "Moritz Stefaner",
      "start": 1281866,
      "text": "Tree spiral?",
      "id": "ep_31_ut_77"
    },
    {
      "end": 1309824,
      "speaker": "Robert Kosara",
      "start": 1283610,
      "text": "I mean, from my perspective, I just think that last year was the year of three particular techniques, maybe coming from 2012 as well. But slope graphs, I mean, everyone who reads my site wonder how. I love slope graphs, so I don't need to preach about them today. But slope graphs, connected scatter plots, which were, you know, very much around at the end of 2012 as well. But they seem to once again get some, some foothold in the, in the techniques.",
      "id": "ep_31_ut_78"
    },
    {
      "end": 1312496,
      "speaker": "Moritz Stefaner",
      "start": 1309872,
      "text": "That's all Alberto, it's all albeit and.",
      "id": "ep_31_ut_79"
    },
    {
      "end": 1356654,
      "speaker": "Robert Kosara",
      "start": 1312528,
      "text": "Hannah Fairfield before that. But Sankey's, you know, the old favorite Sankey diagram, I think, once again, that was seen as a yemenite, as a technique. And you know what all these do? What's common to all these is they all tell multiple stories, whether it's composition and flow sankeys, or whether it's rank absolute and the kind of connected time stories of slot graphs. So these seem to be penetrating. And it's interesting. You mention in your piece, Robert, about the scatter plot in the Oregon newspaper, I've seen on social media people talking about trying to convince their editors of the merits of using a scatterplot in a journalist, in a newspaper context. And maybe there's a bit more courage out there going beyond the tried and tested methods, and that can only be.",
      "id": "ep_31_ut_80"
    },
    {
      "end": 1359582,
      "speaker": "Enrico Bertini",
      "start": 1356662,
      "text": "A good thing, Robert, from your.",
      "id": "ep_31_ut_81"
    },
    {
      "end": 1400170,
      "speaker": "Andy Kirk",
      "start": 1359646,
      "text": "Yeah, well, also, I guess, things. Yeah. So things that aren't, that you can't easily label. Like Moritz did that b chart with the hexagonal things. That was some sort of combination bar chart and glyphs. And so I don't think there is an easy label for that. And the New York Times did one on where they looked at movies and movie trailers to see where in the movie different pieces for a trailer came from. And if they were in the same order, if the order had been reversed, that was excellent. And that was some sort of waterfall line chart, if you will. But it wasn't really. There wasn't a gun.",
      "id": "ep_31_ut_82"
    },
    {
      "end": 1404896,
      "speaker": "Moritz Stefaner",
      "start": 1400720,
      "text": "That's a bit more experimental double timeline connection thing.",
      "id": "ep_31_ut_83"
    },
    {
      "end": 1425424,
      "speaker": "Andy Kirk",
      "start": 1405008,
      "text": "Yeah. It's good to see that because it's a bit more experimentation and a bit more free form kind of work that doesn't just take the bar chart or the scatter plot or one of those things from our shelves and just use them, but think about what we want to do and come up with new ideas. So I really like that.",
      "id": "ep_31_ut_84"
    },
    {
      "end": 1434700,
      "speaker": "Enrico Bertini",
      "start": 1425552,
      "text": "So I have a question for you guys. How much of the design space do you think there is still out there to discover? This is something. I mean, visualization.",
      "id": "ep_31_ut_85"
    },
    {
      "end": 1440584,
      "speaker": "Robert Kosara",
      "start": 1438400,
      "text": "It's all been done. It's game over.",
      "id": "ep_31_ut_86"
    },
    {
      "end": 1442180,
      "speaker": "Enrico Bertini",
      "start": 1440712,
      "text": "It's all been done. Right.",
      "id": "ep_31_ut_87"
    },
    {
      "end": 1444312,
      "speaker": "Moritz Stefaner",
      "start": 1442960,
      "text": "It's all been discovered.",
      "id": "ep_31_ut_88"
    },
    {
      "end": 1444928,
      "speaker": "Enrico Bertini",
      "start": 1444416,
      "text": "End of summer.",
      "id": "ep_31_ut_89"
    },
    {
      "end": 1478630,
      "speaker": "Robert Kosara",
      "start": 1444944,
      "text": "Suppose discovery could be two things. I mean, discovery is brand new techniques, of course, and experimentation, but a lot of it is actually just going down the edges and actually seeing methods that were used in the 18 hundreds have just been off the radar for all these years. And, you know, I guess there's a certain point of it which is not reinventing the wheel, just popularizing methods that are perhaps quite niche. But, yeah, I'm sure there's a long way to go. There's so many visual variables to play with. I'm sure, you know, if we can get more of these b hexagonal charts going, then that'll be in the next version of excel, probably.",
      "id": "ep_31_ut_90"
    },
    {
      "end": 1482360,
      "speaker": "Moritz Stefaner",
      "start": 1479140,
      "text": "Yeah. When we run out of stuff, we just go into 3d.",
      "id": "ep_31_ut_91"
    },
    {
      "end": 1488120,
      "speaker": "Robert Kosara",
      "start": 1484900,
      "text": "Integrates from smell, sensory stuff, and. Yeah.",
      "id": "ep_31_ut_92"
    },
    {
      "end": 1489188,
      "speaker": "Enrico Bertini",
      "start": 1488500,
      "text": "And sound.",
      "id": "ep_31_ut_93"
    },
    {
      "end": 1491308,
      "speaker": "Moritz Stefaner",
      "start": 1489244,
      "text": "Oh, yeah, yeah, exactly.",
      "id": "ep_31_ut_94"
    },
    {
      "end": 1493644,
      "speaker": "Robert Kosara",
      "start": 1491364,
      "text": "So what would you say from your perspective?",
      "id": "ep_31_ut_95"
    },
    {
      "end": 1495908,
      "speaker": "Andy Kirk",
      "start": 1493772,
      "text": "But I think there's also, I was.",
      "id": "ep_31_ut_96"
    },
    {
      "end": 1505600,
      "speaker": "Robert Kosara",
      "start": 1495924,
      "text": "Just gonna say Enrico's perspective from academia. Does he see anything that's kind of working its way through that machine and coming out the other end at all.",
      "id": "ep_31_ut_97"
    },
    {
      "end": 1512870,
      "speaker": "Enrico Bertini",
      "start": 1505970,
      "text": "In terms of new techniques? Not really. I don't know, Robert, have you seen anything special?",
      "id": "ep_31_ut_98"
    },
    {
      "end": 1529498,
      "speaker": "Andy Kirk",
      "start": 1514290,
      "text": "So I was going to say there's I don't think we're going to see anything totally new in the sense that it's, you know, it's something you've never seen anywhere near anything like that before. But what we will see, I think, a lot more now are reasonably subtle.",
      "id": "ep_31_ut_99"
    },
    {
      "end": 1531430,
      "speaker": "Enrico Bertini",
      "start": 1529514,
      "text": "Things or new combinations, right.",
      "id": "ep_31_ut_100"
    },
    {
      "end": 1540956,
      "speaker": "Moritz Stefaner",
      "start": 1531900,
      "text": "Something like sketchy rendering, you know, like what Jason Dykes did, you know, which can be applied to any type of diagram. It's a new perspective on how to draw things.",
      "id": "ep_31_ut_101"
    },
    {
      "end": 1542716,
      "speaker": "Enrico Bertini",
      "start": 1541028,
      "text": "And I think there was.",
      "id": "ep_31_ut_102"
    },
    {
      "end": 1543804,
      "speaker": "Moritz Stefaner",
      "start": 1542748,
      "text": "Maybe we're moving a bit more.",
      "id": "ep_31_ut_103"
    },
    {
      "end": 1577020,
      "speaker": "Andy Kirk",
      "start": 1543852,
      "text": "I think there's a lot of work that we can do there, but it's just not, you know, if you have like the typical chart types, I don't think we're going to have a new one to add to that anytime soon. But. But I think there will be lots of things where, because you change a few small, reasonably small things, or if you look at just kind of the, the encodings, they're not that big a deal, but they make for a very different type of display that gives you very different information suddenly. So I think that's what we're going to see more and people will understand more that that's actually important to explore, those little subtle things and small tweaks.",
      "id": "ep_31_ut_104"
    },
    {
      "end": 1591630,
      "speaker": "Enrico Bertini",
      "start": 1578360,
      "text": "I think it was a nice paper last year at Euroviz from the group of Jarke van Wijk, how was it called? Small multiples, large singles. That was fun.",
      "id": "ep_31_ut_105"
    },
    {
      "end": 1596370,
      "speaker": "Andy Kirk",
      "start": 1591720,
      "text": "Yeah, yeah, yeah. I think it's a good example of interaction, of course.",
      "id": "ep_31_ut_106"
    },
    {
      "end": 1615466,
      "speaker": "Enrico Bertini",
      "start": 1596450,
      "text": "I think it's a good example of some new techniques which don't actually introduce any new kind of encoding, but a new way to, to let different kind of encoding interact with each other. So probably that's. That's the, the space that is still open for innovation, I suppose.",
      "id": "ep_31_ut_107"
    },
    {
      "end": 1671126,
      "speaker": "Robert Kosara",
      "start": 1615498,
      "text": "The other trends moving on to, to maps, maybe not trends as such, but certainly the dominant patterns of mapping that I saw last year. There were two main strands. First of all, kind of pointillistic cartography. So a lot of people were doing projects around, you know, the density of pointilistic cartography. I've made it up completely, actually. No, Alberto made it up and I was copied what he made up, but, you know, like a dot to represent x number of people who live there. It's the. I mean, it's the bill ranking stuff from years ago. But there were a number of projects that try to find new ways to show the density of populations rather than using things like choropleths and their inherent flaws. But also a number of projects that were really, really cool around the age of buildings. I don't know why this was just a. If it was just coincidental, but everyone seemed to get hold of this, this data set.",
      "id": "ep_31_ut_108"
    },
    {
      "end": 1680250,
      "speaker": "Moritz Stefaner",
      "start": 1671158,
      "text": "I think the data sets were released. I think it was a data thing. They were a great project. From Netherlands, Chicago, New York.",
      "id": "ep_31_ut_109"
    },
    {
      "end": 1681674,
      "speaker": "Robert Kosara",
      "start": 1680410,
      "text": "Portland, Chicago.",
      "id": "ep_31_ut_110"
    },
    {
      "end": 1682350,
      "speaker": "Moritz Stefaner",
      "start": 1681722,
      "text": "Yeah.",
      "id": "ep_31_ut_111"
    },
    {
      "end": 1709980,
      "speaker": "Enrico Bertini",
      "start": 1686090,
      "text": "Isn't that related to pixel based visualizations? This is an area where. I mean, it's crazy. So I think pixel based visualization have been there for how long now? I think almost 20 years. But there are so few examples out there using pixels to represent one single data point. I don't know why.",
      "id": "ep_31_ut_112"
    },
    {
      "end": 1714260,
      "speaker": "Moritz Stefaner",
      "start": 1711840,
      "text": "It's all going away with retina displays.",
      "id": "ep_31_ut_113"
    },
    {
      "end": 1722340,
      "speaker": "Enrico Bertini",
      "start": 1717200,
      "text": "Robert, what's your take on that? I think you've been playing a little bit in the past with pixels. Right?",
      "id": "ep_31_ut_114"
    },
    {
      "end": 1725900,
      "speaker": "Andy Kirk",
      "start": 1724680,
      "text": "Pixel base.",
      "id": "ep_31_ut_115"
    },
    {
      "end": 1728420,
      "speaker": "Enrico Bertini",
      "start": 1726960,
      "text": "I meant pixel based.",
      "id": "ep_31_ut_116"
    },
    {
      "end": 1818854,
      "speaker": "Andy Kirk",
      "start": 1731640,
      "text": "Yeah. The difficulty I have with some of this, particularly with maps, is that very often you end up showing the same things, because you just end up, especially for the US, you have these population centers and very little in between. And so you end up with these very cool shapes, but they're always the same. You know, the number of tweets on something, they're going to be a lot more tweets with a lot more people. End up with a similar structure as a very great. The XKC comic on that that shows like, all these different things and there, they all look the same because some percentage of people. Exactly. So I did like those maps of the age of buildings that made a lot of sense. That wasn't really pixel based, it was more shapes. There was a very good project at Viz on the nanocubes that also used essentially pixel based or kind of spinning that was roughly like that. We could zoom in and out very quickly and it would change the level of detail for the aggregation. I think aggregation in general is something that's certainly very important. And in particular, on top of maps, it's something that people have been doing for a while, but I think there's still work that can be done there in terms of how you zoom, how you maybe normalize your data in some way, that you look at maybe the number of people as a reference or income or things like that. So there's something more work that could be done there, I think. And I hope we're going to see some more of that.",
      "id": "ep_31_ut_117"
    },
    {
      "end": 1854930,
      "speaker": "Moritz Stefaner",
      "start": 1818902,
      "text": "Yeah. But I think coming back to that idea of humanizing data, I think that's something that has been. A lot of people have been thinking about, like, how can we, I mean, visualize aggregations, but still respect the individual? Right? Or make clear how the aggregation comes about, because I think all of us at some point run into that wall. That 33.7, even if you visualize it, is still very abstract, and just showing anecdotes doesn't help you either and what's in between. And I think that might be one of the motivations for these dot map techniques to show the big picture and the.",
      "id": "ep_31_ut_118"
    },
    {
      "end": 1874370,
      "speaker": "Enrico Bertini",
      "start": 1855310,
      "text": "I mean, honestly, sometimes I feel the constituents. Honestly, sometimes I feel that all the innovation we had in visualization during the last 20 years, years or so, compared to standard charts and graphics that we had around for ages, is exactly that, how to scale data visualization to a much larger number of points and to a higher density.",
      "id": "ep_31_ut_119"
    },
    {
      "end": 1948898,
      "speaker": "Robert Kosara",
      "start": 1875510,
      "text": "There's also talking about mapping. There were a couple projects that just came to my mind there that also used audio. So there's a project by the New York Times that kind of crowdsourced the quietest parts of New York City. So you could kind of contribute. This is where there's a really quiet park or a little quiet garden. And then it kind of, for certain selected areas, it played a little audio with little birds tweeting and maybe a little child's bike running past or something very kind of quaint noises. But it was a really nice way to, once again, as you said, to make this, you know, it's not an abstract concept. It's something we can make as real as possible. But also the Washington Post did one about the there's an investigation to the number of shots fired in downtown DC, and it created an audio simulation of the sound levels at different distances from the origin of these shots. And it was amazing how many shots a fire during the course of a year in DC. But once again, it gives you much, such a concrete, crystallized way to engage with that subject matter. And maybe audio visualization will be a trend in the coming weeks.",
      "id": "ep_31_ut_120"
    },
    {
      "end": 1950682,
      "speaker": "Enrico Bertini",
      "start": 1948914,
      "text": "So audio is going to be the next big thing.",
      "id": "ep_31_ut_121"
    },
    {
      "end": 1951790,
      "speaker": "Robert Kosara",
      "start": 1950786,
      "text": "Let's hope so.",
      "id": "ep_31_ut_122"
    },
    {
      "end": 1954274,
      "speaker": "Enrico Bertini",
      "start": 1952650,
      "text": "In a couple of weeks, it will be misused.",
      "id": "ep_31_ut_123"
    },
    {
      "end": 2080170,
      "speaker": "Andy Kirk",
      "start": 1954402,
      "text": "Audio can do, I think. Oh, yeah, that's for sure. What audio can do, I think is interesting, is it can give you a sense of time. That's what I've seen really be where it was used really well. So there was one, this is a bit older, but the New York Times did this thing about the times of Olympic runs, and it would show you in terms of how close together the runners were, or skiers or, I forget what it actually was. And it would show that by having little, that would give you the sense of how little time there was between them, because you hear some times, but it's very hard to actually get a sense of what that actually means in terms of how close those. Those times actually are to each other. And they're very, very close, like within fractions of a second. There's also a slightly older piece that's maybe derailing this a bit because we're talking about 2013, but there was a video that was posted, I think, two years ago or so on YouTube where somebody has a history of all the nuclear explosions in. Oh, yeah, that's going back to the first ones in. I think it starts with the bombs on Japan or even the nuclear test. Perhaps it starts with the first nuclear test in the US, but it's very interesting. And of course, it's much faster than real time because it covers 70 years or so of time in like seven minutes or so. But it gives you a sense of how much was going on during certain periods and how it was kind of speeding up as they were going towards that deadline for some non proliferation contracts. And then it kind of all quiets down. And it's really interesting to see that and also gives you a sense of scale, like you were talking about humanizing the data, just how many nuclear tests were done. It's just breathtaking how much there is. And the audio is pretty useful for that. It shows you where it is, but also because you hear the beeps for every explosion that goes off, it's very impressive. So I think that actually worked really well. I'm not so convinced by audio for other things, for actual data, but for maybe to give you a sense of scale, it can be really useful.",
      "id": "ep_31_ut_124"
    },
    {
      "end": 2097330,
      "speaker": "Enrico Bertini",
      "start": 2081110,
      "text": "I think me and Moritz try to invite someone in the areas of personification for a long while, but we don't have a name, so if you guys have someone, if you have ideas. Yeah, I mean, we really don't know who to invite, who is competent enough to tell something interesting in sonification.",
      "id": "ep_31_ut_125"
    },
    {
      "end": 2106004,
      "speaker": "Moritz Stefaner",
      "start": 2098660,
      "text": "But for once it would make sense that we do a podcast if we had an audio. Totally make sense.",
      "id": "ep_31_ut_126"
    },
    {
      "end": 2108148,
      "speaker": "Enrico Bertini",
      "start": 2106052,
      "text": "That would finally totally make sense.",
      "id": "ep_31_ut_127"
    },
    {
      "end": 2110800,
      "speaker": "Robert Kosara",
      "start": 2108284,
      "text": "Most of the food episode props.",
      "id": "ep_31_ut_128"
    },
    {
      "end": 2131210,
      "speaker": "Enrico Bertini",
      "start": 2113700,
      "text": "Yeah. How about tools? Are there any new tools around that have been used in 2013? Anything new? Anything special? Tableau, Robert?",
      "id": "ep_31_ut_129"
    },
    {
      "end": 2132462,
      "speaker": "Andy Kirk",
      "start": 2131830,
      "text": "Yes, of course.",
      "id": "ep_31_ut_130"
    },
    {
      "end": 2134678,
      "speaker": "Enrico Bertini",
      "start": 2132486,
      "text": "Tell us something about Tableau. What happened to Gaza?",
      "id": "ep_31_ut_131"
    },
    {
      "end": 2186142,
      "speaker": "Andy Kirk",
      "start": 2134694,
      "text": "We can talk about Tableau for sure there. Well, so there are a number of things about Tableau. There were two releases. There was 8.0, which was in early 2013, and then there was 8.1. And I'm not going to walk you through the features here. But that's certainly been a big thing. But then for next year, or for this year, I should say 2014, we have a few things that will be released reasonably soon. One of those features is called story points. And since we've been talking about storytelling, that's something that's interesting, of course, and it's my personal favorite and something I'm involved in. So we're building this feature where you can build stories in Tableau in your visualization tool. And so that is something that's going to come out in the first half of this year.",
      "id": "ep_31_ut_132"
    },
    {
      "end": 2191622,
      "speaker": "Enrico Bertini",
      "start": 2186166,
      "text": "That's the official, I think you already demoed this thing some time. Yeah.",
      "id": "ep_31_ut_133"
    },
    {
      "end": 2279924,
      "speaker": "Andy Kirk",
      "start": 2191686,
      "text": "Yes, we've had demos, and there is a blog posting on my website, and you can look online at the Tableau customer conference keynote. You can watch the video and you can watch the whole thing there. And there's also a new video because I just, it's also linked from my state of infovis posting that I did last year that was just published by IEEE computing now, where I'm talking a bit about storytelling, and then I'm demoing the story points feature as well. So there's lots of information out there, but I'm really looking forward to actually getting it out to users and actually seeing people use it and see what they do with it, because I was actually surprised by the response we got when we demoed it first at TCC. That's the Tableau customer conference in September, because I didn't think people would really see the point right away, especially business users. I just thought that they would think, well, this would be nice for journalists, but what do I get from that? But a lot of people actually came up to me later and said this is really the best feature, and they're looking forward to it because they all do presentations, they all have, they do their analysis, but then they have to present what they've done, what they found. And so at that point, they all take screenshots or export images or export PDF's and then put them into PowerPoint. And of course you've got PowerPoint, which is great for presentation, but it's not great for analysis. So now when they ask you a question during your presentation, you can just click on something and say, well, let's try that number.",
      "id": "ep_31_ut_134"
    },
    {
      "end": 2281628,
      "speaker": "Moritz Stefaner",
      "start": 2280012,
      "text": "Yeah, exactly right.",
      "id": "ep_31_ut_135"
    },
    {
      "end": 2323820,
      "speaker": "Andy Kirk",
      "start": 2281724,
      "text": "And so when you're doing this right with Tableau, because you're building a presentation in there, you could use that to present. And then somebody asks you a question, you can just respond to it right away. And so you've got the best of both worlds, have a presentation tool and have the analysis right at your fingertips. So that I think will be really interesting and something that I see as just becoming a total standard thing to do for all business intelligence tools going forward. But yeah, it's still very early days of that, but it's just fascinating to see that actually happening. And this is a bit of a shift too, because analysis is kind of this big thing in visualization, and presentation is just an afterthought in many cases, but it turns out it's actually really important.",
      "id": "ep_31_ut_136"
    },
    {
      "end": 2350520,
      "speaker": "Moritz Stefaner",
      "start": 2324280,
      "text": "I also realized that more and more people ask for, like, how can we export this graphic, how can I use this in a wider context, you know, and so on. And I think that's, that's gonna continue, that people just realize it's, it's not an endpoint, you know, it has to be part of a bigger conversation. It's to be able or possible to refine the graphics, to annotate them together, to discuss them, to version them, things like that.",
      "id": "ep_31_ut_137"
    },
    {
      "end": 2367680,
      "speaker": "Robert Kosara",
      "start": 2351020,
      "text": "And obviously the integration with R is quite an exciting proposition. And on the same point, I guess both these features, they'll immediately translate to Tableau public as well as desktop. Is that correct? Yeah.",
      "id": "ep_31_ut_138"
    },
    {
      "end": 2450090,
      "speaker": "Andy Kirk",
      "start": 2367980,
      "text": "Yes, yes, absolutely. I'm not sure about r, to be honest, because. So r, just to quickly explain this to people who might not be familiar, this is a statistical package or a language for doing statistical analysis. And what Tableau can now do, which is already released, this is in Tableau 8.1, you can now do table calculations that basically send the data and some r expression to r, have that do the work, do a model for you, or do some clustering or whatever it is, and then it sends the data back, and then you can use that to change the colors in your visualizations, to filter whatever you want to do. And that certainly has been used quite a bit already by lots of people who are very excited about that. I'm not an r user, so I can't really say much about it, but it's certainly been a big deal. And I'm not sure that, I don't think that necessarily works on Tableau public. I don't know, actually, but story points certainly do. And story points also are meant to be not just obviously used in the desktop, but also on Tableau server, which is what you see on Tableau public. So you will be able to author your story and people will see this navigator at the top, and you will be able to click through and read the story like you would like in a New York Times website. So, yeah, absolutely. So that's very much one of our goals is to make that work as well as possible.",
      "id": "ep_31_ut_139"
    },
    {
      "end": 2520310,
      "speaker": "Moritz Stefaner",
      "start": 2450870,
      "text": "That's great perspectives. I was also really happy to see a bit on the, let's say not so data heavy front that there were more tools also emerging. For instance, like raw. Have you seen Raw coming out of density design lab? And it's a really neat little browser based tool, and you can just paste in a spreadsheet and have a few really interesting chart types. Very playful. It also borrows a bit, I think, from Tableau in the sense that you can drag your variables around into different slots. It, for instance, fills that gap like tree visualization. I never had a good way of giving a novice some way of visualizing hierarchy. There was simply no tool like when I was teaching, let's say, design students. There was no simple tool to quickly make a dendrogram tree or something like that. And this tool, and hopefully more to come really nicely, fill that gap. And raw is open source too, so you can write a plugin. If you have a new jar type you want to support, you can basically write a renderer for that. And it's part of the tool, or at least youre, your instance of that tool.",
      "id": "ep_31_ut_140"
    },
    {
      "end": 2588068,
      "speaker": "Robert Kosara",
      "start": 2521050,
      "text": "I think there's two interesting points there. I think, firstly, once again, the people I engage with on training workshops, for example, there's an enormous appetite to have some sense of a catalog of this tool will do these chart types, very rudimentary, but, you know, some sense of a gallery, what the different tools will give you and whether those solutions are good solutions. You know, that's what the tool is built to do. Or if there are kind of hacks and workarounds, kind of halfway solutions, you know, that that's a real big gap and it's, I know it's something I'm just working on in the background slowly on something around that. But it is a, you know, a big, it would be a great solution if there was something that kind of did that out there. But also just in general around tools, I think we're still in a very fragmented space. I mean, my, another cheap plug, my resources collection on the website, there's 160 or so there and I've got a to do list bookmarks of about another 60 to hours.",
      "id": "ep_31_ut_141"
    },
    {
      "end": 2590244,
      "speaker": "Enrico Bertini",
      "start": 2588204,
      "text": "That's extremely intimidating.",
      "id": "ep_31_ut_142"
    },
    {
      "end": 2600100,
      "speaker": "Robert Kosara",
      "start": 2590372,
      "text": "And it's an enormous prospect for people to think, well, how on earth do I pick one to learn? Where do I invest my time or my resources into these tools?",
      "id": "ep_31_ut_143"
    },
    {
      "end": 2601952,
      "speaker": "Enrico Bertini",
      "start": 2600440,
      "text": "But, you know, I think if you're.",
      "id": "ep_31_ut_144"
    },
    {
      "end": 2615760,
      "speaker": "Moritz Stefaner",
      "start": 2601976,
      "text": "Serious about it, you still need to learn to code. I think it's still like that in 2014 and it will still stay like that into 2015. You know, if you're really serious about making the very best chart for a certain purpose, you need to.",
      "id": "ep_31_ut_145"
    },
    {
      "end": 2618568,
      "speaker": "Enrico Bertini",
      "start": 2615880,
      "text": "Coding will always give you some, some edge, I think.",
      "id": "ep_31_ut_146"
    },
    {
      "end": 2649520,
      "speaker": "Robert Kosara",
      "start": 2618704,
      "text": "I don't know, but I guess tools like raw are trying to create that surface above that hard coding to say, here's a few charts we can give you to take away the learning curve of the hard code side of it. But yeah, it's whether we'll see continue fragmentation or a bit more convergence. I mean, I guess an example there, as Robert outlined, story points and are kind of being integrated into Tableau every starts the journey backwards towards a single tool that does a lot more fantastically well.",
      "id": "ep_31_ut_147"
    },
    {
      "end": 2652396,
      "speaker": "Enrico Bertini",
      "start": 2651100,
      "text": "I mean, it would be lovely if.",
      "id": "ep_31_ut_148"
    },
    {
      "end": 2688220,
      "speaker": "Moritz Stefaner",
      "start": 2652428,
      "text": "All the tools would, for instance, support SVG in a really nice way, looking at Tableau as well, because I appreciate so much these workflows where you first start by hand, laying out something roughly, then you code your dynamic graphics into that, and in the end you do some tweaking by hand and just make it all easily digestible. With annotations and these hybrid workflows, it's still a pain. I could do a whole hour of ranting about what doesn't work in that area.",
      "id": "ep_31_ut_149"
    },
    {
      "end": 2689900,
      "speaker": "Robert Kosara",
      "start": 2688560,
      "text": "Episode 32.",
      "id": "ep_31_ut_150"
    },
    {
      "end": 2695100,
      "speaker": "Moritz Stefaner",
      "start": 2691560,
      "text": "But no, we're talking about 2013.",
      "id": "ep_31_ut_151"
    },
    {
      "end": 2701496,
      "speaker": "Enrico Bertini",
      "start": 2696880,
      "text": "So I think D3 has been growing throughout 2013.",
      "id": "ep_31_ut_152"
    },
    {
      "end": 2703440,
      "speaker": "Moritz Stefaner",
      "start": 2701568,
      "text": "Absolutely. Still going strong.",
      "id": "ep_31_ut_153"
    },
    {
      "end": 2710580,
      "speaker": "Enrico Bertini",
      "start": 2703520,
      "text": "Still going strong is even more established now than one year ago. And things not gonna slow down, right?",
      "id": "ep_31_ut_154"
    },
    {
      "end": 2712452,
      "speaker": "Robert Kosara",
      "start": 2711060,
      "text": "I think it's also the community around.",
      "id": "ep_31_ut_155"
    },
    {
      "end": 2713880,
      "speaker": "Moritz Stefaner",
      "start": 2712476,
      "text": "It, but I think I'm also.",
      "id": "ep_31_ut_156"
    },
    {
      "end": 2742420,
      "speaker": "Robert Kosara",
      "start": 2714820,
      "text": "I think it's also the community around it, it's the websites that discuss it, the tutorials, the books. This is now kind of caught up if you take our processing. These have been around for a good while now and they've got so much web resource out there. Whereas for the first 18 months of D3's existence, he was very specialist. But now you've got more and more people creating the pyramid which will help it thrive and survive.",
      "id": "ep_31_ut_157"
    },
    {
      "end": 2777036,
      "speaker": "Moritz Stefaner",
      "start": 2744840,
      "text": "Yeah, but I would actually like to see a bit more competition. So I think we are actually running into a situation where D3 is the go to solution. And actually, I know for some people it's quite hard to wrap their head around that mental model that's behind it. I think competition is always good. So my hope for 2014 is some sort of black horse JavaScript framework, out of the dark, having a totally different mental model just to keep things fresh.",
      "id": "ep_31_ut_158"
    },
    {
      "end": 2828980,
      "speaker": "Enrico Bertini",
      "start": 2777108,
      "text": "I think Moritz to some degree, I think. I disagree, because one, I mean, connected to the things that Andy was saying, that we have a super fragmented kind of scenario out there. I think having a few tools, a few very well established tools, is a very good thing for our community. And sure, I see your point. I think having competitors and competition is really good. Having new tools coming up is good as well for innovation. But I'm wondering if we have had too much innovation lately, and now it's time to converge on a few very good tools. And this is what seems to happen, I think D3 Tableau and maybe even r. I think there's nothing that can compare with these three tools. Right. Correct me if I'm wrong, but I think these are the main, I don't know, the tip of the iceberg. Right.",
      "id": "ep_31_ut_159"
    },
    {
      "end": 2845984,
      "speaker": "Andy Kirk",
      "start": 2830720,
      "text": "Well, there is a certain, it's not just a question of getting more things, but getting filling voids and filling gaps. So one thing for D3, for example, could be that D3 becomes, or is already, I guess, kind of the backend for documents.",
      "id": "ep_31_ut_160"
    },
    {
      "end": 2847080,
      "speaker": "Enrico Bertini",
      "start": 2845992,
      "text": "Yeah, totally. Right.",
      "id": "ep_31_ut_161"
    },
    {
      "end": 2926468,
      "speaker": "Andy Kirk",
      "start": 2847120,
      "text": "There's this thing that trifecta has built, which is called Vega, where you can build a JSON JavaScript description that isn't code, but that basically tells you what to map. And I believe I was just looking at there's a visualization project on Kickstarter that was just funded a few weeks ago that I believe is also built on top of D3 and raw. May or may not be, I'm not actually sure. I don't know. So if it's about making things usable and not having to program, but making it a lightweight web thing, then that could very well be built on top of D3, but just do a different thing. Not trying to be D3, but different, be something else that gives you a different use case and makes something easier for people who don't want to program or who just can't program. So I think that's very valuable. But I don't know if we need 100 different clones of D3 like libraries, and they're out there. I mean, there are a whole bunch of libraries for not that many, maybe for SVG, but there are lots of libraries out there for canvas rendering, and I don't know how they're different. I'm just not going to look into 100 different ones. It's just too much stuff. So having one standard for something is just a good thing. And I think D3 is certainly the best one I know for Svg rendering in the browser.",
      "id": "ep_31_ut_162"
    },
    {
      "end": 2976162,
      "speaker": "Moritz Stefaner",
      "start": 2926644,
      "text": "Yeah, but that's exactly the thing. It's an SVG toolkit in a way, and I think that's great in some sense. And I got to love SvG by now. Really in the beginning, wouldn't have expected that. But I think that's also the limitation. We'll see, we'll see. But talking about community, I think 43 for sure it's been true. And I think the data with community has developed great. It's always been cool. But I think also the last year it has really greatly developed with a few really awesome, nice new initiatives and lots of meetups popping up everywhere. So I think, yeah, still getting more.",
      "id": "ep_31_ut_163"
    },
    {
      "end": 3012220,
      "speaker": "Robert Kosara",
      "start": 2976186,
      "text": "And more, but it's still a super friendly, welcoming community. You know, people I speak to taking their first steps into this world, they're saying, well, I'm amazed by how well I've been welcomed, how supportive people are, how constructive people are with feedback. I think it really is. And obviously it's got a very strong presence on Twitter across all the social media outlets, but even just the conversations and the insights and the sharing on there, it's very, very healthy and I think it bodes well for the future of the field.",
      "id": "ep_31_ut_164"
    },
    {
      "end": 3104376,
      "speaker": "Andy Kirk",
      "start": 3015560,
      "text": "That's true, though. I think the one thing that I've seen being missing are really useful. And I in more kind of reflective websites, perhaps people doing a bit more than just showing stuff. And so there are these new websites that have sprung up over the last year that I think are really interesting for that. I think that was more it was probably alluding to is these three of those websites are, there's the WTF viz one's hilarious, there's thumbs up viz and then there's help me vistain. And they are actually interesting because of the way they kind of came about because the first one was WTF Biz, which is that this Internet slang for things that you kind of hear like what the. And so this is a collection of things that are questionable and it's kind of usually come with a little quip about what might be wrong there. And then in response to that, a couple of people came together and made and put together this thumbs up this, which is kind of the opposite. It's now the positive version of that to me. Talk about things that are good. And then the third one is perhaps could be the most useful one. In a sense it's help me this, which is I've done some work. I don't know really where to go. Help me. So that I think is a good idea. And that only started, yeah, December 2 months ago.",
      "id": "ep_31_ut_165"
    },
    {
      "end": 3106700,
      "speaker": "Moritz Stefaner",
      "start": 3104448,
      "text": "They are all fairly recent. Yeah.",
      "id": "ep_31_ut_166"
    },
    {
      "end": 3140928,
      "speaker": "Andy Kirk",
      "start": 3108080,
      "text": "And it's interesting to watch that. So I really like that because it's not just about, you know, somebody posting stuff, hey, there's a new project here, new thing there. But actually using this more as a criticism medium for criticism or to just actually post things and then see if people actually have some ideas to help them, which people in design do, for example, that these websites dribble, I guess, and a few others, I don't really know them too well, but you can publish your designs and you say, well, here's what I have. Give me some ideas for where to go next.",
      "id": "ep_31_ut_167"
    },
    {
      "end": 3169132,
      "speaker": "Moritz Stefaner",
      "start": 3141064,
      "text": "Dribble is only for collective shoulder clapping or showing off obscure typographic skills. But in principle you're right. No, no, it's in different communities. It happens already. And it's super cool that now things like help me with. I think it's super fantastic because on the one hand it also states, okay, no graphic is perfect or not, everybody's like a hero. But if we like, help each other out, we kind of get a decent chart out of that. And I think that's the right thing.",
      "id": "ep_31_ut_168"
    },
    {
      "end": 3206460,
      "speaker": "Robert Kosara",
      "start": 3169156,
      "text": "But obviously the key thing, and it's, you know, for us as well as everybody else, is it's going to be, it'll work if people contribute, not just contribute pieces, but contribute suggestions and ideas. And so the framework is there for a fantastic resource and website. It needs now the kind of footfall to follow suit and really kind of give it some momentum and kind of feel the, feel the attitude that this is a safe place to come. You put some work up there, you won't be ripped to pieces. People will help you through. And I look forward to maybe this time next year. Let's see where it's got to.",
      "id": "ep_31_ut_169"
    },
    {
      "end": 3219194,
      "speaker": "Moritz Stefaner",
      "start": 3208320,
      "text": "Some other thing. Is it just me or is actually the crappy stuff getting less? Am I just getting too mild over the years?",
      "id": "ep_31_ut_170"
    },
    {
      "end": 3220198,
      "speaker": "Enrico Bertini",
      "start": 3219352,
      "text": "It's the age.",
      "id": "ep_31_ut_171"
    },
    {
      "end": 3223490,
      "speaker": "Moritz Stefaner",
      "start": 3220294,
      "text": "I mean, subjectively, I feel I see less crap.",
      "id": "ep_31_ut_172"
    },
    {
      "end": 3289674,
      "speaker": "Robert Kosara",
      "start": 3224710,
      "text": "Well, my personal view, I've discussed this with Robert in the past, is I think it's still happening. It's just been moved somewhere else. It's been herded into this big, big farmers junk. I mean, my simple test for this is fewer requests to me on the website to say, we'll, we think you'd like this terrible graphic for your readership about credit card fraud or injury lawyers for you, or something like that. Please share it, sir, and they'll dear sir or madam or dear webmaster or something like that. I've seen far fewer of those requests. And so on a very small kind of non empirical test that suggests that there are people going elsewhere to put push these pieces. But I still think there's a huge population, a huge appetite out there amongst non experts, amongst non enthusiasts for eye candy, for very colorful, simple graphics that on a very superficial ten second basis they might say, oh, that's fun.",
      "id": "ep_31_ut_173"
    },
    {
      "end": 3299230,
      "speaker": "Moritz Stefaner",
      "start": 3289722,
      "text": "I mean, maybe people realize not. Not every graphic can go viral and there is only so much virality left in this world that you can squeeze out of.",
      "id": "ep_31_ut_174"
    },
    {
      "end": 3403120,
      "speaker": "Andy Kirk",
      "start": 3299570,
      "text": "Yeah, maybe. But I also. I wonder if it's just not really. I think what you're right about, I think this is still being created, a lot of that, and it's actually quite funny. When I get these emails, sometimes they say, dear Nathan. Nathan, of course, Nathan. Yeah. Is running slowing data people the same email to everybody kind of funny? Oh, yeah, exactly. No, but the other thing is that I think they've mostly given up on, and I also have a very strong statement now on my contact page saying, don't send me infographics, I'm not going to publish them. So maybe that actually works. But they certainly. There's still a lot of that stuff out there that gets pushed on Facebook and just a general social media that happens a lot, I think. It's not that those things aren't generated anymore, it's just that I think they basically get given up on trying to get me and Andy and other people to post them. But yeah, there's. But yeah, on the other hand, it's maybe also be our own filters that we're kind of seeing less of that than necessarily that there's less of it. But yeah, I'm not sure if there's no science here that I can see that would actually tell me that there's really a change or a shift in thinking. But maybe there is. And there's certainly, on the other hand, on the flip side of this, certainly there's a lot more good work that's being generated and that's good to see. And that includes infographics that are just good databased that don't just put lots of clip arts on a page and then three numbers and that's it. But maybe people are getting more sensitive to that as well.",
      "id": "ep_31_ut_175"
    },
    {
      "end": 3418690,
      "speaker": "Moritz Stefaner",
      "start": 3403780,
      "text": "Yeah, that's my perception. Even the marketing stuff is not as crappy anymore, you know. Could that be? I mean, I like to think positive. Shall we. Shall we hand out some awards? Like.",
      "id": "ep_31_ut_176"
    },
    {
      "end": 3422438,
      "speaker": "Robert Kosara",
      "start": 3420510,
      "text": "What? To each other? Why not?",
      "id": "ep_31_ut_177"
    },
    {
      "end": 3423490,
      "speaker": "Andy Kirk",
      "start": 3422534,
      "text": "Maybe we should.",
      "id": "ep_31_ut_178"
    },
    {
      "end": 3426210,
      "speaker": "Moritz Stefaner",
      "start": 3424190,
      "text": "Andy of the year goes to Andy.",
      "id": "ep_31_ut_179"
    },
    {
      "end": 3428130,
      "speaker": "Robert Kosara",
      "start": 3426750,
      "text": "Second year in the truck.",
      "id": "ep_31_ut_180"
    },
    {
      "end": 3429890,
      "speaker": "Enrico Bertini",
      "start": 3428590,
      "text": "We should do that.",
      "id": "ep_31_ut_181"
    },
    {
      "end": 3434134,
      "speaker": "Moritz Stefaner",
      "start": 3431350,
      "text": "Best Andy overall in second place.",
      "id": "ep_31_ut_182"
    },
    {
      "end": 3434970,
      "speaker": "Robert Kosara",
      "start": 3434182,
      "text": "Andy Cook.",
      "id": "ep_31_ut_183"
    },
    {
      "end": 3445090,
      "speaker": "Moritz Stefaner",
      "start": 3439130,
      "text": "But more seriously, like, were there any, like, persons or individual studios or teams that stood out for you?",
      "id": "ep_31_ut_184"
    },
    {
      "end": 3455870,
      "speaker": "Robert Kosara",
      "start": 3445210,
      "text": "Yeah, for me, I don't think you could argue that the most visible work of last year seemed to come from Giorgia Lupi and the team at Accurate studios.",
      "id": "ep_31_ut_185"
    },
    {
      "end": 3457402,
      "speaker": "Moritz Stefaner",
      "start": 3456370,
      "text": "Yeah, absolutely.",
      "id": "ep_31_ut_186"
    },
    {
      "end": 3503860,
      "speaker": "Robert Kosara",
      "start": 3457466,
      "text": "I think, I mean, obviously the frequency of their output is tied into the weekly. Is it the Corre del Cellar Sunday newspaper supplement or something in Italian newspaper? So they've got a lot of output, naturally. And, you know, they've done some great work. I mean, there's some really interesting new methods. We talked about techniques before and seem to a new technique in their work every, every single week, but, you know, some really, some really great stuff. And what always resonates with me is appreciating the constraints in which they're working. They'll get a brief or a subject matter that emerges Tuesday, perhaps they'll turn this around by Friday and then it goes into print at the weekend. So it seemed, you know, a very, very impressive turnaround. And, yeah, I think for me, they kind of stood out.",
      "id": "ep_31_ut_187"
    },
    {
      "end": 3508496,
      "speaker": "Enrico Bertini",
      "start": 3505000,
      "text": "Yeah, I agree. That's one of the. It's been one of the biggest.",
      "id": "ep_31_ut_188"
    },
    {
      "end": 3509224,
      "speaker": "Moritz Stefaner",
      "start": 3508528,
      "text": "Shooting stars.",
      "id": "ep_31_ut_189"
    },
    {
      "end": 3550028,
      "speaker": "Enrico Bertini",
      "start": 3509272,
      "text": "Yeah, shooting stars, absolutely. I think what surprises me of the work from accurate is that they have been able to do some fairly novel and complex stuff and still be successful, which doesn't really surprising to me. Normally you can see complex visualizations out there that are a little harder to parse and maybe they are appreciated by people like us, but they don't have a lot of success, but accurate, kind of like, I don't know, found a way to mix the two things together. They have been able to create fairly complex stuff that is not that easy to parse but at the same time be super attractive and successful. So that's new to me.",
      "id": "ep_31_ut_190"
    },
    {
      "end": 3562570,
      "speaker": "Robert Kosara",
      "start": 3550084,
      "text": "And I wonder if part of it is it's almost like a weekly puzzle. You know, if you're a regular reader of that newspaper, it's almost like a weekly puzzle. You know, what, how do I decode this, this week? And, you know, what's it tell me, sir. Maybe there's something about that.",
      "id": "ep_31_ut_191"
    },
    {
      "end": 3594138,
      "speaker": "Moritz Stefaner",
      "start": 3565230,
      "text": "Yeah. And it's also, it has, although it's digital work, also, this handmade touch, I think that we also enjoy so much in Stephanie Posavec's work where you realize somebody was sitting down and actually moving these things around by hand. Somehow you see that and it just adds that nice, the craft that sits behind it. Warm quality to the work, I think. Yeah. And that helps you really, with parsing all that super complex, deep information. If there's a human, like, holding your hand.",
      "id": "ep_31_ut_192"
    },
    {
      "end": 3601970,
      "speaker": "Enrico Bertini",
      "start": 3594234,
      "text": "Yeah, yeah. Maybe it's this overall trend that visualization is becoming more human and less machine. No, absolutely. You can see many different.",
      "id": "ep_31_ut_193"
    },
    {
      "end": 3613494,
      "speaker": "Moritz Stefaner",
      "start": 3602010,
      "text": "But Accurat, I was also amazed. And let's be honest, a year ago, we didn't have them on the radar at all. Right. I mean, they were already practicing, but I don't think any one of us would have had them on the radar yet.",
      "id": "ep_31_ut_194"
    },
    {
      "end": 3615174,
      "speaker": "Enrico Bertini",
      "start": 3613622,
      "text": "Yeah. And they have such interesting.",
      "id": "ep_31_ut_195"
    },
    {
      "end": 3632030,
      "speaker": "Moritz Stefaner",
      "start": 3615222,
      "text": "Again, it's like daughter is coming out of Paolo Tucarelli's density design, like study the farm. So. No, but I really am. A few really great designers have already emerged from that, so.",
      "id": "ep_31_ut_196"
    },
    {
      "end": 3633958,
      "speaker": "Enrico Bertini",
      "start": 3632110,
      "text": "Yeah, yeah, yeah, yeah, yeah.",
      "id": "ep_31_ut_197"
    },
    {
      "end": 3638822,
      "speaker": "Moritz Stefaner",
      "start": 3634134,
      "text": "Okay, moving on. Best film. There was no best film. Best book.",
      "id": "ep_31_ut_198"
    },
    {
      "end": 3641770,
      "speaker": "Enrico Bertini",
      "start": 3638966,
      "text": "Best book. Robert, that's yours.",
      "id": "ep_31_ut_199"
    },
    {
      "end": 3693150,
      "speaker": "Andy Kirk",
      "start": 3642260,
      "text": "Yeah, I've got some opinions on that. So I wrote a rant in the summer about how a lot of visualization books are kind of lazy because you can just put lots of very nice images in there and you leaf through them and they look great. I mean, it's almost impossible to make a crappy looking visualization book. And I read a couple books over the summer, and I was just kind of really annoyed because they were all very similar and they didn't really have enough that it didn't really tell you anything new. And they all use the same examples. And so in the fall, I think around October or so, a new book came out, and I'm gonna horribly mispronounce name. Isabel Mireles. Yeah, she wrote a book that's called design for information, or actually forget the exact title right now.",
      "id": "ep_31_ut_200"
    },
    {
      "end": 3694206,
      "speaker": "Moritz Stefaner",
      "start": 3693270,
      "text": "Decide. Information.",
      "id": "ep_31_ut_201"
    },
    {
      "end": 3776090,
      "speaker": "Andy Kirk",
      "start": 3694318,
      "text": "Yeah, it's time for information. Okay, so I got it right. And she has a book that I really like because it's deeper in a way. So she uses a lot of the same examples that you've seen before or that many of us, I guess, have seen before. But she digs a lot deeper. She actually explains how things work, how they are mapped, how a tree map works, for example, by actually telling you what the different parts are or showing you variations of diagrams that show how different parts of visualization, what they actually depict. And so it gives you a lot more, a lot deeper information about what's actually going on. Rather than just talking about it, it actually dives into it. And there are a whole bunch of things that are really explained nicely in sidebars and diagrams. And I thought that was really useful. And I hope that this is actually going to be a trend going forward. Where we're going to see more of that happening and we're going to get deeper books that are actually more, that don't just kind of play on the fact that they use all these great images but actually are giving you more of the background and the depth and hopefully are going to be, you know, more helpful for people to actually understand what's going on.",
      "id": "ep_31_ut_202"
    },
    {
      "end": 3778422,
      "speaker": "Moritz Stefaner",
      "start": 3777150,
      "text": "Yeah, it's a great one.",
      "id": "ep_31_ut_203"
    },
    {
      "end": 3779334,
      "speaker": "Andy Kirk",
      "start": 3778526,
      "text": "I enjoy it too.",
      "id": "ep_31_ut_204"
    },
    {
      "end": 3814208,
      "speaker": "Moritz Stefaner",
      "start": 3779382,
      "text": "Absolutely. And I think that's the one I will also recommend in courses, you know, like what should I read to get started? Because everything's in there. A bit like gestalt theory, all the layouts, all the data types, all the classical pieces, you know, like it's like a tasting menu, what's out there, and then you can go to into one of these topics, but it's all somehow mentioned what is important to get started and that's really cool. Yeah. Any other great books? I didn't read so many info.",
      "id": "ep_31_ut_205"
    },
    {
      "end": 3826420,
      "speaker": "Robert Kosara",
      "start": 3814264,
      "text": "I've got books, eight to read. I've got so many things to catch up with, but there's a lot to produce, certainly. I'm still waiting for Tamara Munzner's book. I was expecting that last year, but it's yet to get to land.",
      "id": "ep_31_ut_206"
    },
    {
      "end": 3860350,
      "speaker": "Moritz Stefaner",
      "start": 3827920,
      "text": "But they are coming up for 2014. So Manuel Lima's new book is finished. It's coming out soon. David McCandless is working on a book, one says, and I think a few other interesting ones. We'll see. Books are old media anyways. Who cares? Anything else? What else happened?",
      "id": "ep_31_ut_207"
    },
    {
      "end": 3872638,
      "speaker": "Enrico Bertini",
      "start": 3860510,
      "text": "I think we covered that in much everything. Should we move on to 2014 then and talk about the future?",
      "id": "ep_31_ut_208"
    },
    {
      "end": 3873610,
      "speaker": "Robert Kosara",
      "start": 3872774,
      "text": "The future.",
      "id": "ep_31_ut_209"
    },
    {
      "end": 3879798,
      "speaker": "Enrico Bertini",
      "start": 3876750,
      "text": "So, yeah, I don't know.",
      "id": "ep_31_ut_210"
    },
    {
      "end": 3880766,
      "speaker": "Moritz Stefaner",
      "start": 3879814,
      "text": "Flying cars?",
      "id": "ep_31_ut_211"
    },
    {
      "end": 3884650,
      "speaker": "Enrico Bertini",
      "start": 3880918,
      "text": "What do you think, Moritz? I cannot hear you anymore.",
      "id": "ep_31_ut_212"
    },
    {
      "end": 3940160,
      "speaker": "Robert Kosara",
      "start": 3892030,
      "text": "Well, we'll continue without him for now. He's not that relevant for 2014 anyway. Well, I mean, the first thing. So, you know, kind of the book end of the, of the discussion of 2013, which I mentioned, was in some respects absent of big events. Obviously this year we've got probably a few more big events. We've got the World cup in football, the Winter Olympics. So maybe that gives us that kind of, that kind of gravity to kind of surface more work from certainly enthusiasts and different media outlets. I think the thing that excites me about the coming year is certainly conferences, mainly because I will be actually attending some this year. But I'm looking forward to attending tapestry next month, which is hosted by.",
      "id": "ep_31_ut_213"
    },
    {
      "end": 3942072,
      "speaker": "Enrico Bertini",
      "start": 3940240,
      "text": "That's coming up soon, right, Robert?",
      "id": "ep_31_ut_214"
    },
    {
      "end": 3942616,
      "speaker": "Robert Kosara",
      "start": 3942176,
      "text": "Next month?",
      "id": "ep_31_ut_215"
    },
    {
      "end": 3972500,
      "speaker": "Andy Kirk",
      "start": 3942648,
      "text": "Yeah, yeah. The tapestry is at the end of February, February 26 or 27th, maybe. 27th, I think, is the right day, and that's going to be interesting. We're going to have Alberto Cairo there as a keynote speaker. We're going to have Fernando and Martin Wattenberg and Georgia Lupi will also be speaking. She will have a small talk, and we have a few more. So it will be very interesting, I think. And, yeah, I'm very much looking forward to having Andy there as well, just watching this time.",
      "id": "ep_31_ut_216"
    },
    {
      "end": 3979312,
      "speaker": "Moritz Stefaner",
      "start": 3976080,
      "text": "Is it again centered around storytelling? Is it the main thing?",
      "id": "ep_31_ut_217"
    },
    {
      "end": 4016750,
      "speaker": "Andy Kirk",
      "start": 3979376,
      "text": "Yes, that's the idea. So it's very much about telling stories with data, and we have some really good speakers for that. And we are also kind of not really pairing up so much with NICAR, but we're trying to be close to NICAR. So we are in Annapolis, Maryland, and the NICAR conference is in Baltimore. And the idea is that people can travel, and it's the day before NICAR. The idea is that people can go just add one day to their travel who are traveling to Naikar and then go to tapestry, and then we actually have a bus service going from Tapas tapestry from Annapolis to Baltimore to take over there so that it's easy for them to travel.",
      "id": "ep_31_ut_218"
    },
    {
      "end": 4027750,
      "speaker": "Moritz Stefaner",
      "start": 4017290,
      "text": "I mean, conferences are going wild, in my opinion, and maybe it's already even a bit too much. I mean, if you would go to all the relevant conferences, you could be traveling nonstop, basically.",
      "id": "ep_31_ut_219"
    },
    {
      "end": 4052836,
      "speaker": "Andy Kirk",
      "start": 4029050,
      "text": "Well, they're also too close together. Right. There's visualized, which is in like, two weeks or so, and then two weeks later there's tapestry, and then another two weeks later, there's probably something else. So there's lots. Oh, yeah. Openvizcon. Openviscon resumes, I guess, is like a month later. And so there's lots of things going on, but lots of good, new, interesting ones. I think that's actually good to see that there is now so much interest.",
      "id": "ep_31_ut_220"
    },
    {
      "end": 4070324,
      "speaker": "Enrico Bertini",
      "start": 4052948,
      "text": "Yeah. And I think one of the highlights for 2014 in terms of conferences is that this will move to Europe for the first time. It's gonna be in Paris. That's gonna be a big thing, I guess. I think we know where. Sorry.",
      "id": "ep_31_ut_221"
    },
    {
      "end": 4071268,
      "speaker": "Moritz Stefaner",
      "start": 4070372,
      "text": "Now that you are in the UK.",
      "id": "ep_31_ut_222"
    },
    {
      "end": 4072468,
      "speaker": "Robert Kosara",
      "start": 4071284,
      "text": "We know where this conversation is going to go.",
      "id": "ep_31_ut_223"
    },
    {
      "end": 4075180,
      "speaker": "Enrico Bertini",
      "start": 4072484,
      "text": "Now I am in the US. Yeah. Yeah.",
      "id": "ep_31_ut_224"
    },
    {
      "end": 4076800,
      "speaker": "Robert Kosara",
      "start": 4075300,
      "text": "So, Moritz, are you going to.",
      "id": "ep_31_ut_225"
    },
    {
      "end": 4079640,
      "speaker": "Moritz Stefaner",
      "start": 4078580,
      "text": "I don't know.",
      "id": "ep_31_ut_226"
    },
    {
      "end": 4080916,
      "speaker": "Enrico Bertini",
      "start": 4079980,
      "text": "Come on, Moritz.",
      "id": "ep_31_ut_227"
    },
    {
      "end": 4082800,
      "speaker": "Moritz Stefaner",
      "start": 4080948,
      "text": "Nobody has invited me yet.",
      "id": "ep_31_ut_228"
    },
    {
      "end": 4086276,
      "speaker": "Enrico Bertini",
      "start": 4083100,
      "text": "We discussed that too many times now.",
      "id": "ep_31_ut_229"
    },
    {
      "end": 4108142,
      "speaker": "Moritz Stefaner",
      "start": 4086348,
      "text": "I mean, the keynote is gone now. I don't know. I was sort of hoping to be invited for that one. They invited somebody? No, I'll definitely try and make it in some form. I mean yeah, the. The excuses are getting less and less. Yeah, thinner and thinner.",
      "id": "ep_31_ut_230"
    },
    {
      "end": 4112142,
      "speaker": "Andy Kirk",
      "start": 4108166,
      "text": "Yeah, that's for sure. This time you really have to go to this, that's for sure.",
      "id": "ep_31_ut_231"
    },
    {
      "end": 4129860,
      "speaker": "Robert Kosara",
      "start": 4112206,
      "text": "Yeah. And also Yorub is in the UK this year in Swansea in Wales, so I'm going to be taking part in that in some. In some form. So yeah, it's fantastic to see these events in Europe. I mean we, you know, we have, you know, the regular resonate and sea.",
      "id": "ep_31_ut_232"
    },
    {
      "end": 4132864,
      "speaker": "Moritz Stefaner",
      "start": 4131480,
      "text": "Sea conference as well.",
      "id": "ep_31_ut_233"
    },
    {
      "end": 4153780,
      "speaker": "Robert Kosara",
      "start": 4132992,
      "text": "I think that, you know, there's still a little bit of a gap in terms of visualization conferences in Europe, which this will plug obviously, for this year. But I guess it's always the challenge around Europe is perhaps the fragmentation of languages. I don't know what they. What the reason for it is, but we always look over enviously to the us for the events that take place there.",
      "id": "ep_31_ut_234"
    },
    {
      "end": 4164792,
      "speaker": "Andy Kirk",
      "start": 4155960,
      "text": "Well, but there are actually a few that are also a bit more specialized perhaps like VIZBI, if you know that. That's a biofuel visualization conference.",
      "id": "ep_31_ut_235"
    },
    {
      "end": 4165432,
      "speaker": "Moritz Stefaner",
      "start": 4164816,
      "text": "Oh yeah, that's true.",
      "id": "ep_31_ut_236"
    },
    {
      "end": 4203362,
      "speaker": "Andy Kirk",
      "start": 4165496,
      "text": "Spelled Vivbi. And there are a few more, well, graphics conferences like Eurographics. There are a few more kind of smaller graphics type things. So there's. And there's obviously a lot of work being done in Europe. So a lot of the published work is coming out of Germany, the Netherlands, France in particular. Those three. Well the UK too. So I think those four countries probably are the bulk of this work in Europe. But that's certainly. There's a lot of work being done there and.",
      "id": "ep_31_ut_237"
    },
    {
      "end": 4210830,
      "speaker": "Moritz Stefaner",
      "start": 4203546,
      "text": "Yeah, but also from the design artistic side, I think there's a lot of contrasts actually in Europe, like UK and also continental.",
      "id": "ep_31_ut_238"
    },
    {
      "end": 4212470,
      "speaker": "Andy Kirk",
      "start": 4211570,
      "text": "Absolutely.",
      "id": "ep_31_ut_239"
    },
    {
      "end": 4218910,
      "speaker": "Moritz Stefaner",
      "start": 4214210,
      "text": "Any other bold predictions. Any other bold predictions for 2014?",
      "id": "ep_31_ut_240"
    },
    {
      "end": 4316720,
      "speaker": "Robert Kosara",
      "start": 4221930,
      "text": "Well, I think for me my own wish for 2014 is something we've touched on already, which is a greater. Not necessarily a gritted proportion, but certainly a shift towards more analysis, more insights. We've had, you know, many years of fantastic interactive pieces and people demonstrating new techniques and skills and competencies. I just don't see a lot of conclusions and discoveries being actually communicated, which obviously is at the heart of storytelling. Just a little kind of anecdote about this. So I've been teaching on the information visualization programme at Mica in Maryland and the class there do an end of year thesis project which they develop a visualisation project and then present it. And I was over there in December for the presentations and they were fantastic. They did some brilliant work. Very, very impressed. They were all interactive, they were all exploratory. And I felt that, you know, there's an appetite from my perspective to hear that next stage, which is, excuse me, I've used this tool to find these insights, to then actually change knowledge to help inform decisions, whatever the output is. But I do feel there's still a gap in that stage of going that little bit further. Here's the insights that actually the specialization has added to the, to the subject.",
      "id": "ep_31_ut_241"
    },
    {
      "end": 4321052,
      "speaker": "Moritz Stefaner",
      "start": 4320220,
      "text": "So that's your wish?",
      "id": "ep_31_ut_242"
    },
    {
      "end": 4321960,
      "speaker": "Robert Kosara",
      "start": 4321076,
      "text": "That's my wish.",
      "id": "ep_31_ut_243"
    },
    {
      "end": 4325068,
      "speaker": "Moritz Stefaner",
      "start": 4324100,
      "text": "More findings.",
      "id": "ep_31_ut_244"
    },
    {
      "end": 4325636,
      "speaker": "Robert Kosara",
      "start": 4325164,
      "text": "More findings.",
      "id": "ep_31_ut_245"
    },
    {
      "end": 4398730,
      "speaker": "Enrico Bertini",
      "start": 4325668,
      "text": "Yeah, I think it's, yeah, it's interesting because if you look at the way academia has been working on, visualization is more exactly from this side. We've been basically dealing with the problem of how to come up with a new techniques and systems to do visualization for analysis. Right. So if you ask to the average academics who is not maybe that well aware of what is going on in visualization on the web, this person will tell you that visualization is for analysis, not that much for presentation. I think this resonates very well with some of the points that Robert raises in the past, even in some of these pieces. I think you had a piece about storytelling some time ago on computer graphics and applications, and you were exactly saying that. Right. So from the academic point of view, visualization is exploratory visualization. Right. And so there is some kind of disconnect between the effect that we have seen during the last few years, that visualization is mostly used as a presentation tool, and how academia have seen visualization as researched visualization for a long time.",
      "id": "ep_31_ut_246"
    },
    {
      "end": 4470424,
      "speaker": "Andy Kirk",
      "start": 4401050,
      "text": "Yeah. And I think that's actually something that we're going to see more. So I think that is a bit of a trend that has started over the last two years or so also in the academic world that people are now actually accepting work that's more about storytelling, more about narrative presentation and so on. And we've seen that at the conferences. There was quite a bit of work on that at infovis certainly this last year, and I'm sure we're going to see more of that at Euroviz this year, infovis this year, and then going forward. So there's a lot of that work being done in academia now. And so that's good to see. And I think, and it's obviously already out there. I mean, all those people doing work at news media and, you know, there's a lot of that work already being done. But kind of academia is kind of lagging behind here a bit, but that's something that's absolutely happening. And I think that is we're going to see a lot more of that going forward. And I think that that plus the other thing that I would like to see more of, though, on the other side on the web, is more reflection and more. And maybe this is already happening. Maybe I'm just not giving people enough credit. But these websites we talked about, the new ones are going in that direction, and maybe there's also more of that.",
      "id": "ep_31_ut_247"
    },
    {
      "end": 4475448,
      "speaker": "Moritz Stefaner",
      "start": 4470472,
      "text": "I think there will be more of everything. I think that's a pretty safe bet.",
      "id": "ep_31_ut_248"
    },
    {
      "end": 4519560,
      "speaker": "Enrico Bertini",
      "start": 4475544,
      "text": "No, but I think, honestly, what I really hope to see more that is connected to that is a better description of the process rather than just the final product. And that's the reason why. Moritz, I really, really like your B's piece. Because it's the case study. Yeah, exactly. Having more case studies showing to people what it takes to come to this final product and how many intermediary painful steps there can be in between, well, that's super, super important, especially for people who are learning. I mean, understanding what it takes to come to this final piece of work. It's a lot of work and a very complicated thought process. So exposing people to what is this process is going to be very beneficial, in my opinion.",
      "id": "ep_31_ut_249"
    },
    {
      "end": 4564970,
      "speaker": "Moritz Stefaner",
      "start": 4520860,
      "text": "One last area I think that's going to be really interesting and that we all don't have properly on the radar yet is like, what happens with the Internet of things, what happens when we move away from the screen. And I think a lot of future visualizations will also deal with ambient awareness and monitoring and, you know, and that's absolutely. I think that's very interesting to think about because it's exactly not findings driven or it's also not storytelling, which I also love. No, but it's. That's why I also said more of everything. But I think this field is going to grow as well. Like just be aware of all that stuff that happens around you, like all your devices, your home friends, the Internet and so on. You know, everything has an ip address and. Yeah, and color change and the wearability.",
      "id": "ep_31_ut_250"
    },
    {
      "end": 4570390,
      "speaker": "Robert Kosara",
      "start": 4565050,
      "text": "Of devices will be the big technology development. So that will be a natural home for these things.",
      "id": "ep_31_ut_251"
    },
    {
      "end": 4599960,
      "speaker": "Enrico Bertini",
      "start": 4570730,
      "text": "Yeah, and I think last year we had at least a couple of episodes on that. Right, Moritz? We had one on physical visualizations, data sculptures. Data sculptures, and we had one with Petra Eisenberg on going beyond the desktop. And we also had Dominico's power on mobile visualization, on mobile devices. So that's definitely happening. And you are right, probably we will see more of this stuff in 2014. That's really really cool.",
      "id": "ep_31_ut_252"
    },
    {
      "end": 4604080,
      "speaker": "Moritz Stefaner",
      "start": 4600340,
      "text": "Yeah. So it's spreading in all areas, I think, that's for sure.",
      "id": "ep_31_ut_253"
    },
    {
      "end": 4608900,
      "speaker": "Enrico Bertini",
      "start": 4608140,
      "text": "Wow.",
      "id": "ep_31_ut_254"
    },
    {
      "end": 4612132,
      "speaker": "Moritz Stefaner",
      "start": 4609060,
      "text": "Getting all excited again. Yeah, let's do this.",
      "id": "ep_31_ut_255"
    },
    {
      "end": 4613520,
      "speaker": "Andy Kirk",
      "start": 4612156,
      "text": "Let's go back to work.",
      "id": "ep_31_ut_256"
    },
    {
      "end": 4625270,
      "speaker": "Enrico Bertini",
      "start": 4616890,
      "text": "Yeah, absolutely. Should we wrap it up here? Do you guys want to add anything?",
      "id": "ep_31_ut_257"
    },
    {
      "end": 4629230,
      "speaker": "Robert Kosara",
      "start": 4625930,
      "text": "Nothing for me. Let's just see what happens. Enjoy the ride.",
      "id": "ep_31_ut_258"
    },
    {
      "end": 4639250,
      "speaker": "Enrico Bertini",
      "start": 4630530,
      "text": "I think we can say that visualization is still growing. Going very well. Lots of new stuff coming up. It's still exciting to be here, right?",
      "id": "ep_31_ut_259"
    },
    {
      "end": 4641240,
      "speaker": "Robert Kosara",
      "start": 4639290,
      "text": "Yeah, yeah, absolutely. That's the main thing.",
      "id": "ep_31_ut_260"
    },
    {
      "end": 4643364,
      "speaker": "Enrico Bertini",
      "start": 4641370,
      "text": "I'm not tired yet. I like it.",
      "id": "ep_31_ut_261"
    },
    {
      "end": 4644468,
      "speaker": "Moritz Stefaner",
      "start": 4643412,
      "text": "Oh, I'm tired.",
      "id": "ep_31_ut_262"
    },
    {
      "end": 4646040,
      "speaker": "Robert Kosara",
      "start": 4644604,
      "text": "There's no question about that.",
      "id": "ep_31_ut_263"
    },
    {
      "end": 4647760,
      "speaker": "Enrico Bertini",
      "start": 4646620,
      "text": "Tired of it.",
      "id": "ep_31_ut_264"
    },
    {
      "end": 4649396,
      "speaker": "Moritz Stefaner",
      "start": 4648060,
      "text": "Tired, but can't stop.",
      "id": "ep_31_ut_265"
    },
    {
      "end": 4650240,
      "speaker": "Andy Kirk",
      "start": 4649508,
      "text": "Tired.",
      "id": "ep_31_ut_266"
    },
    {
      "end": 4671134,
      "speaker": "Moritz Stefaner",
      "start": 4653820,
      "text": "Okay, well, I'm really looking forward. And if you think about, like, at the beginning, we all were like, yeah, 2013 was sort of slow. And now you know that. Now that you think back, so much has happened again and again. The field has reinvented itself. And I'm really looking forward to what's next in play.",
      "id": "ep_31_ut_267"
    },
    {
      "end": 4676726,
      "speaker": "Enrico Bertini",
      "start": 4671182,
      "text": "But still, I have the overall impression that it's getting more solid as well. So that's a good feeling.",
      "id": "ep_31_ut_268"
    },
    {
      "end": 4679542,
      "speaker": "Moritz Stefaner",
      "start": 4676878,
      "text": "Absolutely. Cool.",
      "id": "ep_31_ut_269"
    },
    {
      "end": 4680210,
      "speaker": "Enrico Bertini",
      "start": 4679606,
      "text": "Good.",
      "id": "ep_31_ut_270"
    },
    {
      "end": 4683686,
      "speaker": "Moritz Stefaner",
      "start": 4680630,
      "text": "And another year of data stories. I'm looking forward to that too.",
      "id": "ep_31_ut_271"
    },
    {
      "end": 4710020,
      "speaker": "Enrico Bertini",
      "start": 4683758,
      "text": "So please don't forget, if you want to send comments, feedback or questions, what is in the post, you can suggest new. New episodes or ideas or whatever. I mean, just write and we'll. Yeah, we'll try to connect in some way or another. So, Moritz, you want to. I don't even remember. What's the email address? Can you repeat it?",
      "id": "ep_31_ut_272"
    },
    {
      "end": 4719164,
      "speaker": "Moritz Stefaner",
      "start": 4710520,
      "text": "Oh, it's info. Or is it mail? Eitherstory. Yeah, probably both will arrive, so.",
      "id": "ep_31_ut_273"
    },
    {
      "end": 4720240,
      "speaker": "Enrico Bertini",
      "start": 4719292,
      "text": "Exactly.",
      "id": "ep_31_ut_274"
    },
    {
      "end": 4722120,
      "speaker": "Moritz Stefaner",
      "start": 4720820,
      "text": "Or shoot us a note.",
      "id": "ep_31_ut_275"
    },
    {
      "end": 4732524,
      "speaker": "Enrico Bertini",
      "start": 4723540,
      "text": "You'll find Facebook, Twitter, Google, Facebook, anything. Okay. You can call us if you want. We should put ourselves.",
      "id": "ep_31_ut_276"
    },
    {
      "end": 4736160,
      "speaker": "Moritz Stefaner",
      "start": 4732572,
      "text": "Nah, don't call me, just sound a horn.",
      "id": "ep_31_ut_277"
    },
    {
      "end": 4742868,
      "speaker": "Enrico Bertini",
      "start": 4741660,
      "text": "Okay, cool.",
      "id": "ep_31_ut_278"
    },
    {
      "end": 4746440,
      "speaker": "Moritz Stefaner",
      "start": 4743004,
      "text": "Thanks, Andy. Thank you. It was a pleasure, as usual.",
      "id": "ep_31_ut_279"
    },
    {
      "end": 4747676,
      "speaker": "Andy Kirk",
      "start": 4746820,
      "text": "Thanks for having us.",
      "id": "ep_31_ut_280"
    },
    {
      "end": 4750724,
      "speaker": "Moritz Stefaner",
      "start": 4747708,
      "text": "See you latest in 2015 for the 2014 wrap up then.",
      "id": "ep_31_ut_281"
    },
    {
      "end": 4754640,
      "speaker": "Enrico Bertini",
      "start": 4750772,
      "text": "Yeah. We wish you all the best for 2014.",
      "id": "ep_31_ut_282"
    },
    {
      "end": 4755948,
      "speaker": "Robert Kosara",
      "start": 4755100,
      "text": "Thank you very much.",
      "id": "ep_31_ut_283"
    },
    {
      "end": 4756708,
      "speaker": "Moritz Stefaner",
      "start": 4756044,
      "text": "Okie doke.",
      "id": "ep_31_ut_284"
    },
    {
      "end": 4759012,
      "speaker": "Enrico Bertini",
      "start": 4756764,
      "text": "Thank you, guys. Take care.",
      "id": "ep_31_ut_285"
    },
    {
      "end": 4759692,
      "speaker": "Moritz Stefaner",
      "start": 4759076,
      "text": "Thanks. Bye.",
      "id": "ep_31_ut_286"
    }
  ],
  "confidence": 0.9103413579116,
  "audio_duration": 4768,
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_status_code": null,
  "webhook_auth": false,
  "webhook_auth_header_name": null,
  "speed_boost": false,
  "auto_highlights_result": null,
  "auto_highlights": false,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_audio_quality": null,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "content_safety": false,
  "iab_categories": true,
  "content_safety_labels": {
    "status": "unavailable",
    "results": [],
    "summary": {}
  },
  "language_detection": false,
  "language_detection_threshold": null,
  "language_confidence": null,
  "custom_spelling": null,
  "throttled": false,
  "auto_chapters": true,
  "summarization": false,
  "summary_type": null,
  "summary_model": null,
  "custom_topics": false,
  "topics": [],
  "speech_threshold": null,
  "speech_model": "best",
  "chapters": [
    {
      "summary": "Enrico: 2014 is going to be another all year for data stories. What we want to change a little bit, we would like to get more engagement from listeners. At the end of each episode, you can always comment on that on our blog, datastory. com.",
      "gist": "Data stories: No Change for 2014",
      "headline": "This is Data stories number 31, the first episode of 2014",
      "start": 4840,
      "end": 166100,
      "id": "ep_31_ch_0"
    },
    {
      "summary": "This is the first episode of the new year. We will try to go through the old 2013, trying to see what were the highlights. NDR robbers will help us doing that. We have a full list of stuff we want to talk about.",
      "gist": "2013",
      "headline": "NDR robbers go back through 2013 to see what were the highlights",
      "start": 167520,
      "end": 228430,
      "id": "ep_31_ch_1"
    },
    {
      "summary": "It was a great year, was 2013. I felt it was generally a little bit quieter relative to the ongoing growth of the field. The first project that I think is on most of our radars was the workaround the guns project. I think it should the field at its best, really.",
      "gist": "Top 10 visualisations of 2013",
      "headline": "2013 was generally quieter relative to ongoing growth of the field",
      "start": 229730,
      "end": 361220,
      "id": "ep_31_ch_2"
    },
    {
      "summary": "Andy Keen: The gun murders project will be seen as a landmark project in terms of the approach and the style that it took. The human side of data, on the one hand, but also the storytelling techniques and all these new ways of bridging interactive, open experiences with a more guided storytelling approach.",
      "gist": "The Data Visualization of Gun Violence",
      "headline": "Andy: The gun murders visualization is a landmark piece in data visualization",
      "start": 362080,
      "end": 625026,
      "id": "ep_31_ch_3"
    },
    {
      "summary": "Long form digital journalism was a major trend throughout 2013. The snowfall thing is obviously a good innovation, but I'm also a bit worried that it gets distracting. There are a lot of great stuff, really, from news outlets and newspapers. Any other notes noteworthy trends in the newspaper area?",
      "gist": "The Storytelling in 2013",
      "headline": "Snowfall was a major trend in long form digital journalism in 2013",
      "start": 625218,
      "end": 971574,
      "id": "ep_31_ch_4"
    },
    {
      "summary": "The Guardian has always been the flagship newspaper around data journalism. And I think they've been hiring for data visualization experts. Looking beyond newspapers and institutions, I think in businesses, data visualization is just starting to get that momentum going.",
      "gist": "The Guardian's focus on data journalism",
      "headline": "The Guardian is hiring for data visualization experts for next year",
      "start": 971702,
      "end": 1255950,
      "id": "ep_31_ch_5"
    },
    {
      "summary": "Last year was the year of three particular techniques, maybe coming from 2012 as well. slope graphs, connected scatter plots, Sankey diagrams. Common to all these is they all tell multiple stories. Maybe there's a bit more courage out there going beyond the tried and tested methods.",
      "gist": "2015: The Year of Data Science",
      "headline": "Last year was the year of three particular techniques, maybe coming from 2012",
      "start": 1259010,
      "end": 1425424,
      "id": "ep_31_ch_6"
    },
    {
      "summary": "How much of the design space do you think there is still out there to discover? What we will see, I think, a lot more now are reasonably subtle. Things or new combinations. That's the space that is still open for innovation.",
      "gist": "Quantum design: What's New?",
      "headline": "How much of the design space do you think there is still to discover",
      "start": 1425552,
      "end": 1615466,
      "id": "ep_31_ch_7"
    },
    {
      "summary": "The other trends moving on to, to maps. There were two main strands. Pointillistic cartography and aggregation in general. How can we visualize aggregations, but still respect the individual?",
      "gist": "The End of Pointillistic Maps",
      "headline": "The other trends moving on to, to maps, maybe not trends as such",
      "start": 1615498,
      "end": 1874370,
      "id": "ep_31_ch_8"
    },
    {
      "summary": "Audio is going to be the next big thing. What audio can do, I think is interesting, is it can give you a sense of time. Maybe audio visualization will be a trend in the coming weeks.",
      "gist": "Mapping the World With Audio",
      "headline": "Audio can give you a sense of time, which is useful for visualization",
      "start": 1875510,
      "end": 2114520,
      "id": "ep_31_ch_9"
    },
    {
      "summary": "Tableau's story points feature will let you build stories in your visualization tool. It's the best of both worlds, have a presentation tool and have the analysis right at your fingertips. I see this becoming a total standard thing to do for all business intelligence tools going forward.",
      "gist": "Top Storytelling in Tableau in 2013",
      "headline": "How about tools? Are there any new tools around that have been used in 2013",
      "start": 2116500,
      "end": 2356040,
      "id": "ep_31_ch_10"
    },
    {
      "summary": "R is a statistical package or a language for doing statistical analysis. Story points also are meant to be not just obviously used in the desktop, but also on Tableau server. Both features will immediately translate to Tableau public as well as desktop.",
      "gist": "Tableau 8.1 and 8.2: Story Points and",
      "headline": "Both features will immediately translate to Tableau public as well as desktop",
      "start": 2357980,
      "end": 2450090,
      "id": "ep_31_ch_11"
    },
    {
      "summary": "More data-heavy tools like raw are emerging. But in general around tools, I think we're still in a very fragmented space. It's whether we'll see continue fragmentation or a bit more convergence.",
      "gist": "Top Five Data-heavy Tools in 2014",
      "headline": "I was happy to see more tools emerge for data visualization",
      "start": 2450870,
      "end": 2689900,
      "id": "ep_31_ch_12"
    },
    {
      "summary": "D3 has been growing throughout 2013. Still going strong is even more established now than one year ago. But I would actually like to see a bit more competition. My hope for 2014 is some sort of black horse JavaScript framework.",
      "gist": "D3: A Solid Community in 2014",
      "headline": "I think D3 has been growing throughout 2013",
      "start": 2691560,
      "end": 2948150,
      "id": "ep_31_ch_13"
    },
    {
      "summary": "The data with community has developed great. The last year it has really greatly developed. There are these new websites that have sprung up over the last year that I think are really interesting for that. It needs now the kind of footfall to follow suit and really kind of give it some momentum.",
      "gist": "The Design Community in 2017",
      "headline": "Community in the design world has developed tremendously over the last year",
      "start": 2948270,
      "end": 3206460,
      "id": "ep_31_ch_14"
    },
    {
      "summary": "Nathan: Is it just me or is actually the crappy stuff getting less? Is I just getting too mild over the years? I mean, subjectively, I feel I see less awful stuff. But on the other hand, certainly there's a lot more good work being generated.",
      "gist": "Is the Crappy Infographics Going Away?",
      "headline": "Is crappy stuff getting less or is there more good stuff out there",
      "start": 3208320,
      "end": 3411490,
      "id": "ep_31_ch_15"
    },
    {
      "summary": "Andy of the year goes to Andy. Second year in the truck. Best Andy overall in second place. Shall we hand out some awards? Like. To each other? Why not? Maybe we should.",
      "gist": "Andy's Year in the Truck",
      "headline": "Shall we hand out some awards? Like. What? To each other",
      "start": 3415950,
      "end": 3434970,
      "id": "ep_31_ch_16"
    },
    {
      "summary": "Most visible work of last year seemed to come from Giorgia Lupi and the team at Accurate studios. What surprises me of the work from accurate is that they have been able to do some fairly novel and complex stuff and still be successful. Maybe it's this overall trend that visualization is becoming more human and less machine.",
      "gist": "The Year in Data Visualization",
      "headline": "The most visible work of last year seemed to come from Accurate studios",
      "start": 3439130,
      "end": 3633958,
      "id": "ep_31_ch_17"
    },
    {
      "summary": "Isabel Mireles wrote a book called design for information. She uses a lot of the same examples that you've seen before. But she digs a lot deeper. And I hope that this is actually going to be a trend going forward.",
      "gist": "Best Visualization Books of 2015",
      "headline": "A lot of visualization books are lazy, Robert says",
      "start": 3634134,
      "end": 3806700,
      "id": "ep_31_ch_18"
    },
    {
      "summary": "I'm still waiting for Tamara Munzner's book. Manuel Lima's new book is finished. David McCandless is working on a book, one says. I think a few other interesting ones. Books are old media anyways. Who cares?",
      "gist": "A few great books read in 2014",
      "headline": "Any other great books? I didn't read so many info. But they are coming up for 2014",
      "start": 3809120,
      "end": 3850860,
      "id": "ep_31_ch_19"
    },
    {
      "summary": "I'm looking forward to attending tapestry next month, which is hosted by. Robert. Is it again centered around storytelling? Is it the main thing? One of the highlights for 2014 in terms of conferences is that this will move to Europe for the first time.",
      "gist": "TIP 2014: The future of conferences",
      "headline": "Robert Yorub: Should we move on to 2014 then and talk about the future",
      "start": 3857710,
      "end": 4185174,
      "id": "ep_31_ch_20"
    },
    {
      "summary": "A lot of the published work is coming out of Germany, the Netherlands, France in particular. Well the UK too. So I think those four countries probably are the bulk of this work in Europe. There's a lot of contrasts actually in Europe, like UK and continental.",
      "gist": "The design of the future",
      "headline": "A lot of published work is coming out of Germany, the Netherlands, France",
      "start": 4185302,
      "end": 4212470,
      "id": "ep_31_ch_21"
    },
    {
      "summary": "A shift towards more analysis, more insights. People are now accepting work that's more about storytelling. More reflection and more on the other side on the web. Any other bold predictions for 2014?",
      "gist": "Wonders of the Year 2014",
      "headline": "Moritz: I would like to see more analysis, more insights in 2014",
      "start": 4214210,
      "end": 4519560,
      "id": "ep_31_ch_22"
    },
    {
      "summary": "Andy: A lot of future visualizations will also deal with ambient awareness and monitoring. He says visualization is still growing. Lots of new stuff coming up. See you latest in 2015 for the 2014 wrap up.",
      "gist": "A Year in Data Visualizations",
      "headline": "Andy: I think visualization is still growing. And if you think about, like, 2013 was slow",
      "start": 4520860,
      "end": 4759692,
      "id": "ep_31_ch_23"
    }
  ],
  "disfluencies": false,
  "entity_detection": false,
  "sentiment_analysis": false,
  "sentiment_analysis_results": null,
  "entities": null,
  "speakers_expected": null,
  "summary": null,
  "custom_topics_results": null,
  "is_deleted": null,
  "episode_num": "31",
  "episode_metadata": {
    "speakers": [
      "Enrico Bertini",
      "Moritz Stefaner",
      "Andy Kirk",
      "Robert Kosara"
    ],
    "WPid": "146",
    "url": "https://datastori.es/podlove/file/318/s/feed/c/mp3/datastories-31.mp3",
    "episode_title": "Review, preview w/ Robert Kosara and Andy Kirk"
  }
}