{
  "id": "b48641e9-a019-4edb-a4ea-c947f75ea37c",
  "language_model": "assemblyai_default",
  "acoustic_model": "assemblyai_default",
  "language_code": "en_us",
  "status": "completed",
  "audio_url": "https://datastori.es/podlove/file/150/s/feed/c/mp3/Datastories-19.mp3",
  "utterances": [
    {
      "end": 24318,
      "speaker": "Enrico Bertini",
      "start": 13160,
      "text": "Hi, everyone. Data stories number 19 with Moritz. And our special guest today, Santiago Ortiz. Hi, guys. How are you? Hey.",
      "id": "ep_19_ut_0"
    },
    {
      "end": 24918,
      "speaker": "Moritz Stefaner",
      "start": 24366,
      "text": "Doing great.",
      "id": "ep_19_ut_1"
    },
    {
      "end": 28394,
      "speaker": "Santiago Ortiz",
      "start": 25006,
      "text": "Hi, Enrico. Hi. Hi, Enrico. Hi, Moritz.",
      "id": "ep_19_ut_2"
    },
    {
      "end": 30578,
      "speaker": "Moritz Stefaner",
      "start": 28574,
      "text": "Yeah, great to have you.",
      "id": "ep_19_ut_3"
    },
    {
      "end": 34778,
      "speaker": "Enrico Bertini",
      "start": 30706,
      "text": "We have three continents today. Fantastic.",
      "id": "ep_19_ut_4"
    },
    {
      "end": 35854,
      "speaker": "Moritz Stefaner",
      "start": 34946,
      "text": "That's true.",
      "id": "ep_19_ut_5"
    },
    {
      "end": 38194,
      "speaker": "Santiago Ortiz",
      "start": 36674,
      "text": "Big triangle here.",
      "id": "ep_19_ut_6"
    },
    {
      "end": 39618,
      "speaker": "Enrico Bertini",
      "start": 38354,
      "text": "Big triangle here.",
      "id": "ep_19_ut_7"
    },
    {
      "end": 47974,
      "speaker": "Moritz Stefaner",
      "start": 39706,
      "text": "Iceland. Antarctica. Antarctica. We have the great circle of data visualization.",
      "id": "ep_19_ut_8"
    },
    {
      "end": 51930,
      "speaker": "Enrico Bertini",
      "start": 48794,
      "text": "How is it going, guys? Moritz, good.",
      "id": "ep_19_ut_9"
    },
    {
      "end": 74142,
      "speaker": "Moritz Stefaner",
      "start": 52002,
      "text": "Busy. I'm teaching. You're teaching? Yeah, I'm right in between my course. Usually I brag how bad a teacher I am, so I can continue to do that. It's pretty fun. I have 20 students, and they do interesting stuff, and now they're all, like, in between. And they have some data, but they don't know yet quite what to do with it. So it's interesting times.",
      "id": "ep_19_ut_10"
    },
    {
      "end": 81714,
      "speaker": "Santiago Ortiz",
      "start": 74278,
      "text": "It's a good time to quit. You have the data. You already know. Things gonna be very difficult.",
      "id": "ep_19_ut_11"
    },
    {
      "end": 92892,
      "speaker": "Moritz Stefaner",
      "start": 82774,
      "text": "No. But all of them collect sort of unique data or, I don't know, at least assemble new data sets. So I think that's fantastic. And, yeah, it's gonna be interesting.",
      "id": "ep_19_ut_12"
    },
    {
      "end": 93460,
      "speaker": "Santiago Ortiz",
      "start": 92988,
      "text": "Great.",
      "id": "ep_19_ut_13"
    },
    {
      "end": 96396,
      "speaker": "Enrico Bertini",
      "start": 93572,
      "text": "So if you are teaching, I should be designing, right?",
      "id": "ep_19_ut_14"
    },
    {
      "end": 98388,
      "speaker": "Moritz Stefaner",
      "start": 96580,
      "text": "Yeah, that would make sense.",
      "id": "ep_19_ut_15"
    },
    {
      "end": 99172,
      "speaker": "Santiago Ortiz",
      "start": 98556,
      "text": "Are you?",
      "id": "ep_19_ut_16"
    },
    {
      "end": 102544,
      "speaker": "Enrico Bertini",
      "start": 99268,
      "text": "No, I'm not. I'm teaching teaching as well.",
      "id": "ep_19_ut_17"
    },
    {
      "end": 103524,
      "speaker": "Moritz Stefaner",
      "start": 102884,
      "text": "Too bad.",
      "id": "ep_19_ut_18"
    },
    {
      "end": 108344,
      "speaker": "Enrico Bertini",
      "start": 103604,
      "text": "Yeah. Yeah. And you, Santiago? How is it going?",
      "id": "ep_19_ut_19"
    },
    {
      "end": 131954,
      "speaker": "Santiago Ortiz",
      "start": 109044,
      "text": "Things are going very well. I am also very busy, but I am working on interesting projects. I just arrived from Nashville, exactly where we met, and it was fantastic. Fantastic experience, fantastic conference, and talked with a lot of people, including you. Yeah. Tapestry. Fantastic.",
      "id": "ep_19_ut_20"
    },
    {
      "end": 154454,
      "speaker": "Enrico Bertini",
      "start": 132574,
      "text": "Yeah, yeah, yeah. Tapestry was great. I really, really enjoyed it. It's one of the best events I've. I've attended during the last few years. It's been really great. Great. And I was surprised. I met so many people who actually dropped by and said, hey, data stories. Cool.",
      "id": "ep_19_ut_21"
    },
    {
      "end": 159546,
      "speaker": "Moritz Stefaner",
      "start": 156634,
      "text": "Did you wear your data stories t shirt and your data stories?",
      "id": "ep_19_ut_22"
    },
    {
      "end": 165082,
      "speaker": "Enrico Bertini",
      "start": 159690,
      "text": "Somebody actually asked for the data stories t shirt. I was a bit.",
      "id": "ep_19_ut_23"
    },
    {
      "end": 168116,
      "speaker": "Moritz Stefaner",
      "start": 165178,
      "text": "Yeah, yeah, we can do that sometimes.",
      "id": "ep_19_ut_24"
    },
    {
      "end": 176932,
      "speaker": "Santiago Ortiz",
      "start": 168180,
      "text": "It makes sense. It makes sense because the conference was quite related with your work and with data stories itself.",
      "id": "ep_19_ut_25"
    },
    {
      "end": 179252,
      "speaker": "Moritz Stefaner",
      "start": 177108,
      "text": "Yeah, that's true. We even picked the right name.",
      "id": "ep_19_ut_26"
    },
    {
      "end": 180264,
      "speaker": "Santiago Ortiz",
      "start": 179308,
      "text": "Exactly.",
      "id": "ep_19_ut_27"
    },
    {
      "end": 193108,
      "speaker": "Moritz Stefaner",
      "start": 182404,
      "text": "And it was just one day. Right? So it was just one day. It was really quick. Yeah. So I sort of followed it on Twitter, and it was like, everybody was, like, super excited, writing a lot, and then it was over again. I was like, oh, yeah, it's just.",
      "id": "ep_19_ut_28"
    },
    {
      "end": 244678,
      "speaker": "Santiago Ortiz",
      "start": 193156,
      "text": "One day was so fast, and. But the conferences were so well chosen. Like, you had, like, very different approaches, and some of them were, like, very rational towards, like, storytelling and other conferences, including the last one by Scott McLeod was, storytelling itself was like a fantastic experience. So I think that was part of the, of the nice experience there. And then in the middle, some people were allowed to demo or to feature projects. I was there demoing my work, and it also was great. Yes. I talked with, I don't know, hundreds of people. I don't know, at least tens. I don't know. It was intensive, but fantastic.",
      "id": "ep_19_ut_29"
    },
    {
      "end": 248634,
      "speaker": "Enrico Bertini",
      "start": 244726,
      "text": "Yeah. There was a full cluster of people in the room around Santiago.",
      "id": "ep_19_ut_30"
    },
    {
      "end": 253312,
      "speaker": "Moritz Stefaner",
      "start": 251054,
      "text": "Reporters with cameras, flashlights.",
      "id": "ep_19_ut_31"
    },
    {
      "end": 253804,
      "speaker": "Enrico Bertini",
      "start": 253398,
      "text": "Yeah.",
      "id": "ep_19_ut_32"
    },
    {
      "end": 256184,
      "speaker": "Moritz Stefaner",
      "start": 253884,
      "text": "Mister Artis, one more question.",
      "id": "ep_19_ut_33"
    },
    {
      "end": 261956,
      "speaker": "Santiago Ortiz",
      "start": 256564,
      "text": "Don't remember that exactly, but a lot of questions. Yes, a lot of conversations. Yeah.",
      "id": "ep_19_ut_34"
    },
    {
      "end": 262836,
      "speaker": "Moritz Stefaner",
      "start": 262060,
      "text": "That's great.",
      "id": "ep_19_ut_35"
    },
    {
      "end": 271052,
      "speaker": "Enrico Bertini",
      "start": 262980,
      "text": "Yeah. And honestly, the event was, was fantastic. The speakers were amazing. I mean, all of them were really.",
      "id": "ep_19_ut_36"
    },
    {
      "end": 272092,
      "speaker": "Moritz Stefaner",
      "start": 271108,
      "text": "What was your favorite?",
      "id": "ep_19_ut_37"
    },
    {
      "end": 282236,
      "speaker": "Enrico Bertini",
      "start": 272188,
      "text": "My favorite, I think my absolute favorite was Scott McCloud. I think he really did a show. It was, it was fantastic. Awesome.",
      "id": "ep_19_ut_38"
    },
    {
      "end": 296864,
      "speaker": "Santiago Ortiz",
      "start": 282300,
      "text": "I mean, very difficult to beat. Sorry, very difficult to beat. He's a professional. He's telling stories and presenting images and writing new concepts out of new images.",
      "id": "ep_19_ut_39"
    },
    {
      "end": 328108,
      "speaker": "Enrico Bertini",
      "start": 297524,
      "text": "And honestly, I mean, I was surprised by the depth of his thinking. I mean, it was not just showing stuff. It was actually, at least from my opinion, is that he was actually presenting thing. That actually made me think a lot. And it shows that what he presents is probably the result of many years of thinking about it and decades, basically 25 years old.",
      "id": "ep_19_ut_40"
    },
    {
      "end": 329428,
      "speaker": "Moritz Stefaner",
      "start": 328196,
      "text": "It's really deep.",
      "id": "ep_19_ut_41"
    },
    {
      "end": 398972,
      "speaker": "Enrico Bertini",
      "start": 329556,
      "text": "It's really deep. But look, I mean, he was my, my favorite one, but the others were fantastic as well. So we had Pat Henry from Stanford. So maybe people who are not in academia might actually not know him well, but in academia, he's a superstar. Right? And, I mean, he's the person behind, basically behind Pixar. Okay. And then, so he's been doing graphics for a very long time. And then he's been doing lots of visualization stuff as well. It's really a big, big name. And it was fun as well. He pretended to show some mathematical demonstration visually, I think after a couple of minutes, the audience was lost, apart from a couple of geeks. But the way he presented it was really, really nice. Every time his pics, it makes me think about something new. And he was great. And then we had a couple of people from New York Times, and they have shown fantastic stuff as well. Who else we had? I mean, Santiago, I think every single speaker was really, really great.",
      "id": "ep_19_ut_42"
    },
    {
      "end": 403300,
      "speaker": "Santiago Ortiz",
      "start": 399148,
      "text": "Indeed. I enjoyed also Nigel Holmes because.",
      "id": "ep_19_ut_43"
    },
    {
      "end": 405188,
      "speaker": "Enrico Bertini",
      "start": 403412,
      "text": "Oh, Nigel. Yeah, Nigel was.",
      "id": "ep_19_ut_44"
    },
    {
      "end": 406224,
      "speaker": "Santiago Ortiz",
      "start": 405236,
      "text": "Nigel. Sorry.",
      "id": "ep_19_ut_45"
    },
    {
      "end": 409464,
      "speaker": "Enrico Bertini",
      "start": 407844,
      "text": "Nigel is a character.",
      "id": "ep_19_ut_46"
    },
    {
      "end": 463876,
      "speaker": "Santiago Ortiz",
      "start": 409964,
      "text": "Really good because he's explaining stuff and acting, acting, playing a lot. It was great. It was fantastic. He made this trick with a rope with the exact length of the world record of long jumping, which is something unbelievable when you see the actual distance that a human being can jump. And he started with that trick, and the audience was totally cocked and. And then he started, like, introducing more theoretical stuff. But it was fantastic. Yes. And I had the opportunity to talk with him in the. In the demoing session, and it was fantastic.",
      "id": "ep_19_ut_47"
    },
    {
      "end": 467684,
      "speaker": "Moritz Stefaner",
      "start": 464060,
      "text": "He's super nice. We could have him. Enrico. We could invite him to.",
      "id": "ep_19_ut_48"
    },
    {
      "end": 468864,
      "speaker": "Santiago Ortiz",
      "start": 467724,
      "text": "Oh, please do that.",
      "id": "ep_19_ut_49"
    },
    {
      "end": 471804,
      "speaker": "Moritz Stefaner",
      "start": 469404,
      "text": "And he's. He's been around forever and.",
      "id": "ep_19_ut_50"
    },
    {
      "end": 472172,
      "speaker": "Enrico Bertini",
      "start": 471884,
      "text": "Yeah, yeah.",
      "id": "ep_19_ut_51"
    },
    {
      "end": 473204,
      "speaker": "Moritz Stefaner",
      "start": 472188,
      "text": "And he has a lot.",
      "id": "ep_19_ut_52"
    },
    {
      "end": 479306,
      "speaker": "Enrico Bertini",
      "start": 473284,
      "text": "Probably gonna. Gonna listen to this episode because he was totally hooked when we talked about it.",
      "id": "ep_19_ut_53"
    },
    {
      "end": 480174,
      "speaker": "Moritz Stefaner",
      "start": 479330,
      "text": "Very good.",
      "id": "ep_19_ut_54"
    },
    {
      "end": 481618,
      "speaker": "Enrico Bertini",
      "start": 480554,
      "text": "Hi, Nigel.",
      "id": "ep_19_ut_55"
    },
    {
      "end": 485614,
      "speaker": "Santiago Ortiz",
      "start": 481786,
      "text": "Hi, Nigan. Hi, Nigel.",
      "id": "ep_19_ut_56"
    },
    {
      "end": 487094,
      "speaker": "Enrico Bertini",
      "start": 485994,
      "text": "Hi, Nigel.",
      "id": "ep_19_ut_57"
    },
    {
      "end": 488634,
      "speaker": "Moritz Stefaner",
      "start": 487394,
      "text": "We make a blue episode.",
      "id": "ep_19_ut_58"
    },
    {
      "end": 490514,
      "speaker": "Enrico Bertini",
      "start": 488674,
      "text": "Yeah, we have to make a blue episode.",
      "id": "ep_19_ut_59"
    },
    {
      "end": 492578,
      "speaker": "Moritz Stefaner",
      "start": 490634,
      "text": "We can change the whole logo, everything.",
      "id": "ep_19_ut_60"
    },
    {
      "end": 502358,
      "speaker": "Enrico Bertini",
      "start": 492706,
      "text": "Absolutely, absolutely. We can do that. Yeah. Anyway, tapestry was great. Was great.",
      "id": "ep_19_ut_61"
    },
    {
      "end": 505526,
      "speaker": "Moritz Stefaner",
      "start": 502406,
      "text": "Sounds good. Yeah. Will they do another one next year?",
      "id": "ep_19_ut_62"
    },
    {
      "end": 509234,
      "speaker": "Enrico Bertini",
      "start": 505670,
      "text": "I don't know. We have to ask to Robert Kosara, I think so.",
      "id": "ep_19_ut_63"
    },
    {
      "end": 511982,
      "speaker": "Santiago Ortiz",
      "start": 509734,
      "text": "He mentioned something about. Yes.",
      "id": "ep_19_ut_64"
    },
    {
      "end": 516046,
      "speaker": "Moritz Stefaner",
      "start": 512158,
      "text": "It sounded like a big success and they should probably do it again. It sounds like.",
      "id": "ep_19_ut_65"
    },
    {
      "end": 523554,
      "speaker": "Enrico Bertini",
      "start": 516110,
      "text": "Yeah, sure. Absolutely. Well, anyway, we are here to talk about Santiago, not tapestry. Right.",
      "id": "ep_19_ut_66"
    },
    {
      "end": 524718,
      "speaker": "Moritz Stefaner",
      "start": 523894,
      "text": "That's true.",
      "id": "ep_19_ut_67"
    },
    {
      "end": 536036,
      "speaker": "Enrico Bertini",
      "start": 524846,
      "text": "So, I don't know, maybe there are a couple of people in the world who don't know Santiago yet. So you might want to introduce yourself, Santiago, and tell to the world who you are, what you do.",
      "id": "ep_19_ut_68"
    },
    {
      "end": 608492,
      "speaker": "Santiago Ortiz",
      "start": 536180,
      "text": "Okay. Okay. Santiago Ortiz. I come from Colombia, but then I live in several places and I work in several places, including Spain. In Bogota. In Colombia, I studied mathematics, but from the very beginning, I knew I wanted to do different stuff from just doing mathematics or research or science. I had this idea of mixing math and music or math and art from the very beginning. Right. In 2001. No, sorry. In 99, still in Colombia, I found a company with a couple of friends. It was like web agency, very conventional, but I tried to do different things. It was the time that when Flash was entering the scene, opening interesting opportunities to create interactive stuff for the web, and I started playing with Flash, and then I co evolved with.",
      "id": "ep_19_ut_69"
    },
    {
      "end": 611516,
      "speaker": "Moritz Stefaner",
      "start": 608548,
      "text": "So did you start with Flash? Three timeline scripts.",
      "id": "ep_19_ut_70"
    },
    {
      "end": 707764,
      "speaker": "Santiago Ortiz",
      "start": 611580,
      "text": "Yes, very, very simple scripts. And from the very beginning, I tried to use, like, mathematical tools, and it was very hard, really difficult. But then the tool started, like, evolving and was quite interesting process. Right. A lot of people, like, learned how to mix, design, coding and math. At the same time flash was evolving. Right. So at that moment, it was clear for me that I didn't want to create websites as well, so I went to Spain in 2001 and I started living mainly as a teacher, like teaching interactive stuff for flash, always introducing a lot of math in my classes, and also as an art and science researcher or something like that. I started working in projects that mixed art and science in different ways. I worked a lot with the media lab at Madrid, which continued being a fantastic place to explore these kind of things. And then in 2005, I co found a company devoted. Specialized in information visualization. Interactive information visualization. I think it's the first one in Europe at the time.",
      "id": "ep_19_ut_71"
    },
    {
      "end": 717716,
      "speaker": "Moritz Stefaner",
      "start": 707884,
      "text": "Yeah, I would say so too. I sort of followed that at that time already. And I also remember there was stamen in the US and there was Bestiario in Europe, and that was it.",
      "id": "ep_19_ut_72"
    },
    {
      "end": 731104,
      "speaker": "Santiago Ortiz",
      "start": 717820,
      "text": "Yes, indeed. And it was fantastic. It's fantastic to be part of. Of a company that offers a service for a market that do not exist. Right.",
      "id": "ep_19_ut_73"
    },
    {
      "end": 736704,
      "speaker": "Moritz Stefaner",
      "start": 731924,
      "text": "It's an interesting adventure that's always either a really good idea or.",
      "id": "ep_19_ut_74"
    },
    {
      "end": 756730,
      "speaker": "Santiago Ortiz",
      "start": 737564,
      "text": "Exactly, I would say it's always a bad idea, but you have a lot of fun, something like that. I would say it was really interesting. All the process, all the. The new things we discovered that were beyond the project.",
      "id": "ep_19_ut_75"
    },
    {
      "end": 757706,
      "speaker": "Moritz Stefaner",
      "start": 756762,
      "text": "It was a very research.",
      "id": "ep_19_ut_76"
    },
    {
      "end": 760034,
      "speaker": "Santiago Ortiz",
      "start": 757810,
      "text": "Yes, we did a lot oriented company.",
      "id": "ep_19_ut_77"
    },
    {
      "end": 765346,
      "speaker": "Moritz Stefaner",
      "start": 760114,
      "text": "Right? So you did a lot of projects from your own motivation, I think, and.",
      "id": "ep_19_ut_78"
    },
    {
      "end": 784374,
      "speaker": "Santiago Ortiz",
      "start": 765370,
      "text": "Also is the main way to build your tools in order to create project, to create projects for clients as well. So you have to do that. If not, you don't have anything to show to people and you don't have tools to answer to challenges. Right. So it was great.",
      "id": "ep_19_ut_79"
    },
    {
      "end": 787766,
      "speaker": "Moritz Stefaner",
      "start": 784494,
      "text": "And you sort of developed your own visualization framework as well.",
      "id": "ep_19_ut_80"
    },
    {
      "end": 788758,
      "speaker": "Santiago Ortiz",
      "start": 787870,
      "text": "Exactly.",
      "id": "ep_19_ut_81"
    },
    {
      "end": 800718,
      "speaker": "Moritz Stefaner",
      "start": 788886,
      "text": "Implemented all these algorithms and also these springy force layouts. They were very characteristic. So somehow, if you had seen them a few times, you suddenly knew that's a Bestiario force layout type thing.",
      "id": "ep_19_ut_82"
    },
    {
      "end": 822068,
      "speaker": "Santiago Ortiz",
      "start": 800766,
      "text": "So I remember, yeah, I think so. That's a strong identity. And then with this framework you mentioned, we created like a different kind of tool. It was a visual programming language to analyze, gather and visualize information. At the time, the name was impure, and impure later evolved.",
      "id": "ep_19_ut_83"
    },
    {
      "end": 824708,
      "speaker": "Moritz Stefaner",
      "start": 822196,
      "text": "That's 2008, 2009, something like that, or.",
      "id": "ep_19_ut_84"
    },
    {
      "end": 905834,
      "speaker": "Santiago Ortiz",
      "start": 824756,
      "text": "No, 2011. It started in January 20. Eleven. And yes, in like, in two years, it changed a lot, it grew a lot. And finally the company took this, let's say, experiment or experimental product, and convert it into an actual project that is being commercialized right now, which is Quadrigram is the new name. At this very moment, I decided to left the company, because as the company will like specialize in a single product, and I am not really a product person. I prefer to create new things and a lot of new things. I like to be always involved in several projects at the same time I decide to left. So that was like one year ago. And I also started like learning new technologies. It was the moment in which Flash was like start dying, and in particular for information visualization, it was no longer a tool. Like it's at the same time JavaScript, HTML five.",
      "id": "ep_19_ut_85"
    },
    {
      "end": 909342,
      "speaker": "Moritz Stefaner",
      "start": 907254,
      "text": "Yeah, I'm still a bit sad.",
      "id": "ep_19_ut_86"
    },
    {
      "end": 912062,
      "speaker": "Santiago Ortiz",
      "start": 909518,
      "text": "It's a sad story because flash flashes.",
      "id": "ep_19_ut_87"
    },
    {
      "end": 918876,
      "speaker": "Moritz Stefaner",
      "start": 912238,
      "text": "I do like my coffeescript and my D3, so I don't think about it anymore.",
      "id": "ep_19_ut_88"
    },
    {
      "end": 979624,
      "speaker": "Santiago Ortiz",
      "start": 918940,
      "text": "Yes, but I think for many of us it was a traumatic process, metamorphosis. I was more scared and thinking that the process will be more painful, that actually it was like, right now I feel very, very comfortable with JavaScript. Right. So in a few months I was able to build again a platform framework with all the tools I want to have, like the 3d stuff, like the physics engine, of course, the network engines that create and modify networks, but also visualize networks, etcetera. So in a few months I had everything like set up or the basis, and then I spent like six months only researching, no clients work.",
      "id": "ep_19_ut_89"
    },
    {
      "end": 986264,
      "speaker": "Moritz Stefaner",
      "start": 980884,
      "text": "And you published a new project every two weeks or something. It was amazing to watch.",
      "id": "ep_19_ut_90"
    },
    {
      "end": 1030120,
      "speaker": "Santiago Ortiz",
      "start": 988324,
      "text": "Kind of crazy. I was with a lot of energy and very eager to like to produce stuff and to research and, and also I started with the question what exactly I want to do. Okay. So my researcher was wide open. Like I try to cover and touch very different topics, and I soon started like identifying what exactly is like my thing. They think I am good and the thing really interests me. Okay. Actually not one single thing, but like some vectors I, I know identify and here I am.",
      "id": "ep_19_ut_91"
    },
    {
      "end": 1034704,
      "speaker": "Moritz Stefaner",
      "start": 1030152,
      "text": "And that's a great strategy, is just like spit out stuff and then see where that takes you.",
      "id": "ep_19_ut_92"
    },
    {
      "end": 1035384,
      "speaker": "Santiago Ortiz",
      "start": 1034744,
      "text": "Exactly.",
      "id": "ep_19_ut_93"
    },
    {
      "end": 1053136,
      "speaker": "Moritz Stefaner",
      "start": 1035504,
      "text": "And I think it's both like what you react to emotionally most, but also what people pick up. You know, sometimes you think one thing is the greatest thing ever, nobody cares all the time. If we discuss that too, you do something like in a, in an afternoon and people go crazy.",
      "id": "ep_19_ut_94"
    },
    {
      "end": 1054560,
      "speaker": "Santiago Ortiz",
      "start": 1053280,
      "text": "That happened to me a lot of.",
      "id": "ep_19_ut_95"
    },
    {
      "end": 1059936,
      "speaker": "Moritz Stefaner",
      "start": 1054592,
      "text": "Times, and it's always good to have that sort of back and forth.",
      "id": "ep_19_ut_96"
    },
    {
      "end": 1060968,
      "speaker": "Santiago Ortiz",
      "start": 1060080,
      "text": "Absolutely.",
      "id": "ep_19_ut_97"
    },
    {
      "end": 1098196,
      "speaker": "Enrico Bertini",
      "start": 1061096,
      "text": "I mean, when I saw all these projects coming from Santiago, I thought I was blown up. I couldn't believe it, there were so many objects coming every week, lots of new projects coming every week, and I think it's the perfect example and prototype of what humor it's have been suggesting some time ago, I think even before starting data stories, I remember you mentioning the fact that one of the best moves you can do if you want to become a freelancer is to dedicate a lot of time initially to just spit new projects and put these projects.",
      "id": "ep_19_ut_98"
    },
    {
      "end": 1099012,
      "speaker": "Moritz Stefaner",
      "start": 1098300,
      "text": "Absolutely.",
      "id": "ep_19_ut_99"
    },
    {
      "end": 1113554,
      "speaker": "Enrico Bertini",
      "start": 1099108,
      "text": "Let this project, put this project somewhere in life, somewhere in a way that people can just see it and discover who you are, what you do. And I think that's still the best way. Right.",
      "id": "ep_19_ut_100"
    },
    {
      "end": 1123234,
      "speaker": "Moritz Stefaner",
      "start": 1113714,
      "text": "And they become a sort of a self fulfilling prophecy. So, yeah, if you do a lot of, I don't know, literature, visualization or whatever, then you will, you will be approached for that.",
      "id": "ep_19_ut_101"
    },
    {
      "end": 1125242,
      "speaker": "Enrico Bertini",
      "start": 1123274,
      "text": "Yeah, yeah, yeah, yeah, sure, sure, yeah.",
      "id": "ep_19_ut_102"
    },
    {
      "end": 1249814,
      "speaker": "Santiago Ortiz",
      "start": 1125258,
      "text": "I totally recommend to all people that work creating visualization. To do that, to some extent, it's completely important. It also helps you define your tools and organize your tools. It gives you interesting results that you can also place in your portfolio, and that's also strategic, and it helps you discover business opportunities. For instance, you start working with books because you are just passionate about books. And then you start visualizing conversations in books, but then you realize that visualizing conversation in books is basically or structurally similar to visualizing conversations in social media. And then you eventually figure out, like, a new product or a way to take actual value for other people out of those ideas. So research and free research or experimental research, at least for some people, is extremely important. And then there is another reason is motivation. If you are not working or using part of your time to what you want to do, that motivates you, it's very hard to have energy to do the other projects. At some point, you will be tired if you are not choosing at all what kind of projects and which kind of data you work? The third reason will be that it helps you keep motivated. If it happens that you don't work with projects that motivates you or data that is interesting for you, you will sooner or later lost energy. So it's also important to at least part of the week, work on your own projects.",
      "id": "ep_19_ut_103"
    },
    {
      "end": 1252626,
      "speaker": "Moritz Stefaner",
      "start": 1250594,
      "text": "Yeah, that's absolutely true.",
      "id": "ep_19_ut_104"
    },
    {
      "end": 1308584,
      "speaker": "Enrico Bertini",
      "start": 1252770,
      "text": "Yeah. This is something I wanted to ask to Santiago. So I know by talking with you that actually your process was really successful and you actually end up getting a lot of clients. And so it worked. One thing that I wanted to ask you is during these initial six months that you devoted basically 100% to creating new projects and posting these projects on your website, did you think about, did you also have a strategy in terms of targeting some specific domain because you thought that would be interesting? To attract some specific kind of clients, or it was totally free, kind of like you just did what you think, what you liked, and expecting that people just came in and be attracted and contacted you to propose some projects.",
      "id": "ep_19_ut_105"
    },
    {
      "end": 1415714,
      "speaker": "Santiago Ortiz",
      "start": 1309124,
      "text": "That's a good question. I started with very open ideas, but already strategic ones, and already pointing opportunities for the future. But I started with a concept, very wide concept, which is knowledge visualization. I think that there is a kind of hypothetical axis, which starts with data visualization, goes to information visualization, and eventually goes to knowledge visualization. I will define this like visualization in contexts in which you do not start necessarily with a specific data set, but with a cultural context. So part of the process is also to analyze, to gather, to find the data, to organize the data very well, eventually to build data, to converse, and to take into account a lot of important things that are related with the knowledge context you are working on. So it could be, for instance, an exploration in Wikipedia, things like that. You don't start with, you start with a goal or with a context. For instance, an example would be, I want to build a map of sciences that not only displays the connections between sciences, but also the activity, the current activity, the real time activity of sciences, of research, for instance. So this is knowledge visualization, because you don't know where the data is, it's part of the project. Right? So I had that in mind also.",
      "id": "ep_19_ut_106"
    },
    {
      "end": 1417754,
      "speaker": "Enrico Bertini",
      "start": 1416534,
      "text": "Yeah, sure.",
      "id": "ep_19_ut_107"
    },
    {
      "end": 1421814,
      "speaker": "Moritz Stefaner",
      "start": 1418094,
      "text": "And it's more like you start with a certain cultural phenomenon as a whole.",
      "id": "ep_19_ut_108"
    },
    {
      "end": 1422470,
      "speaker": "Santiago Ortiz",
      "start": 1421934,
      "text": "Exactly.",
      "id": "ep_19_ut_109"
    },
    {
      "end": 1423758,
      "speaker": "Moritz Stefaner",
      "start": 1422542,
      "text": "Not a data set, but more a.",
      "id": "ep_19_ut_110"
    },
    {
      "end": 1508890,
      "speaker": "Santiago Ortiz",
      "start": 1423766,
      "text": "Culture that changes your approach and your activity as a professional, because you are no longer the visualization professional that receives a data set and gives you in return a visualization. It changes the relationship between the client and the professional. And that was also something very important I had in mind from the very beginning. And little by little, along the entire process of experimentation or research, that question was also part of the research. So it wasn't only that I was like playing with code. I was at the same time thinking a lot, taking a lot of notes, and heading this, this idea of building a strategy. And right now, as I already started working with clients, what I am doing is defining this platform. So my plan is, in one year I will have a very different website from the one I have right now. Right now, what I have, you see, is the portfolio of an artist or a researcher. All the projects there are a research project. None of them is for clients, right? So in one year I will have something much more clear for people that want to work with me. Like what I do exactly. And what is my methodology?",
      "id": "ep_19_ut_111"
    },
    {
      "end": 1536774,
      "speaker": "Enrico Bertini",
      "start": 1509002,
      "text": "Okay, sure, sure. Another related aspects I wanted to discuss with you is that one thing I really like in your work is that to me, it looks like you have a very strong branding. So when I. Most of the time, when I see some of your projects, actually, one person could come to me without telling me that this is Santiago. And I would actually guess, yeah, this is Santiago style, right?",
      "id": "ep_19_ut_112"
    },
    {
      "end": 1537774,
      "speaker": "Moritz Stefaner",
      "start": 1536814,
      "text": "Yeah, that's true.",
      "id": "ep_19_ut_113"
    },
    {
      "end": 1545394,
      "speaker": "Enrico Bertini",
      "start": 1537894,
      "text": "And I think this is a pretty unique feature of your work. Is it something that you do on purpose, or it just happened this way?",
      "id": "ep_19_ut_114"
    },
    {
      "end": 1590954,
      "speaker": "Santiago Ortiz",
      "start": 1545714,
      "text": "Not at all. In fact, I try to do the opposite, but of course, it's hard to escape from yourself. In some projects, I use a lot of very bright colors, and in others, I do the opposite. In some projects, I use this fish eye technique, in others, I totally ban this idea, etcetera. I really try to be diverse. But of course, something happened, I think. Yes, I have like an identity sign. I don't know, but it's other people that could see that I don't see it. It's other people that see it. Okay.",
      "id": "ep_19_ut_115"
    },
    {
      "end": 1596550,
      "speaker": "Enrico Bertini",
      "start": 1595174,
      "text": "Yeah, but I think.",
      "id": "ep_19_ut_116"
    },
    {
      "end": 1606982,
      "speaker": "Moritz Stefaner",
      "start": 1596622,
      "text": "So can you tell us a bit what types of projects you're working on now? Like for clients? What types of things do people approach you with, and what are the things you're actually working on?",
      "id": "ep_19_ut_117"
    },
    {
      "end": 1697434,
      "speaker": "Santiago Ortiz",
      "start": 1607078,
      "text": "Okay, I will mention two projects that are really interesting for me. It's exactly the kind of work I wanted to do and exactly the kind of relationship I wanted to build with clients. One project is for a company based in Belgium, the company's chieftain. Some of you might know it because they made a map of a system map of the obesity. It's in visual complexity. It's a fantastic map of all the complex relationship in the obesity issue. Right? So they analyze future scenarios, they create system maps, etcetera. And I am working with them, creating a tool that allowed them to take a big corpus of documents. Actually, not a big corpus, but a corpus of documents that can be big. And what you get is, like, different views of those documents. It's a syntactical and statistical analysis with visualization. Right. The good thing about this project is not only like, the results are interesting, but also the way we are working is like we are testing the tool all the time with different corpora and with different people. So it's something quite new for me, and it's exactly what I wanted to do. It's like.",
      "id": "ep_19_ut_118"
    },
    {
      "end": 1705222,
      "speaker": "Moritz Stefaner",
      "start": 1697974,
      "text": "But it's really like a software tool that can take arbitrary text and exactly will produce a few visualizations.",
      "id": "ep_19_ut_119"
    },
    {
      "end": 1754168,
      "speaker": "Santiago Ortiz",
      "start": 1705358,
      "text": "Exactly. So it contains different visualizations, which is something that I also appreciate, like, not only focus on one view, but create different things. So. Yes, exactly. That's one of the problems. The other is with Kenneth Cuquier from the Economist. In that case, we work first, trying to identify, like, new ways to use data about economic indexes or quality of life indexes, and try to find new ways to visualize them, like create a different story. Okay. Out of it. And we already found some interesting ideas. I can't comment, but I think that the result would be really good.",
      "id": "ep_19_ut_120"
    },
    {
      "end": 1764504,
      "speaker": "Moritz Stefaner",
      "start": 1754256,
      "text": "Okay, nice. Yeah, sounds good. Fantastic. So your plan worked out up to now.",
      "id": "ep_19_ut_121"
    },
    {
      "end": 1768068,
      "speaker": "Enrico Bertini",
      "start": 1767284,
      "text": "That's great.",
      "id": "ep_19_ut_122"
    },
    {
      "end": 1774784,
      "speaker": "Santiago Ortiz",
      "start": 1768156,
      "text": "Actually, mori, sorry, I think I lost you a little bit, but now I hear you. Okay.",
      "id": "ep_19_ut_123"
    },
    {
      "end": 1778460,
      "speaker": "Moritz Stefaner",
      "start": 1775244,
      "text": "Okay, cool. I just said your plan worked out so far.",
      "id": "ep_19_ut_124"
    },
    {
      "end": 1781132,
      "speaker": "Santiago Ortiz",
      "start": 1778612,
      "text": "Yes, I think so. Yes, it's working. Yes.",
      "id": "ep_19_ut_125"
    },
    {
      "end": 1782104,
      "speaker": "Moritz Stefaner",
      "start": 1781188,
      "text": "Very good.",
      "id": "ep_19_ut_126"
    },
    {
      "end": 1788404,
      "speaker": "Enrico Bertini",
      "start": 1783484,
      "text": "So how long did it take before you started getting, getting clients?",
      "id": "ep_19_ut_127"
    },
    {
      "end": 1844624,
      "speaker": "Santiago Ortiz",
      "start": 1789464,
      "text": "Well, in the process of being experimented, I already received mails from people interested in working, and that took a time, like start conversing with people, etcetera. So it's very difficult to measure because the time from the first mail to start working is usually a lot of months. So, yeah, so now I am working with people, but I first contact these people like several months ago. So it's like a very big machine that takes time to start working. But the feeling, my feeling is that once it started working, it starts also having a good pace. I hope so. I am really a beginner as a freelance.",
      "id": "ep_19_ut_128"
    },
    {
      "end": 1857468,
      "speaker": "Moritz Stefaner",
      "start": 1849004,
      "text": "Yeah, it takes a while to figure it out. I mean, I'm still in the process and I've been doing it for ten years now or something. It's like, oh man, oh man.",
      "id": "ep_19_ut_129"
    },
    {
      "end": 1859148,
      "speaker": "Enrico Bertini",
      "start": 1857516,
      "text": "Never ends, but never ends.",
      "id": "ep_19_ut_130"
    },
    {
      "end": 1864260,
      "speaker": "Moritz Stefaner",
      "start": 1859276,
      "text": "No, no. The clients, they always, they invent new stuff, they invent new tricks.",
      "id": "ep_19_ut_131"
    },
    {
      "end": 1874074,
      "speaker": "Enrico Bertini",
      "start": 1864332,
      "text": "Yeah, I can imagine that. I don't have this problem here. I have other interesting problems to deal with.",
      "id": "ep_19_ut_132"
    },
    {
      "end": 1886430,
      "speaker": "Moritz Stefaner",
      "start": 1874494,
      "text": "We had a few questions from Twitter, so let's ask these. So Kimay asked, what tools are you working with? Especially in the nuke Twitter app. Thanks. So my guess is you write everything yourself, right?",
      "id": "ep_19_ut_133"
    },
    {
      "end": 1914672,
      "speaker": "Santiago Ortiz",
      "start": 1886462,
      "text": "Yes, yes. And prior to start building this specific project, which is a network visualization, I work a lot on the, like in the network framework. Right. So it's not only that I build my tool, but I am trying to build a very comprehensive and well organized framework, just as D3. Not that complex or big, but it is comprehensive nonetheless.",
      "id": "ep_19_ut_134"
    },
    {
      "end": 1916364,
      "speaker": "Moritz Stefaner",
      "start": 1914728,
      "text": "And especially for networks.",
      "id": "ep_19_ut_135"
    },
    {
      "end": 1956350,
      "speaker": "Santiago Ortiz",
      "start": 1917464,
      "text": "Networks is a big part of the framework. Other big parts are text analysis, the 3d engine, let me think. A lot of geometry, a lot of geometry, a lot of mathematics. Like, I try to build something with a lot of specific solutions. So when I try to prototype something, it's not that I use very big modules already created, I use like tens of specific solutions that assemble, like help me create something. Okay, so for instance, lots of helper.",
      "id": "ep_19_ut_136"
    },
    {
      "end": 1959982,
      "speaker": "Moritz Stefaner",
      "start": 1956382,
      "text": "Functions for working with specific things.",
      "id": "ep_19_ut_137"
    },
    {
      "end": 1985062,
      "speaker": "Santiago Ortiz",
      "start": 1960078,
      "text": "Yes. For instance, I do not have a visualization methods in my framework, but instead I have all the operations to create anything very fast, like a string graph, for instance, it's based on four or five classic operations, right? So I do not have the string graph visualization method already coded, but it's very fast for me to actually, it's.",
      "id": "ep_19_ut_138"
    },
    {
      "end": 1988030,
      "speaker": "Moritz Stefaner",
      "start": 1985078,
      "text": "More like a toolkit of little functions that help you assemble stuff.",
      "id": "ep_19_ut_139"
    },
    {
      "end": 1995014,
      "speaker": "Santiago Ortiz",
      "start": 1988102,
      "text": "Exactly. And the key is to organize well those little solutions. Yeah, yeah.",
      "id": "ep_19_ut_140"
    },
    {
      "end": 2003354,
      "speaker": "Moritz Stefaner",
      "start": 1995054,
      "text": "There's a danger there that you end up with PHP, where everything is a function that has a funny name, and you always have to look up the funny names for the funny functions.",
      "id": "ep_19_ut_141"
    },
    {
      "end": 2006974,
      "speaker": "Santiago Ortiz",
      "start": 2004614,
      "text": "I have a strong, do you plan.",
      "id": "ep_19_ut_142"
    },
    {
      "end": 2022932,
      "speaker": "Moritz Stefaner",
      "start": 2007014,
      "text": "On passing publishing the tools, or. I mean, I could imagine for clients, it's a bit strange if they commission someone and they use their own framework, and it's private and, you know, it's like a bit unsustainable.",
      "id": "ep_19_ut_143"
    },
    {
      "end": 2066644,
      "speaker": "Santiago Ortiz",
      "start": 2022988,
      "text": "Yeah. So far I haven't faced this specific problem, because other clients will also find strange to use a code that others can use, like open source. But nowadays, my feeling, but again, I am a beginner in this, is that clients are more open. They just want you to like to build the solution. Okay, yeah, so no problem. The code I deliver is minified, it's not readable, let's say. So no one can use it. And yes, I plan to open it, but it's a huge responsibility. It's very difficult. You have to reorganize things.",
      "id": "ep_19_ut_144"
    },
    {
      "end": 2069456,
      "speaker": "Enrico Bertini",
      "start": 2067944,
      "text": "Biggest problem, right?",
      "id": "ep_19_ut_145"
    },
    {
      "end": 2101756,
      "speaker": "Santiago Ortiz",
      "start": 2069600,
      "text": "Yes. I talked with Nicolas Belmonte a lot about this. He has the experience of opening a framework, and it is a fantastic challenge, no doubt. But the way I will do it is it will be first, like in an intermediate way, which is I will try to, to share these isolated tools, right. These specific solutions, so people will be able to pick, like copy paste this solution. So that's a good way to allow people to use.",
      "id": "ep_19_ut_146"
    },
    {
      "end": 2130612,
      "speaker": "Enrico Bertini",
      "start": 2101820,
      "text": "I think, I think this is somewhat similar. I don't know if you've ever seen what these people at the GI center in the UK published a number of libraries for processing. And it's not necessarily a whole framework, it's just a number of libraries, but these libraries are really, really useful and interesting. Are you familiar with that? You know these folks at the GI Center, JSON Dykes, have you ever heard of.",
      "id": "ep_19_ut_147"
    },
    {
      "end": 2138132,
      "speaker": "Moritz Stefaner",
      "start": 2130668,
      "text": "Yeah, I think, I think they did something for like rendering really large processing sketches, was it? Or like multi screen, is it that thing?",
      "id": "ep_19_ut_148"
    },
    {
      "end": 2142332,
      "speaker": "Enrico Bertini",
      "start": 2138228,
      "text": "Yeah, they have a whole bunch of libraries, but they are independent basically.",
      "id": "ep_19_ut_149"
    },
    {
      "end": 2144484,
      "speaker": "Santiago Ortiz",
      "start": 2142508,
      "text": "Okay, yes, I am not familiar, but.",
      "id": "ep_19_ut_150"
    },
    {
      "end": 2153212,
      "speaker": "Moritz Stefaner",
      "start": 2144524,
      "text": "Also like Gregor, you know, he wrote Chroma, j s, he wrote cartograph. These are all like single purpose libraries that helped a lot of people, but.",
      "id": "ep_19_ut_151"
    },
    {
      "end": 2180564,
      "speaker": "Santiago Ortiz",
      "start": 2153228,
      "text": "They are still frameworks in the sense you have like to embed the anti logic, which is fantastic. I'm not saying it's, but it's something that I couldn't do right now anyway. And the way Enrico described these libraries sounds more like what I will do. If you can use a single function and embed it in your framework, it works. That's fantastic.",
      "id": "ep_19_ut_152"
    },
    {
      "end": 2216554,
      "speaker": "Enrico Bertini",
      "start": 2180944,
      "text": "Yeah, I think this is the main person behind it is Joe woods, and I think, I was searching for the link. I think the library is called GI center udls, so it's just a number of utilities, but it's extremely, extremely useful. So I think this could also be a different way, instead of trying to publish a whole framework as one building blocks, as you said, publishing single libraries. Yes, I think it's similar to what Gregor, Gregor did in the past and I think this works so much better.",
      "id": "ep_19_ut_153"
    },
    {
      "end": 2253826,
      "speaker": "Moritz Stefaner",
      "start": 2217214,
      "text": "Yeah, but I agree it's a big responsibility. I did open source quite a few of my projects, but I never really documented them well. And so basically that didn't go anywhere. So I know it helped a few people, but they had to sort of bite, how do you say bite the bullet and dig through my code without documentation, which I feel bad about. And then sometimes you also get like funny requests, like people complaining about the lack of documentation or like, you know, like demanding that you fix.",
      "id": "ep_19_ut_154"
    },
    {
      "end": 2258614,
      "speaker": "Santiago Ortiz",
      "start": 2253970,
      "text": "That's exactly the problem. You can create frustration with your code.",
      "id": "ep_19_ut_155"
    },
    {
      "end": 2261250,
      "speaker": "Moritz Stefaner",
      "start": 2258914,
      "text": "Exactly. Because you promise, sort of.",
      "id": "ep_19_ut_156"
    },
    {
      "end": 2265802,
      "speaker": "Santiago Ortiz",
      "start": 2261402,
      "text": "There is an implicit promise in the code you share.",
      "id": "ep_19_ut_157"
    },
    {
      "end": 2266442,
      "speaker": "Moritz Stefaner",
      "start": 2265858,
      "text": "Exactly.",
      "id": "ep_19_ut_158"
    },
    {
      "end": 2269554,
      "speaker": "Enrico Bertini",
      "start": 2266538,
      "text": "So Santiago, this is written in JavaScript or what?",
      "id": "ep_19_ut_159"
    },
    {
      "end": 2271010,
      "speaker": "Santiago Ortiz",
      "start": 2269714,
      "text": "JavaScript, yes.",
      "id": "ep_19_ut_160"
    },
    {
      "end": 2289332,
      "speaker": "Enrico Bertini",
      "start": 2271162,
      "text": "Okay. Okay. Yeah, that's another thing. One of, I think this is related to the branding thing I was mentioning before. Normally most of your visualizations are really interactive. There is a lot of interaction, much more than, than we are used to. And I think this is another, it's.",
      "id": "ep_19_ut_161"
    },
    {
      "end": 2294500,
      "speaker": "Moritz Stefaner",
      "start": 2289348,
      "text": "The good old exploratory stuff. I like that, it's, I really love it.",
      "id": "ep_19_ut_162"
    },
    {
      "end": 2297744,
      "speaker": "Santiago Ortiz",
      "start": 2294532,
      "text": "Yeah, that's part of the research, of course, interaction.",
      "id": "ep_19_ut_163"
    },
    {
      "end": 2331168,
      "speaker": "Enrico Bertini",
      "start": 2298244,
      "text": "Yeah. But I think also in terms of interaction. So I don't know how you feel about it, but in a way, I have much, probably much less experience than you guys in implementing visualizations because you've, you, you does. You do this every day. But my feeling, my experience with implementing visualizations is that as long as you have to draw something, it's relatively easy. But as soon as you add a lot of interaction, it's a nightmare. In terms of coding, I think you agree, right?",
      "id": "ep_19_ut_164"
    },
    {
      "end": 2336644,
      "speaker": "Santiago Ortiz",
      "start": 2331296,
      "text": "Yes, no, no, I understand. I do not agree. That is not something that happens to me.",
      "id": "ep_19_ut_165"
    },
    {
      "end": 2337844,
      "speaker": "Enrico Bertini",
      "start": 2336944,
      "text": "Okay.",
      "id": "ep_19_ut_166"
    },
    {
      "end": 2343016,
      "speaker": "Moritz Stefaner",
      "start": 2339504,
      "text": "Yeah, but probably because you think in code and in math straight away.",
      "id": "ep_19_ut_167"
    },
    {
      "end": 2348844,
      "speaker": "Santiago Ortiz",
      "start": 2343080,
      "text": "Exactly. The math saves me is the mathematics that saved me. In that case, I have.",
      "id": "ep_19_ut_168"
    },
    {
      "end": 2354684,
      "speaker": "Moritz Stefaner",
      "start": 2349384,
      "text": "How do you start a project? Do you open up a text editor or do you open up your notebook?",
      "id": "ep_19_ut_169"
    },
    {
      "end": 2380424,
      "speaker": "Santiago Ortiz",
      "start": 2355584,
      "text": "I have a notebook of ideas, 150 ideas of projects. I want to do what you could do. Yes. Actually, I want to make this notebook public. It could be interesting. Yes. And eventually create a platform for that specific, for that in which people can comment or whatever.",
      "id": "ep_19_ut_170"
    },
    {
      "end": 2386532,
      "speaker": "Moritz Stefaner",
      "start": 2381164,
      "text": "Did you see the one Lin sent us a few days ago? There is a platform for writing.",
      "id": "ep_19_ut_171"
    },
    {
      "end": 2400034,
      "speaker": "Santiago Ortiz",
      "start": 2386628,
      "text": "Exactly. In fact, Lin sent this to me, or I was in this tweet because we had previously discussed about this tool. I will eventually publish. Yes.",
      "id": "ep_19_ut_172"
    },
    {
      "end": 2403614,
      "speaker": "Enrico Bertini",
      "start": 2400934,
      "text": "Lynn who? Guys, Lynn Cherny.",
      "id": "ep_19_ut_173"
    },
    {
      "end": 2405470,
      "speaker": "Moritz Stefaner",
      "start": 2403694,
      "text": "She is Annika's on Twitter.",
      "id": "ep_19_ut_174"
    },
    {
      "end": 2406926,
      "speaker": "Enrico Bertini",
      "start": 2405502,
      "text": "Yeah, yeah, I know her.",
      "id": "ep_19_ut_175"
    },
    {
      "end": 2424694,
      "speaker": "Moritz Stefaner",
      "start": 2406950,
      "text": "But I was insider thing and she sent us a link to a platform where you can get your network to help you decide what to write. So it's for writers, but we could also use it for data visualizations because I think all of us have more ideas than time.",
      "id": "ep_19_ut_176"
    },
    {
      "end": 2451414,
      "speaker": "Santiago Ortiz",
      "start": 2424994,
      "text": "You can use this. Yes, exactly. A lot of ideas and not that much time. You can also put questions. For instance, if some of your projects require specific data that you don't have, it's a good place to say that. And perhaps someone will say your idea and will get you to the data you need. So it's nice to open the idea.",
      "id": "ep_19_ut_177"
    },
    {
      "end": 2460374,
      "speaker": "Moritz Stefaner",
      "start": 2451494,
      "text": "But if you want to form. So let's say you pick one of these ideas and you say, ah, okay. Now today I'll go for that type of visualization. What do you do first?",
      "id": "ep_19_ut_178"
    },
    {
      "end": 2486684,
      "speaker": "Santiago Ortiz",
      "start": 2460494,
      "text": "Well, it depends on the data mainly. But let me think on one example of something I want to do. I want to. One of my ideas is to create a map of Europe deformed by genetic information. This is an idea I already have, like spotted the data. Okay.",
      "id": "ep_19_ut_179"
    },
    {
      "end": 2490504,
      "speaker": "Enrico Bertini",
      "start": 2487104,
      "text": "And in my genetic information you said.",
      "id": "ep_19_ut_180"
    },
    {
      "end": 2581524,
      "speaker": "Santiago Ortiz",
      "start": 2490584,
      "text": "Yes, because this is a classic procedure in genetics. It has a name and everything in which you make a linear transformation to a map in order to make it, like, match with the genetic data as better as possible. But the transformation is linear. I want to create like a crazy nonlinear transformation that will totally deform the map of Europe. And it could be done with the world. But Europe is perfect because genetic data spreads in Europe in a very coherent way with the geography, right? So it's an interesting research project, and in that case, first I identify the mathematical tools I need to eventually do that. And in this particular case, the mathematical tool I need is something that I could use in many other projects. It's basically the same problem behind the cartograms in which you want to deform a map in order to guarantee that the surface in each sub region is proportional to certain values. Okay, so I will build this, and you need to use physics for that, right? Like springs connecting, connecting a very complex network. So I will have to go to this very abstract problem first, in that case, and then I start using.",
      "id": "ep_19_ut_181"
    },
    {
      "end": 2585164,
      "speaker": "Moritz Stefaner",
      "start": 2581604,
      "text": "And then you assemble your tools to do that. And then you start.",
      "id": "ep_19_ut_182"
    },
    {
      "end": 2598530,
      "speaker": "Santiago Ortiz",
      "start": 2585244,
      "text": "Yes, I start with the framework. In general, it was like that. Like I start improving the framework, and then as a second phases, I start working the specific project. Yes.",
      "id": "ep_19_ut_183"
    },
    {
      "end": 2613414,
      "speaker": "Enrico Bertini",
      "start": 2598682,
      "text": "So how much time do you spend in proportion. So once you have an idea, how much time you spend in proportion in gathering the data, manipulating this data, and visualizing the data?",
      "id": "ep_19_ut_184"
    },
    {
      "end": 2718404,
      "speaker": "Santiago Ortiz",
      "start": 2614654,
      "text": "Oh, it totally depends. In some cases, I have a lot of projects in my notebook that had already solved the problem of the data. Gathering the data won't be a problem in those cases. And this could be one third of all these ideas. Actually, sometimes I had the idea of the project because I found an interesting data, data set. Okay, that's completely normal. In other cases, it could go up to 50% of the process. In some cases, this is the main challenge of the project. But for instance, another interesting example is Lostpedia, which uses all the scripts of lost series. It's a lot of dialogues, a lot of text. In that case, I started with data from Lostpedia, like the Wikipedia for lost, and they had all the script transcribed, and I thought I would have to spend like three days organizing the data. But actually it was pretty straightforward because these people did a great job. The format of the text was already very well organized, so gathering, scrapping everything took me only one day. And I created a JSON file containing all the script with the characters, like identify for each dialogue, etcetera, the complete structure. Okay, it was only one day, but I was expecting like three days for this particular case.",
      "id": "ep_19_ut_185"
    },
    {
      "end": 2767634,
      "speaker": "Enrico Bertini",
      "start": 2721414,
      "text": "Okay. And another thing I wanted to ask you is how much experimentation you have in terms of how to map any given data into a visual format. So I guess normally you already start from an idea of how you want to visualize this data and how much experimentation you put on it. So most of the time you basically realize what you have in mind, or you. You realize what you have in mind, and then you discover that there is another way to visualize this data that is probably more effective or more interesting. Or you start from the very beginning with different kind of visualizations, and then you decide which one you like the most. How does it work?",
      "id": "ep_19_ut_186"
    },
    {
      "end": 2847670,
      "speaker": "Santiago Ortiz",
      "start": 2768454,
      "text": "Okay. I think one of the most beautiful things about our job is that you train your mind to create things that move, that have shape, that change in size, in color, whatever, very dynamic geometrical stuff in your mind. And then you have to translate that into something that happens in your screen. Right. And with training, you actually arrive to a certain point in which at least some of the times you try to do that, you will build out something that actually represents what you had in mind. I think musicians go through similar processes. Like very experimental musicians can really imagine a melody with an harmony, with everything sounding at the same time, and then they write the score and then their orchestra sounds the same way they had in mind. Right. Very talented musician can do that. Okay. For an information visualization that also happens. And that's interesting because this is like a second meaning of the, of the word visualization is the capability make real. You have, you have.",
      "id": "ep_19_ut_187"
    },
    {
      "end": 2849566,
      "speaker": "Enrico Bertini",
      "start": 2847742,
      "text": "It's actually the primary thing.",
      "id": "ep_19_ut_188"
    },
    {
      "end": 2851078,
      "speaker": "Santiago Ortiz",
      "start": 2849710,
      "text": "Yeah, but, yeah.",
      "id": "ep_19_ut_189"
    },
    {
      "end": 2853182,
      "speaker": "Moritz Stefaner",
      "start": 2851126,
      "text": "If you search for visualization on Twitter.",
      "id": "ep_19_ut_190"
    },
    {
      "end": 2876258,
      "speaker": "Santiago Ortiz",
      "start": 2853238,
      "text": "Or something, and I don't discard it a lot. Never. I like to use the visualization concept in its most, like, wide definition or set of definitions. And this one, I think it's also useful because you are building mental images and this mental process is something you have to train. Okay.",
      "id": "ep_19_ut_191"
    },
    {
      "end": 2881114,
      "speaker": "Moritz Stefaner",
      "start": 2876386,
      "text": "But nevertheless, something that's interesting because I sort of try not to do.",
      "id": "ep_19_ut_192"
    },
    {
      "end": 2882174,
      "speaker": "Enrico Bertini",
      "start": 2881154,
      "text": "Yeah, exactly.",
      "id": "ep_19_ut_193"
    },
    {
      "end": 2892290,
      "speaker": "Moritz Stefaner",
      "start": 2882994,
      "text": "Because I want to first see how the data plays out, you know, before I impose too much of my, you know, my, my vision on it.",
      "id": "ep_19_ut_194"
    },
    {
      "end": 2893294,
      "speaker": "Santiago Ortiz",
      "start": 2892322,
      "text": "Yes, that's true.",
      "id": "ep_19_ut_195"
    },
    {
      "end": 2896162,
      "speaker": "Moritz Stefaner",
      "start": 2894474,
      "text": "So it's. I think it has both.",
      "id": "ep_19_ut_196"
    },
    {
      "end": 2986894,
      "speaker": "Santiago Ortiz",
      "start": 2896258,
      "text": "The thing is, it is interesting when you fail. So you have to be very honest with yourself and be capable to accept that you will fail with this mental image. Yes. And also very clever, too, to foresee new opportunities when that happens. So it's like you impose a shape to some data and it could happen that it works or not. If it doesn't work, perhaps you are capable to understand things about the data, like, okay, this particular data didn't work because of this or that. So the visualization or your try still say something about the data and you can start with a different attempt, a different approach. Right. But recently I had this experience and I am stuck, completely stuck with this data set. I think it's interesting. I can share this experience working with my friend Mauricio Giraldo. He works at the New York Public Library with fantastic data sets. He plays a lot with data. He builds APIs for the data they have. And one of the most fantastic data set they have is about menus from restaurants from the entire century in New York. And they have all the beaches in each menu. And I took all the data, all the ditches, and I said, of course there are.",
      "id": "ep_19_ut_197"
    },
    {
      "end": 2991510,
      "speaker": "Moritz Stefaner",
      "start": 2986934,
      "text": "And you have the dishes and the prices and probably locations of the restaurant.",
      "id": "ep_19_ut_198"
    },
    {
      "end": 3015598,
      "speaker": "Santiago Ortiz",
      "start": 2991662,
      "text": "I was interested. Yes, let's give it a try because I totally failed. Okay. And it's sad. I, what I was looking for was for clusters, because I was completely sure, positive that I will found like clusters, like, like dishes that go together in menus that tends to go together in men cocurrent.",
      "id": "ep_19_ut_199"
    },
    {
      "end": 3022174,
      "speaker": "Moritz Stefaner",
      "start": 3015646,
      "text": "There was this whole story that the duo grassroots still there, the menus, and you know that all these restaurants copied the.",
      "id": "ep_19_ut_200"
    },
    {
      "end": 3052878,
      "speaker": "Santiago Ortiz",
      "start": 3022254,
      "text": "And then there is culinary logics behind as well. Right? Yeah, you can, you can't just mix whatever, there are identities for restaurants, etcetera. But then I run all my algorithms, my cluster algorithms, I didn't find anything, and it was very frustrating. But this is the example you just, you just mentioned modits about trying to impose, in that case, not exactly a visualization method, but a structure. Try to really impose a structure thing must be there.",
      "id": "ep_19_ut_201"
    },
    {
      "end": 3053358,
      "speaker": "Moritz Stefaner",
      "start": 3052926,
      "text": "But it's not there.",
      "id": "ep_19_ut_202"
    },
    {
      "end": 3057394,
      "speaker": "Santiago Ortiz",
      "start": 3053366,
      "text": "It's not there. So you have to find a different approach. Indeed.",
      "id": "ep_19_ut_203"
    },
    {
      "end": 3078512,
      "speaker": "Moritz Stefaner",
      "start": 3058774,
      "text": "Yeah. And you're right, it's a lot about honesty to yourself. Like if you, because you could always change the data a little so it fits your idea. But yeah, that's also something I tell my students, you shouldn't bend the data until they fit your, your mindset, but rather change your mindset.",
      "id": "ep_19_ut_204"
    },
    {
      "end": 3079204,
      "speaker": "Enrico Bertini",
      "start": 3078568,
      "text": "Yeah.",
      "id": "ep_19_ut_205"
    },
    {
      "end": 3081120,
      "speaker": "Moritz Stefaner",
      "start": 3079544,
      "text": "If the data tells you otherwise.",
      "id": "ep_19_ut_206"
    },
    {
      "end": 3102204,
      "speaker": "Enrico Bertini",
      "start": 3081192,
      "text": "Right. So I think what is really interesting here is that this means that it's not, it's not only playing with the visualization itself, how you visualize the data you have, but how also how you segment or process this data, or what kind of question you focus in. Right, exactly. It's not only a visualization thing, it's more.",
      "id": "ep_19_ut_207"
    },
    {
      "end": 3103932,
      "speaker": "Santiago Ortiz",
      "start": 3102244,
      "text": "It's a structural problem as well.",
      "id": "ep_19_ut_208"
    },
    {
      "end": 3106588,
      "speaker": "Enrico Bertini",
      "start": 3103988,
      "text": "Yeah, it's a structural problem. Yeah, I agree.",
      "id": "ep_19_ut_209"
    },
    {
      "end": 3107544,
      "speaker": "Santiago Ortiz",
      "start": 3106676,
      "text": "Absolutely.",
      "id": "ep_19_ut_210"
    },
    {
      "end": 3118332,
      "speaker": "Moritz Stefaner",
      "start": 3108124,
      "text": "Santiago, have you ever done any works that are not, like, information based, but purely pure form, let's say, or pure generative design, data, art type things?",
      "id": "ep_19_ut_211"
    },
    {
      "end": 3195734,
      "speaker": "Santiago Ortiz",
      "start": 3118428,
      "text": "Yes, absolutely. It's not a thing that really interests me, because my feeling is that you lack in those, in those projects, like, an interesting cognitive relationship with people. Okay. I don't. I don't mean that you have to use actual data, etc. To create interesting things, but at least from my point of view, or the attempts I've done in the past, they are just like. Like aesthetical stuff. And I am. I don't even do really great aesthetical thing, so it wasn't that interesting. I think I have one project that I like, but somehow you can say is information visualization, because I am using photography collection, which is external information. It is called love is patient. You can find it in my portfolio. It uses a collection of photography of faces, men faces. And I use the Voronoi algorithm, and I create really strange, like, experience.",
      "id": "ep_19_ut_212"
    },
    {
      "end": 3201658,
      "speaker": "Moritz Stefaner",
      "start": 3196634,
      "text": "And you compose this. It's a collage, I remember. Yeah, yeah, maybe.",
      "id": "ep_19_ut_213"
    },
    {
      "end": 3209272,
      "speaker": "Enrico Bertini",
      "start": 3201826,
      "text": "Santiago, can you describe a strange one? Can you describe it more in details for those who are listening? Because it's really hard to imagine it.",
      "id": "ep_19_ut_214"
    },
    {
      "end": 3209884,
      "speaker": "Santiago Ortiz",
      "start": 3209458,
      "text": "Okay.",
      "id": "ep_19_ut_215"
    },
    {
      "end": 3212628,
      "speaker": "Enrico Bertini",
      "start": 3209924,
      "text": "I have it in front of me, but it's really hard to explain.",
      "id": "ep_19_ut_216"
    },
    {
      "end": 3221748,
      "speaker": "Santiago Ortiz",
      "start": 3212676,
      "text": "It's very difficult to explain. But I will. I prefer to talk about, like, the issues behind, like, the concepts.",
      "id": "ep_19_ut_217"
    },
    {
      "end": 3222180,
      "speaker": "Enrico Bertini",
      "start": 3221876,
      "text": "Yeah.",
      "id": "ep_19_ut_218"
    },
    {
      "end": 3297188,
      "speaker": "Santiago Ortiz",
      "start": 3222212,
      "text": "Because I think people, it's better if people go to the portfolio and see it. But the challenge here is, like, faces represent a very strong kind of pattern from. For the brain, for human brain, and geometrical patterns as well. It's like, your brain is very good in both situations, like identifying repetition or patterns in geometry and in faces. But it's kind of opposite as a process. The ladder being extremely emotional and social, and the first one being very aseptic. Right. So what I try to do is like, to mix both kind of tasks for the brain. So in that particular case, the brain is working with the Voronoi pattern and the faces pattern, trying to understand something out of it. So what I do is using this Voronoi algorithm, I can, like, slice different shapes, different polygons, and create new faces out of parts of the previous ones. It's a collage. It's like a Frankenstein, a photographic.",
      "id": "ep_19_ut_219"
    },
    {
      "end": 3298108,
      "speaker": "Moritz Stefaner",
      "start": 3297356,
      "text": "Irritating.",
      "id": "ep_19_ut_220"
    },
    {
      "end": 3299404,
      "speaker": "Enrico Bertini",
      "start": 3298236,
      "text": "It's very irritating.",
      "id": "ep_19_ut_221"
    },
    {
      "end": 3302504,
      "speaker": "Santiago Ortiz",
      "start": 3299524,
      "text": "It's irritating. Exactly. That's really irritating.",
      "id": "ep_19_ut_222"
    },
    {
      "end": 3308396,
      "speaker": "Moritz Stefaner",
      "start": 3303884,
      "text": "Yeah, but it's true, that's not really an information visualization, it's more like, yeah, media.",
      "id": "ep_19_ut_223"
    },
    {
      "end": 3310212,
      "speaker": "Santiago Ortiz",
      "start": 3308460,
      "text": "And that will be one of the.",
      "id": "ep_19_ut_224"
    },
    {
      "end": 3312916,
      "speaker": "Moritz Stefaner",
      "start": 3310308,
      "text": "Perception experiments, one of the very few.",
      "id": "ep_19_ut_225"
    },
    {
      "end": 3317404,
      "speaker": "Santiago Ortiz",
      "start": 3313100,
      "text": "Projects I will, I would like feature from my work.",
      "id": "ep_19_ut_226"
    },
    {
      "end": 3384774,
      "speaker": "Enrico Bertini",
      "start": 3317904,
      "text": "I really, really enjoyed also your emoticon faces experiments, which again, is not necessarily an information visualization kind of project, but it's really nice, I like it. And again, I think it shows. I think that's another thing that I wanted to ask you. Many of your projects actually have this mathematical bend, right? I mean, I can clearly see. So honestly, before we started the episode, I didn't know that you had a background in mathematics, but when you mentioned it, I thought, well, it's so clear. I mean, and in a way, what is really fascinating for me is the relationship between mathematics and art, because in a way, so people who have a mathematical background and do some visualization stuff, or similar stuff, or visual stuff more in general, they tend to be more artistic than people coming from other fields, like design or even computer science. And for me, this is really, really interesting.",
      "id": "ep_19_ut_227"
    },
    {
      "end": 3446332,
      "speaker": "Santiago Ortiz",
      "start": 3386274,
      "text": "Well, I can't speak for it like for other people, except for the fact that, yes, a lot of interesting things come out from mathematicians that, that try to like to apply this knowledge or these methodologies outside in other fields. But what I can say is mathematics, it's important in my job for many reasons, and I want just, I want to point just one, which is something that I am really into right now, thinking a lot about it. Yes. Is the use of topology. Topology is you can define topology like a more open geometry and a non metric geometry. It's a kind of geometry in which you stress relationships and continents, etcetera, and properties. Okay, and this is.",
      "id": "ep_19_ut_228"
    },
    {
      "end": 3448460,
      "speaker": "Moritz Stefaner",
      "start": 3446388,
      "text": "But like having elastic spaces.",
      "id": "ep_19_ut_229"
    },
    {
      "end": 3476464,
      "speaker": "Santiago Ortiz",
      "start": 3448532,
      "text": "Yes, this is the common entrance to topology through through crazy surfaces and elastic spaces, etcetera, because the concept of elasticity, what says is that you can retape things, they continue being the same from the point of view of topology, okay? Because they preserve properties they loved, like metric properties, but the other properties are preserved. So this is like the entrance, like neighbors.",
      "id": "ep_19_ut_230"
    },
    {
      "end": 3477232,
      "speaker": "Moritz Stefaner",
      "start": 3476624,
      "text": "Exactly.",
      "id": "ep_19_ut_231"
    },
    {
      "end": 3537544,
      "speaker": "Santiago Ortiz",
      "start": 3477288,
      "text": "These kind of relationships that you can find a path, a continual path between two points, things like that, right? Yes. So in for information visualization, topology can help, like finding new metaphors that are not basics nor basic in metrics. So it's like a denu or on numeration process, something like that, because some people at least tend to associate information visualization strictly with numbers and quantities. And I think it's much wider than that. And there are many things and this is also related with this idea of knowledge visualization. There are many things that are not just quantities. Yes. And that anyway carry information and meaning. And information visualization can find interesting ideas in topology.",
      "id": "ep_19_ut_232"
    },
    {
      "end": 3551534,
      "speaker": "Moritz Stefaner",
      "start": 3538334,
      "text": "And I just realized that half of your work still with that fact probably like. Or that a lot of your work is also related to mapping rather than visualizing numbers. It's true. That makes a whole lot.",
      "id": "ep_19_ut_233"
    },
    {
      "end": 3565204,
      "speaker": "Santiago Ortiz",
      "start": 3551654,
      "text": "And when you study numbers theory, the same thing start happening. That when you say number theory is not about numbers, it's about relationships, structures. So again, if you.",
      "id": "ep_19_ut_234"
    },
    {
      "end": 3566836,
      "speaker": "Moritz Stefaner",
      "start": 3565244,
      "text": "It's a fabric. Fabric as well.",
      "id": "ep_19_ut_235"
    },
    {
      "end": 3586264,
      "speaker": "Santiago Ortiz",
      "start": 3566900,
      "text": "Exactly. Even only working with numbers, you will soon find that there are amazing structures and surfaces and properties etc going on, only, for instance, in prime numbers. So topology is an interesting, like, source of thinking and inspiration as well.",
      "id": "ep_19_ut_236"
    },
    {
      "end": 3614934,
      "speaker": "Moritz Stefaner",
      "start": 3586604,
      "text": "Yeah, that's a really interesting perspective. Yeah, there's something to it. And I think, you know, when people ask me how I got started, it's also this fascination for spaces, you know, that you have a coherent space and that space makes sense and you can explore that space somehow. That's. I don't know. And I think for many people that has been the or it's like the key motivation to do information visualization, to create these spaces.",
      "id": "ep_19_ut_237"
    },
    {
      "end": 3617194,
      "speaker": "Santiago Ortiz",
      "start": 3614974,
      "text": "It's very stimulating, the concept.",
      "id": "ep_19_ut_238"
    },
    {
      "end": 3673812,
      "speaker": "Enrico Bertini",
      "start": 3617894,
      "text": "Yeah. I have a very specific question. This came into my mind where you. While you were talking about mathematics and spaces again. So have you ever tried to do anything with Hilbert curves? I remember the pioneering work of, I think, Danyel Keim first introduced many years ago the idea of using Hilbert curves in visualization as a way to arrange a very tightly packed number of items on a screen in a way that you can lay out them meaningfully and still get a lot of a very high density of information. So basically, for those of you who don't know what an Hilbert curve is, it's basically including me. Oh, sorry.",
      "id": "ep_19_ut_239"
    },
    {
      "end": 3677664,
      "speaker": "Santiago Ortiz",
      "start": 3673948,
      "text": "You know, you will see it and recognize it immediately.",
      "id": "ep_19_ut_240"
    },
    {
      "end": 3680644,
      "speaker": "Moritz Stefaner",
      "start": 3679424,
      "text": "Please explain.",
      "id": "ep_19_ut_241"
    },
    {
      "end": 3704144,
      "speaker": "Enrico Bertini",
      "start": 3681464,
      "text": "Sorry, Moritz. Anyway, so basically a Hilbert curve is a way to take one single axis and turn it from. From one d to two d. Okay. And probably, I don't know, folding one single axis. You can go from one d to two d. And Santiago, probably.",
      "id": "ep_19_ut_242"
    },
    {
      "end": 3706352,
      "speaker": "Moritz Stefaner",
      "start": 3704224,
      "text": "And you can be in between an area and.",
      "id": "ep_19_ut_243"
    },
    {
      "end": 3713178,
      "speaker": "Enrico Bertini",
      "start": 3706408,
      "text": "Yeah, so you can, you can fill an area with one single line folded in many, in many different ways. Okay.",
      "id": "ep_19_ut_244"
    },
    {
      "end": 3715946,
      "speaker": "Moritz Stefaner",
      "start": 3713266,
      "text": "Martin Wattenberg did also something on tree maps with.",
      "id": "ep_19_ut_245"
    },
    {
      "end": 3734238,
      "speaker": "Enrico Bertini",
      "start": 3716010,
      "text": "Yeah, I think it was a jigsaw map, but the first person who introduced that in visualization was Danyel Keim. And actually he was trying to use these curves as a way to use pixel based visualizations where every single item is represented with one single pixel. Okay.",
      "id": "ep_19_ut_246"
    },
    {
      "end": 3734718,
      "speaker": "Moritz Stefaner",
      "start": 3734366,
      "text": "Yeah.",
      "id": "ep_19_ut_247"
    },
    {
      "end": 3752994,
      "speaker": "Enrico Bertini",
      "start": 3734766,
      "text": "And it's interesting because when you play with one single axis, but then this axis is folded in a way that can fill up your screen, you can do a lot of. A lot of stuff. And I'm actually surprised that nobody tried to extend this work today. I mean, it's really interesting.",
      "id": "ep_19_ut_248"
    },
    {
      "end": 3755118,
      "speaker": "Moritz Stefaner",
      "start": 3753774,
      "text": "And you think Santiago must.",
      "id": "ep_19_ut_249"
    },
    {
      "end": 3776674,
      "speaker": "Enrico Bertini",
      "start": 3755166,
      "text": "Yeah, I mean, that's an idea, maybe, Santiago, since you have this mathematical background and you're always doing experiments, I would like to see more on. No, honestly, I think it's kind of unexplored because there were this initial couple of studies and then people abandoned it. But I think there is more space for research there.",
      "id": "ep_19_ut_250"
    },
    {
      "end": 3798184,
      "speaker": "Santiago Ortiz",
      "start": 3777294,
      "text": "It's quite interesting. And this is going to be more. One note in my ideas notebooks for projects. Yeah, fantastic. I see some potential in this idea, which is basically the inverse path. If you have a space. Imagine a map.",
      "id": "ep_19_ut_251"
    },
    {
      "end": 3799504,
      "speaker": "Enrico Bertini",
      "start": 3798724,
      "text": "Yeah.",
      "id": "ep_19_ut_252"
    },
    {
      "end": 3818774,
      "speaker": "Santiago Ortiz",
      "start": 3800004,
      "text": "A cartographic space, b dimensional. This is a way to linearize the space. It's the opposite. Like you take this. This. This is strongly, extremely long curve, and you make it like a line. So you linearize.",
      "id": "ep_19_ut_253"
    },
    {
      "end": 3834078,
      "speaker": "Enrico Bertini",
      "start": 3818854,
      "text": "Well, I think that's the way Hilbert curves are used in image processing. I think there are some methods in image processing that actually use exactly the same idea as a way to sample an image in a way that fills up the old image.",
      "id": "ep_19_ut_254"
    },
    {
      "end": 3869520,
      "speaker": "Santiago Ortiz",
      "start": 3834126,
      "text": "Okay, exactly. For instance, fractals, according to certain algorithms rendered that way, you can see how the fractal is increasing the resolution using this path, each time in a further level. Let's put it like that. Yes, it is interesting. I think Jason Davis can also do something with that because he also plays a lot with these kind of instructors, and his work is amazing.",
      "id": "ep_19_ut_255"
    },
    {
      "end": 3880084,
      "speaker": "Enrico Bertini",
      "start": 3869712,
      "text": "That's another thing I wanted to ask you. Who are the, let's say the well known visualization designers who have a mathematical background?",
      "id": "ep_19_ut_256"
    },
    {
      "end": 3884264,
      "speaker": "Santiago Ortiz",
      "start": 3880744,
      "text": "I can't answer that, because one of.",
      "id": "ep_19_ut_257"
    },
    {
      "end": 3886008,
      "speaker": "Moritz Stefaner",
      "start": 3884304,
      "text": "Them, Jason Davis, for sure.",
      "id": "ep_19_ut_258"
    },
    {
      "end": 3909718,
      "speaker": "Santiago Ortiz",
      "start": 3886096,
      "text": "I mean, Jason Davis is very inspiring, and it's very stimulating. But the work that he does, I like the most. Like a specific mathematic visualization. Right. So it's very specific. But as a visualization, like, professional is mods. Yes. Right.",
      "id": "ep_19_ut_259"
    },
    {
      "end": 3912314,
      "speaker": "Enrico Bertini",
      "start": 3909846,
      "text": "I think Martin Wattenberg is a.",
      "id": "ep_19_ut_260"
    },
    {
      "end": 3914926,
      "speaker": "Moritz Stefaner",
      "start": 3913934,
      "text": "He has a physics background.",
      "id": "ep_19_ut_261"
    },
    {
      "end": 3915966,
      "speaker": "Enrico Bertini",
      "start": 3914950,
      "text": "I thought it was matte.",
      "id": "ep_19_ut_262"
    },
    {
      "end": 3917358,
      "speaker": "Moritz Stefaner",
      "start": 3916070,
      "text": "If you have a physics background, you.",
      "id": "ep_19_ut_263"
    },
    {
      "end": 3922764,
      "speaker": "Santiago Ortiz",
      "start": 3917366,
      "text": "Have a math background, but you're. You're asking me about a specific mathematical visualization or visualization.",
      "id": "ep_19_ut_264"
    },
    {
      "end": 3928772,
      "speaker": "Enrico Bertini",
      "start": 3922884,
      "text": "No, no, no. I was thinking about people with math people with math.",
      "id": "ep_19_ut_265"
    },
    {
      "end": 3942892,
      "speaker": "Santiago Ortiz",
      "start": 3928828,
      "text": "Well, math, I think Moritz also fit a little bit in that a lot of his work, the FIFA project, has a really interesting triangulation approach to the globe. So clearly he also plays a lot with geometry.",
      "id": "ep_19_ut_266"
    },
    {
      "end": 3949648,
      "speaker": "Enrico Bertini",
      "start": 3943028,
      "text": "I meant people who have been trained in maths. Okay. Who have a background in math. Yeah.",
      "id": "ep_19_ut_267"
    },
    {
      "end": 3962424,
      "speaker": "Santiago Ortiz",
      "start": 3949776,
      "text": "Well, I don't know for many people, which is his background, but Jason Davis, for, like, using mathematics is a really nice case.",
      "id": "ep_19_ut_268"
    },
    {
      "end": 3974018,
      "speaker": "Moritz Stefaner",
      "start": 3962584,
      "text": "But other than that, I couldn't think of anyone else either. So, I mean, Martin is the token physicist, but other than that. Yeah, it's funny. What do all the mathematicians do?",
      "id": "ep_19_ut_269"
    },
    {
      "end": 3977822,
      "speaker": "Enrico Bertini",
      "start": 3974136,
      "text": "Or maybe Jan Lowe. I think she has a background in.",
      "id": "ep_19_ut_270"
    },
    {
      "end": 3979438,
      "speaker": "Moritz Stefaner",
      "start": 3977998,
      "text": "Could be mathematician, too.",
      "id": "ep_19_ut_271"
    },
    {
      "end": 3981834,
      "speaker": "Santiago Ortiz",
      "start": 3979486,
      "text": "Yeah, I think she is mathematician, yes.",
      "id": "ep_19_ut_272"
    },
    {
      "end": 4003554,
      "speaker": "Moritz Stefaner",
      "start": 3986214,
      "text": "Yeah, that could be. Yeah. So, yeah, if you're a mathematician, let us know. We are looking for you. We have a last question from Twitter, I think, and I'd like to hear that one, too. So mister Andy Kirk, visualizing data. He said he would like.",
      "id": "ep_19_ut_273"
    },
    {
      "end": 4009534,
      "speaker": "Enrico Bertini",
      "start": 4003594,
      "text": "You don't want to mention Andy again. He's always here. Come on. You could have said another name.",
      "id": "ep_19_ut_274"
    },
    {
      "end": 4030426,
      "speaker": "Moritz Stefaner",
      "start": 4009834,
      "text": "Some guy on Twitter would like to hear Santiago's view on the difference between Europe, North America and South America. Because, you know, all these three different scenes, especially, like, the date of a scene, is there a difference in how people are, what they do and. Or is it all the big global party? What would you say?",
      "id": "ep_19_ut_275"
    },
    {
      "end": 4032694,
      "speaker": "Santiago Ortiz",
      "start": 4030530,
      "text": "I think it is a global party.",
      "id": "ep_19_ut_276"
    },
    {
      "end": 4035014,
      "speaker": "Moritz Stefaner",
      "start": 4034034,
      "text": "I think so.",
      "id": "ep_19_ut_277"
    },
    {
      "end": 4116711,
      "speaker": "Santiago Ortiz",
      "start": 4036274,
      "text": "It's very difficult to. Particularly between Europe and the United States is so well, so entangled, so well communicated that it's impossible to find. I will point something. This company chieftain, for instance, for me, represents classic European approach to information. Right. Because more of the, like, the intellectual background they put on it is different. It's extremely difficult for me to explain that, but I see some kind of difference. I can compare this company with seed media, the people behind the visualizing.org, because they have similar goals, but the difference are clear, like, in the methodologies and the way they do the work. But this is not strictly related with information visualization. And then Latin America. Latin America is like a question for me. I don't see a strong, like, scene going on here. Like. Like a lot of people are strongly communicated.",
      "id": "ep_19_ut_278"
    },
    {
      "end": 4119839,
      "speaker": "Moritz Stefaner",
      "start": 4116807,
      "text": "That's a bit of news graphics. So there's interesting news graphics.",
      "id": "ep_19_ut_279"
    },
    {
      "end": 4123719,
      "speaker": "Santiago Ortiz",
      "start": 4119911,
      "text": "Embrac. Exactly. But printing media.",
      "id": "ep_19_ut_280"
    },
    {
      "end": 4129223,
      "speaker": "Enrico Bertini",
      "start": 4123911,
      "text": "Alberto Cairo, when he was here, he actually mentioned that there is a quite strong.",
      "id": "ep_19_ut_281"
    },
    {
      "end": 4136871,
      "speaker": "Moritz Stefaner",
      "start": 4129343,
      "text": "Yeah, yeah, no, that's clear. And they're super interesting. And there were a few really good news.",
      "id": "ep_19_ut_282"
    },
    {
      "end": 4181433,
      "speaker": "Santiago Ortiz",
      "start": 4137007,
      "text": "Yeah, but that's print media, very specific and not well connected with the world. It's very bracit, let's put it like that. I know specific people. I know people here in Argentina, for instance, Leonardo Solas or, and that's perhaps the most common case. People from Latin America working in the United States, for instance, Nicolas Belmonte or Mauricio Giraldo are only two examples. Miguel Rios, that works with. But there's no, there's no, like, Latin American, like, information visualization proposal. Okay?",
      "id": "ep_19_ut_283"
    },
    {
      "end": 4186865,
      "speaker": "Moritz Stefaner",
      "start": 4181553,
      "text": "And so maybe you need to build it up. Maybe you need to start a little school or an academy.",
      "id": "ep_19_ut_284"
    },
    {
      "end": 4289914,
      "speaker": "Santiago Ortiz",
      "start": 4186889,
      "text": "Well, this is, this is very connected with something that I have asked myself, like, all the time. It's about my relationship, the relationship between my culture and what I do. This is a question I carry for, like, for 20 years, right? Because I am different and my culture is different. And the things I read and listen, many of them are different. My interests are different, my language is different. So in some point, I expect that this identity in the work that we talked about some minutes ago, should also carry some kind of cultural values, assets. I don't know how that could happen. But in some point, what you are should be also expressing what you do, right? And. But it's very difficult to really, like, understand. Also, as a mathematician, mathematics is, like, the most universal language we can figure out, right? So as a mathematician, it's like. It's a way to connect with, like, universal or western universal stuff, right? It's very universal. So I don't know. It's a very difficult question. And also, I think anyone here in Latin America working with technology, with data, with information, with mathematics, with, et cetera, with visualization, we'll use, like, the United States and Europe as the primary model. So this is very post colonial scenario, right?",
      "id": "ep_19_ut_285"
    },
    {
      "end": 4324712,
      "speaker": "Moritz Stefaner",
      "start": 4290374,
      "text": "Yeah, that's true. Yeah. It's interesting. I mean, I feel the same. And while we're all very connected through the work, and because the work we do is universal, I think that there's these strong ties. But on the other hand, like, from a business point of view or collaboration point of view, at some point, I learned I worked much better with Europeans because it's just the little things and I don't know the general style, somehow it works out better. So I love my Americans, but somehow the projects never work out that well.",
      "id": "ep_19_ut_286"
    },
    {
      "end": 4339632,
      "speaker": "Santiago Ortiz",
      "start": 4324888,
      "text": "Yes. Perhaps it's because there is a paradox going on here, is that you, Moritz, being German, you are more exotic than I am, because I can tell you.",
      "id": "ep_19_ut_287"
    },
    {
      "end": 4341564,
      "speaker": "Enrico Bertini",
      "start": 4339648,
      "text": "That Germans are quite exotic.",
      "id": "ep_19_ut_288"
    },
    {
      "end": 4349480,
      "speaker": "Moritz Stefaner",
      "start": 4341904,
      "text": "Yes, he's exotic, but I mean, everybody has like a German grand uncle or something in the US. But you're right, the latin culture is maybe more.",
      "id": "ep_19_ut_289"
    },
    {
      "end": 4413386,
      "speaker": "Santiago Ortiz",
      "start": 4349552,
      "text": "It's a mixture, mixture of Europe and the United States, and some specific local assets as well. But at the end of the day, it also depends on what kind of family, what kind of social strata you belong, etcetera, of course. But in my case, I study in a french school. I was always in touch with European assets, values, and also with the American pop culture invading us all the time. So at the end of the day, for me, I'm in a middle point between the United States and Europe. When I traveled to Spain, I felt absolutely comfortable living there. And in the United States, I feel also very comfortable. I struggle a little with the language, I still have a lot to learn, but it's easy for me. I don't know. And so far, with clients, it has been easy as well. Yes.",
      "id": "ep_19_ut_290"
    },
    {
      "end": 4419418,
      "speaker": "Moritz Stefaner",
      "start": 4413490,
      "text": "Nice. Yeah, it's great. And I mean, it's. Once again, we are reminded that it's really nice too, that we're able to do that.",
      "id": "ep_19_ut_291"
    },
    {
      "end": 4421130,
      "speaker": "Santiago Ortiz",
      "start": 4419466,
      "text": "Exactly. That's fantastic.",
      "id": "ep_19_ut_292"
    },
    {
      "end": 4425338,
      "speaker": "Moritz Stefaner",
      "start": 4421162,
      "text": "Hop around the world and be in touch with everybody. I personally love it.",
      "id": "ep_19_ut_293"
    },
    {
      "end": 4430054,
      "speaker": "Santiago Ortiz",
      "start": 4425386,
      "text": "Enrico, how do you feel like living and working in American New York?",
      "id": "ep_19_ut_294"
    },
    {
      "end": 4433854,
      "speaker": "Enrico Bertini",
      "start": 4431194,
      "text": "Do you want me to comment on that publicly?",
      "id": "ep_19_ut_295"
    },
    {
      "end": 4436698,
      "speaker": "Santiago Ortiz",
      "start": 4434194,
      "text": "Yes, a little bit. About yes.",
      "id": "ep_19_ut_296"
    },
    {
      "end": 4456346,
      "speaker": "Enrico Bertini",
      "start": 4436746,
      "text": "No, honestly, honestly, I think I've been asked this question many times already, but I think I cannot really answer because living in New York, I think it's different than living in the US, in any other place in the US. So here there is such a strong New York culture that I could speak for New York.",
      "id": "ep_19_ut_297"
    },
    {
      "end": 4462930,
      "speaker": "Santiago Ortiz",
      "start": 4456530,
      "text": "Not for Guaco, Texas, for instance. Sorry, not for Guaco, Texas.",
      "id": "ep_19_ut_298"
    },
    {
      "end": 4487094,
      "speaker": "Enrico Bertini",
      "start": 4463082,
      "text": "Yeah, exactly, exactly, exactly. Nebraska or Wyoming, whatever. So I don't know. So far, living in New York has been great. I mean, people are. There are so many different people. I mean, I'm not even sure you can talk about one single culture here. So you have everything. So you just get what you like and you stick with it. So.",
      "id": "ep_19_ut_299"
    },
    {
      "end": 4498184,
      "speaker": "Santiago Ortiz",
      "start": 4487834,
      "text": "But there, there is a culture, a business culture, and there is academic culture, and that is strong and it's defined well.",
      "id": "ep_19_ut_300"
    },
    {
      "end": 4530512,
      "speaker": "Enrico Bertini",
      "start": 4498224,
      "text": "I'm not too much exposed to the business culture here, because I'm an academic and I don't have too much exposure to the business culture. Okay. Some people here complain that, I don't know, maybe some of the academic things here are too business oriented, but I never noticed that here so far. So for me, I mean, I'm almost always been in academia in my life so far, and I don't see very big differences. I mean, it's more.",
      "id": "ep_19_ut_301"
    },
    {
      "end": 4532564,
      "speaker": "Santiago Ortiz",
      "start": 4530608,
      "text": "Academy is a big country.",
      "id": "ep_19_ut_302"
    },
    {
      "end": 4536644,
      "speaker": "Enrico Bertini",
      "start": 4533104,
      "text": "Yeah. Maybe you should visualize that. I mean.",
      "id": "ep_19_ut_303"
    },
    {
      "end": 4540444,
      "speaker": "Moritz Stefaner",
      "start": 4537064,
      "text": "Yeah. Transform the academic space.",
      "id": "ep_19_ut_304"
    },
    {
      "end": 4551214,
      "speaker": "Enrico Bertini",
      "start": 4541224,
      "text": "It's pretty stable a bit everywhere. So I've been in several countries so far, and people are quite similar in the way they behave in the. In academic settings.",
      "id": "ep_19_ut_305"
    },
    {
      "end": 4552650,
      "speaker": "Santiago Ortiz",
      "start": 4551874,
      "text": "Okay.",
      "id": "ep_19_ut_306"
    },
    {
      "end": 4556334,
      "speaker": "Moritz Stefaner",
      "start": 4552762,
      "text": "As long as you spend 16 hours per day in front of your computer.",
      "id": "ep_19_ut_307"
    },
    {
      "end": 4577454,
      "speaker": "Enrico Bertini",
      "start": 4559034,
      "text": "Yeah. Yeah. Well, that's the thing. In academic settings, you. You never get a lot of too much pressure compared to the business settings. Right. But, yeah, at the same time, this all freedom you have could be. Could also kill you. So. I don't know.",
      "id": "ep_19_ut_308"
    },
    {
      "end": 4586610,
      "speaker": "Moritz Stefaner",
      "start": 4578234,
      "text": "Yeah, I think you. I mean, how long are you there? Half a year or something. So, I mean, we'll have to also see how it. How it plays out on the way.",
      "id": "ep_19_ut_309"
    },
    {
      "end": 4588694,
      "speaker": "Santiago Ortiz",
      "start": 4586762,
      "text": "Yes. Yeah.",
      "id": "ep_19_ut_310"
    },
    {
      "end": 4599314,
      "speaker": "Moritz Stefaner",
      "start": 4589674,
      "text": "Cool. Last question I have to ask you. Mobyu is your nickname. Why is that your nickname? Is that because of Mobius Strip? Or is there, like. Is there any cool story behind this? No.",
      "id": "ep_19_ut_311"
    },
    {
      "end": 4625696,
      "speaker": "Santiago Ortiz",
      "start": 4599394,
      "text": "No. Is there is the Moritz street. But it wasn't me that choose the name. It's the name of the first company I had in Colombia. And I, as I kept the domain and the name, of course it fits well, but it wasn't me. It was an architect that choose this name, not the mathematician of the team.",
      "id": "ep_19_ut_312"
    },
    {
      "end": 4627400,
      "speaker": "Moritz Stefaner",
      "start": 4625800,
      "text": "And now it's your brand.",
      "id": "ep_19_ut_313"
    },
    {
      "end": 4629170,
      "speaker": "Santiago Ortiz",
      "start": 4627472,
      "text": "It's my brand. Exactly.",
      "id": "ep_19_ut_314"
    },
    {
      "end": 4630074,
      "speaker": "Moritz Stefaner",
      "start": 4629352,
      "text": "Nice.",
      "id": "ep_19_ut_315"
    },
    {
      "end": 4686556,
      "speaker": "Enrico Bertini",
      "start": 4631374,
      "text": "That's cool. Okay, I think we can stop here. I would actually keep talking for another hour, but then it's probably too much. That's the thing with Santiago. You start talking and you never stop because it's so interesting. So I think it was the same when we met at tapestry. We started talking about. What was it about, Santiago? The story of mayors in Bogota. Right. That was fun. Pena Losa and the other fantastic guy. I could have talked with you for another couple of days. Anyway, good. Thanks a lot for being here, Santiago. It's been great. And I want to explore more. Your webpage. You have so many projects that I honestly, I didn't have time to look to all of them, but, yeah, you.",
      "id": "ep_19_ut_316"
    },
    {
      "end": 4688464,
      "speaker": "Moritz Stefaner",
      "start": 4686580,
      "text": "Didn'T browse all 50 of them.",
      "id": "ep_19_ut_317"
    },
    {
      "end": 4692628,
      "speaker": "Santiago Ortiz",
      "start": 4689684,
      "text": "Hey, thanks, guys. It was a fantastic conversation.",
      "id": "ep_19_ut_318"
    },
    {
      "end": 4701692,
      "speaker": "Moritz Stefaner",
      "start": 4692716,
      "text": "Yeah, it was fantastic to have you. So maybe we have to repeat it in a year or so when you're all business enterprise web 2.0. I don't know what thing is up.",
      "id": "ep_19_ut_319"
    },
    {
      "end": 4702988,
      "speaker": "Santiago Ortiz",
      "start": 4701708,
      "text": "Okay. Yes.",
      "id": "ep_19_ut_320"
    },
    {
      "end": 4704516,
      "speaker": "Moritz Stefaner",
      "start": 4703076,
      "text": "And then we can. Then we can.",
      "id": "ep_19_ut_321"
    },
    {
      "end": 4708064,
      "speaker": "Santiago Ortiz",
      "start": 4704580,
      "text": "And Enrico is completely tired of the New York culture.",
      "id": "ep_19_ut_322"
    },
    {
      "end": 4710584,
      "speaker": "Moritz Stefaner",
      "start": 4709524,
      "text": "Exactly.",
      "id": "ep_19_ut_323"
    },
    {
      "end": 4715396,
      "speaker": "Enrico Bertini",
      "start": 4712004,
      "text": "And I'm the Hilbert curve project. Okay.",
      "id": "ep_19_ut_324"
    },
    {
      "end": 4717484,
      "speaker": "Santiago Ortiz",
      "start": 4715500,
      "text": "I want to try to do something with that? Yes.",
      "id": "ep_19_ut_325"
    },
    {
      "end": 4718188,
      "speaker": "Enrico Bertini",
      "start": 4717564,
      "text": "Okay.",
      "id": "ep_19_ut_326"
    },
    {
      "end": 4719684,
      "speaker": "Moritz Stefaner",
      "start": 4718276,
      "text": "Yeah, you need to.",
      "id": "ep_19_ut_327"
    },
    {
      "end": 4721820,
      "speaker": "Santiago Ortiz",
      "start": 4719724,
      "text": "Okay. Fantastic. Okay.",
      "id": "ep_19_ut_328"
    },
    {
      "end": 4724028,
      "speaker": "Enrico Bertini",
      "start": 4722012,
      "text": "Bye. Bye, guys. Thanks a lot.",
      "id": "ep_19_ut_329"
    },
    {
      "end": 4726860,
      "speaker": "Moritz Stefaner",
      "start": 4724116,
      "text": "Yeah, thanks a lot. Bye.",
      "id": "ep_19_ut_330"
    }
  ],
  "confidence": 0.909866617687823,
  "audio_duration": 4734,
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_status_code": null,
  "webhook_auth": false,
  "webhook_auth_header_name": null,
  "speed_boost": false,
  "auto_highlights_result": null,
  "auto_highlights": false,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_audio_quality": null,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "content_safety": false,
  "iab_categories": true,
  "content_safety_labels": {
    "status": "unavailable",
    "results": [],
    "summary": {}
  },
  "language_detection": false,
  "language_detection_threshold": null,
  "language_confidence": null,
  "custom_spelling": null,
  "throttled": false,
  "auto_chapters": true,
  "summarization": false,
  "summary_type": null,
  "summary_model": null,
  "custom_topics": false,
  "topics": [],
  "speech_threshold": null,
  "speech_model": "best",
  "chapters": [
    {
      "summary": "Data stories number 19 with Moritz. And our special guest today, Santiago Ortiz. We have three continents today. Big triangle here. Iceland. Antarctica. Great circle of data visualization.",
      "gist": "Data stories",
      "headline": "Data stories number 19 with Moritz and Santiago Ortiz",
      "start": 13160,
      "end": 105636,
      "id": "ep_19_ch_0"
    },
    {
      "summary": "Artis: I just arrived from Nashville, exactly where we met. Fantastic experience, fantastic conference, and talked with a lot of people, including you. Did you wear your data stories t shirt? Artis: One day was so fast, but the conferences were so well chosen.",
      "gist": "Data Stories Conference and Demo",
      "headline": "Artis attended Tapestry, a conference related to data stories",
      "start": 105780,
      "end": 271052,
      "id": "ep_19_ch_1"
    },
    {
      "summary": "Scott McCloud was my favorite, but the others were fantastic as well. I enjoyed also Nigel Holmes because. he's explaining stuff and acting. Will they do another one next year?",
      "gist": "Taste the TAPESTRY Conference",
      "headline": "Scott McCloud was my favorite speaker at the tapestry conference",
      "start": 271108,
      "end": 518274,
      "id": "ep_19_ch_2"
    },
    {
      "summary": "Santiago Ortiz studied mathematics in Colombia. He started working in projects that mixed art and science in different ways. In 2005, he co found a company devoted to information visualization. It's an interesting adventure that's always a really good idea or a bad idea.",
      "gist": "Santiago Ortiz",
      "headline": "Santiago Ortiz is an information visualization expert from Spain",
      "start": 519014,
      "end": 760354,
      "id": "ep_19_ch_3"
    },
    {
      "summary": "Quadrigram is a visual programming language to analyze, gather and visualize information. When he left the company, he decided to create new things and a lot of new things. One of the best moves you can do if you want to become a freelancer is to dedicate time to new projects.",
      "gist": "How to start a new project in 2011",
      "headline": "So you did a lot of projects from your own motivation, I think",
      "start": 760394,
      "end": 1253210,
      "id": "ep_19_ch_4"
    },
    {
      "summary": "Santiago: I started with a concept, very wide concept, which is knowledge visualization. In contexts in which you do not start necessarily with a specific data set, but with a cultural context. In one year I will have a very different website from the one I have right now.",
      "gist": "Starting a business with no strategy",
      "headline": "Santiago started working on knowledge visualization and eventually got clients",
      "start": 1253282,
      "end": 1511174,
      "id": "ep_19_ch_5"
    },
    {
      "summary": "Santiago: One thing I like in your work is that to me, it looks like you have a very strong branding. Is it something that you do on purpose, or it just happened this way? In fact, I try to do the opposite, but of course, it's hard to escape from yourself.",
      "gist": "Santiago's unique branding",
      "headline": "One thing I really like in your work is that you have a strong branding",
      "start": 1512754,
      "end": 1596550,
      "id": "ep_19_ch_6"
    },
    {
      "summary": "Aims to combine syntactical and statistical analysis with visualization. One project is for a company based in Belgium, the company's chieftain. The other is with Kenneth Cuquier from the Economist. Trying to identify new ways to use data about economic indexes.",
      "gist": "What types of projects are you working on?",
      "headline": "Can you tell us a bit what types of projects you're working on now",
      "start": 1596622,
      "end": 1758216,
      "id": "ep_19_ch_7"
    },
    {
      "summary": "Fantastic. So your plan worked out up to now. That's great. Actually, mori, sorry, I think I lost you a little bit, but now I hear you. Yes. Very good.",
      "gist": "How Your Plan Is Working",
      "headline": "Fantastic. So your plan worked out up to now. Yes, I think so. Very good. Actually, mori, sorry,",
      "start": 1758280,
      "end": 1782104,
      "id": "ep_19_ch_8"
    },
    {
      "summary": "So how long did it take before you started getting, getting clients? Well, in the process of being experimented, I already received mails from people interested in working. It's like a very big machine that takes time to start working. But the feeling is that once it started working, it starts also having a good pace.",
      "gist": "How long did it take to start working as a freelancer?",
      "headline": "How long did it take before you started getting, getting clients",
      "start": 1783484,
      "end": 1868714,
      "id": "ep_19_ch_9"
    },
    {
      "summary": "Nuke is a toolkit of little functions that help you assemble stuff. The key is to organize well those little solutions. Do you plan on publishing the tools, or. instead of building a whole framework?",
      "gist": "Nuke 2.8: The Network Framework",
      "headline": "Kimay asked what tools are you working with for nuke Twitter app",
      "start": 1870254,
      "end": 2266442,
      "id": "ep_19_ch_10"
    },
    {
      "summary": "Santiago: Most of your visualizations are really interactive. As soon as you add a lot of interaction, it's a nightmare. How do you start a project? Do you open a text editor or do you open up your notebook? Can you get your network to help decide what to write?",
      "gist": "Data visualizations, how to start a project",
      "headline": "Santiago: Normally most of your visualizations are really interactive",
      "start": 2266538,
      "end": 2598530,
      "id": "ep_19_ch_11"
    },
    {
      "summary": "Once you have an idea, how much time do you spend in proportion in gathering the data, manipulating this data, and visualizing the data? Oh, it totally depends. In other cases, it could go up to 50% of the process.",
      "gist": "How much time do you spend on a project?",
      "headline": "How much time do you spend in proportion gathering data, manipulating data and visualization",
      "start": 2598682,
      "end": 2718404,
      "id": "ep_19_ch_12"
    },
    {
      "summary": "How much experimentation do you have in terms of how to map any given data into a visual format? I like to use the visualization concept in its most, like, wide definition or set of definitions. You have to be honest with yourself and accept that you will fail with this mental image.",
      "gist": "How to visualize a data set with visualization",
      "headline": "How much experimentation do you have in terms of how to visualize data",
      "start": 2721414,
      "end": 3107544,
      "id": "ep_19_ch_13"
    },
    {
      "summary": "Santiago, have you ever done any works that are not, like, information based, but purely pure form, let's say, or pure generative design, data, art type things? I prefer to talk about the issues behind the concepts.",
      "gist": "No information visualization in your work",
      "headline": "Santiago, have you ever done any information based projects",
      "start": 3108124,
      "end": 3333432,
      "id": "ep_19_ch_14"
    },
    {
      "summary": "Many of your projects actually have this mathematical bend, right? Yes. What is really fascinating for me is the relationship between mathematics and art. Information visualization can find interesting ideas in topology. There are many things that are not just quantities.",
      "gist": "Information Visualization and Mathematics",
      "headline": "Many of your projects actually have this mathematical bend, right? I can clearly see",
      "start": 3333528,
      "end": 3617194,
      "id": "ep_19_ch_15"
    },
    {
      "summary": "Have you ever tried to do anything with Hilbert curves? Danyel Keim first introduced the idea of using Hilbert curves in visualization. There are some methods in image processing that use exactly the same idea. I think there is more space for research there.",
      "gist": "Have You Ever Made a Hilbert Curve Visualization?",
      "headline": "Have you ever tried to do anything with Hilbert curves in visualization",
      "start": 3617894,
      "end": 3869520,
      "id": "ep_19_ch_16"
    },
    {
      "summary": "Who are the well known visualization designers who have a mathematical background? I can't answer that, because one of. Them, Jason Davis, for sure. If you're a mathematician, let us know.",
      "gist": "Have You Seen Any Math in Visualization?",
      "headline": "Who are the well known visualization designers who have a mathematical background",
      "start": 3869712,
      "end": 3992994,
      "id": "ep_19_ch_17"
    },
    {
      "summary": "Some guy on Twitter would like to hear Santiago's view on the difference between Europe, North America and South America. Is there a difference in how people are, what they do and. Or is it all the big global party?",
      "gist": "Santiago on the Difference Between Europe, North America & South",
      "headline": "Some guy on Twitter would like to hear Santiago's view on the difference",
      "start": 3994894,
      "end": 4100524,
      "id": "ep_19_ch_18"
    },
    {
      "summary": "And then Latin America. I don't see a strong, like, scene going on here. Like a lot of people are strongly communicated. But print media, very specific and not well connected with the world. Maybe you need to build it up.",
      "gist": "How to do graphics in Latin America",
      "headline": "I don't see a strong, like, scene going on here",
      "start": 4101344,
      "end": 4186865,
      "id": "ep_19_ch_19"
    },
    {
      "summary": "Moritz: I expect that this identity in the work that we talked about some minutes ago, should also carry some kind of cultural values, assets. Anyone here in Latin America working with technology, with data, with mathematics, will use the United States and Europe as the primary model. But on the other hand, I learned I worked much better with Europeans.",
      "gist": "The role of culture in the work",
      "headline": "Moritz: Work should carry some kind of cultural values, assets",
      "start": 4186889,
      "end": 4425338,
      "id": "ep_19_ch_20"
    },
    {
      "summary": "Enrico: So far, living in New York has been great. There is a culture, a business culture, and there is academic culture. But at the same time, this all freedom you have could be. Could also kill you.",
      "gist": "Living and Working in New York",
      "headline": "Enrico, how do you feel like living and working in American New York",
      "start": 4425386,
      "end": 4588694,
      "id": "ep_19_ch_21"
    },
    {
      "summary": "Mobyu is your nickname. Why is that your nickname? Is that because of Mobius Strip? No. It wasn't me that choose the name. It's the name of the first company I had in Colombia. And now it's your brand. Nice.",
      "gist": "MRK: Mobyu is my nickname",
      "headline": "Mobyu is your nickname. Why is that your nickname",
      "start": 4589674,
      "end": 4632434,
      "id": "ep_19_ch_22"
    },
    {
      "summary": "Santiago: I would actually keep talking for another hour, but then it's probably too much. You start talking and you never stop because it's so interesting. Thanks a lot for being here, Santiago. It's been great. And I want to explore more. Your webpage.",
      "gist": "A day in the life of Santiago",
      "headline": "Okay, I think we can stop here. It was a fantastic conversation. I could have talked for another hour",
      "start": 4634214,
      "end": 4726860,
      "id": "ep_19_ch_23"
    }
  ],
  "disfluencies": false,
  "entity_detection": false,
  "sentiment_analysis": false,
  "sentiment_analysis_results": null,
  "entities": null,
  "speakers_expected": null,
  "summary": null,
  "custom_topics_results": null,
  "episode_num": 19,
  "episode_metadata": {
    "speakers": [
      "Enrico Bertini",
      "Moritz Stefaner",
      "Santiago Ortiz"
    ],
    "WPid": "92",
    "url": "https://datastori.es/podlove/file/150/s/feed/c/mp3/datastories-19.mp3",
    "episode_title": "With Santiago Ortiz"
  }
}