{
  "id": "d2f13f70-8785-4ce8-b7df-0467e43a021a",
  "language_model": "assemblyai_default",
  "acoustic_model": "assemblyai_default",
  "language_code": "en_us",
  "status": "completed",
  "audio_url": "https://datastori.es/podlove/file/510/s/feed/c/mp3/43.mp3",
  "utterances": [
    {
      "end": 38270,
      "speaker": "Moritz Stefaner",
      "start": 12400,
      "text": "Datastories is supported by Tableau software, helping people see and understand their data. Get answers from interactive dashboards wherever you go. For your free trial, visit Tableau software at Tableau software.com Datastories. That's Tableau software.com Datastories.",
      "id": "ep_43_ut_0"
    },
    {
      "end": 55194,
      "speaker": "Enrico Bertini",
      "start": 42330,
      "text": "Hi everyone. This is Enrico Data Stories special edition. I am here with Moritz sitting next to me, which is in the same room, actually in the same room. And we are reporting from Biz 2014, from Paris.",
      "id": "ep_43_ut_1"
    },
    {
      "end": 56034,
      "speaker": "Moritz Stefaner",
      "start": 55282,
      "text": "That's right.",
      "id": "ep_43_ut_2"
    },
    {
      "end": 57466,
      "speaker": "Enrico Bertini",
      "start": 56162,
      "text": "That's pretty unique, Moritz.",
      "id": "ep_43_ut_3"
    },
    {
      "end": 64460,
      "speaker": "Moritz Stefaner",
      "start": 57498,
      "text": "We are here in the same room, in the same room in a good city at a scientific conference. How did that happen?",
      "id": "ep_43_ut_4"
    },
    {
      "end": 66752,
      "speaker": "Enrico Bertini",
      "start": 65520,
      "text": "That's quite interesting.",
      "id": "ep_43_ut_5"
    },
    {
      "end": 72592,
      "speaker": "Moritz Stefaner",
      "start": 66856,
      "text": "For the record, it's Tuesday, November 11, so we'll try and record a snippet every day.",
      "id": "ep_43_ut_6"
    },
    {
      "end": 73160,
      "speaker": "Enrico Bertini",
      "start": 72696,
      "text": "Yes.",
      "id": "ep_43_ut_7"
    },
    {
      "end": 76592,
      "speaker": "Moritz Stefaner",
      "start": 73240,
      "text": "And sort of Frankenstein an episode out of that later.",
      "id": "ep_43_ut_8"
    },
    {
      "end": 84620,
      "speaker": "Enrico Bertini",
      "start": 76736,
      "text": "So we will be reporting every day from the start of the conference until the end. And so what happened today?",
      "id": "ep_43_ut_9"
    },
    {
      "end": 96720,
      "speaker": "Moritz Stefaner",
      "start": 85040,
      "text": "Today was sort of the official start. There were already two days of workshops and tutorials. And today we had in the morning the keynote by Alberto Cairo, which was nice.",
      "id": "ep_43_ut_10"
    },
    {
      "end": 149768,
      "speaker": "Enrico Bertini",
      "start": 97020,
      "text": "So before we got into that, I'm just wondering, maybe some of our listeners don't know exactly what this is. So in case you know, what this 2014 is, is basically the academic conference on information visualization, or visualization in general. And this is mostly populated by dirty computer scientists like me. But there are a lot of other people and it's a very open community. And what happens is that computer scientists or researchers in general publish papers there and most of the conferences about presenting these papers, but there are a lot of other events, like panels, workshops, interesting talks, parties, parties, lots of parties. And you've been organizing something here as well, Moritz right? We gave a tutorial.",
      "id": "ep_43_ut_11"
    },
    {
      "end": 203928,
      "speaker": "Moritz Stefaner",
      "start": 149824,
      "text": "We had a tutorial. Yeah, yeah, yeah. And I mean, one thing we should also mention, its three main tracks. So there's scientific visualization, visual analytics, and the infovis. And infovis is probably what's closest to what our listeners might be into. And maybe also the visual analytics track, which integrates a bit more of data science and active visualization. Anyways, so I did a tutorial with my old pal Dominicus, who you might know from now, a couple of episodes and occasions. And we did a tutorial on everything except the chart. This is how we call it. And it was about all the little things you need to do to make a web based visualization actually successful, like all the things around it, like how to draw people into the visualization, how to make it findable, shareable and responsive and all the tricky stuff that goes into the last.",
      "id": "ep_43_ut_12"
    },
    {
      "end": 205136,
      "speaker": "Enrico Bertini",
      "start": 204024,
      "text": "Everything but the viz.",
      "id": "ep_43_ut_13"
    },
    {
      "end": 206144,
      "speaker": "Moritz Stefaner",
      "start": 205248,
      "text": "Everything but the viz.",
      "id": "ep_43_ut_14"
    },
    {
      "end": 209128,
      "speaker": "Enrico Bertini",
      "start": 206192,
      "text": "You actually create a band with this name? Everything but the viz.",
      "id": "ep_43_ut_15"
    },
    {
      "end": 224812,
      "speaker": "Moritz Stefaner",
      "start": 209184,
      "text": "Yeah, yeah. It's a good, very applied topic. So we. Yeah, it was a bit of war stories from us project and we tried to share as much practical insights as we could. And I think it was. It was okay. It was quite, quite well received in the end. Yeah.",
      "id": "ep_43_ut_16"
    },
    {
      "end": 226840,
      "speaker": "Enrico Bertini",
      "start": 224996,
      "text": "Nice, nice.",
      "id": "ep_43_ut_17"
    },
    {
      "end": 229212,
      "speaker": "Moritz Stefaner",
      "start": 227260,
      "text": "So this was yesterday?",
      "id": "ep_43_ut_18"
    },
    {
      "end": 230560,
      "speaker": "Enrico Bertini",
      "start": 229316,
      "text": "Yeah, yep.",
      "id": "ep_43_ut_19"
    },
    {
      "end": 236268,
      "speaker": "Moritz Stefaner",
      "start": 230940,
      "text": "And today. Yeah. There was the keynote by Alberto Cairo, which we already know.",
      "id": "ep_43_ut_20"
    },
    {
      "end": 237180,
      "speaker": "Enrico Bertini",
      "start": 236324,
      "text": "That was interesting.",
      "id": "ep_43_ut_21"
    },
    {
      "end": 249540,
      "speaker": "Moritz Stefaner",
      "start": 237260,
      "text": "He started slow, so. And very basic, I think. So he told us about how he explained his little kids why planets don't stop spinning, which is an interesting question, like scientifically, of course.",
      "id": "ep_43_ut_22"
    },
    {
      "end": 257560,
      "speaker": "Enrico Bertini",
      "start": 249620,
      "text": "I think, actually I was a little spoiled because I saw parts of his talk somewhere else. So it was a little hard for me to follow.",
      "id": "ep_43_ut_23"
    },
    {
      "end": 268088,
      "speaker": "Moritz Stefaner",
      "start": 258420,
      "text": "In the beginning, I wasn't really sure where he was going, if he wanted to go for the value of illustration or explanation. But in the end, his point was.",
      "id": "ep_43_ut_24"
    },
    {
      "end": 269980,
      "speaker": "Enrico Bertini",
      "start": 268244,
      "text": "I think he spent a lot of time.",
      "id": "ep_43_ut_25"
    },
    {
      "end": 271632,
      "speaker": "Moritz Stefaner",
      "start": 271080,
      "text": "Right.",
      "id": "ep_43_ut_26"
    },
    {
      "end": 303436,
      "speaker": "Enrico Bertini",
      "start": 271736,
      "text": "I think he spent a lot of time talking about truth and truthfulness. And I think one of the major points he was advocating for is that in visualization we are very much concerned with. Historically, we are concerned with clarity. So we should strive for clarity, especially if you get advice from the standard Tufte or even Stephen Few. It's mostly about being clear. And I think it was raising a good point that you can be as clear as you want, but still communicate distorted information.",
      "id": "ep_43_ut_27"
    },
    {
      "end": 315404,
      "speaker": "Moritz Stefaner",
      "start": 303588,
      "text": "Yeah. Maybe the tested assumption is that the data is true anyways, because it's data. No, maybe that is the tacit assumption in database. And so if you're clear, then everything's fine. And so I think you might.",
      "id": "ep_43_ut_28"
    },
    {
      "end": 352958,
      "speaker": "Enrico Bertini",
      "start": 315452,
      "text": "I think it's a very good point. And it raises it actually. I think it actually opens a can of worms because. Because. And we had this little discussion, me and you, before. I think it's very interesting the fact that truthfulness doesn't depend exclusively on the visualization side of things. Right. It's mostly about what kind of information do you decide to map in the first place. But at the same time, I guess that if you want to be a visualization expert, you also need to have these skills. Right. You cannot just map things blindly. And I think he raised a really good point. Yeah.",
      "id": "ep_43_ut_29"
    },
    {
      "end": 354998,
      "speaker": "Moritz Stefaner",
      "start": 352974,
      "text": "It's like necessary but nothing sufficient.",
      "id": "ep_43_ut_30"
    },
    {
      "end": 362054,
      "speaker": "Enrico Bertini",
      "start": 355094,
      "text": "Necessary but not sufficient. You still need to create good charts, good visualization basics, all the rest. Yeah.",
      "id": "ep_43_ut_31"
    },
    {
      "end": 410672,
      "speaker": "Moritz Stefaner",
      "start": 362222,
      "text": "Yeah. It's a similar sentiment. So we had a similar sentiment in our afternoon panel. So I organized a panel with some of my clients, actually, which is an awkward situation, but it worked out, so that's fine. And I brought people from the World Bank, OECD, World Economic Forum, and Greg McInerny from University of Oxford. And we talked a bit about how it is to work with data that is relevant for policymaking and policy change and potentially world changing data, and if data visualization can help us, maybe move the world towards the better. And of course, we also touched on these issues like what the politics and responsibilities of data publishing are today. And that's one of the big elephants in the room.",
      "id": "ep_43_ut_32"
    },
    {
      "end": 426100,
      "speaker": "Enrico Bertini",
      "start": 410776,
      "text": "Yeah. And I think from, from my point of view, my question is, how do you exactly learn this thing in the first place and how do you teach them? Right. I think I, I asked this thing to Alberto afterwards and he pointed me to a hundred books.",
      "id": "ep_43_ut_33"
    },
    {
      "end": 429808,
      "speaker": "Moritz Stefaner",
      "start": 427880,
      "text": "But I think for journalistic practice.",
      "id": "ep_43_ut_34"
    },
    {
      "end": 457400,
      "speaker": "Enrico Bertini",
      "start": 429904,
      "text": "No, I mean, in general, I think we, some people call that statistical thinking. I don't know if this is a term that I really like or there is a good term to describe these issues, but for sure, I think statisticians are the people who spend most of the time thinking about this issue. Right. More than probably journalists or computer scientists or other people. I don't know. What do you think?",
      "id": "ep_43_ut_35"
    },
    {
      "end": 462920,
      "speaker": "Moritz Stefaner",
      "start": 458180,
      "text": "I think that statisticians are a bit limited in a sense that they only think about numbers.",
      "id": "ep_43_ut_36"
    },
    {
      "end": 485294,
      "speaker": "Enrico Bertini",
      "start": 465740,
      "text": "Well, no, I think. I disagree. I mean, I think there is a long tradition in statistics not to be fooled by data being numerical data. In the end, I don't know. I think we actually have an entire episode about that. It's hard to debate right now, but, yeah, yeah.",
      "id": "ep_43_ut_37"
    },
    {
      "end": 498130,
      "speaker": "Moritz Stefaner",
      "start": 485422,
      "text": "And I think the truth seeking process that happens in journalism, for instance, is very qualitative also, or it takes a lot of the meaning aspects, you know, and the cultural connotation aspect.",
      "id": "ep_43_ut_38"
    },
    {
      "end": 511522,
      "speaker": "Enrico Bertini",
      "start": 498590,
      "text": "And by the way, I think it is also matter of whether we have the right incentives in place. Right. Because it's not just a matter of knowing these things. It's also whether there is some sort of market structure that leads people to.",
      "id": "ep_43_ut_39"
    },
    {
      "end": 517546,
      "speaker": "Moritz Stefaner",
      "start": 511546,
      "text": "Behaving this way or like a functioning data visualization critique structure that points out. Probably.",
      "id": "ep_43_ut_40"
    },
    {
      "end": 518114,
      "speaker": "Enrico Bertini",
      "start": 517618,
      "text": "Absolutely.",
      "id": "ep_43_ut_41"
    },
    {
      "end": 519122,
      "speaker": "Moritz Stefaner",
      "start": 518162,
      "text": "Anyways, longer story.",
      "id": "ep_43_ut_42"
    },
    {
      "end": 519586,
      "speaker": "Enrico Bertini",
      "start": 519186,
      "text": "Longer story.",
      "id": "ep_43_ut_43"
    },
    {
      "end": 551644,
      "speaker": "Moritz Stefaner",
      "start": 519618,
      "text": "But yeah. And you know, what's talking about the teaching. So I come more and more to the conviction that if we want to make people data literate, we cannot just show them stuff all the time or like reports of how we did it. And, you know, yeah. Do this, like these case studies, you know, I said before to you. And I think that's, that's sort of true, is if you want to learn how to drive a car, it doesn't help much to read the biography of a Formula One driver. So I'm not now more.",
      "id": "ep_43_ut_44"
    },
    {
      "end": 552720,
      "speaker": "Enrico Bertini",
      "start": 551732,
      "text": "That's a very.",
      "id": "ep_43_ut_45"
    },
    {
      "end": 577086,
      "speaker": "Moritz Stefaner",
      "start": 553140,
      "text": "Yeah, I'm more and more convinced that if we want people to grasp the full complexity of dealing with data, we need to do workshops and hackathons, activities where they actually create their own data and understand all the small decisions that go into a simple excel table and all the different representations, how they can fool you and so on.",
      "id": "ep_43_ut_46"
    },
    {
      "end": 591254,
      "speaker": "Enrico Bertini",
      "start": 577158,
      "text": "Yeah. Let me provide a counter argument and then probably we should stop. I think on the other hand, there is this strong sense of that mentorship, for instance, is very important for people. If you want to become a real.",
      "id": "ep_43_ut_47"
    },
    {
      "end": 593598,
      "speaker": "Moritz Stefaner",
      "start": 591302,
      "text": "Good, shouldn't reinvent the wheel all the time.",
      "id": "ep_43_ut_48"
    },
    {
      "end": 609256,
      "speaker": "Enrico Bertini",
      "start": 593694,
      "text": "Exactly. And I think that the old value of watching how leaders or great people do their work and watching them closely is actually a way to learn a lot and then develop new skills. Right.",
      "id": "ep_43_ut_49"
    },
    {
      "end": 610748,
      "speaker": "Moritz Stefaner",
      "start": 609358,
      "text": "Yeah, but I think we need both.",
      "id": "ep_43_ut_50"
    },
    {
      "end": 612132,
      "speaker": "Enrico Bertini",
      "start": 610844,
      "text": "We need both. Yeah, I agree.",
      "id": "ep_43_ut_51"
    },
    {
      "end": 615484,
      "speaker": "Moritz Stefaner",
      "start": 612196,
      "text": "Can we meet in the middle? Very good.",
      "id": "ep_43_ut_52"
    },
    {
      "end": 626756,
      "speaker": "Enrico Bertini",
      "start": 615612,
      "text": "Yeah. So what else should we say? Tell about this? I don't know. I think, of course, today we had a very large set of papers. I don't know if you attended any session.",
      "id": "ep_43_ut_53"
    },
    {
      "end": 634770,
      "speaker": "Moritz Stefaner",
      "start": 626868,
      "text": "I was in two sessions. They were very like science y. So I felt, I feel very smart right now. So things are good.",
      "id": "ep_43_ut_54"
    },
    {
      "end": 641942,
      "speaker": "Enrico Bertini",
      "start": 634900,
      "text": "So maybe we should briefly comment on Jarke van Wijk best paper award. Did you see that paper?",
      "id": "ep_43_ut_55"
    },
    {
      "end": 642782,
      "speaker": "Moritz Stefaner",
      "start": 642006,
      "text": "No, I didn't see it.",
      "id": "ep_43_ut_56"
    },
    {
      "end": 643534,
      "speaker": "Enrico Bertini",
      "start": 642806,
      "text": "Oh, you missed it.",
      "id": "ep_43_ut_57"
    },
    {
      "end": 643998,
      "speaker": "Moritz Stefaner",
      "start": 643582,
      "text": "I know.",
      "id": "ep_43_ut_58"
    },
    {
      "end": 644850,
      "speaker": "Enrico Bertini",
      "start": 644054,
      "text": "How come?",
      "id": "ep_43_ut_59"
    },
    {
      "end": 647158,
      "speaker": "Moritz Stefaner",
      "start": 645150,
      "text": "I don't know. I was at a meetup.",
      "id": "ep_43_ut_60"
    },
    {
      "end": 655470,
      "speaker": "Enrico Bertini",
      "start": 647214,
      "text": "I think so. Yeah. A student from Jack one Wick's group presented. Let me see if I can find it.",
      "id": "ep_43_ut_61"
    },
    {
      "end": 656550,
      "speaker": "Moritz Stefaner",
      "start": 655510,
      "text": "It's a network visualization.",
      "id": "ep_43_ut_62"
    },
    {
      "end": 692300,
      "speaker": "Enrico Bertini",
      "start": 656590,
      "text": "It's a network visualization, yeah. It's multivariate network exploration and presentation from detail to overview via selections and aggregations. Interesting tool. Very, very interactive. Probably a little too complex from my taste, but the basic idea is to basically. So when you have a network data, and their example was basically flows going from one region to another of the world, and to each node you have associated a number of variables. So that's multivariate. How do you exactly explore?",
      "id": "ep_43_ut_63"
    },
    {
      "end": 693236,
      "speaker": "Moritz Stefaner",
      "start": 692380,
      "text": "Right, right.",
      "id": "ep_43_ut_64"
    },
    {
      "end": 705764,
      "speaker": "Enrico Bertini",
      "start": 693388,
      "text": "And there was an hilarious moment during the presentation because the guy said that Jack said that basically what they are doing is no longer overview. How is it called? Overview.",
      "id": "ep_43_ut_65"
    },
    {
      "end": 706892,
      "speaker": "Moritz Stefaner",
      "start": 705812,
      "text": "First, details on demand.",
      "id": "ep_43_ut_66"
    },
    {
      "end": 738060,
      "speaker": "Enrico Bertini",
      "start": 706916,
      "text": "Details on demand and all the rest. So they're basically doing the opposite. It's detail first and then the rest. So the guy said that Jack basically went to him and said, we are doing this. And this thing was basically the name of Shneiderman reversed. So that that was really, really hilarious. And the way he presented this during the talk was really nice. Yeah. I didn't try the tool, but they have a URL there, so maybe it's worth.",
      "id": "ep_43_ut_67"
    },
    {
      "end": 740784,
      "speaker": "Moritz Stefaner",
      "start": 738560,
      "text": "I was quite impressed with the domino tool.",
      "id": "ep_43_ut_68"
    },
    {
      "end": 742608,
      "speaker": "Enrico Bertini",
      "start": 740912,
      "text": "Oh, I haven't seen that. Let me know.",
      "id": "ep_43_ut_69"
    },
    {
      "end": 792562,
      "speaker": "Moritz Stefaner",
      "start": 742664,
      "text": "Was it domino? Damn it. I have to look that up. But it was a very impressive tool for collecting or aligning multiple views of the same data set quickly. A bit like Tableau, in fact, grouping the data dynamically and then transferring that to another visualization. And what was interesting about it, you could, for instance, build a parallel coordinates plot and then tie that to a scatter plot and connect that then to a parallel sets representation. And everything's connected. And you built this long pipeline of connected charts, more or less, which is kind of cool. It looks funny, no? And it represents also your way, you explored the data. So it's a bit like an interactive Python notebook also, you know, where you have to sort of path of how you exploit the data, but it's reproducible.",
      "id": "ep_43_ut_70"
    },
    {
      "end": 794386,
      "speaker": "Enrico Bertini",
      "start": 792666,
      "text": "Do you know if this is available somewhere?",
      "id": "ep_43_ut_71"
    },
    {
      "end": 800666,
      "speaker": "Moritz Stefaner",
      "start": 794458,
      "text": "It's online, and it will. It's even like web based, I think, or it should be web based soon, so you can even try it out.",
      "id": "ep_43_ut_72"
    },
    {
      "end": 801666,
      "speaker": "Enrico Bertini",
      "start": 800698,
      "text": "So we will post it.",
      "id": "ep_43_ut_73"
    },
    {
      "end": 804746,
      "speaker": "Moritz Stefaner",
      "start": 801738,
      "text": "We will post the links, like, when the proper episode is done.",
      "id": "ep_43_ut_74"
    },
    {
      "end": 807156,
      "speaker": "Enrico Bertini",
      "start": 804818,
      "text": "Okay, let's wrap it up here.",
      "id": "ep_43_ut_75"
    },
    {
      "end": 809460,
      "speaker": "Moritz Stefaner",
      "start": 807228,
      "text": "Good stuff for now. We'll see what happens tomorrow.",
      "id": "ep_43_ut_76"
    },
    {
      "end": 810540,
      "speaker": "Enrico Bertini",
      "start": 809540,
      "text": "Yeah, I'm very excited.",
      "id": "ep_43_ut_77"
    },
    {
      "end": 819556,
      "speaker": "Moritz Stefaner",
      "start": 810580,
      "text": "Lots of good stuff light up. Ah. And tomorrow we have stories neither. So we will actually meet real data stories, listeners in a room.",
      "id": "ep_43_ut_78"
    },
    {
      "end": 827040,
      "speaker": "Enrico Bertini",
      "start": 819668,
      "text": "Yeah, that's gonna be really what happens. I don't know what is gonna happen. I hope they don't bring rotten tomatoes or stuff like that.",
      "id": "ep_43_ut_79"
    },
    {
      "end": 829236,
      "speaker": "Moritz Stefaner",
      "start": 828060,
      "text": "Force us to stop.",
      "id": "ep_43_ut_80"
    },
    {
      "end": 831920,
      "speaker": "Enrico Bertini",
      "start": 829348,
      "text": "Yeah, but we plan to have the soundtrack, right?",
      "id": "ep_43_ut_81"
    },
    {
      "end": 841652,
      "speaker": "Moritz Stefaner",
      "start": 832340,
      "text": "We should have the soundtrack on loop. And what's funny, also throughout the episode, whenever Enrico and I, we talk somewhere, everybody, like, turns their head and goes like, am I on the radio?",
      "id": "ep_43_ut_82"
    },
    {
      "end": 842972,
      "speaker": "Enrico Bertini",
      "start": 841716,
      "text": "I know. This is why I stayed.",
      "id": "ep_43_ut_83"
    },
    {
      "end": 858580,
      "speaker": "Moritz Stefaner",
      "start": 842996,
      "text": "Yeah, it's like, am I being interviewed? So it's sort of, we're creeping people out, but that's fun too. So we'll try and record more snippets throughout the conference. And that's it for now, I guess.",
      "id": "ep_43_ut_84"
    },
    {
      "end": 860040,
      "speaker": "Enrico Bertini",
      "start": 858660,
      "text": "Absolutely cool.",
      "id": "ep_43_ut_85"
    },
    {
      "end": 877292,
      "speaker": "Moritz Stefaner",
      "start": 867140,
      "text": "Hey, folks, it's Wednesday, November 12. I'm here with Enrico and our special long time multi time guest, Robert Cazara.",
      "id": "ep_43_ut_86"
    },
    {
      "end": 878572,
      "speaker": "Enrico Bertini",
      "start": 877436,
      "text": "Hi, Robert.",
      "id": "ep_43_ut_87"
    },
    {
      "end": 880340,
      "speaker": "Robert Kosara",
      "start": 878756,
      "text": "Hello. Thanks for having me.",
      "id": "ep_43_ut_88"
    },
    {
      "end": 883214,
      "speaker": "Enrico Bertini",
      "start": 880460,
      "text": "Nobody's surprised when Robert is here.",
      "id": "ep_43_ut_89"
    },
    {
      "end": 885310,
      "speaker": "Moritz Stefaner",
      "start": 883412,
      "text": "It's basically a furniture here.",
      "id": "ep_43_ut_90"
    },
    {
      "end": 888350,
      "speaker": "Enrico Bertini",
      "start": 886810,
      "text": "That's a compliment.",
      "id": "ep_43_ut_91"
    },
    {
      "end": 903490,
      "speaker": "Moritz Stefaner",
      "start": 889130,
      "text": "Talkative furniture. What can you do? So we are here still at Visweek. Oh, no, it's called Wiz. Yeah. I'm an amateur, you know, you can see we had a great meetup yesterday with a few of our listeners. So that was fun. Thanks for coming.",
      "id": "ep_43_ut_92"
    },
    {
      "end": 905730,
      "speaker": "Enrico Bertini",
      "start": 903610,
      "text": "Thanks for coming. If you were there.",
      "id": "ep_43_ut_93"
    },
    {
      "end": 907450,
      "speaker": "Moritz Stefaner",
      "start": 905810,
      "text": "Yeah, yeah. It was really good.",
      "id": "ep_43_ut_94"
    },
    {
      "end": 911726,
      "speaker": "Enrico Bertini",
      "start": 907530,
      "text": "It was really good. And we got a lot of good tips. Yeah, right.",
      "id": "ep_43_ut_95"
    },
    {
      "end": 914246,
      "speaker": "Moritz Stefaner",
      "start": 911798,
      "text": "Yep. Lots of good feedback, advice.",
      "id": "ep_43_ut_96"
    },
    {
      "end": 915130,
      "speaker": "Enrico Bertini",
      "start": 914398,
      "text": "Yeah.",
      "id": "ep_43_ut_97"
    },
    {
      "end": 920558,
      "speaker": "Moritz Stefaner",
      "start": 915870,
      "text": "So very nice. So, Enrico, how do you like the conference?",
      "id": "ep_43_ut_98"
    },
    {
      "end": 928070,
      "speaker": "Enrico Bertini",
      "start": 920734,
      "text": "Well, for me, it's always great. You don't have to ask. To me, how do you like the conference? That's the first one.",
      "id": "ep_43_ut_99"
    },
    {
      "end": 937066,
      "speaker": "Moritz Stefaner",
      "start": 928110,
      "text": "I like it. I feel. I feel much smarter now and very sciencey. So I know a few new formulas and funky words. I'm happy.",
      "id": "ep_43_ut_100"
    },
    {
      "end": 938550,
      "speaker": "Enrico Bertini",
      "start": 937218,
      "text": "Nice. Nice.",
      "id": "ep_43_ut_101"
    },
    {
      "end": 941430,
      "speaker": "Moritz Stefaner",
      "start": 939970,
      "text": "Robert, how about you?",
      "id": "ep_43_ut_102"
    },
    {
      "end": 950346,
      "speaker": "Robert Kosara",
      "start": 941850,
      "text": "I like it. So I've only really been to the infovis part this year, but it feels like it's a stronger infovis this year than the last two or so.",
      "id": "ep_43_ut_103"
    },
    {
      "end": 951090,
      "speaker": "Enrico Bertini",
      "start": 950418,
      "text": "Yeah, I agree.",
      "id": "ep_43_ut_104"
    },
    {
      "end": 983106,
      "speaker": "Robert Kosara",
      "start": 951170,
      "text": "Overall, I mean, there have always been really good papers, but this year there were at least two sessions that were really strong where the whole thing was really good. And it's just. And also, it seems like the presentations are getting better. And I only saw, I didn't really see one really bad one. Even this year there were two or so that were. That were kind of so, so. But all the other ones were really good. So I think it feels like things are getting people more prepared and more rehearsed and just doing a better job.",
      "id": "ep_43_ut_105"
    },
    {
      "end": 986218,
      "speaker": "Enrico Bertini",
      "start": 983218,
      "text": "Yeah, yeah. And even the quality of the slides.",
      "id": "ep_43_ut_106"
    },
    {
      "end": 987002,
      "speaker": "Robert Kosara",
      "start": 986354,
      "text": "Oh, yeah.",
      "id": "ep_43_ut_107"
    },
    {
      "end": 993020,
      "speaker": "Moritz Stefaner",
      "start": 987066,
      "text": "Few slides definitely had graphic designers and absolutely, like, they were situations.",
      "id": "ep_43_ut_108"
    },
    {
      "end": 996524,
      "speaker": "Robert Kosara",
      "start": 993060,
      "text": "Good ideas, very clean, no big disasters.",
      "id": "ep_43_ut_109"
    },
    {
      "end": 1004212,
      "speaker": "Moritz Stefaner",
      "start": 996612,
      "text": "Yeah, no, really. People thought about, okay, what is relevant of my paper? Like, nobody, you know, goes through the whole paper, just.",
      "id": "ep_43_ut_110"
    },
    {
      "end": 1004852,
      "speaker": "Enrico Bertini",
      "start": 1004396,
      "text": "And then.",
      "id": "ep_43_ut_111"
    },
    {
      "end": 1019720,
      "speaker": "Moritz Stefaner",
      "start": 1004876,
      "text": "And then everybody thinks, like, which part is actually relevant for the presentation? Which part do I lead the readers to read? Yeah, yeah, yeah. I agree. I expected much worse, so I'm really positively surprised.",
      "id": "ep_43_ut_112"
    },
    {
      "end": 1023634,
      "speaker": "Enrico Bertini",
      "start": 1020130,
      "text": "And this kind of super cramped slides, just. You never see them.",
      "id": "ep_43_ut_113"
    },
    {
      "end": 1026146,
      "speaker": "Moritz Stefaner",
      "start": 1023682,
      "text": "No, no. Good stuff.",
      "id": "ep_43_ut_114"
    },
    {
      "end": 1026874,
      "speaker": "Enrico Bertini",
      "start": 1026218,
      "text": "Good stuff.",
      "id": "ep_43_ut_115"
    },
    {
      "end": 1028994,
      "speaker": "Moritz Stefaner",
      "start": 1026962,
      "text": "So when should we go through the program?",
      "id": "ep_43_ut_116"
    },
    {
      "end": 1036570,
      "speaker": "Enrico Bertini",
      "start": 1029082,
      "text": "So I think we have to clarify that today. Yeah, today's Thursday. So yesterday we didn't record anything.",
      "id": "ep_43_ut_117"
    },
    {
      "end": 1037202,
      "speaker": "Moritz Stefaner",
      "start": 1036650,
      "text": "That's true.",
      "id": "ep_43_ut_118"
    },
    {
      "end": 1049406,
      "speaker": "Enrico Bertini",
      "start": 1037266,
      "text": "We recorded something about Tuesday. So we have quite some stuff to talk about. What happened on Wednesday and what happened on Thursday. Today so should we start from Wednesday?",
      "id": "ep_43_ut_119"
    },
    {
      "end": 1050170,
      "speaker": "Moritz Stefaner",
      "start": 1049518,
      "text": "Sure.",
      "id": "ep_43_ut_120"
    },
    {
      "end": 1072438,
      "speaker": "Enrico Bertini",
      "start": 1052350,
      "text": "Okay, we go in chronological order. Okay. So there was a very interesting session on interaction and authoring at Infovis, and I think everyone was excited about revisiting Bertin mattresses. So, Robert, you were talking about that.",
      "id": "ep_43_ut_121"
    },
    {
      "end": 1130634,
      "speaker": "Robert Kosara",
      "start": 1072534,
      "text": "Yeah. So this is an interesting paper that had had them build essentially an interactive version of the reorderable matrix. I can't quite say it, but I know what it is. So it's basically a physical version of cross tabulation. So you have a measure that's represented as a circle or some sort of visual encoding, and then you have two dimensions that you break it down by and you can order it in both dimensions. And Berta built this as a physical thing, but they implemented it in software. It's obviously much easier to do to work with that, but they really very close to the original. It also looks almost like the things that he was doing. And I liked it because it was really, they had a few extensions to it as well. And it was nicely done. It made a lot of sense and it was perfect for this year, of course, being in Paris and having the Bretag exhibit. And so I think that was a very well done, very nice people.",
      "id": "ep_43_ut_122"
    },
    {
      "end": 1135670,
      "speaker": "Moritz Stefaner",
      "start": 1130682,
      "text": "Do you think, was it primarily an homage or do you think some work will continue along these lines?",
      "id": "ep_43_ut_123"
    },
    {
      "end": 1147034,
      "speaker": "Robert Kosara",
      "start": 1136530,
      "text": "That's. I hope that they will continue because they added a few things, they added color, they added glyphs and a few other things. So that could be a nice thing to just see where that can lead.",
      "id": "ep_43_ut_124"
    },
    {
      "end": 1149770,
      "speaker": "Enrico Bertini",
      "start": 1147162,
      "text": "Do you guys think we have to explain who Bertin was?",
      "id": "ep_43_ut_125"
    },
    {
      "end": 1150430,
      "speaker": "Moritz Stefaner",
      "start": 1149810,
      "text": "Yeah.",
      "id": "ep_43_ut_126"
    },
    {
      "end": 1193226,
      "speaker": "Enrico Bertini",
      "start": 1152330,
      "text": "Well, Bertin was a famous french cartographer that published this super famous book in our community called La Semiologie Graphique Graphic. And he basically established all the fundamentals of visualization. Right. So describing, I don't know if he was the first guy who described that, but basically the whole idea that visualization, every visual representation can be decomposed into visual primitives and ways to map data features to visual primitives and giving guidelines on what works best. I think he was the first person.",
      "id": "ep_43_ut_127"
    },
    {
      "end": 1195130,
      "speaker": "Moritz Stefaner",
      "start": 1193418,
      "text": "Especially this, like, decomposition.",
      "id": "ep_43_ut_128"
    },
    {
      "end": 1195474,
      "speaker": "Enrico Bertini",
      "start": 1195210,
      "text": "Yeah.",
      "id": "ep_43_ut_129"
    },
    {
      "end": 1203750,
      "speaker": "Moritz Stefaner",
      "start": 1195522,
      "text": "This language approach that you have like certain, like recurring parts that can be combined or modified in different ways, like.",
      "id": "ep_43_ut_130"
    },
    {
      "end": 1206554,
      "speaker": "Enrico Bertini",
      "start": 1204890,
      "text": "Yeah, sorry, I didn't mean to interrupt.",
      "id": "ep_43_ut_131"
    },
    {
      "end": 1229730,
      "speaker": "Moritz Stefaner",
      "start": 1206642,
      "text": "And he built these physical, like, crazy devices, more or less these reorderable grids of matrices, and he actually made poster prints also with them. Right. So he was able maybe, you know, you have like an excel sheet, but in physical form, reorder everything by hand and then a big print out of it. Reorder it again, make the next print, and then suddenly you have big multiples.",
      "id": "ep_43_ut_132"
    },
    {
      "end": 1237790,
      "speaker": "Enrico Bertini",
      "start": 1230910,
      "text": "He was doing these things in the fifties. Right. So when computers were nothing kind of like there yet.",
      "id": "ep_43_ut_133"
    },
    {
      "end": 1238374,
      "speaker": "Moritz Stefaner",
      "start": 1237910,
      "text": "Yeah.",
      "id": "ep_43_ut_134"
    },
    {
      "end": 1248214,
      "speaker": "Enrico Bertini",
      "start": 1238462,
      "text": "So really interesting stuff. Yeah. And there is this very nice exhibit where some of his stuff is, is shown. And I think there is also reorderable metrics there.",
      "id": "ep_43_ut_135"
    },
    {
      "end": 1248590,
      "speaker": "Moritz Stefaner",
      "start": 1248262,
      "text": "Yeah.",
      "id": "ep_43_ut_136"
    },
    {
      "end": 1262948,
      "speaker": "Robert Kosara",
      "start": 1248670,
      "text": "They build. So they show his actual prototypes. And he was working on this for decades, apparently, like going through all kinds of different materials and different ways of doing it. But also they built a wooden version of it so you could do it yourself, which was quite nice. I thought it was a clever idea.",
      "id": "ep_43_ut_137"
    },
    {
      "end": 1263664,
      "speaker": "Enrico Bertini",
      "start": 1263134,
      "text": "Yeah.",
      "id": "ep_43_ut_138"
    },
    {
      "end": 1265280,
      "speaker": "Moritz Stefaner",
      "start": 1263752,
      "text": "Any other good papers from Winston?",
      "id": "ep_43_ut_139"
    },
    {
      "end": 1272272,
      "speaker": "Enrico Bertini",
      "start": 1265320,
      "text": "I think Robert was mentioning the ivys designer, which I didn't actually see, but maybe you can briefly mention.",
      "id": "ep_43_ut_140"
    },
    {
      "end": 1272592,
      "speaker": "Moritz Stefaner",
      "start": 1272296,
      "text": "Sure, yeah.",
      "id": "ep_43_ut_141"
    },
    {
      "end": 1311588,
      "speaker": "Robert Kosara",
      "start": 1272616,
      "text": "So that is a tool that lets you create a visualization on actually multiple views on a single canvas. And it's just like dragging things around, I think. And it's very much structured like tools like Tableau, Lyra, and other tools that you build things essentially from scratch, and there's lots of linking in between those different views, which is quite nice. So it looked really slick, but I didn't follow all the steps as he was building those things because the guy was presenting was really quick. So it would be interesting to see some more on the little details when you try to do certain things a certain way. But it was very impressive. I liked that a lot.",
      "id": "ep_43_ut_142"
    },
    {
      "end": 1319886,
      "speaker": "Moritz Stefaner",
      "start": 1311644,
      "text": "I think that's a little trend of the conference, that there were a couple, a couple of tools that work in a smart way with combining charts or building, like, constellations.",
      "id": "ep_43_ut_143"
    },
    {
      "end": 1320806,
      "speaker": "Enrico Bertini",
      "start": 1319958,
      "text": "It is true. Yeah.",
      "id": "ep_43_ut_144"
    },
    {
      "end": 1328198,
      "speaker": "Moritz Stefaner",
      "start": 1320838,
      "text": "Also the domino system was where you could just dock charts to each other and coordinate them and. Yeah.",
      "id": "ep_43_ut_145"
    },
    {
      "end": 1337598,
      "speaker": "Enrico Bertini",
      "start": 1328254,
      "text": "And I think we were commenting before that, this year, maybe for the first time, there are much more applications and systems and less techniques. Very single.",
      "id": "ep_43_ut_146"
    },
    {
      "end": 1338630,
      "speaker": "Moritz Stefaner",
      "start": 1337654,
      "text": "Yeah, that's true.",
      "id": "ep_43_ut_147"
    },
    {
      "end": 1341266,
      "speaker": "Enrico Bertini",
      "start": 1338670,
      "text": "So that, that's, that's definitely a trend happening here.",
      "id": "ep_43_ut_148"
    },
    {
      "end": 1343554,
      "speaker": "Moritz Stefaner",
      "start": 1341318,
      "text": "I'm missing position paper, though.",
      "id": "ep_43_ut_149"
    },
    {
      "end": 1344074,
      "speaker": "Enrico Bertini",
      "start": 1343722,
      "text": "Yeah.",
      "id": "ep_43_ut_150"
    },
    {
      "end": 1346150,
      "speaker": "Moritz Stefaner",
      "start": 1344122,
      "text": "No, no manifestos so far.",
      "id": "ep_43_ut_151"
    },
    {
      "end": 1349290,
      "speaker": "Enrico Bertini",
      "start": 1347450,
      "text": "You can have that every year.",
      "id": "ep_43_ut_152"
    },
    {
      "end": 1349946,
      "speaker": "Robert Kosara",
      "start": 1349410,
      "text": "Yeah.",
      "id": "ep_43_ut_153"
    },
    {
      "end": 1358154,
      "speaker": "Moritz Stefaner",
      "start": 1350058,
      "text": "Then we had a paper I heard was well received on visualizing statistical mix effects in Simpsons paradox. Unfortunately, I missed the presentation.",
      "id": "ep_43_ut_154"
    },
    {
      "end": 1370248,
      "speaker": "Enrico Bertini",
      "start": 1358282,
      "text": "Oh, yeah. Yeah. I really liked that. I saw only half of the presentation, but it's very interesting, the idea of taking care of some of these paradoxes.",
      "id": "ep_43_ut_155"
    },
    {
      "end": 1370808,
      "speaker": "Robert Kosara",
      "start": 1370344,
      "text": "Yeah.",
      "id": "ep_43_ut_156"
    },
    {
      "end": 1377728,
      "speaker": "Enrico Bertini",
      "start": 1370904,
      "text": "So I think, I think kind of know a little bit what the Simpsons paradox is, but explaining how it works.",
      "id": "ep_43_ut_157"
    },
    {
      "end": 1380368,
      "speaker": "Moritz Stefaner",
      "start": 1377864,
      "text": "Yeah. In short, it's just, it's just if.",
      "id": "ep_43_ut_158"
    },
    {
      "end": 1381100,
      "speaker": "Enrico Bertini",
      "start": 1380384,
      "text": "You have.",
      "id": "ep_43_ut_159"
    },
    {
      "end": 1383808,
      "speaker": "Moritz Stefaner",
      "start": 1382800,
      "text": "Averages already.",
      "id": "ep_43_ut_160"
    },
    {
      "end": 1384392,
      "speaker": "Enrico Bertini",
      "start": 1383904,
      "text": "Yeah, exactly.",
      "id": "ep_43_ut_161"
    },
    {
      "end": 1390020,
      "speaker": "Moritz Stefaner",
      "start": 1384416,
      "text": "And they come from populations of different sizes, don't average, again, over. That's like the rule of thumb.",
      "id": "ep_43_ut_162"
    },
    {
      "end": 1398402,
      "speaker": "Enrico Bertini",
      "start": 1390880,
      "text": "So they build basically visual encodings that expose this problem directly in the visualization. So that's really, really interesting.",
      "id": "ep_43_ut_163"
    },
    {
      "end": 1403290,
      "speaker": "Moritz Stefaner",
      "start": 1398546,
      "text": "So it's sort of educational about the paradox and also trying to fix it. Yeah, in a way.",
      "id": "ep_43_ut_164"
    },
    {
      "end": 1418550,
      "speaker": "Enrico Bertini",
      "start": 1403330,
      "text": "Yeah, yeah, I think so. I didn't read the paper, so I don't know the details, but I think the idea is that rather than being aware of the paradox itself, the way they encode the data makes the paradox explicit. That's good, right? That's, that's really good. Yeah, yeah.",
      "id": "ep_43_ut_165"
    },
    {
      "end": 1421110,
      "speaker": "Moritz Stefaner",
      "start": 1418890,
      "text": "So the power efficiency.",
      "id": "ep_43_ut_166"
    },
    {
      "end": 1455242,
      "speaker": "Enrico Bertini",
      "start": 1423610,
      "text": "Yeah, and I guess so I was talking with the others just before coming here, and we all agreed that basically, I mean, that's not the only paradox that you can find in statistics. There are many, many others. So I guess there are many others that we are even considering. So that's really interesting. And I think there was another one in the session, actually, this session was really, really good. So I haven't seen the effects of interactive latency on exploratory visual analysis, but it sounds really, really interesting. Yeah.",
      "id": "ep_43_ut_167"
    },
    {
      "end": 1531490,
      "speaker": "Robert Kosara",
      "start": 1455266,
      "text": "So what they did was they had a system that works on a large dataset and that is really fast, and that's of course the point of what they were trying to build. But then they said, well, what if it had been slower? And there is some literature, there's actually conflicting literature that says sometimes that can be very harmful, but sometimes it can also lead to more deliberate actions. You have more time to think, so you're more deliberate in what you're doing. But what they found is that, at least in terms of coverage. So this is for exploration of data. It certainly led to people exploring less because it was just more annoying and also just having, I guess, less sense of the data and less interaction, certainly. But the interesting thing that they found was that when they asked people afterwards, I think a third didn't actually notice a delay. They didn't feel that they were being delayed. And a number of people, I forget the percentage, like almost all of them, I think, said that if it had been slower, it wouldn't have been a problem for them, which is also kind of interesting. So they found some interesting things there. And it's an interesting thing to look at because interaction, fast interactions have been important, but also it could be useful sometimes to be slower and to be more deliberate, perhaps. But in this case, we didn't find that part.",
      "id": "ep_43_ut_168"
    },
    {
      "end": 1540158,
      "speaker": "Enrico Bertini",
      "start": 1534110,
      "text": "Artificially putting hard dolls. That's an interesting concept. We had similar papers a few years back.",
      "id": "ep_43_ut_169"
    },
    {
      "end": 1542814,
      "speaker": "Robert Kosara",
      "start": 1540214,
      "text": "Yeah, there was paper visual difficulties, right? Yeah.",
      "id": "ep_43_ut_170"
    },
    {
      "end": 1581986,
      "speaker": "Enrico Bertini",
      "start": 1542862,
      "text": "That, by the way, discussed with Jessica on the show, the controversial one, actually. And what else we had in the session that was really interesting. So we had the one about error bars considered harmful. That was interesting. I think that was a user study comparing standard error bars with other kind of encodings, which is hard to describe on the show. But it's interesting because they found that basically the traditional way scientists used to show error bars doesn't work very well.",
      "id": "ep_43_ut_171"
    },
    {
      "end": 1585426,
      "speaker": "Moritz Stefaner",
      "start": 1582178,
      "text": "So it's better to show a continuous distribution.",
      "id": "ep_43_ut_172"
    },
    {
      "end": 1586474,
      "speaker": "Enrico Bertini",
      "start": 1585538,
      "text": "Yeah, exactly.",
      "id": "ep_43_ut_173"
    },
    {
      "end": 1590898,
      "speaker": "Moritz Stefaner",
      "start": 1586522,
      "text": "Instead of a hard border where, say, inside is everything is okay and outside.",
      "id": "ep_43_ut_174"
    },
    {
      "end": 1604122,
      "speaker": "Enrico Bertini",
      "start": 1591034,
      "text": "Yeah. I think that the standard way is to have a bar, and at the top of the bar there is basically the center of the error bar on top. So they discussed a lot of problems about this kind of encoding. I think so it was credible. Yeah.",
      "id": "ep_43_ut_175"
    },
    {
      "end": 1604826,
      "speaker": "Moritz Stefaner",
      "start": 1604226,
      "text": "Convincing.",
      "id": "ep_43_ut_176"
    },
    {
      "end": 1605854,
      "speaker": "Enrico Bertini",
      "start": 1604898,
      "text": "Yeah, convincing.",
      "id": "ep_43_ut_177"
    },
    {
      "end": 1607934,
      "speaker": "Moritz Stefaner",
      "start": 1606002,
      "text": "Will see a lot of wiring plots.",
      "id": "ep_43_ut_178"
    },
    {
      "end": 1648482,
      "speaker": "Enrico Bertini",
      "start": 1608062,
      "text": "Yeah, I think they also, I think at the end of the, of the presentation, they provided a link to actually use their technique. I think this is another trend I've seen this year. A lot of people. Yeah. GitHub. No, in general, I've seen a very good trend that people post a lot more information about how to reach their work. They are not satisfied only with publishing a paper. And I think that's very, very good trend. I mean, I like to say that a paper is the starting point. Point, it's not the end point. Right. So I think that that's a very good trend, especially for an academic conference where people actually be content with publishing the paper. Right? Yeah, no, absolutely.",
      "id": "ep_43_ut_179"
    },
    {
      "end": 1649362,
      "speaker": "Moritz Stefaner",
      "start": 1648586,
      "text": "That's really good.",
      "id": "ep_43_ut_180"
    },
    {
      "end": 1663514,
      "speaker": "Enrico Bertini",
      "start": 1649426,
      "text": "That's good. Next one in the same session. Oh, I really like this one as well for experiments on the perception of bar charts. That's from Tableau, right?",
      "id": "ep_43_ut_181"
    },
    {
      "end": 1665572,
      "speaker": "Robert Kosara",
      "start": 1663602,
      "text": "Yeah, it's from McLeod.",
      "id": "ep_43_ut_182"
    },
    {
      "end": 1717234,
      "speaker": "Enrico Bertini",
      "start": 1665746,
      "text": "Yeah. Your colleagues, that's really interesting because they basically repeated some of the classic Cleveland studies. Right. And so for those of you who don't know exactly what the Cleveland and McGill studies are, they. So how to explain that? So they basically try to see what is the performance of different ways to encode quantitative information. So, for instance, using the, comparing different types of bars. So whether. Oh, it's hard to explain. So I think. So they have different kind of bar charts and then they ask their participants to compare bars that are one next to another or bars that are separated or bars that are stacked. Right. And I don't remember anything.",
      "id": "ep_43_ut_183"
    },
    {
      "end": 1725934,
      "speaker": "Moritz Stefaner",
      "start": 1717282,
      "text": "But are there meaningful differences? Because, like in traditional literature, you know, length is always, is described as being so precise that you don't have to worry anyways.",
      "id": "ep_43_ut_184"
    },
    {
      "end": 1727566,
      "speaker": "Robert Kosara",
      "start": 1725982,
      "text": "But not for comparison. But not for comparison.",
      "id": "ep_43_ut_185"
    },
    {
      "end": 1729190,
      "speaker": "Enrico Bertini",
      "start": 1727678,
      "text": "Much more complicated. Yeah.",
      "id": "ep_43_ut_186"
    },
    {
      "end": 1733782,
      "speaker": "Robert Kosara",
      "start": 1729270,
      "text": "And there's like the separation between the bars and so on. But the point of this paper was to ask why.",
      "id": "ep_43_ut_187"
    },
    {
      "end": 1753548,
      "speaker": "Enrico Bertini",
      "start": 1733926,
      "text": "Yeah, exactly. That's what I was going to say. So this is what Cleveland and McGill did in the 80 something. 84. And then they. The goal of this work of this paper is more to understand why they get that. Right. So they have been decomposing basically through some other studies. What are the issues there? And that was really, really interesting.",
      "id": "ep_43_ut_188"
    },
    {
      "end": 1755420,
      "speaker": "Moritz Stefaner",
      "start": 1753604,
      "text": "And what were the findings in the end?",
      "id": "ep_43_ut_189"
    },
    {
      "end": 1757380,
      "speaker": "Enrico Bertini",
      "start": 1755540,
      "text": "I don't remember exactly. Maybe. Robert?",
      "id": "ep_43_ut_190"
    },
    {
      "end": 1758412,
      "speaker": "Robert Kosara",
      "start": 1757420,
      "text": "Well, there were a number of different.",
      "id": "ep_43_ut_191"
    },
    {
      "end": 1788148,
      "speaker": "Enrico Bertini",
      "start": 1758476,
      "text": "But I think they had distractors. Right. They were. They were trying to see whether the results are due to distractors because in this, in the traditional study, participants were asked to compare bars that were far apart and they had other bars in between. So is it due to the fact that you have bars in between or other effects? Right. And they've been decomposing the whole thing into several effects, trying to understand which part of the old effect is due to the. Yeah, I don't know how to explain it.",
      "id": "ep_43_ut_192"
    },
    {
      "end": 1789236,
      "speaker": "Robert Kosara",
      "start": 1788244,
      "text": "To the bars in between.",
      "id": "ep_43_ut_193"
    },
    {
      "end": 1791068,
      "speaker": "Enrico Bertini",
      "start": 1789308,
      "text": "Yeah, to the bars in between or other effects.",
      "id": "ep_43_ut_194"
    },
    {
      "end": 1809676,
      "speaker": "Robert Kosara",
      "start": 1791124,
      "text": "Bigger problem if there are taller bars or smaller bars. And the smaller bars, I think were less problematic. And also the longer the bars were overall made it easier. So that's actually interesting because when you think about the aspect ratio of a chart, usually you think of a line chart.",
      "id": "ep_43_ut_195"
    },
    {
      "end": 1810046,
      "speaker": "Enrico Bertini",
      "start": 1809708,
      "text": "I.",
      "id": "ep_43_ut_196"
    },
    {
      "end": 1822706,
      "speaker": "Robert Kosara",
      "start": 1810148,
      "text": "Because there you really care about it. In a bar chart, it kind of doesn't matter. But except it does, because when you're comparing, it's easier when the bars are longer. So that's actually quite interesting to see that there's actually an effect there.",
      "id": "ep_43_ut_197"
    },
    {
      "end": 1841370,
      "speaker": "Enrico Bertini",
      "start": 1822818,
      "text": "Yeah. And by the way, I think I really like the idea of getting to the why of things because in this conference we always have quite a good number of experimental studies, but there are very few studies that actually try to look into the why things happen. I think that's really cool.",
      "id": "ep_43_ut_198"
    },
    {
      "end": 1919242,
      "speaker": "Moritz Stefaner",
      "start": 1842710,
      "text": "So that was widely regarded as the best session, and I missed it. But I saw a paper on. That was great, actually, the algebraic process for visualization design. That was a great paper for me. It was like slightly mind blowing. So, you know, it's like these great ideas, great idea, that immediately, once you have heard them, you're like, yeah, that totally makes sense. And you wonder why nobody has thought about it before. And the idea, in principle is to look at visualizations, or compare visualization techniques from a perspective of when the data changes, how is that reflected, reflected in the visualization? So, for instance, if you make a small data change and your visualization changes big time, you're like, hmm, you know, is there a good correspondence? Or maybe your data changes, but you don't see it in the visualization. That's a problem. Right. Or sometimes you have like meaningless changes in the data, like just the order of items in the file you're reading. Visualization should look the same. If it looks different, you have a problem. So it's a very nice way, actually, of talking about that process that should happen. And they have this algebraic framework. I'm not sure if the algebra is actually necessary.",
      "id": "ep_43_ut_199"
    },
    {
      "end": 1919506,
      "speaker": "Enrico Bertini",
      "start": 1919306,
      "text": "Yeah.",
      "id": "ep_43_ut_200"
    },
    {
      "end": 1932500,
      "speaker": "Moritz Stefaner",
      "start": 1919538,
      "text": "So they introduce it with these commutative diagrams where you can go left way or right way and the effect the same. They never demonstrate that it's necessary to do it in algebra. Yeah. So, yeah, I think you can describe it, you know, in plain English, and it totally makes sense.",
      "id": "ep_43_ut_201"
    },
    {
      "end": 1936892,
      "speaker": "Enrico Bertini",
      "start": 1932540,
      "text": "I agree it's a little overloaded, but it's fine. I mean, everyone is his own style.",
      "id": "ep_43_ut_202"
    },
    {
      "end": 1947988,
      "speaker": "Moritz Stefaner",
      "start": 1936956,
      "text": "Yeah, yeah. It's sort of branding a thought, you know, it's like, yeah, that's a good idea. Like how can we make it like ultra cool? But the basic thought is brilliant, I think it is not to take away from that.",
      "id": "ep_43_ut_203"
    },
    {
      "end": 1948644,
      "speaker": "Enrico Bertini",
      "start": 1948044,
      "text": "Yeah, yeah.",
      "id": "ep_43_ut_204"
    },
    {
      "end": 1950768,
      "speaker": "Moritz Stefaner",
      "start": 1948732,
      "text": "What's your take on that? When did you see it?",
      "id": "ep_43_ut_205"
    },
    {
      "end": 1956660,
      "speaker": "Robert Kosara",
      "start": 1950824,
      "text": "I did not see that presentation. I'm really sorry, because that bezel video is probably the one I wanted to see the most, but then I'm missing.",
      "id": "ep_43_ut_206"
    },
    {
      "end": 1994252,
      "speaker": "Moritz Stefaner",
      "start": 1957760,
      "text": "And it reminds me of a cognitive science theory. So there's a theory called sensory motor, sensory motor contingencies and the ideas that we can explain our senses, like what it feels like to see something or what it feels like to hear something. It's not about the absolute stimulus, like the absolute signal, but it's about the change of the signal when we change our position in the world, when the environment changes. So it's never about the absolute signal, but always just about the derivative, sort of. And this totally resonates with that. And it's a very smart way of thinking about systems in general and. Totally works for me.",
      "id": "ep_43_ut_207"
    },
    {
      "end": 2000580,
      "speaker": "Enrico Bertini",
      "start": 1994356,
      "text": "Yeah. And I think I also really like the fact that they tried to give names to the effects and they give really cool names.",
      "id": "ep_43_ut_208"
    },
    {
      "end": 2005364,
      "speaker": "Moritz Stefaner",
      "start": 2000620,
      "text": "I don't remember the jumbler, the so good.",
      "id": "ep_43_ut_209"
    },
    {
      "end": 2027896,
      "speaker": "Enrico Bertini",
      "start": 2005492,
      "text": "And I think it's very clever because then it's like the design pattern things, right? You remember the name and then it sticks into your mind. Right. So I'm actually planning to use it for, in my class to teach my students because I think that's going to be really, really useful. It's a few patterns that once you understand them, can be really useful in evaluating and also building new visualizations.",
      "id": "ep_43_ut_210"
    },
    {
      "end": 2040340,
      "speaker": "Moritz Stefaner",
      "start": 2027928,
      "text": "It's a good rule of thumb, like big difference in the data should be visually salient, and visually salient things should correspond to important stuff in your data. You know, it's very basic, but never has never been formulated that clearly.",
      "id": "ep_43_ut_211"
    },
    {
      "end": 2040620,
      "speaker": "Enrico Bertini",
      "start": 2040380,
      "text": "Yeah.",
      "id": "ep_43_ut_212"
    },
    {
      "end": 2045240,
      "speaker": "Moritz Stefaner",
      "start": 2040660,
      "text": "So brilliant. Nice stuff. Anything else from Wednesday?",
      "id": "ep_43_ut_213"
    },
    {
      "end": 2068688,
      "speaker": "Enrico Bertini",
      "start": 2048220,
      "text": "I just want to briefly mention there was a panel on challenges in financial visualization. That's interesting because there are companies out there like Bloomberg who have, of course, lots of visualization, but at the same time, I've never seen anything special in our community. Any pay, any. Do you remember any payroll? Financial visualization, Robert? It's rare, right?",
      "id": "ep_43_ut_214"
    },
    {
      "end": 2082280,
      "speaker": "Robert Kosara",
      "start": 2068784,
      "text": "There have been a few, but I think it's probably been ten years since the last one. There were a few in like the late nineties and probably around the.com bubble, I would guess. But yeah, it's been a long time.",
      "id": "ep_43_ut_215"
    },
    {
      "end": 2104330,
      "speaker": "Enrico Bertini",
      "start": 2082320,
      "text": "It's been a long time. That's interesting. And then I was in the panel and I asked to the panelists, I said something like what I just said now. So it's really surprising that there's no research in this area. And they were very happy about that. And then I said, maybe it's because you are not funding everyone anyway.",
      "id": "ep_43_ut_216"
    },
    {
      "end": 2111810,
      "speaker": "Robert Kosara",
      "start": 2105270,
      "text": "Oh, and not to forget, of course, the west coast party. I don't know if you talked about the parties in the past, but that was a big one.",
      "id": "ep_43_ut_217"
    },
    {
      "end": 2116530,
      "speaker": "Moritz Stefaner",
      "start": 2112550,
      "text": "I'm still hungover and it's 24 hours later almost.",
      "id": "ep_43_ut_218"
    },
    {
      "end": 2118206,
      "speaker": "Enrico Bertini",
      "start": 2117470,
      "text": "Yeah.",
      "id": "ep_43_ut_219"
    },
    {
      "end": 2154200,
      "speaker": "Moritz Stefaner",
      "start": 2118358,
      "text": "Yeah. So I guess that's a good time to talk about our sponsor. Data stories is supported by Tableau software, helping people see and understand their data. Tableau lets people connect to any kind of data and visualize it on the fly. Databases, spreadsheets, and even big data sources are easily combined into interactive visualizations, reports and dashboards. What is your data trying to tell you? They also had a presence here at the Visconference, so of course, Robert, but he's always been around, like even before. But they also have a few other researchers, so they have a whole research team.",
      "id": "ep_43_ut_220"
    },
    {
      "end": 2156384,
      "speaker": "Enrico Bertini",
      "start": 2154240,
      "text": "Yeah, very interesting research from their side.",
      "id": "ep_43_ut_221"
    },
    {
      "end": 2173968,
      "speaker": "Moritz Stefaner",
      "start": 2156472,
      "text": "And one of the studies was about, I think we touched on it, the bar chart perception papers are really looking at low level properties. Like what a fine difference in a bar chart that can make a difference when it comes to readability. It's very practical, applicable research, but it's still also interesting.",
      "id": "ep_43_ut_222"
    },
    {
      "end": 2174400,
      "speaker": "Enrico Bertini",
      "start": 2174024,
      "text": "Yeah.",
      "id": "ep_43_ut_223"
    },
    {
      "end": 2175808,
      "speaker": "Moritz Stefaner",
      "start": 2174480,
      "text": "For researchers. Right. And that's.",
      "id": "ep_43_ut_224"
    },
    {
      "end": 2181112,
      "speaker": "Enrico Bertini",
      "start": 2175864,
      "text": "Absolutely. Absolutely. I think what I like of that research is that they try to understand why things happen.",
      "id": "ep_43_ut_225"
    },
    {
      "end": 2181784,
      "speaker": "Moritz Stefaner",
      "start": 2181176,
      "text": "Yeah. Yeah.",
      "id": "ep_43_ut_226"
    },
    {
      "end": 2183240,
      "speaker": "Enrico Bertini",
      "start": 2181832,
      "text": "Which is not common.",
      "id": "ep_43_ut_227"
    },
    {
      "end": 2215316,
      "speaker": "Moritz Stefaner",
      "start": 2183360,
      "text": "Yeah. And they also supported the conference, so they were sponsored. So I think that's super cool. And you really feel. Yeah. It's a product coming out of research and they're still sort of involved in that community, so that's a good thing. So for your free trial, visit Tableau software@Tableau Software.com Datastories don't forget the data stories part. Data stories. That makes it a better URL. And just if you wonder how to spell it, it's Tableau software.com. so that's French, actually.",
      "id": "ep_43_ut_228"
    },
    {
      "end": 2215876,
      "speaker": "Enrico Bertini",
      "start": 2215428,
      "text": "Yeah.",
      "id": "ep_43_ut_229"
    },
    {
      "end": 2224560,
      "speaker": "Moritz Stefaner",
      "start": 2215948,
      "text": "And so we say au revoir and back to the episode. Yeah. People say.",
      "id": "ep_43_ut_230"
    },
    {
      "end": 2230758,
      "speaker": "Enrico Bertini",
      "start": 2229670,
      "text": "Where do we start?",
      "id": "ep_43_ut_231"
    },
    {
      "end": 2234730,
      "speaker": "Moritz Stefaner",
      "start": 2230894,
      "text": "Yeah, I overslept. So I cannot talk that much about the morning.",
      "id": "ep_43_ut_232"
    },
    {
      "end": 2238542,
      "speaker": "Enrico Bertini",
      "start": 2236350,
      "text": "That's the thing. It's too early every day.",
      "id": "ep_43_ut_233"
    },
    {
      "end": 2240982,
      "speaker": "Moritz Stefaner",
      "start": 2238686,
      "text": "Yeah. They started 830. They make us go there.",
      "id": "ep_43_ut_234"
    },
    {
      "end": 2242534,
      "speaker": "Enrico Bertini",
      "start": 2241046,
      "text": "Yeah. 830 is really hard.",
      "id": "ep_43_ut_235"
    },
    {
      "end": 2255460,
      "speaker": "Moritz Stefaner",
      "start": 2242622,
      "text": "Yeah. I saw Jack von bike visualization of regular maps. That was fun. It's a purely mathematical, like, you know, fun excursion. Yeah. But it was fun, but it didn't have any visualization. Relevant ones, ultimately.",
      "id": "ep_43_ut_236"
    },
    {
      "end": 2332852,
      "speaker": "Robert Kosara",
      "start": 2255760,
      "text": "Well, there was this paper on staggered animation that I thought was pretty good. Oh, yeah. So there's this idea in realization that when you have an animation or transition, that you should not start all the movements at the same time, but stagger them. So you do one after the other. And that's been. There was a paper by Jeff here and a few others a while ago, and it's basically accepted as a good idea. And they were looking into this, and they have a study where they basically showed that it really doesn't have effect. It doesn't actually help people understand what's going on, or at least it doesn't help them track the object. So that we should be more careful in saying that. But I have a few issues with their study because they were looking at points moving around, and a lot of times when people do transitions, they move objects that you can identify, like bars, and you can track because they have different heights. If you have lines moving, they have different colors, probably. So it's not exactly representing what would happen in the visualization, but still, it's a good idea to question these things. Just like the Cleveland McGill thing or the bar charts paper questioned or basically asked, why is this the case? I think this one is also good. To say, well, let's dig into this a bit and see if this is a real thing and what it really means. So I like that part about it. I still need to really read it in more detail too.",
      "id": "ep_43_ut_237"
    },
    {
      "end": 2344446,
      "speaker": "Enrico Bertini",
      "start": 2332916,
      "text": "Yeah, same for me. I was really surprised by the methodology that they adopted. I think it was pretty new. They didn't limit themselves to the classic controlled experiment kind of.",
      "id": "ep_43_ut_238"
    },
    {
      "end": 2347286,
      "speaker": "Robert Kosara",
      "start": 2344478,
      "text": "That was very smart. Yeah, they tried to make the whole.",
      "id": "ep_43_ut_239"
    },
    {
      "end": 2369206,
      "speaker": "Enrico Bertini",
      "start": 2347318,
      "text": "Thing much more general. So if I remember correctly, they defined a number of metrics. Right. To basically predict which one, which of the techniques available is more effective. Right. And then they tested it, and once they validated the metrics, they tried to produce lots of cases.",
      "id": "ep_43_ut_240"
    },
    {
      "end": 2369726,
      "speaker": "Robert Kosara",
      "start": 2369398,
      "text": "Right.",
      "id": "ep_43_ut_241"
    },
    {
      "end": 2370422,
      "speaker": "Enrico Bertini",
      "start": 2369758,
      "text": "How was it?",
      "id": "ep_43_ut_242"
    },
    {
      "end": 2371542,
      "speaker": "Robert Kosara",
      "start": 2370526,
      "text": "Well, I think they were doing.",
      "id": "ep_43_ut_243"
    },
    {
      "end": 2374166,
      "speaker": "Enrico Bertini",
      "start": 2371606,
      "text": "So they used Monte Carlo simulation to.",
      "id": "ep_43_ut_244"
    },
    {
      "end": 2382950,
      "speaker": "Robert Kosara",
      "start": 2374198,
      "text": "Predict the best combination of factors, of parameters. So the one that would have, would have shown him the most effect.",
      "id": "ep_43_ut_245"
    },
    {
      "end": 2385446,
      "speaker": "Enrico Bertini",
      "start": 2383030,
      "text": "Yeah, exactly. And that was very smart.",
      "id": "ep_43_ut_246"
    },
    {
      "end": 2387454,
      "speaker": "Robert Kosara",
      "start": 2385638,
      "text": "Methodology is amazing.",
      "id": "ep_43_ut_247"
    },
    {
      "end": 2390730,
      "speaker": "Enrico Bertini",
      "start": 2387622,
      "text": "I would love to see it replicated in future years.",
      "id": "ep_43_ut_248"
    },
    {
      "end": 2394760,
      "speaker": "Robert Kosara",
      "start": 2392080,
      "text": "The same structure being used for a lot of other things.",
      "id": "ep_43_ut_249"
    },
    {
      "end": 2396160,
      "speaker": "Enrico Bertini",
      "start": 2394800,
      "text": "Yeah, exactly, exactly.",
      "id": "ep_43_ut_250"
    },
    {
      "end": 2400020,
      "speaker": "Moritz Stefaner",
      "start": 2396200,
      "text": "That's another trend, I think, like crazy evaluation methodologies.",
      "id": "ep_43_ut_251"
    },
    {
      "end": 2414208,
      "speaker": "Enrico Bertini",
      "start": 2400480,
      "text": "Yeah, but I think it's good. It is really good because I mean, if we keep just comparing a, b and c and the result is b is better. I don't know how to connect all these dots, right.",
      "id": "ep_43_ut_252"
    },
    {
      "end": 2415232,
      "speaker": "Moritz Stefaner",
      "start": 2414264,
      "text": "No, absolutely.",
      "id": "ep_43_ut_253"
    },
    {
      "end": 2420390,
      "speaker": "Enrico Bertini",
      "start": 2415296,
      "text": "I think it's useful. What else we had today.",
      "id": "ep_43_ut_254"
    },
    {
      "end": 2482928,
      "speaker": "Moritz Stefaner",
      "start": 2420770,
      "text": "I saw a nice tool, so the paper title is a mess, but it's called combing the communication hairball. Visualizing large parallel execution traces using logical time. It's really good. So it's a nice high end tool for monitoring parallel computation processes and sort of spotting when there is like a bottleneck because one process has to wait for other to finish. And they just did two very smart things. Like they used logical time, which means like how the actual program is structured or how the sequence of events is rather than absolute time. And so they could produce a very compressed view. And instead of visualizing the times and the supposed times or whatever, they just had a very clear color coding on what is delayed and what is on time. So it was a very smart way of boiling a problem down to a very effective encoding and suddenly I. Super effective display. So I liked it from just. It was a solution, you know, it's solving a very specific design problem really well with data vision safety.",
      "id": "ep_43_ut_255"
    },
    {
      "end": 2484580,
      "speaker": "Enrico Bertini",
      "start": 2483024,
      "text": "So, yeah, that's what we like.",
      "id": "ep_43_ut_256"
    },
    {
      "end": 2486100,
      "speaker": "Moritz Stefaner",
      "start": 2484920,
      "text": "That's what I like.",
      "id": "ep_43_ut_257"
    },
    {
      "end": 2495024,
      "speaker": "Enrico Bertini",
      "start": 2486600,
      "text": "Do you have an idea if the tool is. Well, not the tool probably, but any, there's any video on the web yeah, that should be. There should be something, right?",
      "id": "ep_43_ut_258"
    },
    {
      "end": 2495488,
      "speaker": "Moritz Stefaner",
      "start": 2495072,
      "text": "Yeah.",
      "id": "ep_43_ut_259"
    },
    {
      "end": 2496380,
      "speaker": "Enrico Bertini",
      "start": 2495584,
      "text": "Okay.",
      "id": "ep_43_ut_260"
    },
    {
      "end": 2501380,
      "speaker": "Moritz Stefaner",
      "start": 2498080,
      "text": "And then afternoon was. Was pretty good session.",
      "id": "ep_43_ut_261"
    },
    {
      "end": 2503106,
      "speaker": "Enrico Bertini",
      "start": 2502490,
      "text": "Yeah.",
      "id": "ep_43_ut_262"
    },
    {
      "end": 2504778,
      "speaker": "Moritz Stefaner",
      "start": 2503218,
      "text": "Perceptual kernels.",
      "id": "ep_43_ut_263"
    },
    {
      "end": 2515922,
      "speaker": "Enrico Bertini",
      "start": 2504954,
      "text": "Oh, that was cool. Yeah. Perceptual kernels. Robert, you want to describe that? I'm passing the ball. It's too hard.",
      "id": "ep_43_ut_264"
    },
    {
      "end": 2517066,
      "speaker": "Robert Kosara",
      "start": 2515946,
      "text": "I have to work hard here.",
      "id": "ep_43_ut_265"
    },
    {
      "end": 2517842,
      "speaker": "Enrico Bertini",
      "start": 2517138,
      "text": "Yeah.",
      "id": "ep_43_ut_266"
    },
    {
      "end": 2573130,
      "speaker": "Robert Kosara",
      "start": 2518026,
      "text": "Being on the show. So, on a high level, basically what they were trying to do is figure out what are the right. What's the right palette of shapes and colors and sizes, I think, for encoding data by looking at how well they are differentiated. So it's well known that there is a law. I think this is Stevens Law, but I forget. Sometimes I mix up the names, but basically, the larger the size gets, the less difference we see between the size. Right. Or maybe it's smaller in this case, I forget. But either way, there's a situation effect. And then there are also these categorical things, like shapes, for example. And so you want to see which ones of those are just read the wrong way sometimes. And so you want to make sure that they are, like, if you have a star shape and you can only go to so many star, so many point symbols.",
      "id": "ep_43_ut_267"
    },
    {
      "end": 2573490,
      "speaker": "Enrico Bertini",
      "start": 2573170,
      "text": "Yeah.",
      "id": "ep_43_ut_268"
    },
    {
      "end": 2599480,
      "speaker": "Robert Kosara",
      "start": 2573570,
      "text": "Yeah. So that, because if you have 25 of them, you're not going to be able to actually have a part 124 or whatever. So they were looking at a way of establishing that. So doing studies that actually established what those numbers are and what kind of the power or the exponent is, I guess, for the Stevens law to figure out what kinds of encoding should be used so that they are really the easiest to read and to differentiate.",
      "id": "ep_43_ut_269"
    },
    {
      "end": 2600000,
      "speaker": "Enrico Bertini",
      "start": 2599640,
      "text": "Yeah.",
      "id": "ep_43_ut_270"
    },
    {
      "end": 2610700,
      "speaker": "Moritz Stefaner",
      "start": 2600040,
      "text": "And I found it the smartest for the shape palettes, because everybody runs into these problems. There is only, like, three, four really distinctive shapes, like circles square across.",
      "id": "ep_43_ut_271"
    },
    {
      "end": 2612416,
      "speaker": "Enrico Bertini",
      "start": 2611080,
      "text": "And then it already starts.",
      "id": "ep_43_ut_272"
    },
    {
      "end": 2620176,
      "speaker": "Moritz Stefaner",
      "start": 2612448,
      "text": "Like, a triangle is sort of like a square. I mean, it's definitely more like a square than like a circle. You know, you run into similarities.",
      "id": "ep_43_ut_273"
    },
    {
      "end": 2620824,
      "speaker": "Enrico Bertini",
      "start": 2620288,
      "text": "Yeah, yeah.",
      "id": "ep_43_ut_274"
    },
    {
      "end": 2629952,
      "speaker": "Moritz Stefaner",
      "start": 2620872,
      "text": "And they made these measurable and then even had a method for saying, like, well, if two data points are similar, why not give them a similar shape if you have to use similar shapes anymore?",
      "id": "ep_43_ut_275"
    },
    {
      "end": 2630540,
      "speaker": "Enrico Bertini",
      "start": 2629976,
      "text": "Sure.",
      "id": "ep_43_ut_276"
    },
    {
      "end": 2631424,
      "speaker": "Moritz Stefaner",
      "start": 2630880,
      "text": "Smart.",
      "id": "ep_43_ut_277"
    },
    {
      "end": 2639732,
      "speaker": "Enrico Bertini",
      "start": 2631512,
      "text": "And I think they also created a library that you can download and use directly, probably in D3 or pro. Just really useful.",
      "id": "ep_43_ut_278"
    },
    {
      "end": 2640108,
      "speaker": "Moritz Stefaner",
      "start": 2639796,
      "text": "Yeah.",
      "id": "ep_43_ut_279"
    },
    {
      "end": 2644756,
      "speaker": "Enrico Bertini",
      "start": 2640164,
      "text": "And by the way, the symbols and all the rest look pretty much like those that are in Tableau.",
      "id": "ep_43_ut_280"
    },
    {
      "end": 2652748,
      "speaker": "Robert Kosara",
      "start": 2644908,
      "text": "Well, they actually took them from there at the beginning where they had. They showed that, I think the color palette and the shapes were taken directly from there.",
      "id": "ep_43_ut_281"
    },
    {
      "end": 2655748,
      "speaker": "Enrico Bertini",
      "start": 2652844,
      "text": "Oh, okay, good.",
      "id": "ep_43_ut_282"
    },
    {
      "end": 2663840,
      "speaker": "Moritz Stefaner",
      "start": 2655804,
      "text": "Yeah. Next one. Another, like, mind blower ranking visualization of correlation using Weber's law.",
      "id": "ep_43_ut_283"
    },
    {
      "end": 2665780,
      "speaker": "Enrico Bertini",
      "start": 2665040,
      "text": "Yeah.",
      "id": "ep_43_ut_284"
    },
    {
      "end": 2667608,
      "speaker": "Moritz Stefaner",
      "start": 2666360,
      "text": "Was a good one.",
      "id": "ep_43_ut_285"
    },
    {
      "end": 2669280,
      "speaker": "Enrico Bertini",
      "start": 2667784,
      "text": "I saw only the introduction.",
      "id": "ep_43_ut_286"
    },
    {
      "end": 2734302,
      "speaker": "Moritz Stefaner",
      "start": 2669320,
      "text": "Yeah. What they did was compare many different chart types you could use for judging correlation. So you have two variables, I don't know, income and health or something. And you want to know, like, does one cause the other? Or, like, do they often appear together? Usually you would do that. The standard would be a scatterplot, probably, and people can judge pretty well correlation, and there is some sort of a nonlinear effect. Let's say something is super correlated. Then you have a straight line in a scatter plot, like a 45 degree line, and you can easily see if something is, like, almost super correlated, you know, but if it's, like, only halfway correlated, it's much harder to judge. So basically, then you need a bigger difference, and then you get the same perceptual effect. And they looked at how well people can judge that correlation between variables. Also looking at, they said parallel coordinates, but I think it was, in the end, a slope graph because it only two axis. Yeah. Line charts, area charts, radial spider things.",
      "id": "ep_43_ut_287"
    },
    {
      "end": 2739694,
      "speaker": "Robert Kosara",
      "start": 2734366,
      "text": "They called it a doughnut chart, but it was some sort of radial line charts that I didn't quite understand.",
      "id": "ep_43_ut_288"
    },
    {
      "end": 2740878,
      "speaker": "Moritz Stefaner",
      "start": 2739742,
      "text": "That was wild. Yeah.",
      "id": "ep_43_ut_289"
    },
    {
      "end": 2743300,
      "speaker": "Robert Kosara",
      "start": 2741014,
      "text": "Total of ten, I think, different ones, months.",
      "id": "ep_43_ut_290"
    },
    {
      "end": 2749120,
      "speaker": "Moritz Stefaner",
      "start": 2743460,
      "text": "And it did lots of, like, trials, like how well people could judge. So what is the result relations?",
      "id": "ep_43_ut_291"
    },
    {
      "end": 2751360,
      "speaker": "Enrico Bertini",
      "start": 2749540,
      "text": "That's kind of plot wing correlation.",
      "id": "ep_43_ut_292"
    },
    {
      "end": 2761492,
      "speaker": "Moritz Stefaner",
      "start": 2751980,
      "text": "Well, first of all, there's a universal law. Like, all of these follow the same basic law, but just different parameters. So as the basic perceptual features.",
      "id": "ep_43_ut_293"
    },
    {
      "end": 2762084,
      "speaker": "Robert Kosara",
      "start": 2761556,
      "text": "Yeah.",
      "id": "ep_43_ut_294"
    },
    {
      "end": 2765516,
      "speaker": "Moritz Stefaner",
      "start": 2762212,
      "text": "And that's interesting because it's a higher level judgment that is made.",
      "id": "ep_43_ut_295"
    },
    {
      "end": 2766156,
      "speaker": "Enrico Bertini",
      "start": 2765628,
      "text": "Okay.",
      "id": "ep_43_ut_296"
    },
    {
      "end": 2768732,
      "speaker": "Moritz Stefaner",
      "start": 2766228,
      "text": "But it follows a very primitive, let's.",
      "id": "ep_43_ut_297"
    },
    {
      "end": 2772660,
      "speaker": "Enrico Bertini",
      "start": 2768756,
      "text": "Say perception law, which is the Weber's law.",
      "id": "ep_43_ut_298"
    },
    {
      "end": 2773460,
      "speaker": "Robert Kosara",
      "start": 2772700,
      "text": "Right, exactly.",
      "id": "ep_43_ut_299"
    },
    {
      "end": 2781492,
      "speaker": "Moritz Stefaner",
      "start": 2773580,
      "text": "Yeah. And it's. It's just like, basically like Steven's law that there is some exponent, and that is, you know, and you have to tune only one parameter, but it's always the same function.",
      "id": "ep_43_ut_300"
    },
    {
      "end": 2782124,
      "speaker": "Enrico Bertini",
      "start": 2781516,
      "text": "Yeah.",
      "id": "ep_43_ut_301"
    },
    {
      "end": 2802928,
      "speaker": "Moritz Stefaner",
      "start": 2782292,
      "text": "And other good news. Yes. Get a plus win. And the funny thing is, parallel coordinates are doing great for inverse correlations when it's exactly flipped, like it's high on one axis and low on the other and low on the one. Because. Well, we'll get to the. Because. But the interesting thing is for the positive correlation, they're terrible.",
      "id": "ep_43_ut_302"
    },
    {
      "end": 2806344,
      "speaker": "Enrico Bertini",
      "start": 2802984,
      "text": "Very bad. Very bad. Yeah. And slope graphs.",
      "id": "ep_43_ut_303"
    },
    {
      "end": 2816936,
      "speaker": "Moritz Stefaner",
      "start": 2806472,
      "text": "Everybody's darling. You know, it's everybody's darling. Basically, like, parallel coordinates are. Yeah. The stars and the, like, multidimensional, but also slope graphs, like, every designer loves them.",
      "id": "ep_43_ut_304"
    },
    {
      "end": 2817256,
      "speaker": "Enrico Bertini",
      "start": 2816968,
      "text": "Yeah.",
      "id": "ep_43_ut_305"
    },
    {
      "end": 2819540,
      "speaker": "Moritz Stefaner",
      "start": 2817328,
      "text": "And so that's bit of bad news, actually.",
      "id": "ep_43_ut_306"
    },
    {
      "end": 2822080,
      "speaker": "Enrico Bertini",
      "start": 2819920,
      "text": "So it's not symmetric basically any.",
      "id": "ep_43_ut_307"
    },
    {
      "end": 2840772,
      "speaker": "Moritz Stefaner",
      "start": 2822380,
      "text": "And so the theory was. And also one explanation, potential explanation, is that people actually use something very low level to judge the correlation. And in the, in the case of the inverted slope graph, that is like flipped like two triangles facing each other.",
      "id": "ep_43_ut_308"
    },
    {
      "end": 2841124,
      "speaker": "Enrico Bertini",
      "start": 2840836,
      "text": "Yeah.",
      "id": "ep_43_ut_309"
    },
    {
      "end": 2853116,
      "speaker": "Moritz Stefaner",
      "start": 2841172,
      "text": "That you actually just judge the height of that intersection area, like the minimum area. And then it's a low level task again, which obviously follows one of these last. And you can do the same in the scatter plot, like just judging the.",
      "id": "ep_43_ut_310"
    },
    {
      "end": 2856796,
      "speaker": "Enrico Bertini",
      "start": 2853148,
      "text": "Width of that elliptical shape around the line.",
      "id": "ep_43_ut_311"
    },
    {
      "end": 2860200,
      "speaker": "Moritz Stefaner",
      "start": 2856868,
      "text": "Around the line, yeah. And that could explain it.",
      "id": "ep_43_ut_312"
    },
    {
      "end": 2861760,
      "speaker": "Enrico Bertini",
      "start": 2861020,
      "text": "Nice.",
      "id": "ep_43_ut_313"
    },
    {
      "end": 2871588,
      "speaker": "Moritz Stefaner",
      "start": 2862260,
      "text": "Good study. And 200,000 runs, like on mechanical Turk. Like, you know, that's what I mean. It's like this. It's a new age of data, this evaluation.",
      "id": "ep_43_ut_314"
    },
    {
      "end": 2872836,
      "speaker": "Enrico Bertini",
      "start": 2871724,
      "text": "Yeah, yeah, yeah.",
      "id": "ep_43_ut_315"
    },
    {
      "end": 2874108,
      "speaker": "Moritz Stefaner",
      "start": 2872948,
      "text": "People are also a bit skeptical.",
      "id": "ep_43_ut_316"
    },
    {
      "end": 2885914,
      "speaker": "Enrico Bertini",
      "start": 2874164,
      "text": "Like often they are pretty much validated, even for eye levels. That's surprising. Yeah. You have done some of that, Robert?",
      "id": "ep_43_ut_317"
    },
    {
      "end": 2894802,
      "speaker": "Robert Kosara",
      "start": 2885962,
      "text": "Oh, yeah, we do it quite a bit. And you have to be smart about discarding data when you see people just clicking through the same thing. And it's not that hard.",
      "id": "ep_43_ut_318"
    },
    {
      "end": 2895538,
      "speaker": "Enrico Bertini",
      "start": 2894866,
      "text": "It's not that hard.",
      "id": "ep_43_ut_319"
    },
    {
      "end": 2918560,
      "speaker": "Robert Kosara",
      "start": 2895594,
      "text": "Especially when you, when you threaten people, when you tell them we're only going to pay you if you do well and give them some sort of level to reach. That has to be realistic and, you know, unfair. But that actually works quite well because they're not going to waste their time if they know it's not going to work anyway. And so it's been really good. So a lot of studies have been done now on mechanical Turk. It's working really well.",
      "id": "ep_43_ut_320"
    },
    {
      "end": 2945990,
      "speaker": "Moritz Stefaner",
      "start": 2918720,
      "text": "And you can do lots of permutations at different conditions. And that's also a mention of the perceptual kernel paper. So the guy in the talk actually said that the results are only one thing, but actually he's much more. I think he was even more proud about the methodology because they tried out a lot of different things, how to measure these kernels and actually can make meta statements. Now you know how to best set up a similar similarity charging task.",
      "id": "ep_43_ut_321"
    },
    {
      "end": 2952040,
      "speaker": "Enrico Bertini",
      "start": 2946030,
      "text": "Yeah, but this is what I've seen, as I said, I've seen many of these instances to this year of this. Really interesting.",
      "id": "ep_43_ut_322"
    },
    {
      "end": 2973548,
      "speaker": "Moritz Stefaner",
      "start": 2952070,
      "text": "Yeah, yeah. Good stuff. And then we had a visualization literacy study by some Italian guy and some french guy. Never heard of them. Enrico, who? You want to tell us a bit about it?",
      "id": "ep_43_ut_323"
    },
    {
      "end": 3053518,
      "speaker": "Enrico Bertini",
      "start": 2973644,
      "text": "Yeah, yeah. So this is a collaboration I have with this guy from. Guys actually from India, Chandelier Fagette is very well known. He has a fantastic club here in Paris. And Jeremy Boy is the PhD student who did most of the work. And I think that's really interesting because literacy is a super important and interesting topic and there's basically no research out there. And so we just started with our first step. So the idea, the basic idea there is that when you run user studies, especially on mechanic, Amazon Mechanical Turk, as we just mentioned, you don't know exactly how to measure the literacy of a participant. So the main goal there was to create a test, a validated test to measure how literate a person is in terms of being able to read visualizations. And this is validated through several. Yeah, several studies. And it was really, really interesting work. But in general, I think the whole area of understanding and measuring visual literacy is super important. Right. Especially now that visualization is exposed to a very large segment of the population. I think that's super, super important and I don't think we have a very good understanding of how literacy works. Right.",
      "id": "ep_43_ut_324"
    },
    {
      "end": 3059740,
      "speaker": "Moritz Stefaner",
      "start": 3053574,
      "text": "Yeah. And something. Everybody talks about it, but there's no way into that directly except an exotic.",
      "id": "ep_43_ut_325"
    },
    {
      "end": 3060328,
      "speaker": "Enrico Bertini",
      "start": 3059910,
      "text": "Yeah.",
      "id": "ep_43_ut_326"
    },
    {
      "end": 3071384,
      "speaker": "Moritz Stefaner",
      "start": 3060384,
      "text": "Stuff. And so I really appreciate that framework. Yeah, but you didn't, you basically just present the framework more, but didn't present that many findings like applying that?",
      "id": "ep_43_ut_327"
    },
    {
      "end": 3079760,
      "speaker": "Enrico Bertini",
      "start": 3071432,
      "text": "No, there's basically no finding there. Well, we tried the literacy test on Amazon mechanical Turk just to make sure that it works.",
      "id": "ep_43_ut_328"
    },
    {
      "end": 3080112,
      "speaker": "Moritz Stefaner",
      "start": 3079800,
      "text": "Exactly.",
      "id": "ep_43_ut_329"
    },
    {
      "end": 3087218,
      "speaker": "Enrico Bertini",
      "start": 3080136,
      "text": "And we measured a little bit the literacy of Turkey. Right. But the main goal of the paper is coming up with a test, so.",
      "id": "ep_43_ut_330"
    },
    {
      "end": 3089778,
      "speaker": "Moritz Stefaner",
      "start": 3087234,
      "text": "It's more proof of concept and the framework.",
      "id": "ep_43_ut_331"
    },
    {
      "end": 3094538,
      "speaker": "Enrico Bertini",
      "start": 3089834,
      "text": "Yeah, but the test is going to be available, so if you want to run the test yourself, you can run it.",
      "id": "ep_43_ut_332"
    },
    {
      "end": 3098362,
      "speaker": "Moritz Stefaner",
      "start": 3094634,
      "text": "And how does this work? Can you put in your own charts or is it on premise?",
      "id": "ep_43_ut_333"
    },
    {
      "end": 3100874,
      "speaker": "Enrico Bertini",
      "start": 3098386,
      "text": "No. Well, that's the thing, because you have to validate it. Right.",
      "id": "ep_43_ut_334"
    },
    {
      "end": 3111670,
      "speaker": "Moritz Stefaner",
      "start": 3100922,
      "text": "Yeah. So these need to be benchmarked, these charts and design in a special way, and then they are like. It's like an IQ, like a VQ test. VL test.",
      "id": "ep_43_ut_335"
    },
    {
      "end": 3123422,
      "speaker": "Enrico Bertini",
      "start": 3112510,
      "text": "Yeah, it is a real test. You get a score. But that's important. Right. Because in some cases you want to understand, I don't know what is the visual literacy of your audience, for instance. Right.",
      "id": "ep_43_ut_336"
    },
    {
      "end": 3123894,
      "speaker": "Moritz Stefaner",
      "start": 3123486,
      "text": "Yeah.",
      "id": "ep_43_ut_337"
    },
    {
      "end": 3125966,
      "speaker": "Enrico Bertini",
      "start": 3123982,
      "text": "So I think that's, that's really useful.",
      "id": "ep_43_ut_338"
    },
    {
      "end": 3135046,
      "speaker": "Moritz Stefaner",
      "start": 3126118,
      "text": "Yeah. There was one good remark from Johannes, an ex master colleague actually, from Potsdam, and he said, why not apply this test before you start a project? Like.",
      "id": "ep_43_ut_339"
    },
    {
      "end": 3135270,
      "speaker": "Enrico Bertini",
      "start": 3135078,
      "text": "Yeah.",
      "id": "ep_43_ut_340"
    },
    {
      "end": 3136574,
      "speaker": "Moritz Stefaner",
      "start": 3135310,
      "text": "On your focus.",
      "id": "ep_43_ut_341"
    },
    {
      "end": 3137970,
      "speaker": "Enrico Bertini",
      "start": 3136622,
      "text": "On your focus, yeah.",
      "id": "ep_43_ut_342"
    },
    {
      "end": 3144140,
      "speaker": "Moritz Stefaner",
      "start": 3139030,
      "text": "And everybody like, yeah, it sort of makes sense. Then we would actually know what people understand.",
      "id": "ep_43_ut_343"
    },
    {
      "end": 3172648,
      "speaker": "Enrico Bertini",
      "start": 3146640,
      "text": "No, but I really hope that this is starting a new line of research for, for many other people because literacy is very important and not very well studied. So there are anecdotal evidence that, for instance, some people don't know how to read. Scatter plots. Right. And scattered plots are almost never used in newspapers. I think you, Robert, know more about that than.",
      "id": "ep_43_ut_344"
    },
    {
      "end": 3173728,
      "speaker": "Robert Kosara",
      "start": 3172704,
      "text": "Well, I know that.",
      "id": "ep_43_ut_345"
    },
    {
      "end": 3182512,
      "speaker": "Enrico Bertini",
      "start": 3173824,
      "text": "I have heard several times that there are some type of charts that newspapers normally don't want to use because they know that people cannot read them.",
      "id": "ep_43_ut_346"
    },
    {
      "end": 3193432,
      "speaker": "Robert Kosara",
      "start": 3182576,
      "text": "Yeah, well, and that is largely based, I think, on assumptions and that aren't necessarily wrong. But there isn't a lot of, there isn't any science I'm aware of that's.",
      "id": "ep_43_ut_347"
    },
    {
      "end": 3194748,
      "speaker": "Enrico Bertini",
      "start": 3193456,
      "text": "Actually, there's no evidence.",
      "id": "ep_43_ut_348"
    },
    {
      "end": 3224040,
      "speaker": "Robert Kosara",
      "start": 3194944,
      "text": "And I know that New York Times, I think, or is it the Washington Post, somebody started sending out questions that was not about visualization, but they started basically asking some people questions about certain things so they would have a sense in general what people know. And so that could be something that you could do also for their visual literacy. And then they could say, well, now we know that 60% of our readers can actually read as catapult, at least to the extent that we need them to.",
      "id": "ep_43_ut_349"
    },
    {
      "end": 3241660,
      "speaker": "Enrico Bertini",
      "start": 3224180,
      "text": "And that's another type of research that I think we need. We need someone to go out there and classify all the type of basic type of charts and see whether people can read them or not. But when you look into the specifics of how to do this properly, it's much, much harder than it looks.",
      "id": "ep_43_ut_350"
    },
    {
      "end": 3242888,
      "speaker": "Robert Kosara",
      "start": 3242480,
      "text": "Right.",
      "id": "ep_43_ut_351"
    },
    {
      "end": 3246056,
      "speaker": "Enrico Bertini",
      "start": 3242944,
      "text": "So if you want to do it properly, it's not easy.",
      "id": "ep_43_ut_352"
    },
    {
      "end": 3275980,
      "speaker": "Moritz Stefaner",
      "start": 3246248,
      "text": "What I'm wondering is, honestly, is visual literacy a one dimensional thing? Like, can you express your literacy in one number? I mean, now that I say it, I'm not really convinced. Actually, the IQ thing brought me to that because people were very excited about the IQ for 100 years or so, and I don't know, I think by now it's clear it's very dubious to express somebody's intelligence in one number. And maybe there's a similar thing for.",
      "id": "ep_43_ut_353"
    },
    {
      "end": 3283564,
      "speaker": "Enrico Bertini",
      "start": 3276640,
      "text": "Well, I think IQ is something that is much harder to change. Right. Whereas literacy, it's probably much easier to change.",
      "id": "ep_43_ut_354"
    },
    {
      "end": 3285572,
      "speaker": "Moritz Stefaner",
      "start": 3283612,
      "text": "Yeah, but I mean, the single number thing.",
      "id": "ep_43_ut_355"
    },
    {
      "end": 3286452,
      "speaker": "Enrico Bertini",
      "start": 3285676,
      "text": "Yeah, I agree.",
      "id": "ep_43_ut_356"
    },
    {
      "end": 3286900,
      "speaker": "Moritz Stefaner",
      "start": 3286516,
      "text": "Yeah.",
      "id": "ep_43_ut_357"
    },
    {
      "end": 3303636,
      "speaker": "Enrico Bertini",
      "start": 3286980,
      "text": "I think that's another point that you don't know. So if you're measuring a person at this time. Right. This point in time, how easy is to move a person to a higher score, right. It might actually be very easy. I don't know. Right.",
      "id": "ep_43_ut_358"
    },
    {
      "end": 3310444,
      "speaker": "Moritz Stefaner",
      "start": 3303828,
      "text": "Yeah. But let's say, for instance, some people are really good with words and they can deal with text heavy visualizations better. Other people are perceptually.",
      "id": "ep_43_ut_359"
    },
    {
      "end": 3313608,
      "speaker": "Enrico Bertini",
      "start": 3310532,
      "text": "Oh, that's how you're talking about individual differences.",
      "id": "ep_43_ut_360"
    },
    {
      "end": 3315940,
      "speaker": "Moritz Stefaner",
      "start": 3313744,
      "text": "No, it might be a multifaceted thing.",
      "id": "ep_43_ut_361"
    },
    {
      "end": 3325968,
      "speaker": "Enrico Bertini",
      "start": 3317440,
      "text": "One part is knowledge, how much, you know, how to read a chart, and another part is more individual difference and something that you just are born with. Right.",
      "id": "ep_43_ut_362"
    },
    {
      "end": 3333008,
      "speaker": "Moritz Stefaner",
      "start": 3326104,
      "text": "No, I mean, maybe the, the general visual, visual literacy skill or score is actually composed out of, you know, substance.",
      "id": "ep_43_ut_363"
    },
    {
      "end": 3333464,
      "speaker": "Enrico Bertini",
      "start": 3333064,
      "text": "I agree.",
      "id": "ep_43_ut_364"
    },
    {
      "end": 3334416,
      "speaker": "Moritz Stefaner",
      "start": 3333512,
      "text": "Yeah, sure. Yeah.",
      "id": "ep_43_ut_365"
    },
    {
      "end": 3342608,
      "speaker": "Robert Kosara",
      "start": 3334488,
      "text": "And they think if, you know, if this is going to work for the next hundred years, and then they realize it wasn't such a good ideas, that's a good start.",
      "id": "ep_43_ut_366"
    },
    {
      "end": 3355328,
      "speaker": "Moritz Stefaner",
      "start": 3342784,
      "text": "Let's get rid of the score in 2100, but we can live with that now. It's a great, it's a great initiative and a great start.",
      "id": "ep_43_ut_367"
    },
    {
      "end": 3356264,
      "speaker": "Robert Kosara",
      "start": 3355464,
      "text": "Yeah, absolutely.",
      "id": "ep_43_ut_368"
    },
    {
      "end": 3363224,
      "speaker": "Enrico Bertini",
      "start": 3356312,
      "text": "Yeah. As I said, I really hope that some, somebody else is keeping building on top of that because that's really, and.",
      "id": "ep_43_ut_369"
    },
    {
      "end": 3385980,
      "speaker": "Moritz Stefaner",
      "start": 3363232,
      "text": "I think it's our big challenge. So in the, in many of the debate and discussions we had around our panel, like the data with the course panel and also in a working group before, is about data literacy and how we can improve on basic data understanding and make everybody a little data scientist. And this is tied together, like talking about data literacy and also teaching people, you know, all of this needs to go together.",
      "id": "ep_43_ut_370"
    },
    {
      "end": 3399162,
      "speaker": "Enrico Bertini",
      "start": 3386480,
      "text": "Yeah. Which, by the way, is not only about a problem, only about disorganization. Right. So we discussed that the right term is data literacy, see, because you might actually have a perfect chart, but the data that is behind that is terrible.",
      "id": "ep_43_ut_371"
    },
    {
      "end": 3407746,
      "speaker": "Moritz Stefaner",
      "start": 3399306,
      "text": "Yeah. And you have to be able to detect a fishy selection of data and so on. So there's still work to do. That's good news.",
      "id": "ep_43_ut_372"
    },
    {
      "end": 3408546,
      "speaker": "Enrico Bertini",
      "start": 3407938,
      "text": "Yeah.",
      "id": "ep_43_ut_373"
    },
    {
      "end": 3437392,
      "speaker": "Moritz Stefaner",
      "start": 3408658,
      "text": "Any, any general observations? I mean, it's not over yet. Tomorrow is another half day. There will be a panel from old researchers, words of wisdom, which I'm looking forward to. The cap zone by Barbara Tversky and another session. But still, we had a few general observations, like lots of tools, good evaluation, very good evaluation, no position papers, great slides. Any other like general observations?",
      "id": "ep_43_ut_374"
    },
    {
      "end": 3440888,
      "speaker": "Enrico Bertini",
      "start": 3437416,
      "text": "Well, the algebraic thing is basically a theory paper. Right.",
      "id": "ep_43_ut_375"
    },
    {
      "end": 3447834,
      "speaker": "Moritz Stefaner",
      "start": 3441024,
      "text": "Which is, it's almost a position paper in a sense, that presents a certain way to look at the whole field. Robert?",
      "id": "ep_43_ut_376"
    },
    {
      "end": 3482800,
      "speaker": "Robert Kosara",
      "start": 3447962,
      "text": "Well, I think what is interesting, but it's now happening, even though people have been talking about it for a few years but weren't doing it, is that at the end of many presentations now, people will give you a URL and that will lead to some landing page where you have the paper and some materials and that can be maybe some study materials like their results, their actual data and the materials for the study that they used so you can replicate it. Maybe a link to a source code, videos and stuff like that. I think that's a really good trend and I hope this is gonna continue. But it looks really, really good now. So I like that a lot.",
      "id": "ep_43_ut_377"
    },
    {
      "end": 3499800,
      "speaker": "Moritz Stefaner",
      "start": 3482880,
      "text": "Now the general like sentiment is definitely people want to get their stuff out there and want to have it used. You know, it's like in the past you were always. Sometimes you felt like, yeah, they don't even want you to use it so you don't break it or misunderstand it. But this has to totally changed, I think.",
      "id": "ep_43_ut_378"
    },
    {
      "end": 3501280,
      "speaker": "Enrico Bertini",
      "start": 3499840,
      "text": "No, something is changing also.",
      "id": "ep_43_ut_379"
    },
    {
      "end": 3529000,
      "speaker": "Moritz Stefaner",
      "start": 3501320,
      "text": "Our workshop on web visualization was packed. Like, you know, it was really full and people did not leave, although we had this apparently very boring middle. 2 hours of talking about tools. No, but I think. And many people came up to us and said, finally somebody tells us how to get stuff on the web properly and how to get it out there and we want to do that. Especially the young people. I am super psyched about what will come the next year, you know, when they're all native stuff. Really?",
      "id": "ep_43_ut_380"
    },
    {
      "end": 3539192,
      "speaker": "Robert Kosara",
      "start": 3529120,
      "text": "That too. Yeah. A lot of the things are actually running on the web, but I guess also the people who came to your workshop, they're all gonna start the next year. They're not gonna just have a URL, but they're gonna have a press kit.",
      "id": "ep_43_ut_381"
    },
    {
      "end": 3539664,
      "speaker": "Moritz Stefaner",
      "start": 3539256,
      "text": "You're right.",
      "id": "ep_43_ut_382"
    },
    {
      "end": 3540304,
      "speaker": "Robert Kosara",
      "start": 3539712,
      "text": "And they're gonna.",
      "id": "ep_43_ut_383"
    },
    {
      "end": 3546824,
      "speaker": "Moritz Stefaner",
      "start": 3540392,
      "text": "Yeah, exactly. And they're responsive website and. Yeah, absolutely. Yeah, yeah, that's it. Yeah, that's cool.",
      "id": "ep_43_ut_384"
    },
    {
      "end": 3554884,
      "speaker": "Enrico Bertini",
      "start": 3546992,
      "text": "And I think the divide between practitioners and academics is getting narrower and narrower. So that's very, very good news.",
      "id": "ep_43_ut_385"
    },
    {
      "end": 3559220,
      "speaker": "Moritz Stefaner",
      "start": 3554932,
      "text": "Yeah, but that's mostly because the practitioners get much smarter, you know?",
      "id": "ep_43_ut_386"
    },
    {
      "end": 3578148,
      "speaker": "Enrico Bertini",
      "start": 3559300,
      "text": "Yeah, no, I think it's both. I think we have practitioners who are much more interested now in what we are doing. And at the same time, as you said, Robert, I think even this idea of publishing things on the web, maybe making things more accessible is a sign that people want to have an impact in the real world.",
      "id": "ep_43_ut_387"
    },
    {
      "end": 3578692,
      "speaker": "Moritz Stefaner",
      "start": 3578204,
      "text": "Yeah, yeah.",
      "id": "ep_43_ut_388"
    },
    {
      "end": 3581360,
      "speaker": "Robert Kosara",
      "start": 3578716,
      "text": "That's what publishing should be all about. I mean, it's about.",
      "id": "ep_43_ut_389"
    },
    {
      "end": 3601012,
      "speaker": "Moritz Stefaner",
      "start": 3584460,
      "text": "Yeah, that's true. Good point. No, I absolutely agree. And I also have to say generally, I think the atmosphere at the conference was great. Like very friendly. Everybody was constantly. Everything, you know, all the crowds were mixing up. There were no camps or.",
      "id": "ep_43_ut_390"
    },
    {
      "end": 3601836,
      "speaker": "Enrico Bertini",
      "start": 3601036,
      "text": "No, no.",
      "id": "ep_43_ut_391"
    },
    {
      "end": 3604412,
      "speaker": "Moritz Stefaner",
      "start": 3601988,
      "text": "But funny eyes, no eye roll or something.",
      "id": "ep_43_ut_392"
    },
    {
      "end": 3617220,
      "speaker": "Robert Kosara",
      "start": 3604476,
      "text": "No. This has also been very, very friendly. So that's that. It's a great community, and there aren't any cliques or clubs or schools of thought that hate each other. It's really great. It's a really very healthy community.",
      "id": "ep_43_ut_393"
    },
    {
      "end": 3629816,
      "speaker": "Moritz Stefaner",
      "start": 3617920,
      "text": "Yeah. But I've been to other scientific conferences where I had a different feeling, where people were a bit more insecure, a bit more in camps, and there was not this lively, lively coming together.",
      "id": "ep_43_ut_394"
    },
    {
      "end": 3632380,
      "speaker": "Enrico Bertini",
      "start": 3629968,
      "text": "Yeah, yeah, yeah, yeah. Lots of parties.",
      "id": "ep_43_ut_395"
    },
    {
      "end": 3645194,
      "speaker": "Moritz Stefaner",
      "start": 3633160,
      "text": "That, too. Yeah. I'm pretty exhausted, man. We come vacations when I come home, finally get back into the office, get some proper sleep. Yeah, yeah.",
      "id": "ep_43_ut_396"
    },
    {
      "end": 3645514,
      "speaker": "Robert Kosara",
      "start": 3645242,
      "text": "Cool.",
      "id": "ep_43_ut_397"
    },
    {
      "end": 3646890,
      "speaker": "Moritz Stefaner",
      "start": 3645562,
      "text": "I think we can wrap it up here.",
      "id": "ep_43_ut_398"
    },
    {
      "end": 3647514,
      "speaker": "Enrico Bertini",
      "start": 3646970,
      "text": "Absolutely.",
      "id": "ep_43_ut_399"
    },
    {
      "end": 3647786,
      "speaker": "Moritz Stefaner",
      "start": 3647562,
      "text": "Yeah.",
      "id": "ep_43_ut_400"
    },
    {
      "end": 3648034,
      "speaker": "Enrico Bertini",
      "start": 3647818,
      "text": "Yeah.",
      "id": "ep_43_ut_401"
    },
    {
      "end": 3649042,
      "speaker": "Moritz Stefaner",
      "start": 3648082,
      "text": "Thanks, Robert, for coming.",
      "id": "ep_43_ut_402"
    },
    {
      "end": 3649962,
      "speaker": "Robert Kosara",
      "start": 3649106,
      "text": "So thanks a lot.",
      "id": "ep_43_ut_403"
    },
    {
      "end": 3650698,
      "speaker": "Moritz Stefaner",
      "start": 3650026,
      "text": "Always good.",
      "id": "ep_43_ut_404"
    },
    {
      "end": 3651514,
      "speaker": "Enrico Bertini",
      "start": 3650794,
      "text": "Always good.",
      "id": "ep_43_ut_405"
    },
    {
      "end": 3656386,
      "speaker": "Moritz Stefaner",
      "start": 3651602,
      "text": "And we'll have another half day tomorrow and then going back home.",
      "id": "ep_43_ut_406"
    },
    {
      "end": 3660026,
      "speaker": "Enrico Bertini",
      "start": 3656498,
      "text": "Yeah. Done. Next year, hopefully.",
      "id": "ep_43_ut_407"
    },
    {
      "end": 3662042,
      "speaker": "Moritz Stefaner",
      "start": 3660098,
      "text": "Yeah. Somewhere in America.",
      "id": "ep_43_ut_408"
    },
    {
      "end": 3664990,
      "speaker": "Enrico Bertini",
      "start": 3662146,
      "text": "What is next year? Chicago. Chicago, yeah.",
      "id": "ep_43_ut_409"
    },
    {
      "end": 3666080,
      "speaker": "Moritz Stefaner",
      "start": 3665340,
      "text": "No.",
      "id": "ep_43_ut_410"
    },
    {
      "end": 3667012,
      "speaker": "Robert Kosara",
      "start": 3666420,
      "text": "Okie doke.",
      "id": "ep_43_ut_411"
    },
    {
      "end": 3668200,
      "speaker": "Moritz Stefaner",
      "start": 3667036,
      "text": "Okay, thanks.",
      "id": "ep_43_ut_412"
    },
    {
      "end": 3676924,
      "speaker": "Enrico Bertini",
      "start": 3675420,
      "text": "Still in Paris. Yeah.",
      "id": "ep_43_ut_413"
    },
    {
      "end": 3678020,
      "speaker": "Moritz Stefaner",
      "start": 3676972,
      "text": "It's the last day.",
      "id": "ep_43_ut_414"
    },
    {
      "end": 3678748,
      "speaker": "Enrico Bertini",
      "start": 3678140,
      "text": "Yeah.",
      "id": "ep_43_ut_415"
    },
    {
      "end": 3680588,
      "speaker": "Moritz Stefaner",
      "start": 3678884,
      "text": "Conference has just ended.",
      "id": "ep_43_ut_416"
    },
    {
      "end": 3683560,
      "speaker": "Enrico Bertini",
      "start": 3680684,
      "text": "Friday looks pretty sad outside.",
      "id": "ep_43_ut_417"
    },
    {
      "end": 3690896,
      "speaker": "Moritz Stefaner",
      "start": 3684660,
      "text": "Everything's being disassembled. We found a quiet room here, halfway quiet. They might kick us out at some.",
      "id": "ep_43_ut_418"
    },
    {
      "end": 3698020,
      "speaker": "Enrico Bertini",
      "start": 3690928,
      "text": "Point, so I think we should just wrap it up. And so today, I missed basically everything.",
      "id": "ep_43_ut_419"
    },
    {
      "end": 3704180,
      "speaker": "Moritz Stefaner",
      "start": 3700840,
      "text": "This conference start way too early. I think you can agree on that.",
      "id": "ep_43_ut_420"
    },
    {
      "end": 3717296,
      "speaker": "Enrico Bertini",
      "start": 3704920,
      "text": "So I think the main highlight today was the capstone from Barbara Tversky. She's a famous cognitive scientist from Stanford, I guess.",
      "id": "ep_43_ut_421"
    },
    {
      "end": 3718740,
      "speaker": "Moritz Stefaner",
      "start": 3717368,
      "text": "Right, right. Yeah.",
      "id": "ep_43_ut_422"
    },
    {
      "end": 3724256,
      "speaker": "Enrico Bertini",
      "start": 3719280,
      "text": "I don't know. Morris, you have some comments on the keynote capstone?",
      "id": "ep_43_ut_423"
    },
    {
      "end": 3785270,
      "speaker": "Moritz Stefaner",
      "start": 3724328,
      "text": "Yeah, the capstone cap note. So, yeah, she talked about how we, first of all, segment events and how we. On which level, we say, okay, a new action starts here, and how they connected, how we make sense out of this continuous stream of things. And then she sort of applied that to visual storytelling, I guess, or to. And also explained quite well, I think, what makes a story and, like, a sequence and drama around it, human identification and, you know, all these things, and also contrasted that a bit with explanations or other types of. Of discourses. Sergey was also talking about language. Yeah. Actually covered quite a broad range of things. It was a good capstone. It's just, I think, like, if, you know, the discussion and the data visualization scene, her input could have been even more focused, you know, if she maybe.",
      "id": "ep_43_ut_424"
    },
    {
      "end": 3785582,
      "speaker": "Enrico Bertini",
      "start": 3785310,
      "text": "Yeah.",
      "id": "ep_43_ut_425"
    },
    {
      "end": 3802634,
      "speaker": "Moritz Stefaner",
      "start": 3785646,
      "text": "You know, if there would have been, like, a roundtable or, like, as an isolated talk. It was nice, but that would have been. Yeah. I've gotten more in depth what it means, and she said an interesting thing, that, in her view, interaction disrupts storytelling.",
      "id": "ep_43_ut_426"
    },
    {
      "end": 3812430,
      "speaker": "Enrico Bertini",
      "start": 3802682,
      "text": "Yeah, that was interesting, which I totally agree with. So we should stop creating interactive visualizations and call them.",
      "id": "ep_43_ut_427"
    },
    {
      "end": 3850120,
      "speaker": "Moritz Stefaner",
      "start": 3813650,
      "text": "Yeah. So I think in the end she was skeptical of this. Yeah. But she also said, like, that's the upside of obviously, of interactives and exploratory interfaces, that you can have lots of stuff, which I've been, of course, preaching for years now anyhow. No, it was a good talk, but it also left, I think, people a bit puzzled what that ultimately means for us. But it was also clear she knows really well what she's talking about from a cognitive science point of view. There's a lot to explore there as well. And the other thing is she brought a lot of really nice examples from comics, like how visual techniques are used.",
      "id": "ep_43_ut_428"
    },
    {
      "end": 3855946,
      "speaker": "Enrico Bertini",
      "start": 3850160,
      "text": "To create, talked about Scott McLeod's work and presenting a lot of examples that was.",
      "id": "ep_43_ut_429"
    },
    {
      "end": 3857234,
      "speaker": "Moritz Stefaner",
      "start": 3856058,
      "text": "There's a lot to be learned.",
      "id": "ep_43_ut_430"
    },
    {
      "end": 3858818,
      "speaker": "Enrico Bertini",
      "start": 3857322,
      "text": "Yeah, absolutely.",
      "id": "ep_43_ut_431"
    },
    {
      "end": 3867226,
      "speaker": "Moritz Stefaner",
      "start": 3858914,
      "text": "Yeah. And that's it already, like, no, more like, I missed the paper sessions as well, so. No idea. Maybe there were some brilliant things we totally missed. Yeah, we need to catch up on that.",
      "id": "ep_43_ut_432"
    },
    {
      "end": 3868226,
      "speaker": "Enrico Bertini",
      "start": 3867258,
      "text": "Yeah, we need to catch up.",
      "id": "ep_43_ut_433"
    },
    {
      "end": 3875858,
      "speaker": "Moritz Stefaner",
      "start": 3868298,
      "text": "But the conference was really good. Lots of good people. Everybody was like, I think everybody left with a really up.",
      "id": "ep_43_ut_434"
    },
    {
      "end": 3882070,
      "speaker": "Enrico Bertini",
      "start": 3876034,
      "text": "I think it was one of the best be ever. I think everyone is really, really happy.",
      "id": "ep_43_ut_435"
    },
    {
      "end": 3882790,
      "speaker": "Moritz Stefaner",
      "start": 3882110,
      "text": "Yeah. Yeah.",
      "id": "ep_43_ut_436"
    },
    {
      "end": 3918472,
      "speaker": "Enrico Bertini",
      "start": 3882870,
      "text": "I don't know if it's the Europe effect. It's the first time it's in Europe, but I think the quality, average quality of papers is really high. And even more interesting than that is the average quality of presentations is very high. I have seen a lot of students and junior people give amazing presentations. I've never seen that. Very well polished ones. Very well presented. Amazing, amazing work. And I know from my experience that translating an academic paper into a presentation that people can understand, it's not very easy.",
      "id": "ep_43_ut_437"
    },
    {
      "end": 3921144,
      "speaker": "Moritz Stefaner",
      "start": 3918536,
      "text": "And the challenge is you're working on that for a year or so.",
      "id": "ep_43_ut_438"
    },
    {
      "end": 3924048,
      "speaker": "Enrico Bertini",
      "start": 3921192,
      "text": "Yeah. You're like, in the whole literature, deep.",
      "id": "ep_43_ut_439"
    },
    {
      "end": 3935072,
      "speaker": "Moritz Stefaner",
      "start": 3924104,
      "text": "In the, in the, you know, in the whole, in the whole swamp, and then you have to sort of step back and think about, I think that why should anybody care about that? Like, what's the point?",
      "id": "ep_43_ut_440"
    },
    {
      "end": 3936032,
      "speaker": "Enrico Bertini",
      "start": 3935176,
      "text": "Yeah, exactly.",
      "id": "ep_43_ut_441"
    },
    {
      "end": 3936672,
      "speaker": "Moritz Stefaner",
      "start": 3936096,
      "text": "Exactly.",
      "id": "ep_43_ut_442"
    },
    {
      "end": 3946648,
      "speaker": "Enrico Bertini",
      "start": 3936736,
      "text": "And I think it's important to go through the painful process of looking at your papers and saying, that's just too much details. I don't need to explain that. Right.",
      "id": "ep_43_ut_443"
    },
    {
      "end": 3947256,
      "speaker": "Moritz Stefaner",
      "start": 3946744,
      "text": "Yeah.",
      "id": "ep_43_ut_444"
    },
    {
      "end": 3959000,
      "speaker": "Enrico Bertini",
      "start": 3947368,
      "text": "And just communicating the gist of it. And as you said, why is this important? Why is this useful? And I think in this conference we have seen a lot of papers that are not only interesting, but also useful in practice.",
      "id": "ep_43_ut_445"
    },
    {
      "end": 3964578,
      "speaker": "Moritz Stefaner",
      "start": 3959160,
      "text": "Yeah, no, absolutely. From a practical point of view, for instance, the perceptual kernels paper.",
      "id": "ep_43_ut_446"
    },
    {
      "end": 3965162,
      "speaker": "Enrico Bertini",
      "start": 3964674,
      "text": "Yeah.",
      "id": "ep_43_ut_447"
    },
    {
      "end": 3986696,
      "speaker": "Moritz Stefaner",
      "start": 3965266,
      "text": "I can directly now, if I have to design a shape palette, you know, I now actually know what the most easily distinguishable shapes are. If I need three, four, five or seven, you know, I will know how to, how to make the best out of that. And some of these things I know, maybe intuitively, but might be still a bit insecure. And other things, you know.",
      "id": "ep_43_ut_448"
    },
    {
      "end": 3987164,
      "speaker": "Enrico Bertini",
      "start": 3986818,
      "text": "Yeah.",
      "id": "ep_43_ut_449"
    },
    {
      "end": 3991860,
      "speaker": "Moritz Stefaner",
      "start": 3987212,
      "text": "You have wrong intuitions too, and so that's what science is sometimes even. Even good for.",
      "id": "ep_43_ut_450"
    },
    {
      "end": 3993244,
      "speaker": "Enrico Bertini",
      "start": 3991940,
      "text": "Yeah, sure.",
      "id": "ep_43_ut_451"
    },
    {
      "end": 4011084,
      "speaker": "Moritz Stefaner",
      "start": 3993292,
      "text": "Yeah. And so these two things, like practical, like use this instead of that. Yeah, I had a few of these really good, like, insights on that level. But also the way we teach and discuss about visualization, like mental models, help us explain what's actually going on when we put out a chart.",
      "id": "ep_43_ut_452"
    },
    {
      "end": 4016884,
      "speaker": "Enrico Bertini",
      "start": 4011172,
      "text": "I think some of these two things are the takeaways. I agree. I think some of these papers have a very clear practical impact.",
      "id": "ep_43_ut_453"
    },
    {
      "end": 4017332,
      "speaker": "Moritz Stefaner",
      "start": 4016972,
      "text": "Yeah.",
      "id": "ep_43_ut_454"
    },
    {
      "end": 4031436,
      "speaker": "Enrico Bertini",
      "start": 4017396,
      "text": "Some of them are useful for teaching visualization as well. And so the algebraic process one, I think it's going to be a very interesting model to teach in class, to give a mental model to students. I think that's really, really useful.",
      "id": "ep_43_ut_455"
    },
    {
      "end": 4034788,
      "speaker": "Moritz Stefaner",
      "start": 4031508,
      "text": "What did we see in Rico? Like, is there anything. Oh, there was missing.",
      "id": "ep_43_ut_456"
    },
    {
      "end": 4053216,
      "speaker": "Enrico Bertini",
      "start": 4034844,
      "text": "There are many things we didn't see. Probably a lot of good sessions, and I'm sorry for the papers we didn't talk about. And then there was an amazing Bertin exhibit which I just visited very briefly. I feel a little bit guilty about that. Yeah, it doesn't happen that often.",
      "id": "ep_43_ut_457"
    },
    {
      "end": 4061568,
      "speaker": "Moritz Stefaner",
      "start": 4053328,
      "text": "But in your perception, were there things that were much more present at last year's conferences that have now maybe have been a bit pushed into the background?",
      "id": "ep_43_ut_458"
    },
    {
      "end": 4075634,
      "speaker": "Enrico Bertini",
      "start": 4061624,
      "text": "Like, I think that every conference is very, very unique. You can see some little trends. So during the last two editions of this, I saw a lot of stuff about visualizing data coming from Twitter, for instance.",
      "id": "ep_43_ut_459"
    },
    {
      "end": 4075986,
      "speaker": "Robert Kosara",
      "start": 4075682,
      "text": "Right.",
      "id": "ep_43_ut_460"
    },
    {
      "end": 4077922,
      "speaker": "Enrico Bertini",
      "start": 4076058,
      "text": "And I think this year there's basically nothing.",
      "id": "ep_43_ut_461"
    },
    {
      "end": 4078866,
      "speaker": "Moritz Stefaner",
      "start": 4077986,
      "text": "No social media.",
      "id": "ep_43_ut_462"
    },
    {
      "end": 4082610,
      "speaker": "Enrico Bertini",
      "start": 4078938,
      "text": "No social media stuff. Right. It's basically gone.",
      "id": "ep_43_ut_463"
    },
    {
      "end": 4083154,
      "speaker": "Moritz Stefaner",
      "start": 4082730,
      "text": "Wow.",
      "id": "ep_43_ut_464"
    },
    {
      "end": 4083586,
      "speaker": "Enrico Bertini",
      "start": 4083242,
      "text": "Right?",
      "id": "ep_43_ut_465"
    },
    {
      "end": 4084194,
      "speaker": "Moritz Stefaner",
      "start": 4083658,
      "text": "You're right.",
      "id": "ep_43_ut_466"
    },
    {
      "end": 4088322,
      "speaker": "Enrico Bertini",
      "start": 4084282,
      "text": "Yeah. And I see a new trend, I think I.",
      "id": "ep_43_ut_467"
    },
    {
      "end": 4094014,
      "speaker": "Moritz Stefaner",
      "start": 4088506,
      "text": "Not much on explanations either, like storytelling, explanatory stuff. I have, I haven't seen a single paper on it.",
      "id": "ep_43_ut_468"
    },
    {
      "end": 4128144,
      "speaker": "Enrico Bertini",
      "start": 4094062,
      "text": "Yes, exactly. Yeah. Even storytelling is kind of like not really old school. I don't know what's happening, but I have seen for the first time lots of really good sessions on user studies that have practical impact or are just very, very interesting, amazing work. Maybe some of them, even from the methodological point of view. Really, really good stuff. And what else? I think the biggest trend, as I said, is even higher quality. It's always very high quality, but this year is really amazing.",
      "id": "ep_43_ut_469"
    },
    {
      "end": 4128808,
      "speaker": "Moritz Stefaner",
      "start": 4128192,
      "text": "Yeah.",
      "id": "ep_43_ut_470"
    },
    {
      "end": 4131888,
      "speaker": "Enrico Bertini",
      "start": 4128984,
      "text": "So that's, that's really good.",
      "id": "ep_43_ut_471"
    },
    {
      "end": 4132580,
      "speaker": "Moritz Stefaner",
      "start": 4131944,
      "text": "Yeah.",
      "id": "ep_43_ut_472"
    },
    {
      "end": 4142528,
      "speaker": "Enrico Bertini",
      "start": 4133040,
      "text": "And I don't know what else we missed. Panels, probably. Panels are always good. I really like panels, but I missed most of them.",
      "id": "ep_43_ut_473"
    },
    {
      "end": 4148072,
      "speaker": "Moritz Stefaner",
      "start": 4142584,
      "text": "So if you, if you have been here or you spot something where you say, like, oh, this should be mentioned.",
      "id": "ep_43_ut_474"
    },
    {
      "end": 4150632,
      "speaker": "Enrico Bertini",
      "start": 4148176,
      "text": "Drop us a line, let us know.",
      "id": "ep_43_ut_475"
    },
    {
      "end": 4151032,
      "speaker": "Moritz Stefaner",
      "start": 4150696,
      "text": "Yeah.",
      "id": "ep_43_ut_476"
    },
    {
      "end": 4152912,
      "speaker": "Enrico Bertini",
      "start": 4151096,
      "text": "Because we cannot, we might have watched.",
      "id": "ep_43_ut_477"
    },
    {
      "end": 4163380,
      "speaker": "Moritz Stefaner",
      "start": 4153016,
      "text": "Some really good stuff and generally let us know what you think. And if you have suggestions for good topics, rate us on iTunes. That would help us with the visibility.",
      "id": "ep_43_ut_478"
    },
    {
      "end": 4164344,
      "speaker": "Enrico Bertini",
      "start": 4163800,
      "text": "Yes.",
      "id": "ep_43_ut_479"
    },
    {
      "end": 4165384,
      "speaker": "Moritz Stefaner",
      "start": 4164432,
      "text": "Spread the word.",
      "id": "ep_43_ut_480"
    },
    {
      "end": 4170720,
      "speaker": "Enrico Bertini",
      "start": 4165512,
      "text": "Absolutely. And what else? I think, well, we had our meetup.",
      "id": "ep_43_ut_481"
    },
    {
      "end": 4172520,
      "speaker": "Moritz Stefaner",
      "start": 4170760,
      "text": "That was really, really good.",
      "id": "ep_43_ut_482"
    },
    {
      "end": 4180700,
      "speaker": "Enrico Bertini",
      "start": 4172560,
      "text": "So if you've been there and you're listening right now, thanks for coming. That was awesome. And we received a lot of really good feedback.",
      "id": "ep_43_ut_483"
    },
    {
      "end": 4182792,
      "speaker": "Moritz Stefaner",
      "start": 4181360,
      "text": "Once again, there should be a meetup.",
      "id": "ep_43_ut_484"
    },
    {
      "end": 4204032,
      "speaker": "Enrico Bertini",
      "start": 4182816,
      "text": "So I think if you have more comments or suggestions for how we can improve, and by now, I think, you know that we have a sponsor, so we can, we can probably maybe spend some little money making this show even better. Tiger quality, more episodes or. I don't know. I think we can do much better.",
      "id": "ep_43_ut_485"
    },
    {
      "end": 4207464,
      "speaker": "Moritz Stefaner",
      "start": 4204136,
      "text": "Was transcripts, transcript, having transcripts, things like this.",
      "id": "ep_43_ut_486"
    },
    {
      "end": 4207784,
      "speaker": "Enrico Bertini",
      "start": 4207512,
      "text": "Yeah.",
      "id": "ep_43_ut_487"
    },
    {
      "end": 4208688,
      "speaker": "Moritz Stefaner",
      "start": 4207832,
      "text": "Well, we can see.",
      "id": "ep_43_ut_488"
    },
    {
      "end": 4212540,
      "speaker": "Enrico Bertini",
      "start": 4208784,
      "text": "We can see. So if you guys have any suggestions, let us know.",
      "id": "ep_43_ut_489"
    },
    {
      "end": 4215376,
      "speaker": "Moritz Stefaner",
      "start": 4213360,
      "text": "Cool. So I think we have to go.",
      "id": "ep_43_ut_490"
    },
    {
      "end": 4226036,
      "speaker": "Enrico Bertini",
      "start": 4215488,
      "text": "Yeah, I think this was in Paris was great. I'm really excited. I'm actually a little sad that it's over, but I'm also relieved because I'm so tired. It's been a real marathon on being.",
      "id": "ep_43_ut_491"
    },
    {
      "end": 4228900,
      "speaker": "Moritz Stefaner",
      "start": 4226108,
      "text": "Here too much and eating, drinking, partying.",
      "id": "ep_43_ut_492"
    },
    {
      "end": 4233300,
      "speaker": "Enrico Bertini",
      "start": 4228940,
      "text": "And then trying to wake up early in the morning especially. I'm exhausted.",
      "id": "ep_43_ut_493"
    },
    {
      "end": 4242716,
      "speaker": "Moritz Stefaner",
      "start": 4233420,
      "text": "I'm so looking forward to my boring, to my great little world. Okey dokey. Cool.",
      "id": "ep_43_ut_494"
    },
    {
      "end": 4243260,
      "speaker": "Enrico Bertini",
      "start": 4242828,
      "text": "Okay.",
      "id": "ep_43_ut_495"
    },
    {
      "end": 4244428,
      "speaker": "Moritz Stefaner",
      "start": 4243300,
      "text": "Yeah, I enjoyed it as well.",
      "id": "ep_43_ut_496"
    },
    {
      "end": 4250716,
      "speaker": "Enrico Bertini",
      "start": 4244484,
      "text": "And the next show, sorry I forgot to tease you. So vivalini managed to have you here.",
      "id": "ep_43_ut_497"
    },
    {
      "end": 4251308,
      "speaker": "Moritz Stefaner",
      "start": 4250788,
      "text": "That's true.",
      "id": "ep_43_ut_498"
    },
    {
      "end": 4260260,
      "speaker": "Enrico Bertini",
      "start": 4251364,
      "text": "I've been teasing you for many, many months or even years, so I hope you enjoyed it and that you will be attending this again in the future.",
      "id": "ep_43_ut_499"
    },
    {
      "end": 4283024,
      "speaker": "Moritz Stefaner",
      "start": 4260380,
      "text": "Yeah, that's true. We could give a little outlook. So the next show we will do with Tamara Munzner, who we also met here, and she finally put out her book and it's been in the making for years and everybody has been waiting for it. And so we hope she'll tell us a bit about that and maybe just general. She's amazing. She has like, she knows a lot about the whole field and it's gonna be a fun conversation.",
      "id": "ep_43_ut_500"
    },
    {
      "end": 4283704,
      "speaker": "Enrico Bertini",
      "start": 4283112,
      "text": "Absolutely.",
      "id": "ep_43_ut_501"
    },
    {
      "end": 4288608,
      "speaker": "Moritz Stefaner",
      "start": 4283752,
      "text": "And after that, we have an episode lined up with Nicholas Shelton. So that's.",
      "id": "ep_43_ut_502"
    },
    {
      "end": 4291208,
      "speaker": "Enrico Bertini",
      "start": 4288744,
      "text": "So we will manage to talk about quantified self.",
      "id": "ep_43_ut_503"
    },
    {
      "end": 4297560,
      "speaker": "Moritz Stefaner",
      "start": 4291264,
      "text": "Yeah. Eventually measuring yourself and making you as a data point. That should be interesting.",
      "id": "ep_43_ut_504"
    },
    {
      "end": 4298616,
      "speaker": "Enrico Bertini",
      "start": 4297640,
      "text": "Very interesting.",
      "id": "ep_43_ut_505"
    },
    {
      "end": 4304224,
      "speaker": "Moritz Stefaner",
      "start": 4298728,
      "text": "So that's something to look forward to also for us. And thanks for listening in and see you soon.",
      "id": "ep_43_ut_506"
    },
    {
      "end": 4337740,
      "speaker": "Enrico Bertini",
      "start": 4304312,
      "text": "Bye. Datastory is supported by Tableau software, helping people see and understand their data. Get answers from interactive dashboards. Wherever you go for your free trial, visit Tableau software at T A B L E A U. Once again, Tableau software.com Datastories don't forget to put data stories because it's very important that they know that you are coming from us. Thanks a lot for supporting us with this. Bye. Me.",
      "id": "ep_43_ut_507"
    }
  ],
  "confidence": 0.90681435011517,
  "audio_duration": 4343,
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_status_code": null,
  "webhook_auth": false,
  "webhook_auth_header_name": null,
  "speed_boost": false,
  "auto_highlights_result": null,
  "auto_highlights": false,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_audio_quality": null,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "content_safety": false,
  "iab_categories": true,
  "content_safety_labels": {
    "status": "unavailable",
    "results": [],
    "summary": {}
  },
  "language_detection": false,
  "language_detection_threshold": null,
  "language_confidence": null,
  "custom_spelling": null,
  "throttled": false,
  "auto_chapters": true,
  "summarization": false,
  "summary_type": null,
  "summary_model": null,
  "custom_topics": false,
  "topics": [],
  "speech_threshold": null,
  "speech_model": "best",
  "chapters": [
    {
      "summary": "Enrico Data Stories is reporting from Biz 2014, from Paris. We will be reporting every day from the start of the conference until the end. We'll try and record a snippet every day. And sort of Frankenstein an episode out of that later.",
      "gist": "Biz 2014",
      "headline": "Enrico Data Stories is reporting from Biz 2014 in Paris",
      "start": 12400,
      "end": 96720,
      "id": "ep_43_ch_0"
    },
    {
      "summary": "This is basically the academic conference on information visualization, or visualization in general. There are three main tracks: scientific visualization, visual analytics, and the infovis. Moritz gave a tutorial on everything except the chart. It was quite, quite well received in the end.",
      "gist": "The Conference on Information visualization",
      "headline": "Information visualization conference is basically the academic conference on information visualization",
      "start": 97020,
      "end": 226840,
      "id": "ep_43_ch_1"
    },
    {
      "summary": "In visualization we are very much concerned with clarity. You can be as clear as you want, but still communicate distorted information. Truthfulness doesn't depend exclusively on the visualization side of things. How do you teach people how to do this?",
      "gist": "The Truth of Data Visualization",
      "headline": "There was a keynote by Alberto Cairo on truthfulness in data visualization",
      "start": 227260,
      "end": 522498,
      "id": "ep_43_ch_2"
    },
    {
      "summary": "If we want to make people data literate, we cannot just show them stuff all the time. We need to do workshops and hackathons, activities where they actually create their own data. Can we meet in the middle?",
      "gist": "Culture of Data Literacy",
      "headline": "I come more and more to the conviction that if we want to make data literate",
      "start": 522554,
      "end": 616052,
      "id": "ep_43_ch_3"
    },
    {
      "summary": "So what else should we say? Tell about this? I think, of course, today we had a very large set of papers. I was in two sessions. So I felt, I feel very smart right now. So things are good.",
      "gist": "A few words on the conference",
      "headline": "Today we had a very large set of papers. I don't know if you attended any session",
      "start": 616116,
      "end": 634770,
      "id": "ep_43_ch_4"
    },
    {
      "summary": "A student from Jarke van Wijk's group presented a network visualization. It's multivariate network exploration and presentation from detail to overview via selections and aggregations. Interesting tool.",
      "gist": "Best Paper Award 2017",
      "headline": "A student from Jarke van Wijk's group presented a network visualization",
      "start": 634900,
      "end": 738060,
      "id": "ep_43_ch_5"
    },
    {
      "summary": "I was quite impressed with the domino tool. It was a very impressive tool for collecting or aligning multiple views of the same data set quickly. Tomorrow we will actually meet real data stories, listeners in a room.",
      "gist": "Interviewing Data Scientists",
      "headline": "I was quite impressed with the domino tool. Was it domino",
      "start": 738560,
      "end": 860040,
      "id": "ep_43_ch_6"
    },
    {
      "summary": "Long time guest Robert Cazara. Nobody's surprised when Robert is here. It's basically a furniture here. That's a compliment. What can you do?",
      "gist": "Robert Cazara",
      "headline": "Enrico welcomes long time guest Robert Cazara",
      "start": 867140,
      "end": 891910,
      "id": "ep_43_ch_7"
    },
    {
      "summary": "So we are here still at Visweek. We had a great meetup yesterday with a few of our listeners. And we got a lot of good tips. Lots of good feedback, advice. So very nice.",
      "gist": "WizWeek",
      "headline": "We had a great meetup yesterday with a few of our listeners",
      "start": 892530,
      "end": 917410,
      "id": "ep_43_ch_8"
    },
    {
      "summary": "Enrico: How do you like the conference? Robert: I like it. It feels like it's a stronger infovis this year than the last two or so. And also, it seems like the presentations are getting better.",
      "gist": "Winter Science Conference 2017: the conference itself",
      "headline": "Robert: It seems like the presentations are getting better this year",
      "start": 917990,
      "end": 1026874,
      "id": "ep_43_ch_9"
    },
    {
      "summary": "Today's Thursday. What happened on Wednesday and what happened on Thursday. Should we start from Wednesday? Sure. Okay, we go in chronological order.",
      "gist": "How to talk through the program",
      "headline": "When should we go through the program today? Should we start from Wednesday",
      "start": 1026962,
      "end": 1056090,
      "id": "ep_43_ch_10"
    },
    {
      "summary": "An interesting paper had had them build essentially an interactive version of the reorderable matrix. Do you think, was it primarily an homage or do you think some work will continue along these lines?",
      "gist": "The Bertin Matresses: Interactivity and Authorship",
      "headline": "An interesting paper had had them build an interactive version of the reorderable matrix",
      "start": 1057110,
      "end": 1147034,
      "id": "ep_43_ch_11"
    },
    {
      "summary": "Bertin was a famous french cartographer that published this super famous book in our community called La Semiologie Graphique Graphic. He basically established all the fundamentals of visualization. Every visual representation can be decomposed into visual primitives.",
      "gist": "Bertin's reorderable grids",
      "headline": "Bertin basically established all the fundamentals of visualization",
      "start": 1147162,
      "end": 1263664,
      "id": "ep_43_ch_12"
    },
    {
      "summary": "A paper I heard was well received on visualizing statistical mix effects in Simpsons paradox. Unfortunately, I missed the presentation. This year, maybe for the first time, there are much more applications and systems and less techniques.",
      "gist": "Other good papers from the conference",
      "headline": "Winston presented a tool that lets you create multiple views on a single canvas",
      "start": 1263752,
      "end": 1441150,
      "id": "ep_43_ch_13"
    },
    {
      "summary": " interactive latency on exploratory visual analysis sounds really, really interesting. It certainly led to people exploring less because it was just more annoying. But when they asked people afterwards, a third didn't actually notice a delay. It could be useful sometimes to be slower and to be more deliberate.",
      "gist": "Interactive latency and exploratory visual analysis",
      "headline": "Interactive latency may hinder exploratory visual analysis, study finds",
      "start": 1441810,
      "end": 1548390,
      "id": "ep_43_ch_14"
    },
    {
      "summary": "A user study comparing standard error bars with other kind of encodings. Found traditional way scientists used to show error bars doesn't work very well. Will see a lot of wiring plots. People post a lot more information about how to reach their work.",
      "gist": "The future of data science",
      "headline": "User study compared standard error bars with other encodings",
      "start": 1549730,
      "end": 1650230,
      "id": "ep_43_ch_15"
    },
    {
      "summary": "Next one in the same session. for experiments on the perception of bar charts. They basically repeated some of the classic Cleveland studies. The goal of this work is more to understand why they get that. What are the issues there?",
      "gist": "Bar charts and perception of them",
      "headline": "Next one in the same session is on perception of bar charts",
      "start": 1651810,
      "end": 1846770,
      "id": "ep_43_ch_16"
    },
    {
      "summary": "A paper on the algebraic process for visualization design. The idea is to look at visualizations from a perspective of when the data changes, how is that reflected in the visualization. I'm actually planning to use it for, in my class to teach my students.",
      "gist": "The Algebraic Process for Visualization Design",
      "headline": "Algebraic process for visualization design is brilliant. What's your take on that",
      "start": 1848310,
      "end": 2043480,
      "id": "ep_43_ch_17"
    },
    {
      "summary": "There was a panel on challenges in financial visualization. Do you remember any payroll? Financial visualization, Robert? It's rare, right? There have been a few, but I think it's probably been ten years since the last one.",
      "gist": "",
      "headline": "There was a panel on challenges in financial visualization on Wednesday",
      "start": 2043900,
      "end": 2119090,
      "id": "ep_43_ch_18"
    },
    {
      "summary": "Data stories is supported by Tableau software, helping people see and understand their data. Tableau lets people connect to any kind of data and visualize it on the fly. They also supported the conference, so they were sponsored.",
      "gist": "Tableau Software",
      "headline": "Data stories is supported by Tableau software helping people see and understand data",
      "start": 2119630,
      "end": 2215876,
      "id": "ep_43_ch_19"
    },
    {
      "summary": "There was a paper on staggered animation that I thought was pretty good. I was really surprised by the methodology that they adopted. Methodology is amazing. I would love to see it replicated in future years.",
      "gist": "Monte Carlo simulation in data visualization",
      "headline": "There was a paper on staggered animation that I thought was pretty good",
      "start": 2215948,
      "end": 2416740,
      "id": "ep_43_ch_20"
    },
    {
      "summary": "A tool called combing the communication hairball. Visualizing large parallel execution traces using logical time. It's a nice high end tool for monitoring parallel computation processes. Do you have an idea if the tool is. available on the web?",
      "gist": "Visualizing large parallel execution traces using logical time",
      "headline": "Visualizing large parallel execution traces using logical time. It's really good",
      "start": 2418890,
      "end": 2495488,
      "id": "ep_43_ch_21"
    },
    {
      "summary": "Robert: What they were trying to do is figure out what's the right palette of shapes and colors and sizes for encoding data. He says the larger the size gets, the less difference we see between the size. Robert: They also created a library that you can download and use directly.",
      "gist": "Perceptual kernels",
      "headline": "What's the right palette of shapes and colors for encoding data",
      "start": 2495584,
      "end": 2656108,
      "id": "ep_43_ch_22"
    },
    {
      "summary": "Study compares many different chart types you could use for judging correlation. It follows a very primitive, let's. Say perception law, which is the Weber's law. For the positive correlation, they're terrible. And slope graphs are terrible.",
      "gist": "How to Judge Correlation using Weber's Law",
      "headline": "One study looked at how well people can judge correlation between variables",
      "start": 2656164,
      "end": 2921688,
      "id": "ep_43_ch_23"
    },
    {
      "summary": "Robert: I think the whole area of understanding and measuring visual literacy is super important. Especially now that visualization is exposed to a very large segment of the population. The paper aims to create a test to measure how literate a person is in terms of being able to read visualizations.",
      "gist": "The Visual Literacy Test",
      "headline": "Robert Post: I think measuring visual literacy is super important",
      "start": 2921784,
      "end": 3246056,
      "id": "ep_43_ch_24"
    },
    {
      "summary": "What I'm wondering is, honestly, is visual literacy a one dimensional thing? Like, can you express your literacy in one number? And this is tied together with talking about data literacy and also teaching people. I think it's our big challenge.",
      "gist": "Is Visual Literacy a One-dimensional Thing?",
      "headline": "Can you express your literacy in one number? I'm not convinced",
      "start": 3246248,
      "end": 3408546,
      "id": "ep_43_ch_25"
    },
    {
      "summary": "Robert: Lots of tools, good evaluation, no position papers, great slides. I think the divide between practitioners and academics is getting narrower and narrower. Our workshop on web visualization was packed. I am super psyched about what will come the next year when they're all native stuff.",
      "gist": "A week in the web: Chicago",
      "headline": "Robert: I think the divide between practitioners and academics is getting narrower",
      "start": 3408658,
      "end": 3668200,
      "id": "ep_43_ch_26"
    },
    {
      "summary": "Still in Paris. Conference has just ended. Friday looks pretty sad outside. Everything's being disassembled. We found a quiet room here, halfway quiet. They might kick us out at some. Point, so I think we should just wrap it up.",
      "gist": "Paris",
      "headline": "Still in Paris. Conference has just ended. Friday looks pretty sad outside",
      "start": 3675420,
      "end": 3694416,
      "id": "ep_43_ch_27"
    },
    {
      "summary": "This conference start way too early. The main highlight today was the capstone from Barbara Tversky. She said that interaction disrupts storytelling. Morris missed the paper sessions as well. But the conference was really good. Lots of good people.",
      "gist": "The Conference's Capstone",
      "headline": "Barbara Tversky talked about how interaction disrupts storytelling",
      "start": 3694528,
      "end": 4001764,
      "id": "ep_43_ch_28"
    },
    {
      "summary": "Some of these papers have a very clear practical impact. Some of them are useful for teaching visualization as well. The algebraic process one, I think it's going to be a very interesting model to teach in class.",
      "gist": "Mental models in the visualization world",
      "headline": "Some of these papers are useful for teaching visualization as well",
      "start": 4001932,
      "end": 4031436,
      "id": "ep_43_ch_29"
    },
    {
      "summary": "What did we see in Rico? Like, is there anything. There are many things we didn't see. Probably a lot of good sessions. And then there was an amazing Bertin exhibit which I just visited very briefly.",
      "gist": "What did we see in Puerto Rico?",
      "headline": "There are many things we didn't see in Rico",
      "start": 4031508,
      "end": 4053216,
      "id": "ep_43_ch_30"
    },
    {
      "summary": "I think the biggest trend, as I said, is even higher quality. I have seen for the first time lots of really good sessions on user studies. If you have suggestions for good topics, rate us on iTunes.",
      "gist": "Wonders of the World: Conference 2017",
      "headline": "Are there things that were more present at last year's conferences that have disappeared",
      "start": 4053328,
      "end": 4166620,
      "id": "ep_43_ch_31"
    },
    {
      "summary": "Once again, there should be a meetup. I think if you have more comments or suggestions for how we can improve. Tiger quality, more episodes or. Was transcripts, transcript, having transcripts, things like this. If you guys have any suggestions, let us know.",
      "gist": "Thanks for your feedback on the show",
      "headline": "I think we can do much better. So if you guys have any suggestions, let us know",
      "start": 4167720,
      "end": 4213808,
      "id": "ep_43_ch_32"
    },
    {
      "summary": "Next show we will do with Tamara Munzner, who finally put out her book. After that, we have an episode lined up with Nicholas Shelton. We will manage to talk about quantified self. Eventually measuring yourself and making you as a data point.",
      "gist": "A DAY IN THE LIFE",
      "headline": "Vivalini: I'm glad this trip is over. I'm exhausted. It's been a real marathon on being",
      "start": 4213864,
      "end": 4304980,
      "id": "ep_43_ch_33"
    },
    {
      "summary": "Datastory is supported by Tableau software, helping people see and understand their data. Get answers from interactive dashboards. Wherever you go for a free trial, visit tableauSoftware. com. Don't forget to put data stories.",
      "gist": "Datastory powered by Tableau software",
      "headline": "Datastory is supported by Tableau software, helping people see and understand their data",
      "start": 4308720,
      "end": 4337740,
      "id": "ep_43_ch_34"
    }
  ],
  "disfluencies": false,
  "entity_detection": false,
  "sentiment_analysis": false,
  "sentiment_analysis_results": null,
  "entities": null,
  "speakers_expected": null,
  "summary": null,
  "custom_topics_results": null,
  "is_deleted": null,
  "episode_num": "43",
  "episode_metadata": {
    "speakers": [
      "Moritz Stefaner",
      "Enrico Bertini",
      "Robert Kosara"
    ],
    "WPid": "215",
    "url": "https://datastori.es/podlove/file/510/s/feed/c/mp3/43.mp3",
    "episode_title": "IEEE VIS'14"
  }
}