{
  "id": "cf334e21-f05e-4dde-a303-8f931d2de2f3",
  "language_model": "assemblyai_default",
  "acoustic_model": "assemblyai_default",
  "language_code": "en_us",
  "status": "completed",
  "audio_url": "https://datastori.es/podlove/file/178/s/feed/c/mp3/Datastories-12.mp3",
  "utterances": [
    {
      "end": 20870,
      "speaker": "Enrico Bertini",
      "start": 15800,
      "text": "Hi, everyone. Data stories number twelve. I Moritz, how are you?",
      "id": "ep_12_ut_0"
    },
    {
      "end": 24354,
      "speaker": "Moritz Stefaner",
      "start": 21022,
      "text": "I'm doing great. It might be 13 even, I'm not sure.",
      "id": "ep_12_ut_1"
    },
    {
      "end": 25606,
      "speaker": "Enrico Bertini",
      "start": 24814,
      "text": "13?",
      "id": "ep_12_ut_2"
    },
    {
      "end": 32404,
      "speaker": "Moritz Stefaner",
      "start": 25790,
      "text": "Yeah, really? But the heading says number twelve, but who knows? It's a lot of data stories.",
      "id": "ep_12_ut_3"
    },
    {
      "end": 35344,
      "speaker": "Enrico Bertini",
      "start": 33664,
      "text": "We will leave that to the listeners.",
      "id": "ep_12_ut_4"
    },
    {
      "end": 37312,
      "speaker": "Moritz Stefaner",
      "start": 35384,
      "text": "No data stories. Number many.",
      "id": "ep_12_ut_5"
    },
    {
      "end": 39208,
      "speaker": "Enrico Bertini",
      "start": 37488,
      "text": "I think it's correct. It's twelve.",
      "id": "ep_12_ut_6"
    },
    {
      "end": 40764,
      "speaker": "Moritz Stefaner",
      "start": 39336,
      "text": "Should be twelve. Okay.",
      "id": "ep_12_ut_7"
    },
    {
      "end": 44964,
      "speaker": "Enrico Bertini",
      "start": 41144,
      "text": "What is your German soul? You lost?",
      "id": "ep_12_ut_8"
    },
    {
      "end": 47004,
      "speaker": "Moritz Stefaner",
      "start": 45344,
      "text": "Twelve is my unlucky number.",
      "id": "ep_12_ut_9"
    },
    {
      "end": 50684,
      "speaker": "Enrico Bertini",
      "start": 49104,
      "text": "You should have skipped it.",
      "id": "ep_12_ut_10"
    },
    {
      "end": 55840,
      "speaker": "Moritz Stefaner",
      "start": 52864,
      "text": "Anyways, how are you doing? You're still in Germany. I can hear that.",
      "id": "ep_12_ut_11"
    },
    {
      "end": 79444,
      "speaker": "Enrico Bertini",
      "start": 55912,
      "text": "I'm still in Germany. Yeah. Yeah. I love it so much that I cannot just stay for weeks. Yeah, I spent some time at the consulate yesterday for the visa and I hope it's going to be fine soon. It's such a messy process. Yeah. I will tell you, it's better if I don't comment on the schlatter. It's like a weekly soap on my experience.",
      "id": "ep_12_ut_12"
    },
    {
      "end": 83724,
      "speaker": "Moritz Stefaner",
      "start": 79784,
      "text": "Enrico would like to go to America, but it doesn't work.",
      "id": "ep_12_ut_13"
    },
    {
      "end": 87604,
      "speaker": "Enrico Bertini",
      "start": 84704,
      "text": "Yeah. And you, what are you doing?",
      "id": "ep_12_ut_14"
    },
    {
      "end": 129354,
      "speaker": "Moritz Stefaner",
      "start": 88064,
      "text": "Good. We just finished the documentation for Emoto. I had a nice video for the installation, for the hardware piece, so we pushed it out too. So thanks again to studio NAND there for the great work. And now I'm wrapping up my other project, which is a spin globe. Yeah, I thought there was so much. It's amazing. Yeah, it's a big spinny globe. 3d type of thing for FIFA, for the world, like the soccer association, showing all their development activities. Yeah, proper spinny Globe. So we hope we will launch that soon and then I'll post a bit of documentation as well, of course.",
      "id": "ep_12_ut_15"
    },
    {
      "end": 135594,
      "speaker": "Enrico Bertini",
      "start": 129934,
      "text": "Okay, so now you are all in this sport visualization craze, right?",
      "id": "ep_12_ut_16"
    },
    {
      "end": 144264,
      "speaker": "Moritz Stefaner",
      "start": 135934,
      "text": "Totally. I don't know what happened. That was pure coincidence, actually. But yeah, I'm all supportive.",
      "id": "ep_12_ut_17"
    },
    {
      "end": 169870,
      "speaker": "Enrico Bertini",
      "start": 144804,
      "text": "Yeah. And yeah, before we start, we have another big guest today, but before we start, I want to briefly thank Andy and Karen for sending very nice emails to them. And. Yeah, and if you feel like sending an email to us with comments or just to say hi, please do it. We really love to have any kind of feedback from you guys.",
      "id": "ep_12_ut_18"
    },
    {
      "end": 183458,
      "speaker": "Moritz Stefaner",
      "start": 170012,
      "text": "Yeah, it's always great to get emails. I love that. And also just to hear how people listen to us and what they like most and so on. So keep that coming. We also had that idea of doing an episode together with our listeners, right?",
      "id": "ep_12_ut_19"
    },
    {
      "end": 185282,
      "speaker": "Enrico Bertini",
      "start": 183626,
      "text": "Yeah, sure. We still have this.",
      "id": "ep_12_ut_20"
    },
    {
      "end": 193814,
      "speaker": "Moritz Stefaner",
      "start": 185378,
      "text": "We still have to test that. If that works with like, Google hangouts. But if that works, that would be awesome. Then we will invite all of you for a big party.",
      "id": "ep_12_ut_21"
    },
    {
      "end": 214760,
      "speaker": "Enrico Bertini",
      "start": 195154,
      "text": "If any of you listening to the podcast has any information on how to do it properly, please, please let us know, because it looks like it's a bit of a mess, but we will try one day. Okay, I think it's time to introduce our special guest for today.",
      "id": "ep_12_ut_22"
    },
    {
      "end": 215528,
      "speaker": "Moritz Stefaner",
      "start": 214912,
      "text": "Absolutely.",
      "id": "ep_12_ut_23"
    },
    {
      "end": 218804,
      "speaker": "Enrico Bertini",
      "start": 215576,
      "text": "Moritz, you want to introduce him? I feel too nervous.",
      "id": "ep_12_ut_24"
    },
    {
      "end": 225724,
      "speaker": "Moritz Stefaner",
      "start": 221784,
      "text": "So our guest today is Alberto Cairo. Hi, Alberto.",
      "id": "ep_12_ut_25"
    },
    {
      "end": 228056,
      "speaker": "Alberto Cairo",
      "start": 226104,
      "text": "Hey, Moritz. Hey, Rico.",
      "id": "ep_12_ut_26"
    },
    {
      "end": 229084,
      "speaker": "Moritz Stefaner",
      "start": 228160,
      "text": "How you doing?",
      "id": "ep_12_ut_27"
    },
    {
      "end": 232522,
      "speaker": "Alberto Cairo",
      "start": 229514,
      "text": "Doing all right. Just enjoying the weather here in Miami.",
      "id": "ep_12_ut_28"
    },
    {
      "end": 232834,
      "speaker": "Moritz Stefaner",
      "start": 232578,
      "text": "Cool.",
      "id": "ep_12_ut_29"
    },
    {
      "end": 233890,
      "speaker": "Alberto Cairo",
      "start": 232874,
      "text": "It's really warm.",
      "id": "ep_12_ut_30"
    },
    {
      "end": 236506,
      "speaker": "Moritz Stefaner",
      "start": 234002,
      "text": "Miami never rains in Miami.",
      "id": "ep_12_ut_31"
    },
    {
      "end": 239554,
      "speaker": "Alberto Cairo",
      "start": 236650,
      "text": "Well, it always rains in Miami, but it's always really warm.",
      "id": "ep_12_ut_32"
    },
    {
      "end": 243594,
      "speaker": "Moritz Stefaner",
      "start": 239594,
      "text": "But it's warm. Yeah. Is it like very, like, moist and warm, like this type of cloud? Yeah.",
      "id": "ep_12_ut_33"
    },
    {
      "end": 246254,
      "speaker": "Alberto Cairo",
      "start": 243634,
      "text": "Yes, yes. You're always sweating and stuff.",
      "id": "ep_12_ut_34"
    },
    {
      "end": 247682,
      "speaker": "Moritz Stefaner",
      "start": 246994,
      "text": "Fantastic.",
      "id": "ep_12_ut_35"
    },
    {
      "end": 251546,
      "speaker": "Alberto Cairo",
      "start": 247738,
      "text": "Very nice to be here. Thank you for having me and for inviting me.",
      "id": "ep_12_ut_36"
    },
    {
      "end": 290812,
      "speaker": "Moritz Stefaner",
      "start": 251610,
      "text": "Yeah, I mean, we've had you on our list for a while. I mean, so we're happy that, that now we can have this conversation. So, yeah, we met at Malofiej. Right. But we had first time, like, in person, but we had some contact before. And for me, this also Malofiej, also for Andy, who we had on the show, was really eye opening with respect to the information graphics world. That was really fascinating to see. And we also got in touch about your book that you have been writing, or you wrote that book in Spanish, I think, a few years ago already.",
      "id": "ep_12_ut_37"
    },
    {
      "end": 318412,
      "speaker": "Alberto Cairo",
      "start": 290868,
      "text": "I wrote it originally. I wrote it originally in Spanish, but then I was. And it got published in Spanish in 2011. But then I was contacted by Pearson Education, the publishing house. They were interested in the book, so I translated the book, and then I expanded it because the American version, the english version of the book, has 100 or 120 extra pages. So it's actually much longer than the original. Than the original book.",
      "id": "ep_12_ut_38"
    },
    {
      "end": 319684,
      "speaker": "Moritz Stefaner",
      "start": 318468,
      "text": "So it's really like a new book.",
      "id": "ep_12_ut_39"
    },
    {
      "end": 323472,
      "speaker": "Alberto Cairo",
      "start": 319724,
      "text": "Actually, yeah, it's actually a new book. That's correct.",
      "id": "ep_12_ut_40"
    },
    {
      "end": 330344,
      "speaker": "Moritz Stefaner",
      "start": 323568,
      "text": "So can you tell us a bit about your background? Like, who are you and where you're coming from? What are you doing today?",
      "id": "ep_12_ut_41"
    },
    {
      "end": 395168,
      "speaker": "Alberto Cairo",
      "start": 330384,
      "text": "Sure. Well, yeah, I am an instructor at the University of Miami at the School of Communication at the University of Miami. I am originally from Spain, and my background is in journalism. So I studied journalism in Spain many years ago, and then I got an internship in a newspaper, but not to write, although I wrote for a while. The internship that I got was not to write stories, but to create information graphics. So to design charts, maps, diagrams, illustrations, etcetera. So I started doing that at a local newspaper in Spain, and then I moved to other newspapers. I got a bit of experience in newsrooms. And then I moved into teaching, first at the University of North Carolina at Chapel Hill, at the School of Journalism, and then here at the University of Miami. So all my career has been related to information graphics, to the encoding of information by means of graphics, maps, etcetera.",
      "id": "ep_12_ut_42"
    },
    {
      "end": 403968,
      "speaker": "Moritz Stefaner",
      "start": 395336,
      "text": "But you come from really the practical side of working every day in a newsroom and producing news graphics, is that right?",
      "id": "ep_12_ut_43"
    },
    {
      "end": 453384,
      "speaker": "Alberto Cairo",
      "start": 404016,
      "text": "Yes, that is my background. I was the online infographics director at El Mundo, which is a big newspaper in Spain, for five years. Then I also was the infographics director, infographics and multimedia director at a magazine in Brazil called Epoca. I spent two years in Brazil before coming back to the US, to the University of Miami. So, yeah, I mean, I have always been in the practical side of the business, even now that I teach at the university. Also, the way I teach is a very. I mean, I have a very practical orientation. So besides teaching the students about the theory of information graphics, about statistics, charts, maps, diagrams, etcetera, I also teach them how to do graphics using different tools.",
      "id": "ep_12_ut_44"
    },
    {
      "end": 461624,
      "speaker": "Moritz Stefaner",
      "start": 454644,
      "text": "Nice. And so is that the University of Miami, is it like a normal university or is that like a design school?",
      "id": "ep_12_ut_45"
    },
    {
      "end": 505454,
      "speaker": "Alberto Cairo",
      "start": 461974,
      "text": "No, no, it's a communication school. So we have a program, a journalism program, and my classes are related somehow to the journalism program because they have a very strong journalistic component, although I teach visual communication. But also we have a program, a very, very new program that we are launching very soon in collaboration with the School of Computer Science, which is going to be about interaction design and information visualization. So I'm going to be related to that as well. My class is also about data visualization, so my classes are also related to that new program. So we have several programs, but I am in a communications school.",
      "id": "ep_12_ut_46"
    },
    {
      "end": 512654,
      "speaker": "Moritz Stefaner",
      "start": 506194,
      "text": "I'm not even sure if we have this type of thing in Germany. Enrico, are you familiar with that?",
      "id": "ep_12_ut_47"
    },
    {
      "end": 519367,
      "speaker": "Enrico Bertini",
      "start": 512994,
      "text": "I think there is something similar in. In Italy, I'm quite sure, but I've never heard of it.",
      "id": "ep_12_ut_48"
    },
    {
      "end": 521035,
      "speaker": "Alberto Cairo",
      "start": 519367,
      "text": "You mean at a communication school?",
      "id": "ep_12_ut_49"
    },
    {
      "end": 522387,
      "speaker": "Enrico Bertini",
      "start": 521139,
      "text": "Yeah, a communication school.",
      "id": "ep_12_ut_50"
    },
    {
      "end": 582434,
      "speaker": "Alberto Cairo",
      "start": 522435,
      "text": "Yeah, yeah. Well, the reason why we have these programs here is that. And this is also. This is also related to the reason I wrote my book, the functional art, is because among journalists, there is not a very, you know, deep and broad and long culture of producing information graphics to communicate with real, with readers and to convey information. Information graphics in many newsrooms are still considered mere illustrations or a way to fill out a space or something. So they don't have many museums, don't have the engineering view of information graphics, that they should be structured in a way that facilitates the understanding of information. So it's a newer trend that communication and journalism schools are incorporating. Courses are creating courses on information design and courses about data journalism, etcetera. So it's a new trend, but it is growing, at least in the US.",
      "id": "ep_12_ut_51"
    },
    {
      "end": 590070,
      "speaker": "Enrico Bertini",
      "start": 583174,
      "text": "Are you aware of any other similar type of course in the US or anywhere else in the world?",
      "id": "ep_12_ut_52"
    },
    {
      "end": 674142,
      "speaker": "Alberto Cairo",
      "start": 590262,
      "text": "Sure. Sure. There are several places in the US where you can learn this. I mean, the University of North Carolina, for example, is teaching courses on infographics, visualization, data journalism, etcetera. Northwestern University, I believe that they are also into these. Stanford University doesn't teach journalism per se, but they have courses on data visualization, obviously. Columbia, Columbia University has a joint program between the communication school and the computer sciences school, which is something that we are trying to do down here right now with this new interaction design program. And then in Spain, there are several places where you can learn data journalism and visualization now, or visualization for journalism, which is what I teach. For instance, El Mundo, the newspaper I used to work for, is launching a master's degree that is called investigative journalism, data journalism and data visualization. So it's a master's degree related to that, and it's going to be launched really, really soon. And there is also a program in Barcelona, and I don't remember the name. There is also a university in Barcelona called Universitato Berta de Catalunya, where I teach. It's a public, public, online university, so it's fully accredited and everything. And I teach there, a course on information visualization. So there are several places where you can learn, for sure.",
      "id": "ep_12_ut_53"
    },
    {
      "end": 674558,
      "speaker": "Moritz Stefaner",
      "start": 674198,
      "text": "Nice.",
      "id": "ep_12_ut_54"
    },
    {
      "end": 680142,
      "speaker": "Alberto Cairo",
      "start": 674646,
      "text": "And there are many programs that were, I mean, probably in other places that I am. I am not aware of.",
      "id": "ep_12_ut_55"
    },
    {
      "end": 685634,
      "speaker": "Enrico Bertini",
      "start": 680238,
      "text": "So students attending your courses are students trained in journalism, right?",
      "id": "ep_12_ut_56"
    },
    {
      "end": 782166,
      "speaker": "Alberto Cairo",
      "start": 686014,
      "text": "Yes. Mainly what we have is people, students that have gone through classes about reporting and about editing and about, you know, telling stories. And first they take, before they got into my class about information graphics and visualization, they take a course that is called intro to graphic design or intro to multimedia. But when they get to that course, it's actually intro to multimedia design. So it involves traditional graphic design plus a little bit of interaction design theory. So they got to that course with that editing course already taken. So they think as journalists, as storytellers, then they learn graphic design, and then they get into my information graphics and visualization course, already knowing how to report a story, how to gather information, how to go online and go to open data set or something, a government database or something, download the data. And then what they learn in my course, in my courses is how to get those data, how to manipulate those data somehow and try to extract stories from those data. I mean, what those data means, and that is the goal of my courses. And it's also what I talk about in my book in the functional art, which is basically about storytelling by using data. It's not about data visualization per se, although it has a component related to that. It's about how to tell stories based on data. So it's a very journalistic book, but at the same time, it is also, it's a book about visualization as well.",
      "id": "ep_12_ut_57"
    },
    {
      "end": 798326,
      "speaker": "Enrico Bertini",
      "start": 782350,
      "text": "So since you mentioned your book, can you briefly describe what's your book about, how it is organized and maybe even the story of your its making? I don't know. How did you come about creating this book, writing this book?",
      "id": "ep_12_ut_58"
    },
    {
      "end": 1066494,
      "speaker": "Alberto Cairo",
      "start": 798510,
      "text": "Sure. Well, I guess that I could get started with the story of the book because that explains the structure of the book itself. When I got into academia back in 2005, when I started teaching courses about visualization at UNC Chapel Hill, I got into the classroom and I didn't really know what to recommend my students to read. So I had to put together a reading list based on chapters by different people. So I got a little bit of Tufte, a little bit of Stephen Pew, a little bit of calling ware, a little bit. But everything was, you know, it was not. Those readings didn't tell a cohesive stories, and it was really hard for students to relate one reading to the other reading into a single, cohesive narrative. And the other side, the other thing is that those books that I recommended are wonderful because, you know, Tufte few, those, I mean, those are the foundations of what we do. But at the same time, those books are not written specifically for journalists and designers. They are reading for statisticians. They are reading for people in business intelligence. They are written for researchers in computer science departments. So they are very technical in a sense, and they are not tailored specifically for journalists and designers. They don't talk a lot about storytelling, for instance, how to organize a story based on data. So there was a niche there, like a hole there that I wanted to fill somehow. So I started writing and thinking about a textbook back in 2005, and I started writing several chapters, organizing my things. I started using those chapters in my courses, and at the end, I ended up having the functional art, which is, it tells, you know, it actually conveys how I see what information, graphics and visualization are about. So the book is structured into several parts. The first part is a broad introduction to both fields, to infographics and visualization, because I don't really see a clear difference between the two of them, although there is a difference, but it is not very clear. The boundaries between infographics and visualization are really fuzzy, in my opinion. So I provide like a, like a broad theory and cohesive theory of how you should approach information graphics. And the first part is actually related to the actual, to the title of the book, the functional art. Because what I explained there is that infographics and visualizations are not just art pieces or graphic design pieces. You should think about graphics as if they were tools, like a hammer. So you have some raw materials. In our case, it's data, and you have to shape those materials in a way that can be used by a reader to understand the story or to understand a piece of information. So that's what infographics are about. So that is the reason why the book is titled the functional art. That doesn't mean that I don't think that beauty and aesthetics and, you know, are not important. They are extremely important to what we do, because you want to grab readers attention to your story, but they are secondary compared to structure, compared to functionality, etcetera. Second part is a little bit about cognitive science, although it's a very broad overview of perception and cognition, et cetera, and how it relates to graphic design principles. Because one of the things that I have seen in design schools and in journalism schools is that they explain the principles of graphic design, but they don't explain that the principles of graphic design, for instance, hierarchy, unity, variety, all those principles that are taught in graphic design schools and journalism schools are actually related to how the eye and the brain work, in one sense. So I explain a little bit about that, although I am not a cognitive scientist myself. Then there is a part about practice. So it's a very long section on several projects, how several projects came about from the very beginning until the end. So I show a lot of sketches and a lot of. I just showed you the entire creation process. And the last part is a series of interviews with people that I consider at the very top of our profession, such as John Greenwaite and, you know, Steve Duens and Shaquin from the New York Times, Hannah Fairfield from the Washington Post. So there are several people there who do infographics and visualization there, and Moritz is there as well.",
      "id": "ep_12_ut_59"
    },
    {
      "end": 1070014,
      "speaker": "Moritz Stefaner",
      "start": 1066834,
      "text": "So somehow sneaked in. I don't know.",
      "id": "ep_12_ut_60"
    },
    {
      "end": 1073214,
      "speaker": "Alberto Cairo",
      "start": 1070674,
      "text": "He just showed up in the middle of that section.",
      "id": "ep_12_ut_61"
    },
    {
      "end": 1076650,
      "speaker": "Enrico Bertini",
      "start": 1074154,
      "text": "You made a mistake somewhere, Alberto.",
      "id": "ep_12_ut_62"
    },
    {
      "end": 1084122,
      "speaker": "Alberto Cairo",
      "start": 1076722,
      "text": "Yeah, well, it's actually a great interview. I think it's very, you know, it's very clarifying. The interview that I made with it, we talked about.",
      "id": "ep_12_ut_63"
    },
    {
      "end": 1088850,
      "speaker": "Enrico Bertini",
      "start": 1084218,
      "text": "That's additional ego boosting for Moritz all the time. That's dangerous.",
      "id": "ep_12_ut_64"
    },
    {
      "end": 1094642,
      "speaker": "Moritz Stefaner",
      "start": 1088962,
      "text": "People need to stop that. Otherwise it gets out of control and.",
      "id": "ep_12_ut_65"
    },
    {
      "end": 1101474,
      "speaker": "Enrico Bertini",
      "start": 1094658,
      "text": "I start getting envious, you know. Yeah, please go ahead. Yeah, no, no, I just.",
      "id": "ep_12_ut_66"
    },
    {
      "end": 1192814,
      "speaker": "Alberto Cairo",
      "start": 1101514,
      "text": "I just finished. So that is the story of the. It's actually a very, I believe, a very simple, broad introduction to the field. And it's a very personal book. So it actually shows you how easy, in a sense, it is to get started in this field, because many people think that our field is all related to software and obscure programming languages and stuff. But that comes after you learn the foundations, and that's usually something that I explain to my students. If you learn a little bit of r or excel and a little bit of illustrator and a little bit of. A little bit of a couple of two or three different software tools, and you learn the foundations, the theoretical foundations of the field, you can get started producing graphics right away. And my students are really surprised when, you know, one month or two months after getting started in my courses, they are actually producing information graphics already two months after. And they are, you know, they are impressed because they say, you know, I had never thought about doing graphic design or about doing, or about doing visualization, etcetera. But I can see that it's not something that alien. I mean, it's actually something that once you understand how it works, it's not that hard. I usually call my approach low tech visualization because my knowledge of programming is really limited. I am much better at conceptualizing, conceptualizing ideas and doing sketches and try to imagine. Try to envision what data sets are saying and extracting stories from those data sets and then conveying those stories through graphics.",
      "id": "ep_12_ut_67"
    },
    {
      "end": 1196330,
      "speaker": "Enrico Bertini",
      "start": 1193634,
      "text": "Yeah. Oh, sorry. Moritz, go ahead.",
      "id": "ep_12_ut_68"
    },
    {
      "end": 1198654,
      "speaker": "Moritz Stefaner",
      "start": 1196442,
      "text": "Go ahead. I'm fine.",
      "id": "ep_12_ut_69"
    },
    {
      "end": 1270004,
      "speaker": "Enrico Bertini",
      "start": 1199514,
      "text": "Yeah. I just wanted to briefly mention that I fully agree with you, and this is something, it's very similar to what I say to people, that people tend to be so much centered around the latest technology. But it's true that even if I think we can make a lot of advancements in terms of visualization technology, there are a few tools around that. If you have the right knowledge in your head, then you can really do a lot of stuff already with these tools. You don't really need to have the latest high tech technology in your computer. Neither. You need to be the very skilled software engineer you just need to learn a few, a few things. And what I normally suggest is to stick with standard tools, stuff that have approved record of achievements like those that you mentioned illustrate or r, maybe even Tableau or stuff like that. There must be a reason why people always mention them or use them, right?",
      "id": "ep_12_ut_70"
    },
    {
      "end": 1326894,
      "speaker": "Alberto Cairo",
      "start": 1270944,
      "text": "I agree with that. Yeah. And I mean, if you think about the story of our field and the classics in our field, you know, there were great visualizations done in the 19th century with just pen and paper. I mean, Jon Snow's map of the cholera outbreak, I mean, that was done by a doctor with no formal training in graphic design, and he did that with pen and paper. And it's one of the most wonderful data visualizations ever done. So that is approaching my classes how to think about data and how to sketch ideas out that later on can be transformed into interactive data visualizations or narrative pieces, etcetera. But the software, even if it's important and it helps, it's secondary compared to the structuring of the information or the conceptualizing of the conceptualization step of the process. That is the most important step.",
      "id": "ep_12_ut_71"
    },
    {
      "end": 1352476,
      "speaker": "Moritz Stefaner",
      "start": 1326974,
      "text": "Yeah, I found that interesting too, that you actually, in the book, you don't really talk about neither statistics in depth or tools like how you types of programs you can use. But now that I also understand that it's coming from the journalistic perspective, I can totally see now that the key point of the book is really about storytelling and constructing narratives. Right.",
      "id": "ep_12_ut_72"
    },
    {
      "end": 1464364,
      "speaker": "Alberto Cairo",
      "start": 1352620,
      "text": "And that is, that is the thing. Yeah, I mean, I thought about including something like an intro to, a very basic intro to a statistics. And I actually started writing about descriptive, descriptive statistics and a little bit about inferential statistics. But at the end I thought, you know, I don't want to have a technical, a very technical book. I want to have a more conceptual book that conveys my own vision of the field. And later on, after I write this book, if I decide that I write, I need to write a more technically oriented book about statistics, cartography, etcetera. I can do that later. I actually may do it later from a journalistic point of view, obviously, because that's my background. So I may, you know, something tailored and aimed specifically at journalists and designers, although it can be read by, you know, data visualizers, obviously, I believe that one of the things that I see in many data visualizations, and this is not, you know, this is not criticism. I love many data visualizations that I see every day right now. But the problem that, the challenge that I see in many of them is that it is not very clear what the designer of that visualization was trying to do. So it is not very clear in those beautiful, very complex, colorful visualizations that you see out there sometimes what the story is. So they have what I call the exploratory layer. So you can explore the data. But beforehand, the designer doesn't include a presentation layer where he or she tells you, well, these are the main points of the data set, and these are the most important parts of the data set. These are the most important numbers and phenomena. And after readers get that, they have a clue about how to navigate the exploratory part later on.",
      "id": "ep_12_ut_73"
    },
    {
      "end": 1512744,
      "speaker": "Moritz Stefaner",
      "start": 1465574,
      "text": "Yeah, that's interesting. That struck me also, both at Malofiej and now reading the book again, that our background is there. So different because I come much more from the. So I got started into the topic by seeing Ben Fry's work and Martin Wattenberg's work and Jonathan Harris and so on, these very open exploratory tools where the main fascination is, wow, you know, there's this huge data set and you can write these programs. Exactly. Yeah, yeah. And that was how I got into the field. And I just later discovered, like, all the great work that, you know, has been done by journalists for decades and, and all the really interesting, also simple and static formats, you know, you can.",
      "id": "ep_12_ut_74"
    },
    {
      "end": 1571104,
      "speaker": "Alberto Cairo",
      "start": 1512784,
      "text": "Choose, I believe, and that is, that is something that is related to the content of my class and the content of the book, that we can bring those two fields together. In a sense, if you take one side, the site that I come from, news infographics, infographics, journalistic infographics, we have the presentation side. We are good at presenting information and summarizing and synthesizing information and extracting what the main stories in the data are. But we are not good at creating the exploratory side of the story, creating interactive data visualizations that readers can navigate. And at the same time, if you go to the other side, the data visualizer side, you are very good at creating the exploratory side, but you have still to develop, in my opinion, the storytelling side of the field. So if we bring those two things together, if we learn from each other, I think that we will be much better off in the future.",
      "id": "ep_12_ut_75"
    },
    {
      "end": 1580554,
      "speaker": "Enrico Bertini",
      "start": 1572334,
      "text": "I think that's really interesting because listening to what you are saying, both of you are saying, I feel like I come from yet a different background.",
      "id": "ep_12_ut_76"
    },
    {
      "end": 1585046,
      "speaker": "Alberto Cairo",
      "start": 1583854,
      "text": "That's all I missed.",
      "id": "ep_12_ut_77"
    },
    {
      "end": 1605484,
      "speaker": "Enrico Bertini",
      "start": 1585190,
      "text": "Yeah. I mean, in a way, the way I see information visualization, even historically, is an interactive visualization that helps people investigating some specific data for the purpose of their own job, right? So there's actually no real story to tell there.",
      "id": "ep_12_ut_78"
    },
    {
      "end": 1610284,
      "speaker": "Alberto Cairo",
      "start": 1605604,
      "text": "So each person gets his or her own stories.",
      "id": "ep_12_ut_79"
    },
    {
      "end": 1639658,
      "speaker": "Enrico Bertini",
      "start": 1610364,
      "text": "I mean, I mean, you have doctors, scientists of any kind, biologists, whatever, and they are using a specific tool built and developed by an information visualization designer who doesn't really know what's the message there. There's no story to tell. The main purpose of the tool is to help people discover interesting patterns or just make sense of the data, because they don't know what is in the data, right.",
      "id": "ep_12_ut_80"
    },
    {
      "end": 1649322,
      "speaker": "Moritz Stefaner",
      "start": 1639706,
      "text": "And they might be able to exchange the data, right. So there might be an open button somewhere in the application and you just load a new data set, which you don't do in a newspaper graphic, of course.",
      "id": "ep_12_ut_81"
    },
    {
      "end": 1666176,
      "speaker": "Enrico Bertini",
      "start": 1649458,
      "text": "And I think many, many of us in this field still see information visualization in this way. And I'm sure some people are puzzled when they hear this, these telling stories with data, because it doesn't really match with our mental model of what information visualization is.",
      "id": "ep_12_ut_82"
    },
    {
      "end": 1666720,
      "speaker": "Moritz Stefaner",
      "start": 1666320,
      "text": "Sure.",
      "id": "ep_12_ut_83"
    },
    {
      "end": 1781784,
      "speaker": "Alberto Cairo",
      "start": 1666792,
      "text": "Yeah, well, I mean, sure, I mean, there are certain visualizations that are exclusively exploratory. Scientific visualizations, for instance, are like that because the people who read them already have the background to understand what stories should be extracted from those data sets. But my approach is visualization for general readers. So when you create, for instance, a visualization about the latest census bureau data in the US, you can present all those numbers to readers if you want to. So you can create an interactive visualization, a wonderful one, like the one made by the New York Times a while ago or one that was released by the Guardian just yesterday or something. They created like a wonderful map where you could see all the data from the census. So that is a visualization side. But at the same time, I believe that it is also important if you are going to address, if you are going to create your graphic for a general audience, to first of all, create like a presentation layer where you tell readers, well, these are the main data points. Think about Hans Rosling, for instance, what Hans Rosling does. That's exactly what he does. First of all, he presents the main points of the data with that style that, I mean, he seems to be presenting a soccer game and he says, take a look at Africa here, take a look at Europe there. Take a look. So that is the presentation side of the story, is when you get people excited about the data. It's the headline of the story in a journalistic sense. So you get people excited about the data that you are presenting, and then after you present the data in an animated form or something, or, you know, but a very interesting way. It's when you stop presenting the data and you present and you give the readers the tool to explore the data on their own. So that is a sense, that is why I usually see that you could bring those things, do those two things together if you're going to create a graphic to communicate with a general audience. Obviously in the scientific world, the approach is slightly different.",
      "id": "ep_12_ut_84"
    },
    {
      "end": 1819474,
      "speaker": "Moritz Stefaner",
      "start": 1782324,
      "text": "Yeah. Although also in science, it becomes more and more important to have, let's say, a strong characteristic visual that is also deep in a sense that it's very, like, contains a lot of detail, but it's still at the same time catchy enough to work on the COVID of nature, you know, or as opposed to draw attention. So I think also scientists increasingly understand these two sides, you know, that the one type of graphic is the one they use for exploration and maybe internally to discuss results, but there's also the other kind of derived for them, derived form where you boil down the key.",
      "id": "ep_12_ut_85"
    },
    {
      "end": 1843218,
      "speaker": "Alberto Cairo",
      "start": 1819514,
      "text": "Results into a strong visual and, yeah, that is interesting. One of the clearest things to me, I mean, that was very clear to me when I interviewed Jeff McGee, who works at Stanford University for the book, because he's exactly doing that. I mean, he's a journalist who's working in a scientific environment and helping scientists communicate better.",
      "id": "ep_12_ut_86"
    },
    {
      "end": 1845694,
      "speaker": "Moritz Stefaner",
      "start": 1843306,
      "text": "Yeah, helping scientists to get to the point.",
      "id": "ep_12_ut_87"
    },
    {
      "end": 1847894,
      "speaker": "Alberto Cairo",
      "start": 1846114,
      "text": "Yeah, that is the thing.",
      "id": "ep_12_ut_88"
    },
    {
      "end": 1853294,
      "speaker": "Moritz Stefaner",
      "start": 1848874,
      "text": "No, but it's really important. Right, Enrico?",
      "id": "ep_12_ut_89"
    },
    {
      "end": 1854404,
      "speaker": "Alberto Cairo",
      "start": 1853664,
      "text": "Sure.",
      "id": "ep_12_ut_90"
    },
    {
      "end": 1856192,
      "speaker": "Enrico Bertini",
      "start": 1855064,
      "text": "I couldn't agree.",
      "id": "ep_12_ut_91"
    },
    {
      "end": 1880408,
      "speaker": "Alberto Cairo",
      "start": 1856288,
      "text": "I'm not being all over the place. Yeah. I believe that we can learn from each other. Scientists can learn from journalists, how to summarize information and how to present it effectively. But at the same time, journalists need to learn from scientists because we journalists have a, you know, have this tendency to be too shallow in some cases, and we need to tell, you know. Yeah.",
      "id": "ep_12_ut_92"
    },
    {
      "end": 1902904,
      "speaker": "Moritz Stefaner",
      "start": 1880416,
      "text": "Or maybe too much focused on this one key story. And I think so much power can be in this, in this mechanism where each reader can sort of discover his own story or look up his own hometown, you know, and then there is, then you cannot answer that question anymore, like, what's the story? What's the key story, where's the scoop? But it still can be very enjoyable and informative for many people.",
      "id": "ep_12_ut_93"
    },
    {
      "end": 1906568,
      "speaker": "Alberto Cairo",
      "start": 1903024,
      "text": "Yeah. And there are some people out there who are already doing that. Think about the New York Times.",
      "id": "ep_12_ut_94"
    },
    {
      "end": 1908008,
      "speaker": "Moritz Stefaner",
      "start": 1906616,
      "text": "Oh, absolutely, yeah.",
      "id": "ep_12_ut_95"
    },
    {
      "end": 1909624,
      "speaker": "Alberto Cairo",
      "start": 1908136,
      "text": "I mean, your times are actually doing that.",
      "id": "ep_12_ut_96"
    },
    {
      "end": 1945072,
      "speaker": "Moritz Stefaner",
      "start": 1909664,
      "text": "Yeah. One type of feedback I often get from journalists when they hear about my work or when I present my work is that, well, that's all nice and dandy that you can spend six weeks doing one map or something like this, but we have to spit out graphics on a high pace. Any thoughts on that? How maybe the average newsroom can improve on this end, doing innovative data visualization or interesting stuff, but given the very practical constraints they're in?",
      "id": "ep_12_ut_97"
    },
    {
      "end": 2072904,
      "speaker": "Alberto Cairo",
      "start": 1945248,
      "text": "Yeah, I mean, that is why I call my approach low tech visualization, because that's exactly what I do. So actually, there was a woman who wrote a very short review of the book the other day saying that it was very clear by reading the book that I have always worked in newsrooms in the sense that I have always worked with very limited resources. So what you have to do, if you're working in a newsroom and have very limited resources and you still want to produce great graphics and visualization is, first of all, try to limit the amount of projects that you work on. And that is, that is, you know, that is hard to do sometimes because you get a lot of requests from different people asking for different kinds of graphics, but somehow you have to narrow it down. You have to first of all identify what the main stories are in the week or in the month and do graphics just for those. So you may create, for instance, a big project every week or something like that. That will be a realistic, a very realistic output for a very small visualization and infographics department or a couple of big graphics every week. So that is the first thing. And the second thing is to take advantage of the many wonderful tools that you have out there right now. So instead of learning, you know, a very fancy, the newest fancy programming language, try to stick to the very basics. Try to stick to, you know, illustrator r if you want to do some statistical analysis, maybe learn some processing or a little bit of JavaScript with D3. That is not that hard. And just use that or use Google Fusion tables. I mean, you can do wonderful things with fusion tables. So it's just sticking to the very basics and adapting your output to the limitations that you have in your newsroom. Obviously, if you only have two people doing graphics in a newsroom, you cannot be the New York Times because the New York Times have 30 people doing information graphics. So you have to adapt your scope or your expectations to your own limitations.",
      "id": "ep_12_ut_98"
    },
    {
      "end": 2113410,
      "speaker": "Moritz Stefaner",
      "start": 2074744,
      "text": "And simply work with that. Yeah, I think that makes a whole lot of sense. Yeah. And I mean, the times, many things have been said why they are so great or not or whatever, but I think one thing they really do smart is combine like long term developments, but in a sense that they develop their own toolkits and their own recurring elements that enable them then to act very quickly. They somehow managed to build up that, both from a team perspective, but as well from a technical perspective, to have this very agile, you know, loose collection of things and people that enable them to act very quickly.",
      "id": "ep_12_ut_99"
    },
    {
      "end": 2129200,
      "speaker": "Alberto Cairo",
      "start": 2113522,
      "text": "Well, the New York Times, I talk a lot about the New York Times because I get the print New York Times every day in my front door. So I am a fan. I'm a fanboy of the New York Times. But it's not a good example because for newsrooms in general, it doesn't work like that.",
      "id": "ep_12_ut_100"
    },
    {
      "end": 2130320,
      "speaker": "Moritz Stefaner",
      "start": 2129232,
      "text": "Right? Yeah, yeah.",
      "id": "ep_12_ut_101"
    },
    {
      "end": 2168204,
      "speaker": "Alberto Cairo",
      "start": 2130392,
      "text": "Nobody is the New York Times and nobody can, you know, can achieve what the New York Times does at the same level of quality and the same level of amount of output because there are a lot of people, but there are smaller newsrooms and smaller teams who are also putting out a wonderful work. So the Washington Post, for instance, the Boston Globe, for instance, you know, there are the Chicago Tribune, there's smaller newspapers with a smaller staffs that are creating wonderful work with much more limited resources. But this is still wonderful because. Oh, the Guardian, think about the Guardian.",
      "id": "ep_12_ut_102"
    },
    {
      "end": 2184328,
      "speaker": "Moritz Stefaner",
      "start": 2168244,
      "text": "Yeah, great stuff. And they also do very pragmatic things. So they don't invest much in like developing their own graphical style or they're happy also using standard tools like Google, Google Maps or something. But they always have an interesting twist to the story side.",
      "id": "ep_12_ut_103"
    },
    {
      "end": 2185400,
      "speaker": "Alberto Cairo",
      "start": 2184496,
      "text": "Yeah, yeah.",
      "id": "ep_12_ut_104"
    },
    {
      "end": 2188200,
      "speaker": "Moritz Stefaner",
      "start": 2185472,
      "text": "And they collect their own data sets and share them again. Exactly.",
      "id": "ep_12_ut_105"
    },
    {
      "end": 2200680,
      "speaker": "Alberto Cairo",
      "start": 2188272,
      "text": "That is wonderful. I really love that. I really love that. I really love that. They are wonderful at that. So, yeah, that is the approach. I mean, look at the Guardian, look at the Chicago Tribune, Boston Globe, the Washington Post, etcetera. Yeah, that is the approach.",
      "id": "ep_12_ut_106"
    },
    {
      "end": 2214406,
      "speaker": "Moritz Stefaner",
      "start": 2200752,
      "text": "And the magazine world, like, how are things in the magazine world? Are there any interesting emerging new publications or is this type of high end infographic? Is that still in the current, not.",
      "id": "ep_12_ut_107"
    },
    {
      "end": 2332752,
      "speaker": "Alberto Cairo",
      "start": 2214430,
      "text": "In the US that I am aware of. I mean, if you look at the traditional news weeklies, for instance, none of them are doing great graphics other than, you know, Bloomberg Business Week is doing some interesting work. Okay, that could be one of the, that could be one of the cases, Bloomberg Business Week, but the others are not doing great things in general, with some exceptions. That said, it happens in South America. If you go to South America, for instance, if you go to Brazil, for example, which is a country that I know quite well, there are several news publications there, both newspapers and magazines, who are really pushing the envelope. So, for instance, you have the magazine that it used to work for Epoca, which is a weekly magazine that sells around half a million copies a week. So it's a big magazine and they are producing wonderful information, graphics work, and also interactive data, visualizations about political issues and economical issues, etcetera. There is a newspaper called Estado de Sao Paulo in Brazil who is putting together a data journalism team. So it's not just visualization. They are also gathering and processing their own data. La Nacion in Argentina are doing a wonderful job, in my opinion. They also have a data journalism team, La Nacion from Costa Rica. They have a very strong investigative team that produce, creates data sets. And I visited them a while ago. That is the reason why I know them quite well. And what, the kind of work that they're producing is just unbelievable. I mean, they just, they create investigative stories based on data. And the most important one that they published in the past couple of years, basically, you know, it basically proved that several ministers in the government were not paying their taxes, basically, and several ministers in the country had to renounce.",
      "id": "ep_12_ut_108"
    },
    {
      "end": 2333208,
      "speaker": "Moritz Stefaner",
      "start": 2332808,
      "text": "Oh, wow.",
      "id": "ep_12_ut_109"
    },
    {
      "end": 2336136,
      "speaker": "Alberto Cairo",
      "start": 2333256,
      "text": "Because. Because of a data journalism project.",
      "id": "ep_12_ut_110"
    },
    {
      "end": 2337884,
      "speaker": "Moritz Stefaner",
      "start": 2336320,
      "text": "Because of a bar chart.",
      "id": "ep_12_ut_111"
    },
    {
      "end": 2356944,
      "speaker": "Alberto Cairo",
      "start": 2338464,
      "text": "Because of a bar chart. It was already a bar chart. It was a data set, but it was, it was a unbelievable that data journalism, data journalism and data processing, and that's great. Yeah, yeah. What it can be achieved, you know, we have very limited resources because these newspapers are, again, are not the New York Times.",
      "id": "ep_12_ut_112"
    },
    {
      "end": 2358196,
      "speaker": "Moritz Stefaner",
      "start": 2357244,
      "text": "Sure. Yeah.",
      "id": "ep_12_ut_113"
    },
    {
      "end": 2367344,
      "speaker": "Enrico Bertini",
      "start": 2358220,
      "text": "I'm curious to hear that. Alberto, do you think in South America there is even a stronger trend than in the US or anywhere else in the world?",
      "id": "ep_12_ut_114"
    },
    {
      "end": 2476134,
      "speaker": "Alberto Cairo",
      "start": 2367644,
      "text": "Well, it's not a stronger trend if you, I mean, the problem with American media, particularly newspapers and magazines, is that they are going through very hard times. So they don't have, basically, they don't have money to invest in, you know, data journalism or visualization, with several exceptions. All right, several exceptions. ProPublica, for instance, I forgot to mention them. But ProPublica is also doing great, great work in visualization terms. But the problem with American media in general is that there is no money because they are selling fewer copies and they are getting less advertisement money. So there's a huge problem with budget, a lot of budget issues. But in South America, Brazil, Argentina, Peru and other countries, newspapers are still selling relatively well. They are not shrinking and they still have advertisement money. So they have some time to adapt to the new world. They start hiring programmers and developers and hackers, etcetera. I mean, it was unbelievable, or at least unthinkable a while ago that a newspaper in South America would hire a hacker. But now there are some newsrooms in South America who have hired hackers to actually get data and process the data and create data sets, etcetera. So that is the reason why that trend has shown up in South America. The challenges in south American media is that they don't have the theoretical foundations, in a sense. I mean, journalism schools don't teach data journalism and don't teach programming, something that we do here in the US. At the school of communication here in Miami, our students learn visualization, but they also learn how to do programming with JavaScript and other tools.",
      "id": "ep_12_ut_115"
    },
    {
      "end": 2477676,
      "speaker": "Enrico Bertini",
      "start": 2476724,
      "text": "Okay.",
      "id": "ep_12_ut_116"
    },
    {
      "end": 2499556,
      "speaker": "Moritz Stefaner",
      "start": 2477860,
      "text": "Yeah, I also, that's also one of the things I recall from Malovy is the Russian infographics, because they had this very unique style and also were very experimental in just how they used media. And so I had that sense of, okay, let's look at Russia occasionally, because there might be interesting developments there.",
      "id": "ep_12_ut_117"
    },
    {
      "end": 2502616,
      "speaker": "Alberto Cairo",
      "start": 2499740,
      "text": "Yeah, cultural diversity is wonderful.",
      "id": "ep_12_ut_118"
    },
    {
      "end": 2505200,
      "speaker": "Moritz Stefaner",
      "start": 2502700,
      "text": "Yeah. And it really shows in the graphics.",
      "id": "ep_12_ut_119"
    },
    {
      "end": 2522048,
      "speaker": "Alberto Cairo",
      "start": 2505352,
      "text": "Yeah, yeah. There are. I mean, there are many countries where visualization and graphics are developing and being used more, more broadly and deeply, such as Russia, for instance, Brazil, for instance. And each country is developing its own style, in a sense.",
      "id": "ep_12_ut_120"
    },
    {
      "end": 2522664,
      "speaker": "Moritz Stefaner",
      "start": 2522096,
      "text": "Totally.",
      "id": "ep_12_ut_121"
    },
    {
      "end": 2554514,
      "speaker": "Alberto Cairo",
      "start": 2522784,
      "text": "It's not something, you know, that you can clearly tell, but you can at least guess that something is going on there that they are creating, like a new style. And that is wonderful because it brings diversity to this field. It's not just, you know, Tufte principles of simplicity and minimalistic approaches, etcetera, as wonderful as they are and as important as they are. But again, there are some tweaks that you can introduce to the, to the main rules or principles of our field and try to adapt them to your own culture in some sense.",
      "id": "ep_12_ut_122"
    },
    {
      "end": 2575090,
      "speaker": "Moritz Stefaner",
      "start": 2555714,
      "text": "Sure. And I have that sense that now graphics are getting more experimental again. And maybe that also. Yeah. Again, the programmers and the hackers experimenting with visuals has led actually to a new way of bending the rules of traditional diagram making, I guess.",
      "id": "ep_12_ut_123"
    },
    {
      "end": 2600652,
      "speaker": "Alberto Cairo",
      "start": 2575202,
      "text": "Yeah. You have to do that with care. You have to be careful with that. You know, if you, if you try to stretch the field out too much, you can break it. So I usually say that I am completely in favor of experimentation and using new graphic forms, and that is something a bit challenging in newsrooms because, believe it or not, journalists are, you know, very conservative. Very.",
      "id": "ep_12_ut_124"
    },
    {
      "end": 2601500,
      "speaker": "Moritz Stefaner",
      "start": 2600748,
      "text": "I can imagine.",
      "id": "ep_12_ut_125"
    },
    {
      "end": 2615406,
      "speaker": "Alberto Cairo",
      "start": 2601572,
      "text": "Yeah, yeah, yeah. So whenever you try to publish some, a graphic that is not a bar chart or a line chart or something, journalists tend to get scared. So the first time that I tried to use a scatterplot in a newspaper.",
      "id": "ep_12_ut_126"
    },
    {
      "end": 2619070,
      "speaker": "Moritz Stefaner",
      "start": 2615470,
      "text": "Everybody was like, whoa, what is two dimensions?",
      "id": "ep_12_ut_127"
    },
    {
      "end": 2668330,
      "speaker": "Alberto Cairo",
      "start": 2619222,
      "text": "Yeah, two dimensions there, two variables there. Readers will not understand that. But it turns out that readers understand that if you use a scatterplot and you explain it well, because this is something that sometimes we, we forget in visualization that the annotation layer, what the New York Times people call the annotation layer. So including a little, a short line telling readers, well, reader, this is a new graphic form. This is how it's read and you explain how to read it. The first time that you use that graphic form, readers will have a hard time, will take a couple of minutes to figure it out. But then when you use that graphic form again, readers will be, will be ready to read. It will be already, we already know how to read a scatter plot or, you know, a slope graph or, you know, several different kinds of graphics that are not so common, but they can be useful for particular stories.",
      "id": "ep_12_ut_128"
    },
    {
      "end": 2668770,
      "speaker": "Moritz Stefaner",
      "start": 2668402,
      "text": "Yeah.",
      "id": "ep_12_ut_129"
    },
    {
      "end": 2671658,
      "speaker": "Alberto Cairo",
      "start": 2668842,
      "text": "So innovation is a must. And I would also do it carefully.",
      "id": "ep_12_ut_130"
    },
    {
      "end": 2681618,
      "speaker": "Moritz Stefaner",
      "start": 2671706,
      "text": "Anyone who's to at these days, you know, reading a printed newspaper is capable of figuring out stuff, I believe so.",
      "id": "ep_12_ut_131"
    },
    {
      "end": 2737784,
      "speaker": "Alberto Cairo",
      "start": 2681746,
      "text": "That's what I say. I mean, if you are a reader of, of the Washington Post, I mean, you have certain, you know, cultural background that allows you to, you know, to read a fairly complex chart. I usually say in newsrooms because, I mean, none of you are journalists, but if a journalist is listening to this conversation right now, probably this with striachord, because journalists usually say, well, this graphic is too complex or it's too complicated, it's too difficult to read. And my answer to that is, well, if you expect your reader to read a 4000 word long story, a very complex storytelling, a very complex, you know, corruption scandal in the government, you have to create your graphics accordingly. I mean, you cannot create stories written for adults, for adults, and create graphics aimed at adolescents or child, children.",
      "id": "ep_12_ut_132"
    },
    {
      "end": 2738376,
      "speaker": "Moritz Stefaner",
      "start": 2737864,
      "text": "Excellent point.",
      "id": "ep_12_ut_133"
    },
    {
      "end": 2743234,
      "speaker": "Alberto Cairo",
      "start": 2738400,
      "text": "Is that what. Yeah, that's the argument that I usually use.",
      "id": "ep_12_ut_134"
    },
    {
      "end": 2775464,
      "speaker": "Enrico Bertini",
      "start": 2745334,
      "text": "But it's true that the amount of explanation you can give in a newspaper is so limited compared to other settings where you still want to use visualization as a presentation tool. Like for instance, in presentations, right? I mean, I guess Hans Rosling, when presenting his visualizations, he has the opportunity to explain, explain what they are before showing them. But doing that in a written format in a newspaper is much harder, right?",
      "id": "ep_12_ut_135"
    },
    {
      "end": 2822514,
      "speaker": "Alberto Cairo",
      "start": 2775764,
      "text": "It is harder, but again, you can take the best things from both worlds. What I have done in the past, for instance, when I was in Brazil, one of the things that we did we had a weekly section in the magazine that I used to work for called the diagram. So it was a story told through graphics and charts and diagrams, et cetera, and illustrations etcetera. And whenever we had a very complex data set or a very complex story, what we did in the print magazine was just to present the main facts. And then we had like a little box there, very visible, saying, if you want to learn more, this is the URL. Ok, we told our readers, well go online and you will get the entire data set. And then they went online and they got the entire sets of numbers and they explored the dataset. So that is the approach I believe.",
      "id": "ep_12_ut_136"
    },
    {
      "end": 2835230,
      "speaker": "Moritz Stefaner",
      "start": 2823334,
      "text": "I'm still dreaming of an elegant solution to enable people like to jump from the print graphic directly into the same interactive, you know, like at a given like pivot point or so. But it's not so easy.",
      "id": "ep_12_ut_137"
    },
    {
      "end": 2838230,
      "speaker": "Alberto Cairo",
      "start": 2835342,
      "text": "Maybe it's not easy, yeah, but maybe.",
      "id": "ep_12_ut_138"
    },
    {
      "end": 2848754,
      "speaker": "Moritz Stefaner",
      "start": 2838262,
      "text": "At least they could add like tiny URL's, you know, like short links for the annotated data points. Why not our QR codes? But I mean QR codes are lame, but, but something along these lines.",
      "id": "ep_12_ut_139"
    },
    {
      "end": 2853478,
      "speaker": "Alberto Cairo",
      "start": 2849934,
      "text": "Well there's a lot of innovation still to be done in this field.",
      "id": "ep_12_ut_140"
    },
    {
      "end": 2875232,
      "speaker": "Moritz Stefaner",
      "start": 2853566,
      "text": "I believe the other thing I'm always looking for is to have a nice print export for web graphics, which we might achieve with SVG and so on, you know, like nice workflow that allows you to work on both things in parallel, like for the first 80% and then optimize. So in case you find something nice there I could use, I will let.",
      "id": "ep_12_ut_141"
    },
    {
      "end": 2914078,
      "speaker": "Alberto Cairo",
      "start": 2875248,
      "text": "You know because that is one of the challenges that we have right now. But I mean, you know, as I said before, tools are things that come and go and we have to adapt to the new world. Something will, you know, will show up eventually that will allow you to do that and we will have to adapt to that new tool that allows you to do that. And I mean just remember what happened with adaptation is one of our main, one of our main, you know, features in our field, one of the main things that we have to do to adapt to new tools. Remember what happened with Flash, for instance, we used to create a lot of visualizations with Flash. Now well we don't do that much work with Flash anymore.",
      "id": "ep_12_ut_142"
    },
    {
      "end": 2916914,
      "speaker": "Enrico Bertini",
      "start": 2914246,
      "text": "And don't tell it to Morritz.",
      "id": "ep_12_ut_143"
    },
    {
      "end": 2923434,
      "speaker": "Alberto Cairo",
      "start": 2920054,
      "text": "I used to be a flash fan. I loved action script.",
      "id": "ep_12_ut_144"
    },
    {
      "end": 2926150,
      "speaker": "Enrico Bertini",
      "start": 2924774,
      "text": "He's a big fan.",
      "id": "ep_12_ut_145"
    },
    {
      "end": 2930034,
      "speaker": "Alberto Cairo",
      "start": 2926302,
      "text": "I am a big fan myself. We have to adapt.",
      "id": "ep_12_ut_146"
    },
    {
      "end": 2940254,
      "speaker": "Moritz Stefaner",
      "start": 2930854,
      "text": "Yeah, that's the problem. No, but it's on the long run. I'm all for web standards and browser based stuff and so on. So it's just at the moment, so.",
      "id": "ep_12_ut_147"
    },
    {
      "end": 2944590,
      "speaker": "Alberto Cairo",
      "start": 2940294,
      "text": "Difficult to just acknowledge that you still love flash.",
      "id": "ep_12_ut_148"
    },
    {
      "end": 2959552,
      "speaker": "Moritz Stefaner",
      "start": 2944702,
      "text": "Absolutely. The Globe I'm building, it's in flash. It's the best technology, in fact, for that type of thing. So we use the 3d features and we can use multi touch for the installation part. And so, yeah, it's not quite, it's not totally dead yet, but it's, it's smelling a bit funny.",
      "id": "ep_12_ut_149"
    },
    {
      "end": 2969024,
      "speaker": "Alberto Cairo",
      "start": 2959648,
      "text": "Yeah, maybe Adobe, maybe Adobe will come up with something. Yeah, eventually, maybe looks like Flash, but lets you explore in HTML five or something. I don't know.",
      "id": "ep_12_ut_150"
    },
    {
      "end": 2977188,
      "speaker": "Moritz Stefaner",
      "start": 2969064,
      "text": "I'm scared to see that Adobe has not made a big name in the last few years for making good stuff.",
      "id": "ep_12_ut_151"
    },
    {
      "end": 2997304,
      "speaker": "Enrico Bertini",
      "start": 2977216,
      "text": "That's right. So, Alberto, I wanted to ask you, going back to your book, I wanted to ask you, so, apart from your students and students in journalism, what can other people coming from other backgrounds can get from your book?",
      "id": "ep_12_ut_152"
    },
    {
      "end": 3135260,
      "speaker": "Alberto Cairo",
      "start": 2997764,
      "text": "Well, I mean, the book, as I said before, I wrote it for students and also my peers in newsrooms and in graphic design, etcetera. But it can be read by anybody who is interested in graphics, because I believe that graphics the same way that journalists and designers should read Tufte and should read the Stephen Few and should read, you know, Collin Ware, Stephen Costly, and all the people who have written about charts and maps, etcetera, to learn about those same way I believe that people from business intelligence and from data visualization, etcetera, could learn a little bit more about storytelling and could learn a little bit more about how to structure pieces of data to tell stories and to communicate with the readers. So that is, I guess, what can be learned and also having a more functional approach to the story. Because what I said before about the title of the book, the functional art, that comes from the fact that many people in newsrooms, many designers in newsrooms, still think as artists, meaning that they get a data set and they try to adapt the visual representation of that data set to a particular graphic form, rather than, first of all, think about what the data set, what kind of information the data set conveys, and then create the graphic form according to the story that you want to tell or according to the tasks your visualization should help with. So the same thing can be said about data visualizers or data designers in some sense. I see many works out there that are wonderful from an aesthetics standpoint. They look wonderful and they are very well designed, but then they are not very useful and they are not usable and their point is not very clear. So, as I said before, both worlds, I believe, can learn from each other. And I think that the meeting point is that if you want to communicate effectively, there are certain principles that you should apply or that you, that may be useful for your, for your work, regardless of if you are a designer, a journalist, a data visualizer or a scientist.",
      "id": "ep_12_ut_153"
    },
    {
      "end": 3206106,
      "speaker": "Enrico Bertini",
      "start": 3135372,
      "text": "But I think looking at what you say in the book, I think you are also stressing the other, the other side of the coin. I mean, people who are too much, too much functional, they also have to learn that there are constraints, and especially in terms of information density. I mean, people, students coming in my courses or from my area are people who are taught to have a very high information density and try to make complex things, basically trying to make them simple, but still they are complex. And I think what I really like of your book, sorry, is that you seem to stress also this other aspect. And I think it's really nice. Am I correct if I say that? So, I had a note from your book, I really like this visualization wheel that you explain in the foundations chapter part. Sorry. And I think that's just, it's a very interesting tool for everyone, regardless the background of the data visualization person who is approaching this, this area. Because, I don't know, maybe you want to introduce the visualization wheel before I comment too much on it, because, yes.",
      "id": "ep_12_ut_154"
    },
    {
      "end": 3332814,
      "speaker": "Alberto Cairo",
      "start": 3206170,
      "text": "I mean, the visualization wheel. The visualization wheel is something that I developed for my own work to visualize my own graphics. And it's basically a tool. It's not a very scientific tool. I would not recommend it to use it in research projects, for instance, for analyzing visualization, etcetera. It's something that I developed myself to balance out different constraints and different features in visualization. Different pairs of features that are related to each other, such as density and lightness, such as, you know, aesthetics and functionality. So those two opposite things should be balanced out in a graphic. And it depends on the way you balance out and the way you use the wheel to conceptualize your own projects depends on many factors, depends on who you're working for, where your graphic is going to be published, and also who your audience is. So, for instance, in the case of your students, the audience your students are speaking to is probably scientists. So it makes sense that they stress density. That's what I would do, because scientists already have enough background information to understand that density. But if you are going to present that information to a general reader, you want to make sure that you structure the information in a way that can be understood. And let me tell you something about a little bit more about that. Many journalists, what they do when they have to present complex information to readers is to get rid of complexity. They just present the summary of the data. And something that I explain in the book is that that is also the wrong approach. What you have to do is to structure your graphics in layers. So, first of all, you present the main facts or the main points of the story, but then you organize the information, like in a step by step process or in a gradual degree of complexity. So, first of all, you present the main facts, and then after that, you let readers explore those facts. All right? So you could have the best things from both worlds.",
      "id": "ep_12_ut_155"
    },
    {
      "end": 3377060,
      "speaker": "Moritz Stefaner",
      "start": 3333184,
      "text": "I believe that's an interesting part also, I think in your book, towards the end, when you describe the visual hierarchy of different graphics and how you first, how you. How you sketch and lay out the interplay of individual graphics, because that make up a bigger piece. Right. And that's something I haven't seen before in an information design book or a data visualization book, because they're often just focused, focused on the one diagram. But you never get the story. You know, how to tie in many annotations into a big visual and then have a few, you know, little graphs on the side. How do you make sure people read the important stuff first and then the details and, and how they navigate such a big page and so on? So that's very interesting.",
      "id": "ep_12_ut_156"
    },
    {
      "end": 3527754,
      "speaker": "Alberto Cairo",
      "start": 3377132,
      "text": "Yeah. That is not something that I invented. I mean, 90% of the things or 95% of the things that are in the functional art were invented by someone else. It's only that what I did. I mean, any book is like that. You just stand on the shoulders of giants like it's usually said. So if you take few and you take Tufte and you take costing and you take all the, you know, the great people, you take both of you, actually, and you gather all the information that you get, and you can. You can work based on that. What you said about the structural information in several pieces or telling stories through various graphics. Through different graphics, it's something that I do in my own work a lot. I don't, I don't usually try to tell the entire story through a single graphic form because I believe that that is, that is actually overwhelming. And I feel overwhelmed when I see a graphic that tries to say too many things through a single graphic form. So two approaches that I developed in my own work is, first of all, so take advantage of small multiples. That is one thing. And that comes from Tufte it's not something that I invented, so use small or from Bertin. So it's small multiples or small snippets of information that are presented sequentially. So, first of all, you present a line chart that tells you part of the story. Then a bar chart that complements the line chart, then a map that gives you another view of the same data. You present those as a linear storyteller in peace, the step by step, each one with their own headline, etcetera. That is one of the approaches, and the other approach is in interactive visualization. And this is something that I don't see that often, but I would like to see more often, is if you are going to present a very complex piece of data, don't represent those data in a single graphic form, or through a single graphic form, represent it in different ways. And I talk about an example of that, a graphic of mine about world population, where I represented, or we represented, because this was done by my team, we represented the same data through a bubble map, through line charts, through bars, through a table. And all those graphics were based on the same data set. And the reason why was each one of those graphics allows you to do something different. So the bubble chart lets you see the overall patterns and trends. The line charts lets you compare accurately. The table allows you to see the specific values, so it's different kinds of representations of the same data set.",
      "id": "ep_12_ut_157"
    },
    {
      "end": 3551738,
      "speaker": "Enrico Bertini",
      "start": 3529654,
      "text": "I am personally a huge fan of this concept. I mean, I have seen people fighting forever according to whether it's better a or b or c. And there are many cases where there's no better a is and b and c together make the sum of them is better than any single piece, right? Anything.",
      "id": "ep_12_ut_158"
    },
    {
      "end": 3552938,
      "speaker": "Alberto Cairo",
      "start": 3551786,
      "text": "It depends on the task.",
      "id": "ep_12_ut_159"
    },
    {
      "end": 3554250,
      "speaker": "Enrico Bertini",
      "start": 3552986,
      "text": "It depends on the task. Yeah, sure.",
      "id": "ep_12_ut_160"
    },
    {
      "end": 3574574,
      "speaker": "Alberto Cairo",
      "start": 3554282,
      "text": "In the best of what you want to get, do you want to get these specifics? Use a table. Do you want to guess just the overall patterns? Use a bubble map. Do you want to compare accurately? Use a bar chart or a line chart. But each one of them is not. I mean, they are not mutually exclusive. They can be included in the same graphic. And that's the approach, I believe.",
      "id": "ep_12_ut_161"
    },
    {
      "end": 3601474,
      "speaker": "Moritz Stefaner",
      "start": 3576314,
      "text": "Yeah, but often it's a drift you don't get when you try to make the one map or the one graphic that shows it all. And yeah, I've learned that too, that often. Once, if you hit a wall there, it can be so much easier to split it up in two or three individual graphics that together make more sense, or where each of the graphics focuses on one thing and it's all good.",
      "id": "ep_12_ut_162"
    },
    {
      "end": 3681154,
      "speaker": "Alberto Cairo",
      "start": 3603414,
      "text": "And each reader is different also. Oh, of course, there are people who understand, and this was very clear to me when I interviewed Stephen Rosling a while ago. And you are familiar with costly, and in case our listeners are not familiar with Rosling, Rosling is a cognitive scientist that has written extensively about charts. And I interviewed him a while ago for El Pais, which is a newspaper in Spain. The interview is not in the book because he's not a practitioner. He's a researcher. But I published the interview in El Pais in the newspaper in Spain, and he was clear to me in one part of our conversation. He told me, well, throughout the years, I have discovered that there are certain people who basically cannot read graphics effectively. Their brains are not organized in a way that can be. That allow them to understand graphics very well, so they prefer information presented in written format, or there are people who are better at comparing. So the idea of presenting information in different ways or with different shapes, it's actually related to the fact that there are several common cognitive principles, but then each person is slightly different to the other person.",
      "id": "ep_12_ut_163"
    },
    {
      "end": 3692190,
      "speaker": "Moritz Stefaner",
      "start": 3683654,
      "text": "And so, yeah, the more of these different views into one topic, you are like roads towards the topic you can offer, the better.",
      "id": "ep_12_ut_164"
    },
    {
      "end": 3697350,
      "speaker": "Alberto Cairo",
      "start": 3692342,
      "text": "The more options you give readers, the more readers will get the information. That's the message, yeah.",
      "id": "ep_12_ut_165"
    },
    {
      "end": 3698194,
      "speaker": "Moritz Stefaner",
      "start": 3697382,
      "text": "Interesting.",
      "id": "ep_12_ut_166"
    },
    {
      "end": 3731084,
      "speaker": "Enrico Bertini",
      "start": 3699454,
      "text": "If I remember well, there is a paper published a few years ago, like two or three years ago or so, from the research of Robert Kosara and Caroline Simkiewicz. I don't remember the title, and honestly, I don't even remember perfectly the content, but I remember that they basically tested people with different visual abilities or cognitive abilities, and they demonstrated that they read visualizations differently. Basically.",
      "id": "ep_12_ut_167"
    },
    {
      "end": 3739620,
      "speaker": "Alberto Cairo",
      "start": 3732584,
      "text": "There's a lot of research to be done on that. Absolutely, absolutely promising research area.",
      "id": "ep_12_ut_168"
    },
    {
      "end": 3748504,
      "speaker": "Moritz Stefaner",
      "start": 3739732,
      "text": "Was this the one where it was about, like, the impression people get, like, what they read between the lines? If you have, like, a very rigid.",
      "id": "ep_12_ut_169"
    },
    {
      "end": 3759308,
      "speaker": "Alberto Cairo",
      "start": 3748884,
      "text": "There are people who are better. And this is something that, you know, has been. It has been found. And as I said before, I am not a cognitive scientist. You, Moritz, are a cognitive scientist. I am.",
      "id": "ep_12_ut_170"
    },
    {
      "end": 3760824,
      "speaker": "Moritz Stefaner",
      "start": 3759356,
      "text": "I didn't want to, like.",
      "id": "ep_12_ut_171"
    },
    {
      "end": 3838400,
      "speaker": "Alberto Cairo",
      "start": 3764864,
      "text": "You know, there are certain cognitive styles, meaning that everybody has a common cognitive structure in their brain, so everybody understands things basically the same. But then there are slight differences in the way people approach information, and there are people who see visual patterns more easily than other people, people who don't see visual patterns at all in graphics, but there are people who are much better at that. So, you know how you balance that out in an information graphic or in a visualization, the fact that a portion of your readers are not that great at seeing patterns in the data. I believe that you can address that problem basically using short pieces of text, telling readers, for instance. And that is what Hans Rosling does in his presentations and what the New York Times does with a little explanatory text in their graphics. Hey, reader, pay attention at this point here. At this data point here. This is the state of Massachusetts or this is state of whatever. Pay attention at the unemployment rate here. And that gives readers a clue of how to read the graphic as well and how to perceive patterns in the data.",
      "id": "ep_12_ut_172"
    },
    {
      "end": 3874814,
      "speaker": "Moritz Stefaner",
      "start": 3838472,
      "text": "Yeah, that's definitely something I'm taking home from the whole infographics world is the power of annotations. You know, really strong infographic is all about good annotations and labels. And in data visualization, you might have, if you get lucky, you get a tooltip somewhere. But I think specialists picking exactly the right spot on annotations and presenting them in a smart way, that's where we can maybe bridge these two worlds. Yeah, potentially.",
      "id": "ep_12_ut_173"
    },
    {
      "end": 3877426,
      "speaker": "Alberto Cairo",
      "start": 3875114,
      "text": "Yeah. And we will be better off for sure.",
      "id": "ep_12_ut_174"
    },
    {
      "end": 3878210,
      "speaker": "Moritz Stefaner",
      "start": 3877490,
      "text": "Yeah.",
      "id": "ep_12_ut_175"
    },
    {
      "end": 3879010,
      "speaker": "Alberto Cairo",
      "start": 3878402,
      "text": "Yeah.",
      "id": "ep_12_ut_176"
    },
    {
      "end": 3885666,
      "speaker": "Moritz Stefaner",
      "start": 3879122,
      "text": "Cool. Great conversation. I'm. I think, I mean, we recorded almost an hour or maybe even longer.",
      "id": "ep_12_ut_177"
    },
    {
      "end": 3890986,
      "speaker": "Enrico Bertini",
      "start": 3885850,
      "text": "So I would do it for ages. Maybe we should.",
      "id": "ep_12_ut_178"
    },
    {
      "end": 3895074,
      "speaker": "Alberto Cairo",
      "start": 3891170,
      "text": "This is fun. We should have an ongoing conversation.",
      "id": "ep_12_ut_179"
    },
    {
      "end": 3895938,
      "speaker": "Enrico Bertini",
      "start": 3895234,
      "text": "Alberto.",
      "id": "ep_12_ut_180"
    },
    {
      "end": 3897734,
      "speaker": "Moritz Stefaner",
      "start": 3895986,
      "text": "We'll have an offspring podcast.",
      "id": "ep_12_ut_181"
    },
    {
      "end": 3905316,
      "speaker": "Enrico Bertini",
      "start": 3899044,
      "text": "Second or third part or at least as many parts as you have in the book. How many parts you have? Four, actually.",
      "id": "ep_12_ut_182"
    },
    {
      "end": 3906864,
      "speaker": "Alberto Cairo",
      "start": 3905380,
      "text": "It's a four. Yes.",
      "id": "ep_12_ut_183"
    },
    {
      "end": 3912004,
      "speaker": "Enrico Bertini",
      "start": 3907644,
      "text": "Yeah, I'm sad. We already reached about 1 hour.",
      "id": "ep_12_ut_184"
    },
    {
      "end": 3917628,
      "speaker": "Moritz Stefaner",
      "start": 3912164,
      "text": "Yeah. But we already telling us we should keep it short. So.",
      "id": "ep_12_ut_185"
    },
    {
      "end": 3920464,
      "speaker": "Enrico Bertini",
      "start": 3917716,
      "text": "Yeah, we are getting nervous.",
      "id": "ep_12_ut_186"
    },
    {
      "end": 3923684,
      "speaker": "Moritz Stefaner",
      "start": 3923164,
      "text": "Too much.",
      "id": "ep_12_ut_187"
    },
    {
      "end": 3927612,
      "speaker": "Alberto Cairo",
      "start": 3923724,
      "text": "Well, thank you for, thank you for having me. It was really a lot of fun.",
      "id": "ep_12_ut_188"
    },
    {
      "end": 3943100,
      "speaker": "Moritz Stefaner",
      "start": 3927748,
      "text": "Yeah. So great. And I enjoyed reading the book. I just read it quickly. So as Enrico. So I have to now read it properly again. But I really appreciate the perspective and I got, I drew quite a few things out of it already.",
      "id": "ep_12_ut_189"
    },
    {
      "end": 3954126,
      "speaker": "Enrico Bertini",
      "start": 3943172,
      "text": "So yeah, now I would like to hide myself in an island and have the time to read the book. The old book. Yeah. Page after page.",
      "id": "ep_12_ut_190"
    },
    {
      "end": 3958766,
      "speaker": "Moritz Stefaner",
      "start": 3954230,
      "text": "Well, if your visa takes longer, you have a lot of time to read.",
      "id": "ep_12_ut_191"
    },
    {
      "end": 3959674,
      "speaker": "Enrico Bertini",
      "start": 3958910,
      "text": "Yeah.",
      "id": "ep_12_ut_192"
    },
    {
      "end": 3967954,
      "speaker": "Alberto Cairo",
      "start": 3960774,
      "text": "I can give you some advice about visa, visa issues in the US, but we should do that out of the microphone.",
      "id": "ep_12_ut_193"
    },
    {
      "end": 3972918,
      "speaker": "Moritz Stefaner",
      "start": 3971574,
      "text": "It's gonna turn out fun.",
      "id": "ep_12_ut_194"
    },
    {
      "end": 3987184,
      "speaker": "Enrico Bertini",
      "start": 3973006,
      "text": "I don't know, I'm a little bit cautious. I've heard probably it's not true, but I've heard somewhere that two guys have been refused their visa just because they wrote something strange on Twitter. About their application process.",
      "id": "ep_12_ut_195"
    },
    {
      "end": 3995744,
      "speaker": "Alberto Cairo",
      "start": 3988964,
      "text": "You never know. You never know where Tony's actually tell you that. Be careful with what you write in social media.",
      "id": "ep_12_ut_196"
    },
    {
      "end": 3998388,
      "speaker": "Moritz Stefaner",
      "start": 3996204,
      "text": "Let's hope they don't listen to podcasts.",
      "id": "ep_12_ut_197"
    },
    {
      "end": 4006052,
      "speaker": "Alberto Cairo",
      "start": 3998516,
      "text": "Yeah, yeah, yeah, yeah. That's right. That's right. I should be careful myself. All right, guys, thank you so much.",
      "id": "ep_12_ut_198"
    },
    {
      "end": 4009644,
      "speaker": "Moritz Stefaner",
      "start": 4006148,
      "text": "Yeah, thanks. Thanks for coming. Yeah, was great.",
      "id": "ep_12_ut_199"
    },
    {
      "end": 4016876,
      "speaker": "Enrico Bertini",
      "start": 4009804,
      "text": "It was great. And I hope to see you in the US I hope to see you in the US sometime.",
      "id": "ep_12_ut_200"
    },
    {
      "end": 4018460,
      "speaker": "Alberto Cairo",
      "start": 4017060,
      "text": "Well, you are going to be closer.",
      "id": "ep_12_ut_201"
    },
    {
      "end": 4022684,
      "speaker": "Moritz Stefaner",
      "start": 4018492,
      "text": "Now, so two of you should meet. Definitely. Yeah, yeah.",
      "id": "ep_12_ut_202"
    },
    {
      "end": 4025156,
      "speaker": "Alberto Cairo",
      "start": 4022844,
      "text": "We've come down to Miami. The weather is much nicer.",
      "id": "ep_12_ut_203"
    },
    {
      "end": 4026304,
      "speaker": "Enrico Bertini",
      "start": 4025220,
      "text": "I'd love to.",
      "id": "ep_12_ut_204"
    },
    {
      "end": 4029684,
      "speaker": "Moritz Stefaner",
      "start": 4026964,
      "text": "You have to make a conference and talk to myself.",
      "id": "ep_12_ut_205"
    },
    {
      "end": 4030612,
      "speaker": "Alberto Cairo",
      "start": 4029844,
      "text": "That would be great.",
      "id": "ep_12_ut_206"
    },
    {
      "end": 4034270,
      "speaker": "Enrico Bertini",
      "start": 4030708,
      "text": "Sure, sure. Okay. Thank you, guys.",
      "id": "ep_12_ut_207"
    },
    {
      "end": 4035746,
      "speaker": "Moritz Stefaner",
      "start": 4034412,
      "text": "Thanks so much. Bye.",
      "id": "ep_12_ut_208"
    }
  ],
  "confidence": 0.924785478544852,
  "audio_duration": 4040,
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_status_code": null,
  "webhook_auth": false,
  "webhook_auth_header_name": null,
  "speed_boost": false,
  "auto_highlights_result": null,
  "auto_highlights": false,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_audio_quality": null,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "content_safety": false,
  "iab_categories": true,
  "content_safety_labels": {
    "status": "unavailable",
    "results": [],
    "summary": {}
  },
  "language_detection": false,
  "language_detection_threshold": null,
  "language_confidence": null,
  "custom_spelling": null,
  "throttled": false,
  "auto_chapters": true,
  "summarization": false,
  "summary_type": null,
  "summary_model": null,
  "custom_topics": false,
  "topics": [],
  "speech_threshold": null,
  "speech_model": "best",
  "chapters": [
    {
      "summary": "Hi, everyone. Data stories number twelve. How are you doing? You're still in Germany. We just finished the documentation for Emoto. And now I'm wrapping up my other project, which is a spin globe.",
      "gist": "Data Stories #12",
      "headline": "Hi, everyone. I Moritz, how are you doing",
      "start": 15800,
      "end": 145584,
      "id": "ep_12_ch_0"
    },
    {
      "summary": "We really love to have any kind of feedback from you guys. We also had that idea of doing an episode together with our listeners, right? We still have to test that. If any of you listening to the podcast has any information on how to do it properly, please let us know.",
      "gist": "Thanks for the Emails!",
      "headline": "We really love to have any kind of feedback from you guys",
      "start": 146044,
      "end": 207004,
      "id": "ep_12_ch_1"
    },
    {
      "summary": "Our guest today is Alberto Cairo. Just enjoying the weather here in Miami. Miami never rains in Miami, but it's always really warm. And we also got in touch about your new book. It's actually much longer than the original.",
      "gist": " Alberto Cairo on Talking to Students",
      "headline": "Alberto Cairo is our special guest for today's show",
      "start": 210024,
      "end": 323472,
      "id": "ep_12_ch_2"
    },
    {
      "summary": "Enrico is an instructor at the University of Miami at the School of Communication. All his career has been related to information graphics. Courses are creating courses on information design and courses about data journalism. A new trend, but it is growing, at least in the US.",
      "gist": "How to teach information visualization in the US",
      "headline": "Enrico Garcia is an instructor at the University of Miami on information graphics",
      "start": 323568,
      "end": 782166,
      "id": "ep_12_ch_3"
    },
    {
      "summary": "The book is structured into several parts. The first part is a broad introduction to both fields, to infographics and visualization. The second part is about cognitive science and how it relates to graphic design principles. The book is titled the functional art.",
      "gist": "The Book: The Functional Art",
      "headline": "How did you come about creating this book, writing its making",
      "start": 782350,
      "end": 1326894,
      "id": "ep_12_ch_4"
    },
    {
      "summary": "In the book, you don't really talk about statistics in depth or tools like how you types of programs you can use. The key point of the book is really about storytelling and constructing narratives. It may be aimed specifically at journalists and designers, although it can be read by data visualizers.",
      "gist": "In the Elevator: Stories in Statistics",
      "headline": "You don't really talk about statistics in depth in the book",
      "start": 1326974,
      "end": 1512744,
      "id": "ep_12_ch_5"
    },
    {
      "summary": "In a sense, the way I see information visualization is an interactive visualization. But you have still to develop, in my opinion, the storytelling side of the field. If we bring those two things together, if we learn from each other, I think that we will be much better off in the future.",
      "gist": "Information Visualization and Storytelling",
      "headline": "Information visualization is about presenting information and summarizing information",
      "start": 1512784,
      "end": 2113410,
      "id": "ep_12_ch_6"
    },
    {
      "summary": "Nobody can achieve what the New York Times does at the same level of quality. But there are smaller newsrooms and smaller teams who are also putting out wonderful work. In South America, there are several news publications who are pushing the envelope. Are there any interesting emerging new publications in the magazine world?",
      "gist": "Have we reached a tipping point in data journalism?",
      "headline": "There are smaller newspapers with smaller staffs producing wonderful graphics with limited resources",
      "start": 2113522,
      "end": 2359340,
      "id": "ep_12_ch_7"
    },
    {
      "summary": "In South America, Brazil, Argentina, Peru and other countries, newspapers are still selling relatively well. They start hiring programmers and developers and hackers. And I have that sense that now graphics are getting more experimental again. I am completely in favor of experimentation and using new graphic forms.",
      "gist": "Does data visualization have a strong trend in South America?",
      "headline": "Alberto: In South America, newspapers are still selling relatively well",
      "start": 2359372,
      "end": 2914078,
      "id": "ep_12_ch_8"
    },
    {
      "summary": "The Globe I'm building, it's in flash. It's the best technology, in fact, for that type of thing. Maybe Adobe will come up with something that looks like Flash but lets you explore in HTML five or something.",
      "gist": "\"I still love flash\"",
      "headline": "You still love flash, but it's smelling a bit funny",
      "start": 2914246,
      "end": 2977944,
      "id": "ep_12_ch_9"
    },
    {
      "summary": "The book is for students and also my peers in newsrooms and in graphic design. I believe that people from business intelligence and from data visualization could learn a little bit more about storytelling. Both worlds, I believe, can learn from each other.",
      "gist": "The Functional Art of Data Visualization",
      "headline": "What can other people coming from other backgrounds get from your book",
      "start": 2980004,
      "end": 3178024,
      "id": "ep_12_ch_10"
    },
    {
      "summary": "The visualization wheel is something that I developed for my own work to visualize my own graphics. It's not a very scientific tool. I would not recommend it to use it in research projects. What you have to do is to structure your graphics in layers.",
      "gist": "The Vatrix Wheel",
      "headline": "I really like the visualization wheel in your book",
      "start": 3178144,
      "end": 3332814,
      "id": "ep_12_ch_11"
    },
    {
      "summary": "How to tie in many annotations into a big visual and then have a few, you know, little graphs on the side. How do you make sure people read the important stuff first and then the details and how they navigate such a big page. That is not something that I invented. 90% of the things in the functional art were invented by someone else.",
      "gist": "In the Elevator: A Visual Hierarchy",
      "headline": "You describe the visual hierarchy of different graphics in your book",
      "start": 3333184,
      "end": 3409146,
      "id": "ep_12_ch_12"
    },
    {
      "summary": "Take advantage of small multiples. I don't usually try to tell the entire story through a single graphic form. Once, if you hit a wall there, it can be so much easier to split it up in two or three individual graphics.",
      "gist": "Using Small Multiples in Visualizations",
      "headline": "What you said about the structural information in several pieces or telling stories through various graphics",
      "start": 3409250,
      "end": 3601474,
      "id": "ep_12_ch_13"
    },
    {
      "summary": "There are certain people who cannot read graphics effectively. The more options you give readers, the more readers will get the information. The power of annotations in infographics is all about good annotations and labels. We should have an ongoing conversation.",
      "gist": "The power of annotations in infographics",
      "headline": "Moritz Costling: Different people read graphics differently",
      "start": 3603414,
      "end": 3923684,
      "id": "ep_12_ch_14"
    },
    {
      "summary": "Enrico: Now I would like to hide myself in an island and have the time to read the book. Be careful with what you write in social media. I can give you some advice about visa, visa issues in the US, but we should do that out of the microphone.",
      "gist": "Talking About Visas",
      "headline": "Enrico: I enjoyed reading the book very much",
      "start": 3923724,
      "end": 4002304,
      "id": "ep_12_ch_15"
    },
    {
      "summary": "All right, guys, thank you so much. Thanks for coming. I hope to see you in the US sometime. Now, so two of you should meet. I'd love to. You have to make a conference and talk to myself.",
      "gist": "Amino on Talking to People",
      "headline": "All right, guys, thank you so much. Thanks for coming. It was great. And I hope to see you in the US",
      "start": 4004044,
      "end": 4035746,
      "id": "ep_12_ch_16"
    }
  ],
  "disfluencies": false,
  "entity_detection": false,
  "sentiment_analysis": false,
  "sentiment_analysis_results": null,
  "entities": null,
  "speakers_expected": null,
  "summary": null,
  "custom_topics_results": null,
  "episode_num": 12,
  "episode_metadata": {
    "speakers": [
      "Enrico Bertini",
      "Moritz Stefaner",
      "Alberto Cairo"
    ],
    "WPid": "99",
    "url": "https://datastori.es/podlove/file/178/s/feed/c/mp3/datastories-12.mp3",
    "episode_title": "Alberto Cairo and \"The Functional Art\""
  }
}