{
  "id": "2be1004a-16d2-4404-a188-b1387d4e7296",
  "language_model": "assemblyai_default",
  "acoustic_model": "assemblyai_default",
  "language_code": "en_us",
  "status": "completed",
  "audio_url": "https://datastori.es/podlove/file/3610/s/feed/c/mp3/92-OddityViz-with-valentina-defilippo-and-miriam-quick.mp3",
  "utterances": [
    {
      "end": 15714,
      "speaker": "Valentina D’Efilippo",
      "start": 160,
      "text": "The starting point is a song, but usually when you approach a new task or a new brief in data visualization, you're either given a story that you want to represent with data or you're given a dataset and then you need to find the story. Right? In this case, we didn't have either.",
      "id": "ep_93_ut_0"
    },
    {
      "end": 63500,
      "speaker": "Moritz Stefaner",
      "start": 20214,
      "text": "Data stories is brought to you by click. Are you missing out on meaningful relationships hidden in your data? Unlock the whole story with Qlik sense through personalized visualizations and dynamic dashboards, which you can download for free at Qlik Datastories. That's Qlik Datastories. Hey everyone, it's a new data stories. Hi, Enrico.",
      "id": "ep_93_ut_1"
    },
    {
      "end": 64796,
      "speaker": "Enrico Bertini",
      "start": 63612,
      "text": "Hey, Moritz.",
      "id": "ep_93_ut_2"
    },
    {
      "end": 65932,
      "speaker": "Moritz Stefaner",
      "start": 64900,
      "text": "How are things?",
      "id": "ep_93_ut_3"
    },
    {
      "end": 67572,
      "speaker": "Enrico Bertini",
      "start": 66108,
      "text": "Good, good on my side.",
      "id": "ep_93_ut_4"
    },
    {
      "end": 68252,
      "speaker": "Moritz Stefaner",
      "start": 67668,
      "text": "Very nice.",
      "id": "ep_93_ut_5"
    },
    {
      "end": 80144,
      "speaker": "Enrico Bertini",
      "start": 68308,
      "text": "It's a beautiful day here in New York. We just had lots of snow yesterday and it's one of those amazing days with lots of sun. I love it. And it's Friday, so it's just perfect.",
      "id": "ep_93_ut_6"
    },
    {
      "end": 84812,
      "speaker": "Moritz Stefaner",
      "start": 81444,
      "text": "And it's another data store. Isn't it beautiful? Yeah.",
      "id": "ep_93_ut_7"
    },
    {
      "end": 87428,
      "speaker": "Enrico Bertini",
      "start": 84868,
      "text": "Yeah. That makes it even better.",
      "id": "ep_93_ut_8"
    },
    {
      "end": 98920,
      "speaker": "Moritz Stefaner",
      "start": 87516,
      "text": "Yeah. And we have two very special guests with a lovely project. The project is called OddityViz and we have Miriam Quick and Valentina d’Efilippo on the show.",
      "id": "ep_93_ut_9"
    },
    {
      "end": 100160,
      "speaker": "Valentina D’Efilippo",
      "start": 99032,
      "text": "Hi, guys.",
      "id": "ep_93_ut_10"
    },
    {
      "end": 103192,
      "speaker": "Enrico Bertini",
      "start": 100312,
      "text": "Hi. Hey there. Hi. Welcome on the show.",
      "id": "ep_93_ut_11"
    },
    {
      "end": 104432,
      "speaker": "Moritz Stefaner",
      "start": 103328,
      "text": "Good to have you on.",
      "id": "ep_93_ut_12"
    },
    {
      "end": 105840,
      "speaker": "Valentina D’Efilippo",
      "start": 104528,
      "text": "Thanks for inviting us.",
      "id": "ep_93_ut_13"
    },
    {
      "end": 107016,
      "speaker": "Miriam Quick",
      "start": 105912,
      "text": "Good to be on the show.",
      "id": "ep_93_ut_14"
    },
    {
      "end": 120080,
      "speaker": "Moritz Stefaner",
      "start": 107120,
      "text": "Yeah, it's a pleasure. Yeah, we said before already, it's a no brainer. It's such an interesting project, we just had to talk about it. So, Miriam, can you tell us a bit about you, what you do, what your background is?",
      "id": "ep_93_ut_15"
    },
    {
      "end": 151302,
      "speaker": "Miriam Quick",
      "start": 120192,
      "text": "Yeah, sure. So I am a researcher and a data journalist. I work on information design pieces. So I work with designers a lot. Everything from standard infographics, data visualizations, to the more kind of data art end of the spectrum. So I've been doing this for about five or six years and before that I actually did a PhD in music, in musicology. So that's the kind of background that I brought to this project was both in data and in information design.",
      "id": "ep_93_ut_16"
    },
    {
      "end": 153174,
      "speaker": "Moritz Stefaner",
      "start": 151358,
      "text": "So you went full circle basically.",
      "id": "ep_93_ut_17"
    },
    {
      "end": 159166,
      "speaker": "Miriam Quick",
      "start": 153294,
      "text": "Yeah. Yeah. I came back to music after a sort of five or six year break, which was really nice, actually.",
      "id": "ep_93_ut_18"
    },
    {
      "end": 173194,
      "speaker": "Moritz Stefaner",
      "start": 159270,
      "text": "Yeah, it's wonderful. And I think your profile is so interesting, like being a researcher specifically for infographics. I don't know anybody else who has this very, very narrow profile, but I think it makes so much sense and I wish there were more people.",
      "id": "ep_93_ut_19"
    },
    {
      "end": 182034,
      "speaker": "Miriam Quick",
      "start": 173694,
      "text": "Yeah, I guess it is quite niche, isn't it? I know maybe two other people who do my job and they're both really nice which is great.",
      "id": "ep_93_ut_20"
    },
    {
      "end": 184636,
      "speaker": "Enrico Bertini",
      "start": 182804,
      "text": "But I guess it's a good niche.",
      "id": "ep_93_ut_21"
    },
    {
      "end": 195124,
      "speaker": "Miriam Quick",
      "start": 184740,
      "text": "Yeah, it is a good niche to have. It's really interesting. It's continually interesting and you learn so much about the world and you get to meet so many interesting people. So I really like doing that.",
      "id": "ep_93_ut_22"
    },
    {
      "end": 198548,
      "speaker": "Moritz Stefaner",
      "start": 195204,
      "text": "Nice, nice. Valentina, how about you? What's your background?",
      "id": "ep_93_ut_23"
    },
    {
      "end": 301794,
      "speaker": "Valentina D’Efilippo",
      "start": 198636,
      "text": "Well, I'm a designer. And then putting a label in front of design is quite hard for me because I feel like I do so many different types of design. But I suppose summarize it a bit more is information design. So, yeah, I'm an information designer. Come from Italy. I've been living in London for ten years. I studied product design. I came to London and I actually landed my first job in advertising and I was an art director for about five years. So I worked for ad agencies and then slowly and not fully aware of it, I ended up working with data. Well, I kind of did a couple of self initiated projects that led me to a very nice opportunity a few years ago to actually create a book, all with data and infographics. This is the infographics history of the world, published by Harper Collins in 2013. There was a collaboration between myself and James Bohr, a data journalist that used to work for the Guardian for the Datablog. I guess that kind of cemented my profile into the database community and into the infographic world. So since then I kind of left the advertising field and I moved towards more like, what is interaction design based on data or experiential design? All around data editorial design that includes infographics and data visualization. So yeah, many different types of work, but kind of focused around information design and data visualization.",
      "id": "ep_93_ut_24"
    },
    {
      "end": 383234,
      "speaker": "Moritz Stefaner",
      "start": 302974,
      "text": "Nice. And for the project we are discussing today, the two of you teamed up, right. And came up with this really fascinating series of visualizations called auditiviz. And, yeah, let's try and describe a bit for our listeners what the project is about. So from what I gather, it's about David Bowie's song space oddity, very famous song. And you produce ten different visualizations highlighting different aspects of the song. So each of them is in the shape of a disc. I think that's the original piece, right? Our engraved plexi records. And yeah, each of these discs looks at a different aspect of the song, be it the rhythm or the content or the melody or the harmony, probably. So there's ten different lenses through which you can look at the song. And time always starts on top and then goes in a full circle. Like the full song is basically once around the clock on that record. And, yeah, they are very minimalistic in style. It's all black and white, monochrome, very clear shapes. Quite a unique style, I would say. Yeah. Did I forget something? Is it correct?",
      "id": "ep_93_ut_25"
    },
    {
      "end": 407936,
      "speaker": "Miriam Quick",
      "start": 383394,
      "text": "We also made posters to go along with the records. So you have the records and then you have the posters, which have, like, a copy of the record on them, and then a little bit of a key underneath so you can kind of translate the data visualization into something you can understand. And we also made an animation of the song as well, which uses elements, visual elements from the records and sets them to the music in real time.",
      "id": "ep_93_ut_26"
    },
    {
      "end": 415544,
      "speaker": "Moritz Stefaner",
      "start": 408130,
      "text": "So it sounds a bit like you started out saying, like, oh, let's visualize that song. And as you worked, it unfolded into something huge, right?",
      "id": "ep_93_ut_27"
    },
    {
      "end": 419820,
      "speaker": "Miriam Quick",
      "start": 416004,
      "text": "Yeah, exactly. It really ballooned and became this massive project.",
      "id": "ep_93_ut_28"
    },
    {
      "end": 440522,
      "speaker": "Moritz Stefaner",
      "start": 420012,
      "text": "Yeah, yeah, it sounds a bit like. And I saw it was exhibited, like, beginning of this year at a London based agency or the London branch of Widen+Kennedy. Yeah, it's quite a famous creative agency. And what was their role? Were they, like, sponsoring it in some form, or were they just, like, the exhibition venue?",
      "id": "ep_93_ut_29"
    },
    {
      "end": 474936,
      "speaker": "Valentina D’Efilippo",
      "start": 440618,
      "text": "Yes. So Whiting and Kennedy has got this kind of window or exhibition space that they use to exhibit internal project that they do in terms of R and D research, kind of like side project that the agency does, but they also sometimes offer the space to artists. And, yeah, we pitched the idea to them and they were excited about it, and they became kind of like our sponsor. We didn't get paid to do the work, but they were super generous. Generous and supportive in actually producing the work.",
      "id": "ep_93_ut_30"
    },
    {
      "end": 475720,
      "speaker": "Moritz Stefaner",
      "start": 475000,
      "text": "Nice. Yeah.",
      "id": "ep_93_ut_31"
    },
    {
      "end": 489872,
      "speaker": "Valentina D’Efilippo",
      "start": 475792,
      "text": "So we collaborated with Genevieve Shephard, the producer. Why didn't Kennedy? And she actually ended up being our curator. She really advised us throughout the process, and it was a wonderful experience.",
      "id": "ep_93_ut_32"
    },
    {
      "end": 503384,
      "speaker": "Miriam Quick",
      "start": 490008,
      "text": "Yeah, she did a great job. And we also collaborated on the animation with a guy called Mike Bronberg of Culture design, and he does a lot of generative animation, so he worked really hard on the code for the animation.",
      "id": "ep_93_ut_33"
    },
    {
      "end": 512344,
      "speaker": "Enrico Bertini",
      "start": 503504,
      "text": "Very nice. So can you tell us a little bit about why you started the project? What was the initial impetus? So how did it happen?",
      "id": "ep_93_ut_34"
    },
    {
      "end": 534416,
      "speaker": "Miriam Quick",
      "start": 512504,
      "text": "So we started, actually, over a year ago. I think we started round about, it was before Christmas 2015, that would have been. And we'd been working together on a commercial project, and we both really got on and we knew that we enjoyed working together. And I think we went out for lunch in Chinatown. Was it?",
      "id": "ep_93_ut_35"
    },
    {
      "end": 535162,
      "speaker": "Valentina D’Efilippo",
      "start": 534440,
      "text": "It was.",
      "id": "ep_93_ut_36"
    },
    {
      "end": 536926,
      "speaker": "Miriam Quick",
      "start": 535328,
      "text": "That took me out for lunch, which.",
      "id": "ep_93_ut_37"
    },
    {
      "end": 539206,
      "speaker": "Valentina D’Efilippo",
      "start": 536950,
      "text": "I think I still owe you for dumplings and beer.",
      "id": "ep_93_ut_38"
    },
    {
      "end": 539558,
      "speaker": "Miriam Quick",
      "start": 539270,
      "text": "Yes.",
      "id": "ep_93_ut_39"
    },
    {
      "end": 542150,
      "speaker": "Enrico Bertini",
      "start": 539606,
      "text": "There was a chemistry perfect mix.",
      "id": "ep_93_ut_40"
    },
    {
      "end": 720284,
      "speaker": "Miriam Quick",
      "start": 542262,
      "text": "Dumplings and beer. It's the source of all good ideas. We got chatting and we realized that we both wanted to work on something to do with music. And I'd obviously studied music, and I'd really felt that I hadn't done very many projects, very many information design projects on music, and I really wanted to do something that used data from music. Actually, as part of my PhD research, I had been analyzing recordings of performances by a classical composer called Anton Webern, and I'd been using some particular software to gather the data from recordings on things like timing and intonation. And I was quite keen to apply that to other types of music and also to collaborate with somebody who really had some amazing design skills and make something that was much more creative. So that was kind of where I was coming from. We did initially, I think we discussed working on a book together, and then we quickly realized that we didn't actually want to do a book. We wanted to do something that involved making data physical in some way. Creating physical objects out of sound was something that both really inspired us a lot. We weren't quite sure what we were going to do at first. We weren't sure what music we were going to use. And then David Bowie actually died in early 2016, in January 2016. And then Valentina got in touch with me and was like, why don't we do something about David Bowie? Because we'd both been listening to Bowie's music on loop after he died. It really brought back just what a great songwriter he is. And I thought that was a brilliant idea. So we decided to do something on Bowie, and I guess we knew that we wanted to be quite systematic in our approach. It was going to be, I guess we were thinking along the lines of, either we do one song, we look at one song in great detail, and we take many different approaches to that song of many different angles, or we look at many different songs using a particular methodology or set of criteria. Eventually, we settled on, let's just look at one song and let's look at it in lots and lots of different ways. You know, look at the melody and the rhythm and the harmony and the lyrics. So, yeah, then we chose space Oddity. And I think probably just because it was one of the most well known songs and we wanted to have something that people could relate to, something people would be able to, when they looked at what we'd made, they'd be able to somehow relate it to the remembered sound that they'd heard. And also because it was one of his biggest songs. It kind of broke him as an artist, and it's one of his really early, really works as well. So, yeah, that was our initial impetus for the project.",
      "id": "ep_93_ut_41"
    },
    {
      "end": 744038,
      "speaker": "Moritz Stefaner",
      "start": 720704,
      "text": "Yeah, great. Nice. And so you had the basic concept made sense. So how did you actually get started? Did you sketch a lot in the beginning, or did you gather the data first and then see what you can do with it visually? Did you do a lot of different experimentations, or was the basic direction clear idea right from the start? Like, how did the early design process go?",
      "id": "ep_93_ut_42"
    },
    {
      "end": 1000122,
      "speaker": "Valentina D’Efilippo",
      "start": 744126,
      "text": "Yeah, it was a journey, I would say, first of all, you kind of need to understand where to start because, you know, the starting point is a song. But usually when you approach a new task or a new briefing, data visualization, you're either given a story that you want to represent with data, or you're given a data set, and then you need to find a story. Right. That you want to represent. In this case, we didn't have either. We didn't have a story. We didn't have the data. We just had a song. So we kind of had to find our own data and our own stories. What do you want to visualize of this song? And, well, obviously, there were so many stories that we could possibly visualize, since the song comes with a very rich cultural connections, like, from the contextual time that it was created. So if you think about it, this is, like, 1969 is the first moon landing of humans. So this kind of context, historical context that is great is also very closely related to cinema because there is a really strong connection with Kubrick 2001 Space Odyssey, and they also informed the title of the song. So we started to kind of create this kind of, like, context around the song, as well as understand all the different elements that the song had. Narration, lyrics, repetition of the actual structure, the structure itself, the instrumentations. And then we kind of just went into this journey of getting lost into these many layers, trying to see if there was a way that we could possibly link them all together. So we came up with this system where everything was kind of connected by the time we thought, well, if we're going to break it down in so many different layers, how can the user then put these layers together? If we have a consistent way to represent time that is actually the five minutes and 20 seconds of the song, then you can easily draw connection between one layer and another and see what's going on and perhaps look at the lyrics and what part of instruments are playing in, what type of. What type of story has been told throughout. So, yeah, that's kind of like the journey that we went through. And obviously, once the data was collected. So let's say we decided to look into instrumentations. Once Miriam actually collided all this material into an excel sheet, then we had to define how we're going to visualize it. So the actual visual language of each data visualization. And I wanted to kind of create a cohesive language but keep a diverse look. So I wanted every output to be different, you know, to look different. And then I suppose, like, the initial research of, like, all these contexts and the references and inspiration, they really gave me this grounded approach of our direction. And this is possible, like how I inform all my projects. I try to get inspiration from the material that I'm working with and trying to use that to inform my style or to inform the way that the data visualization is going to look like. So looking at space travel, looking at the moon landing, looking at Kubrick, I started to develop these very minimal, bold a bit, maybe, I don't know, cinematic look and feel like black and white, light on the dark, to refer to space. Yeah. And I suppose, like, giving myself these sort of guidelines and quite a stronger direction guided me throughout the process, hopefully keeping the outcome consistent in a way.",
      "id": "ep_93_ut_43"
    },
    {
      "end": 1018486,
      "speaker": "Moritz Stefaner",
      "start": 1000218,
      "text": "Yeah. It's kind of interesting how you introduce your own constraints, like, in the absence of external constraints, then as a designer, you set your own flag pose and say, like, okay, has to be black and white. Yeah. But otherwise you have no chance in tackling such a complex issue.",
      "id": "ep_93_ut_44"
    },
    {
      "end": 1047899,
      "speaker": "Valentina D’Efilippo",
      "start": 1018550,
      "text": "It's so broad. Right. You need to kind of, like, guide you through the process and almost like, write a brief for yourself. And I suppose also when we decided that the physical output was actually going to be this engraved disc, that really narrowed down even more the options that we had because we knew that was going to be concentric, we knew that he had to be a twelve inch disc. Yeah. So basically.",
      "id": "ep_93_ut_45"
    },
    {
      "end": 1051043,
      "speaker": "Moritz Stefaner",
      "start": 1048051,
      "text": "But all that also helps in just making a decision, right?",
      "id": "ep_93_ut_46"
    },
    {
      "end": 1051907,
      "speaker": "Valentina D’Efilippo",
      "start": 1051083,
      "text": "Yeah, exactly.",
      "id": "ep_93_ut_47"
    },
    {
      "end": 1054027,
      "speaker": "Moritz Stefaner",
      "start": 1051995,
      "text": "Then, you know, it's twelve inch. Okay, fine.",
      "id": "ep_93_ut_48"
    },
    {
      "end": 1057307,
      "speaker": "Valentina D’Efilippo",
      "start": 1054075,
      "text": "Yeah, I can work with that. I can work with that. Exactly.",
      "id": "ep_93_ut_49"
    },
    {
      "end": 1108056,
      "speaker": "Enrico Bertini",
      "start": 1057395,
      "text": "Yeah. And I really like also the fact that you very early on decided to go in depth with one single song. I tend to like a lot projects that focus on a very specific thing, but going in depth, I think that that's somewhat rare. I like it a lot. So one thing that I want to touch upon is more on the data generation step, as you mentioned at the beginning. I mean, you started the project, but you didn't really have data. And that's, I think, another interesting trend. Some of the best projects out there seems to be projects that don't start with data, but start with a very initial, very good initial concept or idea. That's definitely one of those cases. But in this case, generating data is pretty hard, I guess. So what did you do?",
      "id": "ep_93_ut_50"
    },
    {
      "end": 1116608,
      "speaker": "Miriam Quick",
      "start": 1108160,
      "text": "Well, actually, most of the data was gathered by ear. I actually just sat down and I listened to the song again and again.",
      "id": "ep_93_ut_51"
    },
    {
      "end": 1117720,
      "speaker": "Enrico Bertini",
      "start": 1116656,
      "text": "Are you serious?",
      "id": "ep_93_ut_52"
    },
    {
      "end": 1121704,
      "speaker": "Miriam Quick",
      "start": 1117912,
      "text": "Yeah, I'm serious. It was based on close listening.",
      "id": "ep_93_ut_53"
    },
    {
      "end": 1122016,
      "speaker": "Moritz Stefaner",
      "start": 1121744,
      "text": "Wow.",
      "id": "ep_93_ut_54"
    },
    {
      "end": 1124096,
      "speaker": "Enrico Bertini",
      "start": 1122080,
      "text": "How many hours did you spend on that?",
      "id": "ep_93_ut_55"
    },
    {
      "end": 1150116,
      "speaker": "Miriam Quick",
      "start": 1124200,
      "text": "A really long time, particularly for one of the records, which I'll talk about in a second. But yeah, in general, most of the records were actually just me sitting down and listening to the song, or listening to certain passages of the song again and again and writing down the chord structure or writing down, you know, here are the notes in the melody line and putting them in a spreadsheet. For Valentina, I did experiment with software.",
      "id": "ep_93_ut_56"
    },
    {
      "end": 1153304,
      "speaker": "Valentina D’Efilippo",
      "start": 1150180,
      "text": "You guys need to take a look at the data. It's amazing.",
      "id": "ep_93_ut_57"
    },
    {
      "end": 1156724,
      "speaker": "Miriam Quick",
      "start": 1154124,
      "text": "We can share it with you if you like. I think it's online, actually.",
      "id": "ep_93_ut_58"
    },
    {
      "end": 1157428,
      "speaker": "Valentina D’Efilippo",
      "start": 1156764,
      "text": "Yeah, it's online.",
      "id": "ep_93_ut_59"
    },
    {
      "end": 1165606,
      "speaker": "Miriam Quick",
      "start": 1157516,
      "text": "It is? Yeah. If you go to our website, which is OddityViz.com, there's a link from there to a public data sheet so you can go and check out the data for yourself.",
      "id": "ep_93_ut_60"
    },
    {
      "end": 1167690,
      "speaker": "Enrico Bertini",
      "start": 1165740,
      "text": "Oh, that's beautiful. Fantastic.",
      "id": "ep_93_ut_61"
    },
    {
      "end": 1171082,
      "speaker": "Moritz Stefaner",
      "start": 1167722,
      "text": "We will link it and maybe people will start to remix it even. Who knows?",
      "id": "ep_93_ut_62"
    },
    {
      "end": 1305560,
      "speaker": "Miriam Quick",
      "start": 1171138,
      "text": "Yeah, yeah. They might make new things, new visualizations out of it. So yeah, I'd say most of it was, was pretty manual a lot. Some of it was actually gathered using a kind of semi manual method. So there is a tool that I used a lot in my PhD research called Sonic Visualizer, which is a really good kind of open source tool that was developed by the Geiser Queen Mary University of London. And it's very good for musical analysis. So you can feed an audio track into it. And then one of the things you can do with it is actually extract timing data from performances. And the way that you do that is you play the music, and as the music is playing, you tap on a keyboard every time you hear a beat or a bar or a particular melody note or whatever it is that you're tracking. Then you can manually adjust the taps so that they, they form lines on the waveform on the screen until they fit with the waveform image. And also you play them back in the tap because at the same time is the bit of the audio you want to capture. Then you simply extract that data as a kind of text file. So you have a concrete record in data of a particular performance. So if the musician speeds up or slows down, you have that timing data, and you can then obviously plot that. So it's a really cool tool. And I used that for the rhythm record, which was the one that looks only at the bass and drums part. And that was particularly labor intensive to gather the data for. I think that was probably the most difficult one because I had to go through and literally tap every single bass note, every single drum hit in space oddity, and then get all the taps correct and then export the data. So that took quite a few days. And Valentina actually gathered the data for one of the records, which was the. The lyrics record, which has got these word trees showing the grammatical structure of each of the lines in the lyrics. And it looks really beautiful. And I'm totally in awe because she studied grammar at school and she can actually do this stuff, and I didn't study grammar at school, and I can't do it. So I think it's fantastic.",
      "id": "ep_93_ut_63"
    },
    {
      "end": 1314208,
      "speaker": "Enrico Bertini",
      "start": 1305672,
      "text": "So is there any good software out there to, say, automatically extract some information out of audio track?",
      "id": "ep_93_ut_64"
    },
    {
      "end": 1330656,
      "speaker": "Miriam Quick",
      "start": 1314376,
      "text": "There is, yeah. There is plenty of plugins for sonic visualizer. However, I found them to be of variable quality. Yeah, it actually took less time to just do it myself by ear than it would have used. Taken to use those plugins.",
      "id": "ep_93_ut_65"
    },
    {
      "end": 1332384,
      "speaker": "Moritz Stefaner",
      "start": 1330680,
      "text": "You need to check it anyways. Right?",
      "id": "ep_93_ut_66"
    },
    {
      "end": 1409184,
      "speaker": "Miriam Quick",
      "start": 1332504,
      "text": "Exactly. Yeah. So it becomes manual. I think there are other tools that you can use. There's one called melodyne, which I believe is quite powerful. I don't actually have it, but I think you can use it to extract pitch data from polyphonic recordings. So recordings that have got more than one part, and that's quite cool, but I haven't actually experimented with that. I guess the final record was slightly different because it was actually gathering data from people. We asked people, we asked 36 of our friends. We basically just sent an email around to all our friends and said, will you listen to David Bowie's space Oddity? And here's a chart that you can plot your emotional response to the song on it. So we got them to basically draw a line in pencil or on a PDF or whatever, and then we had to somehow get that data and analyze it. And I think we. What did we do? Trace the lines? And then we used one of those tools, those kind of online tools, to export an image into a data file. Then I interpolated some points in r, and then I found the mean emotional reading per second. So that was about as technical as it ever got.",
      "id": "ep_93_ut_67"
    },
    {
      "end": 1414780,
      "speaker": "Moritz Stefaner",
      "start": 1410004,
      "text": "Yeah, it's kind of a crazy process, but whatever works. I mean.",
      "id": "ep_93_ut_68"
    },
    {
      "end": 1434214,
      "speaker": "Miriam Quick",
      "start": 1414852,
      "text": "Yeah, well, we didn't want to make it too difficult for people to actually gather the data. We wanted to make it as intuitive as possible. But we did find. You know, actually, we did it as well. We gathered data from ourselves and we found it very hard to actually draw an accurate line on a piece of paper while listening and get the time right. Yeah, it's quite difficult.",
      "id": "ep_93_ut_69"
    },
    {
      "end": 1441614,
      "speaker": "Moritz Stefaner",
      "start": 1436154,
      "text": "So you have been listening to that song, like, 100 or a thousand times, right?",
      "id": "ep_93_ut_70"
    },
    {
      "end": 1444490,
      "speaker": "Miriam Quick",
      "start": 1441954,
      "text": "Studying it quite a bit, yes.",
      "id": "ep_93_ut_71"
    },
    {
      "end": 1454210,
      "speaker": "Moritz Stefaner",
      "start": 1444642,
      "text": "Some things you only learned through that meditation on the song or through that analysis. Are there any new things about the song you unveiled?",
      "id": "ep_93_ut_72"
    },
    {
      "end": 1467324,
      "speaker": "Miriam Quick",
      "start": 1454362,
      "text": "Yeah, definitely. I would say that I. It is a really, really good song. And if it hadn't been such a good song, I would have got really bored of it. I did get quite bored of listening to the bass and drums part by itself because that's not as satisfying as listening to the whole song.",
      "id": "ep_93_ut_73"
    },
    {
      "end": 1468480,
      "speaker": "Moritz Stefaner",
      "start": 1467784,
      "text": "Okay.",
      "id": "ep_93_ut_74"
    },
    {
      "end": 1522424,
      "speaker": "Miriam Quick",
      "start": 1468592,
      "text": "Yeah. I mean, in terms of insights, it definitely learned a lot about how it works, about the instrumentation. You know, it's a very, very unusual song. There's an awfully broad number of instruments. You've got a couple of flutes in there. You've got a whole string section. You've got the lead guitar and the bass guitar and the drums, as usual. And then you've got really quite an unusual structure to it. So it's got quite a weird verse. Most songs sort of go, verse, chorus, verse, chorus, break chorus, and then fade out. This is not like that at all. It has a very unusual chorus that isn't really a chorus. It sort of goes here, am I singing in a tin can? But it's a bit of a letdown moment right at the point where you think you're going to get a chorus. So I really enjoyed delving into the whole structure of it to kind of see why it works as well as it does.",
      "id": "ep_93_ut_75"
    },
    {
      "end": 1541644,
      "speaker": "Enrico Bertini",
      "start": 1522764,
      "text": "So one thing I wanted to ask you is, did you. So, one thing that happens to me all the time is that I discover a song that I really, really love. But I know that if I listen to it for too long, I'm gonna like it less. There is a decay function there of some sort. So I try to balance it, portion.",
      "id": "ep_93_ut_76"
    },
    {
      "end": 1544148,
      "speaker": "Moritz Stefaner",
      "start": 1541684,
      "text": "It only, like, five times a week. Yes.",
      "id": "ep_93_ut_77"
    },
    {
      "end": 1567092,
      "speaker": "Enrico Bertini",
      "start": 1544196,
      "text": "Kind of like. No, I don't. I mean, I love it, but I don't want to hear it. It too much. Did you have anything like that in this case? I don't know. Maybe this happens only to me. I actually realized that I never has that to somebody, but this happens to me. I fall in total love with one song. I keep listening to it for days, and then it's just too much.",
      "id": "ep_93_ut_78"
    },
    {
      "end": 1584684,
      "speaker": "Miriam Quick",
      "start": 1567228,
      "text": "Yeah, I get that as well. But I think for me, the relationship with the song changes. So rather than it being about and it becomes more analytical, I think your relationship with the music, because you start to pay really close attention to really small aspects of it and less attention to the overall impression.",
      "id": "ep_93_ut_79"
    },
    {
      "end": 1587164,
      "speaker": "Moritz Stefaner",
      "start": 1584764,
      "text": "That's a new level of overthinking a song.",
      "id": "ep_93_ut_80"
    },
    {
      "end": 1591412,
      "speaker": "Miriam Quick",
      "start": 1587284,
      "text": "Exactly. Yeah. But if it's worth overthinking, then that's time well spent, I think.",
      "id": "ep_93_ut_81"
    },
    {
      "end": 1592388,
      "speaker": "Moritz Stefaner",
      "start": 1591508,
      "text": "Yeah, true.",
      "id": "ep_93_ut_82"
    },
    {
      "end": 1595784,
      "speaker": "Valentina D’Efilippo",
      "start": 1592436,
      "text": "For me, it happened while I was actually animating the song.",
      "id": "ep_93_ut_83"
    },
    {
      "end": 1597196,
      "speaker": "Miriam Quick",
      "start": 1596724,
      "text": "Yeah.",
      "id": "ep_93_ut_84"
    },
    {
      "end": 1602554,
      "speaker": "Valentina D’Efilippo",
      "start": 1597260,
      "text": "So, like, the time just spent listening the same 2 seconds.",
      "id": "ep_93_ut_85"
    },
    {
      "end": 1603142,
      "speaker": "Enrico Bertini",
      "start": 1602724,
      "text": "Yeah.",
      "id": "ep_93_ut_86"
    },
    {
      "end": 1605958,
      "speaker": "Valentina D’Efilippo",
      "start": 1603198,
      "text": "While it was rendering, it was quite painful.",
      "id": "ep_93_ut_87"
    },
    {
      "end": 1607446,
      "speaker": "Enrico Bertini",
      "start": 1606126,
      "text": "Yeah, I can imagine.",
      "id": "ep_93_ut_88"
    },
    {
      "end": 1610886,
      "speaker": "Valentina D’Efilippo",
      "start": 1607550,
      "text": "It was a good thing that we pick, actually our favorite song, though.",
      "id": "ep_93_ut_89"
    },
    {
      "end": 1635220,
      "speaker": "Enrico Bertini",
      "start": 1611030,
      "text": "Yeah, yeah, yeah, yeah. You don't want to ruin your favorite song that way. So another aspect of the project I'm curious about is how did you decide on the presentation form? Right, so you said you created, in the end, you created posters and these engraved discs. So how did you decide decide on that?",
      "id": "ep_93_ut_90"
    },
    {
      "end": 1656396,
      "speaker": "Valentina D’Efilippo",
      "start": 1635372,
      "text": "I guess the initial direction was actually to resemble the physical nature of music. So if you think about the way the music is being recorded from, I don't know, Edison phonograph to the most recent vinyl, it's always been capturing the data through these engraved grooves right on the vinyl.",
      "id": "ep_93_ut_91"
    },
    {
      "end": 1659068,
      "speaker": "Moritz Stefaner",
      "start": 1656580,
      "text": "It's actually a visualization of the song, if you.",
      "id": "ep_93_ut_92"
    },
    {
      "end": 1825672,
      "speaker": "Valentina D’Efilippo",
      "start": 1659116,
      "text": "Yeah. So there's actually data. Yeah. And was basically that the starting point of creating this set of ten discs where you don't play them, but you need to decode them visually. So you kind of go into this new sphere of perception that becomes more experiential, I suppose. Right. Because you listen to the music, but you also see it. And then. So that was kind of like the core aspect of the project. And then when we actually were offered the opportunity to do this installation with Widen+Kennedy, and we were offered the window as well, the gallery space inside. We were like, wow, we've got all this space, we need to fill it. No, it wasn't just that can't just be a website. Yeah, but, yeah, obviously the records by themselves, they're a bit abstract. Right. Unless you have the key and legend and all the information to be able to decode and to extract the data visualization and to read it, they are just abstract pieces. So we created this poster to keep this cohesive visual language of just black and white. So we actually use beautiful white ink printed on black paper for these large scale prints. And then we also decided to embark on this quite ambitious thing of creating an animation. So I remember sitting down with the rest of the team. So Miriam, probably on Skype and Widen+Kennedy, we had Mike Naiman and Genevieve Sheppard, and we were brainstorming what this window should have been, and somebody came up with idea, what if we actually have a projection and the records are brought to life? And I was like, yeah, this is great, but let's please not go down this route, because it means, like, not two weeks worth of work, it means two months worth of work. But obviously, everybody fall in love with the idea of actually seeing the music. I mean, listening to the music and seeing the visual, reacting to the music, and not being a developer myself, not being a coder, I did try to explore how to use processing in the process of actually creating the data visualization. But I actually got quite frustrated by the fact that because I was beginner, I was learning by taking tutorials. So breaking free from the templates was actually quite hard. So what I ended up was just replicating what other people had already done, and I didn't want to do that.",
      "id": "ep_93_ut_93"
    },
    {
      "end": 1834864,
      "speaker": "Moritz Stefaner",
      "start": 1825728,
      "text": "And, like, real time visuals based on music. There's a huge tradition there, right? Like with all the different iTunes plugins and all the different VJ things?",
      "id": "ep_93_ut_94"
    },
    {
      "end": 1836752,
      "speaker": "Valentina D’Efilippo",
      "start": 1834944,
      "text": "Yeah, and there are a lot of things available.",
      "id": "ep_93_ut_95"
    },
    {
      "end": 1838336,
      "speaker": "Moritz Stefaner",
      "start": 1836848,
      "text": "That's a whole new game, right?",
      "id": "ep_93_ut_96"
    },
    {
      "end": 1931664,
      "speaker": "Valentina D’Efilippo",
      "start": 1838400,
      "text": "Yeah, and there are a lot of plugins, and even with processing, you can do, like, great stuff, and there are lots of tutorial, but it's quite hard to then manipulate the code to actually create your own visualization. And I didn't want the animation just to look like somebody's else work, you know, but just plugging in our data. So I reached out to Mike Bronberg, who is an excellent coder. He works with processing, and, yeah, we collaborated together to do this piece. I did part of the animation in after effects, and he did all the reacting symbol to the sound of the music in processing. And it was a very good collaboration. Although on my side, the process of actually learning didn't stop because after effects was exactly like my preferred tool either. I did use it in the past when very limited scale, and being an art director, you kind of like, used to create your storyboards and then have a team, they actually execute your vision and they execute it usually even better than what your vision is. While here, I had my vision, I had my beautiful storyboard. But then I didn't have the actual skills to execute it. It was quite challenging and frustrated, but I took on the challenge and with the support of lots of YouTube tutorials, I did manage.",
      "id": "ep_93_ut_97"
    },
    {
      "end": 1934650,
      "speaker": "Miriam Quick",
      "start": 1932394,
      "text": "She did a really good job. So there you go.",
      "id": "ep_93_ut_98"
    },
    {
      "end": 1935374,
      "speaker": "Enrico Bertini",
      "start": 1934722,
      "text": "Yeah.",
      "id": "ep_93_ut_99"
    },
    {
      "end": 1967886,
      "speaker": "Moritz Stefaner",
      "start": 1935914,
      "text": "So we will definitely embed the video in the blog post or link to the website so you can take a look yourself, judge for yourself. But I also quite like it. So I think you're just being modest. So we should wrap up soon. But one last question, like if you could go back and change something, or like what's the thing you learned during the project that you didn't expect would turn out to be an issue or turn out to be like complicated? Or is there something that also positively surprised you during the project runtime?",
      "id": "ep_93_ut_100"
    },
    {
      "end": 2047880,
      "speaker": "Miriam Quick",
      "start": 1967950,
      "text": "Oh, I think probably if it were to go back and do it again, I think we would probably both try and do a song that was a little bit more obscure or was out of copyright. Because copyright is an issue when working with music, particularly when you're working with music by a major artist like David Bowie and UK copyright law. I mean, copyright law everywhere is pretty stringent, but in the UK you have sound recordings that are actually protected for 70 years from the end of the year in which the work was first released. So David Bowie is still well within copyright. But equally, you know, if you were going to do it that you would want to go for a song that you really love because you are going to be listening to it a lot. So I guess one avenue that it would have been really cool to have done but we didn't really have time, but was to create 3d printed objects out of the. The same data we did. Valentina looked into this option, but we really ran out of time. But it would be nice to have something that was really. And budget. Yes, of course there was something that was in 3d space. You know, we thought about visualizing the waveform. One of the discs looks at the waveform of the eight separate master tracks and we thought that would make a really cool 3d object with the different kind of waveforms actually textured in space.",
      "id": "ep_93_ut_101"
    },
    {
      "end": 2082736,
      "speaker": "Valentina D’Efilippo",
      "start": 2047992,
      "text": "Yeah. And I think if I have to add on this, on the learning of this experience, I think. I think managing the time was a very challenging thing, especially being a side project. Actually finding the time after work so in the evenings or blocking a day every week was tough, but it was very important. And having a deadline, knowing that we wanted to release something for the first year anniversary was also very important. Otherwise could have easily be gonna for like two or three years, and then.",
      "id": "ep_93_ut_102"
    },
    {
      "end": 2087024,
      "speaker": "Moritz Stefaner",
      "start": 2082760,
      "text": "You have like 30 discs and 3d prints and holograms.",
      "id": "ep_93_ut_103"
    },
    {
      "end": 2087904,
      "speaker": "Miriam Quick",
      "start": 2087064,
      "text": "Where do you stop?",
      "id": "ep_93_ut_104"
    },
    {
      "end": 2088924,
      "speaker": "Valentina D’Efilippo",
      "start": 2087984,
      "text": "Exactly.",
      "id": "ep_93_ut_105"
    },
    {
      "end": 2109834,
      "speaker": "Moritz Stefaner",
      "start": 2090064,
      "text": "And a little space rocket. That's a really good tip. Is like one. Like, I think that's so interesting about this project is that you started, like, self initiated, but then by creating this context around it, suddenly that forces you into being productive and on point. I think that's really a good tip.",
      "id": "ep_93_ut_106"
    },
    {
      "end": 2164836,
      "speaker": "Valentina D’Efilippo",
      "start": 2110294,
      "text": "And I think for me, it was also very important to dive in a new field to learn something new. So learn something new with any personal project that you do, I think is quite important, whether it's a skill or the field that you're actually exploring. And also, I think I learned to dare a bit more. So we tend to be quite shy. And especially maybe with a project like this, if we would have just put it online and we're both not very shouty on our social media, it would have probably just hit a dead wall. But actually having the opportunity with Widen+Kennedy, it made it a bigger thing. All of the sudden it became actually a project that blogs picked up on. So the fact that we actually dared to pitch it to this big advertising agency was a really good, smart.",
      "id": "ep_93_ut_107"
    },
    {
      "end": 2183228,
      "speaker": "Moritz Stefaner",
      "start": 2164940,
      "text": "Yeah, very good. Cool. Thanks so much for coming. I think we need to wrap it up, but you can follow the project on Twitter, on Instagram. You should check out the website. There's loads of documentation. We are still in the process of learning about one new record every week. Is it?",
      "id": "ep_93_ut_108"
    },
    {
      "end": 2188396,
      "speaker": "Miriam Quick",
      "start": 2183316,
      "text": "Yeah, every Wednesday we upload a new description of the record. I think we're in number five at the moment.",
      "id": "ep_93_ut_109"
    },
    {
      "end": 2210844,
      "speaker": "Moritz Stefaner",
      "start": 2188540,
      "text": "Yeah, yeah. There's loads of documentation around, like the individual pieces, but also the motivation behind the project and the video and everything. So lots of stuff and photos from the exhibition and so on. And in case you happen to be around Milan early March, I think. March, is it? Eleven, 1012, something like this? Yeah.",
      "id": "ep_93_ut_110"
    },
    {
      "end": 2211228,
      "speaker": "Valentina D’Efilippo",
      "start": 2210924,
      "text": "Yes.",
      "id": "ep_93_ut_111"
    },
    {
      "end": 2222220,
      "speaker": "Moritz Stefaner",
      "start": 2211276,
      "text": "There's a visualize conference. Visualize is a great conference series. You might have seen the Berlin or the New York events. And, yeah, Valentina will present the project there.",
      "id": "ep_93_ut_112"
    },
    {
      "end": 2225286,
      "speaker": "Valentina D’Efilippo",
      "start": 2222252,
      "text": "So you go, please come and say hi and.",
      "id": "ep_93_ut_113"
    },
    {
      "end": 2230398,
      "speaker": "Moritz Stefaner",
      "start": 2225350,
      "text": "Yeah, exactly. So that's a great opportunity. Thanks so much for coming.",
      "id": "ep_93_ut_114"
    },
    {
      "end": 2231718,
      "speaker": "Valentina D’Efilippo",
      "start": 2230486,
      "text": "Thanks for having us, guys.",
      "id": "ep_93_ut_115"
    },
    {
      "end": 2232334,
      "speaker": "Miriam Quick",
      "start": 2231766,
      "text": "Thank you.",
      "id": "ep_93_ut_116"
    },
    {
      "end": 2233798,
      "speaker": "Moritz Stefaner",
      "start": 2232414,
      "text": "And it's a lovely project.",
      "id": "ep_93_ut_117"
    },
    {
      "end": 2236834,
      "speaker": "Enrico Bertini",
      "start": 2233926,
      "text": "Thanks so much. That's a lovely, lovely project.",
      "id": "ep_93_ut_118"
    },
    {
      "end": 2238278,
      "speaker": "Miriam Quick",
      "start": 2237534,
      "text": "Thank you.",
      "id": "ep_93_ut_119"
    },
    {
      "end": 2241182,
      "speaker": "Moritz Stefaner",
      "start": 2238366,
      "text": "Thank you. Shall we risk playing the song now?",
      "id": "ep_93_ut_120"
    },
    {
      "end": 2241678,
      "speaker": "Enrico Bertini",
      "start": 2241238,
      "text": "Yeah, maybe.",
      "id": "ep_93_ut_121"
    },
    {
      "end": 2242246,
      "speaker": "Moritz Stefaner",
      "start": 2241726,
      "text": "Can we do that?",
      "id": "ep_93_ut_122"
    },
    {
      "end": 2249202,
      "speaker": "Enrico Bertini",
      "start": 2242270,
      "text": "Yeah, I think we should. Yeah, yeah, absolutely. We can sing it as well. Yeah.",
      "id": "ep_93_ut_123"
    },
    {
      "end": 2251354,
      "speaker": "Moritz Stefaner",
      "start": 2249338,
      "text": "Next time I bring my guitar.",
      "id": "ep_93_ut_124"
    },
    {
      "end": 2257922,
      "speaker": "Enrico Bertini",
      "start": 2251434,
      "text": "Ground control to your tongue. Okay. Bye. Bye.",
      "id": "ep_93_ut_125"
    },
    {
      "end": 2258570,
      "speaker": "Moritz Stefaner",
      "start": 2257978,
      "text": "Very good.",
      "id": "ep_93_ut_126"
    },
    {
      "end": 2259026,
      "speaker": "Enrico Bertini",
      "start": 2258642,
      "text": "Thank you.",
      "id": "ep_93_ut_127"
    },
    {
      "end": 2259658,
      "speaker": "Moritz Stefaner",
      "start": 2259050,
      "text": "Thanks so much.",
      "id": "ep_93_ut_128"
    },
    {
      "end": 2260434,
      "speaker": "Valentina D’Efilippo",
      "start": 2259746,
      "text": "Bye, guys.",
      "id": "ep_93_ut_129"
    },
    {
      "end": 2261074,
      "speaker": "Moritz Stefaner",
      "start": 2260514,
      "text": "Bye bye.",
      "id": "ep_93_ut_130"
    },
    {
      "end": 2261914,
      "speaker": "Miriam Quick",
      "start": 2261154,
      "text": "Bye bye.",
      "id": "ep_93_ut_131"
    },
    {
      "end": 2287034,
      "speaker": "Moritz Stefaner",
      "start": 2262034,
      "text": "Ground control to Major Tom, ground control to Major Tom. Take your protein pills and put your helmet on ten. Ground control to major tors.",
      "id": "ep_93_ut_132"
    },
    {
      "end": 2290334,
      "speaker": "Miriam Quick",
      "start": 2287854,
      "text": "Seven, six.",
      "id": "ep_93_ut_133"
    },
    {
      "end": 2317004,
      "speaker": "Moritz Stefaner",
      "start": 2290494,
      "text": "Commencing countdown engines on three, two, check ignition and may God's love be with you. Data stories.",
      "id": "ep_93_ut_134"
    },
    {
      "end": 2332954,
      "speaker": "Enrico Bertini",
      "start": 2325384,
      "text": "Hey guys, thanks for listening to data stories again. Before you leave, here are a few ways you can support the show and get in touch with us.",
      "id": "ep_93_ut_135"
    },
    {
      "end": 2347650,
      "speaker": "Moritz Stefaner",
      "start": 2333034,
      "text": "First, we have a page on Patreon where you can contribute an amount of your choosing per episode. As you can imagine, we have some costs for running the show and we would love to make it a community driven project. You can find the page@patreon.com Datastories and.",
      "id": "ep_93_ut_136"
    },
    {
      "end": 2358274,
      "speaker": "Enrico Bertini",
      "start": 2347682,
      "text": "If you can spend a couple of minutes rating us on iTunes, that would be extremely helpful for the show. Just search us in iTunes store or follow the link in our website.",
      "id": "ep_93_ut_137"
    },
    {
      "end": 2382824,
      "speaker": "Moritz Stefaner",
      "start": 2358614,
      "text": "And we also want to give you some information on the many ways you can get news directly from us. We're, of course, on twitter@twitter.com. Datastories. But we also have a Facebook page@Facebook.com, datastoriespodcast and we also have a newsletter. So if you want to get news directly into your inbox, go to our homepage data stories and look for the link that you find in the and.",
      "id": "ep_93_ut_138"
    },
    {
      "end": 2404016,
      "speaker": "Enrico Bertini",
      "start": 2382864,
      "text": "Finally, you can also chat directly with us and other listeners. Using Slack again, you can find a button to sign up at the bottom of our page. And we do love to get in touch with our listeners. So if you want to suggest a way to improve the show or know amazing people you want us to invite or projects you want us to talk about, let us know.",
      "id": "ep_93_ut_139"
    },
    {
      "end": 2431644,
      "speaker": "Moritz Stefaner",
      "start": 2404120,
      "text": "That's all for now. See you next time, and thanks for listening to Datastories. Datastories is brought to you by click. Are you missing out on meaningful relationships hidden in your data? Unlock the whole story with Qlik sense through personalized visualizations and dynamic dashboards, which you can download for free at Qlik.de/datastories . That's Qlik.de/datastories.",
      "id": "ep_93_ut_140"
    }
  ],
  "confidence": 0.925378985395845,
  "audio_duration": 2432,
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_status_code": null,
  "webhook_auth": false,
  "webhook_auth_header_name": null,
  "speed_boost": false,
  "auto_highlights_result": null,
  "auto_highlights": false,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_audio_quality": null,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "content_safety": false,
  "iab_categories": true,
  "content_safety_labels": {
    "status": "unavailable",
    "results": [],
    "summary": {}
  },
  "language_detection": false,
  "language_detection_threshold": null,
  "language_confidence": null,
  "custom_spelling": null,
  "throttled": false,
  "auto_chapters": true,
  "summarization": false,
  "summary_type": null,
  "summary_model": null,
  "custom_topics": false,
  "topics": [],
  "speech_threshold": null,
  "speech_model": "best",
  "chapters": [
    {
      "summary": "Data stories is brought to you by click. Unlock the whole story with Qlik sense through personalized visualizations and dynamic dashboards. You can download for free at Qlik Datastories.",
      "gist": "Data Stories in Qlik",
      "headline": "Data stories can help you uncover hidden relationships hidden in your data",
      "start": 160,
      "end": 68252,
      "id": "ep_93_ch_0"
    },
    {
      "summary": "Miriam Quick and Valentina d’Efilippo on the show. The project is called OddityViz. It's one of those amazing days with lots of sun. We have two very special guests with a lovely project.",
      "gist": "Beautiful Day with Valentina De",
      "headline": "Two very special guests with a lovely project on the show",
      "start": 68308,
      "end": 108280,
      "id": "ep_93_ch_1"
    },
    {
      "summary": "Miriam is a researcher and a data journalist. Her background is both in data and in information design. She has been doing this for about five or six years. I don't know anybody else who has this very, very narrow profile. It's a good niche to have.",
      "gist": "Infographics in the World: A No Brainer",
      "headline": "Miriam is a researcher specifically for infographics and information design",
      "start": 108392,
      "end": 196132,
      "id": "ep_93_ch_2"
    },
    {
      "summary": "Valentina is an information designer based in London. Her work is focused on infographics and data visualization. Her book, infographics history of the world, was published by Harper Collins in 2013.",
      "gist": "How to Write a Book in Infographics",
      "headline": "Valentina is an information designer focusing on infographics and data visualization",
      "start": 196268,
      "end": 303646,
      "id": "ep_93_ch_3"
    },
    {
      "summary": "OddityViz is a series of visualizations highlighting different aspects of David Bowie's song space oddity. The project was produced by Widen+Kennedy, a famous creative agency in London. The agency was generous in sponsoring the project.",
      "gist": "David Bowie's 'OddityViz'",
      "headline": "OddityViz is a series of visualizations about famous songs",
      "start": 303790,
      "end": 504552,
      "id": "ep_93_ch_4"
    },
    {
      "summary": "Project started over a year ago. Valentina and I wanted to do something that used data from music. We chose space Oddity because it was one of Bowie's biggest songs. Creating physical objects out of sound was something that inspired us a lot.",
      "gist": "The Data Design of David Bowie",
      "headline": "Valentina and I started working on David Bowie project over a year ago",
      "start": 504728,
      "end": 720284,
      "id": "ep_93_ch_5"
    },
    {
      "summary": "How did the early design process go? I try to get inspiration from the material that I'm working with. I wanted to create a cohesive language but keep a diverse look. I suppose, like, giving myself these sort of guidelines and quite a stronger direction guided me throughout the process.",
      "gist": "The Data Visualization Studio",
      "headline": "How did the early design process go for this data visualization",
      "start": 720704,
      "end": 1075534,
      "id": "ep_93_ch_6"
    },
    {
      "summary": "Most of the data was gathered by ear. Some of it was actually gathered using a kind of semi manual method. If you go to OddityViz. com, there's a link from there to a public data sheet. Maybe people will start to remix it even.",
      "gist": "The data generation step",
      "headline": "Most of the data was gathered by ear, so it was manual",
      "start": 1076034,
      "end": 1434214,
      "id": "ep_93_ch_7"
    },
    {
      "summary": "It's a very, very unusual song. There's an awfully broad number of instruments. It has a very unusual chorus that isn't really a chorus. I really enjoyed delving into the whole structure of it to kind of see why it works as well as it does.",
      "gist": "Talking About 'The Beatles'",
      "headline": "Are there any new things you've learned about the song through meditation",
      "start": 1436154,
      "end": 1522424,
      "id": "ep_93_ch_8"
    },
    {
      "summary": "For me, the relationship with the song changes. You start to pay really close attention to really small aspects of it and less attention to the overall impression. If it's worth overthinking, then that's time well spent. You don't want to ruin your favorite song that way.",
      "gist": "\"I Fall in Love With My Song\"",
      "headline": "One thing that happens to me all the time is that I discover a song",
      "start": 1522764,
      "end": 1615354,
      "id": "ep_93_ch_9"
    },
    {
      "summary": "In the end, you created posters and these engraved discs. And then we also decided to embark on this quite ambitious thing of creating an animation. And, like, real time visuals based on music. That's a whole new game, right?",
      "gist": "The Making of ''",
      "headline": "How did you decide on the presentation form for the music visualization",
      "start": 1617934,
      "end": 1949250,
      "id": "ep_93_ch_10"
    },
    {
      "summary": "Working with music by a major artist like David Bowie and UK copyright law. Managing the time was a very challenging thing, especially being a side project. Learning something new with any personal project is quite important.",
      "gist": "David Bowie's '' One Year Anniversary",
      "headline": "Working with music copyright is an issue when working with music",
      "start": 1949442,
      "end": 2166344,
      "id": "ep_93_ch_11"
    },
    {
      "summary": "You can follow the project on Twitter, on Instagram. There's loads of documentation. We are still in the process of learning about one new record every week. In case you happen to be around Milan early March, there's a visualize conference.",
      "gist": "A Taste of Visceral",
      "headline": "You can follow the project on Twitter, on Instagram",
      "start": 2166764,
      "end": 2303124,
      "id": "ep_93_ch_12"
    },
    {
      "summary": "Here are a few ways you can support the show and get in touch with us. We have a page on Patreon where you can contribute an amount of your choosing per episode. If you can spend a couple of minutes rating us on iTunes, that would be extremely helpful for the show.",
      "gist": "Data Stories",
      "headline": "Before you leave, here are a few ways you can support the show",
      "start": 2315824,
      "end": 2431644,
      "id": "ep_93_ch_13"
    }
  ],
  "disfluencies": false,
  "entity_detection": false,
  "sentiment_analysis": false,
  "sentiment_analysis_results": null,
  "entities": null,
  "speakers_expected": null,
  "summary": null,
  "custom_topics_results": null,
  "episode_num": 93,
  "episode_metadata": {
    "speakers": [
      "Valentina D’Efilippo",
      "Moritz Stefaner",
      "Enrico Bertini",
      "Miriam Quick"
    ],
    "WPid": "873",
    "url": "https://datastori.es/podlove/file/3610/s/feed/c/mp3/92-oddityviz-with-valentina-defilippo-and-miriam-quick.mp3",
    "episode_title": "OddityViz with Valentina D’Efilippo and Miriam Quick"
  }
}