{
  "id": "e249cc3b-8f06-48dd-b635-74e6e418cf06",
  "language_model": "assemblyai_default",
  "acoustic_model": "assemblyai_default",
  "language_code": "en_us",
  "status": "completed",
  "audio_url": "https://datastori.es/podlove/file/134/s/feed/c/mp3/Datastories-23.mp3",
  "utterances": [
    {
      "end": 16270,
      "speaker": "Enrico Bertini",
      "start": 8000,
      "text": "Hi, everyone. Data store is number 23. And after several attempts on organizing another hangout.",
      "id": "ep_23_ut_0"
    },
    {
      "end": 17078,
      "speaker": "Moritz Stefaner",
      "start": 16350,
      "text": "Oh, man.",
      "id": "ep_23_ut_1"
    },
    {
      "end": 17862,
      "speaker": "Enrico Bertini",
      "start": 17174,
      "text": "Failed.",
      "id": "ep_23_ut_2"
    },
    {
      "end": 19450,
      "speaker": "Moritz Stefaner",
      "start": 17966,
      "text": "Never again, people.",
      "id": "ep_23_ut_3"
    },
    {
      "end": 26094,
      "speaker": "Enrico Bertini",
      "start": 20150,
      "text": "We switched to the traditional, the most traditional audio recording. Hi, Moritz, how are you?",
      "id": "ep_23_ut_4"
    },
    {
      "end": 35010,
      "speaker": "Moritz Stefaner",
      "start": 26142,
      "text": "Which is much better because radio is cooler than tv by definition. Hi, Enrico. How are you doing?",
      "id": "ep_23_ut_5"
    },
    {
      "end": 41494,
      "speaker": "Enrico Bertini",
      "start": 36270,
      "text": "Good, good. Well, we have a very crappy weather today. It's raining.",
      "id": "ep_23_ut_6"
    },
    {
      "end": 43170,
      "speaker": "Moritz Stefaner",
      "start": 41542,
      "text": "Yeah, super cold here as well.",
      "id": "ep_23_ut_7"
    },
    {
      "end": 56700,
      "speaker": "Enrico Bertini",
      "start": 43710,
      "text": "Life is good. It's getting a little more relaxed. Semester, and the semester ended a few days ago. And, yeah, we're getting more relaxed. And you?",
      "id": "ep_23_ut_8"
    },
    {
      "end": 80260,
      "speaker": "Moritz Stefaner",
      "start": 57320,
      "text": "Super busy trying to wrap up everything. I'll go to New York in a week, Enrico. You know that. And afterwards to I o. And next week I go to conference and have some little vacations with my family. So now I need to finish everything I started, which is challenging, but I'll manage to.",
      "id": "ep_23_ut_9"
    },
    {
      "end": 83158,
      "speaker": "Enrico Bertini",
      "start": 80670,
      "text": "Sounds like a plan. You have a plan?",
      "id": "ep_23_ut_10"
    },
    {
      "end": 85770,
      "speaker": "Moritz Stefaner",
      "start": 83294,
      "text": "I have a plan, but the plan is bigger than me.",
      "id": "ep_23_ut_11"
    },
    {
      "end": 91822,
      "speaker": "Enrico Bertini",
      "start": 87870,
      "text": "When you get to New York, we should organize some. We should actually.",
      "id": "ep_23_ut_12"
    },
    {
      "end": 93558,
      "speaker": "Moritz Stefaner",
      "start": 91886,
      "text": "We should organize a Google hangout.",
      "id": "ep_23_ut_13"
    },
    {
      "end": 100774,
      "speaker": "Enrico Bertini",
      "start": 93734,
      "text": "A Google hangout? No, in the park. Our listeners don't know how much time we spent during the last time.",
      "id": "ep_23_ut_14"
    },
    {
      "end": 103038,
      "speaker": "Moritz Stefaner",
      "start": 100782,
      "text": "We started around 20 hangouts and none of them.",
      "id": "ep_23_ut_15"
    },
    {
      "end": 115652,
      "speaker": "Enrico Bertini",
      "start": 103054,
      "text": "Yeah, we started 20 hangouts. Failed miserably. So I think you want to give a brief announcement, right, about the new feature we have in the blog. And then we start the episode.",
      "id": "ep_23_ut_16"
    },
    {
      "end": 188160,
      "speaker": "Moritz Stefaner",
      "start": 115716,
      "text": "Yeah, that's right. I mean, we never mentioned that, but I added a little Flattr button to our site. And flutter is a really nice service. So basically, the idea is everybody's consuming media on the web, and they never really developed a good payment model. Some people have payrolls and you need to subscribe, and others say, well, we do everything for free, but then how do you find it? And Flattr is sort of in between. It's kind of nice. The way it works is you put like ten or 20 or something, dollar or euro, or any amount you want on your account per month, and then you spend that on the things that you read on a regular basis or listen to or whatever you consume. And then it will be sort of added to the account of these people producing the media. And we thought it could be nice just to try it out. So if you are on flutter, you can Flattr us now, or you might want to look at the site and subscribe us there and help us a little with the server costs and these types of things. And get Enrico a proper microphone, stuff like that. A haircut for me, a microphone for Enrico. Little things matter.",
      "id": "ep_23_ut_17"
    },
    {
      "end": 191660,
      "speaker": "Bryan Connor",
      "start": 191180,
      "text": "Anyways.",
      "id": "ep_23_ut_18"
    },
    {
      "end": 203520,
      "speaker": "Moritz Stefaner",
      "start": 191700,
      "text": "We just want to give it a shot and see how it works. I know from some German podcasters that it actually works for them. You know, that they can sort of. Some can even live on it and others can at least, like, finance back to.",
      "id": "ep_23_ut_19"
    },
    {
      "end": 216144,
      "speaker": "Enrico Bertini",
      "start": 203560,
      "text": "So the message is, go to flutter now, stop listening to data stories, go to Fletr, put a couple of. Donate all your money there and start giving something.",
      "id": "ep_23_ut_20"
    },
    {
      "end": 217620,
      "speaker": "Moritz Stefaner",
      "start": 216232,
      "text": "Sell your grandmother.",
      "id": "ep_23_ut_21"
    },
    {
      "end": 224260,
      "speaker": "Enrico Bertini",
      "start": 219760,
      "text": "It's terrible. Okay. Should we start?",
      "id": "ep_23_ut_22"
    },
    {
      "end": 225780,
      "speaker": "Moritz Stefaner",
      "start": 224720,
      "text": "Yeah, totally.",
      "id": "ep_23_ut_23"
    },
    {
      "end": 243132,
      "speaker": "Enrico Bertini",
      "start": 226360,
      "text": "Okay, so we have a very nice topic and a couple of guests today we are gonna talk about the fine boundary between inspiration and plagiarism or plagiarism.",
      "id": "ep_23_ut_24"
    },
    {
      "end": 250900,
      "speaker": "Moritz Stefaner",
      "start": 243196,
      "text": "That's a good question. Yeah. Okay, Brian, you're the native speaker. Is it plagiarism or plagiarism?",
      "id": "ep_23_ut_25"
    },
    {
      "end": 252788,
      "speaker": "Bryan Connor",
      "start": 250980,
      "text": "I'll go to plagiarism.",
      "id": "ep_23_ut_26"
    },
    {
      "end": 273256,
      "speaker": "Enrico Bertini",
      "start": 252924,
      "text": "Plagiarism, plagiarism, plagiarism. So, okay, since Brian already started talking, we have Brian Connor from the y axis. I. Brian. And we have Mayer javous from SEED scientific. Hi, guys. How are you?",
      "id": "ep_23_ut_27"
    },
    {
      "end": 274152,
      "speaker": "Bryan Connor",
      "start": 273368,
      "text": "Good, we're good.",
      "id": "ep_23_ut_28"
    },
    {
      "end": 287096,
      "speaker": "Enrico Bertini",
      "start": 274216,
      "text": "Hey, so we normally let. Oh, good, good. We are very good. We normally let our guests introduce themselves. So maybe. Brian, you want to start introducing yourself?",
      "id": "ep_23_ut_29"
    },
    {
      "end": 296420,
      "speaker": "Bryan Connor",
      "start": 287208,
      "text": "Sure. Yeah. Yes. I'm Brian, the editor of the Why Axis, and I also teach in the master's program at Mica in information visualization.",
      "id": "ep_23_ut_30"
    },
    {
      "end": 311890,
      "speaker": "Mahir Yavuz",
      "start": 297590,
      "text": "Yeah. Hi, I'm Mahir. I work as a design technologist at Seed scientific, and I teach some courses in Austria and some other workshops in the US on data visualization.",
      "id": "ep_23_ut_31"
    },
    {
      "end": 316230,
      "speaker": "Enrico Bertini",
      "start": 313350,
      "text": "And he's been giving a nice tutorial here as well, recently.",
      "id": "ep_23_ut_32"
    },
    {
      "end": 319422,
      "speaker": "Mahir Yavuz",
      "start": 316350,
      "text": "Yes, we did a nice tutorial that came.",
      "id": "ep_23_ut_33"
    },
    {
      "end": 331820,
      "speaker": "Enrico Bertini",
      "start": 319566,
      "text": "We are not too far, me and ma here, a few steps away, actually. So, Moritz, you want to explain how the idea of this episode started?",
      "id": "ep_23_ut_34"
    },
    {
      "end": 414530,
      "speaker": "Moritz Stefaner",
      "start": 332320,
      "text": "Sure. I mean, briefly. Yeah, we sort of had the topic in the back of our minds for a while because it's so interesting, this whole question of authorship and originality in data visualization. Like, do we always have to make new things? Or when is something a ripoff of something else? When is there a clear inspiration? Is that a problem at all? Isn't it fine if we do the same thing twice by different people? And so we had this, like, in the back of our minds as a good topic for a while already. And then Mahi, I think, a week ago or so, just had one tweet where he wrote, like, the visualization scene is turning into a copycat scene, if not already. And so it was just a quick remark, and the example was one that we will later discuss, I guess, visualization by the New Yorker that was later remade sort of a remixed. And so pretty quickly, like a quick discussion started also with Andy Kirk. Greetings to Andy. Hey, Andy. Who couldn't join us today. And so we thought like, yeah, it's a great topic. And so we just pretty quickly put a few interesting cases together of which we could discuss. And now here we are to discuss them. Right?",
      "id": "ep_23_ut_35"
    },
    {
      "end": 431904,
      "speaker": "Enrico Bertini",
      "start": 416960,
      "text": "So maybe, why don't we start directly from this first example and maybe Mahir, you can comment on it and tell us what, what it was, how it looks like and why you came up with this idea that we are already in a copycat scene.",
      "id": "ep_23_ut_36"
    },
    {
      "end": 451250,
      "speaker": "Moritz Stefaner",
      "start": 432072,
      "text": "We should mention first, one thing we should mention, you should definitely go to the blog post and follow the links so you understand what we are talking about, because obviously it's going to be important to look at all these visualizations in detail and maybe it's best to do that first. So press pause. Now go to the web, take a deep breath.",
      "id": "ep_23_ut_37"
    },
    {
      "end": 467170,
      "speaker": "Enrico Bertini",
      "start": 451370,
      "text": "We are here waiting for you. Nothing bad is going to happen. Check all the links. No, but, you know, we know that people listen to data stories in all sorts of conditions, so most likely we.",
      "id": "ep_23_ut_38"
    },
    {
      "end": 468746,
      "speaker": "Moritz Stefaner",
      "start": 467170,
      "text": "Should explain at least roughly.",
      "id": "ep_23_ut_39"
    },
    {
      "end": 470674,
      "speaker": "Enrico Bertini",
      "start": 468818,
      "text": "Yeah, yeah, we should explain roughly.",
      "id": "ep_23_ut_40"
    },
    {
      "end": 471510,
      "speaker": "Moritz Stefaner",
      "start": 470722,
      "text": "That's right.",
      "id": "ep_23_ut_41"
    },
    {
      "end": 576134,
      "speaker": "Mahir Yavuz",
      "start": 472970,
      "text": "So I think the reason for my tweet was because the density of people copying each other is heavily increased in the last year, or that's my observation. And I started to follow, like, we all know that there's a kind of small visualization scene on Twitter which is extremely active and everybody's sharing links and ideas. And I started to see that everyone is like, if you really check all the links, then you started to see that people are always sharing kind of similar things. And then I was thinking about whether we are, we already consumed all the patterns of visualizations. And the example was the subway map, which is actually correlated to the income levels in different regions in New York City, which has been done by New Yorker, replicated and put it on GitHub by some other people, and it was representing the inequality and mass transit in the Bay Area. And I mean, of course, like, they properly actually caught the New York City subway stop map down by New Yorker. And like, it's not a kind of plagiarism issue for me, but I was actually thinking more that, you know, whether there is a value that everyone is copying each other and applying the same methodology in different visualizations or this is actually kind of killing the creativity. So I think this is maybe a kind of good start. And if people, when, when they see the links, they will realize that, you know, it's almost exactly the same. Like the idea is the same and the visualization style is the same.",
      "id": "ep_23_ut_42"
    },
    {
      "end": 610496,
      "speaker": "Moritz Stefaner",
      "start": 576182,
      "text": "And yeah, I mean, I would call that a remake, really, because they very openly try to do exactly the same thing. But I mean, we have to say they also cite the original piece and just say, this is what we just remade. Right. So there's a little paragraph on top saying here you can find the original. We just did exactly the same thing, which is sort of interesting. Yeah. I was wondering, how would the designer, like, think about their work being open sourced? Brian, what's your take on that piece?",
      "id": "ep_23_ut_43"
    },
    {
      "end": 661090,
      "speaker": "Bryan Connor",
      "start": 610608,
      "text": "Well, I mean, it's easy to make generalities, I guess. I mean, when it's not your work, I think it's easy to say, like, know, it'd be great if other news organizations or other people could use the same sort of format to report about the same issues in a different area. Right. I mean, you know, different data sets. But hey, they did a really good job of presenting this data by, you know, this cross section of the transit routes. It's kind of a good way to frame it. Maybe I'll do the same thing. But, you know, to be honest, I don't know if I would be as open if it were my design work. So, you know, I think we can all. I'll talk about it in generalities. I don't know, maybe. Moritz, if you had, have actually had any experience with this, with any of your pieces, not to get too far away from this particular example.",
      "id": "ep_23_ut_44"
    },
    {
      "end": 709630,
      "speaker": "Moritz Stefaner",
      "start": 661250,
      "text": "Yeah, I had one case where I had developed this elastic lists principle, or a pattern, which was already meant as a principle, so it was designed to be reused. But then another, like, party came and re implemented it pretty much one to one, and called it elastic list as well. So it was sort of, you know, riding my train in a way. And this is the point where I got a bit pissed then, but before, I mean, just people taking the idea and re implementing it in their way, I was totally fine with that. So, but I, I was never target of a real ripoff in a sense, that somebody took my idea, ran with it, claimed it and said it was his and became famous. So this luckily never happened.",
      "id": "ep_23_ut_45"
    },
    {
      "end": 725110,
      "speaker": "Enrico Bertini",
      "start": 711010,
      "text": "But I think we don't have an example like that in the list. Right. So we made a long list of examples and I think that every single example cites at least the original source of inspiration. Right?",
      "id": "ep_23_ut_46"
    },
    {
      "end": 774800,
      "speaker": "Moritz Stefaner",
      "start": 727210,
      "text": "Not all of them. Not all of them. So we have the precursor to the New Yorker map, maybe, who knows? But there has been a project two or three years before that. It's called no fair hikes, and it displays essentially the same type of information. So the twist of the project is the same, the basic idea to map income along the metro lines, which is, which makes the project more or less, but it's visualized in a very different way. So here it's a different case of, let's say, inspiration going on, in a sense that somebody maybe saw that and said, oh, we could do a similar thing, maybe present it in a different way, but take that same basic mapping idea and connect inequality or income and the metro system, which is obviously a non obvious thing to connect.",
      "id": "ep_23_ut_47"
    },
    {
      "end": 775920,
      "speaker": "Enrico Bertini",
      "start": 775140,
      "text": "Yeah.",
      "id": "ep_23_ut_48"
    },
    {
      "end": 795450,
      "speaker": "Moritz Stefaner",
      "start": 776580,
      "text": "Here again, the question is, do you have to reference it? If you take an idea like that, what would you say? Is it necessary to then go back and say, well, I read this newspaper article, and I met this guy, and he told me about blah blah.",
      "id": "ep_23_ut_49"
    },
    {
      "end": 818480,
      "speaker": "Enrico Bertini",
      "start": 796470,
      "text": "But I think one issue here is there are clearly a whole set of standard visualization techniques, designs that we use all the time, and they are so common that it would be silly or even impossible trying to trace back with the original author of this kind of stuff. Right.",
      "id": "ep_23_ut_50"
    },
    {
      "end": 823740,
      "speaker": "Moritz Stefaner",
      "start": 818600,
      "text": "So in this case, we have one very concrete design, like a whole layout.",
      "id": "ep_23_ut_51"
    },
    {
      "end": 824936,
      "speaker": "Enrico Bertini",
      "start": 824240,
      "text": "Yeah, yeah.",
      "id": "ep_23_ut_52"
    },
    {
      "end": 831648,
      "speaker": "Moritz Stefaner",
      "start": 825008,
      "text": "And the other is like a project idea, like a twist on a, like a content, content wise twist, a topic twist. Yeah.",
      "id": "ep_23_ut_53"
    },
    {
      "end": 842940,
      "speaker": "Enrico Bertini",
      "start": 831704,
      "text": "This is what I wanted to sort out. It's not only the visualization design. There is something else there. Right. It's the old concept, the old idea that might be borrowed or copied. Right.",
      "id": "ep_23_ut_54"
    },
    {
      "end": 899360,
      "speaker": "Mahir Yavuz",
      "start": 844040,
      "text": "I think there are three different layers, like the idea level and the aesthetics and the technical level. Like, you know, the engineering aspect, I can say. And I think, you know, if someone just tries to replicate all these level layers, different layers, then, you know, they are just ending up having a remake, as Morris described this project. But if they just, you know, use the aesthetics and the technique, a similar aesthetic and similar technique, but the idea is totally different. I think then we all kind of think that, you know, there is a value in that because the idea is totally something else, and then it may reveal some different insights, or the idea is the same, but they develop a different technique, which is, I think, happening quite often right now, especially in D3 community. Like, they all use the same data set most of the time, but, you know, they produce different visualization techniques, and everyone appreciates the value of this.",
      "id": "ep_23_ut_55"
    },
    {
      "end": 903260,
      "speaker": "Enrico Bertini",
      "start": 899400,
      "text": "Yeah, so, sorry, go ahead.",
      "id": "ep_23_ut_56"
    },
    {
      "end": 929780,
      "speaker": "Mahir Yavuz",
      "start": 903720,
      "text": "No, I mean, I think, like, it's kind of, I was thinking a lot about after we decided to do the podcast, like, how we are really going to explain this issue. I think we all have a good sense about like judging which one is a remake and which one is a kind of inspiration and which one is a value added technological improvement. But it's kind of hard to categorize and draw the borders of the whole domain.",
      "id": "ep_23_ut_57"
    },
    {
      "end": 965150,
      "speaker": "Enrico Bertini",
      "start": 930080,
      "text": "So let me try to mention, sorry, my phone, to make an analogy. So for instance, in the arts, especially in music, it's very, very common to do covers or stuff like that, right? Or even for movies there are remakes. Where is the difference here? So I guess it's totally fine or somewhat similar in visualization, trying to redo almost exactly the same thing, but repurposing by changing either some aspects of the design, right?",
      "id": "ep_23_ut_58"
    },
    {
      "end": 1024670,
      "speaker": "Mahir Yavuz",
      "start": 965490,
      "text": "Yeah, I mean we can maybe think about that. When a certain style in design turns into a pattern, we have this concept of design patterns, right? So in order to create a design pattern like a bar chart visualization, which I believe that, you know, someone in the history came up with this idea, it was not existing there since the beginning. So, but when it turns into a pattern then it has a name then actually maybe more important than it defines the problem that it's solving. So, but right now, since there are so many different types of visualizations, not maybe super, super distinguished from each other, but many, many different types are released, it is kind of hard to draw the borders of the patterns and define the new patterns. And maybe this is a time that we are ending up having many new patterns in the visualization. I mean that's my wishful thinking on this actually.",
      "id": "ep_23_ut_59"
    },
    {
      "end": 1042290,
      "speaker": "Moritz Stefaner",
      "start": 1025370,
      "text": "Yeah, but I think there's a difference in the sense that a pattern, I mean you have to have seen it like five or ten times in different contexts until you realize, aha, this is the recurring core. If somebody does something first and then the second guy comes, you cannot say it's a pattern.",
      "id": "ep_23_ut_60"
    },
    {
      "end": 1057650,
      "speaker": "Mahir Yavuz",
      "start": 1043790,
      "text": "No, we can't. Yeah, that's what I, that's what I totally agree. It should clearly define what is the problem being solved and it should have been practiced enough to prove that, you know, the problem is really solved every time.",
      "id": "ep_23_ut_61"
    },
    {
      "end": 1165354,
      "speaker": "Moritz Stefaner",
      "start": 1058590,
      "text": "I mean, for instance, if you do a stream graph today, you don't always have to cite the full history of, I have this, you know, Lee Byron topic, river theme, river. If you use a tree map. I don't. I think Ben Shneiderman is fine if we sort of leave out his name occasionally. But I mean for these newer things where a lot of work maybe goes into like developing a new form of narrative, I think it would be nice at least to drop the name of the, you know, of the original inspiration. I think that's often the point. Shall we move on maybe to another set of examples? Maybe that fits that theme. Anyway, so one other thing we looked at were so earlier this year from Paris copic, we had Kim on the show as well. We saw the gun murders visualization. And it's a really nice piece, and I think it raised a lot of attention because they nicely combined the narrative aspect with a lot of numbers counting up in the beginning and sort of building a certain tension. And then later, this leads to building up the whole visual, which can be explore it interactively. And so this came out earlier this year, and then maybe four or six weeks later, there was this really popular piece by pitch interactive, which was about drone strikes. So it's called out of sight, out of mind. And it has a similar narrative structure. So it's a totally different topic, a different visual as well, but it has a very similar narrative structure. And although it looks totally different, I think a lot of people said, like, oh, that's very similar to that gun murders piece, maybe also because it has also such a dark topic. Who knows?",
      "id": "ep_23_ut_62"
    },
    {
      "end": 1176658,
      "speaker": "Enrico Bertini",
      "start": 1165402,
      "text": "So, Moritz, I have a fundamental question for all of you guys. Are you necessarily giving a negative connotation to this kind of copying, or. Or you are neutral?",
      "id": "ep_23_ut_63"
    },
    {
      "end": 1198762,
      "speaker": "Bryan Connor",
      "start": 1176754,
      "text": "I mean, I think in this case, it was very clear that it's not negative at all. I mean, at least to me, you know, it was very, very much a nod towards the previous work, maybe. And, you know, it may not even be listed in the credits in this case, but at least in the visualization community, I don't remember sort of any controversy when this came out, whereas.",
      "id": "ep_23_ut_64"
    },
    {
      "end": 1221306,
      "speaker": "Moritz Stefaner",
      "start": 1198906,
      "text": "And Wes immediately, I think his second tweet after the first thing announcing is a big inspiration, was, by the way, the gun murder piece. And I think this is the proper way also to do it and just say, we took this, and it was a big inspiration. You know, you see, they transformed it into something totally different, you know, so they. They took it and sort of worked with it.",
      "id": "ep_23_ut_65"
    },
    {
      "end": 1222106,
      "speaker": "Bryan Connor",
      "start": 1221458,
      "text": "Yeah, like you said.",
      "id": "ep_23_ut_66"
    },
    {
      "end": 1225994,
      "speaker": "Moritz Stefaner",
      "start": 1222138,
      "text": "But didn't forget that the original, like, spark really came from somebody else.",
      "id": "ep_23_ut_67"
    },
    {
      "end": 1236154,
      "speaker": "Bryan Connor",
      "start": 1226042,
      "text": "And in this case, it's a. It's a different. Different concept, somewhat similar aesthetics, you know, different data, different implementation technically, as well.",
      "id": "ep_23_ut_68"
    },
    {
      "end": 1236990,
      "speaker": "Moritz Stefaner",
      "start": 1236282,
      "text": "Yeah.",
      "id": "ep_23_ut_69"
    },
    {
      "end": 1283300,
      "speaker": "Mahir Yavuz",
      "start": 1237450,
      "text": "Yeah. But I think the storytelling is what maybe, you know, reminds too many people that, you know, they are kind of related to each other. And this is, I would say these two pieces, they are basically defining a new trend in visualization, which is like, you know, data dance, and there is a good storytelling. And also, you know, there is, you know, instead of, like, they are more focusing on the volume of the. Of the individual data points rather than just grouping them and showing as bar charts or something. So that is maybe the reason why many people thought that the second piece is inspired by the first one. But I totally agree with Brian. Like, I also didn't see, like, any controversy about.",
      "id": "ep_23_ut_70"
    },
    {
      "end": 1320132,
      "speaker": "Moritz Stefaner",
      "start": 1283600,
      "text": "And it's miles away in the end. Yeah. So, yeah, and the third one, then, in the sequence is called bolides. And sorry, I forgot the name of the designer, but it's a visualization of meteorite strikes that were witnessed on the earth. And it's also, like, the whole history of them. And, I mean, this one strikes me as very similar, again, to the drone piece. I mean, again, it's a different design and some. But this one's closer to the drone piece. Then let's say the drone piece was to the. To the gun murders piece. And this is where I start thinking, like, is this going too far in inspiration, let's say.",
      "id": "ep_23_ut_71"
    },
    {
      "end": 1352910,
      "speaker": "Enrico Bertini",
      "start": 1320196,
      "text": "Or, you know, but honestly, I mean, I loved it. It's so very well crafted. That's another thing. When you, when you make a new piece that is based on a strong inspiration coming from another design, you might actually implement it very badly or very, very well. I think that's another aspect of the old story. I mean, if you look again into this bolides visualization, the reference to the previous ones is obvious. Totally obvious. And probably there's nothing new there, but it's very, very well crafted.",
      "id": "ep_23_ut_72"
    },
    {
      "end": 1366760,
      "speaker": "Moritz Stefaner",
      "start": 1354130,
      "text": "Yeah, it's a fun thing. And you learned something again. Right. And so, yeah, probably no problem there. But in this case, I thought, personally, he could have just linked back to the drones piece of, you know.",
      "id": "ep_23_ut_73"
    },
    {
      "end": 1368592,
      "speaker": "Enrico Bertini",
      "start": 1366840,
      "text": "Oh, that's true.",
      "id": "ep_23_ut_74"
    },
    {
      "end": 1399634,
      "speaker": "Bryan Connor",
      "start": 1368736,
      "text": "Yeah. But it's funny. I mean, it seems very subjective because the. I mean, the drones piece, I don't think, actually anywhere in the site links back to the, to the original. But we all, you know, we have a different feeling about that for some reason. Just the way that it was presented, the way that maybe on, you know, on Twitter that we, you know, us four in particular saw the reference as soon as it came out to the previous one, whereas just the visibility of that is not there in the meteor piece. So it somehow changes our perception of it somehow.",
      "id": "ep_23_ut_75"
    },
    {
      "end": 1407110,
      "speaker": "Moritz Stefaner",
      "start": 1399762,
      "text": "Yeah, but there you see how fine the line is actually, you know, like, between, like, oh, everything's totally in order and outrageous. Ripoff.",
      "id": "ep_23_ut_76"
    },
    {
      "end": 1410990,
      "speaker": "Bryan Connor",
      "start": 1409610,
      "text": "Outrageous.",
      "id": "ep_23_ut_77"
    },
    {
      "end": 1438770,
      "speaker": "Moritz Stefaner",
      "start": 1411730,
      "text": "Yeah. And I feel it's a very sensitive topic. So when I ask people, like, about their inspirations or if they had seen certain work that is very similar, often I get very defensive answers. And as you say, Enrico, I don't think it's a bad thing to be inspired at all. Or to say, like, so I saw this piece, it totally changed my mind about, like, how visualization should look. And I wanted to do something like this as well. I think it's a totally valid starting point for a project, in case you add something. Then afterwards.",
      "id": "ep_23_ut_78"
    },
    {
      "end": 1460894,
      "speaker": "Mahir Yavuz",
      "start": 1441190,
      "text": "I mean, regarding to your remark of outrageous repo of Moritz, I was also thinking about this and I came up with this triangle idea, which I kind of, you know, judged the work. If it's an outrageous report or not, and if the motivation is like, making money or like making credit for yourself.",
      "id": "ep_23_ut_79"
    },
    {
      "end": 1461510,
      "speaker": "Moritz Stefaner",
      "start": 1460942,
      "text": "Yeah.",
      "id": "ep_23_ut_80"
    },
    {
      "end": 1468118,
      "speaker": "Mahir Yavuz",
      "start": 1461670,
      "text": "And if there is, like, no reference and like no single reference, and it is kind of impossible.",
      "id": "ep_23_ut_81"
    },
    {
      "end": 1468366,
      "speaker": "Moritz Stefaner",
      "start": 1468174,
      "text": "Right.",
      "id": "ep_23_ut_82"
    },
    {
      "end": 1482540,
      "speaker": "Mahir Yavuz",
      "start": 1468398,
      "text": "You know, if it's that kind of similar, they most probably know what's going on. And if the value is not increased at the end, like, if there's no technical improvement, nothing. Like nothing, then that's an outrageous report.",
      "id": "ep_23_ut_83"
    },
    {
      "end": 1501840,
      "speaker": "Moritz Stefaner",
      "start": 1484360,
      "text": "So, yeah, it doesn't help anybody, you know, it doesn't add anything. It's selfish. So there's some selfishness aspect there, like claiming something you don't own. Yeah, yeah, you're right. Yeah. But just like liking something and building something similar to learn or. So I don't think there's any problem.",
      "id": "ep_23_ut_84"
    },
    {
      "end": 1531600,
      "speaker": "Mahir Yavuz",
      "start": 1501920,
      "text": "Because I was really trying to be honest to myself, like, you know, even though that the motivation is making money or profit and there's no reference again, but there's a technical improvement or aesthetical improvement in that work. I kind of. I would most probably call it as ripoff among my friends. But I still enjoy the increased value of that piece in a way. I learned something from that piece, you know, like how that piece could have been improved in aesthetical or technical terms.",
      "id": "ep_23_ut_85"
    },
    {
      "end": 1552230,
      "speaker": "Moritz Stefaner",
      "start": 1532820,
      "text": "When you work like Brian or Mahia, and you notice you're moving in the direction of an existing work, like independently, it just happens. Do you, like, change directions? Because he's like, ah, I don't want to look like somebody who's like, ripping off other people. Or like, how do you deal with that? Or do you say it doesn't really matter?",
      "id": "ep_23_ut_86"
    },
    {
      "end": 1612230,
      "speaker": "Bryan Connor",
      "start": 1553450,
      "text": "I don't know. I think it's about. I mean, it's good that you are aware of it too, you know, like, I think sometimes it's completely unintentional, but I think the other, you know, when you are aware of it. I don't know. For me personally, I think it depends on what it is. Maybe for user interface it might be a little bit different because there's a very well established sense of design patterns there. And if you're going to rip off the aesthetics, then that's a lot clearer than this button pattern made a lot of sense in this case, so maybe I'll reuse it. But for visualization, again, there's a whole host of other issues that I think so, yeah. It's just a hard line to cross. I don't know if I move in a different direction. But again, as long as, you know, we're seeing that so far, the referencing and the acknowledgement that these things are influencing your work is very important to the sort of perception.",
      "id": "ep_23_ut_87"
    },
    {
      "end": 1613390,
      "speaker": "Moritz Stefaner",
      "start": 1612610,
      "text": "Yeah.",
      "id": "ep_23_ut_88"
    },
    {
      "end": 1641532,
      "speaker": "Mahir Yavuz",
      "start": 1614370,
      "text": "For me personally, to answer your question more, is it matters a lot whether it's a personal project or kind of, you know, project in the industry, because most of the commercial work, we can't really just give references to any other company. Right. You know, like, this is kind of impossible. Nobody likes to see that on their page that there is another design company is being referenced. Because personally, I have no problem to reference anyone that I am being inspired from.",
      "id": "ep_23_ut_89"
    },
    {
      "end": 1642440,
      "speaker": "Moritz Stefaner",
      "start": 1641636,
      "text": "I really.",
      "id": "ep_23_ut_90"
    },
    {
      "end": 1691070,
      "speaker": "Mahir Yavuz",
      "start": 1644820,
      "text": "But in the commercial projects, what I try, and I'm not sure whether I sustain this all the time, but what I always try, even though that I know that the solution is already used in another project, I'm trying to add a little bit spice, you know, like, I'm spending some time to find that spice, which is actually maybe gonna change the project, how it looks and feels at the end. And that actually takes a lot of time sometimes, you know, like, and, but I think it turns out to be successful most of the time. Even though that the, the technique is almost the same and the technology is almost the same, you can always find small additional design solutions that makes the thing look better or different, at least.",
      "id": "ep_23_ut_91"
    },
    {
      "end": 1694538,
      "speaker": "Enrico Bertini",
      "start": 1691570,
      "text": "But isn't that the way design works?",
      "id": "ep_23_ut_92"
    },
    {
      "end": 1778520,
      "speaker": "Moritz Stefaner",
      "start": 1694714,
      "text": "Absolutely. Yeah. That's my big belief anyway, is that if you take a design job seriously and really dive into it and explore all that is needed to make a really good solution, it will always be original because you just took the problem serious and really tried to solve that very specific problem in the best way. So I never, at this point, if you do that, you don't have to worry about originality. It just happens. On the contrary, if you don't really take the concrete problem really serious and just say, yeah, it's a time series, let's make a line chart. It looks a bit dull. Let's add some drop shadows and make the line a bit curvy. I mean, then of course you end up with stereotypes. Let's talk about clients. So I get a lot of requests. I would say roughly a third of my requests I get is that they ask in the second line of the email to either reproduce one of my own work, like self plagiarize myself or plagiarize David McCandless, Guardian, Hans Rosling, somebody they have seen on the Internet and they see, I don't know, they see a radial chart somewhere or something bubbly and just say, oh, we have a network too. Can we do the same thing for cheap?",
      "id": "ep_23_ut_93"
    },
    {
      "end": 1785644,
      "speaker": "Enrico Bertini",
      "start": 1782900,
      "text": "Must be frustrating sometimes.",
      "id": "ep_23_ut_94"
    },
    {
      "end": 1802194,
      "speaker": "Moritz Stefaner",
      "start": 1785772,
      "text": "It's funny too. So how do we deal with that? Like what's so, there seems to be maybe a sense that visualizations can be easily replicated and just molded into different forms. If we do it too much, just.",
      "id": "ep_23_ut_95"
    },
    {
      "end": 1804030,
      "speaker": "Enrico Bertini",
      "start": 1802242,
      "text": "Delivery, then grab the money.",
      "id": "ep_23_ut_96"
    },
    {
      "end": 1808710,
      "speaker": "Moritz Stefaner",
      "start": 1805810,
      "text": "Buy some ice cream for my kids and move on. Yeah.",
      "id": "ep_23_ut_97"
    },
    {
      "end": 1817078,
      "speaker": "Enrico Bertini",
      "start": 1811090,
      "text": "Not a very good long term plan, but it might work in the short term.",
      "id": "ep_23_ut_98"
    },
    {
      "end": 1819610,
      "speaker": "Moritz Stefaner",
      "start": 1817234,
      "text": "Enrico, your mic is making noise again.",
      "id": "ep_23_ut_99"
    },
    {
      "end": 1884354,
      "speaker": "Mahir Yavuz",
      "start": 1823430,
      "text": "So, mortis, to answer your question again, I think I can answer in two different ways because, I mean, at seed we really don't work like that. And actually I'm not really so much aware that, you know, like what the client asks at the first email, but like we, we design custom solutions. Like, even though that maybe some of the projects might look similar to some other stuff, but we don't really have that discussion with the client. They don't say that can you do something similar to hands frosting or whatever. But in my personal or freelance projects before, I actually had a kind of similar situation. And just because I think people, they like to just, they know that, you know, somebody else has already successfully, you know, created a tool or design and they just want to have the same thing on their own brand. That's the, that's the reason. I don't know. What's your experience, Brian?",
      "id": "ep_23_ut_100"
    },
    {
      "end": 1893870,
      "speaker": "Bryan Connor",
      "start": 1884522,
      "text": "Well, I mean, I was going to ask Morris, I think you, I mean, you said you had an experience about it specifically, so, you know, I wanted to hear how you handled it too.",
      "id": "ep_23_ut_101"
    },
    {
      "end": 1955144,
      "speaker": "Moritz Stefaner",
      "start": 1895170,
      "text": "So some of the time. So first of all, I will always make the case that these visualizations you see that are so nice in China, they're always the result of a long process. And the process involves a concrete client, a concrete data set, concrete challenge users, and then you just see the end result. But you need to respect that process that leads you there. And if you don't respect that process, you cannot replicate the graphic. I mean, you can replicate the graphic superficially, but you cannot replicate the process that led there just by copying. You have to do it yourself and then you will end up with something else because every problem is new. And so sometimes I'll make that speech and other times I'll sort of try and usually it's a combination and I'll try to take what they liked about the original graphic and slowly carry it somewhere else, basically because obviously there's something they liked about it. And that's a good starting point for a project. I mean, of course, yeah.",
      "id": "ep_23_ut_102"
    },
    {
      "end": 1963836,
      "speaker": "Mahir Yavuz",
      "start": 1955192,
      "text": "Actually you are trying to figure out based on the demand that they're doing to you, they are trying to figure out the brief of the brief.",
      "id": "ep_23_ut_103"
    },
    {
      "end": 1966028,
      "speaker": "Moritz Stefaner",
      "start": 1963868,
      "text": "What that means. Exactly. What that means.",
      "id": "ep_23_ut_104"
    },
    {
      "end": 1967680,
      "speaker": "Mahir Yavuz",
      "start": 1966124,
      "text": "Decoding the brief.",
      "id": "ep_23_ut_105"
    },
    {
      "end": 1981280,
      "speaker": "Moritz Stefaner",
      "start": 1967980,
      "text": "It's a guessing game. Exactly. But I never said. Yeah, of course we do the same thing. That sounds fine and let's move on. It doesn't work for me.",
      "id": "ep_23_ut_106"
    },
    {
      "end": 2083650,
      "speaker": "Bryan Connor",
      "start": 1984760,
      "text": "Yeah. So in another, you know, another sort of example of some of the things we've been talking about there was an original piece, well, I guess what you can call original by the Guardian, which we'll link to, you know, there's a gay rights graphic that works with radial, radial sort of layout states and then laws within those states. So we've seen, you know, and collected several examples that followed the same pattern since then. One of them is from the Guardian again. So they're reusing their own patterns, which I think makes a lot of sense depending on the pattern. But we also saw another version from another news source that came out around the same time as the second guardian piece. And the second guardian piece was of course on gun rights by state. So we also saw the second visualization come out around the same time, probably too close to, again, know that the Guardian would reuse this radial sort of chart for gun rights state by state. But the other example does that as well, potentially, I guess influenced by the earlier gay rights visualization from the Guardian. And then Sinsen, there's also other works that use the same sort of radial thing to show data about states and laws. So yeah, all of these things, I guess are sort of circling around the original design from the Guardian. And there's certainly, I guess, different levels of referencing and acknowledging some of the forerunners in these cases.",
      "id": "ep_23_ut_107"
    },
    {
      "end": 2108562,
      "speaker": "Moritz Stefaner",
      "start": 2087550,
      "text": "Yeah, I mean, for me inspiration is fine but I think this is a case where it just goes too far. Right. So I think it's so clear that somebody went to somebody else and said, hey, look at that graphic. Can't we do the same thing, basically? So, I mean, it's difficult where to draw the line there.",
      "id": "ep_23_ut_108"
    },
    {
      "end": 2150930,
      "speaker": "Bryan Connor",
      "start": 2108626,
      "text": "But yeah, I think there are some, you know, when you're talking about a news source, I think that's one thing. And especially news sources maybe competing for users eyeballs out there, you know, that sort of adds a different tone to it, perhaps, than might otherwise be there if it was just one person, person's work that, you know, that became popular and circled around the Internet. And especially in this case, because two of the very similar graphics deal with the exact same issue, probably, I imagine, slightly different data, but, you know, the exact same sort of, you know, variables, I guess, that you're trying to show. And they did it, you know, in the exact same way.",
      "id": "ep_23_ut_109"
    },
    {
      "end": 2170984,
      "speaker": "Moritz Stefaner",
      "start": 2154400,
      "text": "Yeah, but it's tricky. It might be a case, as Maria said, that in a non corporate environment, maybe they would have totally nicely attributed everything and explained how it came about and probably the deadline was tight and, you know, and so on, but in a corporate environment, you cannot.",
      "id": "ep_23_ut_110"
    },
    {
      "end": 2173304,
      "speaker": "Mahir Yavuz",
      "start": 2171072,
      "text": "And the weave source is so easy to find.",
      "id": "ep_23_ut_111"
    },
    {
      "end": 2189826,
      "speaker": "Moritz Stefaner",
      "start": 2173392,
      "text": "Right, exactly. It's tricky. Enrico, what do you think on these cases? Or are you still fixing your headphones? Fixing his headphones, but more.",
      "id": "ep_23_ut_112"
    },
    {
      "end": 2273690,
      "speaker": "Mahir Yavuz",
      "start": 2189938,
      "text": "I was actually. I have a question to both of you guys. Sometimes, do you, like, we all practice visualization and design and sometimes don't you also feel that the amount of the solutions that we can apply to a data set is kind of limited and some certain patterns, like, they work the best? And, like, sometimes because I have this kind of conflict with myself that actually I just want to try to find something, but it's not possible. And, like, you have to end up with a network graph, you know, like, and that is a very tricky part because, like, force directed networks and algorithms, they all kind of look the same at the end, you know, it is. Yeah, but that is the, that's the most appropriate solution. So it's very tricky. And I was thinking that, you know, maybe it is also increasing our visual literature, literacy and culture to see all these, like, ripoffs and remakes and, like, bad copies and good copies. And unless there is a really, you know, huge gain and, you know, like, and really ugly ethical problem, you know, like, I'm trying to say that actually I really don't mind that much, like, what's really going on because I kind of accepted that this is the nature of this time related to, like, digital technologies and GitHub and.",
      "id": "ep_23_ut_113"
    },
    {
      "end": 2310120,
      "speaker": "Bryan Connor",
      "start": 2273770,
      "text": "Yeah, I mean, I don't know if I agree that there are a limited set of these things, but especially since, you know, you can, you can put two people to visualizing the same data set and come up, you know, with something very, very different. You know, there's just so many, so many ways to go. So I don't know. I don't know if it's limited, but I definitely agree, you know, that there, that there's nothing wrong with what's been happening is just sort of, it's sort of proving and almost darwinian, I guess, a little bit in the ways that these visualization types either get reused or forgotten entirely.",
      "id": "ep_23_ut_114"
    },
    {
      "end": 2407830,
      "speaker": "Moritz Stefaner",
      "start": 2311260,
      "text": "Let me frame it a bit wider. I think what we're developing here together is a language, and we're all working towards developing that language. And it's so exciting also to explore what this language can express and what is best expressed, how in that language and so on. And I mean, the key point about a language is convention and a common ground and rehearsed patterns and repeated patterns. I mean, if every new utterance is new, there is no language. And so I think that's a really interesting part, that it only works if there are conventions and repeated things that we can rely, the other person understands. And at the same time, you want to add something new and sort of create new thoughts and create new, new expression. I think it's much more a matter of how you do that or how you pick up other people's thoughts and what you do with them. And I think we discussed a lot of the subtleties there already. Like, do you reference back? Do you add something personally? Do you maybe take a thought and pretend it's your own? You know, like trying to sort of negate the, the existence of the, the original source. You know, these are the things where it becomes problematic, but this whole idea of seeing something and integrating it into your work, I think it's super vital. And we shouldn't, I think, in the contrary, we should not be scared to do that. So I feel I'm maybe sometimes too scared of coming across as too unoriginal if I do something I have seen before, which I liked, which is totally stupid, actually.",
      "id": "ep_23_ut_115"
    },
    {
      "end": 2414866,
      "speaker": "Enrico Bertini",
      "start": 2408930,
      "text": "Plus, I think we should never forget that our goal is to do something that works occasionally.",
      "id": "ep_23_ut_116"
    },
    {
      "end": 2416070,
      "speaker": "Moritz Stefaner",
      "start": 2414978,
      "text": "Occasionally.",
      "id": "ep_23_ut_117"
    },
    {
      "end": 2477690,
      "speaker": "Enrico Bertini",
      "start": 2420090,
      "text": "I mean, this is, this is especially important for me as an academic, but I think it's important for everyone. And I see two contrasting trends here. So from the one end, you want to make sure that you're making some innovation, but you also want to make sure that you learn what works and what doesn't work. Right. And one problem I see now that is that there is not enough reflection on what works and what doesn't work. Right. Or even enough science telling us what works because it's very complex. Right. So I think one of the biggest challenges for people like me or my colleagues is to do much more research towards the direction of understanding in what kind of specific context something might work or might not work. So you as a designer might be more able to predict whether something is a good designer or nothing, even before deploying a solution to somebody. Right. I think that's really, really important, and we are very far from having that.",
      "id": "ep_23_ut_118"
    },
    {
      "end": 2490954,
      "speaker": "Moritz Stefaner",
      "start": 2477810,
      "text": "Yeah, yeah. But that also means, like, not blindly copying stuff, but sort of really reflecting why it was used and how you could adapt it in your new context, what the difference is and so on. But, yeah, you're absolutely right.",
      "id": "ep_23_ut_119"
    },
    {
      "end": 2522438,
      "speaker": "Enrico Bertini",
      "start": 2491042,
      "text": "Yeah. I think there is, there is a kind of little bit of a dark side of originality in this because we have to keep in mind that the final goal is to do something that works. Right. And again, I think that's the same thing in design in general. Right. So from the one end, you might want to be original to attract people. You have all sorts of different. You can see this thing from all sorts of different angles. But in the end, at least the first thing you have to take care of is that something works. Right. If it doesn't work, then you have a problem.",
      "id": "ep_23_ut_120"
    },
    {
      "end": 2577690,
      "speaker": "Bryan Connor",
      "start": 2522494,
      "text": "Absolutely. Which is why, you know, it's hard to compare to maybe a movie remake or a song cover just because, you know, it's sometimes, you know, visualization is fun to compare to those things, like the early days of film, I think, you know, is an analogy we hear a lot or something like that. But in the end, you know, it is quite different for the reasons that Enrico, you were just talking about the. The function of it and, you know, sort of the goals of it, I think, are pretty different. This, you know, there's certainly a creative and aesthetic aspect which may follow some of the same sort of conventions set by these other things, film and music. But the other pieces, I think, are following a new set of conventions that I think we're still defining not only just the language of the visualizations themselves, but, I mean, we're still trying to figure out how to talk about it as a community, I think.",
      "id": "ep_23_ut_121"
    },
    {
      "end": 2578906,
      "speaker": "Moritz Stefaner",
      "start": 2578290,
      "text": "Yeah.",
      "id": "ep_23_ut_122"
    },
    {
      "end": 2641130,
      "speaker": "Enrico Bertini",
      "start": 2579018,
      "text": "And I think this goes back to the problem of visual literacy that my hero was mentioning before. So, I mean, honestly, I don't know how deeply the average visualization user viewer is looking at these things that we produce. Right? It depends on the tech, on the setting, it depends on the goal, it depends on infinite number of variables. But honestly, I think this is. So do we want our, our customers or users to look at what we produce and just say, oh, that's cool, let's, let's show it to somebody else or do some, or extract some useful information out of it? That's another big challenge. And I think it's important that we, people like us who are working in this area and in some sense trying to develop the field further, we have to ask ourselves this kind of question and in a way also help people elaborating in a much deeper way what we produce.",
      "id": "ep_23_ut_123"
    },
    {
      "end": 2672920,
      "speaker": "Moritz Stefaner",
      "start": 2642630,
      "text": "Yeah, I mean, one case where it's really nicely worked out, I think, and where you can really see how technique can mature is for instance, the stream graphs. So we collected a few brief history of the stream graphs. So you know, in the beginning these were like handmade, like the big histo map you might have seen, which is like a huge map of the whole history of the world, handmade. Then in the, let's say, I think nineties, right, Enrico at the theme river must have been 99, something like this.",
      "id": "ep_23_ut_124"
    },
    {
      "end": 2674780,
      "speaker": "Enrico Bertini",
      "start": 2672960,
      "text": "I think it's late nineties.",
      "id": "ep_23_ut_125"
    },
    {
      "end": 2711650,
      "speaker": "Moritz Stefaner",
      "start": 2675320,
      "text": "So that was the first algorithmic implementation of that sort of pattern maybe, or that sort of idea. And I think that's always an important point. Like once you have the algorithm you have described also the abstract idea, not just executed it a couple of times, and then it was redone and redone and redone by many, many people. And like Martin Wattenberg, Lee Byron, they thought about like how to shift the baselines there and how to compare different ways of drawing it. And now it's something that's available basically to everybody. It's got to be integrated in the new excel, by the way.",
      "id": "ep_23_ut_126"
    },
    {
      "end": 2712558,
      "speaker": "Mahir Yavuz",
      "start": 2711990,
      "text": "Oh really?",
      "id": "ep_23_ut_127"
    },
    {
      "end": 2736646,
      "speaker": "Moritz Stefaner",
      "start": 2712614,
      "text": "Yes, new Excel has stream graphs and, but you can see, you know, it took basically, I mean over 100 years, or at least, let's say over 15 years of the last 15 years, just to establish that thing as something that is a proper pattern and a proper diagram type, probably. So I think it just takes a lot of time to.",
      "id": "ep_23_ut_128"
    },
    {
      "end": 2739570,
      "speaker": "Mahir Yavuz",
      "start": 2736798,
      "text": "It's a matter of nature. Natural selection.",
      "id": "ep_23_ut_129"
    },
    {
      "end": 2741050,
      "speaker": "Moritz Stefaner",
      "start": 2739870,
      "text": "Yeah, exactly.",
      "id": "ep_23_ut_130"
    },
    {
      "end": 2743648,
      "speaker": "Bryan Connor",
      "start": 2741350,
      "text": "Very darwinistic, you know, exactly.",
      "id": "ep_23_ut_131"
    },
    {
      "end": 2755220,
      "speaker": "Moritz Stefaner",
      "start": 2743744,
      "text": "So maybe we are just the host for these parasites that are called diagrams and they want to reproduce and you know, they want to meet their friends on the Internet and so they infect our minds.",
      "id": "ep_23_ut_132"
    },
    {
      "end": 2774964,
      "speaker": "Enrico Bertini",
      "start": 2761360,
      "text": "But that's the thing, I'm glad that you came up with this example because I am for instance myself very skeptical on the effectiveness of this kind of chart. I'm curious to hear your, your experience with this kind of chart.",
      "id": "ep_23_ut_133"
    },
    {
      "end": 2784612,
      "speaker": "Moritz Stefaner",
      "start": 2775092,
      "text": "It's interesting. It's one of the go to charts when you want to do something non standard. And this has become such a standard that it's so cliche already that it's so.",
      "id": "ep_23_ut_134"
    },
    {
      "end": 2785692,
      "speaker": "Enrico Bertini",
      "start": 2784636,
      "text": "Is it the next pie chart?",
      "id": "ep_23_ut_135"
    },
    {
      "end": 2814800,
      "speaker": "Moritz Stefaner",
      "start": 2785716,
      "text": "It is, I think so, yeah. It's the pie chart philosophy. No, but I think, I do think they do have some value. I think they work quite nice nicely if you have this sort of mixed use case, understanding the overall development and identifying the main responsibles for main changes in that overall development. So it's like a pretty soft, I don't know, in between use case where they work quite well.",
      "id": "ep_23_ut_136"
    },
    {
      "end": 2851558,
      "speaker": "Mahir Yavuz",
      "start": 2815740,
      "text": "I'm not sure what you think, but to me, the early map examples from the map collection of Ramsey, I think they work much better than the modern ones. To me, like, maybe it's because they are, you know, hand drawn and the data set was like much more suitable for that type of visualization. I feel like steam graphs right now, like, they're kind of abused all the time, like, for any kind of data, and it is a kind of like special visualization method that might work for a certain data set or a certain context.",
      "id": "ep_23_ut_137"
    },
    {
      "end": 2907164,
      "speaker": "Bryan Connor",
      "start": 2851614,
      "text": "That's how I think I. Yeah, I think that, I mean, the effectiveness of it is almost a whole different topic to some extent. I mean, it's a really good example to bring up because it's sort of like a successful use case, or not a use case, but a successful example of something that's evolved greatly over time, made the transition into sort of a digital format, and continues to be used without controversy by many different people, without sort of referencing anything in the past. So, I mean, I wonder if it, if it brings up, you know, a path forward for us or some kind of takeaway as we're thinking about, you know, visualization and all the different forms that are coming out today. Like, is there, is there any sort of clear path for us to say how we might do that, a similar sort of thing with other kinds of visualizations? Is there, is that possible? Is that, or is this very much an outlier, you know, in terms of something?",
      "id": "ep_23_ut_138"
    },
    {
      "end": 2927250,
      "speaker": "Moritz Stefaner",
      "start": 2907212,
      "text": "I think it just happens once. Something has enough fathers and it has been around for long enough. So we have tree maps, for instance, which in the beginning everybody said, like Shneiderman's tree map, you know, or something like that, but now it's a tree map or bullet graphs, you know, they don't. Is it even few like bullet graph.",
      "id": "ep_23_ut_139"
    },
    {
      "end": 2927962,
      "speaker": "Enrico Bertini",
      "start": 2927370,
      "text": "Sparkline.",
      "id": "ep_23_ut_140"
    },
    {
      "end": 2941244,
      "speaker": "Moritz Stefaner",
      "start": 2928026,
      "text": "Sparkline is Edward Tufte. Exactly. So sparkline is interesting. Sparkline is, like, still a Tufte thing, I think, but maybe in 50 years. Yeah. Nobody knows about tufts anymore, but sparklines are everywhere.",
      "id": "ep_23_ut_141"
    },
    {
      "end": 2959600,
      "speaker": "Bryan Connor",
      "start": 2941412,
      "text": "So what do you do in the meantime when there are only a few of those things available and it's very, very clear, you know, where it started and who is spawning off of what original piece? What's the short term, I guess outcome that can happen.",
      "id": "ep_23_ut_142"
    },
    {
      "end": 2995670,
      "speaker": "Moritz Stefaner",
      "start": 2964510,
      "text": "I think the best is just. If people are just transparent about their process, I think so much can be learned anyways, about, like, you know, from process reports and how a certain project came about and why design decisions were made and just be open about, like, which. Which other projects were on your desk at the time. And, you know, and again, there's nothing bad about it at all. And probably we should all be just much more proud of our inspirations instead of trying to. Instead of being ashamed of them, you know, that's probably. Probably the main point here.",
      "id": "ep_23_ut_143"
    },
    {
      "end": 3018146,
      "speaker": "Enrico Bertini",
      "start": 2997490,
      "text": "So, where do you guys think some of these patterns emerge and some other new visual forms just are born and die after a few seconds? I mean, there is a lot of experimentation around why some of these designs spread around, even if they are not necessarily super effective, and some others.",
      "id": "ep_23_ut_144"
    },
    {
      "end": 3021590,
      "speaker": "Bryan Connor",
      "start": 3018218,
      "text": "Yeah. So it's obviously not the fact that they are effective. Right.",
      "id": "ep_23_ut_145"
    },
    {
      "end": 3026280,
      "speaker": "Enrico Bertini",
      "start": 3022700,
      "text": "Yeah, exactly. That's not the plan. So, what's the component there?",
      "id": "ep_23_ut_146"
    },
    {
      "end": 3047082,
      "speaker": "Moritz Stefaner",
      "start": 3026780,
      "text": "I mean, some are easy to reproduce and still look like a lot of work. So I think in the beginning, like, the word clouds or so everybody was like, wow, how did they do that? You know, it's like, so many words. So I don't know.",
      "id": "ep_23_ut_147"
    },
    {
      "end": 3053050,
      "speaker": "Enrico Bertini",
      "start": 3047236,
      "text": "So, can you mention another, a clever design that didn't turn into a classic, into a pattern?",
      "id": "ep_23_ut_148"
    },
    {
      "end": 3064010,
      "speaker": "Bryan Connor",
      "start": 3053430,
      "text": "Hmm. It's tough because it's not a pattern. What things have you forgotten?",
      "id": "ep_23_ut_149"
    },
    {
      "end": 3071170,
      "speaker": "Moritz Stefaner",
      "start": 3065110,
      "text": "Yeah, but it's a good question. Like, what were. Were there any trends that really went away, like diagram type wise, I mean.",
      "id": "ep_23_ut_150"
    },
    {
      "end": 3073390,
      "speaker": "Enrico Bertini",
      "start": 3071470,
      "text": "Oh, that's the thing. I have one. Sorry.",
      "id": "ep_23_ut_151"
    },
    {
      "end": 3074290,
      "speaker": "Moritz Stefaner",
      "start": 3073470,
      "text": "Yeah, please.",
      "id": "ep_23_ut_152"
    },
    {
      "end": 3099370,
      "speaker": "Enrico Bertini",
      "start": 3075230,
      "text": "So, I personally love glyphs, and Moritz is the only person I know who's been using glyphs and making them popular, and I haven't seen them used since then, so it didn't really. People didn't really catch up with it. Right. And they. In some cases, they work really, really well. Why that? Why people didn't try to replicate this kind of stuff?",
      "id": "ep_23_ut_153"
    },
    {
      "end": 3142950,
      "speaker": "Moritz Stefaner",
      "start": 3100960,
      "text": "Yeah, it's interesting. Yeah. I mean, I think many people don't even know what a glyph is. No, really, it's not, it's not an excel. It's not in excel. It's not in your newspaper, you know, so I don't know, probably haven't seen many. And so they don't even come to the idea. But I think, I mean, there are some visual cliches, I think, that you cannot seriously do. Oh, what am I saying? Wow, I still see that so much.",
      "id": "ep_23_ut_154"
    },
    {
      "end": 3147002,
      "speaker": "Enrico Bertini",
      "start": 3145930,
      "text": "You are following.",
      "id": "ep_23_ut_155"
    },
    {
      "end": 3193006,
      "speaker": "Mahir Yavuz",
      "start": 3147186,
      "text": "I think maybe it's because of, like, I also cannot exactly name a certain example right now, but I know that, you know, there's so many good design pieces, not only in visualization, but in the history of design. There are so many good design pieces, we don't really use them right now. I think it's also kind of related to the trends and the distribution channels. Like, I mean, we should all agree that D3 created an enormous impact in the visualization scene in the last two years, just because that the distribution channel of D3 is so powerful and every, and it's so easy. So, and this is of course, like, it's kind of like mass media, right? You know, if pasta decides to include another pattern into the next library, then it's no surprise that we are going to see it everywhere.",
      "id": "ep_23_ut_156"
    },
    {
      "end": 3212678,
      "speaker": "Moritz Stefaner",
      "start": 3193118,
      "text": "And the funny thing is, D3, the success is very much driven by the demos and the quick examples that you can take remakes and do your own thing with it. I think that's a big part of the success, is that D3 is so remixable. In a sense, it's the GitHub culture.",
      "id": "ep_23_ut_157"
    },
    {
      "end": 3215104,
      "speaker": "Mahir Yavuz",
      "start": 3212774,
      "text": "It's not only about visualization. I think.",
      "id": "ep_23_ut_158"
    },
    {
      "end": 3287530,
      "speaker": "Bryan Connor",
      "start": 3215262,
      "text": "Well, that's, I mean, that's another, that's another good concept, right? I mean, some of the examples that we, I've already talked about, one of them is sort of put out by a news organization and then a later one is put up on GitHub, you know, so I think the, you know, people's motivation behind putting them up on GitHub might be, you know, very sort of pure and altruistic and saying, now this is accessible to more people. You know, it's much more visible. You can use the same format because it did work so well, potentially in the original, but the original sort of code effort, all the work, the design that went into it, is now on GitHub for other people to use. So the question is whether that's, I guess, a short term sentiment that we'll have about that sort of thing being taboo to open source visualization types, maybe specifically is that, you know, sort of a short term feeling. Is there always going to be some. Some animosity there? Or will we get to a point where it just makes sense to even put the original source on GitHub and really try and, you know, spread. Spread the love around, I guess.",
      "id": "ep_23_ut_159"
    },
    {
      "end": 3291174,
      "speaker": "Moritz Stefaner",
      "start": 3288390,
      "text": "Oh, many people have time to. Yeah, yeah, yeah.",
      "id": "ep_23_ut_160"
    },
    {
      "end": 3293490,
      "speaker": "Mahir Yavuz",
      "start": 3291262,
      "text": "Is this the time for snowfall now?",
      "id": "ep_23_ut_161"
    },
    {
      "end": 3296690,
      "speaker": "Moritz Stefaner",
      "start": 3294910,
      "text": "Shall we open snowfall?",
      "id": "ep_23_ut_162"
    },
    {
      "end": 3304390,
      "speaker": "Mahir Yavuz",
      "start": 3299050,
      "text": "Yeah, but it's a great story. I mean, snowfall story. I think it's kind of important.",
      "id": "ep_23_ut_163"
    },
    {
      "end": 3306470,
      "speaker": "Moritz Stefaner",
      "start": 3304930,
      "text": "Okay, so go ahead.",
      "id": "ep_23_ut_164"
    },
    {
      "end": 3310630,
      "speaker": "Mahir Yavuz",
      "start": 3308370,
      "text": "Well, I mean, I think many of.",
      "id": "ep_23_ut_165"
    },
    {
      "end": 3316990,
      "speaker": "Enrico Bertini",
      "start": 3313210,
      "text": "We never had a dog. That's a new entry.",
      "id": "ep_23_ut_166"
    },
    {
      "end": 3391890,
      "speaker": "Mahir Yavuz",
      "start": 3318050,
      "text": "Well, I think. I think it's most of the people that I assume you are followers of this podcast, they already know that the snowfall website or micro website that has been produced by New York Times and Cody Brown, co founder of the interactive web design tools scroll kit, just created almost the same version of it. And then this created a controversy between New York Times and them and they had to put it down because of, like, copyright laws and the complaints from New York Times. So I don't know what you guys think, but it's kind of like when a company just means being inspired and grabbing patterns and, like, applying them in a kind of professional way, then they kind of, you know, have the ownership of that thing which is not actually just only belonging to them, it's actually belonging to the community originally. So. And then when they try to defend the copyrights for the thing that actually they have been inspired from many other people, that is a little bit problematic to me.",
      "id": "ep_23_ut_167"
    },
    {
      "end": 3392346,
      "speaker": "Enrico Bertini",
      "start": 3391930,
      "text": "I don't know.",
      "id": "ep_23_ut_168"
    },
    {
      "end": 3393230,
      "speaker": "Mahir Yavuz",
      "start": 3392378,
      "text": "Like, it's.",
      "id": "ep_23_ut_169"
    },
    {
      "end": 3441130,
      "speaker": "Moritz Stefaner",
      "start": 3393850,
      "text": "Yeah, I think there's a, like a misunderstanding on two sides. I mean, the one misunderstanding is that you cannot own the idea for a page like snowfall. I mean, that's ridiculous. You know, it's. Maybe some people would like it to own ideas like that, but it's just not possible. It doesn't even make sense, like, logically, you know, if you think that through. But the other thing is like, scroll kid. I mean, what they did is just replicate the technical part, not the editorial. But then they were quite like. I don't know, they were asking for trouble, in my opinion, because they wrote, like, it took the New York Times half a year and hundreds of hours to hand. Cold snowfall. We made a replica in an hour. You know, it's like. It is asking for trouble. It's like dancing naked in front of you.",
      "id": "ep_23_ut_170"
    },
    {
      "end": 3447446,
      "speaker": "Mahir Yavuz",
      "start": 3441750,
      "text": "Actually, it is a great statement because doing something like unique takes really, like half a year.",
      "id": "ep_23_ut_171"
    },
    {
      "end": 3448050,
      "speaker": "Moritz Stefaner",
      "start": 3447478,
      "text": "Yeah.",
      "id": "ep_23_ut_172"
    },
    {
      "end": 3459830,
      "speaker": "Mahir Yavuz",
      "start": 3448470,
      "text": "Making the replica of the same thing in today's technologies, it literally takes half a day. But that's not the kind of like statement that you should be proud of. That's the situation.",
      "id": "ep_23_ut_173"
    },
    {
      "end": 3476050,
      "speaker": "Moritz Stefaner",
      "start": 3459950,
      "text": "Yeah. So it took you hundreds of hours to build that Sandh castle. I just walked over it in 5 seconds. Yeah. What's your take, Brian? Enrico.",
      "id": "ep_23_ut_174"
    },
    {
      "end": 3523510,
      "speaker": "Enrico Bertini",
      "start": 3480950,
      "text": "I don't know. I mean, copyright is such a. It's really hard to tell something. I don't know. Have a last word on that. I was just. I was just wondering if there are. So I was trying to recall if there are any visualization techniques that are under copyright. And I think there are. And I vaguely remind. I vaguely recalled a presentation some time ago from Besch Niderman. I think he did some kind of study comparing how some. Some early visualization techniques didn't spread because they were under.",
      "id": "ep_23_ut_175"
    },
    {
      "end": 3526050,
      "speaker": "Moritz Stefaner",
      "start": 3523590,
      "text": "What, you mean patented, right? You mean patents?",
      "id": "ep_23_ut_176"
    },
    {
      "end": 3593530,
      "speaker": "Enrico Bertini",
      "start": 3526830,
      "text": "Sorry, patented, yeah, I wanted to say patented. Thanks for correcting me. I think some initial visualization technique, some early visualization techniques had been patented and they never spread. And some others, like tree maps, they didn't and they become a huge success. So I think. I was trying to recall the title. I think I found it. I think it's called innovation trajectories for information visualizations comparing tree maps, cone trees and hyperbolic trees. So did you guys ever heard of cone trees and hyperbolic trees? No. Okay. I think if I recall it correctly, the paper shows that there were some scientific studies showing that these are very legitimate and working techniques and working really well compared to some other techniques, but they never become popular because they were patented. So here we have another kind of scientific.",
      "id": "ep_23_ut_177"
    },
    {
      "end": 3597304,
      "speaker": "Moritz Stefaner",
      "start": 3593610,
      "text": "Yeah, ideas protected to death, right?",
      "id": "ep_23_ut_178"
    },
    {
      "end": 3652970,
      "speaker": "Bryan Connor",
      "start": 3597442,
      "text": "I think that's somewhat similar to the snowfall idea. It's sort of like the worst case scenario or the direction that we don't want things to go in on. This topic of patterns and reusing ideas on both sides of the fence, I think both in the enforcement of copyrights or patents and also the way that these things are. Are sort of replicated quickly in that case. But I mean, I'm sure I can totally understand that study, Enrico. I mean, it's a difficult one, I guess, to justify or it makes sense in the abstract, but you worry about the specific scenarios in which those things will actually be enforced because. Because of the parties involved.",
      "id": "ep_23_ut_179"
    },
    {
      "end": 3708000,
      "speaker": "Moritz Stefaner",
      "start": 3653870,
      "text": "Yeah, I mean, I guess all four of us are somehow in the ideas business. And I think the ideas business is a fun business to be in. But it's at the same time very difficult to actually figure out how to live off that and how to make sure the things you create, they have a life of their own and they go out in the world, they, they become famous, but at the same time that you stay in some way attached to them and not, you know, so, and I think reference is so important there. And for me that's, that's really the key point that if people, so I'm super happy if somebody picks something up. I started, but just, you know, if the question comes up, I would like to be mentioned then and say like, yeah, it originally came from this guy. And, you know, something like that. I think that's so important that you somehow stay connected to the things you created.",
      "id": "ep_23_ut_180"
    },
    {
      "end": 3736878,
      "speaker": "Mahir Yavuz",
      "start": 3708460,
      "text": "So Moritz, I have a question to you. Just because you brought up this issue in academia, when you write a research paper, there is already very well defined citation rules. What do you think that in visualization scene or in design scene, do you have any idea that how we can improve, like the citation rules or ethical rules or principles or you just expect to be happen like.",
      "id": "ep_23_ut_181"
    },
    {
      "end": 3763430,
      "speaker": "Moritz Stefaner",
      "start": 3737014,
      "text": "No, I have this vague idea in mind that we need a proper vocabulary that is very, you know, really explicit in a sense, like you have below each work. You have like, you have different like things you refer to like inspired by or took this technique from Orlando came up in a conversation with, you know, like different well formed reference formats. I would love that. I would really love that.",
      "id": "ep_23_ut_182"
    },
    {
      "end": 3777494,
      "speaker": "Mahir Yavuz",
      "start": 3763590,
      "text": "I was actually thinking about like these mapping services, you know, like maps. The world map is just basically the, like the most great visualization we always use over and over and over and over.",
      "id": "ep_23_ut_183"
    },
    {
      "end": 3777726,
      "speaker": "Moritz Stefaner",
      "start": 3777542,
      "text": "Right.",
      "id": "ep_23_ut_184"
    },
    {
      "end": 3783720,
      "speaker": "Mahir Yavuz",
      "start": 3777758,
      "text": "You know, but, and the world map is not owned by any but map services. They always have like their remarks.",
      "id": "ep_23_ut_185"
    },
    {
      "end": 3784980,
      "speaker": "Moritz Stefaner",
      "start": 3783760,
      "text": "Yeah, copyright.",
      "id": "ep_23_ut_186"
    },
    {
      "end": 3807434,
      "speaker": "Mahir Yavuz",
      "start": 3785600,
      "text": "Yeah, kind of. It is copyright, but it is interesting. And then maybe, you know, the people who produce like good quality work, quality visualizations, they should make like their work open source by themselves with a kind of, you know, remark on it so some other people can just copy it and keep the labeling going.",
      "id": "ep_23_ut_187"
    },
    {
      "end": 3842124,
      "speaker": "Moritz Stefaner",
      "start": 3807482,
      "text": "I mean, I just like to be able to trace the evolution of ideas. So if I see like an awesome meteorites visualization for me, it would be great if I could backtrack, you know, back in time, like, okay, what were the significant works that led to this piece? You know, if this would somehow be facilitated, I think we could all learn so much. It wouldn't just be always like redoing the same things, making the same mistakes, just build a culture of understanding the context we're in and the conventions we have much better.",
      "id": "ep_23_ut_188"
    },
    {
      "end": 3882110,
      "speaker": "Bryan Connor",
      "start": 3842252,
      "text": "Yeah, that's really interesting. And I mean, it may not be something that you can sort of put out there as a standard and expect it to be adopted. I wonder if there's a way to do that without that expectation, without getting too far into productizing this idea. But I. Is there a way to map those things yourself and to say like, oh, one person can sort of add the links in the chain, someone else can add on for those who are also interested in the same things. I mean, maybe it's not as standardized or sort of put out there. We expect people to do this as part of their process.",
      "id": "ep_23_ut_189"
    },
    {
      "end": 3913702,
      "speaker": "Moritz Stefaner",
      "start": 3884970,
      "text": "Yeah, it's interesting. I guess both could be very valuable. Like if people like with a really good understanding off the history also, and the scene would pick out like significant developments, you know, and illustrate them with really good examples, that could also be really nice. Yeah, good stuff. I mean, it's a long topic. Enrico, are you still alive? Yeah, I am going to lunch already.",
      "id": "ep_23_ut_190"
    },
    {
      "end": 3923018,
      "speaker": "Enrico Bertini",
      "start": 3913806,
      "text": "It's just that I'm thinking, I'm deeply thinking about this issue. I mean, it's a hard topic today. I think there are so many different factors.",
      "id": "ep_23_ut_191"
    },
    {
      "end": 3936170,
      "speaker": "Moritz Stefaner",
      "start": 3923074,
      "text": "Can you talk a bit about science? Like how is it in science and do you think it's a good model? Or like could the open web design scene learn from the scientific ways? Or is that like in science?",
      "id": "ep_23_ut_192"
    },
    {
      "end": 3941950,
      "speaker": "Enrico Bertini",
      "start": 3936290,
      "text": "It's. In a way, it's much easier. If you don't cite things properly, you are dead.",
      "id": "ep_23_ut_193"
    },
    {
      "end": 3946220,
      "speaker": "Moritz Stefaner",
      "start": 3944420,
      "text": "That's a good world. Yeah.",
      "id": "ep_23_ut_194"
    },
    {
      "end": 3954604,
      "speaker": "Enrico Bertini",
      "start": 3946380,
      "text": "I mean, that's the thing. The related work section of a paper. It's a key section and people take it very seriously.",
      "id": "ep_23_ut_195"
    },
    {
      "end": 3957000,
      "speaker": "Moritz Stefaner",
      "start": 3954652,
      "text": "Yeah. You want to cite your reviews?",
      "id": "ep_23_ut_196"
    },
    {
      "end": 4055072,
      "speaker": "Enrico Bertini",
      "start": 3958340,
      "text": "Yeah. I've seen all sorts of battles around related work and I am myself seeking for the right references when I review a paper, I think that's part of going good practices in, good practice in science. Right. And I think the important aspect is that related work is not only important because you want to have the right credits to people who have done similar stuff in the past, but I think the added value is the fact that when you read a new, when you read a research paper, sometimes the related work is a very, is a fantastic summary of what other people have done in the field. And actually it's a sort of synthesis of all this work that somebody else has done for you. So it's fantastic and it's a very, very important section of any paper. Right. So it happened to me several times that I wanted to investigate something new, a new topic. I tried to find a couple of key papers in the area and then by just looking at the related work, I guess and all in a sudden expand, expand the number of references and have a much better idea and scheme in mind of what other people have done in this area. And this is super, super useful. I think in a way it saves a lot of time to all the other researchers and practitioners as well. Right? I mean, I guess it might have happened to you as well. I mean, if you look at the paper, you want to see what other people have done, right? You don't want to search by yourself.",
      "id": "ep_23_ut_197"
    },
    {
      "end": 4078032,
      "speaker": "Moritz Stefaner",
      "start": 4055176,
      "text": "Absolutely. And the interesting thing is science is you first define, this is the state of the art. This is what everybody knows. And here's what I found out. You know, it's like, and this contrast is so nice, you know, this, okay, here's the common ground we all share and this is where it came from. And here's the new contribution from that specific finding. And yeah, probably we could learn from you, honestly.",
      "id": "ep_23_ut_198"
    },
    {
      "end": 4080642,
      "speaker": "Enrico Bertini",
      "start": 4078096,
      "text": "You have. Yeah, yeah.",
      "id": "ep_23_ut_199"
    },
    {
      "end": 4175950,
      "speaker": "Bryan Connor",
      "start": 4080666,
      "text": "So I mean, I think, I guess the preference would be rather than saying, you know, I'm going to use a stream graph and have it sort of end there because it is so widespread. I mean, you know, having that ability and maybe it's just something that visualization practitioners and researchers would be interested in, but, you know, having the ability to trace it back to the original, the original sort of stream graph as it first appears would be interesting to people who are looking to maybe visualize data in a similar way. Or look at again, is it related to the string graph? Is it another type of visualization that does similar things in a different way? Having that map, I think could be useful to people rather than making assumptions or I guess, taking for granted the development of visualization forms. Yeah, and I think it, you know, one other thing is it's sort of exponentially hard to do in the digital realm just because things are moving so quickly and there's so many variables, I think, to ways that you can, you know, have, have the same, same form of visualization but have it work completely differently. It just adds as a whole new dimension to the development. I think it can go in, go in a lot of different directions. So it's not easy. But I mean, hopefully the, the same sort of boundaries, these things being digital products will also help us solve some of the problems that we're talking about with referencing, with linking, with looking at related works in some way.",
      "id": "ep_23_ut_200"
    },
    {
      "end": 4181470,
      "speaker": "Moritz Stefaner",
      "start": 4179370,
      "text": "Mahi, what's your final take?",
      "id": "ep_23_ut_201"
    },
    {
      "end": 4237728,
      "speaker": "Mahir Yavuz",
      "start": 4183370,
      "text": "I mean, I think that this is what is happening is already happening and we have to live with this reality now. And I think the academia and the scientific scene has already defined the language and the rules that you are talking about. And we didn't. And actually we can't because it's the design scene and it's in business life. So there are not only the good players in the jungle, there are also bad players. But I feel that the tendency, the overall tendency is going more into open source and people are sharing and researching a lot online. And I kind of expect that, you know, everything is going to be more going into this collective production culture. Like, you know, now you are not only doing a pet podcast on your own, you have guests and like, you already did a much bigger podcast, right. You know, we like to discuss and produce together.",
      "id": "ep_23_ut_202"
    },
    {
      "end": 4244432,
      "speaker": "Moritz Stefaner",
      "start": 4237824,
      "text": "Yeah. The whole data visualization scene is super cooperative. And anyways, I mean, so we should totally mention that as well. I mean.",
      "id": "ep_23_ut_203"
    },
    {
      "end": 4282518,
      "speaker": "Mahir Yavuz",
      "start": 4244456,
      "text": "Yeah, and so I totally believe in this community and I'm sure that. And as I, as I defined before, like, you know, I actually kind of learn something, even if it's a ripoff and even if the guys are. Don't want a reference to the original thing, but if they just improved just a small thing, you know, like that is a, that is a knowledge, you know, like I can't really like it's their problem that they are just ripoff people. But, you know, there is that value still and that is kind of important. That's my final take on this.",
      "id": "ep_23_ut_204"
    },
    {
      "end": 4286966,
      "speaker": "Moritz Stefaner",
      "start": 4282614,
      "text": "Yeah. Good discussion. Great.",
      "id": "ep_23_ut_205"
    },
    {
      "end": 4306298,
      "speaker": "Enrico Bertini",
      "start": 4287078,
      "text": "Yeah, go ahead. I know. I just wanted to say that the whole idea of copyrights and patents and stuff like that, I think it changed so much during the last few years, and honestly, when I hear something about patent and copyright, it sounds to me so much 20 years ago.",
      "id": "ep_23_ut_206"
    },
    {
      "end": 4306466,
      "speaker": "Bryan Connor",
      "start": 4306314,
      "text": "Yeah.",
      "id": "ep_23_ut_207"
    },
    {
      "end": 4309750,
      "speaker": "Moritz Stefaner",
      "start": 4306498,
      "text": "It's like a fax. I'll send you a fax with my patent.",
      "id": "ep_23_ut_208"
    },
    {
      "end": 4316154,
      "speaker": "Enrico Bertini",
      "start": 4312450,
      "text": "That's the thing. You might like it or not, but the world has changed.",
      "id": "ep_23_ut_209"
    },
    {
      "end": 4317070,
      "speaker": "Moritz Stefaner",
      "start": 4316202,
      "text": "Exactly.",
      "id": "ep_23_ut_210"
    },
    {
      "end": 4342952,
      "speaker": "Enrico Bertini",
      "start": 4317770,
      "text": "I'm sorry. I mean, I'm sorry for all the writers in the world, for all the musicians in the world and so on, I could mention another thousand categories. The world has changed. There's no way to go back to where we were before. Right. So I think. I think I had this kind of discussion last week with somebody who was an expert in copyright or something like that. I mean, I don't know. What's your take on that?",
      "id": "ep_23_ut_211"
    },
    {
      "end": 4383864,
      "speaker": "Moritz Stefaner",
      "start": 4343056,
      "text": "I totally agree. I mean, I think. Yeah, and this is what I mean with the ideas business and the knowledge business, you know, we have to learn how to, you know, how to work in this new world. And I mean, maybe that even ties back to Flattr you know, what we mentioned at the beginning that, you know, now you don't subscribe to the New York Times anymore, but you listen to podcasts, but still, you have to maybe think about, like, how these are financed. And so we have to think about how can we, how can, you know, how can we make sure that the people creating stuff are being compensated without, like, having super restrictive, like, patent wars and only the rich get richer? You know, that's the big story here, I guess.",
      "id": "ep_23_ut_212"
    },
    {
      "end": 4400416,
      "speaker": "Enrico Bertini",
      "start": 4383912,
      "text": "Yeah. Plus, I think we are living in this paradox today that if you. As a. As a creative person, as an author, if you spend too much time thinking, thinking whether somebody will steal your idea, you might get lost. That's not the point, right?",
      "id": "ep_23_ut_213"
    },
    {
      "end": 4401040,
      "speaker": "Moritz Stefaner",
      "start": 4400448,
      "text": "Yeah.",
      "id": "ep_23_ut_214"
    },
    {
      "end": 4420490,
      "speaker": "Enrico Bertini",
      "start": 4401200,
      "text": "I mean, if you think. If you are too much worried about that, I feel kind of like you're wasting your mental energy. Just do your work and spread it around. And if it works, it works. I mean, actually what happens is that if people copy it, it's even better. Right?",
      "id": "ep_23_ut_215"
    },
    {
      "end": 4424890,
      "speaker": "Mahir Yavuz",
      "start": 4421390,
      "text": "I mean, that's a kind of common practice in design school, right?",
      "id": "ep_23_ut_216"
    },
    {
      "end": 4425870,
      "speaker": "Enrico Bertini",
      "start": 4425230,
      "text": "Yeah.",
      "id": "ep_23_ut_217"
    },
    {
      "end": 4439994,
      "speaker": "Mahir Yavuz",
      "start": 4425990,
      "text": "In the undergrad programs, you show, like, all these successful designs in the history, and whether you like it or not, most of the students, they just try to copy them because they. You, as a teacher, you tell them that this is successful. So. And they want to get the.",
      "id": "ep_23_ut_218"
    },
    {
      "end": 4447378,
      "speaker": "Bryan Connor",
      "start": 4440102,
      "text": "Well, I mean, that's how kids learn. Yeah, exactly. That's. That's what I was saying. It's. The first part of learning is, you know, copying things.",
      "id": "ep_23_ut_219"
    },
    {
      "end": 4458190,
      "speaker": "Mahir Yavuz",
      "start": 4447434,
      "text": "Yeah, yeah, but, yeah, I think we are all looking for certain ethics and principles that we can all, like, agree, and it should be the common sense already. You know, like, that's all.",
      "id": "ep_23_ut_220"
    },
    {
      "end": 4488892,
      "speaker": "Enrico Bertini",
      "start": 4460010,
      "text": "There is definitely some value in copying in terms of the educational component of it is definitely really important. And I mean, and if you want to learn how to twist any design, you have to first learn how to copy it. Right. So I think it's. It's not bad. It's not necessarily bad. I think it's more, as you guys said, it's more a matter of properly referencing people. I think that's. That's the.",
      "id": "ep_23_ut_221"
    },
    {
      "end": 4522428,
      "speaker": "Moritz Stefaner",
      "start": 4488956,
      "text": "Yeah, that's my main point as well. I mean, we're all children of, like, our experiences and the conventions around us and what we seed. I. But, like, for at some points, just stop and think, like, okay, this one work I just got famous with, who's. Whose influences are actually responsible for that, and maybe, you know, just make that clear in public and. Yeah. And then everybody, like, lives in this culture of, you know, cross inspiration and proper acknowledgement. I think that would be awesome. Cool. Good discussion, guys.",
      "id": "ep_23_ut_222"
    },
    {
      "end": 4523380,
      "speaker": "Enrico Bertini",
      "start": 4522524,
      "text": "Very good.",
      "id": "ep_23_ut_223"
    },
    {
      "end": 4526960,
      "speaker": "Moritz Stefaner",
      "start": 4523540,
      "text": "Yeah, I think we just solved one of the problems of the 21st century.",
      "id": "ep_23_ut_224"
    },
    {
      "end": 4529372,
      "speaker": "Mahir Yavuz",
      "start": 4528820,
      "text": "Great.",
      "id": "ep_23_ut_225"
    },
    {
      "end": 4533924,
      "speaker": "Moritz Stefaner",
      "start": 4529476,
      "text": "Yeah. The solution is be kind to each other and. Yeah, use your common sense.",
      "id": "ep_23_ut_226"
    },
    {
      "end": 4535204,
      "speaker": "Bryan Connor",
      "start": 4534012,
      "text": "Don't worry so much.",
      "id": "ep_23_ut_227"
    },
    {
      "end": 4542960,
      "speaker": "Moritz Stefaner",
      "start": 4535332,
      "text": "Don't worry. Exactly. Ideas go nowhere. You know, you can instill them, you can just copy them. So no worries about that.",
      "id": "ep_23_ut_228"
    },
    {
      "end": 4545196,
      "speaker": "Enrico Bertini",
      "start": 4543860,
      "text": "And you cannot control them.",
      "id": "ep_23_ut_229"
    },
    {
      "end": 4545868,
      "speaker": "Moritz Stefaner",
      "start": 4545228,
      "text": "Yeah.",
      "id": "ep_23_ut_230"
    },
    {
      "end": 4548680,
      "speaker": "Mahir Yavuz",
      "start": 4546044,
      "text": "So keep calm and visualize.",
      "id": "ep_23_ut_231"
    },
    {
      "end": 4569460,
      "speaker": "Moritz Stefaner",
      "start": 4550820,
      "text": "Here's your teacher. Okay, guys, awesome to have you. Okay, talk soon. New York. And Enrico. Brian, you have to come to New York as well so we can do a second edition, so we can self plagiarize.",
      "id": "ep_23_ut_232"
    },
    {
      "end": 4571552,
      "speaker": "Enrico Bertini",
      "start": 4570480,
      "text": "Absolutely.",
      "id": "ep_23_ut_233"
    },
    {
      "end": 4575440,
      "speaker": "Moritz Stefaner",
      "start": 4571696,
      "text": "Okie doke. Have a great day. Evening. Great having you.",
      "id": "ep_23_ut_234"
    },
    {
      "end": 4578400,
      "speaker": "Enrico Bertini",
      "start": 4575480,
      "text": "Okay, bye bye. Good night. Fight.",
      "id": "ep_23_ut_235"
    }
  ],
  "confidence": 0.922455644846114,
  "audio_duration": 4590,
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_status_code": null,
  "webhook_auth": false,
  "webhook_auth_header_name": null,
  "speed_boost": false,
  "auto_highlights_result": null,
  "auto_highlights": false,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_audio_quality": null,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "content_safety": false,
  "iab_categories": true,
  "content_safety_labels": {
    "status": "unavailable",
    "results": [],
    "summary": {}
  },
  "language_detection": false,
  "language_detection_threshold": null,
  "language_confidence": null,
  "custom_spelling": null,
  "throttled": false,
  "auto_chapters": true,
  "summarization": false,
  "summary_type": null,
  "summary_model": null,
  "custom_topics": false,
  "topics": [],
  "speech_threshold": null,
  "speech_model": "best",
  "chapters": [
    {
      "summary": "Moritz: Life is good. It's getting a little more relaxed. I'll go to New York in a week, Enrico. We should organize a Google hangout. Moritz: I have a plan, but the plan is bigger than me.",
      "gist": "A Google Hangout",
      "headline": "Moritz: After several attempts on organizing another hangout, failed miserably",
      "start": 8000,
      "end": 106680,
      "id": "ep_23_ch_0"
    },
    {
      "summary": "This week's podcast features a Flattr button. If you are on flutter, you can Flattr us now, or you might want to look at the site and subscribe us there and help us a little with the server costs. A couple of guests talk about the fine boundary between inspiration and plagiarism.",
      "gist": "Flatter",
      "headline": "Flutter is a service that lets you pay for media on the web",
      "start": 107340,
      "end": 258044,
      "id": "ep_23_ch_1"
    },
    {
      "summary": "We have Brian Connor from the y axis. And we have Mayer javous from SEED scientific. We normally let our guests introduce themselves. Brian, you want to start introducing yourself? Sure.",
      "gist": "Introducing the y axis",
      "headline": "We normally let our guests introduce themselves, so maybe. Brian, you want to start introducing yourself",
      "start": 258172,
      "end": 324130,
      "id": "ep_23_ch_2"
    },
    {
      "summary": "Do we always have to make new things? Or when is something a ripoff of something else? When is there a clear inspiration? And so pretty quickly, like a quick discussion started also with Andy Kirk. And now here we are to discuss them.",
      "gist": "The Question of Originality in Data Visualization",
      "headline": "This episode focuses on authorship and originality in data visualization",
      "start": 325960,
      "end": 414530,
      "id": "ep_23_ch_3"
    },
    {
      "summary": "The density of people copying each other is heavily increased in the last year. We wondered if everyone is applying the same methodology in different visualizations or this is actually kind of killing the creativity. How would the designer think about their work being open sourced?",
      "gist": "Is It Time to Stop Copying Each Other?",
      "headline": "Brian: I think we are already in a copycat scene on Twitter",
      "start": 416960,
      "end": 899360,
      "id": "ep_23_ch_4"
    },
    {
      "summary": "When a certain style in design turns into a pattern, we have this concept of design patterns. But right now, with so many different types of visualizations, it is kind of hard to draw the borders of the patterns and define the new patterns.",
      "gist": "Quantum visualization: Do we need design patterns?",
      "headline": "When a certain style in design turns into a pattern, we have concept of design patterns",
      "start": 899400,
      "end": 1098816,
      "id": "ep_23_ch_5"
    },
    {
      "summary": "Earlier this year from Paris copic, we saw the gun murders visualization. Then maybe four or six weeks later, there was this really popular piece by pitch interactive, which was about drone strikes. So it's a totally different topic, a different visual as well, but it has a very similar narrative structure.",
      "gist": "Gun Murders and Drone Strikes",
      "headline": "Paris copic recently released a visualization about drone strikes",
      "start": 1098848,
      "end": 1165354,
      "id": "ep_23_ch_6"
    },
    {
      "summary": "Moritz: Are you necessarily giving a negative connotation to this kind of copying, or. Or you are neutral? Moritz: These two pieces are basically defining a new trend in visualization. And there is a good storytelling. And it's miles away in the end.",
      "gist": "Inventing The Data Murder: Parody",
      "headline": "Many people thought that the second piece is inspired by the first one",
      "start": 1165402,
      "end": 1285502,
      "id": "ep_23_ch_7"
    },
    {
      "summary": "Enrico: When you make a new piece that is based on a strong inspiration coming from another design, you might actually implement it very badly or very, very well. But there you see how fine the line is between inspiration and outrageous ripoff.",
      "gist": "Bolides: An Outrageous Referendum",
      "headline": "Brian: When you make a new piece that is based on an inspiration",
      "start": 1285576,
      "end": 1695346,
      "id": "ep_23_ch_8"
    },
    {
      "summary": "If you take a design job seriously and explore all that is needed to make a really good solution, it will always be original. If you don't, then of course you end up with stereotypes.",
      "gist": "In the World of Design: Originality",
      "headline": "If you take a design job seriously, it will always be original",
      "start": 1695378,
      "end": 1739120,
      "id": "ep_23_ch_9"
    },
    {
      "summary": "A third of clients ask me to reproduce one of my own work. How do we deal with that? There seems to be a sense that visualizations can be easily replicated. But you need to respect the process that leads you to the end result.",
      "gist": "The Problem With Placing Your Work",
      "headline": "A third of clients ask me to copy their graphics, Brian says",
      "start": 1742580,
      "end": 1985112,
      "id": "ep_23_ch_10"
    },
    {
      "summary": "Several examples that follow the same pattern since then. One of them is from the Guardian again. But we also saw another version from another news source that came out around the same time as the second guardian piece. It's difficult where to draw the line there.",
      "gist": "The Guardian's Gay Rights Graphic",
      "headline": "Examples of similar graphics have appeared since the Guardian piece on gun rights",
      "start": 1985136,
      "end": 2190978,
      "id": "ep_23_ch_11"
    },
    {
      "summary": "I have a question to both of you guys. Do you feel that the amount of the solutions that we can apply to a data set is kind of limited and some certain patterns, like, they work the best? And I was thinking that maybe it is also increasing our visual literature, literacy and culture to see all these ripoffs and remakes.",
      "gist": "Copyright Fair Use of Data Visualization",
      "headline": "I have a question to both of you guys about visualization and design",
      "start": 2191114,
      "end": 2755220,
      "id": "ep_23_ch_12"
    },
    {
      "summary": "I'm curious to hear your, your experience with this kind of chart. It's one of the go to charts when you want to do something non standard. The effectiveness of it is almost a whole different topic. Is there any clear path for us to say how we might do that with other kinds of visualizations?",
      "gist": "The Pigeon Chart",
      "headline": "I'm curious about your experience with this kind of chart",
      "start": 2761360,
      "end": 2995670,
      "id": "ep_23_ch_13"
    },
    {
      "summary": "Where do you guys think some of these patterns emerge and some other new visual forms just are born and die after a few seconds? Some are easy to reproduce and still look like a lot of work.",
      "gist": "The Internet's Pattern-based Visual Forms",
      "headline": "There is a lot of experimentation around why some patterns spread around",
      "start": 2997490,
      "end": 3047082,
      "id": "ep_23_ch_14"
    },
    {
      "summary": "There are some visual cliches, I think, that you cannot seriously do. I think it's also kind of related to the trends and the distribution channels. D3 created an enormous impact in the visualization scene in the last two years. Will we get to a point where it just makes sense to put the original source on GitHub?",
      "gist": "D3: The trend of remixing",
      "headline": "D3 created an enormous impact in the visualization scene in the last two years",
      "start": 3047236,
      "end": 3291174,
      "id": "ep_23_ch_15"
    },
    {
      "summary": "Snowfall was produced by New York Times and Cody Brown, co founder of the interactive web design tools scroll kit. They created almost the same version of it. This created a controversy between New YorkTimes and them and they had to put it down because of copyright laws. What's your take, Brian? Enrico?",
      "gist": "Snowfall: The New York Times' claim to copyright",
      "headline": "New York Times put down snowfall website because of copyright controversy",
      "start": 3291262,
      "end": 3489568,
      "id": "ep_23_ch_16"
    },
    {
      "summary": "Enrico: I was trying to recall if there are any visualization techniques that are under copyright. Some early visualization techniques had been patented and they never spread. And some others, like tree maps, they didn't and they become a huge success. This topic of patterns and reusing ideas on both sides of the fence.",
      "gist": "Pushing the issue of intellectual property",
      "headline": "I was wondering if there are any visualization techniques under copyright",
      "start": 3489664,
      "end": 3708000,
      "id": "ep_23_ch_17"
    },
    {
      "summary": "Moritz: What do you think that in visualization scene or in design scene, how we can improve? He says we need a proper vocabulary that is very explicit in a sense. And then maybe, you know, the people who produce like good quality work, quality visualizations, they should make like their work open source.",
      "gist": "The Need for a Citation Code",
      "headline": "Moritz: I think we need a proper vocabulary for visualization",
      "start": 3708460,
      "end": 3901158,
      "id": "ep_23_ch_18"
    },
    {
      "summary": "Enrico: Could the open web design scene learn from the scientific ways? In a way, it's much easier. The related work section of a paper. It's a key section and people take it very seriously. If you don't cite things properly, you are dead.",
      "gist": "The importance of the related work section",
      "headline": "The related work section of a paper is very important in science",
      "start": 3901214,
      "end": 4175950,
      "id": "ep_23_ch_19"
    },
    {
      "summary": "The tendency, the overall tendency is going more into open source and people are sharing and researching a lot online. I kind of expect that everything is going to be more going into this collective production culture. That's my final take on this.",
      "gist": "Final take on the data visualization community",
      "headline": "Mahi: I think what is happening is already happening",
      "start": 4179370,
      "end": 4290502,
      "id": "ep_23_ch_20"
    },
    {
      "summary": "Enrico: The whole idea of copyrights and patents has changed so much during the last few years. There is definitely some value in copying in terms of the educational component of it is definitely really important. But it's more a matter of properly referencing people.",
      "gist": "Don't Let Anyone Steal Your Idea",
      "headline": "Brian York: There is definitely some value in copying in terms of educational",
      "start": 4290526,
      "end": 4578400,
      "id": "ep_23_ch_21"
    }
  ],
  "disfluencies": false,
  "entity_detection": false,
  "sentiment_analysis": false,
  "sentiment_analysis_results": null,
  "entities": null,
  "speakers_expected": null,
  "summary": null,
  "custom_topics_results": null,
  "is_deleted": null,
  "episode_num": "23",
  "episode_metadata": {
    "speakers": [
      "Enrico Bertini",
      "Moritz Stefaner",
      "Bryan Connor",
      "Mahir Yavuz"
    ],
    "WPid": "88",
    "url": "https://datastori.es/podlove/file/134/s/feed/c/mp3/datastories-23.mp3",
    "episode_title": "Inspiration or Plagiarism? w/ Bryan Connor and Mahir Yavuz"
  }
}