{
  "id": "f75610be-b9bb-4715-8f7e-440ff72eccb0",
  "language_model": "assemblyai_default",
  "acoustic_model": "assemblyai_default",
  "language_code": "en_us",
  "status": "completed",
  "audio_url": "https://datastori.es/podlove/file/4747/s/feed/c/mp3/111-data-vis-around-the-world-in-2017.mp3",
  "utterances": [
    {
      "end": 5074,
      "speaker": "Harry Stevens",
      "start": 280,
      "text": "I think it's a very, very exciting time to be doing data visualization in India.",
      "id": "ep_111_ut_0"
    },
    {
      "end": 31182,
      "speaker": "Enrico Bertini",
      "start": 24494,
      "text": "Hi, everyone. Welcome to a new episode of data stories. My name is Moritz Stefaner, and I'm an independent designer of data visualizations.",
      "id": "ep_111_ut_1"
    },
    {
      "end": 38556,
      "speaker": "Moritz Stefaner",
      "start": 31278,
      "text": "I am enriched. I'm Jacob Bertini. I am an assistant professor at NYU in New York, and I do research in data visualization as well.",
      "id": "ep_111_ut_2"
    },
    {
      "end": 47260,
      "speaker": "Enrico Bertini",
      "start": 38620,
      "text": "Yeah. And on this podcast together, we talk about data visualization, as you have heard, but also data analysis, statistics, and generally the role data plays in our lives.",
      "id": "ep_111_ut_3"
    },
    {
      "end": 84238,
      "speaker": "Moritz Stefaner",
      "start": 47372,
      "text": "Yeah. And so this is a special episode. It's the episode on the end of the year. And yeah, I think as we did last year, we decided to try again to go around the world. And it's been very exciting last year, and I'm sure it's going to be very exciting this year as well. We thought that it would be nice to just give more of an impression of what is happening in other countries, since we tend to be focused mostly on always the usual places. And it turns out there are things that are happening around the world and that's very exciting. Yeah.",
      "id": "ep_111_ut_4"
    },
    {
      "end": 97204,
      "speaker": "Enrico Bertini",
      "start": 84286,
      "text": "So we'll have a bunch of guests later on, short interviews with a bunch of guests. And yeah, we hope you'll enjoy those. But maybe let's do first chat a bit how the year was for us. How was your year, Enrico?",
      "id": "ep_111_ut_5"
    },
    {
      "end": 152460,
      "speaker": "Moritz Stefaner",
      "start": 97324,
      "text": "Well, very interesting. Lots of things happening, as usual. Very exciting. If I had to say one thing, I think it's been more reflective than usual. I think we had for a number of years visualization, this new flashy thing and trying to come up with new things all the time, exciting stuff. And now it's like, it looks to me that we are, at least personally, for sure, I'm much more reflective trying to, to think about what works, what doesn't work. Does it make sense? What are the consequences of kind of like going a little bit past beyond the excitement and meta reflections maybe, huh? Meta reflection. And I don't know, personally, I've been thinking about the fact that lots of things can be solved with very simple solutions. We don't have to always go like super flashy or. Yeah, things like this. I've been personally reflecting a lot.",
      "id": "ep_111_ut_6"
    },
    {
      "end": 154284,
      "speaker": "Enrico Bertini",
      "start": 152602,
      "text": "Tech cloud is just fine.",
      "id": "ep_111_ut_7"
    },
    {
      "end": 157764,
      "speaker": "Moritz Stefaner",
      "start": 157024,
      "text": "Right?",
      "id": "ep_111_ut_8"
    },
    {
      "end": 160524,
      "speaker": "Enrico Bertini",
      "start": 158184,
      "text": "We're getting old, man. We're getting old.",
      "id": "ep_111_ut_9"
    },
    {
      "end": 175496,
      "speaker": "Moritz Stefaner",
      "start": 161224,
      "text": "Or maybe we're just, I think we had also personal discussions right after recording a show saying, ah, yeah, it looks like, yeah, actually even simple things worked really well, maybe. Yeah. I don't know.",
      "id": "ep_111_ut_10"
    },
    {
      "end": 247614,
      "speaker": "Enrico Bertini",
      "start": 175520,
      "text": "It's true. No, for me, it was a bit of a slower year. As well. So I turned 40 at the beginning of the year. And first I thought, it doesn't impact me at all. But now, in hindsight, I say, yeah, I did get a bit older, so I had a bit of a slower pace, really. But I mean, that was good, too. So the years before, I always had lots of projects, lots of travels, lots of. Yeah, like, going to the US and doing all this crazy stuff. And this year was much calmer, much more German client. So I'm really excited to work on a really applied project for the German railway. Super, like, hardcore data tool. And it's a German client. Like, the German ring is very German. And I really enjoy that. So, yeah, that's good. And, yeah, I had two more German clients, so it was like, suddenly to me, very local in a way, which was great. So I got to spend more time at home. And I was also, I think, more reflective. I think it was a strange year. I think it started off a bit negative, like there was always this looming crisis of everything. I think there was a crisis of statistics and of poly with Brexit and the whole Trump debacle. All these discussions about post facts, post truth. I think everybody was a bit down.",
      "id": "ep_111_ut_11"
    },
    {
      "end": 248342,
      "speaker": "Moritz Stefaner",
      "start": 247734,
      "text": "Yeah.",
      "id": "ep_111_ut_12"
    },
    {
      "end": 268510,
      "speaker": "Enrico Bertini",
      "start": 248478,
      "text": "And there was also maybe a commercial crisis, or maybe it was just perception, but a couple of shops closed down. We also had an episode with Elijah Meeks, who was very critical of the whole industry situation. So beginning of the year, I think, was very bleak. Right. And so everybody got in a more reflective mood, maybe there.",
      "id": "ep_111_ut_13"
    },
    {
      "end": 298804,
      "speaker": "Moritz Stefaner",
      "start": 268582,
      "text": "Yeah, I think in a way, the show also reflects some of that. Right. And we had. What did we have? We have the calling bullshit thing with Carl and Jevin. Right. I think also the episode with Alberto Cairo, it was a little bit on this direction with this trumpery thing. Uncertainty, the world itself. Uncertainty carries some semantics. It's true. Yeah.",
      "id": "ep_111_ut_14"
    },
    {
      "end": 307534,
      "speaker": "Enrico Bertini",
      "start": 298884,
      "text": "But I think we are now in the second half. Everybody dug themselves out a bit. Everybody's re merging stronger. That's my feeling, at least.",
      "id": "ep_111_ut_15"
    },
    {
      "end": 328170,
      "speaker": "Moritz Stefaner",
      "start": 308514,
      "text": "It's definitely true for myself. I kind of, like, started dark and slow, and now I'm back. It's like, oh, yeah, but this thing, I still like it a lot. And, yeah, I want to go back to kicking ass. I hope it's gonna last, but that's certainly my personal feeling.",
      "id": "ep_111_ut_16"
    },
    {
      "end": 333562,
      "speaker": "Enrico Bertini",
      "start": 328362,
      "text": "What do you think of. Did you have a favorite episode? You shouldn't ask that. Right.",
      "id": "ep_111_ut_17"
    },
    {
      "end": 334746,
      "speaker": "Moritz Stefaner",
      "start": 333738,
      "text": "What's your favorite kid?",
      "id": "ep_111_ut_18"
    },
    {
      "end": 335934,
      "speaker": "Enrico Bertini",
      "start": 334810,
      "text": "What's your favorite kid?",
      "id": "ep_111_ut_19"
    },
    {
      "end": 343624,
      "speaker": "Moritz Stefaner",
      "start": 336624,
      "text": "Should I say that if you have one? We almost never do that. Yeah, I do have one. I do have one. I think it's the same as yours.",
      "id": "ep_111_ut_20"
    },
    {
      "end": 344824,
      "speaker": "Enrico Bertini",
      "start": 343784,
      "text": "Who knows? Let me know.",
      "id": "ep_111_ut_21"
    },
    {
      "end": 356564,
      "speaker": "Moritz Stefaner",
      "start": 344864,
      "text": "Yeah. My favorite one was with Scott McCloud and understanding comics. Unfortunately, I was not there. So maybe the best episodes are those without.",
      "id": "ep_111_ut_22"
    },
    {
      "end": 363498,
      "speaker": "Enrico Bertini",
      "start": 357624,
      "text": "Imagine how awesome it would have been if you had been there. It would have been too much, I think. So I'm glad.",
      "id": "ep_111_ut_23"
    },
    {
      "end": 383114,
      "speaker": "Moritz Stefaner",
      "start": 363616,
      "text": "No, it was. It blew my mind. And I think I, like maybe in a way, luckily I was not there because I could listen it as a right. I was not influenced by having recorded it. I was blown away. I think Scott is just. It was amazing. So saying a sentence like, whoa.",
      "id": "ep_111_ut_24"
    },
    {
      "end": 383910,
      "speaker": "Harry Stevens",
      "start": 383454,
      "text": "Exactly.",
      "id": "ep_111_ut_25"
    },
    {
      "end": 392274,
      "speaker": "Enrico Bertini",
      "start": 383942,
      "text": "Like, the thought density, like, of interesting thoughts per minute was, like, through the roof. Through the roof?",
      "id": "ep_111_ut_26"
    },
    {
      "end": 393018,
      "speaker": "Moritz Stefaner",
      "start": 392414,
      "text": "Through the roof.",
      "id": "ep_111_ut_27"
    },
    {
      "end": 428564,
      "speaker": "Enrico Bertini",
      "start": 393066,
      "text": "No. But I am really happy with this coverage of different topics we had and different perspectives this year. And we had lots of great guests. Nikki K was fantastic. We had Nadieh Bremer and Shirley. I think that was also this year. Then I really enjoyed the conversation with Adrien Segal on the data sculptures. Catherine D'Ignazio was amazing. And we had lots of great people. So good. All the episodes had some interesting aspects.",
      "id": "ep_111_ut_28"
    },
    {
      "end": 459654,
      "speaker": "Moritz Stefaner",
      "start": 429664,
      "text": "Nice one. Yeah, I think it was pretty well balanced. We had a little bit of everything, maybe even more than usual. We had some data journalism. We had maybe more people from industry, which I really, really like. I think there is a lot going on in industry and it tends to be less visible than the rest. So I'm really happy that we've been covering some things happening in industry. So we had Elijah, then we had, what, Kim and Steph from Capital one.",
      "id": "ep_111_ut_29"
    },
    {
      "end": 460594,
      "speaker": "Enrico Bertini",
      "start": 459734,
      "text": "That's true.",
      "id": "ep_111_ut_30"
    },
    {
      "end": 477514,
      "speaker": "Moritz Stefaner",
      "start": 460934,
      "text": "We have Chris from Twitter. So I think it's really important to see, get a glimpse of what is happening behind the curtains of private companies. Right. Because we know that important things are happening there, but we just don't see them most of the time. So I think that's important.",
      "id": "ep_111_ut_31"
    },
    {
      "end": 518832,
      "speaker": "Enrico Bertini",
      "start": 479294,
      "text": "Yeah, it was an interesting year, and every year is so new in our field. Whenever I look back at the end of the year, I'm like, oh, Jesus. A lot has happened. Oh, man. So, yeah, I'm really curious to hear from our international guests now who we found all around the world. We have a great selection again. And, yeah, I'm excited. And we'll begin our journey actually in Beijing. So stay tuned for the first interview. So. And from Beijing, we have today on the show, spay Chen. Hi, spay.",
      "id": "ep_111_ut_32"
    },
    {
      "end": 519484,
      "speaker": "Spe Chen",
      "start": 518888,
      "text": "Hello.",
      "id": "ep_111_ut_33"
    },
    {
      "end": 522056,
      "speaker": "Pia Faustino",
      "start": 520584,
      "text": "It's good to be on the show.",
      "id": "ep_111_ut_34"
    },
    {
      "end": 530312,
      "speaker": "Enrico Bertini",
      "start": 522200,
      "text": "Yeah. Thanks for joining us. So can you tell us a bit, who are you? Where are you located? And what are you doing? What are you working on?",
      "id": "ep_111_ut_35"
    },
    {
      "end": 549874,
      "speaker": "Pia Faustino",
      "start": 530448,
      "text": "I'm a data journalist based in Beijing, and I work in the hybrid data company. And we, for my job, I cooperate with data, with reporters, editors and newsroom in China. And together we built data driven Jones and project and those investigations together.",
      "id": "ep_111_ut_36"
    },
    {
      "end": 569406,
      "speaker": "Enrico Bertini",
      "start": 550774,
      "text": "And what would you say? So our perspective on data visualization is very like euro and US centric. What would you say? How is the data visualization seen? If you can describe it a bit or maybe even compare it in Beijing or in China in general, what would you say? How does it look like?",
      "id": "ep_111_ut_37"
    },
    {
      "end": 666314,
      "speaker": "Pia Faustino",
      "start": 569430,
      "text": "Yeah, I would say that data visualization in Beijing is very vibrant because we have more. More people from not like technical background are getting more interested in learning data analytic skills and also their visualization skills. And like, we run a few popular training programs to media students and also people from newsroom or general public. And the other thing is, like, Beijing is not only the capital of China, but also I will say that it's also a capital of Internet company, Internet companies in China. So you have like many Internet companies headquarters located in China, and they are like continuously getting continuous, trying to hire more and more data, data people into their own team. So, like, the job opportunities are quite large year. Basically, if you are a data people in Beijing, you couldn't be jobless. Like, they're either trying to build their own in house data visualization team to help their business intelligence team, or they are trying to outsource data project to those companies like us, and to get some insights from their data they own, and try to make cool data visualization to communicate their insights to. They're either people within their company or the general public.",
      "id": "ep_111_ut_38"
    },
    {
      "end": 682246,
      "speaker": "Enrico Bertini",
      "start": 667334,
      "text": "So there's a lot to do in industry, as I hear that, which is great. Are there also a lot of freelance, let's say, designers, or a lot of data journalists, maybe even data artists? How does it look outside the big industries?",
      "id": "ep_111_ut_39"
    },
    {
      "end": 719964,
      "speaker": "Pia Faustino",
      "start": 682350,
      "text": "Yeah, we have some people more like data artists and try to combine a friend of mine and he's trying to use his own data visualization skill, and also like Cooper with some, like, one piano list. And I think they recently have a show in September this year and trying to, like, live coding and generate graphics in real time and also like, have live music played at the same time. So try to cross the boundary and try different new things. Year two.",
      "id": "ep_111_ut_40"
    },
    {
      "end": 752526,
      "speaker": "Enrico Bertini",
      "start": 720944,
      "text": "Cool. Cool. And yeah, I think we could do a whole episode probably on the Beijing data visualization scene. I'd love to learn more there. It's also a year review episode. What in your view were maybe the main big developments, the more recent ones this year. What was new in Beijing or in China, and maybe also globally from your perspective, what stood out to you in data visualization in general this year?",
      "id": "ep_111_ut_41"
    },
    {
      "end": 886764,
      "speaker": "Pia Faustino",
      "start": 752670,
      "text": "One thing I'm really excited about is a release of open source data visualization library called G two. And this is a library released by Ant Financial in China. It's a subcomponent of Alibaba and they have their full time staff to build a. It's somewhat like equivalent of a D3, even though I haven't given a try. But friends of mine, data visualization specialists, are very excited about it because all of the team have good documentations and also good examples, very cool galleries. And especially they are chinese friendly, they grow their community. Basically it's most of definition in Chinese and they have like channel to talk about. So I think g two will be one thing to take a look if you are interested in libraries or the link three, and this is the development side in one project. One, news data visualization news project I'm really, really like, I'm in love with this year. It's from the paper in China, and they did a really big year long investigation on the who line, Huanyong line in China. Huangyong line is an imaginary line from very northeast of China to very southwest of China. And it's a great divide in terms of economy and also geography and so politically, and they try to like walk people through the line using the maps and also visualization and great reporting. If that is the one thing you need to check it out. I would recommend people to check it out, even though that's in Chinese only, but like it's really cool.",
      "id": "ep_111_ut_42"
    },
    {
      "end": 889280,
      "speaker": "Enrico Bertini",
      "start": 887744,
      "text": "And which newspaper did it?",
      "id": "ep_111_ut_43"
    },
    {
      "end": 890204,
      "speaker": "Pia Faustino",
      "start": 889352,
      "text": "The paper.",
      "id": "ep_111_ut_44"
    },
    {
      "end": 920392,
      "speaker": "Enrico Bertini",
      "start": 890944,
      "text": "Okay, so we'll put a link for sure in the show notes. That sounds like a great investigative project. And coming back to the database library, I find that super interesting. And you said it's chinese friendly. What does that entail? Or what makes a library chinese friendly? Is it about the documentation or is it also about other like actual features of the chart that make it harder to use? Maybe libraries from the US and easier to use g two for you, I.",
      "id": "ep_111_ut_45"
    },
    {
      "end": 972624,
      "speaker": "Pia Faustino",
      "start": 920408,
      "text": "Think because personally I haven't yet tried, but I see people make something out of it. The reason why they say it's chinese friendly, I think, is because the documentation is owning Chinese. They have Chinese translated to English and english version is simpler. Most of the. I think for more, most of the developers I know they are more comfortable working in Chinese than in English, though they are like coding in English for sure, but this language barrier, they really lower it down by creating the whole chinese documentation and other things that you can just like hook up and ask them question in Chinese. So I think.",
      "id": "ep_111_ut_46"
    },
    {
      "end": 994886,
      "speaker": "Enrico Bertini",
      "start": 972744,
      "text": "Exactly. It can make a huge difference. I can totally imagine. I'm really glad this is happening. And of course, it would be great to also see more exchange in both directions. So I'll definitely check out this library. It sounds good. From your personal projects, like the things you have been working on. What were you excited about this year?",
      "id": "ep_111_ut_47"
    },
    {
      "end": 1077910,
      "speaker": "Pia Faustino",
      "start": 994960,
      "text": "This year, my colleagues and I, we work on the real estate project based in Beijing. Because like in Beijing, there's a thing called school district house. Like the house, the house is near, like, elite schools, elite elementary school. The prices soaring in like the past five years. And so we make, we make a project outfit when we partner with Tencent. And one thing that really interested me is like, we make a sort of like a scrolling telling piece. Like, you can scroll through different layers of Beijing and one layer tell you where the. Where the good schools, like where the elite schools are. And one layer tell you about the price around it. And one there told you that the trend of the price, whether it's increase or decrease or not. And also another swiper, you can compare two neighborhoods that belong to two different schools. One is an elite school and the other is one. The other one is like a normal school and the price difference is quite huge. So I think that is a project I'm very proud of this year.",
      "id": "ep_111_ut_48"
    },
    {
      "end": 1096358,
      "speaker": "Enrico Bertini",
      "start": 1078062,
      "text": "Sounds great. We'll put a link in the show notes as well. And we have to close soon. We have a lot of guests from all around the world. But one last question. What are you hoping for? Like in the new future? What types of developments would you like to see? What types of projects you can make a wish?",
      "id": "ep_111_ut_49"
    },
    {
      "end": 1098846,
      "speaker": "Pia Faustino",
      "start": 1096406,
      "text": "Yeah, I want to make a wish right now.",
      "id": "ep_111_ut_50"
    },
    {
      "end": 1099782,
      "speaker": "Enrico Bertini",
      "start": 1099030,
      "text": "Yes.",
      "id": "ep_111_ut_51"
    },
    {
      "end": 1151144,
      "speaker": "Pia Faustino",
      "start": 1099958,
      "text": "I think as a journalist, I'm probably particularly excited about next year because like, the chinese government here in this 19th Congress party, the president Xi, he mentioned like big data in his speech, and the local government will feel the pressure to release more, like, more data. Like, normally it takes months of negotiation to, like, we may just release very simple basic facts about city, but right now, probably they feel a little bit of pressure to release it or something. But some of the CD are really doing a good job this year, like Shanghai and Ashram Zhou. But I would love to see more in next year. So you can, as a data person, you can have something to play with.",
      "id": "ep_111_ut_52"
    },
    {
      "end": 1165762,
      "speaker": "Enrico Bertini",
      "start": 1151444,
      "text": "Yeah. Wonderful. Fingers crossed. I'm hoping for more open data, too. And yeah, thanks so much for joining us. Really curious to learn much more about the chinese scene. And thanks for giving us a little start there.",
      "id": "ep_111_ut_53"
    },
    {
      "end": 1166666,
      "speaker": "Pia Faustino",
      "start": 1165898,
      "text": "Thank you.",
      "id": "ep_111_ut_54"
    },
    {
      "end": 1168202,
      "speaker": "Enrico Bertini",
      "start": 1166810,
      "text": "Thanks, Wei. Bye bye.",
      "id": "ep_111_ut_55"
    },
    {
      "end": 1169174,
      "speaker": "Pia Faustino",
      "start": 1168298,
      "text": "Bye bye.",
      "id": "ep_111_ut_56"
    },
    {
      "end": 1178394,
      "speaker": "Enrico Bertini",
      "start": 1174074,
      "text": "And from the Philippines, we have Pia Faustino on the show. Hi, Pia.",
      "id": "ep_111_ut_57"
    },
    {
      "end": 1179258,
      "speaker": "Pinar Dag",
      "start": 1178554,
      "text": "Hi.",
      "id": "ep_111_ut_58"
    },
    {
      "end": 1185970,
      "speaker": "Enrico Bertini",
      "start": 1179426,
      "text": "Great to have you on. So can you tell us a bit, who are you, where are you located, and what are you doing?",
      "id": "ep_111_ut_59"
    },
    {
      "end": 1238084,
      "speaker": "Pinar Dag",
      "start": 1186082,
      "text": "Yeah, well, first, thanks for having me on the show. So my name is Pia Faustino. I'm a manager for data storytelling at thinking machines. We're a data science consultancy based here in Manila, Philippines. And basically what we do is we work with organizations to transform the way that they work with data, to help them unlock value from data, for solving whatever business problems they have. And actually, data visualization is, like, one of the key differentiators for our organization. It's one of the aspects of our service that we really take pride in. Like, I myself, I have actually a background in journalism. I worked in television for about nine years before coming to data science. And so we really try to make data usable and actionable for people.",
      "id": "ep_111_ut_60"
    },
    {
      "end": 1244932,
      "speaker": "Enrico Bertini",
      "start": 1239264,
      "text": "So you're really specialized on doing data visualization. How many people are you currently?",
      "id": "ep_111_ut_61"
    },
    {
      "end": 1248396,
      "speaker": "Pinar Dag",
      "start": 1245088,
      "text": "We're about 1516. In our organization right now.",
      "id": "ep_111_ut_62"
    },
    {
      "end": 1266484,
      "speaker": "Enrico Bertini",
      "start": 1248460,
      "text": "That's sizable. And what would you say? How is the data visualization seen in the Philippines in general? Can you give us a rough overview? Which types of types of data visualization are currently very popular, or which types of fields are most active?",
      "id": "ep_111_ut_63"
    },
    {
      "end": 1431634,
      "speaker": "Pinar Dag",
      "start": 1266604,
      "text": "Sure. Okay. So the data visualization seen in the Philippines is pretty young, but it's growing, and interest is growing really fast. And all the time, I guess, some of the highlights of what's most exciting about the data visualization seen here are, number one, there's, like, this huge interest in geospatial data, in mapping. So just to bring up, one of our colleagues, David Garcia, for example, is a consultant with our company, and he makes some amazing maps. If you go to mapmakerdavid.com or https://linktr.ee/mapmakerdavid, he produces maps of the Philippines that highlight different aspects of, of our terrain. Like, for example, typhoon tracks, nightlights. And these are ways, these are things that people haven't really seen before in our country. So that's super interesting. There's a lot of citizen bloggers who are doing one off data stories as well. People like TJ Palanca, Jumbo, Dumbo, thoughts, and of course, there's local media who's taking a real keen interest in doing more data journalism. So our organization actually gets asked often to do trainings in data exploration and data visualization for local media companies like Rappler, which is a local online news website here, the Philippine center for Investigative Journalism has. They've invested in building a huge data warehouse just to house digitized copies of public documents. So there's a lot going on. But I think what's really interesting about the scene here is how the role that data visualization is playing in, like sparking interest in digitization. So here in the Philippines, it's a bit. We have a different set of problems when it comes to data. One of our biggest problems is that sometimes the data is not there. Actually, oftentimes the data is not there. It's not digital, it's on paper records. It's locked up in people's Excel files. Actually, we're pretty happy. Even if it's in an excel file already, oftentimes it's not even in an excel file. So data visualization is really what's getting people interested in, hey, that's how I want my data to look like that. I want to be able to interact with my data in that way. How do I do it? Oh, I have to first start putting things online or putting things on a computer. So I think that's the unique role that Dataviz is playing in the Philippines for us thinking machines like some of the highlights from our year, we've been. Our CEO was one of the jury panelists on the data journalism awards, so this year she'll be doing that for the second time in a row. Yeah, we also have a couple of our own projects, but before I go into those, you might. I don't know if I was able to answer everything.",
      "id": "ep_111_ut_64"
    },
    {
      "end": 1449542,
      "speaker": "Moritz Stefaner",
      "start": 1432494,
      "text": "Yeah, absolutely. We actually wanted to delve into some of the major developments or projects for this year. So what were the major developments, maybe in your city or country, or even globally, if you want to mention anything at the global level.",
      "id": "ep_111_ut_65"
    },
    {
      "end": 1510174,
      "speaker": "Pinar Dag",
      "start": 1449598,
      "text": "Okay, so yeah, in the Philippines, I think one of the major developments in data science and data visualization here in the Philippines is one of the most prestigious business schools, the Asian Institute of Management, and also the Ateneo University. They just recently launched the first master's programs in data science here in the Philippines. And I think that shows that there's this. Businesses are recognizing that there's this huge need to build talent here in the country to train people on what to do with data and how to tackle it. And from what I've heard, companies are basically lining up to send people to these programs, and businesses are also lining up to hire people from these programs. So one, the recognition that this is a valuable skill, that not just working with data. Not just working with data, but being able to communicate it properly is a really valuable skill. So that's, I think, one major development locally for us.",
      "id": "ep_111_ut_66"
    },
    {
      "end": 1521174,
      "speaker": "Moritz Stefaner",
      "start": 1510494,
      "text": "Yeah. Yeah, I guess this is happening a little bit everywhere. It's really interesting. One should actually map all the new data science programs happening in the world, right. And see how it's spread.",
      "id": "ep_111_ut_67"
    },
    {
      "end": 1522998,
      "speaker": "Pinar Dag",
      "start": 1521254,
      "text": "Oh, really? It's a worldwide trend.",
      "id": "ep_111_ut_68"
    },
    {
      "end": 1539740,
      "speaker": "Moritz Stefaner",
      "start": 1523126,
      "text": "Yeah, well, I think so. Yeah. I hear similar things a little bit everywhere. So that's, I still have to understand if it's a good or bad thing, but we will see. Yeah. So you wanted to mention other projects.",
      "id": "ep_111_ut_69"
    },
    {
      "end": 1622074,
      "speaker": "Pinar Dag",
      "start": 1539812,
      "text": "Well, yeah. So just also from our perspective, so our company, this is our second year of operation. So we're also a pretty young company in the same way that the data science scene in general is pretty young. And for the past year, like, as opposed to our first year of operation. So in our first year of operation, we were spending a lot of our own, a lot of our time producing data visualizations for fun, oftentimes data views that end up on our blog, just about topics that were interested in, like philippine languages, marriage statistics, traffic, road safety, just public data that we're interested in. And so the first year we got to do a lot of that, and then the second year, this past year has been all about basically doing stories for other people because we got, like, a huge amount of interest from companies that wanted to do us to do the same for them. So I really wish I had more time actually to do blogs. Like, the past year, we've been building a lot of dashboards for a lot of different organizations. Most excitingly, a lot of our first clients were nonprofits, organizations like Save the Children, Teach for All, which is an education organization who wanted to use dashboards to better target their programs or to better monitor how effective they are at their goals. And that was really exciting.",
      "id": "ep_111_ut_70"
    },
    {
      "end": 1623562,
      "speaker": "Moritz Stefaner",
      "start": 1622554,
      "text": "Very nice.",
      "id": "ep_111_ut_71"
    },
    {
      "end": 1634634,
      "speaker": "Enrico Bertini",
      "start": 1623738,
      "text": "That sounds good. I also looked at your blog, and I can only recommend to read the articles there. I think it gives a great overview of your work and also of some local topics. So that's really cool.",
      "id": "ep_111_ut_72"
    },
    {
      "end": 1635654,
      "speaker": "Pinar Dag",
      "start": 1634674,
      "text": "Yeah. Thank you.",
      "id": "ep_111_ut_73"
    },
    {
      "end": 1645218,
      "speaker": "Enrico Bertini",
      "start": 1636194,
      "text": "Are there any global developments looking from your side of the globe that stood out to you the most this year?",
      "id": "ep_111_ut_74"
    },
    {
      "end": 1702358,
      "speaker": "Pinar Dag",
      "start": 1645346,
      "text": "Global development? Well, if I could just talk again about that point about how I think Dataviz is sparking an interest into digitization. So for us, as the Philippines, a country that we're still developing, we're still gathering data, we're still trying to make use of it. We're still also, I think a lot of organizations here are still grappling with trying to understand the value of data. And Dataviz is so helpful in that, because once organizations are able to see, you know, the insights that can come out of data when they can see it literally for the first time, that just drives an interest in evidence based decision making, which I think is so important for countries like us, where, you know, you have people who are really powerful making decisions that will affect people's, affect our development for the coming years, and you want them to make smart decisions.",
      "id": "ep_111_ut_75"
    },
    {
      "end": 1702994,
      "speaker": "Justin Yarga",
      "start": 1702406,
      "text": "Right.",
      "id": "ep_111_ut_76"
    },
    {
      "end": 1713030,
      "speaker": "Pinar Dag",
      "start": 1703414,
      "text": "So it's super important that they understand, you know, data literacy is being built in this part of the world, and I think that's really important.",
      "id": "ep_111_ut_77"
    },
    {
      "end": 1725470,
      "speaker": "Enrico Bertini",
      "start": 1713142,
      "text": "Yeah, it's great to hear. So just. We'll have to wrap up, unfortunately. But just as a final question, what are you hoping for? Are there any wishes you would like to bring into the next year? What types of things would you like to see?",
      "id": "ep_111_ut_78"
    },
    {
      "end": 1785698,
      "speaker": "Pinar Dag",
      "start": 1725582,
      "text": "Okay. Actually, the next year, one of the things that we're really most excited about, we just, in the past month, we have finalized launching a project with one of our, with a government agency here in the Philippines that's interested in launching open data about poverty indicators across the Philippines on everything from education, health, sanitation. So they want to make this data open and available to everyone in the country. And this is going to be data on 42,000 villages in the Philippines. And for the first time, it's going to be made accessible to everyone. And what's really exciting is that these guys, like this government agency, they wanted to make the data accessible in a visual format that would be understandable and interpretable to everybody. So we're super excited about that. We're excited about more organizations like that, understanding the value of sending their data out into the world and using visualization to make that happen.",
      "id": "ep_111_ut_79"
    },
    {
      "end": 1810544,
      "speaker": "Enrico Bertini",
      "start": 1785786,
      "text": "Cool. That sounds good. I can join that vision. Very good. So thanks so much for joining us. We'll put a few links to the things you mentioned in the show notes so our listeners can follow up. And, yeah, we are really curious to see how 2018 develops on that side of the globe. I certainly have more awareness now, so thanks for giving us a little crash course there.",
      "id": "ep_111_ut_80"
    },
    {
      "end": 1812056,
      "speaker": "Pinar Dag",
      "start": 1810704,
      "text": "Thank you so much.",
      "id": "ep_111_ut_81"
    },
    {
      "end": 1814976,
      "speaker": "Moritz Stefaner",
      "start": 1812240,
      "text": "Thank you. Thank you. Thank you, Pia.",
      "id": "ep_111_ut_82"
    },
    {
      "end": 1816124,
      "speaker": "Spe Chen",
      "start": 1815080,
      "text": "Bye bye.",
      "id": "ep_111_ut_83"
    },
    {
      "end": 1825280,
      "speaker": "Moritz Stefaner",
      "start": 1820464,
      "text": "And we have Pinar Dag from Istanbul in Turkey. Hi, Pinar, how are you?",
      "id": "ep_111_ut_84"
    },
    {
      "end": 1827158,
      "speaker": "Spe Chen",
      "start": 1825352,
      "text": "Hi. Good. How are you?",
      "id": "ep_111_ut_85"
    },
    {
      "end": 1843122,
      "speaker": "Moritz Stefaner",
      "start": 1827296,
      "text": "Very good. Thank you so much for joining us today. So can you start by telling us a little bit about you? What's your background? What you're doing and. Yeah, and then we'll move on to other questions later on.",
      "id": "ep_111_ut_86"
    },
    {
      "end": 1884796,
      "speaker": "Spe Chen",
      "start": 1843218,
      "text": "Sure, sure. My name is Pinar. I do live in Istanbul and Turkey. I'm a data journalism lecturer. I work at Kadirhas University in new media departments since 2014 Istanbul. So I also co founders of data journalism news portal called https://dagmedya.net/ and Data Journalism platform Open data and Data journalism association in Turkey. So I actually work on data journalism and I teach how to collect data, how to clean the data, visualize and analyze and making them ready for storytelling. So this is what I am doing in Istanbul. And so this is it.",
      "id": "ep_111_ut_87"
    },
    {
      "end": 1895764,
      "speaker": "Moritz Stefaner",
      "start": 1884940,
      "text": "Yeah. So can you give us a little bit of overview of what is happening in Istanbul or in Turkey in general? So what's the data visualization scene over there?",
      "id": "ep_111_ut_88"
    },
    {
      "end": 2068734,
      "speaker": "Spe Chen",
      "start": 1895844,
      "text": "Okay, sure. Maybe I can go a little bit back. Like data visualization is not new to the turkish media as well. Maybe you can guess. But when we go back 100 years in archives or records, it's also possible to see like handmade data visualization in nineties or maybe earlier periods of media. But we can say this for Turkey. For data in Turkey is now still new. Especially for if I compare with western media and American media or asean media as well. But on the other hand, the interactive works still new. And I can say that it is developing in Turkey. Especially the most common data visualizations are like kind of timelines, interactive maps, line bar charts. So this is all really you can see on mainstream media in Turkey as well and widely used open source data visuals such as Google Fusion tables, data wrapper, CartoDB, Google Maps arches. So we are really using data visualization but it's not really comparing with other countries. So I can also say there are journalists who want to really incur and implement these skills. But newsrooms need to devoid more time to develop it more effectively. So we have kind of problems with the newsrooms and also time and also technical backgrounds. And this is all standing from turkish media actually. However, I mean I can really, as a person, I'm in data journalism since 2014. So in my opinion, in two, three years, I can say that the effort to visualization, to visualize and use the data in Turkey has improved a bit more than in previous periods actually. So this is especially the case through online websites, large media outlines that I follow. So as you can imagine, journalists still don't have enough time or skills to use this impressive technology. So we use data visualization techniques and methods. And apart from newsrooms also there are platforms, they work, they prepare infographics and they try to help the people who want to use these techniques and methods. But if I sum, I can say turkish, especially Istanbul based people, I can calculate, maybe I can count myself as well. We are really busy to explain this new message and visualizations, how these new methods can be done and how the data will be structured and presented, especially in journalism and new media. So generally, we really love to do sophisticated visualization for our newsrooms in Turkey. But there are still too many things to be done, like open data ecosystem, new tools, turkish content. So this is, I can say generally what's happening here around Turkey, Istanbul.",
      "id": "ep_111_ut_89"
    },
    {
      "end": 2088494,
      "speaker": "Enrico Bertini",
      "start": 2069914,
      "text": "Can you give us a few examples? Like looking back over the last year, maybe what were the major developments or any standout projects from your perspective, be it things you have worked on or what was notable in Istanbul or Turkey as a whole, maybe even globally, what stood out to you?",
      "id": "ep_111_ut_90"
    },
    {
      "end": 2362874,
      "speaker": "Spe Chen",
      "start": 2089154,
      "text": "I think the notable developments in data visa in Turkey 2017, I can say there is a association called Open Data and data journalism that they created a massive open online course about data literacy and open data training. And so this is really one of the really important developments for who want to understand data visualization. So this is, it's created last year, however, it opened again for public this year for, in August. So this is the first massive open online course in Turkey about data literacy. It's all Turkish with, with the local examples, because sometimes when you, you can take, you know, data visualizations, but sometimes if it's not your own languages, it's really difficult for, for people who really like to understand. So this is really the first MOOC massive open online course course for everyone in Turkish. And also it's a lot with local examples in this context. It has prepared a data visualization training module and were given certificates for successful parties, for successful participants. So this was really one of the really, I think is notable developments for Turkey in general, apart from this Internet site, started to organize special trainings and they do some visualization projects. And I also created two projects about open data, the open database about workers. And it was about showing how workers condition in Turkey. It was like ten years data sets I collected from different sources, from government, FOIA and also I scrape. So this was one of the projects I created and it was finalist. And during the past years and other things I can share actually also the importance of data access for data visualization is. It's important. First time this year, some people from the, from the, let's say, institutions and formal, formal departments, they started talking about the data visualization, not only for news, not only for media or for academia, also for municipalities or for public access. So this was really very notable because we first time heard some things from the departments of justice or department or Health and they just start to talk about how they can really show the data or create a dashboard showing their data with the different forms. I can say that apart from this, maybe I can also say I involved more than 18 events last this year. Well, it's both data journalism and visualization in Turkey. So we really fighting here a lot, try to make data culture, but even we don't have enough structured data, so we create a lot of, I mean generally in Turkey people meet together with colleagues. We really work hard to make some developments, major developments for countries every year. But there are problems. So like no open data license and not enough data provided, like open like CSV files or excel files, always PDF's. But this is challenges. But there are also good improvement. Like I said, moocs, so massive open online course was one of the good specific developments, I could say, yeah, also apart from this MOOC, we did at least 18 events this year. So together with data journalism and also visualization, it was like some part of like we did talk about data visualization and also open data data journalism system. So this year was actually when I compare with 2016 or 2015 locally, actually people want to know more about techniques analyzing data visualizations, open sources. So it was really very notable year for visualization and data journalism, I can say.",
      "id": "ep_111_ut_91"
    },
    {
      "end": 2371148,
      "speaker": "Enrico Bertini",
      "start": 2363654,
      "text": "Were there any specific projects that stood out? Anything from major newspapers or also corporate projects?",
      "id": "ep_111_ut_92"
    },
    {
      "end": 2460048,
      "speaker": "Spe Chen",
      "start": 2371276,
      "text": "Yes, I did one project I already shared. It was about the condition of workers and we created about ten years data sets from different data sources, from FOIA for information. And we also scraped the data from different portals. It was really huge project, but it took too many times and too many months. But it was really good to see how workers is dying. And after that lots of newsrooms start to use these data sets and data and visualization as well, and the codes. But the other things, I don't know how you follow, if you follow the turkish media, but last two years we had lots of attacks and bombs, you know, kind of terrorist attacks a lot. So during that time, newsrooms, they really start a lot of timelines and charts, really very interactive maps. And I can say, huri, that this is the one of the really main journalism news media actually. They just really start to use lots of techniques, timelines, maps, or sometimes they use a lot of infographics also online and also print as well. So as a person who involved this world a lot in Turkey, I see really little improvement in normal new media. And also so big news organization, they start to use these techniques more than ever.",
      "id": "ep_111_ut_93"
    },
    {
      "end": 2472164,
      "speaker": "Enrico Bertini",
      "start": 2460176,
      "text": "That's great. From your perspective, were there any global developments? I don't know how much you followed the international database scene. Any global things that stood out to you that you found interesting this year?",
      "id": "ep_111_ut_94"
    },
    {
      "end": 2667864,
      "speaker": "Spe Chen",
      "start": 2473344,
      "text": "Well, I will feel a little bit really embarrassing because you guys amazing. So I don't know if my opinion will be really very great. So because you are really doing fascinating works. But yes, I do following globally some things as well, especially since I apply a lot of data journalism awards projects. I can say at first I can talk about how data journalism awards is changing year by year. When you check like small newsroom for data visualization, big news rooms for data visualization, categories actually. Categories actually. So I can say actually in this year 2015, applicants were, I think it's really impressed with impressive data visualization from many different countries. So I remember the gene, you know, the global editing efforts page they mentioned this year, actually, they said, well, the bigger, better and bolder than ever. So they really, I personally really, in my opinion, I see like really very interesting and intense data visualization project they started making, especially Wall Street Journal, New York Times, Buzzfeed's works. They were really great, even if for me it was really difficult to understand sometimes. So you really needed to really understand and get some background. But I think globally, when I compare with the last years, I see there are lots of new projects, especially data visualization project from different countries this year on gene data journalism awards. So it's globally really rising. This other thing I can say maybe about a little bit tools globally. I just figured out the Python people and journalists, they start to use Python for visualization and data, data analyzer a lot. So this is really one of the, maybe I can say awareness. What's generally this in my opinion, actually. But I can also say for r. So I'm learning r since two years now. But I can also say globally, I can also say people start to use r for data journalism and data visualization. I know you already involved with this world, but for Turkey, especially for us, it's something very, very new. But globally, I think people also start to learn and try to understand how to use r for data visualization. This is, I can say actually one more thing, maybe because it's my opinion, I was in a global, I was in, I was a speaker at Global investigative Journalism conference last November in Johannesburg. I had like five sessions and I did talk also about theater driven stories in my country and generally. But my observation that time I saw that people, they paid more attention to data visualization sessions. And so I see lots of people really paying attention. They attended courses and they want to understand the techniques. So this is also really something I can say. Good. Actually, globally, globally as well.",
      "id": "ep_111_ut_95"
    },
    {
      "end": 2669724,
      "speaker": "Enrico Bertini",
      "start": 2667944,
      "text": "Finally some good global news.",
      "id": "ep_111_ut_96"
    },
    {
      "end": 2917722,
      "speaker": "Spe Chen",
      "start": 2670594,
      "text": "Yeah, yeah. Well really lots of, you know, 1000 people attend this conference and we were like 300 speakers, so we had like 20 sessions at the same day. So lots of people were fully in our sessions, not only mine, but other professors and trainers sessions. So they were really paid attention about the data visualization a lot. But I can show share also with you their feedbacks, because they're going to share with us what is the feedbacks, which sessions were more intense. It was really amazing. And you see how people work with their project and how they find a solution locally. She's really amazing. I can say, yeah, maybe I can share with you what I hope for next year and for next year and which types of projects I'm hoping to see more. So I hope more projects will be produced in terms of the datavisualisation here in Turkey. People really paying attention to learn and understand the techniques, but they need really people teaching them the new techniques. And also I can say I hope not only for global, but also for Turkey, more development of open data consciousness. This is also important for Turkey. Okay, so if I go a little bit local, so I know a little fun, but I try to do my best. So I hope that. I hope next year I can see more data visualizations project. This is what I hope. And I really want to be involved some corporate like no cross border project. What I want to see. So we work hard for better data culture here. I think it's the same with the globally as well. So I hope not only for Globe, also for taking more development of open data consciousness, for good data visualization, it will be really great. And it is also important to create a little more budget because especially maybe, I don't know how is the condition in Europe and America, but for Turkey really, it's not easy to work like 6 hours, six months on a single project sometimes. So you need a budget or support technical backgrounds and you need different people to help you. So I hope we can get some budget for newsrooms or individual, for individual projects. I hope that it will be a year of support for data visualization events for globally and Turkey as well. So the project I would like to see that have more interactive and high public interests, because here with Turkey we do like very financial visualization, static visualization, but nothing to do with the crimes, hate crimes or animals abuse or woman abuse. So we really need more story, data driven story. This is what I hope. So there is no data problem here in Turkey really we produce data, we have time and visual thinking project problems. So we have skills problem and visual thinking problem and no problem with the data have problem. We have data actually. So I want to see more global skill shares, I hope because this is already happening. But more openness is really very good when you're working with the data because it's good, you go platforms, you ask for help and maybe more cross border projects. Because sometimes I want to work with the Greece guys and because kind of corruptions, they're related with turkey or offshore projects. It will be amazing if you can work with Cross border project. This is really something amazing. My last word can be that maybe the data visualization designers need to think about how their work appears on mobile devices. Because sometimes even in globally, when I check some visualization, it's really not fit on the mobiles. So this is really because we read the news on mobile most. So it will be really amazing. So I hope to see mobile compatible data visualization following years. This, as I can say, maybe.",
      "id": "ep_111_ut_97"
    },
    {
      "end": 2933386,
      "speaker": "Moritz Stefaner",
      "start": 2917858,
      "text": "Yeah, that's great. Perfect. Yeah. Well, thank you very much for sharing with us what is happening in your country and in your city. That's fascinating and useful. Thanks so much. Thanks, Pinar.",
      "id": "ep_111_ut_98"
    },
    {
      "end": 2934438,
      "speaker": "Enrico Bertini",
      "start": 2933450,
      "text": "Thanks, Pinar.",
      "id": "ep_111_ut_99"
    },
    {
      "end": 2937358,
      "speaker": "Spe Chen",
      "start": 2934586,
      "text": "Thank you. Thank you, Moritz and Enrico.",
      "id": "ep_111_ut_100"
    },
    {
      "end": 2938166,
      "speaker": "Justin Yarga",
      "start": 2937526,
      "text": "Bye bye.",
      "id": "ep_111_ut_101"
    },
    {
      "end": 2939078,
      "speaker": "Spe Chen",
      "start": 2938230,
      "text": "Bye bye.",
      "id": "ep_111_ut_102"
    },
    {
      "end": 2939734,
      "speaker": "Moritz Stefaner",
      "start": 2939166,
      "text": "Thank you.",
      "id": "ep_111_ut_103"
    },
    {
      "end": 2941194,
      "speaker": "Pia Faustino",
      "start": 2939814,
      "text": "Bye bye.",
      "id": "ep_111_ut_104"
    },
    {
      "end": 2971498,
      "speaker": "Enrico Bertini",
      "start": 2945934,
      "text": "So one other thing that happened this year is we became fully crowdfunded, which is awesome. So yeah, finally all the listeners might remember we used to have sponsors, which were great too. So we are really grateful there. But now we switched over to Patreon, which is amazing. And now it is actually a better feeling to be fully sponsored by you and financed by you, by the listeners. So thanks for that. That's amazing. Keep the support coming.",
      "id": "ep_111_ut_105"
    },
    {
      "end": 2972074,
      "speaker": "Moritz Stefaner",
      "start": 2971546,
      "text": "Thanks everyone.",
      "id": "ep_111_ut_106"
    },
    {
      "end": 3028314,
      "speaker": "Enrico Bertini",
      "start": 2972154,
      "text": "Yeah, we can still use some more. Some of you might have followed like Patreon had sort of a rough week. They rolled out a few like fee structure changes and yeah, somehow it was a bad idea. And they actually like the disadvantage, especially people who would give like just $1 or two or three, which are, you know, super valuable, like donors. But for those it suddenly made a huge difference in terms of costs and yeah, so nobody was really happy about that. And luckily they realized their mistake, which is great. I think that they're capable of admitting they did something wrong. And now decided to roll back. So everything is as before. And if you left our, or if you stop being a patron for our show, you can now rejoin because the situation is the same again.",
      "id": "ep_111_ut_107"
    },
    {
      "end": 3082006,
      "speaker": "Moritz Stefaner",
      "start": 3028694,
      "text": "Yeah. And now the show is fully funded by you. So I think, in a way, we have some responsibility there. But also, seriously, if you can help, I mean, every amount helps. Right. And we have a few expenses here to just keep the show running. So maybe that's a good point. It's a good moment to mention Destry and Florian. These are the true work behind the curtains. This show cannot happen without them, right? Yeah, absolutely. They do amazing work and you just don't see what they do. But most of what is happening, I mean, the reason why this show happens and when you hear it, it looks pretty smooth and as high quality as we can. It's thanks to these two people. So maybe we should thank them. Thanks, Destry and Florian, for your support.",
      "id": "ep_111_ut_108"
    },
    {
      "end": 3082914,
      "speaker": "Enrico Bertini",
      "start": 3082070,
      "text": "Thank you.",
      "id": "ep_111_ut_109"
    },
    {
      "end": 3084374,
      "speaker": "Moritz Stefaner",
      "start": 3083574,
      "text": "Thank you.",
      "id": "ep_111_ut_110"
    },
    {
      "end": 3126124,
      "speaker": "Enrico Bertini",
      "start": 3084454,
      "text": "Yeah, and it's really, it's hours of work that go into a single episode. Starts with, like, you know, finding out who to invite, invite people, finding a date with them, sending them all the info they need, answering their questions, preparing them, helping them find a good microphone, you know, then to the recording. And afterwards, it's so much. Which you still need to do in the audio file and clean up everything, stitch like broken recordings together from really bad sources often, and collect all the links, the images, do the social media promotion. It's just a podcast episode, but there's a lot of work attached to it.",
      "id": "ep_111_ut_111"
    },
    {
      "end": 3198284,
      "speaker": "Moritz Stefaner",
      "start": 3127184,
      "text": "Yeah, exactly. So then if you're new here, if you feel like supporting us, that would be really useful and any amount counts. Of course. Maybe that's a good time. Also, to briefly mention, the structure of the rewards that we created is a little different from what we used to have at the beginning, but basically now. So if you sign up, if you become a member on Patreon, what we do is that everyone receives a monthly preview of our guest list. Then if you donate a little more, you'll also be able to vote on future guests. So after we. We release this guest list, you can also vote on them. Right. So you have some voice there. And then we have two final levels of reward where you'll receive some gifts from us. So we don't want to spoil it, but you'll receive some gifts. And these are kind of like, yeah, I don't know how much we want to say that, but I saw some of the gifts and they're really nice. I don't know, Morris, you want to say something about the gifts?",
      "id": "ep_111_ut_112"
    },
    {
      "end": 3199338,
      "speaker": "Enrico Bertini",
      "start": 3198324,
      "text": "It's a surprise.",
      "id": "ep_111_ut_113"
    },
    {
      "end": 3211394,
      "speaker": "Moritz Stefaner",
      "start": 3199516,
      "text": "Why would I spoil the surprise? Yeah, exactly. Pretty awesome. And if you signed up already, you are going to receive the gift. Don't worry. It's going to take a little bit of time, but you receive it.",
      "id": "ep_111_ut_114"
    },
    {
      "end": 3230978,
      "speaker": "Enrico Bertini",
      "start": 3212014,
      "text": "Yeah. And so thanks so much for listening, for supporting us. And now we continue with our little trip around the world. Enjoy. And our next stop takes us to Burkina Faso. And we have Justin Yarga on the show. Hi, Justin.",
      "id": "ep_111_ut_115"
    },
    {
      "end": 3231818,
      "speaker": "Moritz Stefaner",
      "start": 3231066,
      "text": "Hi, Justin.",
      "id": "ep_111_ut_116"
    },
    {
      "end": 3233090,
      "speaker": "H",
      "start": 3231906,
      "text": "Hi. Hi.",
      "id": "ep_111_ut_117"
    },
    {
      "end": 3235330,
      "speaker": "Enrico Bertini",
      "start": 3233162,
      "text": "Good to have you on. How are you doing?",
      "id": "ep_111_ut_118"
    },
    {
      "end": 3236882,
      "speaker": "H",
      "start": 3235482,
      "text": "I'm fine. And you?",
      "id": "ep_111_ut_119"
    },
    {
      "end": 3237906,
      "speaker": "Enrico Bertini",
      "start": 3237018,
      "text": "Very good. Very good.",
      "id": "ep_111_ut_120"
    },
    {
      "end": 3238694,
      "speaker": "Moritz Stefaner",
      "start": 3237930,
      "text": "Very good.",
      "id": "ep_111_ut_121"
    },
    {
      "end": 3249370,
      "speaker": "Enrico Bertini",
      "start": 3239394,
      "text": "So, Justin, can you tell us a bit about you? Like, who are you, what are you doing? Where are you located? And. Yeah, how's your. What do you do with data and data visualization?",
      "id": "ep_111_ut_122"
    },
    {
      "end": 3262224,
      "speaker": "H",
      "start": 3249522,
      "text": "Okay. I'm just from Burkina Faso, a west African country. Here it's a french speaking country. So I'm trying make myself clear in.",
      "id": "ep_111_ut_123"
    },
    {
      "end": 3266280,
      "speaker": "Enrico Bertini",
      "start": 3262264,
      "text": "English, but not very good. We can hear you very clearly. Yeah.",
      "id": "ep_111_ut_124"
    },
    {
      "end": 3336282,
      "speaker": "H",
      "start": 3266432,
      "text": "Okay. So I'm living in the capital called Ouagadougou. And I am a data journalist working as a freelance. I'm also the co founder of a civic tech organization called Open Burkina. And let's say that in this organization we are implementing many projects based on the use of open data. For example, we are using parliament data to monitor MP's activities. And also we are using data to help visualize power cuts in the capital. There are many problems about energy here. So we are using data to help citizen monitor and visualize the power cut in the capital. This is something I can say about my organization, which is mainly working on open data. And I'm working there as journalists. Data journalists for all our projects.",
      "id": "ep_111_ut_125"
    },
    {
      "end": 3358934,
      "speaker": "Enrico Bertini",
      "start": 3336338,
      "text": "Great. So in general, what can you say? What would you say? How is the data visualization seen, like in Burkina Faso and maybe neighboring countries? How much is going on and which fields are most active? Is it more corporate or more data journalistically driven? Are there many freelancers or is everybody employed? Tell us a bit about what's happening.",
      "id": "ep_111_ut_126"
    },
    {
      "end": 3380424,
      "speaker": "H",
      "start": 3359054,
      "text": "Okay, so the first thing I say is that we are still at the beginning, but now more people are getting interested in using data for journalism or for activism. But we are still fighting to get the government open up the data.",
      "id": "ep_111_ut_127"
    },
    {
      "end": 3382864,
      "speaker": "Enrico Bertini",
      "start": 3380964,
      "text": "It's the same struggle everywhere.",
      "id": "ep_111_ut_128"
    },
    {
      "end": 3384524,
      "speaker": "Moritz Stefaner",
      "start": 3383724,
      "text": "Yeah.",
      "id": "ep_111_ut_129"
    },
    {
      "end": 3385464,
      "speaker": "H",
      "start": 3384684,
      "text": "Yes.",
      "id": "ep_111_ut_130"
    },
    {
      "end": 3388780,
      "speaker": "Moritz Stefaner",
      "start": 3386804,
      "text": "So it's a recurring theme.",
      "id": "ep_111_ut_131"
    },
    {
      "end": 3446374,
      "speaker": "H",
      "start": 3388852,
      "text": "Yeah. One thing is that, you know, the media here are not. They don't have journalists working mainly on open data. So the only journalists who are doing data journalism are freelance so they are freelance and there are many other activists from civil society working with open data. So, but I can also say that in Burkina, we have the first country in the french speaking part of Africa to implement an open data initiative. So our government is the first government in this part of the continent to decide to open. To open up the data.",
      "id": "ep_111_ut_132"
    },
    {
      "end": 3447314,
      "speaker": "Enrico Bertini",
      "start": 3446494,
      "text": "That's great.",
      "id": "ep_111_ut_133"
    },
    {
      "end": 3533824,
      "speaker": "H",
      "start": 3448574,
      "text": "Slowly we are getting now data, and we have a portal, open data portal. And it's not enough, but it can help to make things progress. So consequently, most of the activities are aimed to build pupil capacities to use the data and to train journalists how to use the data. This is from civil society and also from the government. Sometimes there are projects leaded by the government, and also we have support from the World bank and other organization, from other countries like France or like UK. So mainly we are working on training and building capacity. There is no, not. Not enough production, so not enough project using data. At this step, we are mainly building people capacities to use the data. And also we are fighting to get more data open.",
      "id": "ep_111_ut_134"
    },
    {
      "end": 3578894,
      "speaker": "Moritz Stefaner",
      "start": 3534484,
      "text": "Yeah. Well, what is interesting is that we keep hearing from our guests that the role of open data seems to be really important. Right. And it seems to be the main driver behind everything else. And it's interesting to see how this is kind of like spreading across different parts of the world, lots of efforts on how to create more, more open data. So what is, what is, in your opinion, the major developments or projects that have been developed this year? This could be projects that you developed personally or that people developed in your city or country or even neighboring countries, or maybe even globally. So is there anything in particular you want to mention?",
      "id": "ep_111_ut_135"
    },
    {
      "end": 3640114,
      "speaker": "H",
      "start": 3580194,
      "text": "Maybe I will mention one event. It's for me, an event happened in my country in Ouagadougou. For me, it was a conference, Africa Open data conference, held in Ouagadougou last June. And it was a three days meeting of open data leaders from Africa, french speaking countries. And in my opinion, this was a very important step to catch up with the english speaking countries. You know, here in the french speaking part of Africa, we are not in the same level. So this was an important step for us to think about together what to do to improve data projects in this part of the continent.",
      "id": "ep_111_ut_136"
    },
    {
      "end": 3649914,
      "speaker": "Moritz Stefaner",
      "start": 3640894,
      "text": "Okay, do you mean that english speaking African countries tend to be started earlier than french speaking countries?",
      "id": "ep_111_ut_137"
    },
    {
      "end": 3687314,
      "speaker": "H",
      "start": 3650484,
      "text": "Yes, exactly. There are many projects implemented in french speaking countries, and here we don't have enough support, and also we don't have many leaders. And even we have leaders, they don't meet. They are working in the country and there is no opportunity to meet. So this event was an opportunity to meet together and to think about the future for our space.",
      "id": "ep_111_ut_138"
    },
    {
      "end": 3698606,
      "speaker": "Enrico Bertini",
      "start": 3687654,
      "text": "Yeah. And language is really such an important point. We always think the Internet is global anyways. Right. But it's language. If you're not a native english speaker. Yeah. There is a huge barrier.",
      "id": "ep_111_ut_139"
    },
    {
      "end": 3738404,
      "speaker": "H",
      "start": 3698670,
      "text": "And yeah, you are right. And also I can say to add to the problem of language, we also have problem of Internet connection. So it's not easy. If you want to work, to work with people around the world and here you don't have a good connection, it will be a problem. So I think the best way is to work with people who are very closer to you. You like your neighboring country. So.",
      "id": "ep_111_ut_140"
    },
    {
      "end": 3762684,
      "speaker": "Enrico Bertini",
      "start": 3740224,
      "text": "Yeah, yeah. And build up this local community. And as you said, these local conferences where you meet like minded people and start to build relationships can be super valuable. Are there any projects that stood out? Some things that people could look at and get a better sense of what's happening? Is the Powercuts project, for instance, is this online? Is it something our listeners could check?",
      "id": "ep_111_ut_141"
    },
    {
      "end": 3773472,
      "speaker": "H",
      "start": 3763464,
      "text": "Not online, but in few. We hope that at the end of this month we are going to launch the website.",
      "id": "ep_111_ut_142"
    },
    {
      "end": 3774644,
      "speaker": "Enrico Bertini",
      "start": 3773568,
      "text": "Great. Yeah.",
      "id": "ep_111_ut_143"
    },
    {
      "end": 3805172,
      "speaker": "H",
      "start": 3775264,
      "text": "This also. Yeah. It's maybe interesting to tell you that we want to work with national agency which provide, but they are not ready to open the data. So this is one of the problem we face when we begin working on this project. But you are trying to see how.",
      "id": "ep_111_ut_144"
    },
    {
      "end": 3809684,
      "speaker": "Enrico Bertini",
      "start": 3805228,
      "text": "So do you track it yourself now? Do you crowdsource the data? Maybe.",
      "id": "ep_111_ut_145"
    },
    {
      "end": 3827934,
      "speaker": "H",
      "start": 3809844,
      "text": "We are trying to get another way to get this data without working, collaborate with them. So this can explain how, why the project is still at the beginning and not online.",
      "id": "ep_111_ut_146"
    },
    {
      "end": 3854248,
      "speaker": "Enrico Bertini",
      "start": 3828674,
      "text": "Sure, sure. But when it comes out, we will definitely share it with our listeners so they can get a sense of what's going on. And I can imagine it's hard to get these organizations to cooperate sometimes. Is there anything you hope for for next year? What types of projects would you like to see or what types of developments are you hoping that would happen? Basically you can make a wish for next year. What would it be?",
      "id": "ep_111_ut_147"
    },
    {
      "end": 3908674,
      "speaker": "H",
      "start": 3854376,
      "text": "Yes. First I hope to see collaboration between data journalists from different countries and. Yeah, from Europe. So for example, I'm hoping to see journalists from Europe and journalists from Africa. So journalists from my country and investigating on some relevant subjects such as migrant or refugees phenomenon. Because we need to. We need to work together so that we can also become. We can also learn more about how they work. So we need this experience. So. Sure.",
      "id": "ep_111_ut_148"
    },
    {
      "end": 3920850,
      "speaker": "Enrico Bertini",
      "start": 3908794,
      "text": "Yeah, that's a good wish. I wish that would happen. Yeah, absolutely. Yeah. Yeah. And it's really both, like, the international collaborations, but also building up all these local content and the local scenes. Right, yeah.",
      "id": "ep_111_ut_149"
    },
    {
      "end": 3931854,
      "speaker": "H",
      "start": 3920962,
      "text": "Also, I hope next time, next year, we can have a good connection to exchange and to implement our project.",
      "id": "ep_111_ut_150"
    },
    {
      "end": 3947128,
      "speaker": "Enrico Bertini",
      "start": 3932744,
      "text": "Yeah, yeah, we'll have an eye on that. And if you have something to share, let us know and we can distribute it further. So, thanks so much for joining us. Very interesting insight and, yeah, hope to catch up.",
      "id": "ep_111_ut_151"
    },
    {
      "end": 3948392,
      "speaker": "Moritz Stefaner",
      "start": 3947176,
      "text": "Thank you very much, Justin.",
      "id": "ep_111_ut_152"
    },
    {
      "end": 3948992,
      "speaker": "Enrico Bertini",
      "start": 3948448,
      "text": "Thank you.",
      "id": "ep_111_ut_153"
    },
    {
      "end": 3950684,
      "speaker": "H",
      "start": 3949088,
      "text": "You're welcome. Thank you.",
      "id": "ep_111_ut_154"
    },
    {
      "end": 3959496,
      "speaker": "Enrico Bertini",
      "start": 3955704,
      "text": "And from India, we have Harry Stevens. Hi, Harry. Harry.",
      "id": "ep_111_ut_155"
    },
    {
      "end": 3959976,
      "speaker": "Moritz Stefaner",
      "start": 3959600,
      "text": "Hey.",
      "id": "ep_111_ut_156"
    },
    {
      "end": 3960920,
      "speaker": "Harry Stevens",
      "start": 3960040,
      "text": "How are you doing?",
      "id": "ep_111_ut_157"
    },
    {
      "end": 3962528,
      "speaker": "Enrico Bertini",
      "start": 3961072,
      "text": "Good, good. How are you?",
      "id": "ep_111_ut_158"
    },
    {
      "end": 3964024,
      "speaker": "Harry Stevens",
      "start": 3962616,
      "text": "Good. Doing good.",
      "id": "ep_111_ut_159"
    },
    {
      "end": 3971084,
      "speaker": "Enrico Bertini",
      "start": 3964144,
      "text": "Very nice. So, Harry, can you tell us a bit, who are you? Where are you located? I sort of spoiled it already. And what are you doing?",
      "id": "ep_111_ut_160"
    },
    {
      "end": 4024754,
      "speaker": "Harry Stevens",
      "start": 3971464,
      "text": "Sure. So my name is Harry Stevens. Like you said, I work on a data journalism team at the Hindustan Times, which is a national paper here in India, english language paper. And I do a lot of, on the data visualization side, I do a lot of web based, browser based data visualizations, sort of mobile friendly for most of our audiences on phones. So we try to design for the phone and we sort of do data visualizations about big events in the news in India. So sort of anything that's big that's going on, we try to cover that.",
      "id": "ep_111_ut_161"
    },
    {
      "end": 4032854,
      "speaker": "Enrico Bertini",
      "start": 4025214,
      "text": "And as people might hear from the accent, you're not a native indian from America, but now you've been working. How long have you been working at the Hindustan town?",
      "id": "ep_111_ut_162"
    },
    {
      "end": 4094284,
      "speaker": "Harry Stevens",
      "start": 4032894,
      "text": "So I've been there for about two years. And when I first got there there, the HT, as we call it, had begun to do some sort of. Some sort of innovative things on the web, innovative storytelling formats, more than just kind of taking blocks of print from the newspaper and putting them online. They were sort of trying to take advantage of the interactive medium of the Internet. Those efforts were really, really in their early stages. And over the last couple years, we've managed to bring on some people who are journalists, but also who can write code and who can analyze data and have a sense of design, particularly designing for web browsers. And so we're sort of trying to do a lot of experimentation with how you can do journalism in an interactive meeting for an indian audience.",
      "id": "ep_111_ut_163"
    },
    {
      "end": 4110664,
      "speaker": "Enrico Bertini",
      "start": 4095184,
      "text": "And I mean, very broadly speaking, what would you say? How is the data visualization seen? Like, maybe in Delhi or in India in general, maybe as compared to the US or Europe or. Yeah. Or just on its own? What are your impressions?",
      "id": "ep_111_ut_164"
    },
    {
      "end": 4268314,
      "speaker": "Harry Stevens",
      "start": 4110744,
      "text": "Sure. Yeah. So I think it's a very, very exciting time to be doing data visualization in India because I think that it's several years behind where the US is anyway, just in terms of, I mean, I look at most of it from a journalism perspective. And so in the US for a long time, you've had a lot of publications doing really, really amazing stuff with data visualization online and also in their newspapers papers, but I also mostly focused on doing it online, so allowing for interactivity and things like that. And that has been happening in India, but it's just not sort of nearly at the level that you see in some of the us and European publications. So in that sense, we have a long way to go. But it's also very exciting because a lot of our readers or our audience are for the first time seeing some of the potential of doing interactive information design on the web and seeing for the first time what you can do with well designed exploratory graphics and what some of the JavaScript libraries let us do in terms of letting our readers kind of explore data themselves. So I think that it's at a very nascent stage right now, but it's also like very exciting. And some of the things that we've made have really delighted our readers because they are for the first time seeing them. And we also have the advantage of being able to see what's already been done around the world. And a lot of people have made mistakes for us and have learned things for us and have built things that we can sort of take inspiration from or just kind of straight up steal. So there's so much good stuff that we can learn from. So that's kind of probably made it easier for us in the sense that there's a lot of things that we haven't had to figure out ourselves or invent ourselves because we can just kind of learn from the best data visualization people around the world.",
      "id": "ep_111_ut_165"
    },
    {
      "end": 4292684,
      "speaker": "Enrico Bertini",
      "start": 4268474,
      "text": "Yeah, that's great. But what I'm always interested in is how well it transfers. Like were there any points where you thought a certain format would work super well based on your, I don't know, your thinking based on us experience, but then culturally it didn't quite land India or were there, are there new types of visualizations maybe, or formats that you now discovered being in India that you hadn't encountered in the US?",
      "id": "ep_111_ut_166"
    },
    {
      "end": 4403648,
      "speaker": "Harry Stevens",
      "start": 4293544,
      "text": "Yeah, I think that one of the things that I've discovered is that some of the things that are really popular with our audiences are not charts, but instead are just like really well designed information. So like really well designed searchable tables so, for example, there was recently a new tax law passed here called the goods and services tax, and it basically, like, took a lot of state level tax codes and nationalized them. And so it, a lot of people were wondering, like, what the new tax rate was going to be, be on thousands and thousands of goods and services. And so that information existed, but it was like, sort of hidden away in government websites. And if you could access it, it was in a PDF. And so my colleague German Patia just took that and put it on a webpage and made it searchable and kind of used some nice icons and sort of clear iconography, sort of well designed hierarchy of information. And it was tremendously popular. It was getting half of the traffic of our website for a few days. And it was so popular, in fact, that people were making YouTube videos explaining how to use the tool, even though the tool itself was very kind of intuitive, the design of it. Like, people were sort of getting traffic to their YouTube pages by saying, like, you can go to this website on the Hindustan Times and you can search it like this. And then it was so popular that we ended up translating it into, like, five or six languages. So that was really, like, very.",
      "id": "ep_111_ut_167"
    },
    {
      "end": 4411208,
      "speaker": "Enrico Bertini",
      "start": 4403696,
      "text": "But that's great. Like, just providing basic information or fulfilling basic information needs. I think that's a great role papers can play.",
      "id": "ep_111_ut_168"
    },
    {
      "end": 4411782,
      "speaker": "Harry Stevens",
      "start": 4411296,
      "text": "Yeah.",
      "id": "ep_111_ut_169"
    },
    {
      "end": 4429106,
      "speaker": "Enrico Bertini",
      "start": 4411888,
      "text": "And, yeah, it reminds me also of some of the projects ProPublica did where they collected a lot of data about doctors or local statistics. And then the main achievement is really just to make this type of thing available. Right. That it doesn't matter anymore if it's in a map or fancy chart.",
      "id": "ep_111_ut_170"
    },
    {
      "end": 4450154,
      "speaker": "Harry Stevens",
      "start": 4429210,
      "text": "Yeah, I mean, the government has a lot of information here, but they don't have any strong incentive to make it really easy for people to access or understand. So one of the huge gaps that information designers can fill, I think, is just to be able to collect that data and display it in a way that people can easily search and understand.",
      "id": "ep_111_ut_171"
    },
    {
      "end": 4467498,
      "speaker": "Enrico Bertini",
      "start": 4450774,
      "text": "Yeah, great. Overall, what do you say? Were there any major highlights or specific developments this year you would like to point out, looking back over 2017, be it both personally or maybe in India or also globally?",
      "id": "ep_111_ut_172"
    },
    {
      "end": 4504864,
      "speaker": "Harry Stevens",
      "start": 4467566,
      "text": "Yeah, I think one of the big things that we've been noticing is that, I mean, so, like, we're kind of. I'm particularly new to this, and some of the people I work with are new to this, so we're learning a lot. And one of the things that I think we've discovered is that, like, how to do interactivity wisely, because there was that article I think maybe earlier this year, Gregor Aich had published something, and it was like that only 8% or some very small percent of the users of the New York Times actually ever used any layer of interactivity at all in his graphics.",
      "id": "ep_111_ut_173"
    },
    {
      "end": 4507276,
      "speaker": "Enrico Bertini",
      "start": 4505844,
      "text": "It was very depressing.",
      "id": "ep_111_ut_174"
    },
    {
      "end": 4507836,
      "speaker": "Moritz Stefaner",
      "start": 4507380,
      "text": "Yeah, yeah.",
      "id": "ep_111_ut_175"
    },
    {
      "end": 4512580,
      "speaker": "Harry Stevens",
      "start": 4507860,
      "text": "It's like we spend all these time making perfect tooltips and nobody ever looks at them.",
      "id": "ep_111_ut_176"
    },
    {
      "end": 4520548,
      "speaker": "Enrico Bertini",
      "start": 4512612,
      "text": "We should say he qualified it later a bit more and said, like, it was in this specific graphic, it was this drop down that was maybe, you know, not super prominent. So.",
      "id": "ep_111_ut_177"
    },
    {
      "end": 4522260,
      "speaker": "Harry Stevens",
      "start": 4520716,
      "text": "And he also made things don't look.",
      "id": "ep_111_ut_178"
    },
    {
      "end": 4525194,
      "speaker": "Enrico Bertini",
      "start": 4522332,
      "text": "Quite as bad, but it's a valid, interesting point.",
      "id": "ep_111_ut_179"
    },
    {
      "end": 4615244,
      "speaker": "Harry Stevens",
      "start": 4525274,
      "text": "Yeah. And he also made the point, I mean, in that later article, that even though a lot like the majority of your readers may not use the interactivity that the ones who do tend to love it. And so that's an important part of the job, too. So one of the things that we really try to consider is to show as much of the data as possible without having to rely on interactivity. And it's sort of like counter intuitive when you first start, I mean, I know that you've been doing that visualization for a very, very long time, so this is probably more or less obvious to you, but for us, when you start to learn some of these tools, you're like, wow, cool, I can make a tooltip pop up or I can zoom in or whatever, and then you realize that you should not do it unless it's absolutely necessary or unless there's some sort of thing that you really need to allow your readers to explore, but that otherwise you need to be able to show as much as possible without having to rely on the interactivity. And that also, and I think this is really particular for web browsers, is that sort of everything in a web browser is interactive in the sense that scrolling is an interactive event. So, like, even when someone's just reading an article, they're scrolling. So that that is sort of a natural. Sorry, there's a train in the background. Did you hear that?",
      "id": "ep_111_ut_180"
    },
    {
      "end": 4620752,
      "speaker": "Enrico Bertini",
      "start": 4616144,
      "text": "Yeah, some nice local ambience right next.",
      "id": "ep_111_ut_181"
    },
    {
      "end": 4706484,
      "speaker": "Harry Stevens",
      "start": 4620768,
      "text": "To a train station. But anyway, so that, that interactivity that people sort of experience on every single website website, regardless of whether they're just reading a story or whatever, is that you can take advantage of the fact that people are very, very used to that, even if they're not used to, like, searching for a tooltip or using a drop down menu, that they might be very, very comfortable with scrolling and so that you can sort of put some of your animations or interactivity of your, of your graphic or your data visualization, you can make it sort of dependent upon the scroll. So there's that whole scrolly telling thing that's been happening and I mean, you kind of see it everywhere. The pudding. I think they released that scroll llama library recently and there's that waypoints library. So we've really been experimenting with that a lot too. How can we make dynamic graphics that don't depend on anything other than just expecting our users to scroll? And I think that that's something that's kind of maybe been a trend this year is maybe sort of like, yes, we can do interesting things with zooming and clicking and hovering and tapping and all that, but that really scrolling is a really useful sort of interactive.",
      "id": "ep_111_ut_182"
    },
    {
      "end": 4724074,
      "speaker": "Enrico Bertini",
      "start": 4706914,
      "text": "Yeah. And I think we can learn a lot from. Yeah. As you say in India or in Asia in general, people are much more mobile centric and I think we can learn a lot there in terms of simplicity and focus if. Yeah, if you design for these types of audiences more.",
      "id": "ep_111_ut_183"
    },
    {
      "end": 4773600,
      "speaker": "Harry Stevens",
      "start": 4724194,
      "text": "Yeah, it's a huge challenge. I mean, you know, designing for such a small screen and like so often we'll have an idea that we get really excited about and then we realize that the idea that we have in our head or that we've sketched out is only going to work on a desktop and just has no chance of working on a phone and sort of end up having to scrap the whole thing. And in a way it's like it kind of stinks. But then it also that sort of design constraints maybe, I don't know, maybe I'm just trying to put a positive spin on it, but maybe having that design constraint sort of improves your work or forces you to really come to the essence of what you're trying to show.",
      "id": "ep_111_ut_184"
    },
    {
      "end": 4782644,
      "speaker": "Enrico Bertini",
      "start": 4773712,
      "text": "Yeah. Brings us to the last question. What do you hope for next year? Probably bigger phones, but what else?",
      "id": "ep_111_ut_185"
    },
    {
      "end": 4789184,
      "speaker": "Harry Stevens",
      "start": 4785064,
      "text": "Be nice or just people, you know, stop using the phones, only see data.",
      "id": "ep_111_ut_186"
    },
    {
      "end": 4797484,
      "speaker": "Enrico Bertini",
      "start": 4789224,
      "text": "Visualizations on computer, sit down for once, your normal desktop. Any hopes?",
      "id": "ep_111_ut_187"
    },
    {
      "end": 4881462,
      "speaker": "Harry Stevens",
      "start": 4798464,
      "text": "Well, one of the things that we're trying to get better at and just at the Hindustan Times, but I think that this would be good to see in India in general, at least in the news business, is being able to do good web based graphics in response to breaking news stories, which we haven't really been able to do. I mean, most of what we do kind of takes like, you know, a week or two. And so we've been really successful at doing it with events that we know are going to happen. So, for example, elections like we have some big elections coming up and we know when the election counting day is going to be. So we can plan in advance or sports seasons and things like that, or we can do like, long term investigations that aren't dependent upon the news cycle. But responding to unforeseen events is something that's really challenging. And only a few newspaper graphics teams, I think, have been able to do it successfully. I mean, you see, like the New York Times can do if there's like a terrorist attack and they can show how it happens step by step and doing really sort of excellent visual journalism in response to breaking news. And I haven't seen it really happen in India yet, but that is something that we're going to be trying to do in the year to come.",
      "id": "ep_111_ut_188"
    },
    {
      "end": 4889878,
      "speaker": "Enrico Bertini",
      "start": 4881638,
      "text": "Yeah, maybe with better tools coming around every time and better libraries, it gets easier to do something on the fly. That is great.",
      "id": "ep_111_ut_189"
    },
    {
      "end": 4932406,
      "speaker": "Harry Stevens",
      "start": 4889926,
      "text": "Yeah. And trying to do things where you don't need to know how to code. I mean, that, I think so building tools for people to be able to make sort of excellent or to do excellent visual storytelling without having to know how to code. Because what seems to be very clear is that there's only a few people out there, like a relatively small percentage of the population is going to be willing to blindly manipulate symbols, I think, as bread Victoria said. So just trying to figure out how to make it so that people can do kind of excellent visual storytelling without having to write any code, I think that's something to be looking forward to in the future.",
      "id": "ep_111_ut_190"
    },
    {
      "end": 4942958,
      "speaker": "Enrico Bertini",
      "start": 4932550,
      "text": "Sounds good to me. I can underwrite that, too. Thanks so much for coming on the show and, yeah, reporting a bit from India, and I wish you a great next year.",
      "id": "ep_111_ut_191"
    },
    {
      "end": 4944414,
      "speaker": "Harry Stevens",
      "start": 4943046,
      "text": "Thanks very much. Yeah, you too.",
      "id": "ep_111_ut_192"
    },
    {
      "end": 4945518,
      "speaker": "Enrico Bertini",
      "start": 4944454,
      "text": "Maybe we can catch up soon.",
      "id": "ep_111_ut_193"
    },
    {
      "end": 4946134,
      "speaker": "Harry Stevens",
      "start": 4945566,
      "text": "Yeah, that'd be great.",
      "id": "ep_111_ut_194"
    },
    {
      "end": 4946510,
      "speaker": "Enrico Bertini",
      "start": 4946174,
      "text": "Thank you.",
      "id": "ep_111_ut_195"
    },
    {
      "end": 4947238,
      "speaker": "Harry Stevens",
      "start": 4946542,
      "text": "Thanks for having me.",
      "id": "ep_111_ut_196"
    },
    {
      "end": 4949134,
      "speaker": "Enrico Bertini",
      "start": 4947286,
      "text": "Sure. Bye bye.",
      "id": "ep_111_ut_197"
    },
    {
      "end": 4950274,
      "speaker": "Harry Stevens",
      "start": 4949214,
      "text": "All right, take care.",
      "id": "ep_111_ut_198"
    },
    {
      "end": 4961870,
      "speaker": "Moritz Stefaner",
      "start": 4954974,
      "text": "And our next guest is Qristina Parjiani from Tbilisi in Georgia. Hey, Christina, how are you?",
      "id": "ep_111_ut_199"
    },
    {
      "end": 4963990,
      "speaker": "Justin Yarga",
      "start": 4961942,
      "text": "Hello. I'm fine. How are you?",
      "id": "ep_111_ut_200"
    },
    {
      "end": 4979924,
      "speaker": "Moritz Stefaner",
      "start": 4964182,
      "text": "Very good. Very happy to have you on the show. So can you briefly introduce yourself, tell us who you are, where you are located and. Yeah, what's your background, what's your main activities? Yeah, a little bit of a background, yeah.",
      "id": "ep_111_ut_201"
    },
    {
      "end": 5102360,
      "speaker": "Justin Yarga",
      "start": 4980264,
      "text": "Thank you for having us on your show. My name is Qristina Parjiani from Tbilisi, Georgia, and I'm a communications coordinator and project coordinator at ForSet (https://www.forset.ge/). Forset is newly established civic tech organization. We are specializing in effective communication about social important issues using data technology and design. Majority of our team have been working together for five years in other organizations. Jumpstart Georgia. But six months ago we all decided to create our own organization. So we have almost the same background. For those five years, we created about 400 infographics, 20 gifs, eight animations, 25 interactive visualizations, seven data portals and five online tools. So this tells you what we mainly do. So we have four main directions our projects are concentrated to. The first one is storytelling. As I already mentioned, we are creating some interactive stories, multimedia stories, infographics, gifs, animations and so on. Also we are creating open source tools. Like one of our tools is about political party finances, another is about georgian budget. Also we are trying to build community and around data in Georgia. And for which we are creating some meetups, events. And also we try to educate other people like journalists, CSO representatives, also activists. And this is what we try to do. So this is what we make.",
      "id": "ep_111_ut_202"
    },
    {
      "end": 5104004,
      "speaker": "Enrico Bertini",
      "start": 5102432,
      "text": "Yeah, lots of activities.",
      "id": "ep_111_ut_203"
    },
    {
      "end": 5121324,
      "speaker": "Moritz Stefaner",
      "start": 5105224,
      "text": "That's a lot of activity. Sounds like enough. What would you say is the data visualization seen in your area, in your city or country or even neighboring countries? What's going on?",
      "id": "ep_111_ut_204"
    },
    {
      "end": 5221604,
      "speaker": "Justin Yarga",
      "start": 5121704,
      "text": "So in Georgia we are the only organization who is working on database only. But we see that this issue is rising. A lot of media organizations, CSO's also businesses are interesting in communicating their data more effectively, more engageable way. So we are helping them out. But the thing is that those people try to do better job. But we are the only civic tech organization who works only on this direction. We are helping mainly CSO's to make their reports, 30 page reports more effective and to communicate those reports more effective and help them to raise awareness regarding the topics they are working on. So this is landscape in Georgia. But the good issue is that a lot of people are interested in Dataviz and we saw it during our events. We have two main events. One of them is Datafest, which is international event. We had 400 guests this year, 200 of them. We are not from Georgia. And for georgian audience we have WIsEc. This is Data wizard, hackathon. Annually hackathon. And mainly it's for georgian audience. And we see that people are getting more and more interested in events and in activities like this.",
      "id": "ep_111_ut_205"
    },
    {
      "end": 5223136,
      "speaker": "Enrico Bertini",
      "start": 5222224,
      "text": "That's great.",
      "id": "ep_111_ut_206"
    },
    {
      "end": 5229484,
      "speaker": "Moritz Stefaner",
      "start": 5223280,
      "text": "And you organize the datafest, you said? Yes, and this is happening every year or what?",
      "id": "ep_111_ut_207"
    },
    {
      "end": 5274570,
      "speaker": "Justin Yarga",
      "start": 5230144,
      "text": "This will be annual event. This Datafest 2017 was the first time in July Georgia, the first event. And we already started working on next event for next year. So we hope to raise awareness regarding the database issues in Georgia and in all regions because we have fellows from Central Asia and also plexi countries from our region. And we see that not only in Georgia, but people in our region are very interested in database, but there are.",
      "id": "ep_111_ut_208"
    },
    {
      "end": 5275174,
      "speaker": "Enrico Bertini",
      "start": 5274602,
      "text": "No.",
      "id": "ep_111_ut_209"
    },
    {
      "end": 5304714,
      "speaker": "Justin Yarga",
      "start": 5279314,
      "text": "Many organizations who work on these directions and we think that we can help them out to help them out. Those fellowships and those fellows will go back to their countries and they will start doing their own projects and helping journalists, their inductivists.",
      "id": "ep_111_ut_210"
    },
    {
      "end": 5331874,
      "speaker": "Enrico Bertini",
      "start": 5305374,
      "text": "No, I totally agree. These types of events can in the long run play a huge role in just getting people started and excited about the field. So this episode is also a bit of a year review episode for us. So if you look back over, over the year 2017, were there any big trends or developments or notable projects that stood out to you, be it personal projects or in your region or globally?",
      "id": "ep_111_ut_211"
    },
    {
      "end": 5433232,
      "speaker": "Justin Yarga",
      "start": 5332454,
      "text": "The biggest projects for us were datafest and we suck because in Georgia we never had events like this and we tried to engage as much people as it was possible, possible. And I think we did really good job because we had, I think, good communications campaign. So people were interested in and about from 40 countries, people bought tickets and they visited Georgia for this database. So I think this was one of the main activities in Georgia, not only for our organization, but for organizations who are interested in data, also for ourselves, I think for ForSet (https://www.forset.ge/). It was interesting year because we established only six months ago and the biggest project we had, except this database was visualizing data for census conducted in Georgia. This was first time. Then georgian government Geostat decided to health census and we created visualizations for UNFPA, animations, also infographics, facts regarding about population in Georgia. And I think this was one of the projects which raised our knowledge, our vision a lot. So I think those projects were important.",
      "id": "ep_111_ut_212"
    },
    {
      "end": 5452224,
      "speaker": "Enrico Bertini",
      "start": 5433328,
      "text": "For scene 2017, it sure sounds like. So I'm excited to hear that so much is going on. You have so much drive there. That's fantastic. So looking into the next year, what are you hoping for? What types of things would you like to happen? You can make a wish basically for the next year.",
      "id": "ep_111_ut_213"
    },
    {
      "end": 5542880,
      "speaker": "Justin Yarga",
      "start": 5454964,
      "text": "So we want next year to do more experiments, try new things. And there are several directions we are interested in. We want to work on more our own products, the things which are interesting for our team and be less concentrating on business activities or some commercial work. Also, we think that VR and AI projects are getting really big and we want to experiment into this direction and try something new. So those are the plans we are working on several open source tools. We want to make georgian data, for example, budget data, more accessible to people and more engageable because we think that only putting information on web pages is not enough. People should be interested with design, with some news, technology, things to come and see and make stories about the data you put. So we want to work on these directions mainly.",
      "id": "ep_111_ut_214"
    },
    {
      "end": 5559664,
      "speaker": "Enrico Bertini",
      "start": 5543032,
      "text": "Cool. Sounds great. Keep us posted. We're excited to see so much stuff happening. This is great. And of course we'll put links in the blog post to all of your stuff. So, dear listeners, you can check out all the great stuff coming from Georgia this year. Thanks so much for joining us.",
      "id": "ep_111_ut_215"
    },
    {
      "end": 5563964,
      "speaker": "Justin Yarga",
      "start": 5559784,
      "text": "Thank you for having me on your show and happy new year.",
      "id": "ep_111_ut_216"
    },
    {
      "end": 5565714,
      "speaker": "Enrico Bertini",
      "start": 5564664,
      "text": "Same to you.",
      "id": "ep_111_ut_217"
    },
    {
      "end": 5568718,
      "speaker": "Moritz Stefaner",
      "start": 5565824,
      "text": "Happy new year. Thanks so much. Thanks, Cristina.",
      "id": "ep_111_ut_218"
    },
    {
      "end": 5569318,
      "speaker": "Enrico Bertini",
      "start": 5568766,
      "text": "Bye bye.",
      "id": "ep_111_ut_219"
    },
    {
      "end": 5569982,
      "speaker": "Justin Yarga",
      "start": 5569406,
      "text": "Thank you.",
      "id": "ep_111_ut_220"
    },
    {
      "end": 5571914,
      "speaker": "Moritz Stefaner",
      "start": 5570038,
      "text": "Bye. Thank you. Bye bye.",
      "id": "ep_111_ut_221"
    },
    {
      "end": 5579702,
      "speaker": "Enrico Bertini",
      "start": 5576414,
      "text": "So that was our trip around the world. What do you think, Enrico?",
      "id": "ep_111_ut_222"
    },
    {
      "end": 5585434,
      "speaker": "Moritz Stefaner",
      "start": 5579798,
      "text": "Yeah, we've been to so many places. It's really exciting. I'm so happy that we managed to do it again.",
      "id": "ep_111_ut_223"
    },
    {
      "end": 5593756,
      "speaker": "Enrico Bertini",
      "start": 5585774,
      "text": "No Latin America though. No South America, no Central America. That's a bit of a pity. Yeah, next year, I promise so, yeah, yeah.",
      "id": "ep_111_ut_224"
    },
    {
      "end": 5595996,
      "speaker": "Moritz Stefaner",
      "start": 5593780,
      "text": "Maybe we'll have more during the next year.",
      "id": "ep_111_ut_225"
    },
    {
      "end": 5596700,
      "speaker": "Enrico Bertini",
      "start": 5596100,
      "text": "Hopefully.",
      "id": "ep_111_ut_226"
    },
    {
      "end": 5597916,
      "speaker": "Moritz Stefaner",
      "start": 5596812,
      "text": "Yeah, yeah, hopefully.",
      "id": "ep_111_ut_227"
    },
    {
      "end": 5600380,
      "speaker": "Enrico Bertini",
      "start": 5597940,
      "text": "Absolutely. And I have to cut too.",
      "id": "ep_111_ut_228"
    },
    {
      "end": 5604508,
      "speaker": "Moritz Stefaner",
      "start": 5600572,
      "text": "Yeah. That's the ultimate goal.",
      "id": "ep_111_ut_229"
    },
    {
      "end": 5625742,
      "speaker": "Enrico Bertini",
      "start": 5604676,
      "text": "Yeah, yeah. But it was interesting. Like, everybody had really, like, interesting, different perspective. It's exciting to see so much different and, you know, so much stuff being started around the world. And there were really also a few recurring themes. I think, like, for everybody, local open data is like a huge issue.",
      "id": "ep_111_ut_230"
    },
    {
      "end": 5626302,
      "speaker": "Harry Stevens",
      "start": 5625918,
      "text": "Open.",
      "id": "ep_111_ut_231"
    },
    {
      "end": 5629774,
      "speaker": "Enrico Bertini",
      "start": 5626358,
      "text": "I think it's also visually everywhere relevant, right, yeah, exactly.",
      "id": "ep_111_ut_232"
    },
    {
      "end": 5639910,
      "speaker": "Moritz Stefaner",
      "start": 5629814,
      "text": "Virtually everyone mentioned open data. It seems to be like the main driver behind anything. Right. It's just like, that's where you start.",
      "id": "ep_111_ut_233"
    },
    {
      "end": 5659334,
      "speaker": "Enrico Bertini",
      "start": 5640102,
      "text": "Yeah. And it's also where, like, visualizing data can have such a huge value. Right. It's like, yeah. If you can transform local politics, you know, or like, raise awareness for important issues or government more transparent and so on. So it's always great. Yeah. And then people also see what it's good for and why it helps.",
      "id": "ep_111_ut_234"
    },
    {
      "end": 5677026,
      "speaker": "Moritz Stefaner",
      "start": 5659374,
      "text": "Right, exactly. Yeah, yeah, yeah. I was surprised to see, I think together with open data, people mentioned government initiatives very often. Right. So it seems to be like, government needs to move the first step in order to make this happen. Right. And, yeah, it's really important.",
      "id": "ep_111_ut_235"
    },
    {
      "end": 5701686,
      "speaker": "Enrico Bertini",
      "start": 5677090,
      "text": "I mean, there might also be another, like, bias in terms of maybe we selected a lot of guests that came more from data journalistic ngo type angle. So it would be interesting to also see a bit. Yeah. How representative this is. But I do agree it's a big driver and just, I think it's great if this type of thing happens. Right?",
      "id": "ep_111_ut_236"
    },
    {
      "end": 5729712,
      "speaker": "Moritz Stefaner",
      "start": 5701770,
      "text": "Yeah, yeah, yeah. And I think in general, people want to do good with data visualization. Right? So you hear people that want to do like projects related to social justice, justice, healthcare, civic tech. Right. Most people start with the idea, oh, I want to use data and create visualizations to improve something in the world. Right? Again, I don't know if it's an artifact of our sample, but it's a recurring theme. Right?",
      "id": "ep_111_ut_237"
    },
    {
      "end": 5781532,
      "speaker": "Enrico Bertini",
      "start": 5729808,
      "text": "Yeah, yeah, yeah. It's interesting. The other thing that really kept being mentioned is the importance of like localized content. So that often like libraries or software gets much more adopted once there is a French, a Spanish, a chinese version of these things. And yeah, to us it always seems so clear that well, if everything's english, everything's fine, you know, but there is a huge barrier there and I think this could actually be a really low hanging fruit. Like to just translate documentation of existing tools and make like, or maybe make a screencast, you know, half an hour, explain how a tool works in a local language that seems to be such a huge, or there could be huge value in that. I just realized that now talking to the people.",
      "id": "ep_111_ut_238"
    },
    {
      "end": 5796000,
      "speaker": "Moritz Stefaner",
      "start": 5781628,
      "text": "Yeah, yeah, no, absolutely, absolutely. I think another thing is also training. Quite a few people mentioned that they need to train other people locally. Right. I think there is a very interesting space there for future developments.",
      "id": "ep_111_ut_239"
    },
    {
      "end": 5796488,
      "speaker": "Harry Stevens",
      "start": 5796152,
      "text": "Sure.",
      "id": "ep_111_ut_240"
    },
    {
      "end": 5817624,
      "speaker": "Enrico Bertini",
      "start": 5796536,
      "text": "But I mean, training doesn't scale all that well. Right? And so let's say if you produce Hindi content, you certainly have hundreds of millions of potential users who could bet benefit from it. So. Yeah, I think that's super interesting. Yeah, yeah, great. So yeah, I'm always happy to hear from people all around the world.",
      "id": "ep_111_ut_241"
    },
    {
      "end": 5824372,
      "speaker": "Moritz Stefaner",
      "start": 5819684,
      "text": "Yeah, there's so much happening, right? Yeah, yeah, it's really cool. Yeah.",
      "id": "ep_111_ut_242"
    },
    {
      "end": 5827812,
      "speaker": "Enrico Bertini",
      "start": 5824548,
      "text": "And we are in our us euro bubble, you know?",
      "id": "ep_111_ut_243"
    },
    {
      "end": 5830148,
      "speaker": "Moritz Stefaner",
      "start": 5827868,
      "text": "Exactly. That's what I was exactly about to say.",
      "id": "ep_111_ut_244"
    },
    {
      "end": 5834224,
      "speaker": "Enrico Bertini",
      "start": 5830236,
      "text": "Any small glimpse outside that is already super interesting.",
      "id": "ep_111_ut_245"
    },
    {
      "end": 5838234,
      "speaker": "Moritz Stefaner",
      "start": 5835374,
      "text": "Yeah, yeah, yeah, absolutely. Absolutely.",
      "id": "ep_111_ut_246"
    },
    {
      "end": 5860538,
      "speaker": "Enrico Bertini",
      "start": 5838814,
      "text": "Cool. So cool. Thanks so much for listening. Thanks so much for supporting us throughout the year. Send us your thoughts. Maybe you have also some thoughts about how 2017 went or what you wish for for 2018. Keep sending us stuff. We have a few really cool episodes planned for next year already. We have a few already recorded and we can.",
      "id": "ep_111_ut_247"
    },
    {
      "end": 5862162,
      "speaker": "Moritz Stefaner",
      "start": 5860586,
      "text": "Yeah, we have a backlog.",
      "id": "ep_111_ut_248"
    },
    {
      "end": 5864578,
      "speaker": "Enrico Bertini",
      "start": 5862338,
      "text": "Yeah, they're really good.",
      "id": "ep_111_ut_249"
    },
    {
      "end": 5867010,
      "speaker": "Moritz Stefaner",
      "start": 5864626,
      "text": "So it's a good feeling. Yeah, yeah.",
      "id": "ep_111_ut_250"
    },
    {
      "end": 5868694,
      "speaker": "Enrico Bertini",
      "start": 5867082,
      "text": "The show will go on.",
      "id": "ep_111_ut_251"
    },
    {
      "end": 5873894,
      "speaker": "Moritz Stefaner",
      "start": 5869034,
      "text": "The show will go on as far as we can tell.",
      "id": "ep_111_ut_252"
    },
    {
      "end": 5875458,
      "speaker": "Enrico Bertini",
      "start": 5874434,
      "text": "Exactly.",
      "id": "ep_111_ut_253"
    },
    {
      "end": 5883974,
      "speaker": "Moritz Stefaner",
      "start": 5875626,
      "text": "Yeah, yeah. I think from our side we'll, we'll keep doing what we are doing and trying to do our best, right?",
      "id": "ep_111_ut_254"
    },
    {
      "end": 5885814,
      "speaker": "Enrico Bertini",
      "start": 5884674,
      "text": "Absolutely.",
      "id": "ep_111_ut_255"
    },
    {
      "end": 5893494,
      "speaker": "Moritz Stefaner",
      "start": 5886154,
      "text": "Yeah. I think we are all ready to go vacation by now. I'm good. See you on the other side.",
      "id": "ep_111_ut_256"
    },
    {
      "end": 5897570,
      "speaker": "Enrico Bertini",
      "start": 5894114,
      "text": "Exactly. Happy 2018. Bye bye.",
      "id": "ep_111_ut_257"
    },
    {
      "end": 5923790,
      "speaker": "Moritz Stefaner",
      "start": 5897602,
      "text": "Yeah, bye bye. Hey, folks, thanks for listening to data stories again. Before you leave, a few last notes. This show is now completely crowdfunded, so you can support us by going on page Patreon. That's patreon.com Datastories. And if you can spend a couple of minutes reading us on iTunes, that would be extremely helpful for the show.",
      "id": "ep_111_ut_258"
    },
    {
      "end": 5949690,
      "speaker": "Enrico Bertini",
      "start": 5923902,
      "text": "And here's also some information on the many ways you can get news directly from us. We are, of course, on twitter@twitter.com. Datastories. We have a Facebook page@Facebook.com. datastoriespodcast. All in one word. And we also have a slack chat channel where you can chat with us directly. And to sign up, you can go to our homepage Datastory eas. And there is a button at the bottom of the page.",
      "id": "ep_111_ut_259"
    },
    {
      "end": 5965562,
      "speaker": "Moritz Stefaner",
      "start": 5949842,
      "text": "And we also have an email newsletter. So if you want to get news directly into your inbox and be notified whenever we publish an episode, you can go to our home page Datastore es and look for the link you find at the bottom in the footer.",
      "id": "ep_111_ut_260"
    },
    {
      "end": 5977688,
      "speaker": "Enrico Bertini",
      "start": 5965658,
      "text": "So one last thing we want to tell you is that we love to get in touch with our listeners, especially if you want to suggest a way to improve the show or amazing people you want us to invite or even projects you want us to talk about.",
      "id": "ep_111_ut_261"
    },
    {
      "end": 5986904,
      "speaker": "Moritz Stefaner",
      "start": 5977776,
      "text": "Yeah, absolutely. And don't hesitate to get in touch with us. It's always a great thing to hear from you. So see you next time, and thanks for listening to data stories.",
      "id": "ep_111_ut_262"
    }
  ],
  "confidence": 0.919795792096335,
  "audio_duration": 5996,
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_status_code": null,
  "webhook_auth": false,
  "webhook_auth_header_name": null,
  "speed_boost": false,
  "auto_highlights_result": null,
  "auto_highlights": false,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_audio_quality": null,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "content_safety": false,
  "iab_categories": true,
  "content_safety_labels": {
    "status": "unavailable",
    "results": [],
    "summary": {}
  },
  "language_detection": false,
  "language_detection_threshold": null,
  "language_confidence": null,
  "custom_spelling": null,
  "throttled": false,
  "auto_chapters": true,
  "summarization": false,
  "summary_type": null,
  "summary_model": null,
  "custom_topics": false,
  "topics": [],
  "speech_threshold": null,
  "speech_model": "best",
  "chapters": [
    {
      "summary": "This is a special episode. It's the episode on the end of the year. And as we did last year, we decided to try again to go around the world. We talk about data visualization, but also data analysis, statistics, and generally the role data plays in our lives.",
      "gist": "Data Stories",
      "headline": "This podcast focuses on data visualization, but also data analysis and statistics",
      "start": 280,
      "end": 91700,
      "id": "ep_111_ch_0"
    },
    {
      "summary": "Enrico: I think it's been more reflective than usual. For me, it was a bit of a slower year. I got to spend more time at home. The year started off a bit negative, but now we're in the second half. Everybody's re merging stronger.",
      "gist": "Wonders of the Year: A Year in the Life",
      "headline": "Enrico says this year has been more reflective than usual",
      "start": 91772,
      "end": 328170,
      "id": "ep_111_ch_1"
    },
    {
      "summary": "This year's show had a little bit of everything, maybe even more than usual. My favorite one was with Scott McCloud and understanding comics. I'm really happy that we've been covering some things happening in industry. Stay tuned for the first interview.",
      "gist": "A Year in the Life",
      "headline": "Did you have a favorite episode this year? I do have one",
      "start": 328362,
      "end": 514632,
      "id": "ep_111_ch_2"
    },
    {
      "summary": "Spay Chen is a data journalist based in Beijing. Says data visualization in Beijing is very vibrant because we have more. More people from not like technical background are getting more interested in learning data analytic skills. Job opportunities are quite large year.",
      "gist": "How is data visualization in China?",
      "headline": "Spay Chen is a data journalist based in Beijing working on data visualization",
      "start": 514688,
      "end": 671754,
      "id": "ep_111_ch_3"
    },
    {
      "summary": "Are there also a lot of freelance data artists? How does it look outside the big industries? I think we could do a whole episode probably on the Beijing data visualization scene. It's also a year review episode. Cool.",
      "gist": "How is the Beijing data visualization scene?",
      "headline": "Are there also a lot of freelance, let's say, designers, or data journalists",
      "start": 672134,
      "end": 734608,
      "id": "ep_111_ch_4"
    },
    {
      "summary": "One thing I'm really excited about is a release of open source data visualization library called G two. News data visualization news project I'm in love with is from a Chinese newspaper. I would recommend people to check it out, even though that's in Chinese only.",
      "gist": "China's data visualization developments in 2017",
      "headline": "What in your view were the main data visualization developments this year",
      "start": 734656,
      "end": 896416,
      "id": "ep_111_ch_5"
    },
    {
      "summary": "The database library says it's chinese friendly. What does that entail? Is it about the documentation or is it also about other features of the chart that make it harder to use? It would be great to also see more exchange in both directions.",
      "gist": "Database Library: Is it Chinese- or English-friendly?",
      "headline": "You said the database library is chinese friendly",
      "start": 896520,
      "end": 988244,
      "id": "ep_111_ch_6"
    },
    {
      "summary": "This year, my colleagues and I, we work on the real estate project based in Beijing. One thing that really interested me is a scrolling telling piece. You can scroll through different layers of Beijing and one layer tell you about the price around it.",
      "gist": "What were you most proud of this year?",
      "headline": "From your personal projects, like the things you have been working on this year",
      "start": 989424,
      "end": 1086614,
      "id": "ep_111_ch_7"
    },
    {
      "summary": "Wei: What are you hoping for? Like in the new future? What types of developments would you like to see? I'm hoping for more open data, too. Really curious to learn much more about the chinese scene.",
      "gist": "Wishing for a New Year in China",
      "headline": "Wei: I'm hoping for more open data in China next year",
      "start": 1086734,
      "end": 1169174,
      "id": "ep_111_ch_8"
    },
    {
      "summary": "Pia Faustino is a manager for data storytelling at thinking machines. The company is a data science consultancy based in Manila, Philippines. Data visualization is one of the key differentiators for the company. How is the data visualization seen in the Philippines in general?",
      "gist": "How is data visualization seen in the Philippines?",
      "headline": "Pia Faustino is a data science consultant based in Manila, Philippines",
      "start": 1174074,
      "end": 1434086,
      "id": "ep_111_ch_9"
    },
    {
      "summary": "The Asian Institute of Management and Ateneo University recently launched the first master's programs in data science in the Philippines. Businesses are recognizing that there's this huge need to build talent here in the country to train people on what to do with data. It's a worldwide trend.",
      "gist": "Data science and data visualization in the Philippines",
      "headline": "The Philippines is seeing major developments in data science and data visualization",
      "start": 1434230,
      "end": 1537948,
      "id": "ep_111_ch_10"
    },
    {
      "summary": "This is our second year of operation. We've been building dashboards for a lot of different organizations. Most excitingly, our first clients were nonprofits. I really wish I had more time actually to do blogs.",
      "gist": "How to Start a Data Science Blog",
      "headline": "Your blog gives a great overview of your work and also of some local topics",
      "start": 1537996,
      "end": 1635654,
      "id": "ep_111_ch_11"
    },
    {
      "summary": "Dataviz is sparking an interest into digitization in the Philippines. A lot of organizations here are still grappling with trying to understand the value of data. It's super important that they understand data literacy is being built in this part of the world.",
      "gist": "Top 10 stories of 2017",
      "headline": "I think Dataviz is sparking an interest into digitization in developing countries",
      "start": 1636194,
      "end": 1717302,
      "id": "ep_111_ch_12"
    },
    {
      "summary": "A government agency in the Philippines is interested in launching open data about poverty indicators across the Philippines. For the first time, it's going to be made accessible to everyone. We're excited about more organizations like that, understanding the value of sending their data out into the world.",
      "gist": "2017: What are you hoping for in 2018?",
      "headline": "Pia: We're excited about launching open data in the Philippines next year",
      "start": 1717358,
      "end": 1816124,
      "id": "ep_111_ch_13"
    },
    {
      "summary": "Pinar Dag is a data journalism lecturer at Kadirhas University in Istanbul. He says data visualization is developing in Turkey. But newsrooms need more time to develop it more effectively, he says.",
      "gist": "How is data visualization being used in Turkey?",
      "headline": "Pinar Dag: Turkish media are increasingly using data visualization techniques",
      "start": 1820464,
      "end": 2063528,
      "id": "ep_111_ch_14"
    },
    {
      "summary": "The first massive open online course in Turkey about data literacy. And I also created two projects about open data, the open database about workers. It was really very notable year for visualization and data journalism in Turkey. But there are challenges, but there are also good improvement.",
      "gist": "Turkey's data journalism and visualization in 2017",
      "headline": "Turkey made some notable developments in data visualization and data journalism this year",
      "start": 2063656,
      "end": 2461024,
      "id": "ep_111_ch_15"
    },
    {
      "summary": "From his perspective, were there any global developments? I see lots of new projects, especially data visualization project from different countries this year on gene data journalism awards. I hope more projects will be produced in terms of the datavisualisation here in Turkey. More development of open data consciousness.",
      "gist": "Turkey's data journalism awards",
      "headline": "From your perspective, were there any global developments in data journalism this year",
      "start": 2461184,
      "end": 2941194,
      "id": "ep_111_ch_16"
    },
    {
      "summary": "We became fully crowdfunded, which is awesome. Now it is actually a better feeling to be fully sponsored by you and financed by you, by the listeners. If you left our or if you stop being a patron for our show, you can now rejoin.",
      "gist": "Thank You!",
      "headline": "We became fully crowdfunded this year, which is awesome",
      "start": 2945934,
      "end": 3049430,
      "id": "ep_111_ch_17"
    },
    {
      "summary": "Morris: This show cannot happen without Destry and Florian. It's hours of work that go into a single episode. If you're new to the show, there are rewards for joining our online community. You'll receive some gifts. Enjoy.",
      "gist": "Thank you for supporting the show!",
      "headline": "This show cannot happen without Destry and Florian, right",
      "start": 3049542,
      "end": 3230178,
      "id": "ep_111_ch_18"
    },
    {
      "summary": "Hi, Justin. Good to have you on. How are you doing? I'm fine. And you? very good. Very good.",
      "gist": "Justin Bieber on Ellen",
      "headline": "Justin: How are you doing? I'm fine. And you? Very good. Very good",
      "start": 3230226,
      "end": 3238694,
      "id": "ep_111_ch_19"
    },
    {
      "summary": "Justin is a data journalist working as a freelance in Burkina Faso. He is also the co founder of a civic tech organization called Open Burkina. More people are getting interested in using data for journalism or for activism. But we are still fighting to get the government open up the data.",
      "gist": "How is data visualization being used in Burkina Faso?",
      "headline": "Justin is a data journalist working as a freelance in Burkina Faso",
      "start": 3239394,
      "end": 3558082,
      "id": "ep_111_ch_20"
    },
    {
      "summary": "Africa Open data conference held in Ouagadougou last June. In my opinion, this was a very important step to catch up with the english speaking countries. And also to add to the problem of language, we also have problem of Internet connection. Best way is to work with people who are closer to you.",
      "gist": "What's happening in the open data world?",
      "headline": "Language is a huge barrier for many open data projects in Africa",
      "start": 3558258,
      "end": 3750924,
      "id": "ep_111_ch_21"
    },
    {
      "summary": "Is the Powercuts project, for instance, is this online? Is it something our listeners could check? Not online, but in few. We hope that at the end of this month we are going to launch the website. We will definitely share it with listeners so they can get a sense of what's going on.",
      "gist": "What are some of the projects that are worth mentioning?",
      "headline": "Are there any projects that stood out? Some things that people could look at",
      "start": 3751704,
      "end": 3842266,
      "id": "ep_111_ch_22"
    },
    {
      "summary": "Justin: Is there anything you hope for for next year? What types of projects would you like to see or what types of developments are you hoping that would happen? First I hope to see collaboration between data journalists from different countries. If you have something to share, let us know and we can distribute it further.",
      "gist": "Wishes for 2019",
      "headline": "Justin: I hope to see collaboration between data journalists from different countries",
      "start": 3842370,
      "end": 3950684,
      "id": "ep_111_ch_23"
    },
    {
      "summary": "Harry Stevens works on a data journalism team at the Hindustan Times in India. He does web based, browser based data visualizations, sort of mobile friendly for most of our audiences on phones. It's a very, very exciting time to be doing data visualization in India because it's several years behind where the US is anyway.",
      "gist": "Interactive Data Visualization in India",
      "headline": "Harry Stevens works on data journalism team at the Hindustan Times",
      "start": 3955704,
      "end": 4451874,
      "id": "ep_111_ch_24"
    },
    {
      "summary": "One of the things that we really try to consider is to show as much of the data as possible without having to rely on interactivity. How can we make dynamic graphics that don't depend on anything other than just expecting users to scroll?",
      "gist": "India's design culture in 2017",
      "headline": "Overall, what do you say? Were there any major highlights or developments this year",
      "start": 4452254,
      "end": 4774404,
      "id": "ep_111_ch_25"
    },
    {
      "summary": "One of the things that we're trying to get better at is being able to do good web based graphics in response to breaking news stories. With better tools coming around every time and better libraries, it gets easier to do something on the fly. Thanks for coming on the show and I wish you a great next year.",
      "gist": "A New Year for Graphic Design",
      "headline": "One of the things that Hindustan Times is trying to get better at",
      "start": 4775464,
      "end": 4950274,
      "id": "ep_111_ch_26"
    },
    {
      "summary": "Our next guest is Qristina Parjiani from Tbilisi in Georgia. Forset is newly established civic tech organization. They are specializing in effective communication about social important issues using data technology and design. These types of events can play a huge role in just getting people started and excited about the field.",
      "gist": "What is Data & Design in Georgia?",
      "headline": "Qristina Parjiani is a communications coordinator at ForSet (https://www.forset.ge/) in Georgia",
      "start": 4954974,
      "end": 5314054,
      "id": "ep_111_ch_27"
    },
    {
      "summary": "The biggest projects for us were datafest and we tried to engage as much people as it was possible. The biggest project was visualizing data for census conducted in Georgia. And I think this was one of the projects which raised our knowledge, our vision a lot.",
      "gist": "2017",
      "headline": "ForSet (https://www.forset.ge/)'s biggest projects in 2017 were datafest and health census",
      "start": 5314214,
      "end": 5433232,
      "id": "ep_111_ch_28"
    },
    {
      "summary": "For scene 2017, it sure sounds like. So looking into the next year, what are you hoping for? What types of things would you like to happen? Next year to do more experiments, try new things. Sounds great. Keep us posted.",
      "gist": "Wishing 2017 a Happy Year!",
      "headline": "Cristina: Looking into the next year, what are you hoping for",
      "start": 5433328,
      "end": 5571914,
      "id": "ep_111_ch_29"
    },
    {
      "summary": "Enrico: For everybody, local open data is like a huge issue. Virtually everyone mentioned open data. The other thing that really kept being mentioned is the importance of like localized content. Another thing is also training. There is a very interesting space there for future developments.",
      "gist": "A taste of data visualization around the world",
      "headline": "Almost everyone mentioned open data. Right. I think it's also visually everywhere relevant",
      "start": 5576414,
      "end": 5838234,
      "id": "ep_111_ch_30"
    },
    {
      "summary": "We have a few really cool episodes planned for next year already. Maybe you have also some thoughts about how 2017 went or what you wish for for 2018. Send us your thoughts. Happy 2018.",
      "gist": "A Happy New Year!",
      "headline": "We have a few really cool episodes planned for next year already",
      "start": 5838814,
      "end": 5906170,
      "id": "ep_111_ch_31"
    },
    {
      "summary": "This show is now completely crowdfunded, so you can support us by going on page Patreon. com Datastories. Here's also some information on the many ways you can get news directly from us. We love to get in touch with our listeners, especially if you want to suggest a way to improve the show.",
      "gist": "How to Subscribe to Data Stories Podcast",
      "headline": "This show is now completely crowdfunded, so you can support us on Patreon",
      "start": 5906322,
      "end": 5986904,
      "id": "ep_111_ch_32"
    }
  ],
  "disfluencies": false,
  "entity_detection": false,
  "sentiment_analysis": false,
  "sentiment_analysis_results": null,
  "entities": null,
  "speakers_expected": null,
  "summary": null,
  "custom_topics_results": null,
  "episode_num": 111,
  "episode_metadata": {
    "speakers": [
      "Harry Stevens",
      "Enrico Bertini",
      "Moritz Stefaner",
      "Spe Chen",
      "Pia Faustino",
      "Pinar Dag",
      "Justin Yarga",
      "Qristina Parjiani"
    ],
    "WPid": "1101",
    "url": "https://datastori.es/podlove/file/4747/s/feed/c/mp3/111-data-vis-around-the-world-in-2017.mp3",
    "episode_title": "Data Vis Around The World in 2017"
  }
}