{
  "id": "43e39cb9-818b-4f40-b573-c73fd055fcd2",
  "language_model": "assemblyai_default",
  "acoustic_model": "assemblyai_default",
  "language_code": "en_us",
  "status": "completed",
  "audio_url": "https://datastori.es/podlove/file/301/s/feed/c/mp3/Datastories-30.mp3",
  "utterances": [
    {
      "end": 21462,
      "speaker": "Enrico Bertini",
      "start": 15800,
      "text": "Hi, everyone. Data stories, number 30. Hi, Moritz, how are you?",
      "id": "ep_30_ut_0"
    },
    {
      "end": 23438,
      "speaker": "Moritz Stefaner",
      "start": 21638,
      "text": "Hey, Enrico, how you doing?",
      "id": "ep_30_ut_1"
    },
    {
      "end": 27830,
      "speaker": "Enrico Bertini",
      "start": 23566,
      "text": "I'm doing great. Wow. Number 30. It's a nice number. I like it.",
      "id": "ep_30_ut_2"
    },
    {
      "end": 29910,
      "speaker": "Moritz Stefaner",
      "start": 27862,
      "text": "It's almost like an anniversary.",
      "id": "ep_30_ut_3"
    },
    {
      "end": 31990,
      "speaker": "Enrico Bertini",
      "start": 30062,
      "text": "Yeah, it is.",
      "id": "ep_30_ut_4"
    },
    {
      "end": 33234,
      "speaker": "Moritz Stefaner",
      "start": 32062,
      "text": "Growing up, man.",
      "id": "ep_30_ut_5"
    },
    {
      "end": 38234,
      "speaker": "Enrico Bertini",
      "start": 35134,
      "text": "Slowly, slowly, slowly, slowly, slowly.",
      "id": "ep_30_ut_6"
    },
    {
      "end": 46638,
      "speaker": "Moritz Stefaner",
      "start": 38574,
      "text": "Actually, I'm not so fit. I have the flu. I have the kindergarten flu, which is one of the diseases nobody really talks about, but it's a killer.",
      "id": "ep_30_ut_7"
    },
    {
      "end": 48966,
      "speaker": "Enrico Bertini",
      "start": 46766,
      "text": "Yeah. It's the toughest one.",
      "id": "ep_30_ut_8"
    },
    {
      "end": 51354,
      "speaker": "Moritz Stefaner",
      "start": 49030,
      "text": "Yeah. Six months of agony ahead.",
      "id": "ep_30_ut_9"
    },
    {
      "end": 58074,
      "speaker": "Enrico Bertini",
      "start": 53014,
      "text": "I think I know what you're talking about. Yeah, it's terrible.",
      "id": "ep_30_ut_10"
    },
    {
      "end": 64384,
      "speaker": "Moritz Stefaner",
      "start": 59054,
      "text": "So I'm high on ginger tea. Let's see what happens next.",
      "id": "ep_30_ut_11"
    },
    {
      "end": 75544,
      "speaker": "Enrico Bertini",
      "start": 66124,
      "text": "Yeah, yeah, I had the same last week. It's just an ongoing process. Yeah. So what's going on? Any news from your site?",
      "id": "ep_30_ut_12"
    },
    {
      "end": 86060,
      "speaker": "Moritz Stefaner",
      "start": 75844,
      "text": "Not so much. Just wrapping up the year. Super busy with all the open ends that I said I will take care of later. Yeah, I just published that b graphic.",
      "id": "ep_30_ut_13"
    },
    {
      "end": 88324,
      "speaker": "Enrico Bertini",
      "start": 86172,
      "text": "Yeah, I really like that one. Yeah.",
      "id": "ep_30_ut_14"
    },
    {
      "end": 111284,
      "speaker": "Moritz Stefaner",
      "start": 88404,
      "text": "So it's for scientific American on the. There was a really interesting study on the development of wild bees, and it turned out a lot of them, at least in the area they investigated, had gone locally extinct, but also others had built up new relationships with plants. So it was kind of an interesting dataset. And I sort of documented that also on my blog. So if you're interested, you can read that.",
      "id": "ep_30_ut_15"
    },
    {
      "end": 112212,
      "speaker": "Enrico Bertini",
      "start": 111404,
      "text": "Yeah, yeah.",
      "id": "ep_30_ut_16"
    },
    {
      "end": 119824,
      "speaker": "Moritz Stefaner",
      "start": 112228,
      "text": "And I liked how it turned out. It's. For me, it's not home turf to work on an 84 page, but it sort of worked out.",
      "id": "ep_30_ut_17"
    },
    {
      "end": 121694,
      "speaker": "Enrico Bertini",
      "start": 120874,
      "text": "Yeah.",
      "id": "ep_30_ut_18"
    },
    {
      "end": 123574,
      "speaker": "Moritz Stefaner",
      "start": 122434,
      "text": "What are you doing?",
      "id": "ep_30_ut_19"
    },
    {
      "end": 152344,
      "speaker": "Enrico Bertini",
      "start": 124834,
      "text": "Working hard, as usual, and looking forward to having some vacation. Yeah, nothing really special. I keep working with my students and they are actually, they presented previews of their projects in the class I'm teaching. And I have to say that there are some interesting projects. I hope I will be able to show some stuff on the web once they are done.",
      "id": "ep_30_ut_20"
    },
    {
      "end": 156196,
      "speaker": "Moritz Stefaner",
      "start": 152764,
      "text": "What's the topic or theme? Do you know? Did you find it?",
      "id": "ep_30_ut_21"
    },
    {
      "end": 220346,
      "speaker": "Enrico Bertini",
      "start": 156220,
      "text": "Well, every student does a different project. There are people who are doing more things on the data analysis side, so they're just using analytics and visualization tools to discover something in a data set they are interested in. So, for instance, there is one guy who is actually using a data set coming from his own company, which makes things quite interesting. I have a couple of groups actually doing that. There is one on the financial market and another one on the. What's this company about? I think they are running certification tests and they have a huge database of the results of this test and is interested in discovering something out there. But I also have students doing more creative stuff. There is one student who is creating sort of tabletop version of multidimensional projections. And then you can interact with this stuff with your hands. It's quite nice. There is a whole range of different stuff. It's fun.",
      "id": "ep_30_ut_22"
    },
    {
      "end": 221450,
      "speaker": "Moritz Stefaner",
      "start": 220410,
      "text": "Sounds really good.",
      "id": "ep_30_ut_23"
    },
    {
      "end": 248298,
      "speaker": "Enrico Bertini",
      "start": 221562,
      "text": "Yeah, it's fun. It's fun. It's a lot of fun. Anyway, we have a guest today, as usual, and I'm really happy to introduce Marion dork. And we are going to talk about something really special and somewhat sounds a bit weird. The title of the show today, it's the information flaneur, which Marian will explain shortly what is about and. Hi, Marian, how are you?",
      "id": "ep_30_ut_24"
    },
    {
      "end": 251226,
      "speaker": "Marian Dörk",
      "start": 248466,
      "text": "Hi, Enrico. I'm fine. I'm happy to be on your show.",
      "id": "ep_30_ut_25"
    },
    {
      "end": 266576,
      "speaker": "Enrico Bertini",
      "start": 251370,
      "text": "It's great to have you on the show. So Marian is a. I think you are a newly appointed professor, right? Recently appointed. In Potsdam, close to Berlin, right? Or in Berlin, I don't remember exactly.",
      "id": "ep_30_ut_26"
    },
    {
      "end": 283332,
      "speaker": "Marian Dörk",
      "start": 266770,
      "text": "It's just outside of Berlin. I'm living in Berlin, but I'm working in Potsdam, actually, at the. So it's called in English. It's probably called the University of Applied Sciences in Potsdam. And actually this is the place where Moritz has his master from.",
      "id": "ep_30_ut_27"
    },
    {
      "end": 284504,
      "speaker": "Moritz Stefaner",
      "start": 283468,
      "text": "That's right.",
      "id": "ep_30_ut_28"
    },
    {
      "end": 288204,
      "speaker": "Enrico Bertini",
      "start": 285404,
      "text": "Wow. Connections everywhere.",
      "id": "ep_30_ut_29"
    },
    {
      "end": 293464,
      "speaker": "Moritz Stefaner",
      "start": 288244,
      "text": "So the Potsdam connection is. Yeah, it's everywhere. It's like the kindergarten flu, really.",
      "id": "ep_30_ut_30"
    },
    {
      "end": 295424,
      "speaker": "Marian Dörk",
      "start": 294204,
      "text": "It spreads.",
      "id": "ep_30_ut_31"
    },
    {
      "end": 307372,
      "speaker": "Moritz Stefaner",
      "start": 296884,
      "text": "But we were joking, really, at this visualized Berlin conference. I think everybody except two people had some connection to Potsdam, like taught there, you know, has been studying there or something. So.",
      "id": "ep_30_ut_32"
    },
    {
      "end": 339464,
      "speaker": "Enrico Bertini",
      "start": 307508,
      "text": "Yeah. So I have to say, I'm really happy to have you on the show, Marian. And I think both me and Moritz, we are fan of your work, and I always cross you in some conferences or other events, and it's always fun to see your work and talk to you. So I think the best way to start is if you give a little bit of background, what you do, what you've done in the past, and finally introduce the idea of information flaneur, which is really, really interesting.",
      "id": "ep_30_ut_33"
    },
    {
      "end": 342404,
      "speaker": "Marian Dörk",
      "start": 340204,
      "text": "Sure. Interesting and weird, right?",
      "id": "ep_30_ut_34"
    },
    {
      "end": 348260,
      "speaker": "Enrico Bertini",
      "start": 342484,
      "text": "Yeah, it is. It is. Well, weird things are interesting, right? By definition.",
      "id": "ep_30_ut_35"
    },
    {
      "end": 378272,
      "speaker": "Marian Dörk",
      "start": 348452,
      "text": "That's true. That's true. I'm actually really happy to be on the show because I've been listening in and out. I haven't caught up with every show, but I have to say, coming after Ben Shneiderman is, you know, it's really tough. But. So that last show actually really enjoyed so a little bit about myself. I actually started university in my hometown at the University of Magdeburg in Germany, where I studied computational visualistics like Gregor.",
      "id": "ep_30_ut_36"
    },
    {
      "end": 379444,
      "speaker": "Enrico Bertini",
      "start": 378288,
      "text": "Auschwitz, by the way.",
      "id": "ep_30_ut_37"
    },
    {
      "end": 382784,
      "speaker": "Moritz Stefaner",
      "start": 379824,
      "text": "Yeah, the connections are. It's getting worse.",
      "id": "ep_30_ut_38"
    },
    {
      "end": 598696,
      "speaker": "Marian Dörk",
      "start": 383204,
      "text": "Also, Petra, who you had on the show, it's a computer science degree but with a focus on graphics visualization, image processing and also some sort of non technical subjects. So we had some politics and psychology and design. So it's a really neat program. Anyways, I did actually my final thesis project for this degree I actually already did at the University of Calgary as a sort of diploma intern with Sheelagh Carpendale and Kerry Williamson. And this project sort of got me hooked into sort of visualization and information seeking. So visual search as sort of a label which at the beginning I didn't really like, but now I think it sort of fits what I'm doing. And this project, yeah, I really enjoyed sort of dynamic queries for blogs on the web. Sort of the idea of juxtaposing different simple visualizations of maybe time map or location and tags and using that to explore or filter through blog posts and other stuff. Yeah. And anyway, so during that time I actually noticed that visualization is, or information visualization is not just a tool for, not just a useful tool for data analysis, but also really for sort of this open ended information seeking sort of moving around in large complex information spaces. And I actually stayed or came back to Calgary for doing a PhD with Sheelagh Carpentale and Kerry Williamson. And during that time I was sort of going really deep into that subject. I did a few case studies. I also did some internships at industry labs where we sort of dealt with Twitter data, with academic publications and sort of rich collections where essentially the data is not just data but it has these rich complex links among it and it sort of invites not just for analysis but actually also for sort of navigation and looking around. So that's. I finished that PhD a little bit over a year ago, one and a half years ago. And then I went to Newcastle University in the UK where I did a one year postdoc working on the Patina project where we tried to develop visual interfaces for archives and for playful text analysis. And yeah, fairly freshly. I'm now in Berlin since October, working at the University of Applied Sciences in Potsdam and I'm really happy to be there. Both students and staff are super friendly and interested and actually I have a sort of funny position. It's called a research professorship. So that means that I have, compared to other sort of polytechnic like universities, which in Germany are called fachochschulen, I have a reduced teaching load and I'm sort of expected and or I'm allowed to do lots of research. So I'm trying to bring. Yeah, it's actually quite nice and I'm sort of trying to.",
      "id": "ep_30_ut_39"
    },
    {
      "end": 603296,
      "speaker": "Enrico Bertini",
      "start": 598720,
      "text": "You are allowed to do research in.",
      "id": "ep_30_ut_40"
    },
    {
      "end": 604432,
      "speaker": "Moritz Stefaner",
      "start": 603320,
      "text": "Your spare time, of course.",
      "id": "ep_30_ut_41"
    },
    {
      "end": 605272,
      "speaker": "Enrico Bertini",
      "start": 604488,
      "text": "In your spare time?",
      "id": "ep_30_ut_42"
    },
    {
      "end": 648704,
      "speaker": "Marian Dörk",
      "start": 605328,
      "text": "No, actually. Well, also because you don't stop but stop thinking. But you. I'm actually, so I'm actually co teaching right now a course with Sebastian Meyer. And we really try to do that to bring research questions into this course and not just hinge on the fundamentals, but actually outline where open questions are and where we can push the boundaries. Even though these students, they're not PhD students yet, they're bachelor's students and master students, not in the first years, but they're really keen on. On doing something novel and something useful and it's good fun.",
      "id": "ep_30_ut_43"
    },
    {
      "end": 715174,
      "speaker": "Enrico Bertini",
      "start": 649004,
      "text": "So, Marian, so you briefly mentioned that at some point in your research you came up with this idea that there is something beyond data analysis and then visualization may play a big role there. And I think that's the main topic of this show, of this episode. Sorry. And that's the reason why we wanted to talk with you, because I think it's really, really interesting, the idea of using visualization for something that is beyond data analysis and beyond having a very specific question to target. But it's more kind of like exploration and just curiosity. Right. Supporting curiosity, I guess, and even serendipity, discovering something that you didn't expect or just navigate large spaces to see what's there. Right. If I understand it right, this is what you call information. That's the reason why you mentioned information flannel or something like that. Can you explain to us a little bit better what you mean by information flannel? What is the flannel?",
      "id": "ep_30_ut_44"
    },
    {
      "end": 719898,
      "speaker": "Marian Dörk",
      "start": 715714,
      "text": "Yeah. So I could maybe start with actually why I came across this.",
      "id": "ep_30_ut_45"
    },
    {
      "end": 720106,
      "speaker": "Enrico Bertini",
      "start": 719946,
      "text": "Sure.",
      "id": "ep_30_ut_46"
    },
    {
      "end": 740190,
      "speaker": "Marian Dörk",
      "start": 720130,
      "text": "It's fairly serendipitous or. Yeah. So in Calgary during my PhD time, I was also allowed Chris to take non computer science courses. And one of the courses I took was urban design theory. And I came across this.",
      "id": "ep_30_ut_47"
    },
    {
      "end": 742662,
      "speaker": "Enrico Bertini",
      "start": 740342,
      "text": "Not, sorry, can you say it again? It was what?",
      "id": "ep_30_ut_48"
    },
    {
      "end": 1157176,
      "speaker": "Marian Dörk",
      "start": 742838,
      "text": "Yeah, it was urban design theory. So sort of city studies or. Yeah, city urban theory. Urban studies. And so we read about, yeah, different design thinking around the city, city planning, but also sort of from cultural studies and sort of literature to some degree. And I came across this notion of the flaneur, of the urban wanderer of the 19th century sort of roaming the streets of Paris. And it's sort of beautiful picture of a curious fella enjoying the city and being maybe also being critical. But the thing is, I came across this during an exam, sort of a midway exam or. Yeah, like sort of a time during the PhD where I had to write a report, sort of. I had some questions for it, and I was sort of, I don't know, like I was sort of, I wanted to write about something else, not visualization and research questions and blah. So I had actually, I actually introduced in that paper, I introduced an x course, sort of a distraction section that was about the flaneur. And I was sort of making that leap that maybe the flaneur, maybe that notion of this curious strolling guy is actually what visualization can do for rich information spaces. And so for me, that was sort of a way to keep my mind interested in that task of writing that paper. And in the end, and I tried to find linkages, and in the end, supervisor Sheelagh Carpentale, she said, well, Marianne, actually, this is it. This is what really captures what visualization can do when we search through and explore collections and information spaces. And then I started to sort of revisit this more seriously. And actually there are some really interesting linkages, and I found it to be really fruitful. So now, how? So in the end, the flaneur gives us a new perspective on the city. So while we might see the city as a place for economy, so for work and for living and for commerce, the flaneur sees the city sort of curiously along different senses, smells, sounds, but is also a sort of critical person who questions. So at the time when the flaneur came up as a sort of cultural figure, industrialization was picking up steam, literally, and capitalism was sort of, you know, bringing up all different kinds of issues and anonymity and just the. And maybe also poverty and so forth. So the planeur is not just a dandy enjoying and being fascinated by the city, but also someone who notices, oh, there's all these other things that are happening that are also problematic. So he develops by wandering around, by reflecting, by taking in the different perceptions, he develops his own perspective. And also he sort of walks at a different pace that gives him a privileged sensation of the city. And then also is someone, maybe someone poetic, someone creative, also sort of reimagines what city life could be. And I was sort of reading all these different texts like Walter Benjamin and others, and I thought, wow, that's such a, you know, and I also was also sort of picking the good bits. You know, there are also issues with this, with this figure we can talk about later. But, and I found this attitude of that flaneur towards the city, towards this new cultural backdrop. You know, back then, 19th century, was this growing cultural backdrop for most of the things that were happening in terms of culture and science and so forth. The flanur posed an interesting attitude and an interesting perspective. And I think we can borrow that. We can borrow the flannel's attitude to think about how we engage with digital information as the web is becoming the cultural backdrop for everything that we do. If we go to a theater play or if we go to a conference or if we just have breakfast, Twitter or some other social media site, whatever is always with us, email is with us, we are sharing photos on Instagram and so forth. So the web has become that, I think, that complementary backdrop. Besides the physical urban sphere, there's also the digital sphere. And I think the information flaneur is my attempt to frame the searcher or the viewer or the person engaging with the digital around positive aspects, around curiosity, around reflection and creativity. And I tried to contrast that sort of optimistic or idealistic Persona with the models that we had before information seeking. So traditionally, the searcher, from what I was sort of comparing the sort of the role of visualization, the searcher was framed around deficiencies like information needs, knowledge gaps, problems. Actually, a recent paper talked about the pathology, the dark side of information pathologies. So, sure. I mean, I think, yeah, anxiety and, you know, sure, we all, you know, we are all patients, but in a way. But I don't want to design for a patient. I don't want to design medicine. It also has this sort of bitterness to it. Yeah. And I think, and I think we can also turn it around. And there's actually evidence that people are enjoying when they encounter more data. You know, genealogists in North America, they're crazy about new data. Once they find a new archive, more dust to go through, they're just excited about it. And there's so many examples of our sort of day to day information practices as we roam bookshops or just scan our environment where such as serendipity, such as information encountering, people actually have positive information experiences. And so the information planeur became sort of, on the one hand, using the planeur as a lens. And then it's not just, you know, I'm not just imagining or dreaming up my favorite user Persona, but I actually then use evidence from studies about emotion and perception and just also information practices and bring them together.",
      "id": "ep_30_ut_49"
    },
    {
      "end": 1172684,
      "speaker": "Enrico Bertini",
      "start": 1157360,
      "text": "So, Marian, I'm wondering, can you give us a couple of examples of visualization tools that you developed that actually goes exactly into this direction. I think this would make more creative, more concrete for our listeners, what you're saying.",
      "id": "ep_30_ut_50"
    },
    {
      "end": 1274974,
      "speaker": "Marian Dörk",
      "start": 1173744,
      "text": "Yeah. So I came up with the concept of the information feminine, I think after maybe the second PhD project. So sort of post hoc, I could say, yeah, it sort of fits the model, but they weren't really designed towards the information flaneur. The first visualization that actually was explicitly designed for sort of strolling through information spaces was a project I've done at Microsoft Research called Pivot Paths. So it's a visualization interface with which you can explore academic publications, and in particular you can look at authors, publications and keywords. Everything hinges on the publications, the authors, and also then co authorship relationships, as well as the keywords associated with these papers. And the interface. Essentially, after you've chosen a starting point, which is not really the main point of the tool, after you've chosen maybe an author, you are presented with maybe her most cited 20 papers. And then the interface arranges. So this is shown horizontally in the middle. And then above and below you have a sort of visualization that shows the most frequent keywords. Below and above you see all the authors, all the co authors of this author, of the selected author. Of course, it's talking about visualization without showing, but let's pretend our listeners actually have it right in front of their eyes right now.",
      "id": "ep_30_ut_51"
    },
    {
      "end": 1277454,
      "speaker": "Moritz Stefaner",
      "start": 1275794,
      "text": "We can put it into the post.",
      "id": "ep_30_ut_52"
    },
    {
      "end": 1305846,
      "speaker": "Marian Dörk",
      "start": 1279214,
      "text": "But the point was with this is essentially that we have a visualization. We see, oh, this person is co authoring a lot with this other person because I adjust the font size and I have a certain arrangement that communicates that. But on top of that, all of these sort of elements, authors, papers, keywords in this arrangement are interactive, so you can actually click on them and they become the new anchor point. So you sort of pivot from one.",
      "id": "ep_30_ut_53"
    },
    {
      "end": 1309986,
      "speaker": "Moritz Stefaner",
      "start": 1305910,
      "text": "And that's a pivot element. Obviously, you always have one pivot point, right?",
      "id": "ep_30_ut_54"
    },
    {
      "end": 1371602,
      "speaker": "Marian Dörk",
      "start": 1310090,
      "text": "Exactly. Yeah. So the thing is, so the vanor, when he moves through the city, there are not really discontinuities. I mean, yes, sometimes something is overlapping, something is behind the building or whatever, but as you take one step forward and another, it's really like a gradual movement. But the way we move on the web, either by changing search queries or by clicking on links, is very abrupt. You know, one display change after another, you don't actually see the overlap between these. And with pivot paths, we try to connect these states, because as you move from author a to author B, there must be an overlap because author B is already co author from a. So we can actually pull along the publications and the metadata, like the keywords and the other authors, into the next state. So you have a continuous. So you actually, as you pivot, it's.",
      "id": "ep_30_ut_55"
    },
    {
      "end": 1374294,
      "speaker": "Moritz Stefaner",
      "start": 1371618,
      "text": "Clear how they relate to each other. That's very nice.",
      "id": "ep_30_ut_56"
    },
    {
      "end": 1420406,
      "speaker": "Marian Dörk",
      "start": 1374594,
      "text": "And you sort of. You're sort of perceptually, you're dragged along, and your movement through that space is, you could say, a strolling movement. Now, it's also. So this tool is also, I mean, sort of like, I guess, a weakness of. Weakness of the tool. The tool doesn't really let you filter down or reduce much. You actually can only do that movement. So that's the problem of a research project that has just three months. And we deployed this for a couple of weeks, and people had some issue at the beginning because they didn't see the point. They thought it was about drilling in into the right result. And then as they used it more, they noticed, oh, it's actually about that movement, about learning about a person's, I.",
      "id": "ep_30_ut_57"
    },
    {
      "end": 1456534,
      "speaker": "Moritz Stefaner",
      "start": 1420430,
      "text": "Think, like attack vector, if you say, I mean, I understand you're optimizing for, let's say we take an arbitrary starting point, and then the interesting things happen as you move from step to step, and you're sort of being inspired by what you see and also you make your own decisions. So it's kind of this really interesting interplay. But I think the obvious attack vector would be to say, well, what's the big picture? So I collect a lot of anecdotal evidence, or I get some feeling for what the city is or what this document collection is, but how will I know it's complete?",
      "id": "ep_30_ut_58"
    },
    {
      "end": 1459814,
      "speaker": "Marian Dörk",
      "start": 1456914,
      "text": "Okay, good question.",
      "id": "ep_30_ut_59"
    },
    {
      "end": 1461774,
      "speaker": "Moritz Stefaner",
      "start": 1460514,
      "text": "Sorry for that.",
      "id": "ep_30_ut_60"
    },
    {
      "end": 1463934,
      "speaker": "Marian Dörk",
      "start": 1462754,
      "text": "What a downer.",
      "id": "ep_30_ut_61"
    },
    {
      "end": 1475164,
      "speaker": "Moritz Stefaner",
      "start": 1465234,
      "text": "Years of research down the drain. You must get that a lot. I mean, you must get that in every single paper session, right?",
      "id": "ep_30_ut_62"
    },
    {
      "end": 1478484,
      "speaker": "Marian Dörk",
      "start": 1476464,
      "text": "Yes, I just say. Next question, please.",
      "id": "ep_30_ut_63"
    },
    {
      "end": 1480604,
      "speaker": "Moritz Stefaner",
      "start": 1479784,
      "text": "Boring.",
      "id": "ep_30_ut_64"
    },
    {
      "end": 1483976,
      "speaker": "Marian Dörk",
      "start": 1482224,
      "text": "Okay, so the prototype.",
      "id": "ep_30_ut_65"
    },
    {
      "end": 1487404,
      "speaker": "Enrico Bertini",
      "start": 1484000,
      "text": "You are ready for an academic career, Moritz.",
      "id": "ep_30_ut_66"
    },
    {
      "end": 1558478,
      "speaker": "Marian Dörk",
      "start": 1490104,
      "text": "So this prototype is showing only the top 20, or depending on how big your window is. And I think that was one of the frustrations I had with that project, or we all had that. What do we. How do we. How do we give presence to what, you know, to what we can't show? So it's kind of with Google in a search interface, what do we do with page two to page 100 that is not shown on page one? Of course, it's a paradox, what, you know, how do I show what I don't show? I can't show the labels for everything. My screen is not big enough. And my perception is probably the bigger problem that I can't, you know, attend to all of that. But what you can do is actually maybe give some notion of what is cut. But the larger problem actually, that you're saying is, well, I only see the perspective around an anchor point. I think that's your point, right? I select an author. I see the world around the author. But the database actually has over a million papers and even more so metadata fields.",
      "id": "ep_30_ut_67"
    },
    {
      "end": 1558662,
      "speaker": "Enrico Bertini",
      "start": 1558526,
      "text": "Yeah.",
      "id": "ep_30_ut_68"
    },
    {
      "end": 1570350,
      "speaker": "Moritz Stefaner",
      "start": 1558678,
      "text": "It's like you drop somebody with a helicopter to stay within the city. Metaphor. You drop somebody with a helicopter somewhere in Paris, then let him walk around like for ten minutes and then you ask him, so what's the city like?",
      "id": "ep_30_ut_69"
    },
    {
      "end": 1584162,
      "speaker": "Enrico Bertini",
      "start": 1570502,
      "text": "Yeah, yeah. But what's the problem? I mean, if you are designing, if you are designing for an information fLaneur, this is what you expect, right? I mean, I'm just trying to, let's.",
      "id": "ep_30_ut_70"
    },
    {
      "end": 1611216,
      "speaker": "Marian Dörk",
      "start": 1584178,
      "text": "Go along with that because this is actually great, great that you use Paris because. Do you think so? First of all, I was going to say, well, there is no overview, but it sounds a little bit too philosophical. But do you think you have, do you think you have a truthful or useful representation of Paris if you hover over it, you know, a couple thousand meters, I don't see the streets.",
      "id": "ep_30_ut_71"
    },
    {
      "end": 1613224,
      "speaker": "Moritz Stefaner",
      "start": 1611240,
      "text": "You don't see what's happening inside the store.",
      "id": "ep_30_ut_72"
    },
    {
      "end": 1620284,
      "speaker": "Marian Dörk",
      "start": 1613264,
      "text": "Yeah. You haven't spent time in a coffee shop. You haven't strolled along the Seine. You haven't seen Mona Lisa, of course.",
      "id": "ep_30_ut_73"
    },
    {
      "end": 1624024,
      "speaker": "Moritz Stefaner",
      "start": 1620984,
      "text": "But a taxi driver, yeah.",
      "id": "ep_30_ut_74"
    },
    {
      "end": 1672580,
      "speaker": "Marian Dörk",
      "start": 1624184,
      "text": "That's what it takes to be in Paris and you haven't had that. So of course there's a certain randomness if you just drop, parachuted into a random street. So I think that's still an open question when you deal with these large information spaces, what's your starting point? And that can be curated. Maybe you have, you know, maybe the researcher of the day or it could be based on where, where you're from, what your home institution is. And with institution, I mean, academic institution or whatever. Or, you know, what has. Where there's affinity with your research interests. So for example, you could actually use a keyword like information visualization and then, you know, shape the visualization around that. So. But the thing is, and that, that's what really excites me is to question the overview.",
      "id": "ep_30_ut_75"
    },
    {
      "end": 1698766,
      "speaker": "Moritz Stefaner",
      "start": 1672692,
      "text": "Yeah. And we just had Ben Shneiderman on the show, so we are now all pro overview. No, but I think it's a really interesting thing to think about and something that is probably not enough discussed. It seems to be one of the basic assumptions in Infovis, in fact, that overview is super important. And I like how you, how you question that. I think that's a, yeah, well, I'm.",
      "id": "ep_30_ut_76"
    },
    {
      "end": 1775668,
      "speaker": "Marian Dörk",
      "start": 1698910,
      "text": "It's really sort of like a, I haven't thought that this through yet, so I'm sort of winging this. But I'm starting to wonder whether the visual information seeking mantra that Ben Shneiderman, who you had on the show last time, who I really admire and I love his work, and I find this, you know, I find this mantra also very useful. But this, this mantra says overview first, you know, and then zoom and filter and then details on demand at some point. But it prioritizes overview. And, you know, I think it's very useful. I, because it actually sort of, sort of lists very important activities that we need to do with data and with information. And I think it's fine. But I think this prioritization is not what we, what's always useful. I think sometimes it's nice to start maybe at a point that relates to you. Maybe you actually want to start local. So there was your hometown or something like this. Yeah, yeah, yeah, yeah. Or maybe with yourself. You know, there's, there's so much ego searching. So if you're an academic, right, you know, you might just look up yourself and then, you know, move along. Co authors or your interests explore that niche.",
      "id": "ep_30_ut_77"
    },
    {
      "end": 1807178,
      "speaker": "Moritz Stefaner",
      "start": 1775716,
      "text": "Yeah, that niche explorer. There's another point, maybe that maybe for some datasets it just works better to do overview type visualizations. I mean, my first thought would be the ones where you can actually nicely aggregate across along a hierarchy like numbers. Then of course, it's very easy to do really seamless and nice overview things. But if you have 10,000 photos or paintings, it's very hard to combine them in a meaningful way. Right.",
      "id": "ep_30_ut_78"
    },
    {
      "end": 1815978,
      "speaker": "Marian Dörk",
      "start": 1807266,
      "text": "Some people try it. Try it, right. Like Lev Manovich. He's working with his colleagues at, I think he was first in California, but now I think he's in New York.",
      "id": "ep_30_ut_79"
    },
    {
      "end": 1816722,
      "speaker": "Moritz Stefaner",
      "start": 1816026,
      "text": "New York.",
      "id": "ep_30_ut_80"
    },
    {
      "end": 1921414,
      "speaker": "Marian Dörk",
      "start": 1816898,
      "text": "He's doing the cultural analytics stuff, you know, placing thousands of Instagram photos on a plane and looking at the color patterns or, you know, time cover, Time magazine covers and so forth. And yes, we can see patterns. I think it's beautiful stuff. I would probably to some degree question the depth maybe of what we can see there, of the sort of color distributions. But good to say something. Yeah, but I think when we ask for the overview, when we ask for the overview of, of, for example, publications of these more rich, not just quantitative, not just, you know, number series, but actually rich data sets, rich information spaces where we have labels, sorry, titles, descriptions, maybe images, linkages and so forth. What would it mean to actually give an overview? What would it mean to show everything? And it means you're cutting away a lot of things. And then the question is where do you cut? And I think so I worked on a project over the last year in Newcastle where we're trying to sort of rethink the relationship between overview and detail, the individual element and the large collection. And I think that we have to sort of. Yeah, especially for these sort of rich information spaces. I think there's space to innovate in the space between abstract overviews and these sort of individual views of just one resource.",
      "id": "ep_30_ut_81"
    },
    {
      "end": 1957524,
      "speaker": "Moritz Stefaner",
      "start": 1922554,
      "text": "Do you see these techniques also moving into, I mean, we do have a lot of browsing softwares and devices and so on already that. Yeah, actually don't use much data visualization. Right. So our web browsers are still very, I mean they have a back button, right. Or I mean the way we interact on mobile with contents. Do you see, let's say, infovis techniques moving into that field, or do you think this will be more specific interfaces that you use more in, let's say, dedicated setting?",
      "id": "ep_30_ut_82"
    },
    {
      "end": 2102413,
      "speaker": "Marian Dörk",
      "start": 1959784,
      "text": "That's a good question. So I think visualization still has the allure of high tech and complexity and future and so forth. But I think that there's potential to integrate visualization, how do you say, magic fairy dust into conventional interfaces. Like maybe a search interface can actually benefit from some visualization components. There's a nice, a nice library catalog interface from UTS, which is I think the technical uni of Sydney. So the UTS library interface has a Dewey decimal classification visualization that is quite minimalistic. It's just a tiny band that is above the result display. And it sort of visualizes how many books are in each Dewey category. And you don't have to use it, you can just ignore it. But if you enter a search term such as architecture, it will actually shape or it will stretch or shrink the corresponding categories. And so you see sort of maybe, oh, architecture is actually not just in, I don't know, I don't know what the labels are for the different top categories, but it's maybe not just culture or architecture, but it's also computer science because people are talking about, you know, system architectures and so forth. And if you're actually interested in computing architectures, you could then click on that, on that category and it would then also behave as a filtering mechanism. So you can use the visualization in a very sort of lightweight way to sort of dive into a subset of the catalog without having to actually specify this is the Dewey decimal thing or actually specify the code. So this is an example of where you have actually visualization being introduced to an existing search or filtering interface without actually turning the whole interface into a visualization. Just so have a little, just a little bit in there. I integrated it. Yeah. And that's interesting.",
      "id": "ep_30_ut_83"
    },
    {
      "end": 2104833,
      "speaker": "Moritz Stefaner",
      "start": 2102453,
      "text": "Are you familiar with that notion of information sent?",
      "id": "ep_30_ut_84"
    },
    {
      "end": 2175986,
      "speaker": "Marian Dörk",
      "start": 2105333,
      "text": "Yeah. So information sent is quite related. It was sort of this idea that when we have a user interface and there are different options of navigating or of using filters that they can be sort of shaped by color or by size, that could be visualizing, maybe prior activity, maybe more people have taken that path or have added more comments to that resource. So it's essentially, it's a way of, how do you say, informing your path by, for example, the activity of others before. But I think you can also use other data sources for it. Yeah, that's a good question. I think information sent is slightly different because it uses some external source, I think, if I understand it correctly, such as social activity, and blends it with your typical interface. So it actually doesn't change your gui or your interface or your result list or whatever, but it sort of sprinkles some visualization, some data on top.",
      "id": "ep_30_ut_85"
    },
    {
      "end": 2248854,
      "speaker": "Enrico Bertini",
      "start": 2176170,
      "text": "Yeah, but I think that there is a strong connection when you think about. So if we go back to the example that we were discussing before where you said where if I start from a seed point, then I cannot visualize everything, right. I can basically only visualize the neighborhood of my seed point. And then you have a whole collection of things that you just cannot put in your visualization because it's too far away. Right. But then information sent is a sort of framework that can help you deciding what to put in your context according to what is the, how to give the right information about what directions can be followed to get more information, starting from the point where you are now. So there are lots of interesting research and tools and results out there that actually leverage on this idea. How do I visualize what is not in the direct neighborhood of my current point of view? And I think that's really interesting and in the end connected to what you said before looks quite relevant.",
      "id": "ep_30_ut_86"
    },
    {
      "end": 2287720,
      "speaker": "Marian Dörk",
      "start": 2250834,
      "text": "Yeah, well, the thing is, I mean, we don't want to be just locked into our local view. I think that's what you're sort of referring to. So it's not just your immediate neighborhood, I don't know, in the graph or interface and I mean, in a way this asks a related question, which I think is also important, and it's also to information sent. Do we, is there a danger of just seeing the same, so that if we only show the stuff that is similar or that is directly related, are we just going in circles around the stuff that we are already interested and.",
      "id": "ep_30_ut_87"
    },
    {
      "end": 2289950,
      "speaker": "Moritz Stefaner",
      "start": 2287752,
      "text": "Knowledgeable about, filter bubble and so on?",
      "id": "ep_30_ut_88"
    },
    {
      "end": 2311682,
      "speaker": "Marian Dörk",
      "start": 2290112,
      "text": "Yeah, exactly. And I think, and I haven't. That's something not even half baked, it's just raw. How can we express relationships of difference, of complementarity, of the other corner of the data set that has something interesting to say about where you at right now, but it's not similarity.",
      "id": "ep_30_ut_89"
    },
    {
      "end": 2339864,
      "speaker": "Moritz Stefaner",
      "start": 2311738,
      "text": "Right. Well, it could be interesting to think about if a user actually engages for a longer time, how can we make sure he sees a relevant portion of the whole thing, you know, so, hey, I've seen, you know, talking about Paris again. Maybe he teleport him sometimes to the different quarters just to mix it up a little. Yeah. And so he can still do this instance based exploration, but we make sure he encounters enough different stuff and isn't always running in circles. More or less.",
      "id": "ep_30_ut_90"
    },
    {
      "end": 2369324,
      "speaker": "Marian Dörk",
      "start": 2339904,
      "text": "Yeah, I think there might be, there might be some backlash if, if the system is the smart agent that decides, oh, you really should go to this other corner of the city or the dataset because you haven't seen it yet. But I think what would be as well, or maybe alternatively useful, is letting searchers or viewers make these decisions. So actually deciding, oh, I know I'm circling myself here, but the interface gives me a way to navigate away from it.",
      "id": "ep_30_ut_91"
    },
    {
      "end": 2373322,
      "speaker": "Moritz Stefaner",
      "start": 2369954,
      "text": "Go to the opposite content. Would be a nice button sometimes.",
      "id": "ep_30_ut_92"
    },
    {
      "end": 2398334,
      "speaker": "Marian Dörk",
      "start": 2373498,
      "text": "Yeah. And I don't know yet how to do that. I mean, the random button has been around in search and in Wikipedia, but it's not quite that. So we worked. So I might, I could mention another project that sort of slightly relates to that. It also relates to that question, to overview and the individual element. Are you up for it?",
      "id": "ep_30_ut_93"
    },
    {
      "end": 2399754,
      "speaker": "Enrico Bertini",
      "start": 2398414,
      "text": "Absolutely. Go ahead.",
      "id": "ep_30_ut_94"
    },
    {
      "end": 2541744,
      "speaker": "Marian Dörk",
      "start": 2400894,
      "text": "Okay, so that's something I've done with two people in Newcastle, uni, Rob comer and Martin Date Robertson. And we call it monadic exploration. And it's this notion of navigating similar to pivot paths between individual elements, but then actually still showing the whole collection around these elements. And we call it monadic because it's inspired or informed by sort of philosophical and sociological concept of the monads of something that Bruno Latour, a french sociologist, has been writing about over the last couple years. And it essentially is sort of alternative to the distinction between the micro and the macro. So instead of talking about the individual and society, he argues that society is really hard to grasp anyways, and the individual is too little to actually make sense of. So why don't we take the individual and you know, in sociology it would be a human, maybe in our case it would be data points, resources. If we take the individual element as a position and as a vantage point on the whole world, and the whole world might be a collection of photos, or maybe in sociological terms it might be society, then we could now, in terms of visualization, we could arrange the collection or the data set around that individual element in a way that still shows this is this element's perspective. You know, it's very unique. It's how, you know, it relates strongly or weakly with other elements, but it doesn't show just the immediate neighbors or the immediate properties of that element, but actually allows you to see beyond that. So on the sort of metaphorically speaking, on the horizon, you would still see the elements that this element is not so much related to. So you could then navigate, so to speak, to the other side of the data set, if you make that choice.",
      "id": "ep_30_ut_95"
    },
    {
      "end": 2545024,
      "speaker": "Moritz Stefaner",
      "start": 2542364,
      "text": "And how's the project called? Or where is it?",
      "id": "ep_30_ut_96"
    },
    {
      "end": 2554402,
      "speaker": "Marian Dörk",
      "start": 2545764,
      "text": "So it's called monadic exploration and it's still in submission as a paper, but we have a demo online, so you can, you can play around with it.",
      "id": "ep_30_ut_97"
    },
    {
      "end": 2557974,
      "speaker": "Enrico Bertini",
      "start": 2554498,
      "text": "Can you send us the link so we can add it on the blog post?",
      "id": "ep_30_ut_98"
    },
    {
      "end": 2642996,
      "speaker": "Marian Dörk",
      "start": 2558594,
      "text": "Yes, yes. And I have to say a few extra works, actually. So we worked with a book editor team to actually bring this demo out. So they have, it's the team behind beautiful trouble, which is sort of a book on creative, and I have to say peaceful forms of activism. And the interesting thing about the book is, besides the content, which is really exciting, I find, but besides the actual content of the different chapters, is that they are all interlinked. So when you browse through the paper book, you see on the margins all these different see also links. So as a visualizer, as a computer nerd, I see a network and I want to bring it on screen. And they actually have all their content online on their website. So when I contacted them, they were actually quite open to working on that as a visualization project. And we sort of thought this through both conceptually, but then eventually also in itself design ways. How do you arrange over 100 little modules in a way that encourages navigation, shows also something for each element and how search plays into that. And it was really nice project, actually.",
      "id": "ep_30_ut_99"
    },
    {
      "end": 2823514,
      "speaker": "Enrico Bertini",
      "start": 2643140,
      "text": "Yeah. Cool. I just want to briefly mention, one thing that came into my mind is that I truly believe that this idea of starting. So instead of following the overview first path, starting from one specific seed point, is not only interesting as a way to explorer data set or might be interesting for exploration and serendipity, I also have practical examples where this kind of paradigm can be really, really useful because it matches much, much better the mental model that people have of the problem that they want to solve. So to give you a specific example, actually this comes from my own work. A few years back, I was working with a group of biologist, and so these people is interested in finding specific molecules that have certain behaviors. Okay. And for months and months we kept working on overviews of the old data set that they get out of these experiments that involve hundreds of thousands of molecules. And every time we showed our results to them, the reaction was always kind of like, yeah, that's interesting, but there was always a but at the end, right? And I had a very hard time because we tried kind of like three or four different, kind of completely different visual, visual designs, right? And then one day I started speaking with this guy, a biochemistry and Olina Sade, and I realized, man, these people are really much interested. They're not interested at all in the overview. They don't want to detect patterns. They want to see what happens around some specific molecules they're interested in, right? So the way they think about the problem is what happens around this molecule. So even if they have a thousand, a million or whatever kind of molecules as an outcome from their experiment, they have an entry, as an entry point. They think about, I want to see what happens around this set of molecules, then around can mean ten hundred thousand and so on, right? But here you have a specific example of how even in practical terms, and even in projects where the focus is pretty much on problem solving, the way they think about the problem might actually lead to a design that starts from a specific city point. And I think this can apply to many other cases. So I have the feeling that there are cases where the way a person thinks about the problem matches very, very well with the idea of starting from one seed point or a few seed points. And I think this is somewhat unexplored.",
      "id": "ep_30_ut_100"
    },
    {
      "end": 2831116,
      "speaker": "Marian Dörk",
      "start": 2825534,
      "text": "There has been a paper on that and I don't recall the exact author list, but I think Frank van Ham.",
      "id": "ep_30_ut_101"
    },
    {
      "end": 2831460,
      "speaker": "Enrico Bertini",
      "start": 2831140,
      "text": "Yeah.",
      "id": "ep_30_ut_102"
    },
    {
      "end": 2833684,
      "speaker": "Marian Dörk",
      "start": 2831532,
      "text": "Was absolutely one author. And I think also Adam.",
      "id": "ep_30_ut_103"
    },
    {
      "end": 2834348,
      "speaker": "Enrico Bertini",
      "start": 2833724,
      "text": "Adam Pedro.",
      "id": "ep_30_ut_104"
    },
    {
      "end": 2841196,
      "speaker": "Marian Dörk",
      "start": 2834396,
      "text": "Yeah, yeah, it's a search first and expand later or something like today we're.",
      "id": "ep_30_ut_105"
    },
    {
      "end": 2844264,
      "speaker": "Enrico Bertini",
      "start": 2841220,
      "text": "Talking about show context, expand on demand.",
      "id": "ep_30_ut_106"
    },
    {
      "end": 2847540,
      "speaker": "Moritz Stefaner",
      "start": 2846324,
      "text": "It's another mantra.",
      "id": "ep_30_ut_107"
    },
    {
      "end": 2848828,
      "speaker": "Enrico Bertini",
      "start": 2847652,
      "text": "It's another. Yeah.",
      "id": "ep_30_ut_108"
    },
    {
      "end": 2850984,
      "speaker": "Moritz Stefaner",
      "start": 2848916,
      "text": "You scientists are in this mantra thing.",
      "id": "ep_30_ut_109"
    },
    {
      "end": 2855804,
      "speaker": "Enrico Bertini",
      "start": 2851404,
      "text": "No, but they are basically advocating for the same kind of thing. Yeah, it's really interesting.",
      "id": "ep_30_ut_110"
    },
    {
      "end": 2856964,
      "speaker": "Moritz Stefaner",
      "start": 2855844,
      "text": "Yeah, yeah, that's cool.",
      "id": "ep_30_ut_111"
    },
    {
      "end": 2859452,
      "speaker": "Marian Dörk",
      "start": 2857004,
      "text": "We are slightly, we are quite esoteric people, don't you know?",
      "id": "ep_30_ut_112"
    },
    {
      "end": 2862212,
      "speaker": "Moritz Stefaner",
      "start": 2859508,
      "text": "Yeah. I realized very late, but then I.",
      "id": "ep_30_ut_113"
    },
    {
      "end": 2969912,
      "speaker": "Marian Dörk",
      "start": 2862268,
      "text": "Realized hard what I find fascinating about that, you know, Enrico, you working with biologists and sort of developing. Oh, wow. There are actually certain problems that require a different perspective. And I am noticing this more and more that actually from, in my case, sort of particular collections or information spaces, maybe archives, that engaging with the, the people who maintain this data set or these resources actually can be really fruitful. Because when I want to support this notion of the information flannel, I don't want a neutral, sort of clinical version of the data. I think what is useful and what is sort of also inviting is a representation, an interface that, how do you say, respects the ethos and the aesthetics of a collection. Maybe that's not what the biologists are after, but actually developing a sensibility for the data and also for the context and for the aura or for, you know, the spirit and going back to the esoteric stuff. Right. Actually, sort of the softer aspects that might not play to what we think or what we have thought, what visualization is about. But I think we should also keep that in mind. And we actually worked with a photo archive in Newcastle and, you know, sort of, sort of ethical and. Yeah, ethical questions and also the questions of how photos would be shown in which kind of context were key because these, you know, these photos were documenting people's lives. And, you know, you can't just mesh it up randomly. Like there's, there's, there are stories, there's fabric that you can.",
      "id": "ep_30_ut_114"
    },
    {
      "end": 2970160,
      "speaker": "Enrico Bertini",
      "start": 2969968,
      "text": "Yeah.",
      "id": "ep_30_ut_115"
    },
    {
      "end": 3006112,
      "speaker": "Moritz Stefaner",
      "start": 2970192,
      "text": "Also, if, let's say you just, you have just numbers and somebody's just interested in finding a number or summing up numbers, then the number is sort of the end point. But if you visualize, let's say, an art collection. Yeah. Then the things you're visualizing is just an indexical, like a pointer to the actual thing, which is like this super deep work and has this huge historical context and has the artist and behind it and so on. And so I absolutely agree. That's a whole different story. And you can't mash them up like arbitrarily or just do the average of two artworks and see what you end up with. Yeah.",
      "id": "ep_30_ut_116"
    },
    {
      "end": 3046724,
      "speaker": "Marian Dörk",
      "start": 3006168,
      "text": "I mean, you know, you can play around with it. And there have been some nice attempts doing this, but I think you lose a lot of integrity. And I think there's this, I find it I quite fruitful to actually hear. Well, also to be pointed out what the interesting linkages are. Sure, we can link, you know, we can link the crap out of the data sets that we have, but what are actually the meaningful and maybe the links that are not shown in typical interfaces and I think working with domain experts and the people that actually use these data sets and these collections in their own work is super beneficial and then I think can also give rise to new representations. New.",
      "id": "ep_30_ut_117"
    },
    {
      "end": 3086524,
      "speaker": "Moritz Stefaner",
      "start": 3049234,
      "text": "Let's just assume I just registered like monardflaneur.com and I want to start my own thing there. I mean, no, more seriously, do you have any tips or from your experiences, like if you want to optimize for that precise thing, like the serendipity and the information send and the flaneurism, are there any like design patterns or things where you thought these things would be easy but then turned out hard, or any mechanisms which you find interesting, something where people can get started in designing interfaces for flaneurs?",
      "id": "ep_30_ut_118"
    },
    {
      "end": 3121314,
      "speaker": "Enrico Bertini",
      "start": 3087024,
      "text": "Yeah, that's exactly the same kind of question that I wanted to ask Marian, because even from the academic point of view, I'm just trying to think how do you, so as long as soon as you move out of this problem solving kind of framework, how do you actually guide yourself into the design process? When do you know that you have designed the right quote thing? Right, sorry, we are torturing Maria.",
      "id": "ep_30_ut_119"
    },
    {
      "end": 3405960,
      "speaker": "Marian Dörk",
      "start": 3122294,
      "text": "So, first of all, you know, if you are, if you have the information from your site or you identify with him and her, I think that's already useful to actually, that's, and that's, that's just the benefit of Personas. And, you know, Personas have been around in design thinking for years, maybe ages, I don't know. But, you know, that's, that's already, I think that's already. That can be useful to have a concrete person with certain abilities and characteristics and so forth. Now, to actually move this forward into, into your design process, I found the notion of explorability very useful. So to me, this is like a complementary principle besides usability, while usability speaks to the sort of interface mechanisms, you know, are the buttons, do they have the right size, is the text legible and so forth. It's sort of usability, in my eyes, describes a relationship between interface and hardware and or, you know, artifacts and the user or the viewer and so forth. And for me, explorability, in a way says, yeah, there can be hardware, software, visualizations blah, blah. These are sort of the mediating things. But let's talk about the relationship between the content or the information space or the data and the searcher or the viewer, right? So human and information maybe. And I think explorability is useful because it speaks to, well, we really want to have this flannel engage with the data, move around and then under that sort of umbrella term, explorability. How can we make information space explorable? I found sort of three guiding concepts useful. First, orientation. So think about how your interface shows you where you are in an information space and also where you can go. So make invitations for your next navigation steps, and also vice versa, give a way to, or provide mechanisms to trace back your, or to go back to where you started. So the obvious sort of function in a browser is of course the back button or the browser's history, something that actually is still not very often supported in visualizations, so that you can actually have sort of like an implicit, well, not bookmarks, we can also use it for bookmarks, but an implicit sort of history of the navigation steps that we have in the visualization. So that's sort of orientation both where we have been and also where we can go. And then there's this principle of visual momentum. It's sort of this notion of perceptual continuity that describes that when we have two subsequent display states, how much overlap is between them. So when I move from one search result page to the next because I added a new query term, maybe there's actually overlap between the results and visual momentum. If there's a high level of visual momentum, I can actually make the connection because maybe a result item moves a few steps up and it's actually animated to that state. But this actually in our, you know, in today's search interfaces, visual momentum is very low because we have abrupt changes. So if you want to support that sort of more continuous experience through an information space, think about how the subsequent display states are intertwined and sort of connected through transitions and animations and so forth. Don't overdo it. You know, it doesn't always make sense. It might be quite distracting to use, you know, rotating, whatever crazy animations, but where it makes sense, where actually the same elements are between two display states, try to create some continuity so that your perceptual apparatus is not always asked, oh, where am I? Where am I? Where's the element from the last display state and so forth. And the third sort of concept is, I find quite hard to design for serendipity but I think it's important as designers of these sort of visualizations and information interfaces is to think about how we make invitations to discover things that we didn't look for and actually pursue these sort of information encounters. And we talked about this already quite a bit, but essentially show things that are related for maybe strange reasons or for unexpected reasons.",
      "id": "ep_30_ut_120"
    },
    {
      "end": 3417094,
      "speaker": "Moritz Stefaner",
      "start": 3406032,
      "text": "Yeah, but it's something more that emerges probably, if you do all the rest. Right, right. Or, I mean, it's difficult to start with saying like, oh, we want to optimize for serendipity or.",
      "id": "ep_30_ut_121"
    },
    {
      "end": 3451884,
      "speaker": "Marian Dörk",
      "start": 3417134,
      "text": "Yeah, yeah, it's hard. But if you're dealing with photo collections, you know, for example, and look at the relationships between photos or between sets, I think it can be useful to ask yourself as a designer, what would it mean to make a serendipitous encounter? You know, going from if you're just moving within sets and if it's just your hierarchical, typical album whatever or set situation, maybe there's almost no opportunity for these encounters. And how can you expose some other linkages that are maybe something that you didn't look for or wouldn't look for otherwise?",
      "id": "ep_30_ut_122"
    },
    {
      "end": 3460364,
      "speaker": "Moritz Stefaner",
      "start": 3453064,
      "text": "Yeah, super interesting. So do you think there will be like a flannery designer's handbook out at some point?",
      "id": "ep_30_ut_123"
    },
    {
      "end": 3489066,
      "speaker": "Marian Dörk",
      "start": 3462064,
      "text": "I don't. I'm not, I don't see myself as a book author, but I think, I mean, there are some. Visualization in search has been a topic for quite some time. So I think we will see more of it and I think it will start with maybe smaller visualizations integrated in search and maybe these larger visualizations integrating more and more search capability and. Yeah, I can keep you posted.",
      "id": "ep_30_ut_124"
    },
    {
      "end": 3524404,
      "speaker": "Moritz Stefaner",
      "start": 3489130,
      "text": "Yeah, absolutely. No, I absolutely agree. There's so much potential for visualization in the cultural sphere that we don't really, or just a few people who are just interested, they make use of that and do really exciting stuff. But I think there's much more to come, both on an institutional level, like visualizing collections of museums or things like that, but also your personal stuff like your music library, your photos, your texts. I think that's super exciting. Any other projects we should check out? Are there any really amazing projects in that area?",
      "id": "ep_30_ut_125"
    },
    {
      "end": 3537824,
      "speaker": "Marian Dörk",
      "start": 3525664,
      "text": "See, I was actually, now that you just mentioned collections, I'm not sure if we talked before the show or during the show about generous interfaces and Mitchell Whitelaw's work.",
      "id": "ep_30_ut_126"
    },
    {
      "end": 3538724,
      "speaker": "Moritz Stefaner",
      "start": 3537864,
      "text": "No, we haven't.",
      "id": "ep_30_ut_127"
    },
    {
      "end": 3593224,
      "speaker": "Marian Dörk",
      "start": 3539704,
      "text": "Okay. So I found his notion of generosity in terms of interfaces very useful. So instead of being stingy and only showing you something after you entered a search query, a generous collection interface actually shows you already samples of the, of the resources of the paintings, of the, of the photos, whatever, and blending this with visualization power. So actually showing maybe the distribution of resources over time or among different techniques and so forth. So I think that's, that's very useful. I mean, there's lots of activity in this space. You just mentioned cultural collections, the digital humanities are, have been for the last few years, becoming really interested in visualization, in collections. Lots of things are moving right now, so I can send you some links when some things come to mind.",
      "id": "ep_30_ut_128"
    },
    {
      "end": 3599228,
      "speaker": "Moritz Stefaner",
      "start": 3595604,
      "text": "Great. Fascinating topic. I'm now, yeah, I'm all for building.",
      "id": "ep_30_ut_129"
    },
    {
      "end": 3620624,
      "speaker": "Enrico Bertini",
      "start": 3599276,
      "text": "Browsing, and I feel like we just started scratching the surface. Yeah, I agree. I mean, even just thinking about visualization integrated with search looks like there's not much of. I cannot think of too many examples where visualization and search are very well tied together, coupled.",
      "id": "ep_30_ut_130"
    },
    {
      "end": 3630164,
      "speaker": "Moritz Stefaner",
      "start": 3620744,
      "text": "And there were a lot, like 15 years ago, ten to 15 years. There was a lot of research in that area. But then sort of. Yeah, the focus has shifted it.",
      "id": "ep_30_ut_131"
    },
    {
      "end": 3662942,
      "speaker": "Marian Dörk",
      "start": 3631264,
      "text": "Yeah. And I think they were all very much tied to this old notion of search that you enter a search query and you quickly grasp what is the most relevant. And I think now there are some thinking about more exploratory search, slow search, more open ended types of information seeking. And I think this is really where visualization can shine to show relationships that you wouldn't need if you just look for a book quickly, but that you might be interested in when you want to sort of search through as opposed to search quickly.",
      "id": "ep_30_ut_132"
    },
    {
      "end": 3677964,
      "speaker": "Moritz Stefaner",
      "start": 3662998,
      "text": "Right, right, yeah. Or for a collection, just understand what's there and not what's there in sums, but what's there in things and actual things that you can inspect and. And quickly understand. Yeah, yeah, yeah, yeah. Super interesting.",
      "id": "ep_30_ut_133"
    },
    {
      "end": 3678768,
      "speaker": "Marian Dörk",
      "start": 3678344,
      "text": "Cool.",
      "id": "ep_30_ut_134"
    },
    {
      "end": 3682744,
      "speaker": "Moritz Stefaner",
      "start": 3678816,
      "text": "Good stuff. I think we have to wrap it up. Time's almost up.",
      "id": "ep_30_ut_135"
    },
    {
      "end": 3691164,
      "speaker": "Marian Dörk",
      "start": 3682784,
      "text": "Yeah, yeah, sounds good. Yeah, we should chat more at some point. Maybe. Maybe we will at some point actually manage to get Moritz out to.",
      "id": "ep_30_ut_136"
    },
    {
      "end": 3701248,
      "speaker": "Moritz Stefaner",
      "start": 3696424,
      "text": "No, Paris is like. Yeah, it's difficult.",
      "id": "ep_30_ut_137"
    },
    {
      "end": 3705528,
      "speaker": "Enrico Bertini",
      "start": 3701336,
      "text": "Come on. Come on.",
      "id": "ep_30_ut_138"
    },
    {
      "end": 3713084,
      "speaker": "Moritz Stefaner",
      "start": 3705576,
      "text": "So far, no, I think I'll make it to Paris in one way or the other. I mean, I might stage a little counter conference.",
      "id": "ep_30_ut_139"
    },
    {
      "end": 3715928,
      "speaker": "Marian Dörk",
      "start": 3714184,
      "text": "I think you should take a helicopter.",
      "id": "ep_30_ut_140"
    },
    {
      "end": 3720804,
      "speaker": "Moritz Stefaner",
      "start": 3715976,
      "text": "And post you shoot myself randomly into the city and start walking.",
      "id": "ep_30_ut_141"
    },
    {
      "end": 3724084,
      "speaker": "Enrico Bertini",
      "start": 3722504,
      "text": "With a couple of bodyguards.",
      "id": "ep_30_ut_142"
    },
    {
      "end": 3732960,
      "speaker": "Moritz Stefaner",
      "start": 3726504,
      "text": "Anything else would be too analytic. Excellent.",
      "id": "ep_30_ut_143"
    },
    {
      "end": 3733560,
      "speaker": "Enrico Bertini",
      "start": 3733032,
      "text": "Okay, guys.",
      "id": "ep_30_ut_144"
    },
    {
      "end": 3735824,
      "speaker": "Moritz Stefaner",
      "start": 3733592,
      "text": "Yeah, it was great talking to you, Maria. Thanks so much.",
      "id": "ep_30_ut_145"
    },
    {
      "end": 3742984,
      "speaker": "Marian Dörk",
      "start": 3735944,
      "text": "Thank you guys for having me. And it has been a pleasure also listening to you guys for the last 29 episodes, so keep it up.",
      "id": "ep_30_ut_146"
    },
    {
      "end": 3743384,
      "speaker": "Moritz Stefaner",
      "start": 3743024,
      "text": "Thank you.",
      "id": "ep_30_ut_147"
    },
    {
      "end": 3743742,
      "speaker": "Enrico Bertini",
      "start": 3743424,
      "text": "Thank you.",
      "id": "ep_30_ut_148"
    },
    {
      "end": 3744274,
      "speaker": "Moritz Stefaner",
      "start": 3743768,
      "text": "Excellent.",
      "id": "ep_30_ut_149"
    },
    {
      "end": 3745706,
      "speaker": "Enrico Bertini",
      "start": 3744394,
      "text": "Bye bye.",
      "id": "ep_30_ut_150"
    },
    {
      "end": 3746122,
      "speaker": "Moritz Stefaner",
      "start": 3745730,
      "text": "Bye.",
      "id": "ep_30_ut_151"
    },
    {
      "end": 3747534,
      "speaker": "Marian Dörk",
      "start": 3746218,
      "text": "Bye bye.",
      "id": "ep_30_ut_152"
    }
  ],
  "confidence": 0.918136400173322,
  "audio_duration": 3752,
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_status_code": null,
  "webhook_auth": false,
  "webhook_auth_header_name": null,
  "speed_boost": false,
  "auto_highlights_result": null,
  "auto_highlights": false,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_audio_quality": null,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "content_safety": false,
  "iab_categories": true,
  "content_safety_labels": {
    "status": "unavailable",
    "results": [],
    "summary": {}
  },
  "language_detection": false,
  "language_detection_threshold": null,
  "language_confidence": null,
  "custom_spelling": null,
  "throttled": false,
  "auto_chapters": true,
  "summarization": false,
  "summary_type": null,
  "summary_model": null,
  "custom_topics": false,
  "topics": [],
  "speech_threshold": null,
  "speech_model": "best",
  "chapters": [
    {
      "summary": "Enrico: Number 30 is almost like an anniversary. I have the flu. Six months of agony ahead. Any news from your site? Not so much. Just wrapping up the year.",
      "gist": "Happy Year! Data stories, number 30",
      "headline": "Enrico: I have the kindergarten flu, which is terrible",
      "start": 15800,
      "end": 121694,
      "id": "ep_30_ch_0"
    },
    {
      "summary": "Every student does a different project. There are people who are doing more things on the data analysis side. One student is creating sort of tabletop version of multidimensional projections. There is a whole range of different stuff. It's fun.",
      "gist": "What are you doing these days?",
      "headline": "Every student does a different project in the class I'm teaching",
      "start": 122434,
      "end": 224014,
      "id": "ep_30_ch_1"
    },
    {
      "summary": "Enrico: We have a guest today, as usual, and I'm really happy to introduce Marion dork. Marian is a newly appointed professor in Potsdam, close to Berlin. And we are going to talk about something really special and somewhat sounds a bit weird.",
      "gist": "Dork on the Information Flaneur",
      "headline": "Enrico: We have a guest today, Marian dork",
      "start": 225034,
      "end": 324424,
      "id": "ep_30_ch_2"
    },
    {
      "summary": "Information flaneur is a computer science degree with a focus on graphics visualization, image processing and also some sort of non technical subjects. Now in Berlin since October, working at the University of Applied Sciences in Potsdam. Co teaching a course with Sebastian Meyer.",
      "gist": "Pushing the boundaries of information flaneur",
      "headline": "Information flaneur is a researcher who focuses on visualization and information seeking",
      "start": 326564,
      "end": 648704,
      "id": "ep_30_ch_3"
    },
    {
      "summary": "Marianne: At some point in your research you came up with this idea that there is something beyond data analysis and then visualization may play a big role there. Can you explain to us a little bit better what you mean by information flannel?",
      "gist": "Marianne on the '",
      "headline": "Marianne says visualization can help explore rich information spaces beyond data analysis",
      "start": 649004,
      "end": 860288,
      "id": "ep_30_ch_4"
    },
    {
      "summary": "The flaneur gives us a new perspective on the city. We can borrow the flannel's attitude to think about how we engage with digital information. The web is becoming the cultural backdrop for everything that we do.",
      "gist": "The Flaneur and the Information Planeur",
      "headline": "The flaneur gives us a new perspective on the city",
      "start": 860336,
      "end": 1157176,
      "id": "ep_30_ch_5"
    },
    {
      "summary": "Marian, can you give us a couple of examples of visualization tools that go exactly into this direction? The first visualization that was explicitly designed for sort of strolling through information spaces was a project I've done at Microsoft Research called Pivot Paths.",
      "gist": "Strolling Through the Web's Information Spaces",
      "headline": "Marian, can you give us a couple of examples of visualization tools",
      "start": 1157360,
      "end": 1477304,
      "id": "ep_30_ch_6"
    },
    {
      "summary": "The database actually has over a million papers and even more so metadata fields. How do we give presence to what, you know, to what we can't show? Of course, it's a paradox. Next question, please.",
      "gist": "The Problem of the Internet",
      "headline": "How do we give presence to what we can't show",
      "start": 1477344,
      "end": 1588250,
      "id": "ep_30_ch_7"
    },
    {
      "summary": "Infovis host asks whether the visual information seeking mantra is useful. Ben Shneiderman says overview first, and then zoom and filter and then details on demand at some point. But for some datasets it just works better to do overview type visualizations.",
      "gist": "The Need for an Outline",
      "headline": "Ben Shneiderman says overview first, then details on demand",
      "start": 1588442,
      "end": 1921414,
      "id": "ep_30_ch_8"
    },
    {
      "summary": "Do you see these techniques also moving into, I mean, we do have a lot of browsing softwares and devices and so on already that. There's potential to integrate visualization, how do you say, magic fairy dust into conventional interfaces.",
      "gist": "Do we need data visualization in our interfaces?",
      "headline": "I think there's potential to integrate visualization into conventional interfaces",
      "start": 1922554,
      "end": 2101117,
      "id": "ep_30_ch_9"
    },
    {
      "summary": "Information sent uses some external source, such as social activity, and blends it with your typical interface. How do I visualize what is not in the direct neighborhood of my current point of view? Could be interesting to think about if a user actually engages for a longer time.",
      "gist": "Information sent and information collected",
      "headline": "Information sent is a way of informing your path by previous activity",
      "start": 2101285,
      "end": 2385450,
      "id": "ep_30_ch_10"
    },
    {
      "summary": "The project is called monadic exploration and it's still in submission as a paper, but we have a demo online. It's this notion of navigating similar to pivot paths between individual elements, but then still showing the whole collection around these elements.",
      "gist": "Monadic Exploration",
      "headline": "Rob comer and Martin Date Robertson are working on a visualization project",
      "start": 2385522,
      "end": 2644196,
      "id": "ep_30_ch_11"
    },
    {
      "summary": "Instead of following the overview first path, starting from one specific seed point could be interesting for exploration and serendipity. It matches much, much better the mental model that people have of the problem that they want to solve. And I think this can apply to many other cases.",
      "gist": "Exploring the universe with a seed point",
      "headline": "Adam Pedro: Starting from one seed point can be very useful in problem solving",
      "start": 2644340,
      "end": 2841196,
      "id": "ep_30_ch_12"
    },
    {
      "summary": "Enrico: I think what is useful and what is also inviting is a representation that respects the ethos and the aesthetics of a collection. Working with domain experts and the people that actually use these data sets and these collections in their own work is super beneficial.",
      "gist": "Quantum visualization: show context, expand on demand",
      "headline": "Talking about show context, expand on demand. Yeah. It's another mantra. You scientists are in this mantra thing. No, but they are",
      "start": 2841220,
      "end": 3046040,
      "id": "ep_30_ch_13"
    },
    {
      "summary": "New. com asked: Do you have any tips or from your experiences on designing interfaces for flaneurs. Are there any like design patterns or things where you thought these things would be easy but then turned out hard? How do you guide yourself into the design process?",
      "gist": "Designing Interface for Flaneurs",
      "headline": "Maria: How do you guide yourself into designing interfaces for flaneurs",
      "start": 3046112,
      "end": 3148898,
      "id": "ep_30_ch_14"
    },
    {
      "summary": "The notion of explorability is a complementary principle besides usability. How can we make information space explorable? I found sort of three guiding concepts useful. And the third concept is, I find quite hard to design for serendipity.",
      "gist": "In the Elevator: Serendipity and Explorability",
      "headline": "I found the notion of explorability very useful in visualizations",
      "start": 3148946,
      "end": 3518164,
      "id": "ep_30_ch_15"
    },
    {
      "summary": "Digital humanities are becoming really interested in visualization, in collections. Are there any really amazing projects in that area? There's lots of activity in this space. Lots of things are moving right now.",
      "gist": "What is the role of data visualization in the humanities?",
      "headline": "You mentioned generous interfaces and Mitchell Whitelaw's work on collections",
      "start": 3518944,
      "end": 3593224,
      "id": "ep_30_ch_16"
    },
    {
      "summary": " visualization and search are very well tied together, coupled. Now there are some thinking about more exploratory search, slow search, more open ended types of information seeking. This is really where visualization can shine to show relationships.",
      "gist": "Vendation and Search",
      "headline": "Even thinking about visualization integrated with search looks like there's not much",
      "start": 3595604,
      "end": 3678768,
      "id": "ep_30_ch_17"
    },
    {
      "summary": "Good stuff. Maybe we will at some point actually manage to get Moritz out to Paris. No, Paris is like. Yeah, it's difficult. I think we have to wrap it up. Time's almost up.",
      "gist": "A Day in the Life of Paris",
      "headline": "No, I think I'll make it to Paris in one way or another",
      "start": 3678816,
      "end": 3732960,
      "id": "ep_30_ch_18"
    },
    {
      "summary": "Okay, guys. Yeah, it was great talking to you, Maria. Thank you guys for having me. And it has been a pleasure also listening to you for the last 29 episodes, so keep it up. Bye bye.",
      "gist": "Dancing With Maria",
      "headline": "Maria: It has been a pleasure talking to you guys this morning",
      "start": 3733032,
      "end": 3747534,
      "id": "ep_30_ch_19"
    }
  ],
  "disfluencies": false,
  "entity_detection": false,
  "sentiment_analysis": false,
  "sentiment_analysis_results": null,
  "entities": null,
  "speakers_expected": null,
  "summary": null,
  "custom_topics_results": null,
  "episode_num": 30,
  "episode_metadata": {
    "speakers": [
      "Enrico Bertini",
      "Moritz Stefaner",
      "Marian Dörk"
    ],
    "WPid": "140",
    "url": "https://datastori.es/podlove/file/301/s/feed/c/mp3/datastories-30.mp3",
    "episode_title": "The Information Flaneur w/ Marian Dörk"
  }
}