{
  "id": "6df5ac4b-6375-407e-9c4e-571a266f5b6d",
  "language_model": "assemblyai_default",
  "acoustic_model": "assemblyai_default",
  "language_code": "en_us",
  "status": "completed",
  "audio_url": "https://datastori.es/podlove/file/267/s/feed/c/mp3/Datastories-27.mp3",
  "utterances": [
    {
      "end": 17534,
      "speaker": "Enrico Bertini",
      "start": 12520,
      "text": "Hi, everyone. Data stories number 27. Hi, Moritz.",
      "id": "ep_27_ut_0"
    },
    {
      "end": 21610,
      "speaker": "Moritz Stefaner",
      "start": 17622,
      "text": "Hi, Enrico. How you doing? You sound very energetic.",
      "id": "ep_27_ut_1"
    },
    {
      "end": 29178,
      "speaker": "Enrico Bertini",
      "start": 23870,
      "text": "You think so? Well, you know, I go with the weather. The weather is not that good.",
      "id": "ep_27_ut_2"
    },
    {
      "end": 31202,
      "speaker": "Moritz Stefaner",
      "start": 29234,
      "text": "Yeah, yeah, I know what you mean.",
      "id": "ep_27_ut_3"
    },
    {
      "end": 34002,
      "speaker": "Enrico Bertini",
      "start": 31386,
      "text": "Yeah. Hey, it's been a long time, man.",
      "id": "ep_27_ut_4"
    },
    {
      "end": 34354,
      "speaker": "Kate Crawford",
      "start": 34066,
      "text": "Yeah.",
      "id": "ep_27_ut_5"
    },
    {
      "end": 35658,
      "speaker": "Enrico Bertini",
      "start": 34402,
      "text": "Since our last episode.",
      "id": "ep_27_ut_6"
    },
    {
      "end": 36550,
      "speaker": "Moritz Stefaner",
      "start": 35714,
      "text": "That's true.",
      "id": "ep_27_ut_7"
    },
    {
      "end": 38010,
      "speaker": "Enrico Bertini",
      "start": 37250,
      "text": "Yeah.",
      "id": "ep_27_ut_8"
    },
    {
      "end": 39590,
      "speaker": "Moritz Stefaner",
      "start": 38170,
      "text": "How was your September?",
      "id": "ep_27_ut_9"
    },
    {
      "end": 43970,
      "speaker": "Enrico Bertini",
      "start": 40690,
      "text": "Good. Busy, busy, busy, busy. But good. I'm excited.",
      "id": "ep_27_ut_10"
    },
    {
      "end": 45202,
      "speaker": "Moritz Stefaner",
      "start": 44010,
      "text": "Semester has started.",
      "id": "ep_27_ut_11"
    },
    {
      "end": 77922,
      "speaker": "Enrico Bertini",
      "start": 45386,
      "text": "Semester started. I have a few students working with me and it's fun. It's lots of fun. Just yesterday I came from, I gave a very interesting exercise in class where I asked my students to sketch visualizations by hand. And I gave them actually a dataset and a few questions coming from a research paper. And after they provided their solutions, I showed them the solution from the researchers.",
      "id": "ep_27_ut_12"
    },
    {
      "end": 79870,
      "speaker": "Moritz Stefaner",
      "start": 78026,
      "text": "Okay. The original graphic.",
      "id": "ep_27_ut_13"
    },
    {
      "end": 86398,
      "speaker": "Enrico Bertini",
      "start": 80570,
      "text": "Yeah, the original graphics. And that was fun. That was fun. Yeah. My students are good, actually. I'm surprised.",
      "id": "ep_27_ut_14"
    },
    {
      "end": 89530,
      "speaker": "Moritz Stefaner",
      "start": 86534,
      "text": "Did they do better than the original researchers? Hopefully.",
      "id": "ep_27_ut_15"
    },
    {
      "end": 107450,
      "speaker": "Enrico Bertini",
      "start": 91510,
      "text": "I don't think they did better, but there were very interesting and stimulated discussions. So this kind of stuff, it's always good to. I mean, sometimes I have the feeling that I'm learning myself more than what I teach them. And it's fun. It's a lot of fun.",
      "id": "ep_27_ut_16"
    },
    {
      "end": 118562,
      "speaker": "Moritz Stefaner",
      "start": 108970,
      "text": "Yeah. I was also just teaching, so I went back to my old university to teach the cognitive science students. Wow, some database. Yeah, that was really good. Yeah, yeah.",
      "id": "ep_27_ut_17"
    },
    {
      "end": 119922,
      "speaker": "Enrico Bertini",
      "start": 118626,
      "text": "Back to the mothership.",
      "id": "ep_27_ut_18"
    },
    {
      "end": 138350,
      "speaker": "Moritz Stefaner",
      "start": 120066,
      "text": "Exactly. Yeah. Spend a day talking about rainbow color scales, roughly, because, you know, they always have the fMRI data and the. Also the machine learning people, they always have these magic carpets, you know, these error landscapes, and it's always rainbows. So I think we spent a whole day just discussing these.",
      "id": "ep_27_ut_19"
    },
    {
      "end": 144810,
      "speaker": "Enrico Bertini",
      "start": 138730,
      "text": "Have you, did you check this? Have you seen this very nice series from the guy from NASA.",
      "id": "ep_27_ut_20"
    },
    {
      "end": 148694,
      "speaker": "Moritz Stefaner",
      "start": 145310,
      "text": "Yeah. Fantastic. We should link that. It's really.",
      "id": "ep_27_ut_21"
    },
    {
      "end": 149686,
      "speaker": "Enrico Bertini",
      "start": 148742,
      "text": "I love that one.",
      "id": "ep_27_ut_22"
    },
    {
      "end": 150086,
      "speaker": "Moritz Stefaner",
      "start": 149718,
      "text": "Absolutely.",
      "id": "ep_27_ut_23"
    },
    {
      "end": 162490,
      "speaker": "Enrico Bertini",
      "start": 150118,
      "text": "I love it. Yeah, yeah. Well, anyway, we have another fantastic guest today. It's my pleasure to introduce Kate Crawford here today. Hi, Kate.",
      "id": "ep_27_ut_24"
    },
    {
      "end": 164318,
      "speaker": "Kate Crawford",
      "start": 162830,
      "text": "Hi, guys. How you going?",
      "id": "ep_27_ut_25"
    },
    {
      "end": 247550,
      "speaker": "Enrico Bertini",
      "start": 164494,
      "text": "We are doing great. So we invited Kate because we wanted to talk about big data, criticism or skepticism. And she's one of the leading figures out there talking about big data and what are the limitations and what kind of big questions we should also ask on top of big data. Right? So everyone seems to be super excited. Everything seems to be super, super good. But of course, there are also some weird aspects and maybe limitations and maybe too much hype around it. Right. So we wanted to. We invited her because she's really prominent, so she's been. She has a paper out titled Critical Questions for big data. She's been invited in a number of different places. I think you've been at Strata last year or this year, right? Yeah. And another interesting article in the Harvard Business Review, the hidden biases in big data and so on. She also has lots of jobs. Principal researchers at Microsoft Research, visiting professor at MIT, senior fellow at Information Law Institute at NYU here, where I am an associate professor at the University of New South Wales. Wow, Kate, how can you manage that?",
      "id": "ep_27_ut_26"
    },
    {
      "end": 252310,
      "speaker": "Kate Crawford",
      "start": 249210,
      "text": "Very busy, and I spend a lot of time on planes.",
      "id": "ep_27_ut_27"
    },
    {
      "end": 268303,
      "speaker": "Enrico Bertini",
      "start": 254970,
      "text": "So we normally ask our guest to introduce themselves. Can you tell us a little bit more about your background, how you got here to the point of how did you get interested in big data and all the rest?",
      "id": "ep_27_ut_28"
    },
    {
      "end": 493530,
      "speaker": "Kate Crawford",
      "start": 268471,
      "text": "Oh, it's a long story. Once upon a time in a land far, far away. So I'm a professor, and I've been a professor for over a decade now. Gosh, it's so actually twelve years. And I was originally based in Australia, and I was heading up my own research institute at the University of New South Wales, working with Catherine Lumby, who's a media researcher there. And I had been researching a lot of issues to do with how the Internet can be thought of as both social and cultural technology. And I've been doing that for a long time. And seeing the emergence of social media in the early days struck me as being very interesting. So I took that very seriously at a time when people weren't necessarily taking things like Facebook and Twitter seriously. And I found an enormous amount of potential and also a lot of questions around how social media was going to transform particular kinds of engagements and communication. And as that grew, I connected with a whole lot of other researchers internationally who, who are also interested in these kinds of spaces, including Dana Boyd, who was based at Microsoft Research. And she invited me over here as a visiting professor. So I spent some time collaborating with her here, which is where we wrote our first paper together, which is the six provocations for big data. That was back in 2011, which was a paper that we gave at the Oxford Internet Institute for their 10th anniversary. And then we started doing more and more research and published papers since, including the critical questions paper that you mentioned. And they invited me to come over here and to stay. And so in addition to being at Microsoft Research, I'm also a professor over at MIT in the center for Civic Media, working with Ethan Zuckerman and others, which is a fantastic group of people as well. And in terms of what draws me to some of these big data questions. I think it's the shift that happened really just in the last five years in terms of the kinds of human life that are now quantifiable, the kinds of data that we can scrape, that we can study and analyze, that represent the social graph, that represent the way we communicate with people, that represent our tastes and our preferences, and the way that we see the world. That's a pretty extraordinary shift. That's a different way of visualizing human interaction and human communication. And it also has a lot of flow on effects and a lot of serious questions, as well as an enormous amount of potential. I have also been doing a lot of work in crisis informatics, looking at how the way people communicate changes during a crisis event. And that's also been absolutely extraordinary to see how much of that we can now gather and analyze from a sort of data perspective. So through these kinds of engagements, I became somebody who was both doing big data studies, as they're loosely called. We can talk about that term and whether or not that. I have my own issues with that term, but it seems to have become the shorthand. So while I'm also doing these studies, I've been seeing a set of recurring problems, and I started to notice these problems, and I started to write about them and started to talk to other researchers about them. And we all realized that there were these, these patterns that weren't being talked about publicly, problems in the way that these kinds of datasets are being used. Some of those problems were essentially methodological, some were epistemological. They're about how they understand knowledge. Some were ethical. Like, should we be using these data sets the way that we use them? So these are the questions that are really driving my research at the moment.",
      "id": "ep_27_ut_29"
    },
    {
      "end": 503494,
      "speaker": "Enrico Bertini",
      "start": 495670,
      "text": "That's really interesting. I actually didn't realize that your questions came from your own practice. That's really interesting.",
      "id": "ep_27_ut_30"
    },
    {
      "end": 510290,
      "speaker": "Moritz Stefaner",
      "start": 503662,
      "text": "One question. What did you study originally? Or was your PhD in? Or what's your background from that end?",
      "id": "ep_27_ut_31"
    },
    {
      "end": 518694,
      "speaker": "Kate Crawford",
      "start": 510910,
      "text": "Yeah, well, I have degrees in law and in philosophy, and my PhD is in critical media studies.",
      "id": "ep_27_ut_32"
    },
    {
      "end": 561320,
      "speaker": "Moritz Stefaner",
      "start": 518782,
      "text": "Nice. Yeah, it's a perfect combination. So before we talk about, let's say, the critical view, can we maybe sketch first what is like a data optimistic view or data positivistic view? Like, I mean, we all come from, I mean, we all work a lot with data and we all surrounded by data, and we find it very exciting. And just this article came back to my mind by Chris Anderson in 2008. It's called the end of theory, and basically writes like, every special science will be made obsolete by just data science, more or less. I think that's his, his main claim, that you don't need doctors, just people who are really good at crunching medical documents.",
      "id": "ep_27_ut_33"
    },
    {
      "end": 609810,
      "speaker": "Kate Crawford",
      "start": 563220,
      "text": "He's got a great line in that article where he says that, who knows why people do the things they do? The point is that they just do it and we can track it, and that's all we need, because basically, with enough data, the numbers speak for themselves. And that has been one of those incredibly famous phrases that I think has galvanized this view that somehow numbers are enough and that correlation is just as important as causation. And that really, ultimately, data is more important than why questions the why we do things, why that data might be there and what the context might be. And I guess I ascribe those kinds of perspectives under the title of, like, big data fundamentalism.",
      "id": "ep_27_ut_34"
    },
    {
      "end": 615094,
      "speaker": "Moritz Stefaner",
      "start": 611870,
      "text": "Like a religion? Yeah, religion.",
      "id": "ep_27_ut_35"
    },
    {
      "end": 688740,
      "speaker": "Kate Crawford",
      "start": 615142,
      "text": "It's like the articles of faith is that, you know, more data is better always, and that the bigger the data, the closer to objective truth you become. So I think that kind of fundamentalism is very much in its absolute zenith at the moment it's at its height. And people are very excited about data cracking. All of the great problems that we face, from climate change through to improving health systems, through to simply understanding why people do what they do. And I think there's a lot of questions that we need to ask about that enthusiasm. The enthusiasm is great, don't get me wrong. I mean, the reason I work in the lab that I work in, which I sit next to people who are experts in machine learning, I sit next to people who are doing extraordinary, extraordinary work in algorithmic game theory. I talk to people who are in theoretical physics. And the reason why a lab like this is so extraordinary is that we can talk about the strengths and weaknesses of the absolutely cutting edge emerging science in this field. And there are serious limitations. So thinking about those limitations, along with the hype, I think is actually really important because that's where we're going to produce better data research and ultimately better big data science.",
      "id": "ep_27_ut_36"
    },
    {
      "end": 692850,
      "speaker": "Moritz Stefaner",
      "start": 689750,
      "text": "So what are the main problems you see at the moment?",
      "id": "ep_27_ut_37"
    },
    {
      "end": 694890,
      "speaker": "Kate Crawford",
      "start": 693910,
      "text": "Interesting.",
      "id": "ep_27_ut_38"
    },
    {
      "end": 698450,
      "speaker": "Enrico Bertini",
      "start": 696870,
      "text": "How many hours we have.",
      "id": "ep_27_ut_39"
    },
    {
      "end": 711930,
      "speaker": "Kate Crawford",
      "start": 703630,
      "text": "Look, I'll just give you three that I think have been animating a lot of my thoughts and a lot of the papers and talks that I've been giving recently.",
      "id": "ep_27_ut_40"
    },
    {
      "end": 733750,
      "speaker": "Enrico Bertini",
      "start": 713270,
      "text": "Kate, before you go through, through these examples, through these items I'm just curious about are the ones that you're going to mention, those that come from your own practice originally, what you said at the beginning that you basically start discovering that there were problems while you were doing basically big data analysis.",
      "id": "ep_27_ut_41"
    },
    {
      "end": 738714,
      "speaker": "Kate Crawford",
      "start": 734610,
      "text": "I think that is certainly the basis of the first issue, which is.",
      "id": "ep_27_ut_42"
    },
    {
      "end": 741390,
      "speaker": "Enrico Bertini",
      "start": 738762,
      "text": "Ok, I was just curious about that.",
      "id": "ep_27_ut_43"
    },
    {
      "end": 843530,
      "speaker": "Kate Crawford",
      "start": 741450,
      "text": "Yeah, yeah. I mean, certainly in the last couple of years, I've spent a lot of time with people who are doing what is loosely called big data research. And a lot of the work that's happening and a lot of the ways we're trying to make it better sit under these three categories. So some of it is animated directly by work that I've done and collaborators that I work with, and some of it is raised by things that I see in the industry much more broadly. And I'm referring both, both to the academic side of big data research as well as what I'm seeing in the technology sector. Yeah. So it's personal, and I think it's also. It's sectoral in that sense. So, yeah, look, the top three for me is this, first of all, this myth of objectivity. The second one is the possibility of algorithmic discrimination, and the third one is the enormous difficulty of anonymization. And somewhere between those three, you can see there's questions that relate to method, there are questions that relate to how we think about fairness and justice in big data, and there are questions that relate to ethics and privacy and how we're actually going to think about keeping these data sets secure, which is actually a really big problem. So you can see that there's a set of concerns there that have a spectrum through to the very nuts and bolts pragmatics of what kind of methods we're applying and what kinds of assumptions are behind those methods through the epistemological questions, what does this data actually represent through to the ethical questions of how we're using it and who it's for and how do we protect it.",
      "id": "ep_27_ut_44"
    },
    {
      "end": 857818,
      "speaker": "Moritz Stefaner",
      "start": 846470,
      "text": "So let's dive into the first one. Yeah, absolutely. So isn't it like that if you have more data, you have a better approximation of reality? I mean, has to be like that, right?",
      "id": "ep_27_ut_45"
    },
    {
      "end": 989336,
      "speaker": "Kate Crawford",
      "start": 857994,
      "text": "Yeah. And I think for me, the real contact point for this came from when I first started looking at the way that social media data was being used during crisis events. So this was when I was based in Australia, and in 2010 and 2011, there was the largest ever flood in the history of Queensland, which is the, a northern state. And the floodplain was extraordinary. It was about the size of France. I mean, it was a huge floodplain and it was affecting large numbers of communities. And we were gathering the tweets and looking at the tweets and how people were sharing information, and there was some really fascinating things to be found in that data set. First of all, we were seeing how people were helping each other try to find and access the resources that were still available. So that was things like, which road is open? How do I get from this town to the next town? Which areas are possible through to which shops have milk and bread? Where can I actually get food through to some very interesting kinds of rumor crushing. So when other people were doing things like sending a picture of a shark that was in the waters of Brisbane before saying, okay, this is. This is obviously a fake. So all of these kinds of engagements are happening on Twitter in really interesting ways. But there was a problem at the same time, which is a vast majority of the tweets were coming from the capital city of Brisbane, which is actually not where the greatest damage was being experienced in the state. So even though the Twitter data, you have an enormous number of tweets about what's happening during the floods, they have an inherent skew or inherent bias that leads towards this kind of urban, privileged experience of this event, and certainly not the event at its most extreme. And this is important to recognize because, of course, crisis informatics uses a lot of social media data. It's a growing and important field, I'd say. So thinking about what that data can tell us, because it can tell us some very useful and productive things, and what it can't tell us is, I think, an important academic task right now.",
      "id": "ep_27_ut_46"
    },
    {
      "end": 1020130,
      "speaker": "Moritz Stefaner",
      "start": 989478,
      "text": "Yeah, yeah, yeah. And there's. I'm aware of a few studies that look at, like, typical demographics for, you know, the typical platforms, like, for Twitter. We know. I don't know. It's more people in the cities and more males than in the population and so on. The question is, how do you deal with that? Like, are there ways, are you aware of ways of sort of counterbalancing this bias, or should we just use certain data sets? Not in certain ways. Like, what's the best way out of that?",
      "id": "ep_27_ut_47"
    },
    {
      "end": 1087838,
      "speaker": "Kate Crawford",
      "start": 1020630,
      "text": "I think there are two ways out of it. One way that people like to talk about is sampling. Do we have a. That's representative? And I actually think that's extremely difficult to do, partly because of the fact that services like Twitter still have quite a small user base in terms of overall population of any particular country you might like to point to. And it skews young, it skews white, it skews more affluent, and these are difficult things to try and offset. What I tend to think is a good way to deal with that is to be very, very clear and upfront and explicit about what that data set does represent. So it's about in our research papers and also in the way those papers are reported on being very, very clear about, okay, these are the kinds of things we're getting. This data set is incredibly useful, but it's pertaining to these groups and these kinds of people. And that would be a huge improvement because right now what we see is a lot of reporting and sometimes even, although fortunately, a lot less sometimes research, when people say, well, this is what.",
      "id": "ep_27_ut_48"
    },
    {
      "end": 1091918,
      "speaker": "Moritz Stefaner",
      "start": 1087894,
      "text": "People, what the world thinks about, because.",
      "id": "ep_27_ut_49"
    },
    {
      "end": 1150800,
      "speaker": "Kate Crawford",
      "start": 1091974,
      "text": "This is what we see, or on Twitter and not be further from the truth. Because in addition to the fact that the Twitter population, the people who are using Twitter are a very kind of small subset, even within that subset, you can ask a whole bunch of really mind bending questions. One of those mind bending question is what percentage of that data is bots? Because we know that there are millions of bot accounts on Twitter and they're all sending messages, and those messages are all getting to these data sets. And I speak to research scientists about this all the time. It's actually very difficult to extract those messages from your Twitter data set. So therefore, how do we even know what percentage of that data is human and what percentage is non human? Right. So that actually rates a whole lot of really interesting questions. I don't know if you saw that amazing sentiment study that came out recently. That said, looking at Twitter, we can see that people are saddest on Thursday night. I looked at that and I thought, well, does that also mean bots are saddest on Thursday?",
      "id": "ep_27_ut_50"
    },
    {
      "end": 1154140,
      "speaker": "Moritz Stefaner",
      "start": 1151380,
      "text": "Right? Yeah. The machines had a long week.",
      "id": "ep_27_ut_51"
    },
    {
      "end": 1167356,
      "speaker": "Kate Crawford",
      "start": 1154260,
      "text": "Yeah. Is that for bots? Is it Thursday night? The minute you start asking these questions, you can actually really see some of these claims as being really broad and sometimes.",
      "id": "ep_27_ut_52"
    },
    {
      "end": 1213930,
      "speaker": "Moritz Stefaner",
      "start": 1167428,
      "text": "But I can really relate to that problem because, I mean, first of all, if you do data visualization, whenever you make a world map or a United States map, you know, people read it as the whole, you know, it's very hard to express in a map or a diagram. It's just a small, you know, sample of things we're looking at because it always looks complete and it always looks like the bird's eye view. Right. And the second thing is, whenever you publish something on the web, the editor will want to have a nice, catchy headline. You know, it's like they don't want a relative clause explaining what exactly it was being measured in a headline. And, and I think that's a deep problem at the moment that everything has to be blown up to be the super surprising statement about everything at once.",
      "id": "ep_27_ut_53"
    },
    {
      "end": 1238884,
      "speaker": "Enrico Bertini",
      "start": 1214230,
      "text": "Yeah. And I think on top of that, I think whatever kind of information that is supported by some data as this kind of aura of truth and objectivity. Right. I think that's another problem. I think people are more persuaded when you show hard numbers to them. But we know that having numbers doesn't really mean that this is the truth. Right. So that's a big issue here as well.",
      "id": "ep_27_ut_54"
    },
    {
      "end": 1336146,
      "speaker": "Kate Crawford",
      "start": 1238932,
      "text": "Well, Enrico, that's exactly right. You said it brilliantly. That is absolutely the problem of this myth of objectivity. And once you times that kind of underlying perception that somehow numbers equal truth, you times that by a factor of n until we get to big data, then you can see how easy it becomes to just feel like, well, if it's big data, it's obviously true because you have a very large number of very large data set attached to it. Right. So it's completely understandable that we, that we are in awe of big data studies because they seem to have so much data that. How can that possibly be wrong? Unfortunately, they are quite often wrong, as we've seen in cases like the Google flu trends example earlier this year, where they wildly mispredicted the number of Americans would experience flu in a season. Now, they had enormous data, and if you think about the, the amount of search engine data that Google has, and it's just extraordinary. And yet they can still make these really large errors. So having that skepticism, I think, is powerful as researchers, as thinkers, as designers, because it makes us able to create more nuanced pictures, more nuanced designs, more nuanced studies now completely agree where it's, we can't change the way the media is going to report on that. I actually think reporters are getting more and more literate about data, too. But, you know, to be honest, we can't change the way a headline is going to be put on an article that reports on our study. But our studies can be very, very careful and we can actually be extremely nuanced. And I think it's really, I think that's a responsibility that we have as scientists to do that. Yeah.",
      "id": "ep_27_ut_55"
    },
    {
      "end": 1354600,
      "speaker": "Moritz Stefaner",
      "start": 1336258,
      "text": "And at least if you put out a graphic, you know, you can have a catchy headline, but at least have a sub headline that explains exactly what we're looking at and how it was gathered in which timeframe, from which platform, and not just say, the mood of the nation or something like that. Sorry to whoever put that out, maybe.",
      "id": "ep_27_ut_56"
    },
    {
      "end": 1421090,
      "speaker": "Enrico Bertini",
      "start": 1357780,
      "text": "Yeah. I think this nicely introduces another problem that I always see. That is the problem of literacy, right? I think the data literacy that people have, or even statistical literacy that people have. I mean, I'm sure that most people just take things for granted when they see some numbers and just don't realize that these are just numbers, right? We are not even, I think to some extent, we are not even trained at school to criticize numbers because numbers are assumed to be the truth, right? And we are taught that science is the objective truth, which is actually not totally true in my view of the world. I mean, even removing all the biases with been talking about all the sampling problems, not necessarily a scientific experiment tells the truth, right? It's just one single experiment. And if you look at how science progresses, you make progress only when you have a series of positive results. Right? And even then, it's a very long and complicated process.",
      "id": "ep_27_ut_57"
    },
    {
      "end": 1519930,
      "speaker": "Kate Crawford",
      "start": 1423190,
      "text": "I think that's right. And I think it's actually fascinating to me to look at the history of this concept of objectivity. There's beautiful book about objectivity written by Lorraine Dustin and Peter Galison, which looks at how recent the idea of objectivity is in science. It really isn't a very old idea, this idea that we could actually be completely objective. It's far more recent than you might imagine. And it comes hand in hand with a set of technologies like the camera and like the microscope, where we started to say that these kinds of instruments allow us to remove the human and produce this kind of mechanical objectivity. And what's so interesting about that is as new tools emerge in history, science responds, and it becomes connected to how science depicts objectivity. And with what's now being called the computational turn, this turn to the capacity to have very large computations and very large data sets, that is a tool as well, that is starting to shift our idea of what good science looks like and what objectivity looks like. And that's actually a radical shift in what research is and how we understand truth. And this is why epistemology is really at the heart of this. It's about how we understand the very definition of knowledge. And as part of this computational turn, we're starting to see big data as being how we get to that sort of next level of knowledge and reflection. And I think it certainly can be a very powerful tool. But to recognize the limits of that tool is going to be essential, or we're going to make a lot of mistakes.",
      "id": "ep_27_ut_58"
    },
    {
      "end": 1570012,
      "speaker": "Enrico Bertini",
      "start": 1523590,
      "text": "Good point. I was actually thinking. So when you just going back to one of the things that you were saying before about asking the right questions where you are confronted with a new data set. I'm sure most of many of us, including myself, have been going through some new data sets without even asking myself what kind of biases are there. So, do you know if there is any source of somewhere that actually tells you, look, if you have a new data set in front of you, you should at least ask yourself this kind of questions. That would be kind of like a cookbook or like a checklist. Like you have a new data set. First thing to do is this, this, this and this, right? I would love to have something like that.",
      "id": "ep_27_ut_59"
    },
    {
      "end": 1598720,
      "speaker": "Kate Crawford",
      "start": 1570156,
      "text": "I love this idea. I think we should design it like a color wheel, that we could just kind of. Do you have this kind of data? Oh, then you want to ask these kinds of questions first. Do you have this kind of data? You can just rotate the color wheel around. Is it, is it mobile data? Is it social media data from Twitter? Is it from Facebook? Is it from city sensors? You know, you could get some really, you could get a hilarious little, you know, a little heuristic tool that we could use. I think we should market that. What do you reckon? We'll design it and we can actually release it and see if people would use it.",
      "id": "ep_27_ut_60"
    },
    {
      "end": 1611200,
      "speaker": "Enrico Bertini",
      "start": 1600820,
      "text": "See how things happen in this podcast. Should we move on to the second point? I think you said discrimination, right?",
      "id": "ep_27_ut_61"
    },
    {
      "end": 1742220,
      "speaker": "Kate Crawford",
      "start": 1611670,
      "text": "Algorithmic discrimination. Yeah. This is a term that's being used to look at the way in which we're actually using data sets to essentially categorize people into ever more precise categories. So it gets interesting. People have been making the claim that somehow, because when you're working with big data, it's so abstract, you have these upsets. It doesn't function at the level of group based discrimination, but it's actually the opposite. If we look particularly at the way that marketing is using big data, it's to try and put you into these categories of what's your gender, what's your race, where do you live, what's your age? And then, much more precisely, what do you like to eat, what do you like to drink? Where do you go out at night? What are your entertainment tastes, what are your political preferences? And we see entire new industries being set up. Companies like Acxiom, who sort of sit in this space of third party data brokers, who are amassing enormous amounts of data about individuals actually ascribed to individuals and putting them into these kinds of marketing terminologies around. You can sell this person these kinds of things. Now, that's fine. Up to a point. A lot of people aren't really that concerned about how things get marketed to them. But it's interesting if you put this into a different kind of historical context. So we could go back to American history and you could see where we saw the emergence of redlining, where people who are living in traditionally African American poor communities were not being offered credit loans and banking loans. And this was a serious enough form of discrimination that we saw federal legislation being passed to prevent it. But what's interesting now is that we still have that legislation. Redlining is still illegal in the offline world. But online, if you choose to show your ad for a particular type of credit offer only to this particular type, who has these characteristics, who has this kind of a bank balance that makes them very attractive to banks, you can actually be very precise in determining who will see that. And perhaps somebody who really, really needs that credit offer or really needs that loan will never even see that it exists.",
      "id": "ep_27_ut_62"
    },
    {
      "end": 1749362,
      "speaker": "Moritz Stefaner",
      "start": 1742340,
      "text": "Right. And I mean, Facebook, the whole advertising on Facebook is exactly that principle. And everybody loves it because it's so targeted.",
      "id": "ep_27_ut_63"
    },
    {
      "end": 1758026,
      "speaker": "Kate Crawford",
      "start": 1749426,
      "text": "And although I have to, I don't know if this works for you, but I mean, for me, my Facebook, untargeted, I mean, I can't tell you how far away they are.",
      "id": "ep_27_ut_64"
    },
    {
      "end": 1762550,
      "speaker": "Moritz Stefaner",
      "start": 1758098,
      "text": "No, the trick is just to behave so erratically that you don't fit into any category.",
      "id": "ep_27_ut_65"
    },
    {
      "end": 1766338,
      "speaker": "Enrico Bertini",
      "start": 1764650,
      "text": "It had to be a game, actually.",
      "id": "ep_27_ut_66"
    },
    {
      "end": 1770730,
      "speaker": "Kate Crawford",
      "start": 1766514,
      "text": "Like, maybe that was to it.",
      "id": "ep_27_ut_67"
    },
    {
      "end": 1794480,
      "speaker": "Moritz Stefaner",
      "start": 1770890,
      "text": "But also in Germany, there's at least the rumor, and I believe there's something to it, that your, like where you're calling from when you call a hotline, for instance, or, you know, like, I don't know, you're calling your telecommunications provider or so that there's a scoring system that will decide how long you have to wait based on if you come from a rich quarter or a poorer one.",
      "id": "ep_27_ut_68"
    },
    {
      "end": 1795828,
      "speaker": "Enrico Bertini",
      "start": 1795260,
      "text": "Wow.",
      "id": "ep_27_ut_69"
    },
    {
      "end": 1810868,
      "speaker": "Moritz Stefaner",
      "start": 1795924,
      "text": "Yeah. Because, I mean, yeah, in the end, you want to, like, comfort the richer clients because they will pay more in the end and so you make sure they get, receive better support. And it's sort of an. Yeah, it's a rumor, but a one that seems to be quite well founded.",
      "id": "ep_27_ut_70"
    },
    {
      "end": 1825060,
      "speaker": "Enrico Bertini",
      "start": 1811044,
      "text": "One question I have then is, under the current legislations that we have in our countries, do the existing legislation prevent doing that or not? I mean. Sorry, Kate, say it again.",
      "id": "ep_27_ut_71"
    },
    {
      "end": 1827800,
      "speaker": "Kate Crawford",
      "start": 1825100,
      "text": "No, certainly not in the US.",
      "id": "ep_27_ut_72"
    },
    {
      "end": 1829012,
      "speaker": "Enrico Bertini",
      "start": 1828180,
      "text": "Okay.",
      "id": "ep_27_ut_73"
    },
    {
      "end": 1876228,
      "speaker": "Kate Crawford",
      "start": 1829156,
      "text": "There are some, it's interesting to see what's happening in the UK and in parts of Europe, but certainly in the US. No, this is absolutely very common. And what's so interesting, too, is when you start to think about this in the health space. So health data has often been highly regulated. It's been seen as something that, and I think rightly so, should be really protected, and it should have a whole lot of protections for consumers around their health data. But in the US, we have HIPAA, which is the act that essentially is there to govern health data. But if you get sick, for example, what's the first thing you do? Well, you're probably going to open up a search engine. You're probably going to type in your symptoms and see how serious is this? Or what? Should I take all of that data?",
      "id": "ep_27_ut_74"
    },
    {
      "end": 1879956,
      "speaker": "Enrico Bertini",
      "start": 1876284,
      "text": "I no longer do that. Sorry for interrupting you. I get so paranoid.",
      "id": "ep_27_ut_75"
    },
    {
      "end": 1880800,
      "speaker": "Moritz Stefaner",
      "start": 1879988,
      "text": "Too scary.",
      "id": "ep_27_ut_76"
    },
    {
      "end": 1889000,
      "speaker": "Enrico Bertini",
      "start": 1881600,
      "text": "You get so paranoid about that, and it's crazy. Sorry for interrupting, but I'm with you.",
      "id": "ep_27_ut_77"
    },
    {
      "end": 1893288,
      "speaker": "Kate Crawford",
      "start": 1889040,
      "text": "But I still do it, even though I know that I do it and I kick myself because, of course, you read this.",
      "id": "ep_27_ut_78"
    },
    {
      "end": 1894660,
      "speaker": "Enrico Bertini",
      "start": 1893384,
      "text": "It's so damn thing.",
      "id": "ep_27_ut_79"
    },
    {
      "end": 1959660,
      "speaker": "Kate Crawford",
      "start": 1895640,
      "text": "But it's an incredibly common reflexive habit that is absolutely widespread. And all of that data is completely unprotected by HIPPA. There's nothing that protects you there. Say, for example, you buy an e book about cancer survival, or you like a page for a disease foundation on Facebook. These are very interesting signals about your health, your current state of health that can be mined and can be used to build a picture of you. And that is completely unprotected data that can be moved through any particular service. It can be sold to third party providers, and it might be an accurate signal, but it actually also might be an inaccurate signal. And what's so interesting is that in either of those situations, it can actually still be quite dangerous if that has any kind of. That ends up getting connected to your health insurance premiums or to whether or not somebody decides, you know, do I want to give this person a job or do I actually want to rent my house to this person?",
      "id": "ep_27_ut_80"
    },
    {
      "end": 1977974,
      "speaker": "Moritz Stefaner",
      "start": 1959960,
      "text": "That's a horrible vision. If the interest in something is a problem, you know, it's like, what world is that? You know, like, regardless of, you know, how it's connected to your well being or not, the fact that your sole interest in something is something that people can judge you for automatically is a horrible thought.",
      "id": "ep_27_ut_81"
    },
    {
      "end": 2001592,
      "speaker": "Kate Crawford",
      "start": 1978022,
      "text": "I think that's exactly right. I mean, the study that I think is really interesting is the one that was done by Cambridge University looking at the Facebook likes of 60,000 people. And they used those likes to develop a model that could predict very sensitive personal information about users, including their sexuality, their ethnicity, their religious views, and even if they're a previous user of drugs.",
      "id": "ep_27_ut_82"
    },
    {
      "end": 2010620,
      "speaker": "Moritz Stefaner",
      "start": 2001616,
      "text": "And alcohol, but just in an indirect way. So if you listen to these types of bands or you like these types of movies, then suddenly they can predict that.",
      "id": "ep_27_ut_83"
    },
    {
      "end": 2047040,
      "speaker": "Kate Crawford",
      "start": 2011120,
      "text": "That's right. And you'd think, well, you know, just how accurate can that really be? Well, what was really interesting about the study is they showed you the accuracy in the end. And in the end, they were really good at categorizing whether you were caucasian or African American. They had around 95% accuracy there, which is pretty startling, followed by gender. They were very good at predicting gender. Then male sexuality, apparently female sexuality is a lot harder to predict. It's way down the list. And then even, even lower than that was political leanings, which is interesting because I would have presumed that would have been higher you to predict.",
      "id": "ep_27_ut_84"
    },
    {
      "end": 2084330,
      "speaker": "Moritz Stefaner",
      "start": 2048300,
      "text": "Yeah, but the interesting thing, there's a fine line because, I mean, in principle, like, you know, personalized advertisements or targeted advertisements, I mean, why not? I mean, if I like, you know, these three movies, and then I get in, you know, a banner for a fourth movie I actually like, why not? That's cool. But. So in your view, where is the creep line? Or where is the unethical? Yeah, where's that border to be drawn? Is there any rule of thumb there? Or any ethical and a hard ethical rule?",
      "id": "ep_27_ut_85"
    },
    {
      "end": 2117700,
      "speaker": "Kate Crawford",
      "start": 2084490,
      "text": "Yeah. Well, this is what is so interesting, because I feel like this test, that, of course, was famously coined by Google, don't be creepy. The creepy test is completely unknown. Now. We don't really know where the creepy line is. If we think about some of the things that that Google is doing. I think I would put officially into the creepy category. In fact, just yesterday I was in the ladies bathroom at MIT and somebody was wearing Google Glass. I was there. This is happening. A line has been crossed.",
      "id": "ep_27_ut_86"
    },
    {
      "end": 2126758,
      "speaker": "Moritz Stefaner",
      "start": 2118080,
      "text": "That is creepy indeed. You're right. And in two, three years, maybe it's not creepy anymore because we're just getting used to the creepiness.",
      "id": "ep_27_ut_87"
    },
    {
      "end": 2231146,
      "speaker": "Kate Crawford",
      "start": 2126904,
      "text": "This is what's interesting. So I think in addition to the test being obviously completely, completely blurry and opaque, our sense of what is creepy is changing all the time. So it's actually a really bad heuristic to use, and I think it's failed us too many times for us to even take it seriously. And what was really interesting about that Cambridge University study is that one of the points the researchers made is that they said they were really worried that this kind of Facebook data, it's not going be used just to market things to you. It's going to be used by employers and by government agencies to discriminate against individuals. But even more worryingly, you won't even know that your data has been used to make a discrimination about you, about whether you'll get a job or about whether you'll get health insurance. You would never know that. In fact, your Facebook likes have been used as part of a big data determination. And whether it's right or wrong, that could actually have a very serious impact on your life. That's, this gets really interesting, and it's not really a science fiction scenario. I mean, I like to sort of think about, you know, just how far this can go, but these sorts of things are already happening. I mean, a lot of these studies are very much on the cutting edge. They're sort of within, you know, one or two years of what people have been doing. But even so, we're starting to, to see an uptake of these kinds of technologies as a way to determine what people are like. I mean, obviously, employers are already using things like Facebook to assess people before they hire them, but this is getting well beyond that point. I mean, if you're looking at making predictions about somebody in order to determine whether or not you're going to rent a house to them or give them health insurance, that has some very, very serious implications. We have no way to actually moderate that.",
      "id": "ep_27_ut_88"
    },
    {
      "end": 2248346,
      "speaker": "Moritz Stefaner",
      "start": 2231178,
      "text": "I mean, we always extrapolate, I think, from incomplete information. Right. So I don't know. So you want to employ somebody, you talk to them, like, for half an hour and you read their cv. So you would always also look at their clothes and see, like, you know, how they shake your hand and, you know, that's what we do.",
      "id": "ep_27_ut_89"
    },
    {
      "end": 2254410,
      "speaker": "Kate Crawford",
      "start": 2248498,
      "text": "And I think that's a really, that's a really good example because you get to participate in that. You get to. Exactly.",
      "id": "ep_27_ut_90"
    },
    {
      "end": 2258698,
      "speaker": "Moritz Stefaner",
      "start": 2254450,
      "text": "At least you have a chance, like, to make a difference cv, you know.",
      "id": "ep_27_ut_91"
    },
    {
      "end": 2285106,
      "speaker": "Kate Crawford",
      "start": 2258754,
      "text": "But this is a situation where you will not even know. And those kinds of predictive modeling processes. In some cases, I actually think predictive modeling is actually really primitive. In some cases where it's, it's really, it's really not that great yet. So you've got this very coarse grain data which has been used in ways that sometimes can be quite accurate, sometimes it isn't, and you're even aware that it's part of the mix. So that, that's what I think is the ethical question that we need to.",
      "id": "ep_27_ut_92"
    },
    {
      "end": 2303230,
      "speaker": "Moritz Stefaner",
      "start": 2285258,
      "text": "So what do we demand? Like that, for instance, if there's, like, a company using that data, should they be. So if they have some, let's say a credit company, like a bank, you know, do they have to open up the black box of the algorithm and specify exactly which attributes they use? Would that be a solution?",
      "id": "ep_27_ut_93"
    },
    {
      "end": 2378712,
      "speaker": "Kate Crawford",
      "start": 2303850,
      "text": "I think not. And this is where it gets really interesting, because, of course, at the level of the algorithm, in many cases, even the designers of the algorithm can't tell you how it's worked. That's so interesting. I mean, you know, if you talk to people at Amazon, if you talk to people at Google, if you talk to people at Microsoft, they can, you know, they will tell you that there are so many algorithms and they're doing a whole lot of things that are by no means easy to point to. But what I think we can do is we can go further down the chain and we can look a lot closer to when a decision is being made. So if a bank decides to change your credit rating, we already have regulation to allow you to see how that credit rating functions. Imagine applying that to big data. Imagine if you're going for a job and you have the right to ask, have there been, is there, is there a sort of a big data component to the hiring? Can I see my file? And that could be something that you could say, yep, we've hired this company. This is what they've told us about. You feel free to correct any of this if it's incorrect. That isn't that far away from being possible. That is something that we could actually see as being part of a due process structure. I think at the level of the algorithm, at the level of the data generation, it's too hard. I think at the level of collection, it's almost impossible. Yeah.",
      "id": "ep_27_ut_94"
    },
    {
      "end": 2384460,
      "speaker": "Moritz Stefaner",
      "start": 2378736,
      "text": "Right. You would probably need a PhD in machine learning just to understand what algorithm they actually used.",
      "id": "ep_27_ut_95"
    },
    {
      "end": 2392304,
      "speaker": "Kate Crawford",
      "start": 2386000,
      "text": "Yeah, but I think when decisions are getting made, we can actually look at the point of determination and say, what can we do?",
      "id": "ep_27_ut_96"
    },
    {
      "end": 2424452,
      "speaker": "Moritz Stefaner",
      "start": 2392472,
      "text": "Yeah, it's a great point. Yeah. And again, this chance to sort of interact with a real human and put things straight, I think this whole data machine makes a decision that changes your life is just not right. And I actually know because, so we were buying a house two years ago, and so I was exactly in the situation that a few banks would just turn me down without even talking to me just because I don't fit in some category. So, and it's really upsetting. I can report personally, it is.",
      "id": "ep_27_ut_97"
    },
    {
      "end": 2474690,
      "speaker": "Kate Crawford",
      "start": 2424556,
      "text": "And I think banks have been doing what we call loosely, big data for a long time. Like, in many ways, the people where I locate the prehistory of big data is with the financial sector and it's with intelligence. It's with organizations like the NSA, and it's actually with climate data as well, areas where very large datasets have been collected over a long period of time and have been analyzed for particular purposes. But we're seeing whole new sectors start to do very similar sorts of things, those sorts of determinations about something that banks have been doing for decades. So banks are regulated sometimes in terms of those processes, and at least we have the capacity to have some visibility into things like credit scores, but that's not the case in all of these new industries, and that's what more concerning to me.",
      "id": "ep_27_ut_98"
    },
    {
      "end": 2480170,
      "speaker": "Moritz Stefaner",
      "start": 2477750,
      "text": "So shall we move on to the last point?",
      "id": "ep_27_ut_99"
    },
    {
      "end": 2483534,
      "speaker": "Kate Crawford",
      "start": 2481310,
      "text": "Yeah, I was just enjoying that, the pause.",
      "id": "ep_27_ut_100"
    },
    {
      "end": 2487970,
      "speaker": "Moritz Stefaner",
      "start": 2483622,
      "text": "Yeah. So the third one was anonymity.",
      "id": "ep_27_ut_101"
    },
    {
      "end": 2557230,
      "speaker": "Kate Crawford",
      "start": 2489270,
      "text": "So anonymity is really interesting because we have entire sort of fields of expertise of people who are working on both how to anonymize data and then how to re identify people from anonymous data sets. And it's actually extremely difficult. And back in the 1930s, one of the founders of forensic science, a man called Edmund Locard, wanted to find out how many points on a fingerprint would be required to identify an individual. And he discovered that, in fact, it was twelve points. You could take twelve points of someone's thumbprint, you could pretty accurately identify that individual. What we found out from a very interesting study this year is how many points of spatio temporal data we need from an anonymous cell phone set to identify an individual. So those spatio temporal points, where are you standing and making a call? Where are you in place and what time of day is it? So have a guess how many of those spatio temporal points you need to uniquely identify an individual.",
      "id": "ep_27_ut_102"
    },
    {
      "end": 2560430,
      "speaker": "Moritz Stefaner",
      "start": 2558370,
      "text": "I think we both know the study.",
      "id": "ep_27_ut_103"
    },
    {
      "end": 2574546,
      "speaker": "Kate Crawford",
      "start": 2562730,
      "text": "You know, this is what's so amazing that if it's only four, which now we know that it is, you want to get 95% of individuals, you know, actually identified from a data set. That's pretty extraordinary.",
      "id": "ep_27_ut_104"
    },
    {
      "end": 2585720,
      "speaker": "Moritz Stefaner",
      "start": 2574618,
      "text": "I mean, that's so low, the number. Yeah, it's horribly low. I mean, it couldn't be lower. You know, it's like, you know, two or three is like basically impossible, and four is like this.",
      "id": "ep_27_ut_105"
    },
    {
      "end": 2593804,
      "speaker": "Kate Crawford",
      "start": 2586020,
      "text": "Yeah, well, yeah, I mean, it's interesting. They found that if you, if you had, if you went lower, if you sort of went to two or three, you could get 50%.",
      "id": "ep_27_ut_106"
    },
    {
      "end": 2594640,
      "speaker": "Moritz Stefaner",
      "start": 2593892,
      "text": "Oh, wow.",
      "id": "ep_27_ut_107"
    },
    {
      "end": 2601556,
      "speaker": "Kate Crawford",
      "start": 2595300,
      "text": "So actually. And still have, you know, you don't get the 95% accuracy, but you can still identify a lot of people.",
      "id": "ep_27_ut_108"
    },
    {
      "end": 2602060,
      "speaker": "Moritz Stefaner",
      "start": 2601668,
      "text": "Right.",
      "id": "ep_27_ut_109"
    },
    {
      "end": 2639420,
      "speaker": "Kate Crawford",
      "start": 2602140,
      "text": "So that study, that nature that came out of nature is, is extremely, extremely important because it tells us a couple of things. It tells us how important metadata is. It also shows us that the way that we walk through cities, the paths that we make are unique, that we're highly identifiable and that we're creatures of habit. You know, there aren't that many people who. Who live in your house and work in your workplace and take the same paths between those two places. And that's something really fascinating and I think quite lovely. But it's frightening when you think about how identifiable that makes.",
      "id": "ep_27_ut_110"
    },
    {
      "end": 2653460,
      "speaker": "Moritz Stefaner",
      "start": 2640400,
      "text": "And the same happens when you bring two data sets together. So it's very hard to maybe identify somebody from their music taste, but if you also know about their food taste, suddenly it becomes a unique combination or something like this.",
      "id": "ep_27_ut_111"
    },
    {
      "end": 2657020,
      "speaker": "Kate Crawford",
      "start": 2655920,
      "text": "Oh, no, please.",
      "id": "ep_27_ut_112"
    },
    {
      "end": 2671760,
      "speaker": "Enrico Bertini",
      "start": 2657760,
      "text": "I'm just wondering, does this mean that any given company, once they get these four data points, they are able to identify you or what? I just want to understand. I understand exactly what's the implication of that? What's the meaning?",
      "id": "ep_27_ut_113"
    },
    {
      "end": 2723492,
      "speaker": "Kate Crawford",
      "start": 2671920,
      "text": "Yeah, I mean, it's interesting because I think that the study is very narrowly defined and they were very particular about how it was done. It was using 1.5 million people's cell phone records in an unnamed European country and they had this data set. It was an anonymous data set and they wanted to see how, if you had these spatio temporal points, how many you needed to actually identify individuals in that set. Now, whether you're going to go through the process that they went through to try and identify people is a different question. I think it's not by any means an easy process. And this is what's so interesting about reidentification research. It's not like you can just press a button and easily identify people from an anonymous data set. The issue is more that it is technically possible and that if you wanted to put in enough time and effort that you can do this.",
      "id": "ep_27_ut_114"
    },
    {
      "end": 2755600,
      "speaker": "Moritz Stefaner",
      "start": 2723636,
      "text": "Yeah. And you have sort of these cascades. So once you have somebody identified, you know, and have their whole communication history from that previously anonymous data, but you sort of, you found your way into that, then you suddenly know much more about the person that also unlocks maybe other data sets. So I do think that there's a very, very real threat there also that. Yeah. If once you get your hands on such a large dataset and can identify people, that you can do a lot with that information.",
      "id": "ep_27_ut_115"
    },
    {
      "end": 2844990,
      "speaker": "Kate Crawford",
      "start": 2756140,
      "text": "Yeah. And it's interesting because I think certainly in recent years, even if we just look, five years ago, it was actually pretty hard to get that kind of data. Now it's a lot easier. So I don't know if you saw. But in the July this year, at and T quietly decided to change its privacy policy and start selling its aggregated, anonymized, quote unquote, customer records. So you can go. If you're an at and T subscriber, unless you go and specifically tell them that you want to opt out, then your data can be sold in these massive data sets. And very few people know that that change was made. And therefore, very few people will actually take the effort to opt out and get in touch with at and t. So they're in this data set, and now Verizon is doing the same thing. So it's interesting to think about the fact that these data sets are becoming public. Now, obviously, they cost money, so they're not free, but they're going to organizations that have a vested interest in knowing a lot about who those individuals might be, and now they have that data. So that raises interesting questions. Now, by no means am I kind of thinking that we can roll that back. That's something that those companies can choose to do. But that does raise questions for us as researchers in terms of, well, what does that mean in terms of how we want to use those data sets, how we want to compare and bring data sets together, because we know how intimate and how sensitive and how revealing those data sets can be.",
      "id": "ep_27_ut_116"
    },
    {
      "end": 2887910,
      "speaker": "Enrico Bertini",
      "start": 2846980,
      "text": "Yeah, that's interesting. So every time I talk with somebody about the issues with data privacy, my very personal feeling is that. So I'm honestly wondering, are there any chances that we can really make progress? I mean, honestly, sorry for the negative view, but I mean, another option is just to say, look, I mean, I. That there's no way to have private data. Right. And we better educate ourselves that whatever we put out there is just public. Right. I mean, that's another take on it. A completely different kind of view.",
      "id": "ep_27_ut_117"
    },
    {
      "end": 3092210,
      "speaker": "Kate Crawford",
      "start": 2888290,
      "text": "Oh, yeah. And it's interesting. And we could take that view as a thought experiment, and we could run with it. We could say, okay, everything is public. Your phone records, your browsing history, everything that happens on social media, your location in the city, who you go to, where your doctor is, what kinds of medical practitioners you're seeing. Let's just make all that public. That is definitely something that you could imagine as a kind of a worldview. Now, for a lot of people, that's not going to matter if you're somebody who's in perfect health, if you're somebody who lives in a country that has free healthcare, if you're somebody who doesn't look at anything that might possibly imperil the way that people would think about you or employ you, then that's totally fine. But what's interesting is that that kind of data can be used in very prejudicial ways. And what worries me is less those kinds of people, and more the people who are already vulnerable, who are already in communities who already have less power, because they're the ones whose data is going to be used against them. And this is what we're already seeing in particular ways. It's vulnerable communities who are already seen as subjects of surveillance. I think that we have no privacy. Get over it. Argument is really great for people who are already privileged, and I think it's actually not so great for people who are less privileged. And I sort of feel like there's so much we can do. I don't want to sound like a Pollyanna and to be overly optimistic, but I feel like there's an enormous amount of things we can do. I think we can do a lot. To be thinking about strengthening data ethics. That's something I really care about. I mean, at the moment, if you look at the ACM and the IEEE ethics guidelines, they're both 20 years old. I mean, the things that you could do in computer science in 20 years have changed so radically, and the ethics guidelines haven't been updated. So, I mean, things like that are really important. I also have an enormous amount of faith in pedagogy and teaching and how we actually train the next generation of data scientists. If we have a really good sense of how to use data ethically, that becomes part of how the profession understands itself. And that's actually really important, too. And then I think, thirdly, the thing that, which gives me really hope is thinking about due process, which we talked about earlier. So if data is being used against you in particular ways, or being used to make determinations that affect your life in serious ways. And I don't mean marketing. I mean, this is, this is much more about jobs and healthcare and getting a house to live in. At that level, I think we should have a right to see the data that's being used against us. I think having some of these are actually policy tweaks. I think there's also the level of social norms. So we could think about, we're going to start getting a lot more careful about the kinds of data that we make public, and we might start doing things like opting out particular types of data collection more than we used to. I think that the social level is important. The legal level is important. I also think the technical level is important. There's going to be some amazing new technologies that are going to help us protect our data in particular ways that are on the horizon. So somewhere between those three things and obviously those three things all working together, I have an enormous amount of hope that it's not over and that we haven't reached a point where everything is going to be public, because I think that could be actually, that wouldn't be a very nice future to be living in.",
      "id": "ep_27_ut_118"
    },
    {
      "end": 3151190,
      "speaker": "Moritz Stefaner",
      "start": 3092750,
      "text": "I think so, too. No, and it really, I mean, that's the whole surveillance thing is not the direct effect most people have, because there is no direct effect for most people. But the way you change your behavior once you know, you know you're potentially being monitored, that is already the problem, more or less. Yeah. Yeah. And I mean, I mean, many of our listeners are working with data, and I think one big takeaway is also to always look one step beyond that data set you just have in your hands and just think about, like, okay, given that data set, what is the rest? So what is exactly the part I'm missing out on? Because I'm just looking at that one piece. Is there like, a wider data set I could relate to, or at least check my data against, like, if it has the same distributions and demographics, or if I'm missing out on a certain part of the population? So I think it's often just a mental thing that you think of that possibility at all, that your data might be incomplete.",
      "id": "ep_27_ut_119"
    },
    {
      "end": 3155190,
      "speaker": "Kate Crawford",
      "start": 3151910,
      "text": "I think that could be part of the color wheel, too, right?",
      "id": "ep_27_ut_120"
    },
    {
      "end": 3158838,
      "speaker": "Moritz Stefaner",
      "start": 3155310,
      "text": "Exactly. Make one more step out of the box.",
      "id": "ep_27_ut_121"
    },
    {
      "end": 3273032,
      "speaker": "Kate Crawford",
      "start": 3158934,
      "text": "Now another one who in this data set might be, could be seriously disadvantaged or damaged if you release this kind of thing. There are a whole lot of really useful questions that we need to ask ourselves as people who make and design data systems. It's an extraordinary job, extraordinary capacity, and the stuff that we can do with data is extremely exciting. But we also have these questions that we need to ask ourselves. And it's funny, there was a symposium at Harvard recently with reidentification researchers. So these are people on the cutting edge of computer science who are trying, who are looking at data sets and saying, right, if I want to try and look at this in such a way that I could re identify individuals, how would I do it? And, you know, it's an entire research field. What was really interesting is people in that field now starting to ask questions like, I've discovered this huge vulnerability. Should I publish it? Because it's going into the hands of people who are going to be using this for reasons that are really, really suspect. You know, is that worth me just adding another paper on my cv? So it's interesting that those conversations are happening right now because people know that, well, in some cases, you can't put the genie back in the model. I mean, once we, once we've found ways to identify people, that's going to have ramifications. And that's a pretty extreme example. But I think in even the kind of everyday examples that we might have in working with different kinds of data sets, you just ask a question of. Right. So what are the implications of this once it's out? And some of the time that might mean that you don't necessarily release that technology or you don't necessarily make that data set public, or you have some kinds of. Of ways of thinking about who's going to be implicated in that data. These are actually really good questions to be asking. Not everything has to be released. Not everything should be. Should be made public. Yeah.",
      "id": "ep_27_ut_122"
    },
    {
      "end": 3291158,
      "speaker": "Enrico Bertini",
      "start": 3273056,
      "text": "I think related to that, we, people working in data visualization or similar fields, we have a kind of bias towards data rather than problems. I observed this kind of problem many times. I mean, our work starts with, oh, I got some data, let's work on that.",
      "id": "ep_27_ut_123"
    },
    {
      "end": 3292190,
      "speaker": "Moritz Stefaner",
      "start": 3291174,
      "text": "Let's see what we can do with that.",
      "id": "ep_27_ut_124"
    },
    {
      "end": 3348270,
      "speaker": "Enrico Bertini",
      "start": 3292230,
      "text": "Yeah, but if you think about how good, I mean, good science first and good analytics works, everything starts from a good question. Right. And then you ask yourself, what's the best way to answer this question? How can I get the data that I need to answer this question? And then there is a very long process working with the data itself, trying to gather, either try to see if there is any data out there that can be helpful for your question or generate the data on your own. Right. So think about, I mean, I remember reading about experiments in political science. Most of these people start with a big question and then go out and see and try to find a way to gather the data they need. Right. And sometimes this means literally going out and gathering these data. And once you do that, it means that you are part of the process of creating the data itself. And this is so much more powerful.",
      "id": "ep_27_ut_125"
    },
    {
      "end": 3356226,
      "speaker": "Moritz Stefaner",
      "start": 3348930,
      "text": "And then you're much more sensitive to. You're aware of the decisions you made on the way to end up with that specific data.",
      "id": "ep_27_ut_126"
    },
    {
      "end": 3357950,
      "speaker": "Enrico Bertini",
      "start": 3356298,
      "text": "Yeah, absolutely.",
      "id": "ep_27_ut_127"
    },
    {
      "end": 3401450,
      "speaker": "Kate Crawford",
      "start": 3358930,
      "text": "I think that's an excellent point. That's actually something that comes up a lot in our research lab, is thinking about how do we ask the right questions, because that's a, that's really, that's actually where the most interesting work happens. It's not just, here's a data set. How do I make it look pretty? Or here's a data set. What are some things I can pull out of it? It's, you know, what is a question that hasn't been asked in this way? What's something that we can show with data that really does answer something that's significant? And I think that's also something to do with data science starting to get more interesting. It's getting to a point where it's maturing beyond the kind of really, really early stages where it's like, oh, look, we've got all this data. Isn't it exciting?",
      "id": "ep_27_ut_128"
    },
    {
      "end": 3403174,
      "speaker": "Enrico Bertini",
      "start": 3402390,
      "text": "Yeah.",
      "id": "ep_27_ut_129"
    },
    {
      "end": 3438300,
      "speaker": "Kate Crawford",
      "start": 3403342,
      "text": "Yeah, well, so what. But what question are you asking with this data? That's a really good sign that we're getting to that point. And actually, I find that pretty inspiring because, you know, we're getting past that all shiny new toy stage, and that means that there's going to be a lot of really interesting work done with data in the next, in the next few years. And. And that's the stuff that I think excites all of us because that's why we're doing it. But this issue of having the right research question is absolutely paramount, and that's really what it's about. That's the value of what you're doing.",
      "id": "ep_27_ut_130"
    },
    {
      "end": 3465210,
      "speaker": "Moritz Stefaner",
      "start": 3438720,
      "text": "Yeah. And the other thing that really, for me now in the conversation, really stood out is that we all need to work on our sense of data ethics and what is a good way of treating data and asking other people how exactly they worked with the data and to make that a societal thing, because, I mean, regulations are very difficult in that area. Algorithms are black boxes. So we have to sort of make sure things are going in the right way.",
      "id": "ep_27_ut_131"
    },
    {
      "end": 3515050,
      "speaker": "Kate Crawford",
      "start": 3465710,
      "text": "Yeah. And it's interesting because this isn't new. We can look to the 20th century to see when fields went through this. I mean, there was the emergence of medical ethics, which came from a whole lot of really awful things happening and people realizing that this is completely unacceptable. We need to have some very, very clear guidelines around how medical testing is done. Very similar things have happened in the space of anthropology. Anthropology has developed, over a very long time codes of what constitutes ethical ethnographic practice. And that's something which is a key part of the methodology of the field. And you would not do incredibly unethical things like deciding, well, I'm just going to spy on this person and I'm going to write a research paper about.",
      "id": "ep_27_ut_132"
    },
    {
      "end": 3518070,
      "speaker": "Moritz Stefaner",
      "start": 3515090,
      "text": "Them and then vastly over generalize.",
      "id": "ep_27_ut_133"
    },
    {
      "end": 3521670,
      "speaker": "Enrico Bertini",
      "start": 3520010,
      "text": "Yeah, that's another big issue.",
      "id": "ep_27_ut_134"
    },
    {
      "end": 3544860,
      "speaker": "Moritz Stefaner",
      "start": 3523490,
      "text": "No, it's true, but we are sort of falling back into amateur stages there. But again, also because many people working with the data don't have that type of humanities background or aren't even aware that this type of standards exist. Right. Is there like a society or a lobby for, you know, data ethics? Like, is there like a club of data ethicists?",
      "id": "ep_27_ut_135"
    },
    {
      "end": 3621620,
      "speaker": "Kate Crawford",
      "start": 3546960,
      "text": "I'd be interested to make them. Maybe they're, you know, maybe they're a secret society that's kind of happening from. It's kind of. It should be happening from the organizations that represent us. So if it's the. The computer science, computer scientists known as ACM, it's engineers and it's the IEEE, I mean, I think those institutional bodies actually have a lot of power in saying what's acceptable and what's not. I also think, you know, at the level of things like journals like if this is said to be really shoddy data research that are doing things where you really haven't thought about the ethics and that shouldn't be published, I mean, this is exactly what happened in the medical field. You know, you were doing testing on kids about whether this, this particular vaccine work and you weren't telling them that this was, you know, what you're actually giving them that would be profoundly unoptimal and it would not be published and, you know, that would not be. That would not seem to be something that was okay. So I think because this is kind of a new space, this big data science is new. We're still at the stage of having these discussions about, well, what would constitute unethical practice, and we need to have those conversations soon because a lot of stuff is happening that raises very serious questions and could have serious ramifications. And we don't really have those ethical paradigms in place yet, but I think we really need to. And I think the time pressure is on.",
      "id": "ep_27_ut_136"
    },
    {
      "end": 3624220,
      "speaker": "Moritz Stefaner",
      "start": 3622720,
      "text": "Absolutely. Yeah.",
      "id": "ep_27_ut_137"
    },
    {
      "end": 3634340,
      "speaker": "Enrico Bertini",
      "start": 3624920,
      "text": "Do you think we can actually try to learn something from how these things have been solved in the past, like as in the medical domain, as you just mentioned?",
      "id": "ep_27_ut_138"
    },
    {
      "end": 3656466,
      "speaker": "Kate Crawford",
      "start": 3634960,
      "text": "I think so. I think that's absolutely where we begin. I think we can. We can look to. Hopefully we can actually learn those lessons without going through the disasters because in many cases, what really instituted firm policies around ethics came from profoundly unethical practices which turned into terrible disasters.",
      "id": "ep_27_ut_139"
    },
    {
      "end": 3675866,
      "speaker": "Moritz Stefaner",
      "start": 3656498,
      "text": "You mean like the NSA is spying on everybody? Yeah, I mean, in Germany at least. This has sort of totally changed the conversation. I mean, so before, it was more like a luxury problem, and I think now it's becoming something that. Where everybody feels is he or she is somehow affected off?",
      "id": "ep_27_ut_140"
    },
    {
      "end": 3685114,
      "speaker": "Kate Crawford",
      "start": 3675938,
      "text": "I think it's funny that you say that. We've been having conversations about whether that could be one of the long term impacts of Snowden releasing those documents.",
      "id": "ep_27_ut_141"
    },
    {
      "end": 3686546,
      "speaker": "Moritz Stefaner",
      "start": 3685202,
      "text": "I think so. I think so.",
      "id": "ep_27_ut_142"
    },
    {
      "end": 3696478,
      "speaker": "Kate Crawford",
      "start": 3686658,
      "text": "That would be fantastic. I mean, that would be such an important thing to have done that suddenly we can start to say, okay, this affects everybody. Now we have to think about what ethical data use looks like.",
      "id": "ep_27_ut_143"
    },
    {
      "end": 3706810,
      "speaker": "Moritz Stefaner",
      "start": 3696574,
      "text": "Yeah, fantastic. Enrico, you have more questions or Kate, do you want to like have a final pledge?",
      "id": "ep_27_ut_144"
    },
    {
      "end": 3715650,
      "speaker": "Enrico Bertini",
      "start": 3709350,
      "text": "I wanted to ask Kate. So before we conclude, tell us something super positive about big data.",
      "id": "ep_27_ut_145"
    },
    {
      "end": 3720690,
      "speaker": "Moritz Stefaner",
      "start": 3719250,
      "text": "Tell us a big data joke.",
      "id": "ep_27_ut_146"
    },
    {
      "end": 3722710,
      "speaker": "Enrico Bertini",
      "start": 3720770,
      "text": "A big data joke or.",
      "id": "ep_27_ut_147"
    },
    {
      "end": 3725594,
      "speaker": "Kate Crawford",
      "start": 3724690,
      "text": "Two algorithms.",
      "id": "ep_27_ut_148"
    },
    {
      "end": 3726750,
      "speaker": "Enrico Bertini",
      "start": 3725642,
      "text": "Walk into a car.",
      "id": "ep_27_ut_149"
    },
    {
      "end": 3731470,
      "speaker": "Moritz Stefaner",
      "start": 3729250,
      "text": "And they order the beers for each other.",
      "id": "ep_27_ut_150"
    },
    {
      "end": 3735130,
      "speaker": "Kate Crawford",
      "start": 3733570,
      "text": "They say, if you like.",
      "id": "ep_27_ut_151"
    },
    {
      "end": 3742962,
      "speaker": "Enrico Bertini",
      "start": 3735210,
      "text": "I mean, I'm totally sure that you are at least as enthusiastic as we are about what are the opportunities of big data as well. Right? I'm sure.",
      "id": "ep_27_ut_152"
    },
    {
      "end": 3778880,
      "speaker": "Kate Crawford",
      "start": 3743106,
      "text": "So, I mean, I wouldn't be where I am working at the, at Microsoft research and at MIT if I didn't think that this was absolutely where there is so much exciting potential. Absolutely. But I'm just as inspired about getting these questions around ethics and due process. Right. I mean, that's just as sexy to me and just as exciting to me as the data and what we can do with the data and we need those just as much. I mean, I don't see those things as being downers, I see them as actually being exciting intellectual challenges.",
      "id": "ep_27_ut_153"
    },
    {
      "end": 3779828,
      "speaker": "Enrico Bertini",
      "start": 3779540,
      "text": "Yeah.",
      "id": "ep_27_ut_154"
    },
    {
      "end": 3805762,
      "speaker": "Moritz Stefaner",
      "start": 3779844,
      "text": "And once you adopt that mindset, you might come up with whole new research ideas and, you know, it's always refreshing to sort of escape that, you know, these, always working with the same type of things, always doing the same type of stuff. Once you realize, oh, hold on, I could do, I could flip this whole thing 90 degrees suddenly, you know, that's if you're a researcher or scientist, it's always exciting. Or also if you're a data analyst. Right?",
      "id": "ep_27_ut_155"
    },
    {
      "end": 3811470,
      "speaker": "Kate Crawford",
      "start": 3805866,
      "text": "Yeah, completely agree. See, there you go. There's a really positive thing to say about.",
      "id": "ep_27_ut_156"
    },
    {
      "end": 3863580,
      "speaker": "Enrico Bertini",
      "start": 3812570,
      "text": "No, but honestly, Kate, thanks a lot, because I think it's super, super important having people like you around trying to write down what are the problems and explaining to people that there are problems, especially to practitioners like us. I mean, I think that's super important, right. We need to have some balanced view and we also need, I think, I think that education plays a huge role here. I mean, we have to start educating people, practitioners and experts like us. Then we need to educate other people. Right. I think education is huge here. I mean, I've been working in this area for a long time, but I have to confess that I started reading or realizing that there were problems, this kind of problems that you've been mentioning throughout the episode very, very recently. And I think it's super important. So thanks. Thanks a lot.",
      "id": "ep_27_ut_157"
    },
    {
      "end": 3867912,
      "speaker": "Moritz Stefaner",
      "start": 3866360,
      "text": "So when do we do the color.",
      "id": "ep_27_ut_158"
    },
    {
      "end": 3868580,
      "speaker": "Kate Crawford",
      "start": 3867936,
      "text": "Wheel.",
      "id": "ep_27_ut_159"
    },
    {
      "end": 3898770,
      "speaker": "Moritz Stefaner",
      "start": 3870880,
      "text": "And when do we found that club? Excellent. So we catch up. We can see in half a year we can report on the progress. Excellent. It was great having you, Kate. I think it's a super important and super interesting topic and one that really, once you start thinking about it, you, I don't know, for me, you cannot stop thinking about it or noticing, like, the biases everywhere, so. And, yeah, it's a curse and a blessing, I guess.",
      "id": "ep_27_ut_160"
    },
    {
      "end": 3903450,
      "speaker": "Kate Crawford",
      "start": 3899670,
      "text": "And it was such a pleasure talking to both of you. That was a really interesting conversation.",
      "id": "ep_27_ut_161"
    },
    {
      "end": 3904950,
      "speaker": "Enrico Bertini",
      "start": 3904270,
      "text": "Thank you.",
      "id": "ep_27_ut_162"
    },
    {
      "end": 3906278,
      "speaker": "Moritz Stefaner",
      "start": 3905030,
      "text": "Thank you. Thank you.",
      "id": "ep_27_ut_163"
    },
    {
      "end": 3907246,
      "speaker": "Enrico Bertini",
      "start": 3906454,
      "text": "Okay.",
      "id": "ep_27_ut_164"
    },
    {
      "end": 3907950,
      "speaker": "Kate Crawford",
      "start": 3907398,
      "text": "Thanks a lot.",
      "id": "ep_27_ut_165"
    }
  ],
  "confidence": 0.930057958193684,
  "audio_duration": 3913,
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_status_code": null,
  "webhook_auth": false,
  "webhook_auth_header_name": null,
  "speed_boost": false,
  "auto_highlights_result": null,
  "auto_highlights": false,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_audio_quality": null,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "content_safety": false,
  "iab_categories": true,
  "content_safety_labels": {
    "status": "unavailable",
    "results": [],
    "summary": {}
  },
  "language_detection": false,
  "language_detection_threshold": null,
  "language_confidence": null,
  "custom_spelling": null,
  "throttled": false,
  "auto_chapters": true,
  "summarization": false,
  "summary_type": null,
  "summary_model": null,
  "custom_topics": false,
  "topics": [],
  "speech_threshold": null,
  "speech_model": "best",
  "chapters": [
    {
      "summary": "Enrico: How was your September? Good. Semester has started. I went back to my old university to teach cognitive science students. Kate Crawford is our guest for Data stories number 27.",
      "gist": "Data stories #27",
      "headline": "Kate Crawford joins us to discuss data stories from Data Stories 27",
      "start": 12520,
      "end": 161438,
      "id": "ep_27_ch_0"
    },
    {
      "summary": "We invited Kate because we wanted to talk about big data, criticism or skepticism. She has a paper out titled Critical Questions for big data. Also has lots of jobs. Very busy, and I spend a lot of time on planes.",
      "gist": "Big Data: Criticism and Skepticism",
      "headline": "We wanted to talk about big data, criticism or skepticism",
      "start": 161534,
      "end": 252310,
      "id": "ep_27_ch_1"
    },
    {
      "summary": "Professor Andrew Keen's PhD is in critical media studies. Keen is also a professor at Microsoft Research and MIT in the center for Civic Media. Keen talks about how social media can transform certain kinds of engagements and communication. These are the questions that are really driving his research at the moment.",
      "gist": "In the Elevator With Big Data",
      "headline": "How did you get interested in big data and all the rest",
      "start": 254970,
      "end": 521330,
      "id": "ep_27_ch_2"
    },
    {
      "summary": "Big data fundamentalism is very much in its absolute zenith at the moment it's at its height. People are very excited about data cracking. But there are serious limitations. Thinking about those limitations, along with the hype, is actually really important.",
      "gist": "Post-Big Data: The Critical View",
      "headline": "Chris Anderson says every special science will be made obsolete by just data science",
      "start": 522550,
      "end": 688740,
      "id": "ep_27_ch_3"
    },
    {
      "summary": "Top three for me is this myth of objectivity, the possibility of algorithmic discrimination, and the enormous difficulty of anonymization. Questions relate to method, ethics and privacy, which is actually a really big problem. Both, both to the academic side of big data research and in the technology sector.",
      "gist": "What are the main problems in big data analysis?",
      "headline": "What are the main problems you see at the moment with big data analysis",
      "start": 689750,
      "end": 843530,
      "id": "ep_27_ch_4"
    },
    {
      "summary": "Crisis informatics uses a lot of social media data. But they have an inherent skew or inherent bias that leads towards this kind of urban, privileged experience of an event. How do you deal with that?",
      "gist": "Crisis data and the bias of Twitter",
      "headline": "Social media data can be incredibly useful during crisis events like floods",
      "start": 846470,
      "end": 1354600,
      "id": "ep_27_ch_5"
    },
    {
      "summary": "As new tools emerge in history, science responds, and it becomes connected to how science depicts objectivity. Big data is starting to shift our idea of what good science looks like and what objectivity looks like. To recognize the limits of that tool is going to be essential, or we're going to make a lot of mistakes.",
      "gist": "On the Problem of Science's Objectivity",
      "headline": "I think data literacy can be a powerful tool in science, right",
      "start": 1357780,
      "end": 1603440,
      "id": "ep_27_ch_6"
    },
    {
      "summary": "Algorithmic discrimination is the way in which we're using data sets to essentially categorize people into ever more precise categories. We see entire new industries being set up. The trick is just to behave so erratically that you don't fit into any category.",
      "gist": "Algorithmic Discrimination",
      "headline": "Algorithmic discrimination is the use of data sets to categorize people",
      "start": 1605460,
      "end": 1810868,
      "id": "ep_27_ch_7"
    },
    {
      "summary": "In the US, we have HIPAA, which is the act that essentially is there to govern health data. But all of that data is completely unprotected by HIPPA. It can be sold to third party providers, and it might be an accurate signal, but it also might be inaccurate.",
      "gist": "Could Facebook Know How Sick You Are?",
      "headline": "One question I have then is, under current legislations, do the existing legislation prevent doing that",
      "start": 1811044,
      "end": 2065600,
      "id": "ep_27_ch_8"
    },
    {
      "summary": "Where is the creep line? Or where is the unethical? Where's that border to be drawn? Is there any rule of thumb there? Or any ethical and a hard ethical rule?",
      "gist": "Where is the Creepy Line?",
      "headline": "We don't really know where the creepy line is. The creepy test is completely unknown",
      "start": 2066500,
      "end": 2474690,
      "id": "ep_27_ch_9"
    },
    {
      "summary": "An interesting study shows how many points of spatio temporal data we need from an anonymous cell phone set to identify an individual. If it's only four, you want to get 95% of individuals, you know, actually identified from a data set. It's not by any means an easy process.",
      "gist": "How to Identify People From Anonymous Data Sets",
      "headline": "How many points are needed to uniquely identify an individual from anonymous data",
      "start": 2477750,
      "end": 2979304,
      "id": "ep_27_ch_10"
    },
    {
      "summary": "I think we can do a lot. To be thinking about strengthening data ethics. If we have a really good sense of how to use data ethically, that becomes part of how the profession understands itself. There's going to be some amazing new technologies that are going to help us protect our data.",
      "gist": "Top Five: Data Ethics",
      "headline": "To be thinking about strengthening data ethics. I think we can do a lot",
      "start": 2979352,
      "end": 3423684,
      "id": "ep_27_ch_11"
    },
    {
      "summary": "Enrico: We all need to work on our sense of data ethics. We can look to the 20th century to see when fields went through this. Is there like a society or a lobby for data ethics?",
      "gist": "Big Data Ethics",
      "headline": "We all need to work on our sense of data ethics, Kate says",
      "start": 3423822,
      "end": 3706810,
      "id": "ep_27_ch_12"
    },
    {
      "summary": "Kate: I'm just as inspired about getting these questions around ethics and due process. That's just as sexy to me and just as exciting to me as the data. I think education is huge here. We need to have some balanced view. When do we do the color Wheel?",
      "gist": "In the Elevator With Big Data and Ethics",
      "headline": "I wanted to ask Kate. Tell us something super positive about big data",
      "start": 3709350,
      "end": 3903450,
      "id": "ep_27_ch_13"
    },
    {
      "summary": "Thank you. Thank you. Thank you. Okay. Thanks a lot.",
      "gist": " Paralympians speak",
      "headline": "Thank you. Thank you. Okay.",
      "start": 3904270,
      "end": 3907950,
      "id": "ep_27_ch_14"
    }
  ],
  "disfluencies": false,
  "entity_detection": false,
  "sentiment_analysis": false,
  "sentiment_analysis_results": null,
  "entities": null,
  "speakers_expected": null,
  "summary": null,
  "custom_topics_results": null,
  "is_deleted": null,
  "episode_num": "27",
  "episode_metadata": {
    "speakers": [
      "Enrico Bertini",
      "Moritz Stefaner",
      "Kate Crawford"
    ],
    "WPid": "128",
    "url": "https://datastori.es/podlove/file/267/s/feed/c/mp3/datastories-27.mp3",
    "episode_title": "Big Data Skepticism w/ Kate Crawford"
  }
}