{
  "id": "90626ecd-1458-48e0-81f0-bebdcc761c4c",
  "language_model": "assemblyai_default",
  "acoustic_model": "assemblyai_default",
  "language_code": "en_us",
  "status": "completed",
  "audio_url": "https://datastori.es/podlove/file/5704/s/feed/c/mp3/Datastories-146.mp3",
  "utterances": [
    {
      "end": 12810,
      "speaker": "Nicholas Rougeux",
      "start": 160,
      "text": "What's really interesting is that with every piece that I create, you never know what it's going to look like until you actually put it in the visual form. And every single time it's a surprise. Every single time I look at it, I think, wow, that's fascinating.",
      "id": "ep_146_ut_0"
    },
    {
      "end": 45954,
      "speaker": "Moritz Stefaner",
      "start": 32330,
      "text": "Hi, everyone. Welcome to a new episode of data stories. My name is Moritz Stefaner, and I'm an independent designer of data visualizations. In fact, I work as a self employed truth and beauty operator out of my office here in the countryside in the north of Germany.",
      "id": "ep_146_ut_1"
    },
    {
      "end": 54106,
      "speaker": "Enrico Bertini",
      "start": 46042,
      "text": "And I am Enrico Bertini. I am a professor at New York University in New York City, where I teach and do research in data visualization.",
      "id": "ep_146_ut_2"
    },
    {
      "end": 64600,
      "speaker": "Moritz Stefaner",
      "start": 54258,
      "text": "Right. And on this podcast together, we talk about data visualization, data analysis, and generally the role data plays in our lives. And usually we do that together with the guests we invite on the show.",
      "id": "ep_146_ut_3"
    },
    {
      "end": 89002,
      "speaker": "Enrico Bertini",
      "start": 64720,
      "text": "Exactly. But before we start, just a quick note. Our podcast is listener supported, so there's no ads that are intruding in the show. So if you enjoy the show, please consider supporting us with recurring payments on patreon.com Datastories, or if you prefer one time donations, you can go to PayPal. Me slash data stories.",
      "id": "ep_146_ut_4"
    },
    {
      "end": 97970,
      "speaker": "Moritz Stefaner",
      "start": 89146,
      "text": "That's right. So without further ado, just let's get started. Today we have another special guest. We have Nicholas Rougeux on the show. Hi, Nicholas.",
      "id": "ep_146_ut_5"
    },
    {
      "end": 98730,
      "speaker": "Enrico Bertini",
      "start": 98050,
      "text": "Hi, Nicholas.",
      "id": "ep_146_ut_6"
    },
    {
      "end": 100514,
      "speaker": "Nicholas Rougeux",
      "start": 98810,
      "text": "Hi, everybody. Thanks for having me.",
      "id": "ep_146_ut_7"
    },
    {
      "end": 126700,
      "speaker": "Moritz Stefaner",
      "start": 100642,
      "text": "Thanks for joining. You've been on our list for a long time. You've been doing many amazing data visualization projects, and now we finally have a chance to have you on. And so that's really fantastic. And we're really eager to talk about your work with you. As I said, you're doing visual data explorations, I would say, or interesting data projects. Can you tell us a bit how you got started doing this type of work?",
      "id": "ep_146_ut_8"
    },
    {
      "end": 163646,
      "speaker": "Nicholas Rougeux",
      "start": 127440,
      "text": "Sure. So I am a web designer by trade, essentially. That's what I do. That's my day job. And I kind of play around with data visualizations as a hobby in my free time, which blends into work as well. But I got started by when we started doing some more data related projects for my work, my full time job. And that led me to explore some of the tools and some of the visuals that it was created, and it really kind of piqued my interest. So I started exploring more on my own, and that kind of just grew and blossomed from there, I suppose, and I never looked back.",
      "id": "ep_146_ut_9"
    },
    {
      "end": 172430,
      "speaker": "Moritz Stefaner",
      "start": 163838,
      "text": "Okay, so all the projects here we can see on www.c82.net comma, which is your URL these are actually done in your spare time, is that right?",
      "id": "ep_146_ut_10"
    },
    {
      "end": 193628,
      "speaker": "Nicholas Rougeux",
      "start": 172510,
      "text": "I. Yes. So my site is a mixture, showing stuff that I've done for my work, my day job, and stuff that I've done on my free time. Most of the stuff in my free time are the ones that are. Most of the stuff I've done for work is the website information, the ones that categorize as websites. And my personal stuff is usually everything else. So it's mostly my personal stuff.",
      "id": "ep_146_ut_11"
    },
    {
      "end": 194612,
      "speaker": "Moritz Stefaner",
      "start": 193724,
      "text": "Yeah. Yeah.",
      "id": "ep_146_ut_12"
    },
    {
      "end": 195100,
      "speaker": "Nicholas Rougeux",
      "start": 194756,
      "text": "Cool.",
      "id": "ep_146_ut_13"
    },
    {
      "end": 198640,
      "speaker": "Moritz Stefaner",
      "start": 195140,
      "text": "So you're really passionate about building all these digital products?",
      "id": "ep_146_ut_14"
    },
    {
      "end": 206072,
      "speaker": "Nicholas Rougeux",
      "start": 199260,
      "text": "Yeah, yeah. You know what I do for my day job and a hobby, so, you know, gotta find some way of putting it online, right?",
      "id": "ep_146_ut_15"
    },
    {
      "end": 207216,
      "speaker": "Moritz Stefaner",
      "start": 206176,
      "text": "Through calling.",
      "id": "ep_146_ut_16"
    },
    {
      "end": 207720,
      "speaker": "Nicholas Rougeux",
      "start": 207368,
      "text": "Yeah.",
      "id": "ep_146_ut_17"
    },
    {
      "end": 217780,
      "speaker": "Moritz Stefaner",
      "start": 207760,
      "text": "Very good. So just to give our listeners a little idea of what types of projects you do, can you briefly walk us through some of your favorite projects from the last few years?",
      "id": "ep_146_ut_18"
    },
    {
      "end": 272230,
      "speaker": "Nicholas Rougeux",
      "start": 218360,
      "text": "Sure, no problem. So my project, it doesn't center around any one specific topic. In fact, I like doing projects on lots of different varieties of topics, whether it be music or math or transit or space or, you know, you pick the topic. I probably at least thought about it. What I like to do is I like to create what I call data art. And I use the term art not to elevate my products or my projects to the status of pure art or fine art, but it's kind of a term that most people can probably understand, and it's different. And it kind of differentiates that between with data visualization or infographics or things like that, which have the goal of informing and educating. Whereas what I like to do is explore and try to evoke any emotion or personal connection with any given topic.",
      "id": "ep_146_ut_19"
    },
    {
      "end": 275874,
      "speaker": "Moritz Stefaner",
      "start": 273170,
      "text": "So it's not capital a art, like.",
      "id": "ep_146_ut_20"
    },
    {
      "end": 282230,
      "speaker": "Nicholas Rougeux",
      "start": 275962,
      "text": "No, no, not at all gallery type art. But hey, you know, if someone wants to think of it that way, that's fine by me.",
      "id": "ep_146_ut_21"
    },
    {
      "end": 285962,
      "speaker": "Moritz Stefaner",
      "start": 283690,
      "text": "You wouldn't mind having something in the MoMA?",
      "id": "ep_146_ut_22"
    },
    {
      "end": 288510,
      "speaker": "Nicholas Rougeux",
      "start": 286146,
      "text": "I wouldn't mind at all. No, I wouldn't argue.",
      "id": "ep_146_ut_23"
    },
    {
      "end": 316210,
      "speaker": "Moritz Stefaner",
      "start": 288850,
      "text": "I'll let them know. But at the same time, you want to make clear, okay, it's a cultural product, basically, and not a tool or communication product in a more narrow sense. Right? Yeah. So, yeah. Tell us a bit about some of your projects. I think the first one I noticed from you was the off the staff project, which is a really nice musical visualization.",
      "id": "ep_146_ut_24"
    },
    {
      "end": 401022,
      "speaker": "Nicholas Rougeux",
      "start": 317190,
      "text": "That was a really fun project to work on. And for those who are listening, who aren't seeing it in front of them, I basically take classic music like Pachelbel's canon and d or the 1812 overture or Vivaldi's Four Seasons classic music, and I visualize every note in them. So I take the sheet music itself and I use those notes to paint a picture of what it actually sounds like with colors for notes and sizes of circles for notes and things like that. And that was really fun because it was actually a two part project I started back in 2016 as a way to just take the music and create a visual from it. But that kind of didn't. It set fine with me, but it didn't set well as I wish it could. And I really, really, really wanted to find a way to animate it and actually sync up the size of the circles growing as the notes play and things like that. So a year later, I kind of buckled down and nose to the grindstone and things like that, and finally figured out a way with my less than stellar programming skills to make it happen. And so now, with every visual, it's not just a static visual. You can actually watch the music come to life, essentially, as you're listening to it as well, right?",
      "id": "ep_146_ut_25"
    },
    {
      "end": 404750,
      "speaker": "Moritz Stefaner",
      "start": 401086,
      "text": "Yeah. And there's a couple of YouTube videos for some of them, or maybe all of them.",
      "id": "ep_146_ut_26"
    },
    {
      "end": 405270,
      "speaker": "Nicholas Rougeux",
      "start": 404830,
      "text": "All of them.",
      "id": "ep_146_ut_27"
    },
    {
      "end": 409314,
      "speaker": "Moritz Stefaner",
      "start": 405310,
      "text": "We can see how the graphics build up, and that's really fun to see.",
      "id": "ep_146_ut_28"
    },
    {
      "end": 427298,
      "speaker": "Nicholas Rougeux",
      "start": 409502,
      "text": "Yeah, I really had a fun time with that because I remember distinctly when I kind of cracked that code of getting everything to sync up for the first time. It still gives me chills to this day to think about it, because I actually saw something I create come to life for the first time. It was wild, it was exciting, and that's a great feeling.",
      "id": "ep_146_ut_29"
    },
    {
      "end": 453844,
      "speaker": "Moritz Stefaner",
      "start": 427394,
      "text": "Yeah. And the graphics themselves are really beautiful, like a fingerprint, almost, of each musical piece. And you see pretty well how repetitive the pieces are. Or if there are drastic changes in the instrumentation, if it's an orchestra piece, or you can see the rhythm, like, if it's a lot of short notes or lots of long ones, you see that wall. So there's a lot you can discover just by studying the visuals, I think.",
      "id": "ep_146_ut_30"
    },
    {
      "end": 488952,
      "speaker": "Nicholas Rougeux",
      "start": 454012,
      "text": "Absolutely. You can see the patterns and everything. And what's really interesting is that with every piece that I create, and I'm still working on them from time to time, you never know what it's going to look like. I mean, you may know the music by heart. We all are probably familiar with light of the bumblebee or moonlight sonata, but you never know what it's going to look like until you actually put it in the visual form. And every single time, it's a surprise. Every single time I look at it, I think, wow, I didn't know it would look like that. That's fascinating. So I sit there and I listen through the whole piece again while watching it, and it creates this whole different feeling for me to do that.",
      "id": "ep_146_ut_31"
    },
    {
      "end": 503864,
      "speaker": "Enrico Bertini",
      "start": 489056,
      "text": "Yeah, yeah. And I discovered looking in your website that you can actually order posters of these beautiful musical pieces. So I have a new space to decorate, so I'm considering doing that.",
      "id": "ep_146_ut_32"
    },
    {
      "end": 530027,
      "speaker": "Nicholas Rougeux",
      "start": 503912,
      "text": "It's beautiful, and I will certainly let you. Yeah. That's one of the goals that I like to do with just about any project, is it's fun to work on it, but if I can allow somebody to own a piece of it as well, then I want to do that. I've been creating posters for a lot longer than I've been doing this in, you know, in former lives, but I like to create something for people to purchase and own for themselves, to take a piece of it away.",
      "id": "ep_146_ut_33"
    },
    {
      "end": 541199,
      "speaker": "Enrico Bertini",
      "start": 530203,
      "text": "Yeah. I think what is really interesting, by looking at many of them at once is that they are really unique. Right. For every piece you can see, there's a distinctive pattern, right?",
      "id": "ep_146_ut_34"
    },
    {
      "end": 542395,
      "speaker": "Nicholas Rougeux",
      "start": 541499,
      "text": "Absolutely.",
      "id": "ep_146_ut_35"
    },
    {
      "end": 544211,
      "speaker": "Enrico Bertini",
      "start": 542507,
      "text": "I guess that's on purpose, right?",
      "id": "ep_146_ut_36"
    },
    {
      "end": 565956,
      "speaker": "Nicholas Rougeux",
      "start": 544275,
      "text": "Mm hmm. Mm hmm. Yeah, I like to use it. I try to use a different color palette for each one. I do a grayscale version where all the notes are just outlined circles, but I like to do a color version as well, because I think they both have their distinct appeal. Somebody may just want a simple black and white poster to hang up on their wall, or somebody may want something with a little more color splash. So I like to try to appeal to both. Yes.",
      "id": "ep_146_ut_37"
    },
    {
      "end": 574670,
      "speaker": "Enrico Bertini",
      "start": 566028,
      "text": "So can you tell us a little bit more about what's behind projects like this one? So what do you. How does the process look like?",
      "id": "ep_146_ut_38"
    },
    {
      "end": 686970,
      "speaker": "Nicholas Rougeux",
      "start": 575410,
      "text": "I wish I had some sort of magic secret to tell you here for this, but it really boils down to me, is something catching my eye? So when I, before I started the office staff project, for example, I was just browsing around, and I learned of this tool, this app called Muse Score, and it's basically for composing sheet music for people who know how to read sheet music and compose music. And everything takes care of creating the notes on the page and their position and the scales and everything. But when I learned about it, I also learned that it stores the data in a structured format, so it's not just like looking at a PDF of some sheet music, and that's it. Everything is very structured, and through a little bit of experimentation, I figured out that I could actually turn that into some parsable data through, like, an XML file or a CSV file. And at that point, that's where it started to click. For me, this could be something interesting to explore, because there's a whole online repository of classical sheet music that's been composed in this. And so that was really interesting to start playing around with. And I will say to this day, I still can't read sheet music. I can't play music to save my life. But the tagline I like to give is I can't read music, but I can certainly parse it, so I can at least enjoy that aspect of it. And I have a much greater respect for people who can actually compose it and read it. So once I figured out I could do that, it started me down the path of exploring and experimenting with just how do I turn these notes into something visual? How do I transform the duration of the note, the position of the note, the octave of the note to turn into something interesting? And that's where the current visuals came from. After a lot of exploration for things like that.",
      "id": "ep_146_ut_39"
    },
    {
      "end": 708254,
      "speaker": "Moritz Stefaner",
      "start": 688070,
      "text": "Yeah, it seems like a lot of your projects are sort of translation exercises in the sense that you take one sort of input and transform it into another, or maybe take geographic information and slice it in interesting ways, or turn sonnets into signatures. Right. So it's often this, how can I turn a into b in a way.",
      "id": "ep_146_ut_40"
    },
    {
      "end": 731760,
      "speaker": "Nicholas Rougeux",
      "start": 708302,
      "text": "Right, exactly. And that's part of the fun of it. I mean, I try to like to look at things in different ways. It may be something that is mundane that we've seen all the time, every day, or is there a different way of looking at that? It may not make sense and it may not be purposeful, but I think that's okay because it's a visual exploration. What can we do with data that may not have been done before?",
      "id": "ep_146_ut_41"
    },
    {
      "end": 757344,
      "speaker": "Moritz Stefaner",
      "start": 732100,
      "text": "Right, right. Yeah, really interesting. And I think a lot of your projects either have an interesting angle on an existing data set or find a new, like, interesting way of framing a certain datasets. There's one called between the words that just explores the punctuation in texts. And I think this was really fun because often the punctuation is ignored, like when you do natural language processing. Right. That's the first thing they throw.",
      "id": "ep_146_ut_42"
    },
    {
      "end": 759060,
      "speaker": "Enrico Bertini",
      "start": 757392,
      "text": "It's the first thing that goes away.",
      "id": "ep_146_ut_43"
    },
    {
      "end": 760512,
      "speaker": "Nicholas Rougeux",
      "start": 759360,
      "text": "Exactly, exactly.",
      "id": "ep_146_ut_44"
    },
    {
      "end": 772368,
      "speaker": "Moritz Stefaner",
      "start": 760536,
      "text": "It's so interesting. And so much style is captured in, like, the rhythm of the types of punctuation marks. So it's just very clever to say, like, okay, I make this the main topic of something.",
      "id": "ep_146_ut_45"
    },
    {
      "end": 773708,
      "speaker": "Nicholas Rougeux",
      "start": 772424,
      "text": "Right, exactly.",
      "id": "ep_146_ut_46"
    },
    {
      "end": 775240,
      "speaker": "Moritz Stefaner",
      "start": 773764,
      "text": "And the scrappings.",
      "id": "ep_146_ut_47"
    },
    {
      "end": 808310,
      "speaker": "Nicholas Rougeux",
      "start": 777140,
      "text": "And that's actually kind of how it came to be, you know, I was doing some processing. I was just writing some regular expressions, experimenting with something else entirely. And this actually turned out to be an accident. So I inadvertently kept all the punctuation instead of removing it and thought, well, that's kind of interesting, maybe I can do something with that. And the whole thing fell together in the span of a weekend. I mean, this wasn't like a long, drawn out project. This was something that it just kind of presented itself. And I said, yep, I should make something with that.",
      "id": "ep_146_ut_48"
    },
    {
      "end": 813922,
      "speaker": "Moritz Stefaner",
      "start": 809730,
      "text": "Nice. So a lot of inspiration just coming from accidents and playful explorations.",
      "id": "ep_146_ut_49"
    },
    {
      "end": 820194,
      "speaker": "Nicholas Rougeux",
      "start": 813986,
      "text": "I guess that's the most important thing, I think, with just about any project you have to explore and experiment.",
      "id": "ep_146_ut_50"
    },
    {
      "end": 824910,
      "speaker": "Moritz Stefaner",
      "start": 820322,
      "text": "Do you have a lot of half finished projects where you tried something out but it never went anywhere?",
      "id": "ep_146_ut_51"
    },
    {
      "end": 871704,
      "speaker": "Nicholas Rougeux",
      "start": 825530,
      "text": "I have a handful of them, yeah, there's plenty of ideas that you think, well, that would be interesting to do, and then you realize you haven't found the interesting part yet. But even with any of the projects that I have released, I always try to keep every possible iteration I've come up with because you never know when it could inspire yourself or even somebody else if you share it later on down the line. So I have, you know, version one, version two, version three, and so on. And depending on how interesting they are, I may share them on places like Twitter, or I'll just keep them so that nobody really ever sees them because they're not worthwhile. Or I may compile them into like a making of blog post. And I find that it's nice to be able to keep them because you never know when you're going to need them.",
      "id": "ep_146_ut_52"
    },
    {
      "end": 878140,
      "speaker": "Moritz Stefaner",
      "start": 871872,
      "text": "Yeah. Maybe you can auction off your hard drive at some point when you're running out of money.",
      "id": "ep_146_ut_53"
    },
    {
      "end": 879512,
      "speaker": "Nicholas Rougeux",
      "start": 878640,
      "text": "Yeah, exactly.",
      "id": "ep_146_ut_54"
    },
    {
      "end": 881580,
      "speaker": "Moritz Stefaner",
      "start": 879576,
      "text": "Put all your explorations on eBay.",
      "id": "ep_146_ut_55"
    },
    {
      "end": 884520,
      "speaker": "Nicholas Rougeux",
      "start": 882520,
      "text": "First. I have to take them off the blog post.",
      "id": "ep_146_ut_56"
    },
    {
      "end": 889220,
      "speaker": "Moritz Stefaner",
      "start": 884640,
      "text": "Yeah, I think Joshua Davis did that once, like just give away his whole hard drive, basically.",
      "id": "ep_146_ut_57"
    },
    {
      "end": 893160,
      "speaker": "Nicholas Rougeux",
      "start": 891260,
      "text": "Hey, if somebody's willing to pay the price.",
      "id": "ep_146_ut_58"
    },
    {
      "end": 895880,
      "speaker": "Moritz Stefaner",
      "start": 894820,
      "text": "There you go.",
      "id": "ep_146_ut_59"
    },
    {
      "end": 897532,
      "speaker": "Nicholas Rougeux",
      "start": 896220,
      "text": "Gotta pay the bills somehow.",
      "id": "ep_146_ut_60"
    },
    {
      "end": 913244,
      "speaker": "Moritz Stefaner",
      "start": 897636,
      "text": "Yeah. And your last three projects on the website, at least they took sort of a different turn, I think, compared to the other ones because they're almost like restoration projects or like interactive books or. I'm not even sure what they are, but they are cool and I enjoy them.",
      "id": "ep_146_ut_61"
    },
    {
      "end": 915480,
      "speaker": "Nicholas Rougeux",
      "start": 913412,
      "text": "That's the general reaction, yeah.",
      "id": "ep_146_ut_62"
    },
    {
      "end": 934780,
      "speaker": "Moritz Stefaner",
      "start": 916620,
      "text": "Yeah. So you took an old book about colors and burns Euclide, which is a really beautiful book with all the Euclidean geometrical proofs, and another book with illustrations, like old botanical illustrations, and turned them into digital products, right?",
      "id": "ep_146_ut_63"
    },
    {
      "end": 951390,
      "speaker": "Nicholas Rougeux",
      "start": 935600,
      "text": "Yeah. So I've taken those three and basically reproduced them in their entirety. So every word, every color, every line, I reproduce them into their own sites. Yeah.",
      "id": "ep_146_ut_64"
    },
    {
      "end": 965810,
      "speaker": "Moritz Stefaner",
      "start": 952530,
      "text": "And is this generally a direction where you say, like, okay, this is actually what I want to do, or do you feel like, okay, I've did it with these three, and now I'll do normal, let's say, data visualization projects again, or how do you feel about these projects?",
      "id": "ep_146_ut_65"
    },
    {
      "end": 1066060,
      "speaker": "Nicholas Rougeux",
      "start": 965930,
      "text": "I've really enjoyed working on them. I've always told other people that I enjoy working with existing materials, and that's partly why data just kind of comes very, comes somewhat naturally to me because it's existing data. Either I need to generate the data or collect it myself, or it already exists, but I'm able to kind of take, it's something that's there. I'm not writing the next great American novel or something. I'm taking something that exists and reshaping it. And these things are quite interesting because often they're almost forgotten. I mean, we were probably somewhat aware of Byrne's Euclid, but Werner's nomenclature of colors and twinings, illustrations of the natural orders of plants. You know, I never heard of them until I started working on them. And it feels like it's fun to bring something that's forgotten back to life, but in a slightly new light and with a new little bit of a new twist on it. I certainly didn't go into, you know, before I did the colors. One, I didn't go into it saying, I want to reproduce a color book, but it caught my eye. I think I saw, like a tweet that somebody did on Twitter. And I thought, well, that's kind of interesting. And I started extracting the colors just from the palettes, from the swatches. But in doing so, I realized that I was kind of in my own way of storing things. I realized, well, I was just kind of replicating the book just for my own notes. And I thought, well, maybe somebody might find that interesting. What if I just kind of put that up there? Just the one pager. There's really nothing to it, but it's, I put it up there, and I was blown away by how many people found it as interesting as I did.",
      "id": "ep_146_ut_66"
    },
    {
      "end": 1082340,
      "speaker": "Enrico Bertini",
      "start": 1067000,
      "text": "And what is the, I'm wondering, what is the mechanics behind reproducing some of these books, right. So, especially, I don't know, the natural orders of plants. Do you actually redraw all the plants? How does it work?",
      "id": "ep_146_ut_67"
    },
    {
      "end": 1084220,
      "speaker": "Nicholas Rougeux",
      "start": 1082880,
      "text": "Well, sort of.",
      "id": "ep_146_ut_68"
    },
    {
      "end": 1098620,
      "speaker": "Enrico Bertini",
      "start": 1085480,
      "text": "I mean, it's pretty, I think, for our listeners is probably not evident how hard this is. But I mean, reproducing every single plant looks pretty daunting task to me.",
      "id": "ep_146_ut_69"
    },
    {
      "end": 1221290,
      "speaker": "Nicholas Rougeux",
      "start": 1098920,
      "text": "Well, thankfully I didn't have to redraw. You know, I cannot draw. Like Elizabeth twining draws these illustrations. I cannot paint, I cannot sketch at all. But what I did have to do is clean them up. So if you look at some of the original scans of these things that were produced in, you know, the 18 hundreds, the paper is yellowed, they're spotting, you know, the colors aren't quite right. So each one does need to be touched up quite a bit in Photoshop, and that involves getting rid of the yellow background. I wanted a white background for all of my pure white background because I wanted to, you know, combine them all into a poster and things like that. But the, I underestimated the amount of work that would be involved in that particular one. You know, I seem to be going on this like, trend, this uptrend of how long each of these projects take. The color project took about two weeks, Euclid took about two months, and the natural order of plants took four months. I hope the next one doesn't take like eight months or something, you know, but there is a lot of work involved each. So I, you know, downloaded each image from the Internet archive, each scan, processed it in Photoshop, taking anywhere from 30 minutes to a couple hours just to get rid of the background, tidy up the colors, keep as much of the original illustration as possible. But then the second step of that was tracing each one of the plants in illustrator. So I could create these vector based outlines of each plant. So you can hover over them and say, like, oh, this is the orange, or this is the apple, or this is the whatever. And that's the part that probably took the most amount of time because, you know, I recorded a video of doing this just so everybody could see, you know, how much work is involved in the. I enjoyed every minute of it. But what you don't realize is that you could spend easily 4 hours just tracing leaves of a single diagram to get these things to line up and get them to work. But I think it was worth it in the end, and I'm really pleased with the outcome.",
      "id": "ep_146_ut_70"
    },
    {
      "end": 1253482,
      "speaker": "Moritz Stefaner",
      "start": 1221950,
      "text": "There's a really extensive write up, by the way. Thank you for all these detailed process. They're so valuable. And there's one huge long website where you go through all the steps and where you just realize, oh man, so much involved to get these super crisp and nice looking graphics and especially the hover effect of the individual plant in a group of plants, and then you cross highlight that in the text. I think that's amazing. But when I realized you had to redraw everything by hand or mask it, at least, I was like, oh, my.",
      "id": "ep_146_ut_71"
    },
    {
      "end": 1256986,
      "speaker": "Nicholas Rougeux",
      "start": 1253506,
      "text": "God, I think about glutton for punishment here, you know?",
      "id": "ep_146_ut_72"
    },
    {
      "end": 1297576,
      "speaker": "Moritz Stefaner",
      "start": 1257138,
      "text": "Yeah, yeah. But that sort of maybe even brings us to the main topic, because one thing that really strikes me about your work is how much effort you put into these last, let's say, small polishing steps. And I feel in your work, it's almost like the main activity is really to get everything done until the end. Right. And really polish everything fine. And also be thoughtful about all these little details, and especially with the hovers of these individual plants. I think a lot of people would have just said, yeah, that would be nice to have, but listen, I'm not gonna go through anything. Exactly.",
      "id": "ep_146_ut_73"
    },
    {
      "end": 1301344,
      "speaker": "Nicholas Rougeux",
      "start": 1297688,
      "text": "And then I come along, crazy person, you know, I might as well do it, right?",
      "id": "ep_146_ut_74"
    },
    {
      "end": 1322456,
      "speaker": "Moritz Stefaner",
      "start": 1301472,
      "text": "Right. Yeah. But I think that's super interesting. And in the end, people, you still. You see that. You see that dedication to the. To the detail. And so, yeah, I thought maybe we can discuss all these, these last details of it, because they really seem to. You seem to have a good hand there, or at least the tenacity to really go there.",
      "id": "ep_146_ut_75"
    },
    {
      "end": 1325784,
      "speaker": "Nicholas Rougeux",
      "start": 1322648,
      "text": "I'm not afraid of the amount of work involved with some of these things.",
      "id": "ep_146_ut_76"
    },
    {
      "end": 1354200,
      "speaker": "Moritz Stefaner",
      "start": 1325912,
      "text": "Yeah, exactly. Yeah. And so maybe can you tell us a bit about some of these, let's say, what people might call small decisions? I know it's a lot of work, but often people see these details as being small and not so important. But some of them that have really, where you say it shaped the outcome, I think in the plants example, it's totally clear. Were there similar situations in other projects where you said, yeah, it was really, really worth doing this last polishing step?",
      "id": "ep_146_ut_77"
    },
    {
      "end": 1433366,
      "speaker": "Nicholas Rougeux",
      "start": 1354550,
      "text": "Yeah. And I would say probably the other one that comes to mind is what I did for the Burns Euclid project, where I wanted to recreate all the diagrams from the book. The initial goal of the project wasn't necessarily to reproduce the whole book, but it was to. I wanted to see what all the diagrams looked like together. I looked around and I couldn't see anybody who had actually collected them all at once. And I consider that those data points of the book itself, each of the illustrations. So, you know, I started out by creating a handful. I just wanted, like, I wanted to see how. What would it take to create one of the proofs, one of the shapes, one of the diagrams, and I realized that it really did take on a whole new meaning. It gave me a deeper understanding of just their purpose and how they were created. I mean, the first one talks about how to draw an equilateral triangle or bisect a line. It's fairly simple concept, but when you sit down and actually do it and read through, read through each of the steps that Euclid, then Fern kind of reinterpreted to see how it's done and to actually do it yourself, both by hand and then even on the computer, to figure out how to draw those lines. And I did that. I would do it as they described. So it's not just me.",
      "id": "ep_146_ut_78"
    },
    {
      "end": 1435150,
      "speaker": "Moritz Stefaner",
      "start": 1433398,
      "text": "Externally, you redid the geometry.",
      "id": "ep_146_ut_79"
    },
    {
      "end": 1504090,
      "speaker": "Nicholas Rougeux",
      "start": 1435190,
      "text": "Actually, I redid the geometry. So when it talks about bisecting an angle or bisecting a line, I'm sitting there in illustrator. Thankfully, it can snap to edges and everything. Where I'm drawing a circle, I'm doing exactly what it says. And by golly, it worked, you know, and it just gives you a deeper understanding. So. And after doing a couple of them, I realized, all right, I got to recreate all of them. I mean, each one of these things is going to be its own challenge, but I have to recreate all of them if I'm going to do something with it. And I think at the end, it really had a bigger impact on it because it not only showed, it presented them in a new light, new, more polished light, but it gave me the flexibility as a designer to do more with them. There's only so much you can do with a cropped jpeg that you download from somewhere. But if you have the original vector graphics, you can do all the things you want, you can resize them, you can arrange them, you can do whatever you want, make adjustments, or put them online for everybody else to enjoy. I think recreating them, while it seems like a small thing, lot, many small things, I think it had a nice impact because it really did breathe new life into it, I think.",
      "id": "ep_146_ut_80"
    },
    {
      "end": 1539210,
      "speaker": "Moritz Stefaner",
      "start": 1505590,
      "text": "So you just want to be complete and sort of. Yeah, completion is basically finish it to the full, like to the. To the end. Yeah. That's a good attitude. I mean, the potential downside is, or sometimes I run into that trap myself, is if you're too perfectionist, then you never know when you're done or you're never happy. Does that work happen for you, too? Or do you have any tricks to avoid that situation? Or do you always know when you're done? Do you have a clear feeling of.",
      "id": "ep_146_ut_81"
    },
    {
      "end": 1550510,
      "speaker": "Nicholas Rougeux",
      "start": 1539250,
      "text": "Okay, now it's finished, you know, again, I wish I had a magical answer. I think when it comes to the reproductions of the books, typically by the time I reach the end of the book, that's usually when it's done.",
      "id": "ep_146_ut_82"
    },
    {
      "end": 1554986,
      "speaker": "Moritz Stefaner",
      "start": 1553130,
      "text": "That's an excellent tip, actually.",
      "id": "ep_146_ut_83"
    },
    {
      "end": 1633910,
      "speaker": "Nicholas Rougeux",
      "start": 1555138,
      "text": "But the benefit to that is that often these projects are so long that during the process, I'm continuing to like, you know, for the burns, you, for any of the reproductions. I usually start off by doing a proof of concept, and then I go ahead and I start building the actual site, and the site continues to be built and polished as I go, so it's not so much do a lot of work right now, and then spend the rest of the time polishing. I end up spending almost all of the time polishing the initial concept, because after I do one diagram, I'll sit back and I'll take a look at it and say, well, maybe that needs to be adjusted, or I hadn't accommodated that, or I hadn't thought about that. So I'm gonna make a small adjustment as I go. So I don't know. It's. I don't know if that's the great way to do things, but I. So, because I end up polishing almost too much, but I think it helps because it gives me a much longer period to evaluate things and think about how can it be polished and tweaked and adjusted and things like that. So, you know, that, I don't know when things are really done, really. Sometimes I just reach a point where I say, all right, I've done all the things I wanted to do. You know, I made the blog post, I made the site, I planned what I'm going to do when I announce it to everybody. At that point, I figure, all right, I think it's done.",
      "id": "ep_146_ut_84"
    },
    {
      "end": 1645550,
      "speaker": "Enrico Bertini",
      "start": 1636850,
      "text": "I'm wondering if this leads you to, I don't know, when you see other people's work, do you ever say, if only you had spent a little bit more time on that?",
      "id": "ep_146_ut_85"
    },
    {
      "end": 1674134,
      "speaker": "Nicholas Rougeux",
      "start": 1646330,
      "text": "You know, I try not to be critical, you know, in the sense that, you know, I'm sure they put their own, you know, heart and soul into it. Obviously, everybody who works on a project is going to have their own ways of doing things, for sure. Sometimes it's fun to look at a project and think, well, if I was working on that, what would I do? That would be kind of fun to work on. But I like to see what other people have done and to read about the details they put in the project, because sometimes it inspires me for future projects.",
      "id": "ep_146_ut_86"
    },
    {
      "end": 1688696,
      "speaker": "Enrico Bertini",
      "start": 1674262,
      "text": "Do you think there is a way to cultivate this specific kind of mindset. I'm thinking about maybe some of our listeners who want to learn from you how to actually develop this kind of mindset, and also if there are any specific tricks they can apply.",
      "id": "ep_146_ut_87"
    },
    {
      "end": 1737064,
      "speaker": "Nicholas Rougeux",
      "start": 1688848,
      "text": "Well, I don't know if I would encourage anybody to adopt my mindset. That could be a dangerous thing. It comes from a lifetime of being, I don't want to say obsessive, but, you know, focus on the details. Sometimes too much. I think what it really boils down to is finding something you're passionate about. I mean, we've probably all heard this before, but if you find something that's interesting to you, you're going to dig into it. You don't even have to tell yourself to dig into it. You're going to dig into it and read everything there is about a project. You're going to read every word, you're going to create every diagram. That's the most important thing. It's really hard to get into finessing the details of something you've been told you have to care about. It just doesn't really flow. But if you find something that's genuinely interesting, it kind of comes naturally. At least that's been my experience.",
      "id": "ep_146_ut_88"
    },
    {
      "end": 1738140,
      "speaker": "Moritz Stefaner",
      "start": 1737232,
      "text": "Of course.",
      "id": "ep_146_ut_89"
    },
    {
      "end": 1739260,
      "speaker": "Nicholas Rougeux",
      "start": 1738480,
      "text": "Yeah.",
      "id": "ep_146_ut_90"
    },
    {
      "end": 1748460,
      "speaker": "Moritz Stefaner",
      "start": 1739920,
      "text": "Was there ever a situation where you spend a lot of time, like polishing something or tweaking something, and in the end you realize that was a bit of a waste of time?",
      "id": "ep_146_ut_91"
    },
    {
      "end": 1790588,
      "speaker": "Nicholas Rougeux",
      "start": 1750120,
      "text": "Yeah. Some of the early explorations for some of my projects, you know, you spend like, I think for off the staff, when I was working on that, I did something like 20 some odd iterations before I settled on the final result. And some of them took a lot of time to figure out a. I posted a lot of them in the making of blog posts, but some of them I haven't posted. But, yeah, sometimes you just spend the time. You spend an inordinate amount of time working on something and you realize it wasn't worth it. But I think there's still tremendous value in spending that time on it because if nothing else, you've realized what doesn't work and perhaps you picked up some techniques that you can apply to future iterations.",
      "id": "ep_146_ut_92"
    },
    {
      "end": 1801136,
      "speaker": "Moritz Stefaner",
      "start": 1790774,
      "text": "Yeah, totally. Yeah, yeah, yeah. It's so often that you do something like, oh, that was a total waste of time. And half a year later, like, hey, I could use the exact same trick.",
      "id": "ep_146_ut_93"
    },
    {
      "end": 1801872,
      "speaker": "Nicholas Rougeux",
      "start": 1801288,
      "text": "Exactly.",
      "id": "ep_146_ut_94"
    },
    {
      "end": 1803584,
      "speaker": "Moritz Stefaner",
      "start": 1801936,
      "text": "Now it actually makes sense, right?",
      "id": "ep_146_ut_95"
    },
    {
      "end": 1817380,
      "speaker": "Nicholas Rougeux",
      "start": 1803672,
      "text": "I mean, it's frustrating at the time, for sure, especially when you have, like, this great idea in the middle of the night. And you say, oh, yeah, I'm gonna do that. That's perfect. That's gonna look great. And then you look at it and you think, this is garbage. We all go through that, right?",
      "id": "ep_146_ut_96"
    },
    {
      "end": 1826162,
      "speaker": "Moritz Stefaner",
      "start": 1818450,
      "text": "Yeah, but there's always also this sunk cost fallacy that whenever you put time into something, you just value it because you have already invested.",
      "id": "ep_146_ut_97"
    },
    {
      "end": 1864280,
      "speaker": "Nicholas Rougeux",
      "start": 1826266,
      "text": "That's true. At some point you reach this point of like, all right, I've invested this much time into it, I might as well see it through. And sometimes that pays off, you know, you just don't know. I actually reached that point for the botanical illustrations project, and I posted about it on Twitter. I created this little fake graph of like your emotional roller coaster of how you go through a project and you start off and you think, it's going to be great. I feel great. This is going to be really exciting. But at some point you do reach that level of, what have I gotten myself into? I've spent this much time onto it. Is it worth it? I don't really know, but I might as well see it through because maybe my opinion will change. And sometimes it does, sometimes it doesn't.",
      "id": "ep_146_ut_98"
    },
    {
      "end": 1880720,
      "speaker": "Enrico Bertini",
      "start": 1868140,
      "text": "So, Nicholas, I was wondering if you can briefly comment on what your toolbox is in terms of specific, say, software you use or programming languages, stuff like that.",
      "id": "ep_146_ut_99"
    },
    {
      "end": 1954656,
      "speaker": "Nicholas Rougeux",
      "start": 1880880,
      "text": "Absolutely. So I am not a programmer. I am not a developer. I like to tell my clients here at work, I'm a designer who knows just enough coding to be dangerous. I'm really good at breaking things. So if I'm going to go into a project and try to make a change, it doesn't take long for me to ask somebody for help on fixing something I've broken. But when it comes to playing around with things, I do have a couple tools that I like to play around with. One of my favorite is Nodebox. It's kind of, I don't know if you've heard of it, but it's basically a way to experiment with data and some sort of generative art in a way, with just nodes. You don't have to know any program, and you drag nodes around, you kind of connect the dots and you say you're going to import this CSV and you're going to take each row, assign a circle to it, and the circle is going to be as wide as this data point, or it's going to be this color based on this data point. But what I really like about it is it lets me experiment with data in creative ways, quickly and easily, without requiring me to do any actual coding. And they're not sponsoring me or paying me or anything to say that I've just been using it for years.",
      "id": "ep_146_ut_100"
    },
    {
      "end": 1956288,
      "speaker": "Moritz Stefaner",
      "start": 1954688,
      "text": "It's an open source project anyways, right?",
      "id": "ep_146_ut_101"
    },
    {
      "end": 1992920,
      "speaker": "Nicholas Rougeux",
      "start": 1956304,
      "text": "Yes it is. Yeah. I've been in contact with the creator for a couple things, couple questions that I've had, and he's always been very responsive, but it also has proven to be useful for producing the final result. I mean, it exports into SVG files, so I can always take those and do maybe minor manipulation in illustrator, but for the most part comes straight out of nodebox. All of the off the staff illustrations are straight out of nodebox. It even does animation. So all I have to do is export a movie file, take the audio file and slap it together and premiere and there you go. It works. Easier said than done, believe me.",
      "id": "ep_146_ut_102"
    },
    {
      "end": 1997720,
      "speaker": "Moritz Stefaner",
      "start": 1994680,
      "text": "A few steps there, I skipped months.",
      "id": "ep_146_ut_103"
    },
    {
      "end": 2040620,
      "speaker": "Nicholas Rougeux",
      "start": 1997760,
      "text": "Of headaches that are caused just to get to that point. But in general, in general I like to use node box as a way to first start experimenting with the data. It's my way to see what the data looks like just as a starting point. But I also use the good old standard spreadsheets. They're not terribly exciting, but they work really well. I live in Google sheets quite frequently, and I also use for experimenting with other visuals, I used the good old standard Photoshop illustrator and indesign for web layouts and things like that. But I also use some of the online tools that we're probably all very familiar with, like raw from, oh, what are they from? Density or raw graphs?",
      "id": "ep_146_ut_104"
    },
    {
      "end": 2044840,
      "speaker": "Moritz Stefaner",
      "start": 2041720,
      "text": "Technico Milano densities, yeah, density design that's.",
      "id": "ep_146_ut_105"
    },
    {
      "end": 2087465,
      "speaker": "Nicholas Rougeux",
      "start": 2044880,
      "text": "Been in my toolbox for longer than I can, than I can realize. But the point is to just have a way to get into seeing what the data looks like when it comes to actually producing some of the visuals. Like I said, I'm not really a coder, so while I would love to be able to just start plugging away with v three, I only know enough to kind of poke around with it and play around a little bit, but I'm still stumbling and I'm not as knowledgeable as many others with that. So I like to, if I can, I like to use libraries if they exist, and one of my favorite ones is high charts. They have a lot of just built in capability that lets me play around with it and sometimes generate the visuals straight from that.",
      "id": "ep_146_ut_106"
    },
    {
      "end": 2095201,
      "speaker": "Moritz Stefaner",
      "start": 2087617,
      "text": "Yeah, but I think that's very encouraging that you don't have to be like a rockstar JavaScript coder to do data heavy work, right?",
      "id": "ep_146_ut_107"
    },
    {
      "end": 2097309,
      "speaker": "Nicholas Rougeux",
      "start": 2095265,
      "text": "I mean, it helps if you have knowledge.",
      "id": "ep_146_ut_108"
    },
    {
      "end": 2119974,
      "speaker": "Moritz Stefaner",
      "start": 2097809,
      "text": "Yeah, sure, but no, but if you're clever about combining tools you already know, or just filling one gap you have and do the rest with your usual tools, you can get very far and maybe it even becomes your unique style. Right? Maybe your work wouldn't look as interesting if you were doing it all in D3 and copying the same examples as everybody else. Right?",
      "id": "ep_146_ut_109"
    },
    {
      "end": 2200118,
      "speaker": "Nicholas Rougeux",
      "start": 2120022,
      "text": "Yeah, that's very true. I mean, I like to use off the staff as a good example where I don't ever just use one tool for a product, for that product, for that project. I ended up taking data that started in Musescore, exporting it into an XML format, which I then used to convert to CSV using another software I then use ported into spreadsheets, I then ported it into node box. And then it's like I'm using five or seven tools with every project where if I were more knowledgeable, I probably could have just done it with some fancy codes. But that part, while it could be done, it doesn't spark that interest in me. I'm more of the person that's like, like I recognize the value of it. I just want to get it done. How can I use the tools I already know? But I will say one other tool that I have used on almost every project, and what actually led to the between the words project was just good old regular expressions. And I used this site called regexer.com dot. It has become invaluable to me just for parsing data. Instead of writing a script to get certain pieces of data out, I just write a quick regex and put it in there and paste the data. And if it means that I have to do it 50 times rather than writing a script, all right, that's fine. I'm not afraid of the work, but it's been an invaluable tool for me.",
      "id": "ep_146_ut_110"
    },
    {
      "end": 2211210,
      "speaker": "Moritz Stefaner",
      "start": 2200294,
      "text": "Cool. This is amazing. Yeah, I was pretty sure you're like a kick ass programmer with all you these super intricate graphics you do, revealing too many secrets.",
      "id": "ep_146_ut_111"
    },
    {
      "end": 2217950,
      "speaker": "Nicholas Rougeux",
      "start": 2215030,
      "text": "Like I said, I know enough to be dangerous, and that's about it. Yeah.",
      "id": "ep_146_ut_112"
    },
    {
      "end": 2228822,
      "speaker": "Moritz Stefaner",
      "start": 2218030,
      "text": "But I think that makes it probably exactly so interesting. And I think that's a really cool approach. Yeah, yeah. So I think we have to wrap it up. We are reaching our magical 40 minutes mark.",
      "id": "ep_146_ut_113"
    },
    {
      "end": 2229730,
      "speaker": "Nicholas Rougeux",
      "start": 2228926,
      "text": "Okay.",
      "id": "ep_146_ut_114"
    },
    {
      "end": 2238170,
      "speaker": "Moritz Stefaner",
      "start": 2230470,
      "text": "But this was super interesting, and thanks so much for joining us. We can't wait to see what will be next. Do you have a project you're working on right now?",
      "id": "ep_146_ut_115"
    },
    {
      "end": 2251700,
      "speaker": "Nicholas Rougeux",
      "start": 2238830,
      "text": "I have. I'm kind of in that early phases of what have I gotten myself into is this really going to be working worth it? We'll see. I don't know. I wish I could give some hints, but I'm always to do that.",
      "id": "ep_146_ut_116"
    },
    {
      "end": 2256464,
      "speaker": "Moritz Stefaner",
      "start": 2253640,
      "text": "We'll just check back in a few months and be amazed again.",
      "id": "ep_146_ut_117"
    },
    {
      "end": 2260860,
      "speaker": "Nicholas Rougeux",
      "start": 2256552,
      "text": "Hopefully less than a few months. I'm trying to do shorter ones.",
      "id": "ep_146_ut_118"
    },
    {
      "end": 2268544,
      "speaker": "Moritz Stefaner",
      "start": 2262280,
      "text": "We'll have an eye on it. Thanks so much for joining us and thanks for sharing all this amazing work and the documentation.",
      "id": "ep_146_ut_119"
    },
    {
      "end": 2271896,
      "speaker": "Nicholas Rougeux",
      "start": 2268672,
      "text": "Absolutely. And thank you for having me. This was really fun. I enjoyed it.",
      "id": "ep_146_ut_120"
    },
    {
      "end": 2272828,
      "speaker": "Enrico Bertini",
      "start": 2271928,
      "text": "Thanks so much.",
      "id": "ep_146_ut_121"
    },
    {
      "end": 2273828,
      "speaker": "Moritz Stefaner",
      "start": 2272984,
      "text": "Thanks, Niklas.",
      "id": "ep_146_ut_122"
    },
    {
      "end": 2274492,
      "speaker": "Enrico Bertini",
      "start": 2273884,
      "text": "Bye, Nicholas.",
      "id": "ep_146_ut_123"
    },
    {
      "end": 2275360,
      "speaker": "Nicholas Rougeux",
      "start": 2274556,
      "text": "Bye bye.",
      "id": "ep_146_ut_124"
    },
    {
      "end": 2302456,
      "speaker": "Moritz Stefaner",
      "start": 2279540,
      "text": "Hey folks, thanks for listening to data stories again. Before you leave a few last notes, this show is crowdfunded and you can support us on patreon@patreon.com Datastories, where we publish monthly previews of upcoming episodes for our supporters. Or you can also send us a one time donation via PayPal at Paypal Dot Me Datastories or as a free.",
      "id": "ep_146_ut_125"
    },
    {
      "end": 2329288,
      "speaker": "Enrico Bertini",
      "start": 2302488,
      "text": "Way to support the show. If you can spend a couple of minutes rating us on iTunes, that would be very helpful as well. And here's some information on the many ways you can get news directly from us. We are on Twitter, Facebook and Instagram, so follow us there for the latest updates. We have also a slack channel where you can chat with us directly. And to sign up, go to our homepage at Datastory ES and there you'll find a button at the bottom of.",
      "id": "ep_146_ut_126"
    },
    {
      "end": 2338012,
      "speaker": "Moritz Stefaner",
      "start": 2329304,
      "text": "The page and there you can also subscribe to our email newsletter if you want to get news directly into your inbox and be notified whenever we publish a new episode.",
      "id": "ep_146_ut_127"
    },
    {
      "end": 2350708,
      "speaker": "Enrico Bertini",
      "start": 2338116,
      "text": "That's right, and we love to get in touch with our listeners. So let us know if you want to suggest a way to improve the show or know any amazing people you want us to invite or even have any project you want us to talk about.",
      "id": "ep_146_ut_128"
    },
    {
      "end": 2357414,
      "speaker": "Moritz Stefaner",
      "start": 2350844,
      "text": "Yeah, absolutely. Don't hesitate to get in touch. Just send us an email at mailatastory esdeme.",
      "id": "ep_146_ut_129"
    },
    {
      "end": 2361170,
      "speaker": "Enrico Bertini",
      "start": 2357532,
      "text": "That's all for now. Hear you next time, and thanks for listening to data stories.",
      "id": "ep_146_ut_130"
    }
  ],
  "confidence": 0.934877267970251,
  "audio_duration": 2370,
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_status_code": null,
  "webhook_auth": false,
  "webhook_auth_header_name": null,
  "speed_boost": false,
  "auto_highlights_result": null,
  "auto_highlights": false,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_audio_quality": null,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "content_safety": false,
  "iab_categories": true,
  "content_safety_labels": {
    "status": "unavailable",
    "results": [],
    "summary": {}
  },
  "language_detection": false,
  "language_detection_threshold": null,
  "language_confidence": null,
  "custom_spelling": null,
  "throttled": false,
  "auto_chapters": true,
  "summarization": false,
  "summary_type": null,
  "summary_model": null,
  "custom_topics": false,
  "topics": [],
  "speech_threshold": null,
  "speech_model": "best",
  "chapters": [
    {
      "summary": "This is a new episode of data stories. Moritz Stefaner and Enrico Bertini talk about data visualization and data analysis. Our podcast is listener supported, so there's no ads intruding in the show. If you enjoy the show, please consider supporting us with recurring payments on patreon. com.",
      "gist": "Data Stories",
      "headline": "This podcast is listener supported, so there's no ads",
      "start": 160,
      "end": 89810,
      "id": "ep_146_ch_0"
    },
    {
      "summary": "Nicholas Rougeux is a web designer by trade. He plays around with data visualizations as a hobby in his free time. He's been doing many amazing data visualization projects. Today we're going to talk about his work.",
      "gist": "Data Visualization Special Guest",
      "headline": "Nicholas Rougeux is a web designer by trade",
      "start": 89890,
      "end": 208480,
      "id": "ep_146_ch_1"
    },
    {
      "summary": "I like to create what I like to call data art. It doesn't center around any one specific topic. I like doing projects on lots of different varieties of topics. It's a cultural product, basically, and not a tool or communication product in a more narrow sense.",
      "gist": "In the Elevator With Data Art",
      "headline": "You like to create what you call data art. What do you do",
      "start": 208600,
      "end": 306830,
      "id": "ep_146_ch_2"
    },
    {
      "summary": "I basically take classic music like Pachelbel's canon and d or the 1812 overture or Vivaldi's Four Seasons classic music and I visualize every note in them. With every visual, it's not just a static visual. You can actually watch the music come to life. And I discovered looking in your website that you can actually order posters of these beautiful musical pieces.",
      "gist": "Interactive Music Visualizations",
      "headline": "Tell us a bit about some of your projects. I think the first one I noticed from you was the musical visualization",
      "start": 306950,
      "end": 565956,
      "id": "ep_146_ch_3"
    },
    {
      "summary": "Muse Score is a tool for composing sheet music for people who know how to read sheet music and compose music. It stores the data in a structured format, so it's not just like looking at a PDF of some sheet music. A lot of projects are sort of translation exercises in the sense that you take one input and transform it into another.",
      "gist": "Muse Score: The Art of Composing Music",
      "headline": "A lot of your projects are sort of translation exercises",
      "start": 566028,
      "end": 744368,
      "id": "ep_146_ch_4"
    },
    {
      "summary": "There's one called between the words that just explores the punctuation in texts. Do you have a lot of half finished projects where you tried something out but it never went anywhere? Even with any of the projects that I have released, I always try to keep every possible iteration.",
      "gist": "Dissecting the Punctuation in Text",
      "headline": "There's one called between the words that just explores the punctuation in texts",
      "start": 744424,
      "end": 1066060,
      "id": "ep_146_ch_5"
    },
    {
      "summary": "Do you actually redraw all the plants? How does it work? Well, sort of. Each image from the Internet archive, each scan, processed it in Photoshop. The project took anywhere from 30 minutes to a couple hours. But I think it was worth it in the end.",
      "gist": "Replicating the Natural Order of Plants in Photoshop",
      "headline": "Do you actually redraw all the plants? How does it work",
      "start": 1067000,
      "end": 1259218,
      "id": "ep_146_ch_6"
    },
    {
      "summary": "One thing that really strikes me about your work is how much effort you put into these last, let's say, small polishing steps. And I feel in your work, it's almost like the main activity is really to get everything done until the end.",
      "gist": "The Last Step of a Work",
      "headline": "One thing that strikes me about your work is how much effort goes into polishing",
      "start": 1259234,
      "end": 1327524,
      "id": "ep_146_ch_7"
    },
    {
      "summary": "For the Burns Euclid project, Fern wanted to recreate all the diagrams from the book. Recreating them, while it seems like a small thing, lot, many small things, had a nice impact. Do you always know when you're done?",
      "gist": "The Small Decisions Made",
      "headline": "Some small decisions can have huge impact on the outcome of a project",
      "start": 1327612,
      "end": 1633910,
      "id": "ep_146_ch_8"
    },
    {
      "summary": "I like to see what other people have done and to read about the details they put in the project. Do you think there is a way to cultivate this specific kind of mindset? What it really boils down to is finding something you're passionate about.",
      "gist": "How to Develop a Contemplative Mind",
      "headline": "Do you think there is a way to cultivate this specific kind of mindset",
      "start": 1636850,
      "end": 1739260,
      "id": "ep_146_ch_9"
    },
    {
      "summary": "Sometimes you spend an inordinate amount of time working on something and realize it wasn't worth it. But I think there's still tremendous value in spending that time on it. If nothing else, you've realized what doesn't work and perhaps you picked up some techniques that you can apply to future iterations.",
      "gist": "Have You Spent Time on a Project?",
      "headline": "Sometimes you spend an inordinate amount of time working on something and you realize it wasn't",
      "start": 1739920,
      "end": 1864280,
      "id": "ep_146_ch_10"
    },
    {
      "summary": "Nicholas is a designer who knows just enough coding to be dangerous. One of his favorite tools is Nodebox, a way to experiment with data and some sort of generative art. He also uses standard spreadsheets for experimenting with other visuals.",
      "gist": "What's In Your Toolbox?",
      "headline": "Nicholas Musore uses Nodebox to experiment with data without coding",
      "start": 1868140,
      "end": 2224494,
      "id": "ep_146_ch_11"
    },
    {
      "summary": "Nicholas: Do you have a project you're working on right now? I'm trying to do shorter ones. Let us know if you want to suggest a way to improve the show. Hear you next time, and thanks for listening to data stories.",
      "gist": "A Data Story",
      "headline": "This show is crowdfunded and you can support us on patreon",
      "start": 2224542,
      "end": 2361170,
      "id": "ep_146_ch_12"
    }
  ],
  "disfluencies": false,
  "entity_detection": false,
  "sentiment_analysis": false,
  "sentiment_analysis_results": null,
  "entities": null,
  "speakers_expected": null,
  "summary": null,
  "custom_topics_results": null,
  "episode_num": 146,
  "episode_metadata": {
    "speakers": [
      "Nicholas Rougeux",
      "Moritz Stefaner",
      "Enrico Bertini"
    ],
    "WPid": "1340",
    "url": "https://datastori.es/podlove/file/5704/s/feed/c/mp3/datastories-146.mp3",
    "episode_title": "Sweating the details with Nicholas Rougeux"
  }
}