{
  "id": "220000ab-3784-447e-95a5-849c621ca2fb",
  "language_model": "assemblyai_default",
  "acoustic_model": "assemblyai_default",
  "language_code": "en_us",
  "status": "completed",
  "audio_url": "https://datastori.es/podlove/file/130/s/feed/c/mp3/Datastories-24.mp3",
  "utterances": [
    {
      "end": 22370,
      "speaker": "Enrico Bertini",
      "start": 15600,
      "text": "Hi, everyone. Data stories number 24, if I'm correct. Hi, Moritz. How are you?",
      "id": "ep_24_ut_0"
    },
    {
      "end": 24710,
      "speaker": "Moritz Stefaner",
      "start": 22950,
      "text": "I'm good. How are you, Enrico?",
      "id": "ep_24_ut_1"
    },
    {
      "end": 30340,
      "speaker": "Enrico Bertini",
      "start": 24830,
      "text": "Good, good. Everything is fine and more relaxed than usual. Summer is coming.",
      "id": "ep_24_ut_2"
    },
    {
      "end": 33008,
      "speaker": "Moritz Stefaner",
      "start": 30760,
      "text": "You recover from my visit in New York?",
      "id": "ep_24_ut_3"
    },
    {
      "end": 43140,
      "speaker": "Enrico Bertini",
      "start": 33184,
      "text": "Did you recover from your visit? Yeah. You had to deal with a few kids in my house, right?",
      "id": "ep_24_ut_4"
    },
    {
      "end": 45024,
      "speaker": "Moritz Stefaner",
      "start": 43960,
      "text": "Yeah, it was nice.",
      "id": "ep_24_ut_5"
    },
    {
      "end": 47500,
      "speaker": "Enrico Bertini",
      "start": 45152,
      "text": "It was nice. How was IO?",
      "id": "ep_24_ut_6"
    },
    {
      "end": 56690,
      "speaker": "Moritz Stefaner",
      "start": 48040,
      "text": "IO was fantastic. Again, it's just my favorite conference. It's always so heartwarming and inspiring to be there. So I had a blast.",
      "id": "ep_24_ut_7"
    },
    {
      "end": 62610,
      "speaker": "Enrico Bertini",
      "start": 56850,
      "text": "Yeah. Have heard fantastic things about your workshops. Insect smarts.",
      "id": "ep_24_ut_8"
    },
    {
      "end": 76794,
      "speaker": "Moritz Stefaner",
      "start": 62730,
      "text": "Insect smarts, that's right. So we talked about. We worked on swarm intelligence and collective intelligence things. Yeah, it was nice. I have a few ideas of how to improve it for the next time, but it was the first time and I'm happy.",
      "id": "ep_24_ut_9"
    },
    {
      "end": 83774,
      "speaker": "Enrico Bertini",
      "start": 76922,
      "text": "Okay, cool, cool, cool. Okay, so no more trips in the summer or what?",
      "id": "ep_24_ut_10"
    },
    {
      "end": 89734,
      "speaker": "Moritz Stefaner",
      "start": 83902,
      "text": "Yeah, I mean, you know, I'm always. But nothing big lined up right now.",
      "id": "ep_24_ut_11"
    },
    {
      "end": 92278,
      "speaker": "Enrico Bertini",
      "start": 89782,
      "text": "Well, last week I was in Rio for a tour.",
      "id": "ep_24_ut_12"
    },
    {
      "end": 92854,
      "speaker": "Moritz Stefaner",
      "start": 92334,
      "text": "Fantastic.",
      "id": "ep_24_ut_13"
    },
    {
      "end": 95326,
      "speaker": "Enrico Bertini",
      "start": 92902,
      "text": "That was amazing. Amazing place.",
      "id": "ep_24_ut_14"
    },
    {
      "end": 97126,
      "speaker": "Moritz Stefaner",
      "start": 95478,
      "text": "They never invited me to Rio.",
      "id": "ep_24_ut_15"
    },
    {
      "end": 143368,
      "speaker": "Enrico Bertini",
      "start": 97278,
      "text": "Well, you know, it was fantastic. Really, really fantastic. I spent five, five or six days there. It was amazing. Amazing place. Now I want to go back there in winter, you said. Well, okay, let's start. So we have another special episode. Today we are going to talk about the vast challenge, which is a very special challenge and we will tell you why it is special. It is organized every year at the this conference, formerly known as Visweek Conference. And in order to discuss about that, we invited two special guests. We have Professor George Greenstein from University of Massachusetts Lowell. Hi George.",
      "id": "ep_24_ut_16"
    },
    {
      "end": 144656,
      "speaker": "Georges Grinstein",
      "start": 143544,
      "text": "Hi Enrico.",
      "id": "ep_24_ut_17"
    },
    {
      "end": 149376,
      "speaker": "Enrico Bertini",
      "start": 144728,
      "text": "And we have Celeste Paul from National Security Agency. Hi Celeste, how are you?",
      "id": "ep_24_ut_18"
    },
    {
      "end": 151260,
      "speaker": "Celste Paul",
      "start": 149408,
      "text": "Hello. I'm good.",
      "id": "ep_24_ut_19"
    },
    {
      "end": 158900,
      "speaker": "Enrico Bertini",
      "start": 151600,
      "text": "So what we normally do, we let our guests introduce themselves. So maybe. George, you want to start? And then Celeste.",
      "id": "ep_24_ut_20"
    },
    {
      "end": 215350,
      "speaker": "Georges Grinstein",
      "start": 159360,
      "text": "Sure. I'm a professor of computer science at UMass Lowell and I head the Institute for Visualization and Perception Research. I got my PhD in mathematics from University of Rochester. Most of my work centers around visualization, whether it's perceptual and cognitive foundations, high dimensional data theory and applications. For the last eight years I've co chaired the IEEE vast challenges and contest in visual analytics. I've taught radical design, of course on how to develop radical new products instead of evolutionary one. I'm a member of the Homeland Security Center Cicada, and I direct the development of Weave which is an open source, web based interactive collaborative visual analytics system which incorporates lots of modern research.",
      "id": "ep_24_ut_21"
    },
    {
      "end": 220522,
      "speaker": "Enrico Bertini",
      "start": 216330,
      "text": "I guess you could go on for another 30 minutes, George, perhaps.",
      "id": "ep_24_ut_22"
    },
    {
      "end": 221430,
      "speaker": "Georges Grinstein",
      "start": 220626,
      "text": "Perhaps.",
      "id": "ep_24_ut_23"
    },
    {
      "end": 226110,
      "speaker": "Enrico Bertini",
      "start": 222170,
      "text": "I'm so happy to have an academic again on the show. It's been a while more.",
      "id": "ep_24_ut_24"
    },
    {
      "end": 227682,
      "speaker": "Georges Grinstein",
      "start": 226850,
      "text": "That's true.",
      "id": "ep_24_ut_25"
    },
    {
      "end": 228346,
      "speaker": "Enrico Bertini",
      "start": 227786,
      "text": "That's true.",
      "id": "ep_24_ut_26"
    },
    {
      "end": 231906,
      "speaker": "Moritz Stefaner",
      "start": 228418,
      "text": "No, that sounds really exciting of what you're working on. I need to check that out.",
      "id": "ep_24_ut_27"
    },
    {
      "end": 234070,
      "speaker": "Enrico Bertini",
      "start": 232018,
      "text": "Yeah. And Celeste.",
      "id": "ep_24_ut_28"
    },
    {
      "end": 258362,
      "speaker": "Celste Paul",
      "start": 234410,
      "text": "Hi, my name is Celeste Lynn Paul, and I'm a computer scientist at the National Security Agency and the Research directorate. And I do research on visual analytics with a focus in human centered computing and cybersecurity. We are a funder for the vast challenge. I'm also about four weeks away from defending my dissertation at the University of Maryland, Baltimore county. So.",
      "id": "ep_24_ut_29"
    },
    {
      "end": 258994,
      "speaker": "Georges Grinstein",
      "start": 258466,
      "text": "Awesome.",
      "id": "ep_24_ut_30"
    },
    {
      "end": 267550,
      "speaker": "Enrico Bertini",
      "start": 259082,
      "text": "Awesome. Sounds great. And I guess it's a thesis on visual analytics, I guess, right?",
      "id": "ep_24_ut_31"
    },
    {
      "end": 282874,
      "speaker": "Celste Paul",
      "start": 268050,
      "text": "Actually, no, it's more focused on human centered computing. It's actually on interruption management and with visual interruptions. So it is visualization in a sense, not analytics.",
      "id": "ep_24_ut_32"
    },
    {
      "end": 364640,
      "speaker": "Enrico Bertini",
      "start": 283002,
      "text": "Okay. But it's very much related. Yes. Fantastic. So we have a whole display of academics today. Fantastic. I'm excited. Okay, so we want to talk about the vast challenge, because the vast challenge is so, there are many contests and challenges around, and I have myself always been championing for the vast challenge because to me, it looks like, kind of like a little different than. Than the usual stuff we see around. And I think the main difference is that it's mainly organized by academics. And as far as I know, it's the only contest or challenge in this area that has been organized by academics. And there are also some other details that make it really interesting to me, especially the fact that the organizer spends quite a lot of time thinking about how to make the vast challenges, how to evaluate the entries that are submitted to the vast challenge, which is not easy at all. So I would actually like to start with George. George, can you give us a little bit of perspective on how the vast challenge was born and how it developed in time, why you organized it in the first place? So a little bit of an historical perspective.",
      "id": "ep_24_ut_33"
    },
    {
      "end": 506650,
      "speaker": "Georges Grinstein",
      "start": 364940,
      "text": "Sure. It actually started in 2006. And prior to that, there had been other the challenges. I ran network intrusion, one about a decade before. The infovis community had a challenge at that time that I was co chairing with Catherine Plaison and Jean Danyel Fecate, and the KDD cup. The knowledge discovery and data mining cup was also running at the time, but there was no theme in the evolution of these in general, except to build a challenge test. And there were a lot of issues about the fact that we needed a broader analytical perspective on these problems. We wanted to somehow be able to measure eventually the capabilities of visual systems, as well as analysis, as well as insight into the problems. So Jim Thomas was the original founder and program manager at, and he gave basically instructions to the team. The data has to be heterogeneous. Ideally, the problem and data should be difficult for a team to solve without tools, so that somebody couldn't read the data and sort of say, ah, I come up with a solution and it really ought to involve the human in the loop, human analysis aided by tools. So that sort of says that, aha, we have to start having visual analytics. And how could you make an evaluation without ground truth? So the goal is to embed ground truth in these synthetic or quasi real data sets. And that's how it started, and we evolved a great deal. PNNL were the initial developers of the first data sets. Then UMass Lowell got involved, and for these last couple years, PNNL became again with the various funders, NSA and others, enrichers of the ground truth within larger and more complex data sets.",
      "id": "ep_24_ut_34"
    },
    {
      "end": 541584,
      "speaker": "Enrico Bertini",
      "start": 507110,
      "text": "Okay, so, yeah, this is exactly what I wanted to mention. It looks to me that the special thing about the vast challenge is searching for having this ground truth. Right. I don't know what's the situation, how you evaluate the entries right now, but I think I remember from the very beginning that this was the main goal of the challenge, was having a way to evaluate the entries in relationship to how much of the ground truth is covered by the entry. Right? Is that correct?",
      "id": "ep_24_ut_35"
    },
    {
      "end": 595842,
      "speaker": "Georges Grinstein",
      "start": 541712,
      "text": "That's part of it. The other part was to select problems that are difficult and that we would like the community to be aware of. So we were one of the first data sets. We generated one of the first data sets with text as part of our first challenge, where people had to analyze news reports, voter registration, phone call logs. And at the time, I remember that many people didn't even know how to tokenize data, so we actually generated a tokenized database for people who didn't know how to do that. Now, when we have text data, there's no such need for us to generate intermediary datasets because everyone has those capabilities. So you can see the rapid evolution of technology, and I think in some fashion, the vast challenge has contributed to making people aware of that.",
      "id": "ep_24_ut_36"
    },
    {
      "end": 661020,
      "speaker": "Enrico Bertini",
      "start": 595946,
      "text": "Sure, sure. Another thing I was wondering, did you take inspiration from some other kind of, like computer science based challenges, like the KDD cup or similar kind of challenges? Because so what I. I was always frustrated by the fact that for other disciplines in computer science, it looks to me that it's somewhat easier to define what's the metric there, and also to calculate the metric itself. So if you have some sort of analytical algorithm that has to have some kind of predictive power, then you can very well, you can establish a couple of measures and compare the entries in a very systematic way. But in visualization, or visual analytics is much, much harder because the output is stuff that is coming out of the brain of people. Right. And everything gets much more complicated. So I was wondering, did you, did you, what's the initial motivation of the vast challenge doing, organizing the vast challenge in this format? Did you get inspiration from this kind of other challenges, like the KDD cup or similar?",
      "id": "ep_24_ut_37"
    },
    {
      "end": 738164,
      "speaker": "Georges Grinstein",
      "start": 661400,
      "text": "Yes, there was trek the text information retrieval one and so on. There were many. The difference is that these were specific problems that could be solved either algorithmically or visually. I think what we did is we made a drastic move to identify a scenario, and that is very different. So we spent months ahead of time identifying what the scenario is and building a data set that matches, or data sets that matches that scenario so that the problem looks real. If you look at every single challenge that's been out there, there's a story, and that's a very different aspect. So we initially identify what is the target research problem that we want to focus on. And sometimes we offer one or two or four, and then we combine a scenario that connects them so that you can solve a particular problem or combine it with different aspects, one of which might have video, another one text, and another one logs from network intrusions, for example.",
      "id": "ep_24_ut_38"
    },
    {
      "end": 739724,
      "speaker": "Enrico Bertini",
      "start": 738292,
      "text": "Okay. Okay.",
      "id": "ep_24_ut_39"
    },
    {
      "end": 745204,
      "speaker": "Moritz Stefaner",
      "start": 739892,
      "text": "It's very interesting. It's almost like writing a movie script or something, like coming up with a whole situation, and then.",
      "id": "ep_24_ut_40"
    },
    {
      "end": 745996,
      "speaker": "Georges Grinstein",
      "start": 745252,
      "text": "That's correct.",
      "id": "ep_24_ut_41"
    },
    {
      "end": 748492,
      "speaker": "Moritz Stefaner",
      "start": 746108,
      "text": "The data, that's what we really do.",
      "id": "ep_24_ut_42"
    },
    {
      "end": 753090,
      "speaker": "Celste Paul",
      "start": 748516,
      "text": "Sit around a table and talk about the story before we think about the data at all.",
      "id": "ep_24_ut_43"
    },
    {
      "end": 761414,
      "speaker": "Moritz Stefaner",
      "start": 753260,
      "text": "Do you have rooms, like, covered with stickies and lines between them, like the mad scientists we did here?",
      "id": "ep_24_ut_44"
    },
    {
      "end": 765134,
      "speaker": "Georges Grinstein",
      "start": 761462,
      "text": "Yes. And I think. And I think PNNL also does at times.",
      "id": "ep_24_ut_45"
    },
    {
      "end": 773646,
      "speaker": "Moritz Stefaner",
      "start": 765262,
      "text": "I can imagine, yeah. Can you estimate how much time goes into constructing these datasets? I could imagine must be like hundreds of hours, right?",
      "id": "ep_24_ut_46"
    },
    {
      "end": 776262,
      "speaker": "Georges Grinstein",
      "start": 773798,
      "text": "Oh, I would suspect even much, much more than that.",
      "id": "ep_24_ut_47"
    },
    {
      "end": 876970,
      "speaker": "Celste Paul",
      "start": 776326,
      "text": "Oh, yeah. So, for example, with this year's mini challenge three, it is two weeks worth of data. And so we generated that data in real time. So the final data set took at least two weeks to generate. But then we also did several test runs, and sometimes the test runs were only a couple hours or a couple days, but then we were getting into, you know, we need to generate the entire week, two weeks, because we were running into problems where a couple hours or a couple days of data generation, that's fine, that's normal. Two weeks worth of data generation for the detailed data that we were trying to create, we ran into a lot of problems. And so there are many, many, many iterations of us testing our tools, testing data sets, doing test runs, in addition to all of the data structure, planning that we had, setting up the simulations and that sort of thing, generating the data has definitely been an interesting challenge. We choose these challenges because we want to test the research community and give them something that is meaningful and is a little bit further out than what we're comfortable with. But in order to generate data sets that we can actually generate reasonably and have some set of ground truth in, we need tools to be able to verify our data, but those tools don't exist yet. And so it's a lot of iteration, it's a lot of manual analysis to check to make sure that the data is what we think is, and then we can give it to people.",
      "id": "ep_24_ut_48"
    },
    {
      "end": 916886,
      "speaker": "Georges Grinstein",
      "start": 877550,
      "text": "And let me add that in some cases, like one of the virus mutations that occurred in the past, and one of the challenges, we generate the data set, and then we test it out. Just like Celeste pointed out, we find flaws, so we have to regenerate. And then if the mini challenges are integrated into a larger story, you often have to change it because all of a sudden, it doesn't connect with the previous one or the one that's talking about text. And all of a sudden, we have to do modifications and regeneration. So it's an ongoing process all the time.",
      "id": "ep_24_ut_49"
    },
    {
      "end": 953862,
      "speaker": "Celste Paul",
      "start": 917008,
      "text": "Yeah, these are very complex data sets. We're not just generating one type of log with one type of events. We're trying to coordinate sometimes four or five different data sets so that they match up together in addition to, you know, regular noise and reality. So that these aren't purely computer generated data sets, because if you have a too artificial of a data set, it's not really a challenge anymore. But we can't. We need to. It's been such a challenge, especially with this last challenge. So last year, people just asked where.",
      "id": "ep_24_ut_50"
    },
    {
      "end": 956110,
      "speaker": "Moritz Stefaner",
      "start": 953886,
      "text": "We were setting up the thing.",
      "id": "ep_24_ut_51"
    },
    {
      "end": 971070,
      "speaker": "Georges Grinstein",
      "start": 956270,
      "text": "Well, yeah, we have an extremely humorous story to tell about the tweeter data that we had last year. We were generating flu data. And was it last year or the year?",
      "id": "ep_24_ut_52"
    },
    {
      "end": 972642,
      "speaker": "Celste Paul",
      "start": 971150,
      "text": "It was 2011.",
      "id": "ep_24_ut_53"
    },
    {
      "end": 1027530,
      "speaker": "Georges Grinstein",
      "start": 972766,
      "text": "Yeah. So it was two years ago. And we took tweet data to try to analyze flu, you know, pick ones that had flu in it and so on. And, my God, they had to be sanitized. And so we wrote programs to clean the data up. And even after we had run all those programs, I had to divide my whole lab and give everyone 1000 of them to go by hand, because the, the programs that we had written just didn't at all clean them completely. And another time we used text from old newspapers and we had to go through and change dates and names, and we all, of course, made errors. One of the first data sets we generated, we had voter registrations. And without realizing it, we had forgotten that we had one individual register newly every day. And so the dates for registrations were consecutive.",
      "id": "ep_24_ut_54"
    },
    {
      "end": 1029042,
      "speaker": "Enrico Bertini",
      "start": 1028010,
      "text": "It's amazing.",
      "id": "ep_24_ut_55"
    },
    {
      "end": 1033670,
      "speaker": "Georges Grinstein",
      "start": 1029106,
      "text": "I mean, it's just, you can't cover every single thing. It's very, very interesting.",
      "id": "ep_24_ut_56"
    },
    {
      "end": 1042990,
      "speaker": "Enrico Bertini",
      "start": 1034450,
      "text": "So I guess that the tools that are available around just cannot support this kind of deep analysis. Right.",
      "id": "ep_24_ut_57"
    },
    {
      "end": 1076742,
      "speaker": "Georges Grinstein",
      "start": 1044170,
      "text": "In general, they're not quite there. If they were, then we'd be able to generate data. Also by reversing those tools, reverse engineering them. In general, it's much, much harder. Think about video recognition, automatic video recognition. The tools are there in terms of video minute. Well, were in the past there in terms of minimal. But any complex problem required people to still have the human in the loop to be able to solve problems. And I think we still believe that complex problems require humans.",
      "id": "ep_24_ut_58"
    },
    {
      "end": 1091690,
      "speaker": "Enrico Bertini",
      "start": 1076806,
      "text": "Sure, sure. So can you, can you clarify to us what, what do you mean exactly when you say generate the data? So are you starting from, from some real data sets and manipulating them, or it's all synthetic data?",
      "id": "ep_24_ut_59"
    },
    {
      "end": 1092694,
      "speaker": "Georges Grinstein",
      "start": 1092070,
      "text": "Both.",
      "id": "ep_24_ut_60"
    },
    {
      "end": 1094718,
      "speaker": "Enrico Bertini",
      "start": 1092822,
      "text": "Both, yeah.",
      "id": "ep_24_ut_61"
    },
    {
      "end": 1098406,
      "speaker": "Celste Paul",
      "start": 1094814,
      "text": "It's a hybrid approach. So I can give an example.",
      "id": "ep_24_ut_62"
    },
    {
      "end": 1099894,
      "speaker": "Enrico Bertini",
      "start": 1098478,
      "text": "Yeah, I think an example of security.",
      "id": "ep_24_ut_63"
    },
    {
      "end": 1163656,
      "speaker": "Celste Paul",
      "start": 1099982,
      "text": "Data that we're using this year and for the past few years. So it's all synthetic data in the sense that it's not coming from the real world. We generate every bit. However, we do set up virtual networks to generate the data. So there are actual machines, virtually like a cloud cluster, going out and running services and doing things. So for example, if we have a virus propagating through a network, the virus is actually moving through the virtual network and infecting machines and generating certain types of data. And then we have sensors on the network that are typical commercial tools that are picking up the packets and picking up the logs. And that's what we provide to participants. We don't manually insert data, we don't generically create records and then, you know, put them in the data. This is all part of a live network. It's just that we create the conditions for the network.",
      "id": "ep_24_ut_64"
    },
    {
      "end": 1166512,
      "speaker": "Enrico Bertini",
      "start": 1163808,
      "text": "Okay, so you basically simulate it, right?",
      "id": "ep_24_ut_65"
    },
    {
      "end": 1167664,
      "speaker": "Celste Paul",
      "start": 1166576,
      "text": "Yes, yes.",
      "id": "ep_24_ut_66"
    },
    {
      "end": 1181712,
      "speaker": "Enrico Bertini",
      "start": 1167752,
      "text": "And is that true for every other mini challenge or. No, no. Okay. Okay. Do I remember correctly, George, that you also had one challenge included some video analysis, as you mentioned before?",
      "id": "ep_24_ut_67"
    },
    {
      "end": 1182128,
      "speaker": "Georges Grinstein",
      "start": 1181816,
      "text": "Yes.",
      "id": "ep_24_ut_68"
    },
    {
      "end": 1187540,
      "speaker": "Enrico Bertini",
      "start": 1182184,
      "text": "Did you want to go around with a camera and record yourself or stuff like that?",
      "id": "ep_24_ut_69"
    },
    {
      "end": 1242050,
      "speaker": "Georges Grinstein",
      "start": 1188240,
      "text": "That one was actually quite interesting. That was a camera outside a building that was called an embassy, rotating regularly and just collecting hours and hours of data. And we actually had two individuals in there walk and meet and exchange briefcases. And that was the anomalous event that we wanted people to identify automatically. Okay. So there was the, in this particular case, an injection of real data, the two people walking exchange within non synthetic, because it was real video that was being done. So that's what I meant by in some cases, there's purely real data where you embed something all the way to purely synthetic, where you simulate and model in a situation occurring.",
      "id": "ep_24_ut_70"
    },
    {
      "end": 1244934,
      "speaker": "Enrico Bertini",
      "start": 1242790,
      "text": "Okay, okay.",
      "id": "ep_24_ut_71"
    },
    {
      "end": 1260022,
      "speaker": "Georges Grinstein",
      "start": 1245062,
      "text": "Which, by the way, if you think about it, makes the evaluation process much, much more complex, because you could find something that we did not intend to be discovered that might be naturally in the data.",
      "id": "ep_24_ut_72"
    },
    {
      "end": 1278724,
      "speaker": "Celste Paul",
      "start": 1260126,
      "text": "Yes. This is especially true in the network simulation data, because they're actual virtual computers on the network. We could have induced a event that we didn't intend, and if people find it, that's valid and they get credit for that in our scoring.",
      "id": "ep_24_ut_73"
    },
    {
      "end": 1301824,
      "speaker": "Enrico Bertini",
      "start": 1278862,
      "text": "Sure, sure. So all of a sudden, it came into my mind that the same thing could actually be done by. Well, probably it's very hard, but it could be done by everyone, right? I mean, if I think of trying to do the same thing as you did, once I know the rules, I could generate my own data set and post it online and create my own challenge, right?",
      "id": "ep_24_ut_74"
    },
    {
      "end": 1305980,
      "speaker": "Georges Grinstein",
      "start": 1301992,
      "text": "That's correct. And make sure you have a whole year plan for your time.",
      "id": "ep_24_ut_75"
    },
    {
      "end": 1312324,
      "speaker": "Celste Paul",
      "start": 1307760,
      "text": "If it were simple, we'd have lots of high quality data sets to do research with.",
      "id": "ep_24_ut_76"
    },
    {
      "end": 1355604,
      "speaker": "Georges Grinstein",
      "start": 1312492,
      "text": "I mean, I can tell you that we took one mini challenge in 2011, and we had a lot of tools because we had been working with PNNL for a long time, and we built our own tools, and it took easily five to six months of three students of mine to work in great detail, making sure the data set is correct and so on. It's just a really large effort if you want quality. And the data sets we generate, we expect that they will be used for many, many, many years by classes and other researchers and companies to do some good, interesting evaluations.",
      "id": "ep_24_ut_77"
    },
    {
      "end": 1374130,
      "speaker": "Celste Paul",
      "start": 1355692,
      "text": "Yes. I mean, that brings up a great contribution of the challenge outside the, you know, the single year cycle, where we provide an interesting, relevant problem to the research community. These are very high quality data sets that many of them have already shown up in publications not related to the challenge.",
      "id": "ep_24_ut_78"
    },
    {
      "end": 1377774,
      "speaker": "Enrico Bertini",
      "start": 1374670,
      "text": "Okay, well, that sounds really benchmark data.",
      "id": "ep_24_ut_79"
    },
    {
      "end": 1383934,
      "speaker": "Moritz Stefaner",
      "start": 1377822,
      "text": "Sets where you know what you can pull out of them and you can really compare well, what different tools deliver, right?",
      "id": "ep_24_ut_80"
    },
    {
      "end": 1389046,
      "speaker": "Georges Grinstein",
      "start": 1384062,
      "text": "That's correct. And in fact, that's what we call them, the benchmark. The vast benchmark data sets.",
      "id": "ep_24_ut_81"
    },
    {
      "end": 1392526,
      "speaker": "Enrico Bertini",
      "start": 1389198,
      "text": "Okay, so are all the data sets available somewhere online?",
      "id": "ep_24_ut_82"
    },
    {
      "end": 1393410,
      "speaker": "Georges Grinstein",
      "start": 1392678,
      "text": "Yes.",
      "id": "ep_24_ut_83"
    },
    {
      "end": 1394850,
      "speaker": "Enrico Bertini",
      "start": 1393950,
      "text": "Okay.",
      "id": "ep_24_ut_84"
    },
    {
      "end": 1399378,
      "speaker": "Moritz Stefaner",
      "start": 1395250,
      "text": "And you could go back, download the past datasets and also see the solutions.",
      "id": "ep_24_ut_85"
    },
    {
      "end": 1404450,
      "speaker": "Georges Grinstein",
      "start": 1399514,
      "text": "Yes. And the people's papers and videos? Everything is available.",
      "id": "ep_24_ut_86"
    },
    {
      "end": 1410178,
      "speaker": "Enrico Bertini",
      "start": 1404570,
      "text": "So is there a specific link we can mention so people can go there and see how it looks like?",
      "id": "ep_24_ut_87"
    },
    {
      "end": 1413270,
      "speaker": "Georges Grinstein",
      "start": 1410314,
      "text": "Yes. You're putting me on the spot.",
      "id": "ep_24_ut_88"
    },
    {
      "end": 1420322,
      "speaker": "Enrico Bertini",
      "start": 1416210,
      "text": "Okay, I will add it on the, on the blog post. If you can send me a link later.",
      "id": "ep_24_ut_89"
    },
    {
      "end": 1422458,
      "speaker": "Moritz Stefaner",
      "start": 1420386,
      "text": "I think nobody will type in the ULA.",
      "id": "ep_24_ut_90"
    },
    {
      "end": 1433398,
      "speaker": "Celste Paul",
      "start": 1422554,
      "text": "The current challenges are on the visual, the VA community website, and the older challenges are hosted by University of Maryland.",
      "id": "ep_24_ut_91"
    },
    {
      "end": 1444102,
      "speaker": "Georges Grinstein",
      "start": 1433454,
      "text": "The human computer interaction lab. Yes. And if you search for visual analytics benchmarks or vast benchmarks, they all lead you to where they are.",
      "id": "ep_24_ut_92"
    },
    {
      "end": 1445582,
      "speaker": "Celste Paul",
      "start": 1444166,
      "text": "Yeah, we can get you the link.",
      "id": "ep_24_ut_93"
    },
    {
      "end": 1451030,
      "speaker": "Enrico Bertini",
      "start": 1445726,
      "text": "Okay. So you can get the data sets and also the solutions if you want.",
      "id": "ep_24_ut_94"
    },
    {
      "end": 1451246,
      "speaker": "Georges Grinstein",
      "start": 1451070,
      "text": "Yes.",
      "id": "ep_24_ut_95"
    },
    {
      "end": 1453834,
      "speaker": "Celste Paul",
      "start": 1451278,
      "text": "The challenge problems and the solutions and.",
      "id": "ep_24_ut_96"
    },
    {
      "end": 1460378,
      "speaker": "Georges Grinstein",
      "start": 1453922,
      "text": "Everyone'S entries, including their briefs, their two pager or more, and their videos.",
      "id": "ep_24_ut_97"
    },
    {
      "end": 1468202,
      "speaker": "Enrico Bertini",
      "start": 1460474,
      "text": "Okay, so other than actively participating to the vast challenge, people can just go there and have fun with these data sets, right?",
      "id": "ep_24_ut_98"
    },
    {
      "end": 1468970,
      "speaker": "Georges Grinstein",
      "start": 1468306,
      "text": "Yes.",
      "id": "ep_24_ut_99"
    },
    {
      "end": 1470074,
      "speaker": "Enrico Bertini",
      "start": 1469130,
      "text": "Fantastic.",
      "id": "ep_24_ut_100"
    },
    {
      "end": 1475562,
      "speaker": "Moritz Stefaner",
      "start": 1470202,
      "text": "Could be nice for teaching as well, you know, if you have a course and just present five different solutions to.",
      "id": "ep_24_ut_101"
    },
    {
      "end": 1490030,
      "speaker": "Celste Paul",
      "start": 1475586,
      "text": "The same data set class submission. So last year, I forget the professor's name, but he has several. Yes. Oh, okay.",
      "id": "ep_24_ut_102"
    },
    {
      "end": 1498790,
      "speaker": "Enrico Bertini",
      "start": 1491410,
      "text": "I think there are several professors who are using the vast challenge datasets. I used them myself.",
      "id": "ep_24_ut_103"
    },
    {
      "end": 1507870,
      "speaker": "Celste Paul",
      "start": 1499570,
      "text": "Yeah, the Universidad de federal in Brazil. I think we had three or four student team submissions from them as well.",
      "id": "ep_24_ut_104"
    },
    {
      "end": 1522650,
      "speaker": "Enrico Bertini",
      "start": 1508270,
      "text": "Okay, and do you also have the entries that people sent in the vast challenge of the last editions on the website? So can people access them as well?",
      "id": "ep_24_ut_105"
    },
    {
      "end": 1527806,
      "speaker": "Georges Grinstein",
      "start": 1523390,
      "text": "I'm not sure what you mean. In other words, anyone who submitted something, the answer is yes.",
      "id": "ep_24_ut_106"
    },
    {
      "end": 1537170,
      "speaker": "Enrico Bertini",
      "start": 1527878,
      "text": "Do you have, for the past editions, do you also have the solutions? Not the solutions, the entries online. I mean the solutions that people sent.",
      "id": "ep_24_ut_107"
    },
    {
      "end": 1537810,
      "speaker": "Georges Grinstein",
      "start": 1537330,
      "text": "Yes.",
      "id": "ep_24_ut_108"
    },
    {
      "end": 1541578,
      "speaker": "Enrico Bertini",
      "start": 1537890,
      "text": "Okay. So people can go there and also see what the others have done.",
      "id": "ep_24_ut_109"
    },
    {
      "end": 1548106,
      "speaker": "Georges Grinstein",
      "start": 1541714,
      "text": "That's right. There were some days sometimes where we had 60 or 80 entries and you could actually go there and see them all.",
      "id": "ep_24_ut_110"
    },
    {
      "end": 1572670,
      "speaker": "Enrico Bertini",
      "start": 1548218,
      "text": "Okay, cool. Fantastic. So why don't we talk about the vast challenge 2013 I mean, I think most people will be interested in hearing what they can do there, how to participate, why to participate, or stuff like that. Can you give us a brief introduction to the, to the vast challenge 2013 and what kind of mini challenges you have there this year?",
      "id": "ep_24_ut_111"
    },
    {
      "end": 1573598,
      "speaker": "Georges Grinstein",
      "start": 1572830,
      "text": "Celeste?",
      "id": "ep_24_ut_112"
    },
    {
      "end": 1591648,
      "speaker": "Celste Paul",
      "start": 1573694,
      "text": "Sure. So this year we have three challenges. One is more predictive, analytic visual analytics, and the other two are cybersecurity related. George, do you want to talk about the predictive analytics challenge?",
      "id": "ep_24_ut_113"
    },
    {
      "end": 1628700,
      "speaker": "Georges Grinstein",
      "start": 1591784,
      "text": "Sure. The concept is very simple. You have movies that are coming out every week, and the idea is simply, can you predict which one is going to make the most money, or can you predict how much they're going to make? What can you predict about them? And this is actually an interesting problem because we're running it every two weeks, so people can continually participate. So guess the box office gross of all the new movies. And the data comes from Twitter, Bitly, and the IMDb, the movie database.",
      "id": "ep_24_ut_114"
    },
    {
      "end": 1631772,
      "speaker": "Enrico Bertini",
      "start": 1628820,
      "text": "So this is not synthetic data. That's real data?",
      "id": "ep_24_ut_115"
    },
    {
      "end": 1632668,
      "speaker": "Georges Grinstein",
      "start": 1631956,
      "text": "That's right.",
      "id": "ep_24_ut_116"
    },
    {
      "end": 1634836,
      "speaker": "Enrico Bertini",
      "start": 1632764,
      "text": "Oh, cool. So that's new.",
      "id": "ep_24_ut_117"
    },
    {
      "end": 1635548,
      "speaker": "Celste Paul",
      "start": 1635028,
      "text": "Yes.",
      "id": "ep_24_ut_118"
    },
    {
      "end": 1637028,
      "speaker": "Enrico Bertini",
      "start": 1635644,
      "text": "You never did that before?",
      "id": "ep_24_ut_119"
    },
    {
      "end": 1638720,
      "speaker": "Georges Grinstein",
      "start": 1637204,
      "text": "We've never done that before.",
      "id": "ep_24_ut_120"
    },
    {
      "end": 1649130,
      "speaker": "Moritz Stefaner",
      "start": 1639260,
      "text": "And how does it work? So you collect data on these movies for two weeks, and then the data set is out, and then people can, like, quickly analyze it or how does it work?",
      "id": "ep_24_ut_121"
    },
    {
      "end": 1651230,
      "speaker": "Georges Grinstein",
      "start": 1650310,
      "text": "Go ahead, Celeste.",
      "id": "ep_24_ut_122"
    },
    {
      "end": 1671130,
      "speaker": "Celste Paul",
      "start": 1651270,
      "text": "Oh. So the challenge has been running for the past six months, and so in the first round, they provided some sample data or training datasets, but the rest of the data sets have been live challenges, and people have been using each round of the challenge to refine their analytics.",
      "id": "ep_24_ut_123"
    },
    {
      "end": 1673192,
      "speaker": "Enrico Bertini",
      "start": 1672280,
      "text": "Okay.",
      "id": "ep_24_ut_124"
    },
    {
      "end": 1673760,
      "speaker": "Moritz Stefaner",
      "start": 1673336,
      "text": "Okay.",
      "id": "ep_24_ut_125"
    },
    {
      "end": 1676072,
      "speaker": "Georges Grinstein",
      "start": 1673800,
      "text": "It started in January, so they have.",
      "id": "ep_24_ut_126"
    },
    {
      "end": 1682760,
      "speaker": "Enrico Bertini",
      "start": 1676096,
      "text": "To predict which movie will be more most successful among those that are coming out that week.",
      "id": "ep_24_ut_127"
    },
    {
      "end": 1686136,
      "speaker": "Georges Grinstein",
      "start": 1682920,
      "text": "Actually, they predict the dollars of all. Yes, the dollars.",
      "id": "ep_24_ut_128"
    },
    {
      "end": 1701736,
      "speaker": "Enrico Bertini",
      "start": 1686288,
      "text": "Okay. This sounds interesting to me because it looks like the kind of stuff that you could approach completely. You can use a only algorithmic approach. Right. Without any, any visual or human interaction. Right.",
      "id": "ep_24_ut_129"
    },
    {
      "end": 1715060,
      "speaker": "Moritz Stefaner",
      "start": 1701888,
      "text": "You could also use external data, like, I don't know, have like ten movie critics and factor in their reviews, stuff like that. Would that be allowed, or is it. Do you have to use the data provided?",
      "id": "ep_24_ut_130"
    },
    {
      "end": 1725376,
      "speaker": "Celste Paul",
      "start": 1716560,
      "text": "I think that the data. You have to use the data provided. You can't use external sources. That's mostly to make it easier for us to judge.",
      "id": "ep_24_ut_131"
    },
    {
      "end": 1726140,
      "speaker": "Moritz Stefaner",
      "start": 1725488,
      "text": "Sure.",
      "id": "ep_24_ut_132"
    },
    {
      "end": 1731336,
      "speaker": "Georges Grinstein",
      "start": 1726760,
      "text": "Right. And they've been close to 100 registrants, just to give you a sense of it. Okay.",
      "id": "ep_24_ut_133"
    },
    {
      "end": 1731952,
      "speaker": "Enrico Bertini",
      "start": 1731408,
      "text": "Wow.",
      "id": "ep_24_ut_134"
    },
    {
      "end": 1733900,
      "speaker": "Georges Grinstein",
      "start": 1732096,
      "text": "And a lot of student teams.",
      "id": "ep_24_ut_135"
    },
    {
      "end": 1743340,
      "speaker": "Enrico Bertini",
      "start": 1734360,
      "text": "So are all the participants using a visual analytics approach or some of them are submitting purely algorithmic solutions.",
      "id": "ep_24_ut_136"
    },
    {
      "end": 1772500,
      "speaker": "Celste Paul",
      "start": 1745040,
      "text": "It's a visual analytics challenge. And so in order to get full points, they have to show how they created or designed visualizations to support the analysis for predicting these things. Because you're right, this is also a very algorithmic problem. And what we wanted to explore was how you could use visual analytics to supplement or even provide additional or better predictive analytics.",
      "id": "ep_24_ut_137"
    },
    {
      "end": 1780660,
      "speaker": "Enrico Bertini",
      "start": 1773280,
      "text": "Okay, so are there people comparing the purely algorithmic approach to the algorithmic approach plus visualization?",
      "id": "ep_24_ut_138"
    },
    {
      "end": 1788326,
      "speaker": "Georges Grinstein",
      "start": 1783110,
      "text": "I don't think so yet. I don't think that was one of the requests.",
      "id": "ep_24_ut_139"
    },
    {
      "end": 1796502,
      "speaker": "Enrico Bertini",
      "start": 1788438,
      "text": "Okay, that would be interesting. Okay, so we have two other challenges.",
      "id": "ep_24_ut_140"
    },
    {
      "end": 1929730,
      "speaker": "Celste Paul",
      "start": 1796686,
      "text": "One is new and one is a continuation of a theme. I'll start with a new one. So visualization tends to focus a lot on the data and the analytics, and then we use visualization in order to reveal what is in the data or whatever the analytics reveal in the data. And so this is a very traditional process whenever it comes to visualization. But it also seems like we've been going down the same path for a long time, and there haven't been too many really innovative or different visualizations that have come out recently. And so we wanted to create a challenge that would inspire people to think differently about the problem from a design perspective and focus more on the human part of the visualization problem than the data and the processing part of the visualization problem. We also wanted to engage more designers and artists who have a lot of creative experience to participate in our community so that we can start matching the technically competent visualization engineers with the highly creative visual artists. And so with the design challenge, we provide a written scenario. It's a two page story that describes the life of a typical network operations manager. And we tell them about some of the problems that she has, and we simply state, we need you to come up with a situation awareness visualization that will help her do her job. The network she works on is very large, it's very complex, and there are many things that happen on it, but we don't tell you how large the network is. We don't tell you anything about the complexity of the network or the events on it. We didn't want to create any type of constraints. We wanted people to go out and think of something crazy and bring it back into the realm of visualization. So it's a very new type of challenge, especially for a very computer science oriented community. But with some other activities that we've done, we've gotten some very interesting results.",
      "id": "ep_24_ut_141"
    },
    {
      "end": 1933630,
      "speaker": "Enrico Bertini",
      "start": 1931030,
      "text": "More. It sounds like something you should participate.",
      "id": "ep_24_ut_142"
    },
    {
      "end": 1954220,
      "speaker": "Moritz Stefaner",
      "start": 1933670,
      "text": "To, although I really have trouble working without data. So you know, usually I say, listen, people, I need some data, otherwise I'm in trouble here. But it sounds like a fascinating task. Definitely. And, I mean, there's a clear description of how the situation is, what the I. What the problem to solve is. And.",
      "id": "ep_24_ut_143"
    },
    {
      "end": 1971680,
      "speaker": "Celste Paul",
      "start": 1954340,
      "text": "Yeah, imagine a movie script. Imagine you were a subject matter expert for a movie, and they said, we need a cool looking display that looks realistic, and this is what the actor is doing. This is what the actor is trying to find. Go and design it.",
      "id": "ep_24_ut_144"
    },
    {
      "end": 1973732,
      "speaker": "Enrico Bertini",
      "start": 1973060,
      "text": "Yeah, no problem.",
      "id": "ep_24_ut_145"
    },
    {
      "end": 1974588,
      "speaker": "Celste Paul",
      "start": 1973796,
      "text": "Somebody bringing.",
      "id": "ep_24_ut_146"
    },
    {
      "end": 1978200,
      "speaker": "Enrico Bertini",
      "start": 1974684,
      "text": "Yeah, it's not my phone. Yeah, it can happen. Don't worry.",
      "id": "ep_24_ut_147"
    },
    {
      "end": 1979224,
      "speaker": "Celste Paul",
      "start": 1978560,
      "text": "Okay.",
      "id": "ep_24_ut_148"
    },
    {
      "end": 1980780,
      "speaker": "Enrico Bertini",
      "start": 1979312,
      "text": "Yeah, go ahead. Go ahead.",
      "id": "ep_24_ut_149"
    },
    {
      "end": 1985380,
      "speaker": "Celste Paul",
      "start": 1981480,
      "text": "I mean, imagine if it was a movie script and they asked you.",
      "id": "ep_24_ut_150"
    },
    {
      "end": 1987008,
      "speaker": "Georges Grinstein",
      "start": 1986040,
      "text": "Sorry about that.",
      "id": "ep_24_ut_151"
    },
    {
      "end": 1988620,
      "speaker": "Enrico Bertini",
      "start": 1987064,
      "text": "Yeah, no problem. No problem.",
      "id": "ep_24_ut_152"
    },
    {
      "end": 1992928,
      "speaker": "Georges Grinstein",
      "start": 1989880,
      "text": "Keep going. Go ahead. I don't know how to shut it off here.",
      "id": "ep_24_ut_153"
    },
    {
      "end": 1995020,
      "speaker": "Celste Paul",
      "start": 1993064,
      "text": "Maybe the story isn't worth it.",
      "id": "ep_24_ut_154"
    },
    {
      "end": 1998496,
      "speaker": "Moritz Stefaner",
      "start": 1996280,
      "text": "No, it's just on George Straxer.",
      "id": "ep_24_ut_155"
    },
    {
      "end": 2023668,
      "speaker": "Celste Paul",
      "start": 1998688,
      "text": "Yes, but imagine a movie script where you know what the actor is doing, you know what the actor is going to get, and you get to design anything that is convincing but also a little bit science fictiony. What boundaries can you really, you know, pass if you didn't have the restrictions of today's data or today's analytics and.",
      "id": "ep_24_ut_156"
    },
    {
      "end": 2026372,
      "speaker": "Moritz Stefaner",
      "start": 2023684,
      "text": "You can think about or today's hardware, maybe, you know.",
      "id": "ep_24_ut_157"
    },
    {
      "end": 2053070,
      "speaker": "Celste Paul",
      "start": 2026476,
      "text": "Yeah. What can we do in five or ten years? Exactly. Exactly. So this is the first year for that. With the way that the challenge is designed, we have a good idea of how many people have viewed the page, but since there's no data to download, we have no idea how many people might actually participate. So it'll be very interesting. Judging will be interesting, too.",
      "id": "ep_24_ut_158"
    },
    {
      "end": 2056266,
      "speaker": "Enrico Bertini",
      "start": 2053450,
      "text": "So you're not providing any data sets with this one?",
      "id": "ep_24_ut_159"
    },
    {
      "end": 2057538,
      "speaker": "Celste Paul",
      "start": 2056338,
      "text": "No data at all.",
      "id": "ep_24_ut_160"
    },
    {
      "end": 2058682,
      "speaker": "Enrico Bertini",
      "start": 2057594,
      "text": "No data at all.",
      "id": "ep_24_ut_161"
    },
    {
      "end": 2064682,
      "speaker": "Celste Paul",
      "start": 2058826,
      "text": "No data at all. It's a two page story about a data scenario and the person who is in it.",
      "id": "ep_24_ut_162"
    },
    {
      "end": 2075762,
      "speaker": "Enrico Bertini",
      "start": 2064786,
      "text": "So that's the madness session of the vast challenge. Okay. So you expect very creative, bold kind of solutions, right?",
      "id": "ep_24_ut_163"
    },
    {
      "end": 2093884,
      "speaker": "Celste Paul",
      "start": 2075826,
      "text": "Yeah. So we've recruit, we've passed on the challenge to some art schools and some other information visualization professors who were very interested in the type of challenge. So we're looking forward to seeing the types of results we get for this year.",
      "id": "ep_24_ut_164"
    },
    {
      "end": 2098920,
      "speaker": "Enrico Bertini",
      "start": 2094012,
      "text": "Okay, and how are you gonna evaluate this? I mean, it looks complicated.",
      "id": "ep_24_ut_165"
    },
    {
      "end": 2132118,
      "speaker": "Georges Grinstein",
      "start": 2101300,
      "text": "We have some specifications on what they're gonna submit. A video, an image. We also suggested storyboards, and it's very similar in terms of having for the classic, vast challenges. We have analysts and experts who participate heavily in evaluation along with the committee. In this case, we'll have designers also, and Infiz designers and others participate as well.",
      "id": "ep_24_ut_166"
    },
    {
      "end": 2179042,
      "speaker": "Celste Paul",
      "start": 2132214,
      "text": "Yes, it's a subjective visualization, but artistic critique is pretty common. And we've provided some very good guidelines so that everything will be consistent. So, you know, novelty, transference of ideas from one domain to another. How much complexity did they try? The more complexity that they try, they get more points, even if it seems to, you know, might be too much. How large is the network that they tried? How many objects are they, are they working with? There are a lot of things I don't want to give away too much of the judging criteria on purpose. Maybe we should strike that. It'll be interesting.",
      "id": "ep_24_ut_167"
    },
    {
      "end": 2183750,
      "speaker": "Enrico Bertini",
      "start": 2179186,
      "text": "Okay, but you have a specific committee for this challenge, right?",
      "id": "ep_24_ut_168"
    },
    {
      "end": 2215914,
      "speaker": "Celste Paul",
      "start": 2184090,
      "text": "Yes. So we'll have subject matter experts who have experience in cybersecurity and situation awareness, and then we'll also have the technical experts, and in this case it will be designers and artists who are volunteering to review. And this is very similar to other challenges that we have where in the past we would have the subject matter expertise, say last year's challenge was cybersecurity related, but then we would also have visualization experts as well, rate every single submission.",
      "id": "ep_24_ut_169"
    },
    {
      "end": 2216594,
      "speaker": "Enrico Bertini",
      "start": 2216082,
      "text": "All right.",
      "id": "ep_24_ut_170"
    },
    {
      "end": 2224250,
      "speaker": "Georges Grinstein",
      "start": 2216682,
      "text": "And we do we have told the participants that they can connect with cybersecurity individuals if they want to.",
      "id": "ep_24_ut_171"
    },
    {
      "end": 2225058,
      "speaker": "Enrico Bertini",
      "start": 2224370,
      "text": "Yes.",
      "id": "ep_24_ut_172"
    },
    {
      "end": 2235470,
      "speaker": "Celste Paul",
      "start": 2225234,
      "text": "We definitely encourage any type of domain or user research, not just in the design challenge, but also with the technical data challenges.",
      "id": "ep_24_ut_173"
    },
    {
      "end": 2239740,
      "speaker": "Enrico Bertini",
      "start": 2235900,
      "text": "Okay, and what about the third mini challenge?",
      "id": "ep_24_ut_174"
    },
    {
      "end": 2319076,
      "speaker": "Celste Paul",
      "start": 2239860,
      "text": "Yes, so the third mini challenge is the really big data challenge. It's the third challenge in a series of cybersecurity situation awareness challenges. So if you remember, in 2011, we had a small situation awareness challenge where it was 150 computers with firewall logs, packet captures, intrusion detection logs, nessus scan, syslogs, lots of different things, but for a small set of computers. And this was really to introduce the community to volume and complexity of this type of data. Last year it was focused, both challenges were focused on cybersecurity, and we looked at depth and breadth. So last year we had a near million node network that we generated high level network health data for. So that was definitely a volume challenge for a lot of people. But we also created an in depth situation awareness and analysis challenge using 5000 computers with firewall logs and intrusion detection system. And so that was moderate complexity, but it was still relatively easy for participants. This year's challenge in terms of size is 91 million records.",
      "id": "ep_24_ut_175"
    },
    {
      "end": 2319780,
      "speaker": "Moritz Stefaner",
      "start": 2319188,
      "text": "Oh, wow.",
      "id": "ep_24_ut_176"
    },
    {
      "end": 2320140,
      "speaker": "Georges Grinstein",
      "start": 2319860,
      "text": "Wow.",
      "id": "ep_24_ut_177"
    },
    {
      "end": 2379920,
      "speaker": "Celste Paul",
      "start": 2320180,
      "text": "Yes. And this is a combination of Big Brother records, which is a, it's similar to health and status, but it's an actual product. So these are very realistic logs, and it'll tell you whether or not a policy deviation has happened. It has full net flow data, which are all the records of one computer talking to another. And then we also have one week of intrusion prevention system logs. The entire challenge takes place over two weeks, real time. And it is a lot of data, and it's not just volume this year. It is also very complex. There's a lot of stuff going on. So we're very interested to see how well people deal with the complexity in addition to the volume, but also exactly what everyone finds, because we have some interesting things hidden in the data.",
      "id": "ep_24_ut_178"
    },
    {
      "end": 2395576,
      "speaker": "Enrico Bertini",
      "start": 2380480,
      "text": "Okay, so that's the most traditional one. Right. So the structure of this one is the usual one where you have lots of data, very clear, analytical task, and you injected some ground truth, right?",
      "id": "ep_24_ut_179"
    },
    {
      "end": 2404980,
      "speaker": "Celste Paul",
      "start": 2395728,
      "text": "Yes. It's very large and very complex data, and we know what we put in it, but there might be other things as well.",
      "id": "ep_24_ut_180"
    },
    {
      "end": 2413188,
      "speaker": "Georges Grinstein",
      "start": 2405480,
      "text": "And I do want to point out that mini challenge one is also somewhat traditional, because the ground truth is whatever happens that day.",
      "id": "ep_24_ut_181"
    },
    {
      "end": 2417560,
      "speaker": "Enrico Bertini",
      "start": 2413244,
      "text": "Sure, sure. The ground truth is embedded in the design, right?",
      "id": "ep_24_ut_182"
    },
    {
      "end": 2423292,
      "speaker": "Georges Grinstein",
      "start": 2418140,
      "text": "I mean, well, in number one, yes. It's whatever the public decides to go see.",
      "id": "ep_24_ut_183"
    },
    {
      "end": 2428700,
      "speaker": "Celste Paul",
      "start": 2423436,
      "text": "Challenge number one is real data. Challenge number two is no data.",
      "id": "ep_24_ut_184"
    },
    {
      "end": 2429196,
      "speaker": "Enrico Bertini",
      "start": 2428820,
      "text": "Okay.",
      "id": "ep_24_ut_185"
    },
    {
      "end": 2433420,
      "speaker": "Celste Paul",
      "start": 2429228,
      "text": "And challenge number three is high quality simulated data.",
      "id": "ep_24_ut_186"
    },
    {
      "end": 2435572,
      "speaker": "Enrico Bertini",
      "start": 2433500,
      "text": "So you have the old spectrum this year.",
      "id": "ep_24_ut_187"
    },
    {
      "end": 2436132,
      "speaker": "Georges Grinstein",
      "start": 2435716,
      "text": "Yes.",
      "id": "ep_24_ut_188"
    },
    {
      "end": 2438360,
      "speaker": "Enrico Bertini",
      "start": 2436196,
      "text": "I guess it's the first time you have that, right?",
      "id": "ep_24_ut_189"
    },
    {
      "end": 2440250,
      "speaker": "Georges Grinstein",
      "start": 2439570,
      "text": "Yeah.",
      "id": "ep_24_ut_190"
    },
    {
      "end": 2442986,
      "speaker": "Celste Paul",
      "start": 2440370,
      "text": "Such diverse challenges. Yes, that's definitely true.",
      "id": "ep_24_ut_191"
    },
    {
      "end": 2454270,
      "speaker": "Georges Grinstein",
      "start": 2443018,
      "text": "I think so. We've had diverse in terms of data and problems, many challenges that were separate. But this also brings it back in some way.",
      "id": "ep_24_ut_192"
    },
    {
      "end": 2455210,
      "speaker": "Enrico Bertini",
      "start": 2454850,
      "text": "Right.",
      "id": "ep_24_ut_193"
    },
    {
      "end": 2460426,
      "speaker": "Georges Grinstein",
      "start": 2455250,
      "text": "In fact, this is very similar. You can only work on mini challenge one if you want to and not deal with the others.",
      "id": "ep_24_ut_194"
    },
    {
      "end": 2461362,
      "speaker": "Enrico Bertini",
      "start": 2460538,
      "text": "Sure, sure.",
      "id": "ep_24_ut_195"
    },
    {
      "end": 2462514,
      "speaker": "Georges Grinstein",
      "start": 2461506,
      "text": "And so on.",
      "id": "ep_24_ut_196"
    },
    {
      "end": 2480518,
      "speaker": "Enrico Bertini",
      "start": 2462642,
      "text": "Okay. And the mini challenges, of course, are no longer connected as they were last year or previous years. Right. Previous years, most of the mini challenges were connected. Right. So you could actually participate to the grand challenge and connect all the three pieces together, is that correct?",
      "id": "ep_24_ut_197"
    },
    {
      "end": 2481770,
      "speaker": "Georges Grinstein",
      "start": 2480654,
      "text": "That's right, yes.",
      "id": "ep_24_ut_198"
    },
    {
      "end": 2502888,
      "speaker": "Celste Paul",
      "start": 2482310,
      "text": "But as our data sets became more and more complex, we were having, it was a big enough challenge to create a coherent story in one mini challenge, because really we have three types of data in the mini challenge. So in a way, that's its own little grand challenge, if you analyze each type of data separately, and that's true for the other data sets as well.",
      "id": "ep_24_ut_199"
    },
    {
      "end": 2571354,
      "speaker": "Georges Grinstein",
      "start": 2503024,
      "text": "And I think that one thing to realize is that the vast challenges are continually evolving as we try to solve more and more complex problems and actually get some fantastic results from people, as Celeste was describing it, especially on many challenge two. One of the challenges we had was to analyze in the past gene mutations to identify the most virulent mutation to be able to quarantine it. And one of the solutions that came in, most of the solutions use typical text gene blast differencing to try to identify where the mutations occurred from the bioinformatic side. But one group used plagiarism tools, and that was brilliant, very creative. And so those are the kinds of things where communities go out, know a particular area, solve a problem in a way that's tremendously creative. And by having these challenges available to everyone, that's what we're hoping that communities talk to each other.",
      "id": "ep_24_ut_200"
    },
    {
      "end": 2572670,
      "speaker": "Celste Paul",
      "start": 2571482,
      "text": "Yes, exactly.",
      "id": "ep_24_ut_201"
    },
    {
      "end": 2593960,
      "speaker": "Enrico Bertini",
      "start": 2573130,
      "text": "Okay. And another thing I wanted to ask you. How do you. So, for instance, for the mini challenge three, that is the most traditional one, how do you evaluate the entries? Is this just counting the. How much of the ground truth is covered, or you have several different kind of criteria?",
      "id": "ep_24_ut_202"
    },
    {
      "end": 2633098,
      "speaker": "Celste Paul",
      "start": 2594300,
      "text": "Well, certainly finding the events that we inject into the data is beneficial. Sometimes people might find an event, but they don't quite explain it the way we expected them to. If they can justify that with the visualizations that they created, they often still get the points. Sometimes they find things that we did not intend or we did not put in the data. But if they can justify that with their analytics, that will definitely give them credit. We look at things like, how can.",
      "id": "ep_24_ut_203"
    },
    {
      "end": 2640830,
      "speaker": "Enrico Bertini",
      "start": 2633114,
      "text": "You get negative scores for something you do? False findings, false positives.",
      "id": "ep_24_ut_204"
    },
    {
      "end": 2668122,
      "speaker": "Georges Grinstein",
      "start": 2641370,
      "text": "It really depends on what is found in the approach. So we and the awards we give are not just related to ground truth. They could often be approach integration issues, being able to scale even more than 90 million, but maybe to a trillion. I mean, those are the kinds of things we look at. We're pretty broad on evaluating a submission from many, many different aspects.",
      "id": "ep_24_ut_205"
    },
    {
      "end": 2749578,
      "speaker": "Celste Paul",
      "start": 2668186,
      "text": "Yeah, someone might come up with a really interesting visualization for one type of data problem, but they don't really get any of the other parts of the challenge. If it's a really interesting, really creative way to solve that one tiny part of the problem, we may recognize that. But in terms of judging, finding the right answer, or finding things in the data and describing the analysis, like George said, is just one part of everything that we consider. But we focus on the justification through the analysis and not just finding something. If you find something, but you can't explain how or why you found it using your analytic, it doesn't mean much to us. One of the challenges that we had in 2011 is that people took a more forensics approach to looking at the data than an active analysis approach. And so we try very hard to create active analysis situations because if these tools were being used in the real world, they're not going to be used after the effect. They're going to be used in the moment because they're situation awareness problems. And so we want to, we want to encourage people to take that approach whenever they're creating their analytics and not focus too much on post hoc forensics.",
      "id": "ep_24_ut_206"
    },
    {
      "end": 2771820,
      "speaker": "Enrico Bertini",
      "start": 2749754,
      "text": "Okay, I guess so in order to participate, not necessarily, you have to build your own tools, right? So you could actually use existing tools and you will be still judging positively entries that discover the ground truth and explain how they did it and what's the process, right? Is that correct?",
      "id": "ep_24_ut_207"
    },
    {
      "end": 2839376,
      "speaker": "Celste Paul",
      "start": 2771860,
      "text": "Oh, yes, that's true. Last year we had many submit very good submissions of Tableau worksheets. We've also had people just create very simple analytics using R and D3 and Mysql database. However, those tools are already available to a lot of people, and so the limits of those tools have already been explored. It's certainly possible to use existing tools to solve the problem in a new and interesting way, and perhaps even better than somebody who comes up with a custom tool. But building your own custom tools allow a lot of flexibility in terms of how you process large amounts of data, because not all commercial tools, very few commercial tools, actually. And I'm not sure if there are any commercial tools that can handle 91 million records unless you do streaming data, can handle that much data or be able to tweak the visualization for the data or for the analysis process for the scenario or for the user that you're tuning it for.",
      "id": "ep_24_ut_208"
    },
    {
      "end": 2934320,
      "speaker": "Enrico Bertini",
      "start": 2839528,
      "text": "Sure. Sure. Well, this is what I noticed when I was using the bas challenge for teaching when I was in Konstanz in Germany. I think I've been teaching a visual analytics course for a couple of years, and the whole course was organized around the vast challenge. So basically the project assigned to the students was participating to the vast challenge, right. And one thing that I noticed that I really liked is the fact that the students end up using a lot of different tools in order to solve the problem. So they start with some, typically they start with some data processing tools. They start with one, then they understand that there is a limit, so they switch to another one. So I remember, for instance, last year, they had a lot of problems with the data size, as you mentioned before. So they start with some kind of SQL stuff? No, I think they start with some kind of text editing tool or something really simple. Then they moved to SQL, then they moved to something else again. And then they started thinking, how does this data look like? And then they started using Tableau, somebody else used r. Then at some point they discovered there are some limitations in this tool and think, oh, maybe I should come up with my own design. And then they design something themselves. And at the end of the day, at the end of all this process, you've learned so much because you've been through all these phases, you've been trying all these tools. You know exactly how, what you can achieve with these tools and where the limits are. So I personally found it really, really enriching and as a process. So did you get similar feedback from other professors?",
      "id": "ep_24_ut_209"
    },
    {
      "end": 2935124,
      "speaker": "Georges Grinstein",
      "start": 2934620,
      "text": "Often.",
      "id": "ep_24_ut_210"
    },
    {
      "end": 2967210,
      "speaker": "Enrico Bertini",
      "start": 2935212,
      "text": "Often, yeah. So the only thing is I notice is that now that I'm in the US, I can no longer organize the course around the vast challenge because the deadlines are no longer aligned. So in Europe they are aligned. And I find it really interesting because the students love the fact that they can actively participate to the challenge and at the same time do the course right. And, yeah, so speed of, it's my little protest against, every year we say.",
      "id": "ep_24_ut_211"
    },
    {
      "end": 2982390,
      "speaker": "Celste Paul",
      "start": 2967250,
      "text": "We'Re going to get the data out early this year. Early, early. But we also forget that we decided to come up with a larger and even more complex and even more realistic data set. And no matter how hard we try, we need that extra month or two.",
      "id": "ep_24_ut_212"
    },
    {
      "end": 2997840,
      "speaker": "Enrico Bertini",
      "start": 2984170,
      "text": "Even if you would be able to put the data sets out earlier, I think it's very nice that the deadlines fall within the schedule of the course and that's not going to happen here. I think that's, that's pity, actually.",
      "id": "ep_24_ut_213"
    },
    {
      "end": 2998916,
      "speaker": "Georges Grinstein",
      "start": 2998420,
      "text": "Yeah.",
      "id": "ep_24_ut_214"
    },
    {
      "end": 3000732,
      "speaker": "Celste Paul",
      "start": 2998988,
      "text": "We don't know in the future.",
      "id": "ep_24_ut_215"
    },
    {
      "end": 3005308,
      "speaker": "Georges Grinstein",
      "start": 3000876,
      "text": "Yeah, we keep trying. But on the other hand, mini challenge one did start in January.",
      "id": "ep_24_ut_216"
    },
    {
      "end": 3011228,
      "speaker": "Enrico Bertini",
      "start": 3005404,
      "text": "Oh, yeah, sure, sure. Yeah. I could have done that.",
      "id": "ep_24_ut_217"
    },
    {
      "end": 3027296,
      "speaker": "Celste Paul",
      "start": 3011284,
      "text": "Yes, a challenge. And we are working out ways that we could possibly change that because, I mean, one of the challenges is we're coming up with bigger and crazier data sets. People are going to need more than three or four months to work on them.",
      "id": "ep_24_ut_218"
    },
    {
      "end": 3037060,
      "speaker": "Enrico Bertini",
      "start": 3027368,
      "text": "Yeah, yeah, yeah, sure. And do you know of anyone that keep, keeps working on these data sets after the challenge? Does this happen?",
      "id": "ep_24_ut_219"
    },
    {
      "end": 3039540,
      "speaker": "Georges Grinstein",
      "start": 3037880,
      "text": "Yes, yes.",
      "id": "ep_24_ut_220"
    },
    {
      "end": 3049580,
      "speaker": "Celste Paul",
      "start": 3040320,
      "text": "We've seen the data sets and we've seen iterations on submissions show up at conferences the next year and sometimes other publications.",
      "id": "ep_24_ut_221"
    },
    {
      "end": 3052634,
      "speaker": "Enrico Bertini",
      "start": 3049930,
      "text": "Okay. So I was wondering, and in fact.",
      "id": "ep_24_ut_222"
    },
    {
      "end": 3072418,
      "speaker": "Georges Grinstein",
      "start": 3052682,
      "text": "I want to point out that there's a special issue. Of course, I'm going to block out where it is information visualization. Information visualization. There's a special issue where some of the past challenge participants are actually giving updates on their research.",
      "id": "ep_24_ut_223"
    },
    {
      "end": 3076100,
      "speaker": "Enrico Bertini",
      "start": 3072554,
      "text": "Oh, fantastic. Is that in the information visualization journal?",
      "id": "ep_24_ut_224"
    },
    {
      "end": 3076768,
      "speaker": "Georges Grinstein",
      "start": 3076250,
      "text": "Yes.",
      "id": "ep_24_ut_225"
    },
    {
      "end": 3078900,
      "speaker": "Enrico Bertini",
      "start": 3076864,
      "text": "Okay. Is it out already?",
      "id": "ep_24_ut_226"
    },
    {
      "end": 3082704,
      "speaker": "Celste Paul",
      "start": 3080840,
      "text": "If not, it's coming out very soon.",
      "id": "ep_24_ut_227"
    },
    {
      "end": 3085280,
      "speaker": "Enrico Bertini",
      "start": 3082792,
      "text": "It's coming out very soon. Okay, good.",
      "id": "ep_24_ut_228"
    },
    {
      "end": 3109238,
      "speaker": "Georges Grinstein",
      "start": 3085400,
      "text": "Yeah, they were. I think we had three or four additional papers. I think the papers came from Danyel Keim and Chris north and Catherine Pleasant on evaluation. And there's a whole bunch of them. I'm just picking out a few, but I think they were 345, basically.",
      "id": "ep_24_ut_229"
    },
    {
      "end": 3141676,
      "speaker": "Enrico Bertini",
      "start": 3109414,
      "text": "Okay, good. So I guess some of our listeners now, probably some of them are thinking, should I participate? Or maybe it's too easy to answer. I'm sure many people will be undecided. So that's the time to advertise the vast challenge. Why should someone participate to the vast challenge and why to the vast challenge and not other challenges? Assuming that the vast challenge is in competition with other challenges, why choosing this one?",
      "id": "ep_24_ut_230"
    },
    {
      "end": 3238890,
      "speaker": "Georges Grinstein",
      "start": 3141868,
      "text": "I think that there are. I think that this is the world. This is the time for challenges. They're occurring everywhere. They're all very interesting. They all have, many of them are providing prizes and money. The vast challenge actually is probably the only one, in my view, that looks at analysis, visualization, and the human as a system to work together. And that's quite different. I think that's a really key factor. And if you start extending that, you start thinking, oh, my goodness, we have to start thinking of human factors, design issues, cognition, and so on. And that's really what the vast challenge offers in a way. So if you want to just do analysis, you can use it. If you want to just do visualization, you can. If you want to combine all of them and have the human drive or steer computation, you can. So it really provides lots of opportunities to do different things. So that's just on the data and problem side. But there's also the community. We have a workshop, for example, a whole day workshop where people can come, hear speakers, exchange, present what they're doing, discuss it with other, hear other ideas on these complex problems, and then finally, you get rewards. Students can get publications, can rub shoulders with the top researchers in this area. So I think it's an extremely enriching experience.",
      "id": "ep_24_ut_231"
    },
    {
      "end": 3272380,
      "speaker": "Celste Paul",
      "start": 3239950,
      "text": "Yeah. Another thing I would like to mention is that every single submission gets reviewed by at least two people, one subject matter expert and one visualization expert. And so if you have an idea that you're, you know, maybe still working out, and this is the first time you've run it through a data scenario. This is a really great place to test out your ideas and get really good feedback because all of our reviewers are so awesome and they spend so much time giving high quality feedback to many, many submissions that we receive.",
      "id": "ep_24_ut_232"
    },
    {
      "end": 3283098,
      "speaker": "Georges Grinstein",
      "start": 3272760,
      "text": "Right. We're talking about actual analysts or design artists or information visualization experts, and the committee also reads most of them, if not all.",
      "id": "ep_24_ut_233"
    },
    {
      "end": 3285350,
      "speaker": "Celste Paul",
      "start": 3283234,
      "text": "Some of us read all of them.",
      "id": "ep_24_ut_234"
    },
    {
      "end": 3294270,
      "speaker": "Enrico Bertini",
      "start": 3287810,
      "text": "Okay. So if I want to participate, how does it look like I just go to the website? Do I have to register or anything?",
      "id": "ep_24_ut_235"
    },
    {
      "end": 3299946,
      "speaker": "Georges Grinstein",
      "start": 3294970,
      "text": "Yes, if you want to get updates, I think. But otherwise you can just download the datas.",
      "id": "ep_24_ut_236"
    },
    {
      "end": 3300450,
      "speaker": "Enrico Bertini",
      "start": 3300058,
      "text": "Okay.",
      "id": "ep_24_ut_237"
    },
    {
      "end": 3326668,
      "speaker": "Celste Paul",
      "start": 3300490,
      "text": "Yeah, it's at the VA community website. It should be on the front page and we can give you a link for that. We should have the links for that. You can register for updates, which is always good in case we add corrections or updates to the data. Sometimes we clarify instructions, but otherwise you just download the data and look at the requirements for submission and submit your solution.",
      "id": "ep_24_ut_238"
    },
    {
      "end": 3331280,
      "speaker": "Enrico Bertini",
      "start": 3326844,
      "text": "Can you engage with the other participants before submitting and with the committee?",
      "id": "ep_24_ut_239"
    },
    {
      "end": 3341288,
      "speaker": "Georges Grinstein",
      "start": 3331780,
      "text": "We recommend that all the time, and there are people who coordinate together or ask questions to the committee, but we usually don't get that many questions, actually.",
      "id": "ep_24_ut_240"
    },
    {
      "end": 3344032,
      "speaker": "Enrico Bertini",
      "start": 3341424,
      "text": "Okay. Okay. And of course, if you're looking for.",
      "id": "ep_24_ut_241"
    },
    {
      "end": 3353220,
      "speaker": "Moritz Stefaner",
      "start": 3344056,
      "text": "A collaborator or so, I mean, is there like a forum or some place where people like, maybe you're alone and you think, like, it would be, would be nice to team up?",
      "id": "ep_24_ut_242"
    },
    {
      "end": 3358260,
      "speaker": "Georges Grinstein",
      "start": 3353800,
      "text": "We did in the past. We got so little response from that.",
      "id": "ep_24_ut_243"
    },
    {
      "end": 3374656,
      "speaker": "Celste Paul",
      "start": 3358760,
      "text": "Yeah, that's interesting you mentioned that because many people during the workshop said, hey, it would be great to have an online community to coordinate. And I'm pretty sure there is a forum on the VA community website for the challenge, but there's not been a whole lot of activity.",
      "id": "ep_24_ut_244"
    },
    {
      "end": 3388060,
      "speaker": "Moritz Stefaner",
      "start": 3374728,
      "text": "Yeah, I just realized that in the moocs, you know, in these online courses, that a lot of the actual, the interesting stuff happens among the participants. So. But, yeah, maybe because it's a competition, it's a bit different.",
      "id": "ep_24_ut_245"
    },
    {
      "end": 3439470,
      "speaker": "Celste Paul",
      "start": 3388360,
      "text": "And, you know, I think a lot of interaction happens at the workshop where people meet with each other and they discuss things and then they exchange email addresses and they begin collaborating that way. Last year was the first year that VizSec workshop was at Visweek, and that was great because these were all of the subject matter experts who were dabbling in information visualizations, meeting all the information visualization experts who were dabbing in the cybersecurity realm. And so them getting together to be able to discuss problems and solutions was really valuable. And that's what we're hoping for this year with the design challenge, where now we're going to introduce artists and designers to this community so that they start working together.",
      "id": "ep_24_ut_246"
    },
    {
      "end": 3446348,
      "speaker": "Enrico Bertini",
      "start": 3440210,
      "text": "Okay. And so assuming you get an award, what happens next? So you get invited to the.",
      "id": "ep_24_ut_247"
    },
    {
      "end": 3451600,
      "speaker": "Georges Grinstein",
      "start": 3446524,
      "text": "You get invited, you become world famous. You get everything that comes with the award.",
      "id": "ep_24_ut_248"
    },
    {
      "end": 3502000,
      "speaker": "Celste Paul",
      "start": 3452340,
      "text": "So many of the award recipients, we invite them to give a talk, and depending on the schedule and depending on what their award was for, you know, maybe it's a ten minute talk, maybe it's a 30 minutes talk, they'll be able to walk through and give a presentation on. On their contest submission. And often many people continue working on their submissions well past the deadline date. So the deadline for the contest this year is the end of the second week of July. But, you know, this week isn't until October. That's many months that people can continue working on their. On their software. And sometimes some of the advancements that they've made over the past few months are really, really interesting.",
      "id": "ep_24_ut_249"
    },
    {
      "end": 3513070,
      "speaker": "Georges Grinstein",
      "start": 3502570,
      "text": "And they can show demos. We have places where they can bring a laptop or more and then alongside a poster if they want to actually show live demos.",
      "id": "ep_24_ut_250"
    },
    {
      "end": 3521706,
      "speaker": "Enrico Bertini",
      "start": 3514090,
      "text": "Fantastic. So the event at this, I mean, the vast challenge event is it lasts, what, half day?",
      "id": "ep_24_ut_251"
    },
    {
      "end": 3523482,
      "speaker": "Celste Paul",
      "start": 3521818,
      "text": "A whole day workshop?",
      "id": "ep_24_ut_252"
    },
    {
      "end": 3524794,
      "speaker": "Georges Grinstein",
      "start": 3523546,
      "text": "It's a full day workshop.",
      "id": "ep_24_ut_253"
    },
    {
      "end": 3531470,
      "speaker": "Enrico Bertini",
      "start": 3524882,
      "text": "Okay. And do you give any kind, any sort of financial support in case it's needed for traveling?",
      "id": "ep_24_ut_254"
    },
    {
      "end": 3541504,
      "speaker": "Georges Grinstein",
      "start": 3531920,
      "text": "We used to in the past. I don't think this year we've planned for that. No, I don't think we've planned for that this year.",
      "id": "ep_24_ut_255"
    },
    {
      "end": 3551020,
      "speaker": "Enrico Bertini",
      "start": 3541592,
      "text": "Okay, so the vis is gonna be in Atlanta. Right. So I'm just trying to give some basic information to people just to. And the deadline for submission is when?",
      "id": "ep_24_ut_256"
    },
    {
      "end": 3553392,
      "speaker": "Georges Grinstein",
      "start": 3552040,
      "text": "Second week in July.",
      "id": "ep_24_ut_257"
    },
    {
      "end": 3559090,
      "speaker": "Enrico Bertini",
      "start": 3553536,
      "text": "2 week in July. Okay. So it's almost. It's basically one month from now, right?",
      "id": "ep_24_ut_258"
    },
    {
      "end": 3559506,
      "speaker": "Celste Paul",
      "start": 3559210,
      "text": "Yes.",
      "id": "ep_24_ut_259"
    },
    {
      "end": 3563090,
      "speaker": "Enrico Bertini",
      "start": 3559538,
      "text": "If somebody wants to participate and didn't know anything about it before.",
      "id": "ep_24_ut_260"
    },
    {
      "end": 3564070,
      "speaker": "Georges Grinstein",
      "start": 3563210,
      "text": "That's right.",
      "id": "ep_24_ut_261"
    },
    {
      "end": 3568750,
      "speaker": "Enrico Bertini",
      "start": 3564770,
      "text": "Okay. Moritz, is there anything else you want to ask?",
      "id": "ep_24_ut_262"
    },
    {
      "end": 3599094,
      "speaker": "Moritz Stefaner",
      "start": 3569810,
      "text": "No, it sounds really interesting. I mean, I can only comment, you know, I'm an ex academic, so I can only comment from this perspective that I always wanted to take part. But now, you know, it sounds like a lot of work. You have to invest, and then even if you win, you have to fly there yourself. So it makes it a bit for me, it's difficult to factor in the time, but it sounds like something, if you really dive into it, it can be very rewarding.",
      "id": "ep_24_ut_263"
    },
    {
      "end": 3609998,
      "speaker": "Celste Paul",
      "start": 3599222,
      "text": "It's not uncommon for commercial companies to submit. Last year, business forensics participated we've had Tableau and some other commercial products.",
      "id": "ep_24_ut_264"
    },
    {
      "end": 3616440,
      "speaker": "Moritz Stefaner",
      "start": 3610174,
      "text": "If you offer a visualization tool, I think it's perfect showcase if you manage to do something meaningful with it.",
      "id": "ep_24_ut_265"
    },
    {
      "end": 3640780,
      "speaker": "Georges Grinstein",
      "start": 3616520,
      "text": "I think there are lots of companies and business groups that do participate because clearly receiving an award in one of the many challenges highlights the strengths for that particular company. And we've had companies participate many years in a row because they keep improving their tools using these data sets.",
      "id": "ep_24_ut_266"
    },
    {
      "end": 3660830,
      "speaker": "Enrico Bertini",
      "start": 3642090,
      "text": "Okay, well, this sounds like a great outcome of the vast challenge. I mean, this is something I actually wanted to ask you. So what's the impact of the vast challenge beyond the challenge itself? I mean, how does it help making progress in visual analytics in general?",
      "id": "ep_24_ut_267"
    },
    {
      "end": 3704870,
      "speaker": "Georges Grinstein",
      "start": 3661290,
      "text": "I think that as people look at the tools and what they've solved, they get ideas in their evolution of their tools. Discussing with others, how did you handle that? What did you do about the large data? Oh, you presented it this way. Oh, I see. You use this design idea and so what you're doing is having a mechanism by which people can exchange extremely creative solutions and what works, what doesn't, what scales, what, how well does your system integrate this and so on. That's a rarity that's very difficult today to read in a paper. But it's terrific if you're there and you actually see that happen.",
      "id": "ep_24_ut_268"
    },
    {
      "end": 3729590,
      "speaker": "Celste Paul",
      "start": 3704990,
      "text": "And I think that happens because the vast challenge has real problems. And it's not just problem one, problem two, problem three give us answers. It's a scenario with people that could happen out in the real world and the data is very real. It's much easier to transfer a realistic scenario to other applications than, you know, a highly academic discussion.",
      "id": "ep_24_ut_269"
    },
    {
      "end": 3731298,
      "speaker": "Enrico Bertini",
      "start": 3730890,
      "text": "Sure.",
      "id": "ep_24_ut_270"
    },
    {
      "end": 3731514,
      "speaker": "Georges Grinstein",
      "start": 3731354,
      "text": "Yeah.",
      "id": "ep_24_ut_271"
    },
    {
      "end": 3745106,
      "speaker": "Moritz Stefaner",
      "start": 3731522,
      "text": "And you never have that direct comparison because you might read one paper on one technique for one problem, but then another paper on another technique for another problem. But you rarely see the same tool or different tools used for the same problem, right?",
      "id": "ep_24_ut_272"
    },
    {
      "end": 3745930,
      "speaker": "Georges Grinstein",
      "start": 3745138,
      "text": "That's right, yes.",
      "id": "ep_24_ut_273"
    },
    {
      "end": 3768902,
      "speaker": "Moritz Stefaner",
      "start": 3746010,
      "text": "And I think that's very interesting and very, very instructive. And I find that with all the contests, I mean, actually we started out data stories with sort of a rant on the contest, not the last general, but a few of the others. But one of the benefits really is that you have all these different solutions to the same issue, probably the same problems, and that can be very instructive.",
      "id": "ep_24_ut_274"
    },
    {
      "end": 3770850,
      "speaker": "Celste Paul",
      "start": 3769046,
      "text": "We're glad we've changed your mind.",
      "id": "ep_24_ut_275"
    },
    {
      "end": 3778570,
      "speaker": "Moritz Stefaner",
      "start": 3771910,
      "text": "We actually, you can go back and listen. We actually, we excluded the vast change, I think, from our end.",
      "id": "ep_24_ut_276"
    },
    {
      "end": 3782190,
      "speaker": "Enrico Bertini",
      "start": 3779230,
      "text": "Good. I had forgotten about it.",
      "id": "ep_24_ut_277"
    },
    {
      "end": 3787728,
      "speaker": "Georges Grinstein",
      "start": 3782230,
      "text": "As you can see, it is an extremely large amount of work to generate these data sets.",
      "id": "ep_24_ut_278"
    },
    {
      "end": 3788192,
      "speaker": "Moritz Stefaner",
      "start": 3787904,
      "text": "Yeah.",
      "id": "ep_24_ut_279"
    },
    {
      "end": 3815840,
      "speaker": "Celste Paul",
      "start": 3788216,
      "text": "This is not a trivial volunteer project. We spend a lot of time and effort to really deliver quality data sets and a quality challenge because we really believe that it's making an impact on the research community. It's really helping students start off their careers, and it's showing the, you know, the real life applicability of visual analytics research that can be applied to the commercial industry.",
      "id": "ep_24_ut_280"
    },
    {
      "end": 3821300,
      "speaker": "Enrico Bertini",
      "start": 3816940,
      "text": "So did you ever publish anything on the generation process itself?",
      "id": "ep_24_ut_281"
    },
    {
      "end": 3833120,
      "speaker": "Georges Grinstein",
      "start": 3821460,
      "text": "Yes, PNNL published a paper initially, I think, and several others. So there are techniques on there. Threat generation, stream generation.",
      "id": "ep_24_ut_282"
    },
    {
      "end": 3854128,
      "speaker": "Celste Paul",
      "start": 3833740,
      "text": "Yeah. Data generation changes from year to year as we change the focus of the data challenge, but also the scale of the data challenge. So I would maybe keep an eye for newer publications that deal with this cybersecurity data and all of the challenges that we dealt with.",
      "id": "ep_24_ut_283"
    },
    {
      "end": 3892910,
      "speaker": "Moritz Stefaner",
      "start": 3854264,
      "text": "Okay. Yeah, it's interesting. There's also a nice, another art parallel because there's this mini genre. It's called data fiction. And there's, for instance, one guy, Kim Asendorf, was like a media artist, and he told a fictional story about what happened in a biology lab and, and outbreak of a virus and so on. But he told it only through charts. And the more you study these charts and diagrams, you understand what happens. But it is sort of like a movie plot. I think it could be a whole genre, like telling fictional stories through data.",
      "id": "ep_24_ut_284"
    },
    {
      "end": 3897714,
      "speaker": "Enrico Bertini",
      "start": 3895170,
      "text": "Absolutely. Yeah, absolutely.",
      "id": "ep_24_ut_285"
    },
    {
      "end": 3903670,
      "speaker": "Moritz Stefaner",
      "start": 3897802,
      "text": "It's very interesting. And it's. I mean, you are doing it to a degree that probably nobody else does.",
      "id": "ep_24_ut_286"
    },
    {
      "end": 3916590,
      "speaker": "Celste Paul",
      "start": 3903970,
      "text": "Yeah. Storytelling is a really interesting way to shift the perspective so that, I mean, just thinking about the problem a little bit differently will make you go down paths that you never would have considered if you were stuck to a database.",
      "id": "ep_24_ut_287"
    },
    {
      "end": 3924922,
      "speaker": "Moritz Stefaner",
      "start": 3919170,
      "text": "Inverts the whole process. Like, usually you're looking for the story out there, and then you have to, like, come up with that story.",
      "id": "ep_24_ut_288"
    },
    {
      "end": 3938840,
      "speaker": "Celste Paul",
      "start": 3924986,
      "text": "Now it's telling the story. Exactly. And I mean, that's. That's why. Why we've chosen situation awareness for that challenge. Because you don't know what the story is yet. With situation awareness, your job is to tell the story in real time.",
      "id": "ep_24_ut_289"
    },
    {
      "end": 3946636,
      "speaker": "Enrico Bertini",
      "start": 3939420,
      "text": "Sure, sure. So in a way, you are evaluating the storytelling capabilities as well, right, in the entries? Yeah, that too.",
      "id": "ep_24_ut_290"
    },
    {
      "end": 3947340,
      "speaker": "Moritz Stefaner",
      "start": 3946708,
      "text": "Yeah.",
      "id": "ep_24_ut_291"
    },
    {
      "end": 3950460,
      "speaker": "Celste Paul",
      "start": 3947500,
      "text": "Their analysis process and how everything fits together.",
      "id": "ep_24_ut_292"
    },
    {
      "end": 3951560,
      "speaker": "Georges Grinstein",
      "start": 3950620,
      "text": "That's right.",
      "id": "ep_24_ut_293"
    },
    {
      "end": 3956846,
      "speaker": "Enrico Bertini",
      "start": 3952580,
      "text": "Did you hire any screenwriter people like that?",
      "id": "ep_24_ut_294"
    },
    {
      "end": 3962530,
      "speaker": "Celste Paul",
      "start": 3957038,
      "text": "We did put out a volunteer for amateur science fiction writers a few times.",
      "id": "ep_24_ut_295"
    },
    {
      "end": 3966454,
      "speaker": "Moritz Stefaner",
      "start": 3963230,
      "text": "Just within our friends to get some Hollywood people.",
      "id": "ep_24_ut_296"
    },
    {
      "end": 3969646,
      "speaker": "Georges Grinstein",
      "start": 3966502,
      "text": "Like, I think we're probably all aspiring.",
      "id": "ep_24_ut_297"
    },
    {
      "end": 3974290,
      "speaker": "Moritz Stefaner",
      "start": 3969718,
      "text": "Movie writers, so there might be a second career.",
      "id": "ep_24_ut_298"
    },
    {
      "end": 3989230,
      "speaker": "Enrico Bertini",
      "start": 3976470,
      "text": "Fantastic. Amazing. Amazing. So the best challenge is always gonna be in the context of the visconference, right? So you never thought about making it a separate kind of event?",
      "id": "ep_24_ut_299"
    },
    {
      "end": 3994150,
      "speaker": "Georges Grinstein",
      "start": 3992290,
      "text": "I'm not sure what. I know what you mean.",
      "id": "ep_24_ut_300"
    },
    {
      "end": 4015220,
      "speaker": "Celste Paul",
      "start": 3994450,
      "text": "So the challenge is visual analytics for science and technology. At Viz, there is also a track for vast, specifically. And so the challenge is attached to that. Well, unofficially, it's linked to the vast track.",
      "id": "ep_24_ut_301"
    },
    {
      "end": 4040204,
      "speaker": "Georges Grinstein",
      "start": 4015340,
      "text": "Yeah, it's part of the symposium. The vast symposium. But it's separate also, we run it completely separately. It both draws a lot of participants to come because quite a number participate in the vast challenge and therefore ten the vast symposium. So it's a part of it. It's just historically, the challenge has grown as its separate entity because of the large size.",
      "id": "ep_24_ut_302"
    },
    {
      "end": 4044060,
      "speaker": "Enrico Bertini",
      "start": 4040372,
      "text": "Okay, sure. But it's always co located with the vis conference.",
      "id": "ep_24_ut_303"
    },
    {
      "end": 4048316,
      "speaker": "Georges Grinstein",
      "start": 4044180,
      "text": "It has always been co located. And so next year we'll be in France.",
      "id": "ep_24_ut_304"
    },
    {
      "end": 4052484,
      "speaker": "Enrico Bertini",
      "start": 4048508,
      "text": "Oh, that's fantastic. Sure. In Paris, right?",
      "id": "ep_24_ut_305"
    },
    {
      "end": 4053788,
      "speaker": "Celste Paul",
      "start": 4052612,
      "text": "It's in Paris.",
      "id": "ep_24_ut_306"
    },
    {
      "end": 4057868,
      "speaker": "Enrico Bertini",
      "start": 4053964,
      "text": "So one more motivation to participate.",
      "id": "ep_24_ut_307"
    },
    {
      "end": 4063356,
      "speaker": "Georges Grinstein",
      "start": 4058004,
      "text": "That's right. And maybe we'll get grant money to provide free trips for students.",
      "id": "ep_24_ut_308"
    },
    {
      "end": 4074320,
      "speaker": "Enrico Bertini",
      "start": 4063468,
      "text": "That would be awesome. Yeah, yeah, yeah, yeah. Okay. I don't know. I think we can stop here unless there is. Is there anything else you want to add about the Bas challenge?",
      "id": "ep_24_ut_309"
    },
    {
      "end": 4089740,
      "speaker": "Georges Grinstein",
      "start": 4078620,
      "text": "No, I think that we've discussed the impact and all of the activities that are involved, so I think. I want to thank you. It's for all the questions and your.",
      "id": "ep_24_ut_310"
    },
    {
      "end": 4095550,
      "speaker": "Celste Paul",
      "start": 4089780,
      "text": "Yes, you asked all the right questions. We had all the right answers.",
      "id": "ep_24_ut_311"
    },
    {
      "end": 4116430,
      "speaker": "Enrico Bertini",
      "start": 4096970,
      "text": "No, no. I am myself a big fan of the challenge, so I'm really glad that we managed to invite you and know all the details about that. It's really interesting what you guys are doing. And as we said, it's not easy at all. It doesn't look easy. Moritz, is there anything else you want to add?",
      "id": "ep_24_ut_312"
    },
    {
      "end": 4130551,
      "speaker": "Moritz Stefaner",
      "start": 4117330,
      "text": "No, I'm good. Super interesting, I think. Yeah. Like learning what. What's going on behind the scenes, behind these innocent looking datasets. I think that was really interesting. I will see them with different eyes now, I guess.",
      "id": "ep_24_ut_313"
    },
    {
      "end": 4137735,
      "speaker": "Enrico Bertini",
      "start": 4130655,
      "text": "Yeah, yeah. I really hope that some of our listeners will pick it up, even if there is not a lot of time until the deadline.",
      "id": "ep_24_ut_314"
    },
    {
      "end": 4138687,
      "speaker": "Moritz Stefaner",
      "start": 4137767,
      "text": "I think it's fine.",
      "id": "ep_24_ut_315"
    },
    {
      "end": 4139511,
      "speaker": "Enrico Bertini",
      "start": 4138783,
      "text": "It's one month.",
      "id": "ep_24_ut_316"
    },
    {
      "end": 4144143,
      "speaker": "Moritz Stefaner",
      "start": 4139615,
      "text": "Yeah, exactly. I mean, realistically, you wouldn't start earlier anyways, right?",
      "id": "ep_24_ut_317"
    },
    {
      "end": 4144899,
      "speaker": "Enrico Bertini",
      "start": 4144231,
      "text": "Yeah.",
      "id": "ep_24_ut_318"
    },
    {
      "end": 4147499,
      "speaker": "Moritz Stefaner",
      "start": 4145519,
      "text": "You might as well just start now.",
      "id": "ep_24_ut_319"
    },
    {
      "end": 4152074,
      "speaker": "Georges Grinstein",
      "start": 4148650,
      "text": "Great. Well, thank you so much, Moritz. Enrico, thank you.",
      "id": "ep_24_ut_320"
    },
    {
      "end": 4152570,
      "speaker": "Enrico Bertini",
      "start": 4152122,
      "text": "Thank you.",
      "id": "ep_24_ut_321"
    },
    {
      "end": 4153362,
      "speaker": "Celste Paul",
      "start": 4152610,
      "text": "Thank you for having us.",
      "id": "ep_24_ut_322"
    },
    {
      "end": 4155442,
      "speaker": "Moritz Stefaner",
      "start": 4153386,
      "text": "Yeah, thanks for joining us. Fantastic.",
      "id": "ep_24_ut_323"
    },
    {
      "end": 4157354,
      "speaker": "Enrico Bertini",
      "start": 4155546,
      "text": "Bye bye. Bye. Bye bye.",
      "id": "ep_24_ut_324"
    },
    {
      "end": 4158106,
      "speaker": "Moritz Stefaner",
      "start": 4157442,
      "text": "Thank you. Bye.",
      "id": "ep_24_ut_325"
    }
  ],
  "confidence": 0.931918023998448,
  "audio_duration": 4164,
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_status_code": null,
  "webhook_auth": false,
  "webhook_auth_header_name": null,
  "speed_boost": false,
  "auto_highlights_result": null,
  "auto_highlights": false,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_audio_quality": null,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "content_safety": false,
  "iab_categories": true,
  "content_safety_labels": {
    "status": "unavailable",
    "results": [],
    "summary": {}
  },
  "language_detection": false,
  "language_detection_threshold": null,
  "language_confidence": null,
  "custom_spelling": null,
  "throttled": false,
  "auto_chapters": true,
  "summarization": false,
  "summary_type": null,
  "summary_model": null,
  "custom_topics": false,
  "topics": [],
  "speech_threshold": null,
  "speech_model": "best",
  "chapters": [
    {
      "summary": "Enrico: How was IO? IO was fantastic. Have heard fantastic things about your workshops. We worked on swarm intelligence and collective intelligence things. Summer is coming.",
      "gist": "In the Elevator With Moritz",
      "headline": "Enrico: How are you recovering from your New York visit",
      "start": 15600,
      "end": 78818,
      "id": "ep_24_ch_0"
    },
    {
      "summary": "Last week I was in Rio for a tour. That was amazing. Amazing place. Now I want to go back there in winter. Nothing big lined up right now.",
      "gist": "President Trump on his trips to Rio",
      "headline": "No more trips in the summer or what? Yeah, I'm always traveling",
      "start": 78874,
      "end": 111100,
      "id": "ep_24_ch_1"
    },
    {
      "summary": "Today we are going to talk about the vast challenge. It is organized every year at the Visweek Conference. We have Professor George Greenstein from UMass Lowell and Celeste Paul from the National Security Agency. They will discuss their research on visual analytics.",
      "gist": "The VINTAGE Challenge",
      "headline": "Today we talk about the vast challenge, which is a very special challenge",
      "start": 111680,
      "end": 293110,
      "id": "ep_24_ch_2"
    },
    {
      "summary": "The vast challenge started in 2006. It's the only contest or challenge in this area that has been organized by academics. The goal is to embed ground truth in synthetic or quasi real data sets. The aim is to measure the capabilities of visual systems, as well as analysis.",
      "gist": "The Vast Challenge",
      "headline": "The vast challenge is the only contest or challenge in this area organized by academics",
      "start": 294850,
      "end": 506650,
      "id": "ep_24_ch_3"
    },
    {
      "summary": "The vast challenge is searching for having this ground truth. We generated one of the first data sets with text as part of our first challenge. Now, when we have text data, there's no such need for us to generate intermediary datasets. You can see the rapid evolution of technology.",
      "gist": "The VINTAGE Challenge",
      "headline": "The vast challenge focuses on evaluating how much ground truth is covered by entries",
      "start": 507110,
      "end": 596946,
      "id": "ep_24_ch_4"
    },
    {
      "summary": "PNNL takes inspiration from other computer science based challenges like the KDD cup. Can you estimate how much time goes into constructing these datasets? I could imagine must be like hundreds of hours, right?",
      "gist": "The VIBM Challenge",
      "headline": "Can you estimate how much time goes into constructing these datasets? I could imagine",
      "start": 597138,
      "end": 1077650,
      "id": "ep_24_ch_5"
    },
    {
      "summary": "George: Are you starting from, from some real data sets and manipulating them, or it's all synthetic data? Both. We do set up virtual networks to generate the data. The data sets we generate will be used for many, many years by classes and other researchers and companies.",
      "gist": "Network Security: The quality of the data",
      "headline": "So are you starting from, from some real data sets or synthetic data",
      "start": 1077950,
      "end": 1524710,
      "id": "ep_24_ch_6"
    },
    {
      "summary": "In other words, anyone who submitted something, the answer is yes. Do you have, for the past editions, do you also have the solutions? Not the solutions, the entries online. So people can go there and also see what the others have done.",
      "gist": "The Art of Sudoku",
      "headline": "Do you also have the solutions for past editions of the magazine",
      "start": 1524830,
      "end": 1550586,
      "id": "ep_24_ch_7"
    },
    {
      "summary": "The vast challenge 2013 has three challenges. One is more predictive, analytic visual analytics, and the other two are cybersecurity related. The challenge has been running for the past six months. There have been close to 100 registrants.",
      "gist": "Top Executives: VIBM VISION 2013",
      "headline": "The vast challenge 2013 has three challenges involving predictive, analytic visual analytics",
      "start": 1550738,
      "end": 1790330,
      "id": "ep_24_ch_8"
    },
    {
      "summary": "The challenge focuses more on the human part of the visualization problem than the data and the processing part. This is the first year for the challenge. With the way that the challenge is designed, we have no idea how many people might actually participate.",
      "gist": "The 2013 Network Data Visualization Challenge",
      "headline": "George Straxer: We have two new visualization challenges this year",
      "start": 1791990,
      "end": 2235470,
      "id": "ep_24_ch_9"
    },
    {
      "summary": "Third mini challenge is the really big data challenge. It's the third challenge in a series of cybersecurity situation awareness challenges. This year's challenge in terms of size is 91 million records. We're very interested to see how well people deal with the complexity.",
      "gist": "The Cybersecurity Conference 2017 Mini Challenges",
      "headline": "Third mini challenge is the really big data challenge for cybersecurity situation awareness",
      "start": 2235900,
      "end": 2572670,
      "id": "ep_24_ch_10"
    },
    {
      "summary": "We're pretty broad on evaluating a submission from many, many different aspects. We focus on the justification through the analysis and not just finding something. We want to encourage people to take that approach whenever they're creating their analytics.",
      "gist": "How do you evaluate the Data Science Challenges?",
      "headline": "How do you evaluate entries for the mini challenge three",
      "start": 2573130,
      "end": 2749578,
      "id": "ep_24_ch_11"
    },
    {
      "summary": "In order to participate, not necessarily, you have to build your own tools. It's certainly possible to use existing tools to solve the problem. But building your own custom tools allow a lot of flexibility in terms of how you process large amounts of data.",
      "gist": "How to participate in the Vast Challenge",
      "headline": "In order to participate, not necessarily, you have to build your own tools",
      "start": 2749754,
      "end": 3110942,
      "id": "ep_24_ch_12"
    },
    {
      "summary": "The vast challenge looks at analysis, visualization, and the human as a system to work together. Every single submission gets reviewed by at least two people, one subject matter expert and one visualization expert. Can you engage with the other participants before submitting and with the committee?",
      "gist": "The VISION Vast Challenge",
      "headline": "Why should someone participate to the vast challenge and why not other challenges",
      "start": 3111086,
      "end": 3439470,
      "id": "ep_24_ch_13"
    },
    {
      "summary": "The deadline for the contest this year is the end of the second week of July. Many people continue working on their submissions well past the deadline date. The vast challenge event lasts a full day. Do you give any kind of financial support in case it's needed for traveling?",
      "gist": "What is the VISA Challenge?",
      "headline": "The deadline for the contest this year is the second week of July",
      "start": 3440210,
      "end": 3564070,
      "id": "ep_24_ch_14"
    },
    {
      "summary": "It's not uncommon for commercial companies to submit. If you offer a visualization tool, I think it's perfect showcase if you manage to do something meaningful with it. It sounds like something, if you really dive into it, it can be very rewarding.",
      "gist": "The Competitors' Challenges",
      "headline": "There are lots of companies and business groups that do participate",
      "start": 3564770,
      "end": 3640780,
      "id": "ep_24_ch_15"
    },
    {
      "summary": "The vast challenge has real problems. It's a scenario with people that could happen out in the real world. How does it help making progress in visual analytics in general? Could be a whole genre, like telling fictional stories through data.",
      "gist": "The VINTAGE Data Challenge",
      "headline": "How does the vast data challenge help visual analytics in general",
      "start": 3642090,
      "end": 3979238,
      "id": "ep_24_ch_16"
    },
    {
      "summary": "The challenge is visual analytics for science and technology. At Viz, there is also a track for vast, specifically. Unofficially, it's linked to the vast track. But it's separate also, we run it completely separately. Next year we'll be in France.",
      "gist": "The VISION Conference: The Challenge",
      "headline": "The challenge is always co located with the vis conference",
      "start": 3979334,
      "end": 4071436,
      "id": "ep_24_ch_17"
    },
    {
      "summary": "Is there anything else you want to add about the Bas challenge? No, I think that we've discussed the impact and all of the activities that are involved. I really hope that some of our listeners will pick it up, even if there is not a lot of time until the deadline.",
      "gist": "The Baseline Challenge",
      "headline": "Bas challenge is one month long, and it's not easy at all",
      "start": 4071548,
      "end": 4147499,
      "id": "ep_24_ch_18"
    },
    {
      "summary": "Great. Well, thank you so much, Moritz. Enrico. Thank you for having us. Fantastic. Bye bye.",
      "gist": "Putin on immigration",
      "headline": "Great. Well, thank you so much, Moritz. Thank you for having us",
      "start": 4148650,
      "end": 4158106,
      "id": "ep_24_ch_19"
    }
  ],
  "disfluencies": false,
  "entity_detection": false,
  "sentiment_analysis": false,
  "sentiment_analysis_results": null,
  "entities": null,
  "speakers_expected": null,
  "summary": null,
  "custom_topics_results": null,
  "is_deleted": null,
  "episode_num": "24",
  "episode_metadata": {
    "speakers": [
      "Enrico Bertini",
      "Moritz Stefaner",
      "Georges Grinstein",
      "Celste Paul"
    ],
    "WPid": "87",
    "url": "https://datastori.es/podlove/file/130/s/feed/c/mp3/datastories-24.mp3",
    "episode_title": "The VAST Challenge: Visual Analytics Competitions with Synthetic Benchmark Data Sets"
  }
}