{
  "id": "b3997168-bbf5-467e-9c15-ae9b350643a2",
  "language_model": "assemblyai_default",
  "acoustic_model": "assemblyai_default",
  "language_code": "en_us",
  "status": "completed",
  "audio_url": "https://datastori.es/podlove/file/162/s/feed/c/mp3/Datastories-16.mp3",
  "utterances": [
    {
      "end": 6072,
      "speaker": "Enrico Bertini",
      "start": 5520,
      "text": "Okay.",
      "id": "ep_16_ut_0"
    },
    {
      "end": 12714,
      "speaker": "Moritz Stefaner",
      "start": 6110,
      "text": "Oh, now it says it's live, so you need to start again. I'm sorry, but it was great. I like the singing part.",
      "id": "ep_16_ut_1"
    },
    {
      "end": 33554,
      "speaker": "Enrico Bertini",
      "start": 23814,
      "text": "Hi, everyone. Data store is number 60. And yeah, in the first episode in 2013. I'm Moritz. How are you?",
      "id": "ep_16_ut_2"
    },
    {
      "end": 35694,
      "speaker": "Moritz Stefaner",
      "start": 33674,
      "text": "Hi, Enrico. I'm super great.",
      "id": "ep_16_ut_3"
    },
    {
      "end": 39746,
      "speaker": "Enrico Bertini",
      "start": 36754,
      "text": "We are again on the hangout. On the Google Hangout.",
      "id": "ep_16_ut_4"
    },
    {
      "end": 44534,
      "speaker": "Moritz Stefaner",
      "start": 39890,
      "text": "Yeah. Is it like, is it only me in the camera picture or is it you as well?",
      "id": "ep_16_ut_5"
    },
    {
      "end": 49858,
      "speaker": "Enrico Bertini",
      "start": 45714,
      "text": "I think it's only me when I speak and then you when you speak and so on.",
      "id": "ep_16_ut_6"
    },
    {
      "end": 52298,
      "speaker": "Moritz Stefaner",
      "start": 49946,
      "text": "Is it like that? We don't want to mess up anything.",
      "id": "ep_16_ut_7"
    },
    {
      "end": 55994,
      "speaker": "Enrico Bertini",
      "start": 52346,
      "text": "I can see it live. You know what happened the last time, right?",
      "id": "ep_16_ut_8"
    },
    {
      "end": 56978,
      "speaker": "Moritz Stefaner",
      "start": 56154,
      "text": "Exactly.",
      "id": "ep_16_ut_9"
    },
    {
      "end": 80194,
      "speaker": "Enrico Bertini",
      "start": 57106,
      "text": "We had Benjamin all the time. Yeah, yeah. So we have another episode here, and we thought about having some guests to talk about what happened in 2012, the major developments in this, and what is gonna happen in 2015. What are the major trends, right?",
      "id": "ep_16_ut_10"
    },
    {
      "end": 80802,
      "speaker": "Moritz Stefaner",
      "start": 80354,
      "text": "That's right.",
      "id": "ep_16_ut_11"
    },
    {
      "end": 95934,
      "speaker": "Enrico Bertini",
      "start": 80818,
      "text": "So we have three fantastic guests. We have Andrew Vande Moere. I always have problems spelling your name. I'm sorry. I'm improving. How are you? From info statics? I don't know if I have to say that.",
      "id": "ep_16_ut_12"
    },
    {
      "end": 98978,
      "speaker": "Andrew Vande Moere",
      "start": 96794,
      "text": "I think so, but, yeah, I'm fine.",
      "id": "ep_16_ut_13"
    },
    {
      "end": 103374,
      "speaker": "Enrico Bertini",
      "start": 99146,
      "text": "We already had you. We had you recently on the podcast.",
      "id": "ep_16_ut_14"
    },
    {
      "end": 105414,
      "speaker": "Andrew Vande Moere",
      "start": 104034,
      "text": "Yes, at the interview.",
      "id": "ep_16_ut_15"
    },
    {
      "end": 111374,
      "speaker": "Enrico Bertini",
      "start": 105914,
      "text": "I think you are one of the few ones who was invited twice so far.",
      "id": "ep_16_ut_16"
    },
    {
      "end": 113170,
      "speaker": "Andrew Vande Moere",
      "start": 111834,
      "text": "With this included.",
      "id": "ep_16_ut_17"
    },
    {
      "end": 114974,
      "speaker": "Enrico Bertini",
      "start": 113322,
      "text": "With this included. Yeah.",
      "id": "ep_16_ut_18"
    },
    {
      "end": 116386,
      "speaker": "Andrew Vande Moere",
      "start": 115314,
      "text": "Sorry for that.",
      "id": "ep_16_ut_19"
    },
    {
      "end": 117214,
      "speaker": "Enrico Bertini",
      "start": 116530,
      "text": "Yeah.",
      "id": "ep_16_ut_20"
    },
    {
      "end": 119906,
      "speaker": "Andrew Vande Moere",
      "start": 118154,
      "text": "Seems like you're not very happy about.",
      "id": "ep_16_ut_21"
    },
    {
      "end": 121138,
      "speaker": "Enrico Bertini",
      "start": 119970,
      "text": "I don't know if it's good or bad.",
      "id": "ep_16_ut_22"
    },
    {
      "end": 124402,
      "speaker": "Moritz Stefaner",
      "start": 121186,
      "text": "Yeah, we're running out of good guests. I missed that.",
      "id": "ep_16_ut_23"
    },
    {
      "end": 126174,
      "speaker": "Andrew Vande Moere",
      "start": 124578,
      "text": "Why did you ask him again?",
      "id": "ep_16_ut_24"
    },
    {
      "end": 133290,
      "speaker": "Enrico Bertini",
      "start": 127234,
      "text": "Then we have Andy Kirk from visualizing data. Good evening.",
      "id": "ep_16_ut_25"
    },
    {
      "end": 145014,
      "speaker": "Andy Kirk",
      "start": 133442,
      "text": "Good evening. Very well, thank you. This is my third episode. Expect a prize. Is that right?",
      "id": "ep_16_ut_26"
    },
    {
      "end": 148158,
      "speaker": "Enrico Bertini",
      "start": 145094,
      "text": "Wow. Prize. Yeah, you should. And.",
      "id": "ep_16_ut_27"
    },
    {
      "end": 150942,
      "speaker": "Andy Kirk",
      "start": 148326,
      "text": "Yeah, no, clearly.",
      "id": "ep_16_ut_28"
    },
    {
      "end": 154350,
      "speaker": "Moritz Stefaner",
      "start": 151038,
      "text": "And Andy's from visualizing data.com, i think. Did we mention.",
      "id": "ep_16_ut_29"
    },
    {
      "end": 155782,
      "speaker": "Andy Kirk",
      "start": 154502,
      "text": "Yeah, twice. That's good.",
      "id": "ep_16_ut_30"
    },
    {
      "end": 160406,
      "speaker": "Moritz Stefaner",
      "start": 155878,
      "text": "Okay. Visualizing with it. With an s, by the way, visualizing.",
      "id": "ep_16_ut_31"
    },
    {
      "end": 162140,
      "speaker": "Enrico Bertini",
      "start": 160470,
      "text": "Very British, right?",
      "id": "ep_16_ut_32"
    },
    {
      "end": 168840,
      "speaker": "Andy Kirk",
      "start": 162302,
      "text": "That's right. Unless you talk about my book, which is Zed. That's a bit.",
      "id": "ep_16_ut_33"
    },
    {
      "end": 174404,
      "speaker": "Enrico Bertini",
      "start": 168872,
      "text": "So, Andy, we started just a few minutes ago, and you're already advertising your stuff.",
      "id": "ep_16_ut_34"
    },
    {
      "end": 183964,
      "speaker": "Moritz Stefaner",
      "start": 176104,
      "text": "There must be a button to get rid of these types of people. Spam bots everywhere.",
      "id": "ep_16_ut_35"
    },
    {
      "end": 191472,
      "speaker": "Enrico Bertini",
      "start": 187104,
      "text": "And then we have Brian Connor from the y axis. Hi, Brian. How are you?",
      "id": "ep_16_ut_36"
    },
    {
      "end": 194324,
      "speaker": "Bryan Connor",
      "start": 191488,
      "text": "Hello there, guys. This is my first episode.",
      "id": "ep_16_ut_37"
    },
    {
      "end": 196566,
      "speaker": "Moritz Stefaner",
      "start": 196134,
      "text": "But I.",
      "id": "ep_16_ut_38"
    },
    {
      "end": 199194,
      "speaker": "Bryan Connor",
      "start": 196590,
      "text": "Think you linked to me at least once before.",
      "id": "ep_16_ut_39"
    },
    {
      "end": 201902,
      "speaker": "Enrico Bertini",
      "start": 200854,
      "text": "How is it going?",
      "id": "ep_16_ut_40"
    },
    {
      "end": 204074,
      "speaker": "Bryan Connor",
      "start": 202038,
      "text": "It's going well. Thanks for having me on.",
      "id": "ep_16_ut_41"
    },
    {
      "end": 215874,
      "speaker": "Enrico Bertini",
      "start": 205494,
      "text": "Yeah, you're welcome. It's great to have you on the. On this episode. So maybe this might be the first one of a long series, as the other guys hope so.",
      "id": "ep_16_ut_42"
    },
    {
      "end": 219114,
      "speaker": "Andy Kirk",
      "start": 216774,
      "text": "So we want to be prizes, Brian.",
      "id": "ep_16_ut_43"
    },
    {
      "end": 220994,
      "speaker": "Bryan Connor",
      "start": 219574,
      "text": "No prizes. No.",
      "id": "ep_16_ut_44"
    },
    {
      "end": 227320,
      "speaker": "Enrico Bertini",
      "start": 221294,
      "text": "No prizes. I'm still waiting for the gift from Santa. Andy.",
      "id": "ep_16_ut_45"
    },
    {
      "end": 228696,
      "speaker": "Andy Kirk",
      "start": 227472,
      "text": "It's coming. Don't worry.",
      "id": "ep_16_ut_46"
    },
    {
      "end": 229136,
      "speaker": "Enrico Bertini",
      "start": 228720,
      "text": "It's coming.",
      "id": "ep_16_ut_47"
    },
    {
      "end": 230804,
      "speaker": "Andy Kirk",
      "start": 229200,
      "text": "Okay. He's coming.",
      "id": "ep_16_ut_48"
    },
    {
      "end": 243856,
      "speaker": "Enrico Bertini",
      "start": 231384,
      "text": "Okay, so we want to talk about major developments and trends in 2012 and in the future, 2013. So, Brian, maybe you want to start talking about what happened in 2012.",
      "id": "ep_16_ut_49"
    },
    {
      "end": 299734,
      "speaker": "Bryan Connor",
      "start": 244000,
      "text": "Sure. Yeah. I put together a little list of things, but one of the first things I saw was a really strong increase in a lot of, like, education and training around data visualization. And I think part of that comes from, you know, the training courses that Andy's been working on. Andy came to Baltimore and we looked at the course and we did. I took part in his course in Baltimore and. But there's a lot of other things, too. I've been working on a program at Mica, which is a master's program in information visualization. And there's also been Alberto Cairo's massive online course and data visualization, a couple other things, too. And so that's one strong trend. I've also seen interest in other areas, but nothing sort of developed yet. I've seen a little bit of interest from Lynda.com in doing some dataviz things, but nothing developed from that yet.",
      "id": "ep_16_ut_50"
    },
    {
      "end": 301834,
      "speaker": "Enrico Bertini",
      "start": 301154,
      "text": "It's true.",
      "id": "ep_16_ut_51"
    },
    {
      "end": 302250,
      "speaker": "Andy Kirk",
      "start": 301874,
      "text": "It's true.",
      "id": "ep_16_ut_52"
    },
    {
      "end": 309734,
      "speaker": "Enrico Bertini",
      "start": 302282,
      "text": "Education has been a big thing this year. And I hear some noise. Somebody has a cell phone or something.",
      "id": "ep_16_ut_53"
    },
    {
      "end": 319672,
      "speaker": "Moritz Stefaner",
      "start": 311314,
      "text": "Maybe that's me again. Also, I discovered I have to switch, actually, who's in the picture. So you do that manually.",
      "id": "ep_16_ut_54"
    },
    {
      "end": 321528,
      "speaker": "Andy Kirk",
      "start": 319728,
      "text": "Now you're the tv producer.",
      "id": "ep_16_ut_55"
    },
    {
      "end": 327992,
      "speaker": "Moritz Stefaner",
      "start": 321656,
      "text": "Yeah. So I'll keep it on me just for convenience.",
      "id": "ep_16_ut_56"
    },
    {
      "end": 330284,
      "speaker": "Enrico Bertini",
      "start": 328128,
      "text": "But there should be a way to make it automatic.",
      "id": "ep_16_ut_57"
    },
    {
      "end": 340844,
      "speaker": "Moritz Stefaner",
      "start": 331104,
      "text": "I mean, it is automatic in your normal chat. But right now I think I'm controlling who's in the final recording, who's visible. So right now it's you, Enrico.",
      "id": "ep_16_ut_58"
    },
    {
      "end": 346608,
      "speaker": "Enrico Bertini",
      "start": 341624,
      "text": "Okay, so anyway, yeah, but just so.",
      "id": "ep_16_ut_59"
    },
    {
      "end": 352434,
      "speaker": "Moritz Stefaner",
      "start": 346656,
      "text": "If I'm a bit, like, preoccupied, don't get confused. I have to change the camera.",
      "id": "ep_16_ut_60"
    },
    {
      "end": 355462,
      "speaker": "Enrico Bertini",
      "start": 352894,
      "text": "At least this time it's on you. It's up to you.",
      "id": "ep_16_ut_61"
    },
    {
      "end": 473684,
      "speaker": "Andy Kirk",
      "start": 355518,
      "text": "But just. Just to pick up on Brian's opening point there. I think it's. From my perspective, it's been interesting to see the growth in people being interested in receiving training, not just in public courses, but also in organizational, private settings. You know, the sheer volume of signups on Alberto's course is quite staggering. I think he's probably reached the 5000 limit now for the next, the second course. And I think that's testament to probably just the general awareness of data visualization, just the sheer, I guess, recognition of what that term actually means. Now I think that's always been a barrier to the growth of the field, people just even knowing what the name is of what this discipline is. So I think that's, I would expect myself to see that grow in the next twelve months and beyond, really in terms of a key development. But I guess from my point of view, obviously I've done a couple of posts over the last year to summarize my own view of the top things that developed. And I think one of the standout trends has definitely been the take up of and development of D3, where I think it was maybe 18 months, two years now since it first came on the scene. And the explosion in usage, particularly over the last twelve months, I think has been staggering. And I guess the high profile appointment of Mike Bostock at the MIT has been a significant catalyst for that. But also the tutorials that you see from the likes of Scott Murray and Jerome and Jim. And there are a lot of people now sharing and creating a community around this programming environment that processing has had for 510 years. So I think that has really been a key trend. And some of the work that's going into D3 developments these days is fantastic.",
      "id": "ep_16_ut_62"
    },
    {
      "end": 480324,
      "speaker": "Enrico Bertini",
      "start": 474104,
      "text": "So did any of you guys give a look to Alberto Cairo's online course.",
      "id": "ep_16_ut_63"
    },
    {
      "end": 490036,
      "speaker": "Andy Kirk",
      "start": 482064,
      "text": "Personally? No. Alberto suggested it wasn't necessarily for us as a demographic, but I mean, obviously for those who are new to the.",
      "id": "ep_16_ut_64"
    },
    {
      "end": 497304,
      "speaker": "Enrico Bertini",
      "start": 490060,
      "text": "Subject, it's, I mean, just out of curiosity to see how he organized it and what kind of content he put there.",
      "id": "ep_16_ut_65"
    },
    {
      "end": 512024,
      "speaker": "Moritz Stefaner",
      "start": 498084,
      "text": "I think it was limited so you couldn't access it after a while. So I tried to get in, but. But then it was full already and the first one was just a few hundred people, I think. And now it's, it's thousand. So you're right, I missed it again. To sign up.",
      "id": "ep_16_ut_66"
    },
    {
      "end": 517433,
      "speaker": "Andrew Vande Moere",
      "start": 514484,
      "text": "You really need a course, Moritz. You really need one.",
      "id": "ep_16_ut_67"
    },
    {
      "end": 526709,
      "speaker": "Moritz Stefaner",
      "start": 517603,
      "text": "Yeah. Need to brush up my feelings before. But no, but I think it would be really interesting in how he approaches.",
      "id": "ep_16_ut_68"
    },
    {
      "end": 544916,
      "speaker": "Andy Kirk",
      "start": 526741,
      "text": "It, especially from a purely introductory perspective as well. You know, how do you get people over that first obstacle of what is this subject? And all the different, as we've talked about in previous episodes, all the different subjects that converge into one? And that's not easy feat, really.",
      "id": "ep_16_ut_69"
    },
    {
      "end": 546916,
      "speaker": "Bryan Connor",
      "start": 545060,
      "text": "Yeah, absolutely.",
      "id": "ep_16_ut_70"
    },
    {
      "end": 571824,
      "speaker": "Moritz Stefaner",
      "start": 547060,
      "text": "But I'd like to second on the Mike Bostock at the D3 thing. So if I would have to pick a person in Infowars. Like, the biggest person would definitely be Mike this year. I mean, he's done fantastic work with the New York Times in the few months he's been there, really. And D3 alone is such a masterpiece. And as you say, it's growing. And it's not just centered around him, but there's like at least five or ten people who are really, really involved with the whole.",
      "id": "ep_16_ut_71"
    },
    {
      "end": 591394,
      "speaker": "Andy Kirk",
      "start": 573054,
      "text": "That's right. There's a pyramid developing and, you know, the inclusion or the launch of books. So we had Mike Dewar's book a few months ago, and now Scott's kind of going through the process of releasing a sort of beta version and a full published version. So, you know, that will only help people come into its usage. Really.",
      "id": "ep_16_ut_72"
    },
    {
      "end": 595806,
      "speaker": "Moritz Stefaner",
      "start": 594254,
      "text": "Interesting. Yeah.",
      "id": "ep_16_ut_73"
    },
    {
      "end": 628894,
      "speaker": "Bryan Connor",
      "start": 595830,
      "text": "I think it also has implications for something else that I pulled out was sort of, you know, the. I mean, obviously a big part of the D3 is the degree to which you can interact with the data itself and sort of play with it and transform it as a user. And I think that's sort of like another thing that I saw gain a lot of ground in the past year was partially because of D3, but just in general, sort of the user interface and sort of the experience of actually working with the data and maybe trying to explore some things within it itself.",
      "id": "ep_16_ut_74"
    },
    {
      "end": 655458,
      "speaker": "Moritz Stefaner",
      "start": 631594,
      "text": "Yeah, I mean, what's interesting for me coming from flash is these whole new workflows that you can have because it's svg. So you can export an svg, reopen it in illustrator and do some tweaking for print, or you can start with an illustrator file, load it into a web page, and then start to modify parts of the graphics. And for me, that's been the. I still haven't figured out what that actually means, but it's been quite interesting to work with that a lot.",
      "id": "ep_16_ut_75"
    },
    {
      "end": 656114,
      "speaker": "Enrico Bertini",
      "start": 655506,
      "text": "Yeah, yeah.",
      "id": "ep_16_ut_76"
    },
    {
      "end": 679754,
      "speaker": "Moritz Stefaner",
      "start": 656194,
      "text": "And the demand for these integrated workflows, where you have an interactive visualization and print pieces produced out of that, that might link back, deep link into the interactive pieces. I've heard that so often, and it's now we are really getting closer there to have nice integrated workflows between print and interactive there. Oh, yeah, that's one of the predictions 2013 for me.",
      "id": "ep_16_ut_77"
    },
    {
      "end": 682814,
      "speaker": "Andrew Vande Moere",
      "start": 681014,
      "text": "So we finished now, did we?",
      "id": "ep_16_ut_78"
    },
    {
      "end": 684674,
      "speaker": "Moritz Stefaner",
      "start": 682934,
      "text": "Yeah, I did my part.",
      "id": "ep_16_ut_79"
    },
    {
      "end": 694174,
      "speaker": "Enrico Bertini",
      "start": 687874,
      "text": "Okay. So basically, big developments were education D3. What else?",
      "id": "ep_16_ut_80"
    },
    {
      "end": 715652,
      "speaker": "Andrew Vande Moere",
      "start": 695034,
      "text": "I think the democratization now of the infographics, if you all know many eyes, that was called the democratization of dataviz. Everybody can visualize their own data. And now I made a list. I came to like already a big list we have revu visualize me visually. Venngage.",
      "id": "ep_16_ut_81"
    },
    {
      "end": 716060,
      "speaker": "Moritz Stefaner",
      "start": 715708,
      "text": "Sorry.",
      "id": "ep_16_ut_82"
    },
    {
      "end": 749444,
      "speaker": "Andrew Vande Moere",
      "start": 716132,
      "text": "Visible easily an infogram, but I probably forgot a few which all to have some business plan on top of having people make so people can get to make their own infographics of their resume, of their social media data, of their gps running and everything like that. And that all happened in this year, I think, and a bit of lost here, which seems to be something. I mean, is it, do you think it's useful? Do you think it will be successful?",
      "id": "ep_16_ut_83"
    },
    {
      "end": 774604,
      "speaker": "Andy Kirk",
      "start": 750224,
      "text": "Well, just to pick up on that, I think that's an interesting observation because I think also from the perspective of being a blogger, I've seen a reduction in the amount of terrible graphics tower posters, infographics being requested for me to put on the site. And I've noticed there's been less kind of working their way around the bloggers fair and Twitter sphere. And I wonder if the.",
      "id": "ep_16_ut_84"
    },
    {
      "end": 777604,
      "speaker": "Andrew Vande Moere",
      "start": 774724,
      "text": "You got a reduction of people emailing you for infographics?",
      "id": "ep_16_ut_85"
    },
    {
      "end": 777884,
      "speaker": "Andy Kirk",
      "start": 777644,
      "text": "Yeah.",
      "id": "ep_16_ut_86"
    },
    {
      "end": 783984,
      "speaker": "Andrew Vande Moere",
      "start": 777924,
      "text": "Okay, I'll forward them to you then. I get about five per day.",
      "id": "ep_16_ut_87"
    },
    {
      "end": 804014,
      "speaker": "Andy Kirk",
      "start": 785084,
      "text": "I do think that, you know, a venue or a place, a platform such as visually in this last year is really kind of given that all these people, a place to home in on and publish these without having to go through, I guess, necessary blog editors in the traditional sense. So I think it's. I think it's kind of clear.",
      "id": "ep_16_ut_88"
    },
    {
      "end": 806622,
      "speaker": "Moritz Stefaner",
      "start": 804054,
      "text": "You mean there's ghettos now for these types of people?",
      "id": "ep_16_ut_89"
    },
    {
      "end": 855706,
      "speaker": "Andy Kirk",
      "start": 806798,
      "text": "There's an underground ghetto. That's right. Towers hang out. But I think we solved that problem. Well, there's themes of Batman there. But I think what's interesting, therefore, is it's allowed the better quality to emerge. And I've certainly picked out a few good quality infographics this year that really stood out where in the past they may have been clouded out from being visible by all this noise that we've seen. So, Percy speaking, going back to Andrew's question, I have not used, I don't think any of those tools particularly, but I have seen, you know, people use them and they do seem to have certainly got a market and a population out there that do require these tools. So, you know, you know, good for them. Hope they do well.",
      "id": "ep_16_ut_90"
    },
    {
      "end": 875272,
      "speaker": "Andrew Vande Moere",
      "start": 855770,
      "text": "Yeah, it's also getting popular in other sense. And I noticed that people are using them in their PowerPoints. For instance, instead of having a picture of trees, when they talk about sustainability, they take an infographics. They're googled somewhere that says some sort of fact about sustainability. So it's, it's becoming like the new stock image for PowerPoints.",
      "id": "ep_16_ut_91"
    },
    {
      "end": 876240,
      "speaker": "Bryan Connor",
      "start": 875408,
      "text": "Interesting.",
      "id": "ep_16_ut_92"
    },
    {
      "end": 902060,
      "speaker": "Moritz Stefaner",
      "start": 876392,
      "text": "Yeah, yeah. And I mean, the word clouds are not, you cannot kill them anyway, so they have become part of any good PowerPoint presentation. Anyways, I got a few requests to do a few of these this year, so most of the time I could battle it, but I did one, I won't say for them. So more trends. How about academic trends?",
      "id": "ep_16_ut_93"
    },
    {
      "end": 968294,
      "speaker": "Enrico Bertini",
      "start": 902192,
      "text": "Yeah, this is what I was going to mention. You know me well, Moritz, I think. No, I mean a connected trend. I think that very slowly researchers in academic set, academic settings are realizing that there are other aspects other than efficiency. And that's happening very slowly. But for instance, this year at this week at the this week conference, we had a couple or even more papers that were a little more focused on other aspects or even the idea of using visualization not only as a discovery or exploratory tool, but also as a communication tool. Because this is what is happening out of academia. People are basically using visualization as a way to communicate something. And there is a huge gap in terms of research about how to use visualization as a communication tool. And I have seen some little new pieces of research coming up and I think we are going to have more of this in the future.",
      "id": "ep_16_ut_94"
    },
    {
      "end": 976094,
      "speaker": "Andy Kirk",
      "start": 968794,
      "text": "And did that manifest itself for you, Enrico and Andrew, I think you were there as well in a more successful biz week.",
      "id": "ep_16_ut_95"
    },
    {
      "end": 979234,
      "speaker": "Enrico Bertini",
      "start": 977794,
      "text": "Sorry, can you say it again?",
      "id": "ep_16_ut_96"
    },
    {
      "end": 984352,
      "speaker": "Andy Kirk",
      "start": 979354,
      "text": "Did that manifest itself into a more successful biz week from your perspectives?",
      "id": "ep_16_ut_97"
    },
    {
      "end": 1058773,
      "speaker": "Enrico Bertini",
      "start": 984538,
      "text": "You mean the last one? It's hard to tell, honestly, maybe I'm very biased, but this week for me is always great. So it's really hard to tell whether one is better than another. It's true that this year we had this year and last year we had a few papers that were really, really interesting and out of the normal way of, standard way of seeing at this. So for instance, this year we had a nice study, I saw a nice study about how to communicate, how to understand. How was it? Bayesian inference with visualization, which sounds like something complicated, but basically it's when you have to, when you have to visually communicate information about probabilities. There was a very interesting study that actually demonstrate, kind of demonstrated that visualization doesn't really help, but it's important. This kind of studies are really important. It's more complicated than that. But no, I mean, it's important to tell people when visualization doesn't help. Right? And why it doesn't help.",
      "id": "ep_16_ut_98"
    },
    {
      "end": 1060933,
      "speaker": "Moritz Stefaner",
      "start": 1058933,
      "text": "Yeah, but only afterwards, right?",
      "id": "ep_16_ut_99"
    },
    {
      "end": 1063273,
      "speaker": "Andy Kirk",
      "start": 1061093,
      "text": "Yeah, after.",
      "id": "ep_16_ut_100"
    },
    {
      "end": 1076846,
      "speaker": "Enrico Bertini",
      "start": 1065333,
      "text": "No, but I mean the reason why I'm mentioning this study is more. Because the study is much more focused on using visualization as a communication tool. Right. Rather than discovery and exploration and that sense.",
      "id": "ep_16_ut_101"
    },
    {
      "end": 1083854,
      "speaker": "Andrew Vande Moere",
      "start": 1076870,
      "text": "I remember a paper about where they were comparing different PowerPoint presentations about the same subject.",
      "id": "ep_16_ut_102"
    },
    {
      "end": 1084878,
      "speaker": "Enrico Bertini",
      "start": 1084014,
      "text": "Yeah, yeah, exactly.",
      "id": "ep_16_ut_103"
    },
    {
      "end": 1091702,
      "speaker": "Andrew Vande Moere",
      "start": 1084926,
      "text": "Whether people from a different academic background are communicating the same concept in a different visual way, which was quite interesting.",
      "id": "ep_16_ut_104"
    },
    {
      "end": 1098944,
      "speaker": "Enrico Bertini",
      "start": 1091878,
      "text": "Yeah, exactly. And I think the other one I want to mention is from Andrew. He actually presented a paper where.",
      "id": "ep_16_ut_105"
    },
    {
      "end": 1101732,
      "speaker": "Andy Kirk",
      "start": 1101444,
      "text": "You.",
      "id": "ep_16_ut_106"
    },
    {
      "end": 1103212,
      "speaker": "Enrico Bertini",
      "start": 1101748,
      "text": "Don't want to speak about that. It's okay.",
      "id": "ep_16_ut_107"
    },
    {
      "end": 1104140,
      "speaker": "Moritz Stefaner",
      "start": 1103228,
      "text": "It's okay.",
      "id": "ep_16_ut_108"
    },
    {
      "end": 1158014,
      "speaker": "Enrico Bertini",
      "start": 1104332,
      "text": "I mean, no, really. I think it was a really nice piece of research. And again, a little unconventional compared to the stuff that people present there normally. And again, Andrew tried to set up a study to see what's the impact of aesthetics and in visualization. And again, I think it's a first interesting step that is. And it's one kind of study that doesn't necessarily focus on efficiency. Right. So we are little by little discovering that efficiency is important, but there are other aspects that come into place and which are also dependent on the context in which you put a given visualization. So a visualization doesn't exist in a vacuum. Right. So you cannot. You can never tell whether a visualization is good or bad unless you put it in a specific context. I don't know. Maybe you, Andrew, you want to add anything about something about that?",
      "id": "ep_16_ut_109"
    },
    {
      "end": 1168094,
      "speaker": "Andrew Vande Moere",
      "start": 1158874,
      "text": "Yeah, well, that's sort of the thing I was. I'm trying to look for, but it's not very easy to kind of come up with a scientific way to do that. And, Erica, you tried as well?",
      "id": "ep_16_ut_110"
    },
    {
      "end": 1171026,
      "speaker": "Enrico Bertini",
      "start": 1168634,
      "text": "I tried as well. It's really hard.",
      "id": "ep_16_ut_111"
    },
    {
      "end": 1219044,
      "speaker": "Andrew Vande Moere",
      "start": 1171130,
      "text": "Yes, it's very hard to kind of prove, for instance, you say aesthetics, but I try to. Not to use the word, I try to say style because aesthetics, many people kind of different reactions to that, but I think it's correct what you say. So if you use visualization for communication and we see all these designers being very successful, why are they. Why are they successful? And what is success? You could say there's a number of hits that maybe also successful in other ways that common tools cannot do. So we're trying to find these kind of. What are these qualities that designers can bring in visualization? Because then maybe, you know, scientists will incorporate them if we have some numerical proof, for instance. Yeah, it's not an easy task.",
      "id": "ep_16_ut_112"
    },
    {
      "end": 1261564,
      "speaker": "Enrico Bertini",
      "start": 1219464,
      "text": "Sure. Once again, I hear a strange noise. I'm sorry, I have a mobile phone. It must be a mobile phone from somebody. Okay, looks. It's better. So if I. If I have to predict something for 2013 or even 14. I think researchers will have to catch up with what has been happening in the, in the real world. I think right now we have a lot of development, a lot of development to using visualization for storytelling, communication, all these sorts of things. And research is not very well developed in this area. And my prediction is that it's going to be, we're going to see more and more studies in this direction. That's going to happen, I'm sure.",
      "id": "ep_16_ut_113"
    },
    {
      "end": 1271994,
      "speaker": "Andrew Vande Moere",
      "start": 1263224,
      "text": "I also want to mention this. That was also a very popular topic this week. I think there were two papers, or three papers even.",
      "id": "ep_16_ut_114"
    },
    {
      "end": 1273006,
      "speaker": "Enrico Bertini",
      "start": 1272294,
      "text": "Yeah.",
      "id": "ep_16_ut_115"
    },
    {
      "end": 1300704,
      "speaker": "Andrew Vande Moere",
      "start": 1273150,
      "text": "About touchiness and adding more. It's an aesthetic style again, on top of a visualization. And people were researching how that could be useful, and that was kind of, seemed to be kind of giving a buzz to the whole room at this week. Not sure if that people will pick it up in 2013. And can you make it more useful than what was shown at the conference? Because it was not immediately obvious what it could be used for, but people were quite enthusiastic about it.",
      "id": "ep_16_ut_116"
    },
    {
      "end": 1341088,
      "speaker": "Moritz Stefaner",
      "start": 1301404,
      "text": "I think I also noticed that anything that brings back that human factor into data immediately resonates with people. And that could be graphical style or the way you think about data, like how much you bring it into people's lives or what type of data you use. That's, that's been a big thing last year, that also the handmade things like Natalie Miebach, Stephanie Posavec, like really handcrafting visualizations. The whole density design lab, you know, also has this, the work coming from there has this quality that it has been touched by a hand, you know, before it sort of leaves the press.",
      "id": "ep_16_ut_117"
    },
    {
      "end": 1344040,
      "speaker": "Andy Kirk",
      "start": 1341136,
      "text": "Yeah. And the stuff that goes on the way for doing.",
      "id": "ep_16_ut_118"
    },
    {
      "end": 1344964,
      "speaker": "Enrico Bertini",
      "start": 1344232,
      "text": "Yeah.",
      "id": "ep_16_ut_119"
    },
    {
      "end": 1356394,
      "speaker": "Moritz Stefaner",
      "start": 1346664,
      "text": "Yeah. And I think that's, that's been quite a trend as well, that these, these very personal, handmade human things.",
      "id": "ep_16_ut_120"
    },
    {
      "end": 1359114,
      "speaker": "Enrico Bertini",
      "start": 1357574,
      "text": "Yeah, yeah.",
      "id": "ep_16_ut_121"
    },
    {
      "end": 1374310,
      "speaker": "Moritz Stefaner",
      "start": 1359534,
      "text": "Well, the other thing is, you touched on it already briefly, is, of course, storytelling. So I think the years before, everybody was, like, talking about storytelling, and now people actually did it. I think it actually happened and people figure out how it works and.",
      "id": "ep_16_ut_122"
    },
    {
      "end": 1381514,
      "speaker": "Bryan Connor",
      "start": 1374502,
      "text": "Yeah, that's very true. I mean, it kind of goes away from being a buzzword and you can actually, you know, kind of like, see examples of it more and more.",
      "id": "ep_16_ut_123"
    },
    {
      "end": 1383052,
      "speaker": "Andy Kirk",
      "start": 1382724,
      "text": "Yeah.",
      "id": "ep_16_ut_124"
    },
    {
      "end": 1421828,
      "speaker": "Enrico Bertini",
      "start": 1383068,
      "text": "And that's the thing I wanted to mention again, related to what I was saying is that I think that the development we will see in academia and out of academia is not only on studying how people. How people use visualization to communicate or how people perceive certain features or visualizations in a given context or whatever. It's also that I think we will see more and more technological development in this area and from research as well. So what I expect to see is researchers coming up with new tools or techniques to help people develop visualizations that are more targeted towards storytelling, communication, this kind of stuff.",
      "id": "ep_16_ut_125"
    },
    {
      "end": 1447454,
      "speaker": "Bryan Connor",
      "start": 1421996,
      "text": "So I wonder, Enrico, if from an academic perspective, you've seen anything or whether this would be related, kind of from a research perspective. But I've been seeing sort of like a lot of ties between data visualization and actually sort of like graphic novels or comic book design. And I wonder if there's a body of research sort of, around how storytelling works in those scenarios, and, you know, whether or not that could be applicable to data visualization.",
      "id": "ep_16_ut_126"
    },
    {
      "end": 1510284,
      "speaker": "Enrico Bertini",
      "start": 1448634,
      "text": "Again, I think the way I see that, we are in a kind of situation where research has to catch up with what has been happening during the last year or so. And during our last episode, we, our last episode was with Robert Kosara. And I know he's been mentioning that he's doing research in storytelling at Tableau. And I'm sure they will be publishing stuff. I'm totally sure that they're going to publish stuff, either or even both in the area of user studies or new technological development. So for sure, 100%, we're going to see something out of this lab. But, you know, people are always looking what the others do. A consequence would be that other researchers will be focusing more on this area, because so far, very, very few researchers have been doing this kind of research. That's why I'm predicting then in one year or even two years, many more researchers will be focusing on this kind of stuff. But no, the answer is actually.",
      "id": "ep_16_ut_127"
    },
    {
      "end": 1513924,
      "speaker": "Moritz Stefaner",
      "start": 1512384,
      "text": "Oops, there he goes.",
      "id": "ep_16_ut_128"
    },
    {
      "end": 1516684,
      "speaker": "Andrew Vande Moere",
      "start": 1514224,
      "text": "That was too controversial. I had to kick him out.",
      "id": "ep_16_ut_129"
    },
    {
      "end": 1521604,
      "speaker": "Moritz Stefaner",
      "start": 1518944,
      "text": "Somebody kicked him. The answer is actually.",
      "id": "ep_16_ut_130"
    },
    {
      "end": 1525514,
      "speaker": "Andy Kirk",
      "start": 1524094,
      "text": "The murderer walls.",
      "id": "ep_16_ut_131"
    },
    {
      "end": 1560526,
      "speaker": "Moritz Stefaner",
      "start": 1527894,
      "text": "But just to add to that, for the storytelling, I think there's quite a few more tools also now popping up that support. One I came across is called popcorn from Mozilla Labs, and it allows you just to put things in sequence, you know, and put a narrative behind them. You can sort of mix media and make exactly the thing that everybody's looking for is this sort of half interactive movie type thing. And one prediction for 2013, there will be more tools in this direction, because at the moment it's very hard to do nice narratives, animated narratives.",
      "id": "ep_16_ut_132"
    },
    {
      "end": 1568846,
      "speaker": "Andrew Vande Moere",
      "start": 1560590,
      "text": "So would that be like the infographics tools that I mentioned before? If they make it more animated, would that be the similar thing, or would.",
      "id": "ep_16_ut_133"
    },
    {
      "end": 1585944,
      "speaker": "Moritz Stefaner",
      "start": 1568870,
      "text": "They still be different? I think it's a difference, in a sense, that what visually does is more like a template you can fill with your own data. It's like you pour your data in a pre made like thing, and popcorn is more like a movie maker or a tool that allows you to create your own.",
      "id": "ep_16_ut_134"
    },
    {
      "end": 1587920,
      "speaker": "Andrew Vande Moere",
      "start": 1585984,
      "text": "But these things could be merged, probably.",
      "id": "ep_16_ut_135"
    },
    {
      "end": 1589240,
      "speaker": "Moritz Stefaner",
      "start": 1588032,
      "text": "Exactly. There's a middle ground.",
      "id": "ep_16_ut_136"
    },
    {
      "end": 1589640,
      "speaker": "Andy Kirk",
      "start": 1589312,
      "text": "Sure.",
      "id": "ep_16_ut_137"
    },
    {
      "end": 1603264,
      "speaker": "Moritz Stefaner",
      "start": 1589712,
      "text": "Absolutely. Hey, Enrico, you're still alive. That's great. Oh, but no sound. No sound. You have to unmute yourself, Enrico. You have to unmute yourself.",
      "id": "ep_16_ut_138"
    },
    {
      "end": 1603432,
      "speaker": "Andy Kirk",
      "start": 1603304,
      "text": "Yeah.",
      "id": "ep_16_ut_139"
    },
    {
      "end": 1604644,
      "speaker": "Andrew Vande Moere",
      "start": 1603448,
      "text": "You have to click on.",
      "id": "ep_16_ut_140"
    },
    {
      "end": 1611956,
      "speaker": "Enrico Bertini",
      "start": 1605404,
      "text": "Hey, good to see you. Yeah, yeah, yeah. I had a network problem. I don't know.",
      "id": "ep_16_ut_141"
    },
    {
      "end": 1613424,
      "speaker": "Andy Kirk",
      "start": 1612140,
      "text": "You went to the kitchen.",
      "id": "ep_16_ut_142"
    },
    {
      "end": 1617388,
      "speaker": "Andrew Vande Moere",
      "start": 1615804,
      "text": "In the middle of your seminar.",
      "id": "ep_16_ut_143"
    },
    {
      "end": 1621464,
      "speaker": "Moritz Stefaner",
      "start": 1617556,
      "text": "I think I'm having a network problem too, because my beer is getting lefty.",
      "id": "ep_16_ut_144"
    },
    {
      "end": 1672358,
      "speaker": "Andy Kirk",
      "start": 1628204,
      "text": "Just on that point of storytelling. Obviously, the. At the very end of the year, we had the fantastic project from the New York Times, the snowfall project, which was just incredible and innovative. And you can only expect that a lot of similar organizations will look to that as a blueprint, not to copy in the most blatant sense, but to be inspired as an approach such an immersive and multimedia piece is that. I mean, it was, you know, fantastic. And I'm sure most people started looking at it, probably saw it all the way through to the. To its conclusion, which is probably right from many projects that we see as well. So I think that.",
      "id": "ep_16_ut_145"
    },
    {
      "end": 1676182,
      "speaker": "Moritz Stefaner",
      "start": 1672446,
      "text": "Can you describe it a bit for those who haven't seen it?",
      "id": "ep_16_ut_146"
    },
    {
      "end": 1750674,
      "speaker": "Andy Kirk",
      "start": 1676278,
      "text": "It was a kind of a. Almost an episodic story about this. I mean, I have slept and I've had Christmas since I looked at it first time, so I can't remember all the details, but it was just this very immersive, multifaceted story. I think it was. A couple of people got lost in some really table snow, snowy conditions, and it had videos, it had text, it had interactive pieces, it had this kind of scrollable in screen story. And I think most people saw it just. Just love the kind of cohesiveness of it as well. It wasn't something that had a clumsy interruption from the video. It was just something that was so synthesized and well planned. If you look at the attributions, those who were involved, I mean, you have people from all sides of the New York Times, designers, developers, 3d artists, journalists. So just from the perspective, and obviously, Moritz, you'll be particularly kind of acutely aware of the challenge of working in a team of a lot of people with the work that you've done. Emoto, I imagine, you know, just to bring all those people together. And to create such a synthesized, integrated piece was kind of fantastic. Really?",
      "id": "ep_16_ut_147"
    },
    {
      "end": 1793934,
      "speaker": "Bryan Connor",
      "start": 1752414,
      "text": "Yeah. And I think the other thing about it is that it's a really long form piece, too. You know, it takes you a while to get through it, and they break it up with interaction, with video and kind of like, you know, give you breaks from it, but also just kind of make it, you know, like you said it, a seamless experience to get from a to b. I mean, there's not, you know, there's not a ton of visualization in it, but there is. I mean, there's obviously, like, the, you know, the different 3d renderings and then, of course, diagrams and things like that to kind of explain the story. So, I mean, I think they're, you know, it's a good starting point, obviously, for journalism and storytelling, but I think, you know, a visualization, you know, kind of heavy version of it could be exciting as well.",
      "id": "ep_16_ut_148"
    },
    {
      "end": 1812424,
      "speaker": "Moritz Stefaner",
      "start": 1796284,
      "text": "But I agree that this closed form it had, that was really what it was so impressive about. You wouldn't want to single out any single of these graphics, but there was such a cohesive experience, and you always scrolling down, just waiting for the next. What's the next chapter? What's the next part?",
      "id": "ep_16_ut_149"
    },
    {
      "end": 1827894,
      "speaker": "Bryan Connor",
      "start": 1812884,
      "text": "And it wasn't sandwiched in the New York Times normal sort of layout. It was kind of only about that piece. And you don't need to have a million sidebars and kind of different directions you can go in. It's sort of like the only other direction is kind of deeper into the story.",
      "id": "ep_16_ut_150"
    },
    {
      "end": 1854614,
      "speaker": "Moritz Stefaner",
      "start": 1828354,
      "text": "And, I mean, traditional journalists will sometimes say, you know, the graphics department, they want to make things simple and dump it down a bit, you know, and I think these features also prove that you can draw people into even much more complex stories, you know, if you have this nice media integration. And really, I wouldn't, I didn't read the whole article, but I read, like, three pages, which is, like, super much for me already because I do have attention span problems.",
      "id": "ep_16_ut_151"
    },
    {
      "end": 1908714,
      "speaker": "Andy Kirk",
      "start": 1857364,
      "text": "But I know for a fact that, I mean, it's still not the first time this has been done. And I know that Sarah slobbing from the Wall Street Journal tweeted some additional examples that were out there before this. But obviously, the profile of the New York Times kind of reached a larger audience, in our field, at least. But I think the other thing about storytelling, I think there's a great myth out there that there's some magic solution, but actually, essentially, at its most basic level, it's just taking care for the audience and thinking about how you structure a story in terms of data, even if it's just an annotated chart, arrows pointing out key insights, key captions. So I don't think there's a great secret to it. I think it's just more people trying to showcare to give people a true insight from a data set or a story, really.",
      "id": "ep_16_ut_152"
    },
    {
      "end": 1948064,
      "speaker": "Bryan Connor",
      "start": 1909334,
      "text": "Yeah. I've seen one other sort of thing along these lines that's a bit simpler, kind of what you were just saying. And it's from EJ Fox, who I think still works at Mother Jones and he's working on a thing on GitHub and we can post a link to it, but essentially it's kind of a stepper in some ways that walks you through, lets you create a kind of story. You're doing it with code, but it's almost a little bit like a PowerPoint that you're seeing one thing at a time, but it's kind of lets you do captions, lets you kind of embed some interactive elements. So that's another kind of similar, but maybe more simplified version of the same idea.",
      "id": "ep_16_ut_153"
    },
    {
      "end": 1957380,
      "speaker": "Moritz Stefaner",
      "start": 1949404,
      "text": "That sounds very similar to that popcorn tool. And as I said, I think there will be much more tools like blending PowerPoint D3.",
      "id": "ep_16_ut_154"
    },
    {
      "end": 1962424,
      "speaker": "Bryan Connor",
      "start": 1957492,
      "text": "And I mean, essentially it's kind of marrying text and image as much as possible.",
      "id": "ep_16_ut_155"
    },
    {
      "end": 1966464,
      "speaker": "Moritz Stefaner",
      "start": 1963684,
      "text": "And we're back to the nineties multimedia all along.",
      "id": "ep_16_ut_156"
    },
    {
      "end": 1969916,
      "speaker": "Andy Kirk",
      "start": 1968684,
      "text": "CD Roms.",
      "id": "ep_16_ut_157"
    },
    {
      "end": 1973106,
      "speaker": "Enrico Bertini",
      "start": 1970100,
      "text": "Exactly. Andrew.",
      "id": "ep_16_ut_158"
    },
    {
      "end": 1974730,
      "speaker": "Moritz Stefaner",
      "start": 1973130,
      "text": "It's our time now. It's our time.",
      "id": "ep_16_ut_159"
    },
    {
      "end": 1975334,
      "speaker": "Bryan Connor",
      "start": 1974762,
      "text": "Yes.",
      "id": "ep_16_ut_160"
    },
    {
      "end": 1976774,
      "speaker": "Andrew Vande Moere",
      "start": 1975954,
      "text": "Flash.",
      "id": "ep_16_ut_161"
    },
    {
      "end": 1989874,
      "speaker": "Andy Kirk",
      "start": 1977234,
      "text": "Ta da. And just a segue to kind of another observation from the last year was the amount of individuals and organizations that shared their narratives, the design narratives.",
      "id": "ep_16_ut_162"
    },
    {
      "end": 1990578,
      "speaker": "Moritz Stefaner",
      "start": 1989914,
      "text": "I thought that was great.",
      "id": "ep_16_ut_163"
    },
    {
      "end": 2038154,
      "speaker": "Andy Kirk",
      "start": 1990626,
      "text": "So from the New York Times point of view ad the likes of Kevin Quayley with his fantastic charts and things blog, you know, not going for the full what's in all design process, but just revealing some of the background workings and some of the secrets behind their workflow. And the Washington Post have just started a blog recently which also reveals some of the work behind their pieces. And I think it's great when you see people justifying, reasoning how and why they've arrived at a solution given the problem they were given. And I think that's a much healthier place for us to judge if something's good or not. And I know Brian does a great job in critique and work, almost sometimes blindly to the objectives and the intentions. But to see people sharing their narratives, I think is a wonderful development that's mostly infographics.",
      "id": "ep_16_ut_164"
    },
    {
      "end": 2049522,
      "speaker": "Andrew Vande Moere",
      "start": 2038194,
      "text": "And using infographics, I would hope that Datavis people, I mean, I know that Moritz is doing it, but that a few more people will, that it's more like a common thing.",
      "id": "ep_16_ut_165"
    },
    {
      "end": 2052094,
      "speaker": "Andy Kirk",
      "start": 2049658,
      "text": "Yeah, I hope that will happen in the future.",
      "id": "ep_16_ut_166"
    },
    {
      "end": 2066266,
      "speaker": "Bryan Connor",
      "start": 2052434,
      "text": "It's something I'm shooting for to try and move into is maybe away a little bit from the more blanket you can try to get, you know, talk to. Talk to people a bit and try and publish their reasoning too. So. Absolutely.",
      "id": "ep_16_ut_167"
    },
    {
      "end": 2075178,
      "speaker": "Moritz Stefaner",
      "start": 2066450,
      "text": "So that's a plan for your blog to make features that get in touch with the authors directly and a little bit of back and forth.",
      "id": "ep_16_ut_168"
    },
    {
      "end": 2089558,
      "speaker": "Bryan Connor",
      "start": 2075346,
      "text": "Yeah, I mean, like you said, we've seen a lot more of these on a couple of different sites, but, you know, almost like trying to get people to do it, asking people to do it might be more effective than kind of expecting them to publish their own blog about it.",
      "id": "ep_16_ut_169"
    },
    {
      "end": 2104382,
      "speaker": "Moritz Stefaner",
      "start": 2089646,
      "text": "Yeah, I totally agree. And sometimes, I mean, sometimes critique is fair if you just look at the end piece, but sometimes you really have to understand the project constraints to understand why certain decisions were good or bad. So. Yeah, that's a nice move.",
      "id": "ep_16_ut_170"
    },
    {
      "end": 2124184,
      "speaker": "Enrico Bertini",
      "start": 2104558,
      "text": "So speaking of blogging, I want to mention maybe something that didn't happen in 2012. I think so. We have a few bloggers here in this show right now, and as far as I can tell, nothing special happened in terms of blogging in our area. Right.",
      "id": "ep_16_ut_171"
    },
    {
      "end": 2127676,
      "speaker": "Moritz Stefaner",
      "start": 2127084,
      "text": "New blogs.",
      "id": "ep_16_ut_172"
    },
    {
      "end": 2133024,
      "speaker": "Andy Kirk",
      "start": 2127700,
      "text": "Yeah, sorry, in terms of new blogs and in terms of new blogs.",
      "id": "ep_16_ut_173"
    },
    {
      "end": 2137940,
      "speaker": "Moritz Stefaner",
      "start": 2133524,
      "text": "Well, I heard there's this podcast and they seem to do really nice work.",
      "id": "ep_16_ut_174"
    },
    {
      "end": 2143314,
      "speaker": "Andrew Vande Moere",
      "start": 2138132,
      "text": "Yeah, but that's still true. Just, you know, don't believe the hype.",
      "id": "ep_16_ut_175"
    },
    {
      "end": 2152566,
      "speaker": "Enrico Bertini",
      "start": 2145974,
      "text": "Yeah, that was the perfect ball for you. That was perfect, actually.",
      "id": "ep_16_ut_176"
    },
    {
      "end": 2203078,
      "speaker": "Andy Kirk",
      "start": 2152630,
      "text": "It's an interesting, I've spoken to a few people through my courses, actually, and these are people trying to find a route into the subject in a more visible way. And a lot of them have been held back, I think, from doing or launching blogs because they don't quite know what space is left available. And I often tell them that actually just putting their own work up there or sharing their own thoughts, their own convictions is a great start. But I think to a lot of people there's a certain barrier to joining the club, as it were, just from the sheer fact that everything seems, from their perspective to have been sewn up and covered already. But I do try and encourage people to get involved. It's such a great way to publicise yourself, but also your own work and your own thoughts.",
      "id": "ep_16_ut_177"
    },
    {
      "end": 2207478,
      "speaker": "Andrew Vande Moere",
      "start": 2203166,
      "text": "Well, there is an alternative. They could contact one of us and ask if they could guest block.",
      "id": "ep_16_ut_178"
    },
    {
      "end": 2208394,
      "speaker": "Andy Kirk",
      "start": 2207566,
      "text": "Exactly.",
      "id": "ep_16_ut_179"
    },
    {
      "end": 2210374,
      "speaker": "Enrico Bertini",
      "start": 2208814,
      "text": "Yeah, sure, sure.",
      "id": "ep_16_ut_180"
    },
    {
      "end": 2213274,
      "speaker": "Andrew Vande Moere",
      "start": 2210494,
      "text": "You know, if they feel so, they can always contact me.",
      "id": "ep_16_ut_181"
    },
    {
      "end": 2222314,
      "speaker": "Andy Kirk",
      "start": 2214054,
      "text": "But I do know that, I mean, there was a great site that you suppose quite often called fell in love with data, and I think that's dried up quite a lot recently. I'd like to see that being picked up.",
      "id": "ep_16_ut_182"
    },
    {
      "end": 2294168,
      "speaker": "Enrico Bertini",
      "start": 2223694,
      "text": "No, but I mean, seriously, maybe it's not a bad thing, the fact that we didn't see any new blogs around, but maybe another connected trend is that we saw many more books coming out. So in a way, people are not blogging more, or we don't have new blogs, but we have new books, which in a way can be seen as a way to make, to turn information from blogs into something that is more solid, like books, more permanent. Definitely the case for you, Andy. Probably in a way it's similar for Alberto Cairo, even if it's not exactly the same. So I think it's a good thing that we are seeing more solid material because a blog, in a way, it's always. So regardless, the style, in a way, is something that develops over time and it's limited to the scene, to a single, to the space of a single post. So you cannot really go as deep as you would like, and you cannot. It's very hard to build a coherent picture out of several blog posts. Right. So having, not having new blogs, but having new books is definitely a good thing, in my opinion.",
      "id": "ep_16_ut_183"
    },
    {
      "end": 2301592,
      "speaker": "Andy Kirk",
      "start": 2294256,
      "text": "I also think, I think Robert picked up on this in the last episode that you did about the growth of things like Pinterest boards and tumblrs.",
      "id": "ep_16_ut_184"
    },
    {
      "end": 2302568,
      "speaker": "Enrico Bertini",
      "start": 2301648,
      "text": "Oh, yeah, sure.",
      "id": "ep_16_ut_185"
    },
    {
      "end": 2351624,
      "speaker": "Andy Kirk",
      "start": 2302696,
      "text": "So I think that's another way for people to get in there just to kind of create and curate things that they like. And hopefully they'll then take the leap onto the next stage, which is, you know, commenting on these things and critiquing and, you know, and I think, I mean, from my point of view, starting the blog coming up to three years now was always about trying to force myself to write about the subject which carves and crafts up your own convictions and your own thoughts and beliefs, and it forces you to learn and also the quality of writing. You know, you can't just put anything up there. You have to really think about and care for the words that you put there because you will get, you know, quite quickly picked up on things. So, you know, I'd like to see more blogs this year. Whether or not that will happen, who knows? Because there are these very rapid tools and efficient tools for doing it quickly, but it would be great to see some new voices out there.",
      "id": "ep_16_ut_186"
    },
    {
      "end": 2393094,
      "speaker": "Moritz Stefaner",
      "start": 2354164,
      "text": "I absolutely agree. And it's interesting now that you say, but it's true. Maybe blogging has gone down the last year a bit. But I just realized what I'm missing is really good conversation about infovis on the web. Like, not just good writing in a one directional manner. We used to have lots of discussions around a single blog post, you know, like Manuel Lima's manifesto, Robert Kosara's line in the sand. Yeah, but there was really substantial discussion going on, so the discussion was longer than the blog post by far. And I couldn't recall that from the last year. And I think maybe that has. That has.",
      "id": "ep_16_ut_187"
    },
    {
      "end": 2396482,
      "speaker": "Andy Kirk",
      "start": 2393674,
      "text": "That's now taking place on Twitter. So my comment.",
      "id": "ep_16_ut_188"
    },
    {
      "end": 2401554,
      "speaker": "Moritz Stefaner",
      "start": 2396538,
      "text": "But there's a problem with discussions on Twitter. I mean, but the volume of comments.",
      "id": "ep_16_ut_189"
    },
    {
      "end": 2427574,
      "speaker": "Andy Kirk",
      "start": 2401634,
      "text": "That come onto my side have certainly, you know, reduced. And I think that's because people prefer to have their voice being heard on Twitter rather than being stuck away in a hidden comment. But I recall that very same manifesto discussion, which was fantastic. It drew the likes of David McCandless and Stephen Few and all the big hitters were on one place and pounding away against each other, and it was fantastic.",
      "id": "ep_16_ut_190"
    },
    {
      "end": 2442446,
      "speaker": "Bryan Connor",
      "start": 2431894,
      "text": "Do you think there's a reason? Is it like, are we congealing around certain ideas and there's not as much sort of controversial, you know, thoughts in data visualization, or is that kind of a naive thought?",
      "id": "ep_16_ut_191"
    },
    {
      "end": 2462614,
      "speaker": "Andrew Vande Moere",
      "start": 2442630,
      "text": "I would say the discussion, maybe. I have the impression people got sick. A bit of discussion, quite a few posts that went in the same direction and did not get any comments or not, at least from those people that were on the big discussion list. Maybe people, like, not make a point again.",
      "id": "ep_16_ut_192"
    },
    {
      "end": 2466106,
      "speaker": "Enrico Bertini",
      "start": 2463234,
      "text": "Maybe people are more focused on doing, which is great.",
      "id": "ep_16_ut_193"
    },
    {
      "end": 2475602,
      "speaker": "Moritz Stefaner",
      "start": 2466170,
      "text": "Actually, that's my impression, too. I mean, the one thing is really, you can only discuss, like, aesthetics versus functionality five times and then you're done.",
      "id": "ep_16_ut_194"
    },
    {
      "end": 2476562,
      "speaker": "Enrico Bertini",
      "start": 2475778,
      "text": "Yeah.",
      "id": "ep_16_ut_195"
    },
    {
      "end": 2482154,
      "speaker": "Moritz Stefaner",
      "start": 2476738,
      "text": "Shall we do it again? I mean, darn it already, just for the.",
      "id": "ep_16_ut_196"
    },
    {
      "end": 2485754,
      "speaker": "Enrico Bertini",
      "start": 2483694,
      "text": "I can find the aesthetic guy.",
      "id": "ep_16_ut_197"
    },
    {
      "end": 2496622,
      "speaker": "Moritz Stefaner",
      "start": 2487974,
      "text": "No, and the second thing is really everybody's doing his thing. Like, everybody's running with what he's got, you know, or she, and just doing his thing. And that's a good thing. Probably.",
      "id": "ep_16_ut_198"
    },
    {
      "end": 2497150,
      "speaker": "Andrew Vande Moere",
      "start": 2496678,
      "text": "You're right.",
      "id": "ep_16_ut_199"
    },
    {
      "end": 2497758,
      "speaker": "Moritz Stefaner",
      "start": 2497222,
      "text": "Yeah.",
      "id": "ep_16_ut_200"
    },
    {
      "end": 2507226,
      "speaker": "Enrico Bertini",
      "start": 2497886,
      "text": "Yeah. Hey, we have one viewer. Did you notice that? So if you are there, we will never learn. Oh, man.",
      "id": "ep_16_ut_201"
    },
    {
      "end": 2508774,
      "speaker": "Moritz Stefaner",
      "start": 2507350,
      "text": "Oh, maybe on Twitter.",
      "id": "ep_16_ut_202"
    },
    {
      "end": 2516814,
      "speaker": "Andrew Vande Moere",
      "start": 2514834,
      "text": "Comparing to the people here.",
      "id": "ep_16_ut_203"
    },
    {
      "end": 2521414,
      "speaker": "Enrico Bertini",
      "start": 2518074,
      "text": "One other time, please don't push.",
      "id": "ep_16_ut_204"
    },
    {
      "end": 2531534,
      "speaker": "Moritz Stefaner",
      "start": 2523594,
      "text": "I'll count a trend. Yeah, that narrative thing we discussed just to move on. Or did you want to add to that, Enrico?",
      "id": "ep_16_ut_205"
    },
    {
      "end": 2535014,
      "speaker": "Enrico Bertini",
      "start": 2531954,
      "text": "No, I wanted to mention another topic, but go ahead.",
      "id": "ep_16_ut_206"
    },
    {
      "end": 2536626,
      "speaker": "Moritz Stefaner",
      "start": 2535594,
      "text": "Same with me.",
      "id": "ep_16_ut_207"
    },
    {
      "end": 2542694,
      "speaker": "Enrico Bertini",
      "start": 2536770,
      "text": "Same with you. So I'll go first. Who goes first? I'll go first. So.",
      "id": "ep_16_ut_208"
    },
    {
      "end": 2547214,
      "speaker": "Moritz Stefaner",
      "start": 2545314,
      "text": "That's what I wanted to say. Of course.",
      "id": "ep_16_ut_209"
    },
    {
      "end": 2567524,
      "speaker": "Enrico Bertini",
      "start": 2549034,
      "text": "So I was wondering whether you guys want to mention one or two people who think at a major, major developments in 2012. So we already mentioned Mike Bostock. I think that's, that's clear. Who else do you, do you guys want to mention? Oh, Andy wants to mention something.",
      "id": "ep_16_ut_210"
    },
    {
      "end": 2594504,
      "speaker": "Andy Kirk",
      "start": 2567564,
      "text": "I've put my hand up. I don't think you could avoid Santiago and the work he's done this last, well, especially the last six months. I mean, it's been quite prolific, the new projects that is published out there. And I know that some of them have been work that he's started out in previous years, that he's now refining and publishing. But, you know, some of the stuff he's been doing has been quite staggering. So I think he's dominated a lot of the new work of the last six months. Definitely.",
      "id": "ep_16_ut_211"
    },
    {
      "end": 2597782,
      "speaker": "Enrico Bertini",
      "start": 2595534,
      "text": "Yeah, I agree. I agree.",
      "id": "ep_16_ut_212"
    },
    {
      "end": 2598246,
      "speaker": "Andy Kirk",
      "start": 2597958,
      "text": "Yeah.",
      "id": "ep_16_ut_213"
    },
    {
      "end": 2613542,
      "speaker": "Moritz Stefaner",
      "start": 2598270,
      "text": "And he has such a strong style, such a strong personal style. And I think you can really see how fluent he is in code, that he's really, like, not hindered by it at all. And that's always so. He's a vital also. So that's, that's great to see. Yeah, he's cool. And Mike, for me, it's Mike, but I said that already.",
      "id": "ep_16_ut_214"
    },
    {
      "end": 2616566,
      "speaker": "Andrew Vande Moere",
      "start": 2613638,
      "text": "So Mike, the New York Times graphics department in general.",
      "id": "ep_16_ut_215"
    },
    {
      "end": 2617102,
      "speaker": "Moritz Stefaner",
      "start": 2616710,
      "text": "Yeah.",
      "id": "ep_16_ut_216"
    },
    {
      "end": 2620114,
      "speaker": "Andrew Vande Moere",
      "start": 2617158,
      "text": "He brought some very beautiful pieces out, whole year.",
      "id": "ep_16_ut_217"
    },
    {
      "end": 2623042,
      "speaker": "Moritz Stefaner",
      "start": 2621994,
      "text": "Thank you again.",
      "id": "ep_16_ut_218"
    },
    {
      "end": 2629274,
      "speaker": "Andy Kirk",
      "start": 2623138,
      "text": "And let's say, Moritz, I mean, it's embarrassing for him to hear this, but, you know, some of the work that you've been involving, Moritz has been fantastic this last year.",
      "id": "ep_16_ut_219"
    },
    {
      "end": 2630214,
      "speaker": "Moritz Stefaner",
      "start": 2629314,
      "text": "We don't talk.",
      "id": "ep_16_ut_220"
    },
    {
      "end": 2640254,
      "speaker": "Andy Kirk",
      "start": 2632914,
      "text": "Just reflecting on the motor in particular. I mean, that was a huge undertaking. You know, what's. How you look back on that now.",
      "id": "ep_16_ut_221"
    },
    {
      "end": 2697384,
      "speaker": "Moritz Stefaner",
      "start": 2641874,
      "text": "Yeah, I mean, that was one of the big things of the year for us. And, I mean, I sort of see it as a failure as well because I know what we set out to do and, you know, and we hit a lot of rocks along the road. But at the same time, I'm really happy about how it turned out. And, I mean, that's always with the good projects that, you know, you sort of, you have a sort of a certain ambivalence about them, I guess. Yeah, but I mean, that's, I mean, I think I said at the beginning of the year, real time is going to be big. And I realized over the year that sculptures and physical things are also one of the main themes. And so from this end, I'm also really happy to have learned about these things so much and to be able to experiment with them in the setting and this unique team and this unique context. So, yeah, it was pretty cool, but I would have a few ideas of how to do it again. Like, next Olympia.",
      "id": "ep_16_ut_222"
    },
    {
      "end": 2724690,
      "speaker": "Andrew Vande Moere",
      "start": 2697684,
      "text": "But do you think, like, real time is like. I mean, real time was very big in the time of the year of the Olympics. Right. Everything that came out. Moritz is gone. This was actually a question for. I thought real time was sort of coming up during the Olympics with all the real. And football. UEFA. And then it's sort of, you know, outside of sports, I haven't seen any big or.",
      "id": "ep_16_ut_223"
    },
    {
      "end": 2728378,
      "speaker": "Bryan Connor",
      "start": 2724842,
      "text": "I don't know if there were any with the us elections or not.",
      "id": "ep_16_ut_224"
    },
    {
      "end": 2728890,
      "speaker": "Andy Kirk",
      "start": 2728426,
      "text": "Yeah.",
      "id": "ep_16_ut_225"
    },
    {
      "end": 2730494,
      "speaker": "Bryan Connor",
      "start": 2729002,
      "text": "Really real time or.",
      "id": "ep_16_ut_226"
    },
    {
      "end": 2739474,
      "speaker": "Andrew Vande Moere",
      "start": 2731794,
      "text": "Yeah. But like that, which was not a red and blue map, right? Sure. There you go.",
      "id": "ep_16_ut_227"
    },
    {
      "end": 2740710,
      "speaker": "Enrico Bertini",
      "start": 2739814,
      "text": "There we go.",
      "id": "ep_16_ut_228"
    },
    {
      "end": 2741634,
      "speaker": "Andy Kirk",
      "start": 2740822,
      "text": "Here is.",
      "id": "ep_16_ut_229"
    },
    {
      "end": 2744846,
      "speaker": "Andrew Vande Moere",
      "start": 2743614,
      "text": "Your network, huh?",
      "id": "ep_16_ut_230"
    },
    {
      "end": 2745310,
      "speaker": "Enrico Bertini",
      "start": 2744990,
      "text": "Yeah.",
      "id": "ep_16_ut_231"
    },
    {
      "end": 2746030,
      "speaker": "Moritz Stefaner",
      "start": 2745342,
      "text": "You're back.",
      "id": "ep_16_ut_232"
    },
    {
      "end": 2748354,
      "speaker": "Andy Kirk",
      "start": 2746182,
      "text": "Nice kitchen time, eh?",
      "id": "ep_16_ut_233"
    },
    {
      "end": 2750514,
      "speaker": "Andrew Vande Moere",
      "start": 2749014,
      "text": "That was a cameraman.",
      "id": "ep_16_ut_234"
    },
    {
      "end": 2754438,
      "speaker": "Enrico Bertini",
      "start": 2752174,
      "text": "From time to time. There is.",
      "id": "ep_16_ut_235"
    },
    {
      "end": 2755674,
      "speaker": "Andy Kirk",
      "start": 2754486,
      "text": "Oh, it's a new beer.",
      "id": "ep_16_ut_236"
    },
    {
      "end": 2765888,
      "speaker": "Moritz Stefaner",
      "start": 2764144,
      "text": "Genuine network problems.",
      "id": "ep_16_ut_237"
    },
    {
      "end": 2769584,
      "speaker": "Enrico Bertini",
      "start": 2765976,
      "text": "These ISP's beer network problems.",
      "id": "ep_16_ut_238"
    },
    {
      "end": 2770884,
      "speaker": "Moritz Stefaner",
      "start": 2769704,
      "text": "You know how it is.",
      "id": "ep_16_ut_239"
    },
    {
      "end": 2791170,
      "speaker": "Andy Kirk",
      "start": 2771744,
      "text": "What was the question? Those last two points about the Olympics and the euros, and these are big data visualization events, and it's now become such an important device and product for all these organizations to. To show that they've got something in their armory as well.",
      "id": "ep_16_ut_240"
    },
    {
      "end": 2793814,
      "speaker": "Moritz Stefaner",
      "start": 2791362,
      "text": "And the elections. And the elections.",
      "id": "ep_16_ut_241"
    },
    {
      "end": 2836784,
      "speaker": "Andy Kirk",
      "start": 2796194,
      "text": "But I think what's interesting for me is that during the us elections in particular, and Brian will be probably most kind of close to all this, is the amount of choropleth maps, you just this kind of saturation of the same device, but actually kind of the kind of contrarian products like the Guardian Balloon project, if you recall that one. We could drag the balloons depending on how you wanted to sort of do. The different scenarios must have got so many hits, because it was something new and different and novelty, and it's kind of interesting thing, you know, if you're facing another big event in the future, do you play it straight with the obvious tool, or do you try and find something that differentiates you from the. From the rest?",
      "id": "ep_16_ut_242"
    },
    {
      "end": 2879264,
      "speaker": "Bryan Connor",
      "start": 2837124,
      "text": "Yeah, I don't know. I mean, I think another example of exactly what you're talking about with the us elections is the. Again, the New York Times, 512 pass. I mean, that was one. That was just the most I've seen. Kind of saturated, even amongst my friends, who are not anywhere closely related to data visualization. They're kind of sharing that because it just made a lot more sense than a choropleth. Map and it was something different. And just really, I mean, that was the best way to distill it, is there are this many different scenarios of different ways this can go, and that's all the pundits are talking about. But this is kind of in one screen real estate, and you can kind of get it immediately. That was a huge one.",
      "id": "ep_16_ut_243"
    },
    {
      "end": 2885304,
      "speaker": "Andrew Vande Moere",
      "start": 2879564,
      "text": "Is there's also a new trend for politicians in the Senate and Congress with infographics.",
      "id": "ep_16_ut_244"
    },
    {
      "end": 2886564,
      "speaker": "Bryan Connor",
      "start": 2885684,
      "text": "Absolutely.",
      "id": "ep_16_ut_245"
    },
    {
      "end": 2888684,
      "speaker": "Andrew Vande Moere",
      "start": 2886684,
      "text": "During their big talks.",
      "id": "ep_16_ut_246"
    },
    {
      "end": 2918544,
      "speaker": "Bryan Connor",
      "start": 2888804,
      "text": "Yeah, I know someone at the Congressional Budget office, and he's on Twitter, too, Jonathan Schwabisch, and he does a lot, kind of obviously, educating people in the government about making data visualization, making graphs and, but also, you know, you know, he's working on projects that help explain what's going on. But also, you know, you can see, you know, you can see it coming up a lot more as a tool for, for people in politics to, you know, use.",
      "id": "ep_16_ut_247"
    },
    {
      "end": 2919652,
      "speaker": "Andy Kirk",
      "start": 2918884,
      "text": "Absolutely.",
      "id": "ep_16_ut_248"
    },
    {
      "end": 2964994,
      "speaker": "Moritz Stefaner",
      "start": 2919748,
      "text": "I think that that's been a big thing, really. Also this, like, against maybe this narrative trend, these tools for real time monitoring and, like, understanding complex systems and understanding complex processes. Processes. We had the 512 paths. We had the, I think for me it was the best work was the wind map by Fernandez Viegas and Martin Wattenberg, which is just, you know, there's no narrative. It's just, you can see all the winds blowing right now in the states. I mean, how awesome is that? And maybe also, yeah, things like these real time sports or second screen applications, these types of things, they are now really starting to get some traction. I think people have been talking about it for a while, but no, it's happening.",
      "id": "ep_16_ut_249"
    },
    {
      "end": 3007464,
      "speaker": "Andy Kirk",
      "start": 2967854,
      "text": "Just picking up on Bran's point there about people using these tools who are not in this field, just average people. I think the other tool that seemed to go beyond those boundaries was the guardians gay rights visualization. Did I think it was around March or April. That was something that seemed to once again penetrate into normal real life. And people were using that as a tool to explore all the different kind of different levels of liberal attitudes and situations around the different states in the US. I think that was another example of something that really reached out to normal people and non vis people, which was great.",
      "id": "ep_16_ut_250"
    },
    {
      "end": 3022256,
      "speaker": "Enrico Bertini",
      "start": 3011664,
      "text": "Okay, so I don't know, do you want to mention more who's got more trends or anything?",
      "id": "ep_16_ut_251"
    },
    {
      "end": 3082364,
      "speaker": "Andy Kirk",
      "start": 3022440,
      "text": "I suppose just one more observation was just the quality or the perceived quality of the conferences last year. I mean, I attended Malofiege and visualize, which were both, you know, excellent, excellent events. I heard great things about viz week, and obviously IO festival, you know, as ever, went down really well. And, you know, I hope that same trend continues next year. So the announcement yesterday of the first 29 people think for the I O festival was announced, which is great. And there's an event taking place in Boston in May called the something like the Open, this conference that I think Irene Ross is involved in. So that sounds like a great lineup. And I think Moritz. No, sorry, I'm not sure if Moritz is involved, but tapestry at the end of the month is coming up, which sounds great. Robert Kosara is at that. Hopefully, the same trend will continue next year. These quality events bringing people together.",
      "id": "ep_16_ut_252"
    },
    {
      "end": 3085088,
      "speaker": "Enrico Bertini",
      "start": 3083584,
      "text": "I agree. I agree.",
      "id": "ep_16_ut_253"
    },
    {
      "end": 3110514,
      "speaker": "Bryan Connor",
      "start": 3085216,
      "text": "Yeah. That's what I had on my list as well. One other one was another year of the visualizing marathon taking place all over the world. And, you know, obviously, judging and winners from that as well kind of help. All these things help kind of, you know, coalesce, you know, figure out what the community is, you know, connect people in the data visualization community, and kind of, you know, just kind of expand it a bit.",
      "id": "ep_16_ut_254"
    },
    {
      "end": 3136334,
      "speaker": "Moritz Stefaner",
      "start": 3110974,
      "text": "Yeah. And in the marathon, I think it was so obvious how much the quality has changed over the last, like, 18 months, you know, and now we had, like, thousands of students participate, and you could look at a random piece, and it was really decent, you know, and, I mean, that's super amazing. If you think that these things are done in 48 hours by beginners, it's, like, really cool. So I think that alone shows how much the field has changed already.",
      "id": "ep_16_ut_255"
    },
    {
      "end": 3143414,
      "speaker": "Enrico Bertini",
      "start": 3137114,
      "text": "I think the same is true for. I don't remember the name. What's the contest organized by? David McCandless.",
      "id": "ep_16_ut_256"
    },
    {
      "end": 3145362,
      "speaker": "Andy Kirk",
      "start": 3143874,
      "text": "Info is beauty awards.",
      "id": "ep_16_ut_257"
    },
    {
      "end": 3147610,
      "speaker": "Enrico Bertini",
      "start": 3145418,
      "text": "Info is beauty awards. I think more.",
      "id": "ep_16_ut_258"
    },
    {
      "end": 3148050,
      "speaker": "Moritz Stefaner",
      "start": 3147642,
      "text": "It's.",
      "id": "ep_16_ut_259"
    },
    {
      "end": 3149194,
      "speaker": "Enrico Bertini",
      "start": 3148162,
      "text": "I think you participated.",
      "id": "ep_16_ut_260"
    },
    {
      "end": 3150948,
      "speaker": "Moritz Stefaner",
      "start": 3149234,
      "text": "Weren't these the ones I won?",
      "id": "ep_16_ut_261"
    },
    {
      "end": 3152044,
      "speaker": "Enrico Bertini",
      "start": 3151146,
      "text": "Okay.",
      "id": "ep_16_ut_262"
    },
    {
      "end": 3156844,
      "speaker": "Moritz Stefaner",
      "start": 3153064,
      "text": "I think so. Yeah, exactly.",
      "id": "ep_16_ut_263"
    },
    {
      "end": 3164484,
      "speaker": "Andy Kirk",
      "start": 3162744,
      "text": "He doesn't like to talk about it.",
      "id": "ep_16_ut_264"
    },
    {
      "end": 3166936,
      "speaker": "Moritz Stefaner",
      "start": 3164824,
      "text": "You want to see the trophies? I get the trophies.",
      "id": "ep_16_ut_265"
    },
    {
      "end": 3168244,
      "speaker": "Andrew Vande Moere",
      "start": 3167080,
      "text": "Yeah, get them.",
      "id": "ep_16_ut_266"
    },
    {
      "end": 3171000,
      "speaker": "Andy Kirk",
      "start": 3169864,
      "text": "He's actually gone.",
      "id": "ep_16_ut_267"
    },
    {
      "end": 3171884,
      "speaker": "Andrew Vande Moere",
      "start": 3171152,
      "text": "Yeah.",
      "id": "ep_16_ut_268"
    },
    {
      "end": 3176608,
      "speaker": "Enrico Bertini",
      "start": 3176064,
      "text": "Wow.",
      "id": "ep_16_ut_269"
    },
    {
      "end": 3177964,
      "speaker": "Andrew Vande Moere",
      "start": 3176696,
      "text": "What does the eye mean?",
      "id": "ep_16_ut_270"
    },
    {
      "end": 3180008,
      "speaker": "Bryan Connor",
      "start": 3179384,
      "text": "Information.",
      "id": "ep_16_ut_271"
    },
    {
      "end": 3181744,
      "speaker": "Moritz Stefaner",
      "start": 3180136,
      "text": "Physical. Physical trophies.",
      "id": "ep_16_ut_272"
    },
    {
      "end": 3186364,
      "speaker": "Andrew Vande Moere",
      "start": 3181784,
      "text": "Actually looks like it. That's cool. The other one looks like an info point.",
      "id": "ep_16_ut_273"
    },
    {
      "end": 3190792,
      "speaker": "Moritz Stefaner",
      "start": 3186784,
      "text": "Yeah. It's like. Yeah. If you have questions about a ticketing system.",
      "id": "ep_16_ut_274"
    },
    {
      "end": 3191368,
      "speaker": "Enrico Bertini",
      "start": 3190968,
      "text": "Yeah.",
      "id": "ep_16_ut_275"
    },
    {
      "end": 3193004,
      "speaker": "Moritz Stefaner",
      "start": 3191416,
      "text": "You ask, you come here.",
      "id": "ep_16_ut_276"
    },
    {
      "end": 3195112,
      "speaker": "Andy Kirk",
      "start": 3194304,
      "text": "Very nice.",
      "id": "ep_16_ut_277"
    },
    {
      "end": 3195464,
      "speaker": "Enrico Bertini",
      "start": 3195208,
      "text": "Cool.",
      "id": "ep_16_ut_278"
    },
    {
      "end": 3199284,
      "speaker": "Moritz Stefaner",
      "start": 3195504,
      "text": "No, it's a decent award. I think the jury is top notch.",
      "id": "ep_16_ut_279"
    },
    {
      "end": 3203684,
      "speaker": "Enrico Bertini",
      "start": 3202944,
      "text": "Right?",
      "id": "ep_16_ut_280"
    },
    {
      "end": 3210982,
      "speaker": "Moritz Stefaner",
      "start": 3205814,
      "text": "No, but overall, I mean, beginning of the year, we were ranting about competitions, Enrico.",
      "id": "ep_16_ut_281"
    },
    {
      "end": 3212078,
      "speaker": "Enrico Bertini",
      "start": 3211118,
      "text": "I remember that.",
      "id": "ep_16_ut_282"
    },
    {
      "end": 3219886,
      "speaker": "Moritz Stefaner",
      "start": 3212166,
      "text": "Yeah. At that time, I hadn't won. Yeah. And now. But now things really have improved.",
      "id": "ep_16_ut_283"
    },
    {
      "end": 3223526,
      "speaker": "Andrew Vande Moere",
      "start": 3219910,
      "text": "I think as long as you win, really great.",
      "id": "ep_16_ut_284"
    },
    {
      "end": 3225634,
      "speaker": "Enrico Bertini",
      "start": 3223590,
      "text": "There are top notch competitors.",
      "id": "ep_16_ut_285"
    },
    {
      "end": 3236454,
      "speaker": "Moritz Stefaner",
      "start": 3229514,
      "text": "No, but that's interesting. If you think back beginning of data stories, we were really, like, all these competitions and nothing good comes out of it. Right?",
      "id": "ep_16_ut_286"
    },
    {
      "end": 3240650,
      "speaker": "Enrico Bertini",
      "start": 3236954,
      "text": "Yeah. One of the first episodes we've been.",
      "id": "ep_16_ut_287"
    },
    {
      "end": 3249894,
      "speaker": "Moritz Stefaner",
      "start": 3240762,
      "text": "Yep. And that was half a year ago. So count on our opinions too much, they might just change.",
      "id": "ep_16_ut_288"
    },
    {
      "end": 3254786,
      "speaker": "Enrico Bertini",
      "start": 3252954,
      "text": "Yeah. Okay.",
      "id": "ep_16_ut_289"
    },
    {
      "end": 3263894,
      "speaker": "Moritz Stefaner",
      "start": 3254970,
      "text": "I don't know any other single works. Like what should people should be looking at if they want to see what was 2012? What was so 2012?",
      "id": "ep_16_ut_290"
    },
    {
      "end": 3291504,
      "speaker": "Andy Kirk",
      "start": 3265194,
      "text": "Well, one designer I was also going to mention who's not on the radar for many is a guy called Simon Scar who works at the South China Morning Post, and he does some fantastic work out there. And I first came across it and I think you will have done Moritz and Andrew as well at Malofiej. He does some great static work for the. The newspaper there and I think he's, you know, one to watch for the next year. Definitely.",
      "id": "ep_16_ut_291"
    },
    {
      "end": 3294064,
      "speaker": "Bryan Connor",
      "start": 3293244,
      "text": "Yep.",
      "id": "ep_16_ut_292"
    },
    {
      "end": 3296156,
      "speaker": "Moritz Stefaner",
      "start": 3294444,
      "text": "And he has a quite distinct style.",
      "id": "ep_16_ut_293"
    },
    {
      "end": 3298264,
      "speaker": "Andy Kirk",
      "start": 3296260,
      "text": "Yeah. Yeah. Very, very unique. Yeah.",
      "id": "ep_16_ut_294"
    },
    {
      "end": 3315004,
      "speaker": "Enrico Bertini",
      "start": 3300844,
      "text": "So maybe we can conclude by mentioning what are your best wishes for 2013? So what's going to be the best. So the best outcome in 2013 for this? Of course.",
      "id": "ep_16_ut_295"
    },
    {
      "end": 3319684,
      "speaker": "Moritz Stefaner",
      "start": 3316104,
      "text": "So world peace doesn't count. World piece doesn't count.",
      "id": "ep_16_ut_296"
    },
    {
      "end": 3322296,
      "speaker": "Andy Kirk",
      "start": 3321344,
      "text": "Well, obviously.",
      "id": "ep_16_ut_297"
    },
    {
      "end": 3325296,
      "speaker": "Enrico Bertini",
      "start": 3322400,
      "text": "What do you want to see happening in 2013?",
      "id": "ep_16_ut_298"
    },
    {
      "end": 3328244,
      "speaker": "Andy Kirk",
      "start": 3325480,
      "text": "I want to see every bookshelf with a certain book.",
      "id": "ep_16_ut_299"
    },
    {
      "end": 3337324,
      "speaker": "Moritz Stefaner",
      "start": 3330064,
      "text": "Yes. Sold or not sold, empty of these certain. Constantly being refilled and still they evaporate.",
      "id": "ep_16_ut_300"
    },
    {
      "end": 3357146,
      "speaker": "Andy Kirk",
      "start": 3341354,
      "text": "You know, honestly, I think just, you know, a continuation of the same, you know, the same. I think before we came on air, we were chatting about the average being raised and the, you know, the median quality being raised. I think, you know, if that continues next year, that we're a successful year for everyone. Really.",
      "id": "ep_16_ut_301"
    },
    {
      "end": 3360614,
      "speaker": "Bryan Connor",
      "start": 3357290,
      "text": "Yeah. It's all the stuff we talked about continuing, for sure.",
      "id": "ep_16_ut_302"
    },
    {
      "end": 3400390,
      "speaker": "Enrico Bertini",
      "start": 3361714,
      "text": "In a way, I agree. I mean, it's clear that we are growing as a community. The old field is getting better and better and more mature. So I agree, in a way. I want to see in 2013 the same rate of development we got so far. It's been. It's been great. Actually, we should mention that it's been great during the last couple of years. It's been great. I mean, I consider myself very lucky to. I decided to work in this area and I never. I never thought that it would be just so perfect. I don't know how long it's gonna last, but as long as it lasts, it's been great. Right. I hope you guys agree.",
      "id": "ep_16_ut_303"
    },
    {
      "end": 3401714,
      "speaker": "Andy Kirk",
      "start": 3400582,
      "text": "Yeah, absolutely.",
      "id": "ep_16_ut_304"
    },
    {
      "end": 3411914,
      "speaker": "Moritz Stefaner",
      "start": 3402974,
      "text": "No, it's super exciting. And if you think back, a year passes and so much has changed already and you know, so many new people, new development. So it's crazy. Yeah.",
      "id": "ep_16_ut_305"
    },
    {
      "end": 3414294,
      "speaker": "Enrico Bertini",
      "start": 3413534,
      "text": "Okay.",
      "id": "ep_16_ut_306"
    },
    {
      "end": 3417526,
      "speaker": "Moritz Stefaner",
      "start": 3414414,
      "text": "Andrew, any more things from you?",
      "id": "ep_16_ut_307"
    },
    {
      "end": 3421874,
      "speaker": "Andrew Vande Moere",
      "start": 3417670,
      "text": "Well, I was thinking, wish I would like to hear more success stories.",
      "id": "ep_16_ut_308"
    },
    {
      "end": 3425178,
      "speaker": "Enrico Bertini",
      "start": 3424234,
      "text": "That's true.",
      "id": "ep_16_ut_309"
    },
    {
      "end": 3446174,
      "speaker": "Andrew Vande Moere",
      "start": 3425266,
      "text": "That's more like we made this visualization and that's what we discovered from it. Or that's how much money we saved or that's how many lives we saved, or that politician made a better decision because of that. I still think that field is a bit missing, these sort of things. Or there could be more if we really want to prove that it's valuable.",
      "id": "ep_16_ut_310"
    },
    {
      "end": 3482830,
      "speaker": "Bryan Connor",
      "start": 3446634,
      "text": "Right. I think that goes along with just, you know, more things, more visualizations, kind of with the purpose of communication. Kind of like what is the success? How do you measure the success of communicating something like, you know, and you kind of have to define that beforehand in some ways. But, you know, I think that goes along with what we've talked about and what I want to see more of which is, you know, using visualization, kind of the storytelling, you know, really effective examples of it, just more and more. Because I think we just started to see some really good stuff towards the end of the year. But maybe, you know, hopefully that means it'll be twice that next year.",
      "id": "ep_16_ut_311"
    },
    {
      "end": 3510758,
      "speaker": "Enrico Bertini",
      "start": 3483022,
      "text": "Yeah. I just want to mention, I fully agree with Andrew that we have had this problem for a long time now. But I always ask myself whether this is due more to the fact that these success stories don't exist at all or whether they're not communicated. And actually I don't have an answer to that. But there might be, it might be the case that actually there are success stories out there, but they are just not. People who are successful with visualization don't have time to communicate.",
      "id": "ep_16_ut_312"
    },
    {
      "end": 3514804,
      "speaker": "Andy Kirk",
      "start": 3510806,
      "text": "It's possibly the detachment between those who create the things and those who use them.",
      "id": "ep_16_ut_313"
    },
    {
      "end": 3515824,
      "speaker": "Enrico Bertini",
      "start": 3514884,
      "text": "Yeah, exactly.",
      "id": "ep_16_ut_314"
    },
    {
      "end": 3520060,
      "speaker": "Andy Kirk",
      "start": 3516164,
      "text": "You're not there to see people actually using these things. So I hope so.",
      "id": "ep_16_ut_315"
    },
    {
      "end": 3523300,
      "speaker": "Enrico Bertini",
      "start": 3520092,
      "text": "I mean, at least I hope so. I like to think that that's the case.",
      "id": "ep_16_ut_316"
    },
    {
      "end": 3526024,
      "speaker": "Andy Kirk",
      "start": 3523412,
      "text": "Yeah, it has to be. It must be. Yeah.",
      "id": "ep_16_ut_317"
    },
    {
      "end": 3527020,
      "speaker": "Enrico Bertini",
      "start": 3526684,
      "text": "Yeah.",
      "id": "ep_16_ut_318"
    },
    {
      "end": 3551944,
      "speaker": "Moritz Stefaner",
      "start": 3527052,
      "text": "But at the same time, I think that it touches a bit on the evaluation point. And the more you move away from engineering towards cultural activity and communication, the more difficult it becomes to measure success, you know? So if you build this, you know, you have this new type of gear or screw and your motor is like 10% faster, that's, that's clear, you know, but if you successfully raised awareness for a global issue.",
      "id": "ep_16_ut_319"
    },
    {
      "end": 3597134,
      "speaker": "Enrico Bertini",
      "start": 3553364,
      "text": "Yeah, but you can still say that visualization has a full potential to help people do something. Right. This can be for instance, in the humanitarian field or in other, or in science or whatever. And we are. It's true that we are missing these kind of things like scientists coming to us and say, look, using Tableau, I discovered that protein x and y interact with blah, blah, blah. I don't know. Right. And this can be a cure for cancer. Right. I mean, of course, that's too big. Right. But that's the kind of thing that we are missing here. And I agree with Andrew. We don't know. I mean, if this is just not communicated or it's not happening at all.",
      "id": "ep_16_ut_320"
    },
    {
      "end": 3629274,
      "speaker": "Moritz Stefaner",
      "start": 3597314,
      "text": "Yeah. I for one, would wish for integration of visualization in more mainstream tools, you know, so there's no visualization in Facebook, there's no visualization in Google. There's no visualization in word. There is no visualization on PowerPoint. I'd like to see it on operating systems. I'm a bit confused. I mean, why, why don't I have, like plenty of visualization in Mac OS X? I'm really confused about that. And I'd like to wish for that if I can make a wish.",
      "id": "ep_16_ut_321"
    },
    {
      "end": 3631154,
      "speaker": "Bryan Connor",
      "start": 3629934,
      "text": "Great request.",
      "id": "ep_16_ut_322"
    },
    {
      "end": 3636854,
      "speaker": "Moritz Stefaner",
      "start": 3633174,
      "text": "Hopefully be noticed somewhere in two minutes.",
      "id": "ep_16_ut_323"
    },
    {
      "end": 3638814,
      "speaker": "Andrew Vande Moere",
      "start": 3636894,
      "text": "Your phone goes apple on the line.",
      "id": "ep_16_ut_324"
    },
    {
      "end": 3639926,
      "speaker": "Moritz Stefaner",
      "start": 3638854,
      "text": "Yeah, exactly.",
      "id": "ep_16_ut_325"
    },
    {
      "end": 3645518,
      "speaker": "Enrico Bertini",
      "start": 3640030,
      "text": "Good idea. You never know. You never know who's listening to data stories.",
      "id": "ep_16_ut_326"
    },
    {
      "end": 3646566,
      "speaker": "Moritz Stefaner",
      "start": 3645686,
      "text": "That's right.",
      "id": "ep_16_ut_327"
    },
    {
      "end": 3649590,
      "speaker": "Enrico Bertini",
      "start": 3646710,
      "text": "Maybe Mark, you know Mark who?",
      "id": "ep_16_ut_328"
    },
    {
      "end": 3657988,
      "speaker": "Moritz Stefaner",
      "start": 3649742,
      "text": "Zuckerberg. He might be a bit too busy, but if not. Hey, Mark.",
      "id": "ep_16_ut_329"
    },
    {
      "end": 3661024,
      "speaker": "Bryan Connor",
      "start": 3658156,
      "text": "Hey, Mark. He's the one viewer on the channel.",
      "id": "ep_16_ut_330"
    },
    {
      "end": 3664064,
      "speaker": "Enrico Bertini",
      "start": 3661644,
      "text": "You can come as a guest whenever you.",
      "id": "ep_16_ut_331"
    },
    {
      "end": 3668184,
      "speaker": "Moritz Stefaner",
      "start": 3664724,
      "text": "That's interesting. Oh, maybe we should make guest wishes.",
      "id": "ep_16_ut_332"
    },
    {
      "end": 3669812,
      "speaker": "Enrico Bertini",
      "start": 3668524,
      "text": "Guest wishes? Yeah.",
      "id": "ep_16_ut_333"
    },
    {
      "end": 3672540,
      "speaker": "Moritz Stefaner",
      "start": 3669908,
      "text": "Or maybe you can suggest guests for the next year who should.",
      "id": "ep_16_ut_334"
    },
    {
      "end": 3673412,
      "speaker": "Enrico Bertini",
      "start": 3672572,
      "text": "Come on, guys.",
      "id": "ep_16_ut_335"
    },
    {
      "end": 3675064,
      "speaker": "Andrew Vande Moere",
      "start": 3673548,
      "text": "Oh, yeah, I thought about that.",
      "id": "ep_16_ut_336"
    },
    {
      "end": 3676508,
      "speaker": "Enrico Bertini",
      "start": 3675404,
      "text": "Please think big.",
      "id": "ep_16_ut_337"
    },
    {
      "end": 3679744,
      "speaker": "Andrew Vande Moere",
      "start": 3676556,
      "text": "Yeah, I already have.",
      "id": "ep_16_ut_338"
    },
    {
      "end": 3684874,
      "speaker": "Andy Kirk",
      "start": 3683734,
      "text": "Bit smaller.",
      "id": "ep_16_ut_339"
    },
    {
      "end": 3698354,
      "speaker": "Andrew Vande Moere",
      "start": 3685334,
      "text": "No, but these guys behind this infographics website, I would, I would like, like visually against visualizing or these guys from venngage and visualize me and whatever.",
      "id": "ep_16_ut_340"
    },
    {
      "end": 3703174,
      "speaker": "Bryan Connor",
      "start": 3699134,
      "text": "I think have them all in one episode and have them and discuss like.",
      "id": "ep_16_ut_341"
    },
    {
      "end": 3714224,
      "speaker": "Andrew Vande Moere",
      "start": 3703214,
      "text": "Business plans and future and what is really there. Well, what is their kind of goal? You know, of course it's making money, but is there some. Something behind it? And will they think that they can reach these goals?",
      "id": "ep_16_ut_342"
    },
    {
      "end": 3721996,
      "speaker": "Moritz Stefaner",
      "start": 3715044,
      "text": "It's interesting to line up all the platforms also maybe visualizing.org because they are not exactly a startup, but more a foundation type thing.",
      "id": "ep_16_ut_343"
    },
    {
      "end": 3723500,
      "speaker": "Andy Kirk",
      "start": 3722060,
      "text": "Yeah, absolutely. Yeah.",
      "id": "ep_16_ut_344"
    },
    {
      "end": 3723868,
      "speaker": "Enrico Bertini",
      "start": 3723572,
      "text": "Yeah.",
      "id": "ep_16_ut_345"
    },
    {
      "end": 3728664,
      "speaker": "Moritz Stefaner",
      "start": 3723916,
      "text": "Good idea. Yeah. And Stephen Fu and Eddie. Right. I mean, that's.",
      "id": "ep_16_ut_346"
    },
    {
      "end": 3731904,
      "speaker": "Bryan Connor",
      "start": 3731004,
      "text": "Of course.",
      "id": "ep_16_ut_347"
    },
    {
      "end": 3734020,
      "speaker": "Andrew Vande Moere",
      "start": 3732804,
      "text": "Tea would be nice.",
      "id": "ep_16_ut_348"
    },
    {
      "end": 3735024,
      "speaker": "Enrico Bertini",
      "start": 3734212,
      "text": "Yeah.",
      "id": "ep_16_ut_349"
    },
    {
      "end": 3737264,
      "speaker": "Bryan Connor",
      "start": 3736484,
      "text": "Yeah.",
      "id": "ep_16_ut_350"
    },
    {
      "end": 3738464,
      "speaker": "Enrico Bertini",
      "start": 3737564,
      "text": "Who else?",
      "id": "ep_16_ut_351"
    },
    {
      "end": 3740544,
      "speaker": "Moritz Stefaner",
      "start": 3739284,
      "text": "David McCandless.",
      "id": "ep_16_ut_352"
    },
    {
      "end": 3742292,
      "speaker": "Enrico Bertini",
      "start": 3741244,
      "text": "Yeah, we should do that.",
      "id": "ep_16_ut_353"
    },
    {
      "end": 3747224,
      "speaker": "Andy Kirk",
      "start": 3742348,
      "text": "The headline, headline act would be Edward Tufte with Nigel Holmes.",
      "id": "ep_16_ut_354"
    },
    {
      "end": 3759864,
      "speaker": "Moritz Stefaner",
      "start": 3749084,
      "text": "Yeah, that would be fun. Fun would last for ten minutes, probably ten minutes of silence.",
      "id": "ep_16_ut_355"
    },
    {
      "end": 3765574,
      "speaker": "Bryan Connor",
      "start": 3760284,
      "text": "Something from the tapestry conference with Robert and whatever sort of comes out of that after that.",
      "id": "ep_16_ut_356"
    },
    {
      "end": 3773450,
      "speaker": "Moritz Stefaner",
      "start": 3765644,
      "text": "Yes. I totally thought we should have Robert again for just talking about narratives, because he's now totally into it and we didn't touch on that, really.",
      "id": "ep_16_ut_357"
    },
    {
      "end": 3781674,
      "speaker": "Bryan Connor",
      "start": 3773522,
      "text": "And I think one of the key speakers there is Scott McLeod, who did understanding, obviously. I think that'd be a good one.",
      "id": "ep_16_ut_358"
    },
    {
      "end": 3786466,
      "speaker": "Moritz Stefaner",
      "start": 3781794,
      "text": "Yeah. I already said I won't go, but maybe I should go.",
      "id": "ep_16_ut_359"
    },
    {
      "end": 3788634,
      "speaker": "Enrico Bertini",
      "start": 3786570,
      "text": "I'll be there. I'll be there. You will go?",
      "id": "ep_16_ut_360"
    },
    {
      "end": 3791294,
      "speaker": "Moritz Stefaner",
      "start": 3788674,
      "text": "Yeah. That's something. You can do it.",
      "id": "ep_16_ut_361"
    },
    {
      "end": 3792078,
      "speaker": "Bryan Connor",
      "start": 3791394,
      "text": "I think I will.",
      "id": "ep_16_ut_362"
    },
    {
      "end": 3802334,
      "speaker": "Enrico Bertini",
      "start": 3792126,
      "text": "I can do it. Yeah. But it's always complicated doing these kind of things at conferences. It was a big achievement for me to do one at this week with Andrew. Believe it.",
      "id": "ep_16_ut_363"
    },
    {
      "end": 3808822,
      "speaker": "Andy Kirk",
      "start": 3802414,
      "text": "How about the I o guys? Head of the festival. So J Wes.",
      "id": "ep_16_ut_364"
    },
    {
      "end": 3810286,
      "speaker": "Moritz Stefaner",
      "start": 3808878,
      "text": "Wes. Yeah, that would be nice.",
      "id": "ep_16_ut_365"
    },
    {
      "end": 3840904,
      "speaker": "Andrew Vande Moere",
      "start": 3810350,
      "text": "Dave or some academic big guys. I won't mention names because I will forget a few. I'm sure Enrico can get you access to a few of those, like even two or three together and really talk about some hard problems, because we talk about research and science, but I think for the general public, it would be nice to hear, like, what is the hard problem here inside? And, you know, where all these PhDs, what are they actually doing? Are they just making visualizations or. What is the hard problem? And they might be able to explain that.",
      "id": "ep_16_ut_366"
    },
    {
      "end": 3845484,
      "speaker": "Enrico Bertini",
      "start": 3841764,
      "text": "Yeah, yeah, we might be able to do that.",
      "id": "ep_16_ut_367"
    },
    {
      "end": 3862032,
      "speaker": "Moritz Stefaner",
      "start": 3849824,
      "text": "You think it's more fun to hang out with a few bloggers? I do think it is fun to hang out with a few.",
      "id": "ep_16_ut_368"
    },
    {
      "end": 3865696,
      "speaker": "Andrew Vande Moere",
      "start": 3862088,
      "text": "Preparation for Visweek. It would be nice. Erica, that's a good idea.",
      "id": "ep_16_ut_369"
    },
    {
      "end": 3879082,
      "speaker": "Enrico Bertini",
      "start": 3865840,
      "text": "Yeah, no, but it's true. It's true. I mean, you mentioned hard problems. I think that's another issue. What are the other problems to solve here? That's an issue. Yeah, I agree. Okay.",
      "id": "ep_16_ut_370"
    },
    {
      "end": 3880010,
      "speaker": "Moritz Stefaner",
      "start": 3879218,
      "text": "Excellent.",
      "id": "ep_16_ut_371"
    },
    {
      "end": 3880482,
      "speaker": "Enrico Bertini",
      "start": 3880162,
      "text": "Excellent.",
      "id": "ep_16_ut_372"
    },
    {
      "end": 3882322,
      "speaker": "Moritz Stefaner",
      "start": 3880498,
      "text": "Lovely, guys. Lovely.",
      "id": "ep_16_ut_373"
    },
    {
      "end": 3886494,
      "speaker": "Enrico Bertini",
      "start": 3882418,
      "text": "So we filled up the agenda for 2013, Moritz, you're welcome for that.",
      "id": "ep_16_ut_374"
    },
    {
      "end": 3889738,
      "speaker": "Moritz Stefaner",
      "start": 3887514,
      "text": "I think there's enough to do now for all of us.",
      "id": "ep_16_ut_375"
    },
    {
      "end": 3891494,
      "speaker": "Enrico Bertini",
      "start": 3889866,
      "text": "I think we piled it up.",
      "id": "ep_16_ut_376"
    },
    {
      "end": 3893254,
      "speaker": "Moritz Stefaner",
      "start": 3892034,
      "text": "Yeah, exactly.",
      "id": "ep_16_ut_377"
    },
    {
      "end": 3901792,
      "speaker": "Enrico Bertini",
      "start": 3893714,
      "text": "By the way, there will be. So me and Moritz, we realized that it will be one year of data stories not too far from.",
      "id": "ep_16_ut_378"
    },
    {
      "end": 3906672,
      "speaker": "Andrew Vande Moere",
      "start": 3901848,
      "text": "From today, mid February, and all guests get a surprise.",
      "id": "ep_16_ut_379"
    },
    {
      "end": 3917304,
      "speaker": "Enrico Bertini",
      "start": 3906768,
      "text": "Yeah, I mean, we have to come. So if we. If you have any ideas on what kind of party we can do, we should make an online party or something. I don't know.",
      "id": "ep_16_ut_380"
    },
    {
      "end": 3920464,
      "speaker": "Moritz Stefaner",
      "start": 3917384,
      "text": "Chateaulet party anyway.",
      "id": "ep_16_ut_381"
    },
    {
      "end": 3922680,
      "speaker": "Enrico Bertini",
      "start": 3920544,
      "text": "Or maybe just another hangout.",
      "id": "ep_16_ut_382"
    },
    {
      "end": 3925184,
      "speaker": "Andy Kirk",
      "start": 3922792,
      "text": "I think just present is the best way.",
      "id": "ep_16_ut_383"
    },
    {
      "end": 3926004,
      "speaker": "Andrew Vande Moere",
      "start": 3925224,
      "text": "Yeah, yeah.",
      "id": "ep_16_ut_384"
    },
    {
      "end": 3930392,
      "speaker": "Moritz Stefaner",
      "start": 3927304,
      "text": "Like golden necklaces and stuff?",
      "id": "ep_16_ut_385"
    },
    {
      "end": 3930880,
      "speaker": "Andy Kirk",
      "start": 3930448,
      "text": "Yeah.",
      "id": "ep_16_ut_386"
    },
    {
      "end": 3934656,
      "speaker": "Andrew Vande Moere",
      "start": 3930992,
      "text": "No, like this plexiglass, like rectangle with an eye inside.",
      "id": "ep_16_ut_387"
    },
    {
      "end": 3937604,
      "speaker": "Moritz Stefaner",
      "start": 3934720,
      "text": "Oh, yeah. You want one of these? Just for bragging?",
      "id": "ep_16_ut_388"
    },
    {
      "end": 3943284,
      "speaker": "Andrew Vande Moere",
      "start": 3940864,
      "text": "Maybe then I will appreciate competitions more.",
      "id": "ep_16_ut_389"
    },
    {
      "end": 3944724,
      "speaker": "Moritz Stefaner",
      "start": 3943984,
      "text": "Right?",
      "id": "ep_16_ut_390"
    },
    {
      "end": 3951936,
      "speaker": "Enrico Bertini",
      "start": 3946464,
      "text": "Okay, I think that's all for today. Thanks a lot, guys. It's been a lot of fun, as usual.",
      "id": "ep_16_ut_391"
    },
    {
      "end": 3955164,
      "speaker": "Moritz Stefaner",
      "start": 3952000,
      "text": "Thanks all. That's been great. We can do that every year if it's for me.",
      "id": "ep_16_ut_392"
    },
    {
      "end": 3956608,
      "speaker": "Enrico Bertini",
      "start": 3955464,
      "text": "Sure, yeah, of course.",
      "id": "ep_16_ut_393"
    },
    {
      "end": 3959896,
      "speaker": "Moritz Stefaner",
      "start": 3956656,
      "text": "I'm that good stuff. Okay, bye.",
      "id": "ep_16_ut_394"
    }
  ],
  "confidence": 0.909501454596672,
  "audio_duration": 3970,
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_status_code": null,
  "webhook_auth": false,
  "webhook_auth_header_name": null,
  "speed_boost": false,
  "auto_highlights_result": null,
  "auto_highlights": false,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_audio_quality": null,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "content_safety": false,
  "iab_categories": true,
  "content_safety_labels": {
    "status": "unavailable",
    "results": [],
    "summary": {}
  },
  "language_detection": false,
  "language_detection_threshold": null,
  "language_confidence": null,
  "custom_spelling": null,
  "throttled": false,
  "auto_chapters": true,
  "summarization": false,
  "summary_type": null,
  "summary_model": null,
  "custom_topics": false,
  "topics": [],
  "speech_threshold": null,
  "speech_model": "best",
  "chapters": [
    {
      "summary": "Moritz: We are again on the Google Hangout. Is it only me in the camera picture or is it you as well? We don't want to mess up anything. Data store is number 60.",
      "gist": "Google Hangout",
      "headline": "Moritz: We are again on the Google Hangout",
      "start": 5520,
      "end": 62354,
      "id": "ep_16_ch_0"
    },
    {
      "summary": "We have three fantastic guests. Andrew Vande Moere, Andy Kirk from visualizing data. com. Expect a prize. This is my third episode.",
      "gist": "2015",
      "headline": "We have three fantastic guests for this episode: Andrew Vande Moere, Andy Kirk",
      "start": 62394,
      "end": 168840,
      "id": "ep_16_ch_1"
    },
    {
      "summary": "Brian Connor from the y axis. Hi, Brian. This is my first episode. Maybe this might be the first one of a long series. No prizes. I'm still waiting for the gift from Santa.",
      "gist": "Brian on Spam Bots",
      "headline": "Spam bots everywhere. There must be a button to get rid of these types of people",
      "start": 168872,
      "end": 230804,
      "id": "ep_16_ch_2"
    },
    {
      "summary": "Education and training around data visualization has been a big thing this year. One of the standout trends has definitely been the take up of and development of D3. I would expect myself to see that grow in the next twelve months and beyond.",
      "gist": "2012: The year in data visualization",
      "headline": "There has been an increase in education and training around data visualization this year",
      "start": 231384,
      "end": 473684,
      "id": "ep_16_ch_3"
    },
    {
      "summary": "Did any of you guys give a look to Alberto Cairo's online course. Alberto suggested it wasn't necessarily for us as a demographic. How do you get people over that first obstacle of what is this subject? You really need a course, Moritz.",
      "gist": "A Taste of Alberto Cairo's Online Course",
      "headline": "Did any of you guys give a look to Alberto Cairo's online course",
      "start": 474104,
      "end": 546916,
      "id": "ep_16_ch_4"
    },
    {
      "summary": "If I would have to pick a person in Infowars. this year, the biggest person would definitely be Mike Bostock. And D3 alone is such a masterpiece. And as you say, it's growing. There's a pyramid developing.",
      "gist": "Alex Jones on Infowars and Mike Bostock",
      "headline": "Infowars is growing exponentially, and D3 alone is a masterpiece",
      "start": 547060,
      "end": 595806,
      "id": "ep_16_ch_5"
    },
    {
      "summary": "D3 is the degree to which you can interact with the data itself. What's interesting for me coming from flash is these whole new workflows that you can have because it'ssvg. Now we are really getting closer there to have nice integrated workflows between print and interactive there.",
      "gist": "In the Elevator With D3 and Illustrator",
      "headline": "Flash has opened up whole new workflow possibilities for interactive graphics",
      "start": 595830,
      "end": 679754,
      "id": "ep_16_ch_6"
    },
    {
      "summary": "The democratization now of the infographics. Everybody can visualize their own data. It's becoming like the new stock image for PowerPoints. I've seen a reduction in the amount of terrible graphics tower posters. And I've certainly picked out a few good quality infographics this year.",
      "gist": "The democratization of infographics",
      "headline": "Percy: I think the democratization of the infographics happened this year",
      "start": 681014,
      "end": 895924,
      "id": "ep_16_ch_7"
    },
    {
      "summary": "Researchers in academic set, academic settings are realizing that there are other aspects other than efficiency. People are basically using visualization as a way to communicate something. There is a huge gap in terms of research about how to use visualization. Did that manifest itself into a more successful biz week?",
      "gist": "Industrial trends in visualization",
      "headline": "Researchers in academia are increasingly using visualization as a communication tool",
      "start": 899064,
      "end": 1261564,
      "id": "ep_16_ch_8"
    },
    {
      "summary": "I think I also noticed that anything that brings back that human factor into data immediately resonates with people. That could be graphical style or the way you think about data. These very personal, handmade human things. Not sure if that people will pick it up in 2013.",
      "gist": "The aesthetic of data visualizations",
      "headline": "Handmade visualizations were very popular at this week's conference",
      "start": 1263224,
      "end": 1359114,
      "id": "ep_16_ch_9"
    },
    {
      "summary": "Enrico: The development we will see in academia and out of academia is not only on studying how people use visualization to communicate. What I expect to see is researchers coming up with new tools to help people develop visualizations that are more targeted towards storytelling. In one year or even two years, many more researchers will be focusing on this kind of stuff.",
      "gist": "Wonders of Data: Storytelling in 2013",
      "headline": "Enrico: I expect more researchers to focus on storytelling in data visualization",
      "start": 1359534,
      "end": 1621464,
      "id": "ep_16_ch_10"
    },
    {
      "summary": "Moritz: The New York Times' snowfall project was just incredible and innovative. He says it was a very immersive, multifaceted story. Moritz: A lot of similar organizations will look to that as a blueprint.",
      "gist": "The New York Times' Snowfall Project",
      "headline": "The New York Times' snowfall project was incredibly ambitious and innovative",
      "start": 1628204,
      "end": 1978174,
      "id": "ep_16_ch_11"
    },
    {
      "summary": "The amount of individuals and organizations that shared their narratives, the design narratives. I think it's great when you see people justifying, reasoning how and why they've arrived at a solution given the problem they were given. And using infographics, I would hope that Datavis people, a few more people will do it.",
      "gist": "The Design Narratives",
      "headline": "The amount of individuals and organizations that shared their narratives last year was great",
      "start": 1979674,
      "end": 2104382,
      "id": "ep_16_ch_12"
    },
    {
      "summary": "Nothing special happened in terms of blogging in our area in 2012. But we saw many more books coming out. Having, not having new blogs, but having new books is definitely a good thing. I'd like to see more blogs this year.",
      "gist": "No New Blogs in 2012",
      "headline": "So speaking of blogging, I want to mention maybe something that didn't happen in 2012",
      "start": 2104558,
      "end": 2531534,
      "id": "ep_16_ch_13"
    },
    {
      "summary": "No, I wanted to mention another topic, but go ahead. Same with me. So I'll go first. Who goes first? I'll going first. Of course.",
      "gist": "Let's talk politics",
      "headline": "Who goes first on this topic? I'll go first",
      "start": 2531954,
      "end": 2547214,
      "id": "ep_16_ch_14"
    },
    {
      "summary": "Santiago has dominated a lot of the new work of the last six months. Mike Bostock brought some very beautiful pieces out, whole year. Moritz has been fantastic this last year. Who else do you want to mention?",
      "gist": "A Look Back at 2012",
      "headline": "Santiago has dominated the new work of the last six months",
      "start": 2549034,
      "end": 2629274,
      "id": "ep_16_ch_15"
    },
    {
      "summary": "Real time was very big in the time of the year of the Olympics. Outside of sports, I haven't seen any big or. I don't know if there were any with the us elections or not. If you're facing another big event in the future, do you try and find something that differentiates you from the rest?",
      "gist": "Quantum Dive: The Year in Data",
      "headline": "Real time was big during the Olympics and the elections",
      "start": 2629314,
      "end": 2879264,
      "id": "ep_16_ch_16"
    },
    {
      "summary": "Is there a new trend for politicians in the Senate and Congress with infographics. Absolutely. You can see it coming up a lot more as a tool for, for people in politics to, you know, use. Other tools like real time sports or second screen applications are also starting to get some traction.",
      "gist": "In the Elevator With Infographics",
      "headline": "Is there a trend for politicians in the Senate and Congress with infographics",
      "start": 2879564,
      "end": 3007464,
      "id": "ep_16_ch_17"
    },
    {
      "summary": "The quality or the perceived quality of the conferences last year. Hopefully the same trend will continue next year. In the marathon, it was so obvious how much the quality has changed over the last 18 months. One designer I was also going to mention who's not on the radar for many is a guy called Simon Scar.",
      "gist": "Viz Week and the",
      "headline": "One observation was just the quality or perceived quality of the conferences last year",
      "start": 3011664,
      "end": 3298264,
      "id": "ep_16_ch_18"
    },
    {
      "summary": "In 2013, I want to see in 2013 the same rate of development we got so far. It's been great. I never thought that it would be just so perfect. I don't know how long it's gonna last, but as long as it lasts.",
      "gist": "Wonders of the World",
      "headline": "So maybe we can conclude by mentioning what are your best wishes for 2013",
      "start": 3300844,
      "end": 3411914,
      "id": "ep_16_ch_19"
    },
    {
      "summary": "Andrew Keen would like to hear more success stories about using visualization. He would also like to see more integration of visualization in more mainstream tools. Keen: The more you move away from engineering towards cultural activity and communication, the more difficult it becomes to measure success.",
      "gist": "Wish I heard more success stories in visualization",
      "headline": "Andrew: I would like to hear more success stories about visualization",
      "start": 3413534,
      "end": 3665788,
      "id": "ep_16_ch_20"
    },
    {
      "summary": "The panelists suggest guests for the next year who should. Have them all in one episode and discuss business plans and future. Preparation for Visweek. It's always complicated doing these kind of things at conferences.",
      "gist": "A guest wish for the next year",
      "headline": "Maybe we should make guest wishes for next year's Visweek",
      "start": 3665876,
      "end": 3882322,
      "id": "ep_16_ch_21"
    },
    {
      "summary": "From today, mid February, and all guests get a surprise. If you have any ideas on what kind of party we can do, we should make an online party or something. It's been a lot of fun, as usual. Thanks all.",
      "gist": "A Year of Data Stories",
      "headline": "All guests get a surprise from today, mid February",
      "start": 3882418,
      "end": 3959896,
      "id": "ep_16_ch_22"
    }
  ],
  "disfluencies": false,
  "entity_detection": false,
  "sentiment_analysis": false,
  "sentiment_analysis_results": null,
  "entities": null,
  "speakers_expected": null,
  "summary": null,
  "custom_topics_results": null,
  "episode_num": 16,
  "episode_metadata": {
    "speakers": [
      "Enrico Bertini",
      "Moritz Stefaner",
      "Andrew Vande Moere",
      "Andy Kirk",
      "Bryan Connor"
    ],
    "WPid": "95",
    "url": "https://datastori.es/podlove/file/162/s/feed/c/mp3/datastories-16.mp3",
    "episode_title": "What Was Big in 2012 and What Is Coming in 2013"
  }
}