{
  "id": "f95aefd3-2b6f-47ad-a87c-0f685d8b8b56",
  "language_model": "assemblyai_default",
  "acoustic_model": "assemblyai_default",
  "language_code": "en_us",
  "status": "completed",
  "audio_url": "https://datastori.es/podlove/file/542/s/feed/c/mp3/data-stories-45-with-nicholas-felton.mp3",
  "utterances": [
    {
      "end": 42858,
      "speaker": "Moritz Stefaner",
      "start": 240,
      "text": "Datastores is supported by Tableau software, helping people see and understand their data. Get answers from interactive dashboards wherever you go for your free trial, visit Tableau software at table software.com Datastories. Hey, everyone. Datastories 45, and I'm in New York in the same room with Enrico, which is amazing.",
      "id": "ep_45_ut_0"
    },
    {
      "end": 49230,
      "speaker": "Enrico Bertini",
      "start": 42954,
      "text": "It's amazing. We converted our. My office to a studio. Yeah, I'm pretty nice. Yeah.",
      "id": "ep_45_ut_1"
    },
    {
      "end": 54874,
      "speaker": "Moritz Stefaner",
      "start": 49770,
      "text": "And, yeah, I'm super stressed out, but I won't go into detail, but I'll just.",
      "id": "ep_45_ut_2"
    },
    {
      "end": 56310,
      "speaker": "Enrico Bertini",
      "start": 54922,
      "text": "You spaced out in New York?",
      "id": "ep_45_ut_3"
    },
    {
      "end": 66982,
      "speaker": "Moritz Stefaner",
      "start": 56650,
      "text": "I don't know. Yeah. We had ambitious plans for very ambitious interactive installations. And these things are tough, but we're getting there.",
      "id": "ep_45_ut_4"
    },
    {
      "end": 68046,
      "speaker": "Enrico Bertini",
      "start": 67086,
      "text": "Yeah. Good.",
      "id": "ep_45_ut_5"
    },
    {
      "end": 78950,
      "speaker": "Moritz Stefaner",
      "start": 68198,
      "text": "Anyways, we're here and we said we need to use the opportunity to have somebody on the show we wanted to have for a very long time. And that's Nick Felton, and he's sitting, actually, right in the middle here between us.",
      "id": "ep_45_ut_6"
    },
    {
      "end": 79822,
      "speaker": "Enrico Bertini",
      "start": 78990,
      "text": "Hi, Nick.",
      "id": "ep_45_ut_7"
    },
    {
      "end": 81406,
      "speaker": "Nicholas Felton",
      "start": 80006,
      "text": "Welcome to the show.",
      "id": "ep_45_ut_8"
    },
    {
      "end": 82310,
      "speaker": "Moritz Stefaner",
      "start": 81478,
      "text": "Great to have you.",
      "id": "ep_45_ut_9"
    },
    {
      "end": 84170,
      "speaker": "Nicholas Felton",
      "start": 82390,
      "text": "Great to be here. Yeah, yeah.",
      "id": "ep_45_ut_10"
    },
    {
      "end": 86030,
      "speaker": "Moritz Stefaner",
      "start": 84470,
      "text": "It was about time.",
      "id": "ep_45_ut_11"
    },
    {
      "end": 88370,
      "speaker": "Enrico Bertini",
      "start": 86150,
      "text": "It was about time. Yeah, absolutely.",
      "id": "ep_45_ut_12"
    },
    {
      "end": 101080,
      "speaker": "Moritz Stefaner",
      "start": 89390,
      "text": "So for those of you who don't know, Nick is sort of famous, first of all, and mostly for his personal annual reports he's been doing now for almost a decade.",
      "id": "ep_45_ut_13"
    },
    {
      "end": 103332,
      "speaker": "Nicholas Felton",
      "start": 101580,
      "text": "And I think it's a good calling card.",
      "id": "ep_45_ut_14"
    },
    {
      "end": 106076,
      "speaker": "Moritz Stefaner",
      "start": 103396,
      "text": "Yeah, yeah. It's like a nice package.",
      "id": "ep_45_ut_15"
    },
    {
      "end": 106760,
      "speaker": "Nicholas Felton",
      "start": 106148,
      "text": "Yeah.",
      "id": "ep_45_ut_16"
    },
    {
      "end": 119388,
      "speaker": "Moritz Stefaner",
      "start": 107220,
      "text": "Shows persistence, stubbornness. Yeah, sort of. Stubbornness, that's right. And, yeah, they started off as sort of a little design idea, I guess, and developed a life of their own. Is that right?",
      "id": "ep_45_ut_17"
    },
    {
      "end": 130150,
      "speaker": "Nicholas Felton",
      "start": 119444,
      "text": "I. Yeah, somehow I get to hang out with talented people like you, whereas I was just a, you know, a generalist graphic designer ten years ago, making naive pie charts.",
      "id": "ep_45_ut_18"
    },
    {
      "end": 135994,
      "speaker": "Moritz Stefaner",
      "start": 131490,
      "text": "And it was a side project, basically like a holiday project or how did it get started?",
      "id": "ep_45_ut_19"
    },
    {
      "end": 169910,
      "speaker": "Nicholas Felton",
      "start": 136082,
      "text": "You know, it's just a one in a string of little things I would throw at the wall. I had. I had feltra on the website since maybe 1999, and I was always doing little things like, here's a typeface or some photography. And it came out of this a common tradition of people wanting to wrap up their year and make a thing that encapsulates it and then move fresh into the next year. And the Internet liked the direction it was going in and sort of patted me on the back and said, that's cool. And no one had really cared about the other things I'd done, so I decided to stick with it.",
      "id": "ep_45_ut_20"
    },
    {
      "end": 172670,
      "speaker": "Enrico Bertini",
      "start": 170730,
      "text": "You could do one thing right.",
      "id": "ep_45_ut_21"
    },
    {
      "end": 179166,
      "speaker": "Moritz Stefaner",
      "start": 174150,
      "text": "And so the reports for you, they summarize the year in data mostly.",
      "id": "ep_45_ut_22"
    },
    {
      "end": 179470,
      "speaker": "Nicholas Felton",
      "start": 179238,
      "text": "Right.",
      "id": "ep_45_ut_23"
    },
    {
      "end": 182158,
      "speaker": "Moritz Stefaner",
      "start": 179510,
      "text": "So you're self surveying yourself.",
      "id": "ep_45_ut_24"
    },
    {
      "end": 182654,
      "speaker": "Nicholas Felton",
      "start": 182294,
      "text": "Yeah.",
      "id": "ep_45_ut_25"
    },
    {
      "end": 185694,
      "speaker": "Moritz Stefaner",
      "start": 182702,
      "text": "And the people you surround with and take a lot of information.",
      "id": "ep_45_ut_26"
    },
    {
      "end": 332698,
      "speaker": "Nicholas Felton",
      "start": 185862,
      "text": "Yeah. I'd say the first three were on. Just they were opening my eyes to what all the data that we generate about our lives. And so the first one was kind of an archaeological endeavor where I looked back at what I incidentally recorded about my year, and then the next two were like, oh, it'd be cool to know how many beers I drank, or it would be great to know how many miles I traveled or how many coffees I drank. And then after that, I started getting a little bit more thematic, like, you know, it's not just the scope of everything that's knowable. It's the ways sometimes in which you track it or having a point of view about it. So in 2008, I thought, you know, miles are something that's really interesting. It's something we all do. We all travel. We all walk and, you know, drive and fly somewhere. But at the end of the year, this is going to amount to something different for everyone. So even if I could just figure out the number of miles that I traveled in the year, like, that's a fingerprint for me. And I'd been doing it for three years, then I thought that was significant, and I was like, oh, maybe I'll take a year off, and the report will just be a number, and that's it. But then there were too many juicy little alleyways to go down and exploring that, and so it turned into a whole thing. And then in 2009, I thought, you know what? I spent a lot of my own energy trying to track. This year, I'm going to ask other people to tell me what I'm doing and see if that knowledge of experience can amount to something interesting. And that one was really cool. And in 2010, my father passed away, and I had all these questions about his life. And so by looking through his affects when he passed away, I was able to, like, tell a pretty rich story of his life. And so it's just been going on and on with, like, finding these little angles on ways to get at my behavior. And like you said, it's also been, it's not just been telling my life in more detail. It's been encompassing the people around me. And I think that's, you know, I think that's kind of a common data story, is that the, the more you try and get at one thing, the more it starts to rope in other things around you. Whether it's other data sets or with the individual, it's other people. And certainly in like a security state. It's obvious that, like, you're not just interested in one person, you're interested in the person one and two hops over from them. Yeah.",
      "id": "ep_45_ut_27"
    },
    {
      "end": 353428,
      "speaker": "Moritz Stefaner",
      "start": 332754,
      "text": "Yeah. I mean, to me, the reports are really a really long term performance. That's how I see them, because they raise all these questions and they show all these different ways you can collect data, show all these ways how the data is. So, you know, it doesn't really tell you all that much. And at the same time, it's so revealing and, you know, it's.",
      "id": "ep_45_ut_28"
    },
    {
      "end": 362004,
      "speaker": "Enrico Bertini",
      "start": 353564,
      "text": "Especially if it's about yourself. Right. Because you are. I mean, you can really judge the quality of whatever comes out of this process because, you know. Exactly.",
      "id": "ep_45_ut_29"
    },
    {
      "end": 373316,
      "speaker": "Nicholas Felton",
      "start": 362132,
      "text": "Yeah. And it's also, you know, for my part, it is a performance or, like, an act of restraint and perseverance as well. When I had these cards that I had to give to strangers that I talked to.",
      "id": "ep_45_ut_30"
    },
    {
      "end": 373684,
      "speaker": "Moritz Stefaner",
      "start": 373388,
      "text": "Yeah.",
      "id": "ep_45_ut_31"
    },
    {
      "end": 406060,
      "speaker": "Nicholas Felton",
      "start": 373732,
      "text": "You know, I remember, like, a really drunk guy I was talking to at a bar, and he probably had no recollection of what happened, but the rules said if I had a significant conversation with him, I had to give him one of these cards. So I was just like, I have to give you this. And I ran off, run away or my dentist after having a conversation with him. And, you know, I'm pretty good at, like, staying in this world where people know what I do. And to break that wall into people like the normals who are not encountered with a yemenite. Active performance art very frequently, I think. Yeah.",
      "id": "ep_45_ut_32"
    },
    {
      "end": 406340,
      "speaker": "Moritz Stefaner",
      "start": 406100,
      "text": "Yeah.",
      "id": "ep_45_ut_33"
    },
    {
      "end": 406908,
      "speaker": "Nicholas Felton",
      "start": 406380,
      "text": "It's bizarre.",
      "id": "ep_45_ut_34"
    },
    {
      "end": 420760,
      "speaker": "Moritz Stefaner",
      "start": 406964,
      "text": "Do you think it was better that people were aware that you're sort of doing something strange with tracking, or were you more comfortable where you were doing it more for yourself and people wouldn't even realize they might show up in the report.",
      "id": "ep_45_ut_35"
    },
    {
      "end": 432580,
      "speaker": "Nicholas Felton",
      "start": 421860,
      "text": "You need a bit of both, I think. It's certainly, it's easier when it's people who know what's going on, but it's also. That's. It's not accurate to just stick with that pool of people.",
      "id": "ep_45_ut_36"
    },
    {
      "end": 434300,
      "speaker": "Moritz Stefaner",
      "start": 433160,
      "text": "Yeah. Yeah.",
      "id": "ep_45_ut_37"
    },
    {
      "end": 454300,
      "speaker": "Enrico Bertini",
      "start": 435000,
      "text": "So I'm just curious. I have a question that is similar to what you just said. I'm curious, I guess that by tracking so much data about yourself, you might actually have changed your behavior during the years. So I'm curious to hear, did you notice any change in behaviors by the mere fact that you are tracking more of your own life?",
      "id": "ep_45_ut_38"
    },
    {
      "end": 489036,
      "speaker": "Nicholas Felton",
      "start": 455650,
      "text": "Yeah. I mean, so I'm not trying to optimize my behavior or anything, but certainly the. The weight of these, these tracking experiments does have an impact, and last year, I was trying to keep track of all the conversations I had, which meant, you know, for any interaction, I would write a little synopsis of it, and it made me dumber. So just having to remember this, like, what was going on at all times, I think I was probably less productive, less interesting to talk to last year. I'm really glad that that burden has.",
      "id": "ep_45_ut_39"
    },
    {
      "end": 496612,
      "speaker": "Enrico Bertini",
      "start": 489068,
      "text": "Passed, because, in a way, it's a tool for self discovery. Right. And the more you discover things about yourself, the more you are affected by that.",
      "id": "ep_45_ut_40"
    },
    {
      "end": 500724,
      "speaker": "Moritz Stefaner",
      "start": 496676,
      "text": "Sure. So I think that's the observation changes the object.",
      "id": "ep_45_ut_41"
    },
    {
      "end": 525030,
      "speaker": "Nicholas Felton",
      "start": 500772,
      "text": "Yeah. And I try and set up these experiments to, like, imbue my life with better behaviors. And so certainly that lens, like, if something happens, the lens is like, oh, that would be cool. For the annual report. Like, I remember the secret Service showed up once at my office, and they were looking for. Yeah. For, like, a check forger.",
      "id": "ep_45_ut_42"
    },
    {
      "end": 525550,
      "speaker": "Moritz Stefaner",
      "start": 525150,
      "text": "Oh, wow.",
      "id": "ep_45_ut_43"
    },
    {
      "end": 583206,
      "speaker": "Nicholas Felton",
      "start": 525590,
      "text": "And so first reaction was, oh, shit, secret service is here. Second is, this is going in the annual report. This is something interesting that happened, and it would compel me to try and do more interesting things, like, if I got an invitation to go to a party, like, deep in queens, where I might not normally go, I'm like, you know, you get this bird's eye view of, like, of my map of my behavior, this is gonna be an outlier. This is gonna be something that pushes me out of the norm. And, you know, I don't know if without that sort of God's eye view of your own behavior, if that's always such a. Such a force. I see that, like, with my, when I go running in my neighborhood, I have a natural desire to, like, always want to, like, walk, run down different streets that I haven't been down. And then when I, like, pull in all my moves data, and I visualize it, I can see, oh, there's a block there that I've never been down. I gotta go there.",
      "id": "ep_45_ut_44"
    },
    {
      "end": 583942,
      "speaker": "Moritz Stefaner",
      "start": 583238,
      "text": "You need to go there.",
      "id": "ep_45_ut_45"
    },
    {
      "end": 584918,
      "speaker": "Enrico Bertini",
      "start": 584006,
      "text": "Super interesting.",
      "id": "ep_45_ut_46"
    },
    {
      "end": 586702,
      "speaker": "Nicholas Felton",
      "start": 584974,
      "text": "Yeah, yeah.",
      "id": "ep_45_ut_47"
    },
    {
      "end": 606680,
      "speaker": "Enrico Bertini",
      "start": 586726,
      "text": "But do you think that, in a way, this could actually be applied on a. On a large scale or it's something that can be only done? I mean, so my question is more, do you think I can we imagine a future not too far from here, from now, where it would be much, much easier to do exactly the same thing, but on a much larger scale for everyone?",
      "id": "ep_45_ut_48"
    },
    {
      "end": 643066,
      "speaker": "Nicholas Felton",
      "start": 607140,
      "text": "Yeah, I mean, I think that data exists for most people. Like, pretty granular location data is out there for everyone. It's just not. People haven't really cracked the nut of why you should care about it. And people have a lot of concerns in their life. Right. They're trying to optimize for very different things besides walking down a block in Brooklyn that you haven't been down before. You know, it's, I think it's kind of a magical, interesting experience, but it doesn't, like, make your grocery bill less or get you to a place faster. And those are, those are problems that people are not working on.",
      "id": "ep_45_ut_49"
    },
    {
      "end": 645430,
      "speaker": "Enrico Bertini",
      "start": 643178,
      "text": "Too happy to learn too much about themselves.",
      "id": "ep_45_ut_50"
    },
    {
      "end": 679182,
      "speaker": "Nicholas Felton",
      "start": 647210,
      "text": "Yeah. I mean, it's a question I ask myself with some of the tools that I build. Like, you know, what are most people's lives like? Do they. I'm fortunate. I get to travel a lot, but I don't know what the average experience is like. How often do people leave their city and go or take vacations? Certainly from a mapping perspective, that makes things a bit more interesting and creates that narrative. Yeah.",
      "id": "ep_45_ut_51"
    },
    {
      "end": 688550,
      "speaker": "Enrico Bertini",
      "start": 679206,
      "text": "And I'm also wondering, I mean, one can also imagine to provide its own data for free to others to observe. Did you ever think about it?",
      "id": "ep_45_ut_52"
    },
    {
      "end": 719812,
      "speaker": "Nicholas Felton",
      "start": 688590,
      "text": "I did think about that. I thought one year I would have, like, an open source one where I would provide my data, but I think it would, I think it would be used for evil. I don't think people would use it to, like, find interesting things. I think they would either, like, just try and find loopholes or embarrassing things in the data. And it's, and maybe that's not the case, but, like, the fact that that could exist makes me not want to do it, or I would like, anonymize it and put it out in some other set.",
      "id": "ep_45_ut_53"
    },
    {
      "end": 738688,
      "speaker": "Moritz Stefaner",
      "start": 719876,
      "text": "But, and again, it's also data about others. Like, you are the, around you, you know, are all these other people. And I think that's the main problem, really, and the main responsibility that, well, sure, you're tracking yourself, but also all the other people to some degree. And once you put that out there, it's going to be tricky.",
      "id": "ep_45_ut_54"
    },
    {
      "end": 787390,
      "speaker": "Nicholas Felton",
      "start": 738744,
      "text": "Yeah. In one annual report that was actually two years of data, I listed every single place that I went over those two years. And so there's a potency to that data that declines over time. Right. So you're really protective of your current location, and very few people broadcast that all the time, but I think for your location history, it's lost its potency and we don't care about it as much. And so I was interested in seeing would a list of every single place that I went over these two years have, you know, would I have concerns about publishing it? And there were, there were two places that I was like, you know what? I'm probably fine telling people that I went to these places, but I just don't want it in print in a format that will be around till I die.",
      "id": "ep_45_ut_55"
    },
    {
      "end": 794468,
      "speaker": "Enrico Bertini",
      "start": 788140,
      "text": "To think about the data traces that you live every day and what part of it is actually, what would you.",
      "id": "ep_45_ut_56"
    },
    {
      "end": 795716,
      "speaker": "Moritz Stefaner",
      "start": 794484,
      "text": "Like to preserve as being private?",
      "id": "ep_45_ut_57"
    },
    {
      "end": 796284,
      "speaker": "Enrico Bertini",
      "start": 795748,
      "text": "Yeah, exactly.",
      "id": "ep_45_ut_58"
    },
    {
      "end": 810156,
      "speaker": "Nicholas Felton",
      "start": 796332,
      "text": "Yeah. And also, I mean, things lose their potency and other things gain potency. Right. Like, you don't care about, you know, those photos that you had on Facebook during college, but then five years later, they've become radioactive. Right.",
      "id": "ep_45_ut_59"
    },
    {
      "end": 810796,
      "speaker": "Enrico Bertini",
      "start": 810228,
      "text": "Yeah. Yeah.",
      "id": "ep_45_ut_60"
    },
    {
      "end": 831610,
      "speaker": "Moritz Stefaner",
      "start": 810868,
      "text": "And, I mean, that's a big critique also about mass surveillance, let's say, coming from NSA or. So that's a. You won't know now, today, we won't know what might be important in five years to look up about us, you know, and so there might be, like, narratives constructed, you know, in hindsight, that. And then people always find evidence for, you know, whatever they are looking for and things like this.",
      "id": "ep_45_ut_61"
    },
    {
      "end": 832258,
      "speaker": "Nicholas Felton",
      "start": 831690,
      "text": "Yeah.",
      "id": "ep_45_ut_62"
    },
    {
      "end": 838698,
      "speaker": "Moritz Stefaner",
      "start": 832394,
      "text": "And so I think it's very hard to make that call right now. What's. What's the data I want to keep private?",
      "id": "ep_45_ut_63"
    },
    {
      "end": 839714,
      "speaker": "Nicholas Felton",
      "start": 838874,
      "text": "Yeah. Yeah.",
      "id": "ep_45_ut_64"
    },
    {
      "end": 842628,
      "speaker": "Moritz Stefaner",
      "start": 839802,
      "text": "Because you don't know what's. What's going on in five years.",
      "id": "ep_45_ut_65"
    },
    {
      "end": 843680,
      "speaker": "Nicholas Felton",
      "start": 842794,
      "text": "Yeah. Yeah.",
      "id": "ep_45_ut_66"
    },
    {
      "end": 858980,
      "speaker": "Moritz Stefaner",
      "start": 843800,
      "text": "How do you think about, like, your self surveillance now in the view of the Snowden revelations and the mass surveillance discussions? Is it, like, totally different? Is there some overlap? Is it, like, you know, how's the position there?",
      "id": "ep_45_ut_67"
    },
    {
      "end": 916000,
      "speaker": "Nicholas Felton",
      "start": 861280,
      "text": "I haven't considered the intersection between the government and my data that much. But as someone who is trying to make products to help people leverage their own personal data and even, like, capture stuff that might not be captured in other places, there, you really have a much larger burden to provide value. It can't just be like, this is cool because this data maybe didn't exist before, and now it does exist. So it may be accessible by the government and it may come to harm you, but then there's the other side of it where, you know, I think. I think we're having this conversation about many things, you know, both the dystopian and the utopian versions of things, because it is powerful. And there's certainly the cases where, you know, you could go to jail based on your location data. Right. It could also be an alibi. Right?",
      "id": "ep_45_ut_68"
    },
    {
      "end": 916900,
      "speaker": "Enrico Bertini",
      "start": 916080,
      "text": "Oh, yeah.",
      "id": "ep_45_ut_69"
    },
    {
      "end": 937006,
      "speaker": "Nicholas Felton",
      "start": 921760,
      "text": "So my. My girlfriend was, Washington pulled over for speeding earlier this year, and she was by herself. And my response was, damn it, if I'd been in the car with you, I'm well enough instrumented that we could find out what speed you are going.",
      "id": "ep_45_ut_70"
    },
    {
      "end": 940982,
      "speaker": "Moritz Stefaner",
      "start": 937078,
      "text": "Exactly. Very interesting.",
      "id": "ep_45_ut_71"
    },
    {
      "end": 943930,
      "speaker": "Nicholas Felton",
      "start": 941126,
      "text": "But she got off. She didn't have to go to jail.",
      "id": "ep_45_ut_72"
    },
    {
      "end": 945730,
      "speaker": "Moritz Stefaner",
      "start": 944750,
      "text": "Very good.",
      "id": "ep_45_ut_73"
    },
    {
      "end": 956488,
      "speaker": "Enrico Bertini",
      "start": 946390,
      "text": "So I'm curious to hear, how do you actually track your data in practice? How many different channels? How do you do it in practice? You use devices or your own app?",
      "id": "ep_45_ut_74"
    },
    {
      "end": 1051369,
      "speaker": "Nicholas Felton",
      "start": 956544,
      "text": "I don't know. So it varies year to year. Last year, some of it I was getting for free. I was interested in communication data. So a lot of it is just being saved by virtue of using those services like sms and email and Facebook chat. And then for the hard stuff, the stuff that was really juicy to me because no one else has it. That's where I had to come up with a methodology for tracking communication and nonverbal exchanges. And I use an app called Fulcrum that I think is kind of intended for surveying a city. So basically, you set up a survey and it's geolocated. So you get the metadata of like a timestamp and a location for free. Then you can make a survey. And I had optimized it with a bunch of choices and so I could very quickly enter in, like, what my greetings were. Actually, they've changed their pricing, so it really doesn't make sense to use that product anymore. And I released an app called Reporter that could actually, like, do a great job of that now. But this year, I'm interested in the state of the market for surveillance objects and apps. And so I'm using a combination of physical devices like a Nike fuel band and a basis band and a Fitbit. My phone, which is tracking location. I have my computer instrumented with rescue time. I have a breathalyzer that I use. I have a module in my car that keeps track of the car.",
      "id": "ep_45_ut_75"
    },
    {
      "end": 1055717,
      "speaker": "Moritz Stefaner",
      "start": 1053389,
      "text": "So this has been the high tech scale.",
      "id": "ep_45_ut_76"
    },
    {
      "end": 1114870,
      "speaker": "Nicholas Felton",
      "start": 1055893,
      "text": "Yeah, this is all the stuff that people have. And so I want to see, like, between all these different fragmented bits that don't really know about each other. Can I weave this into something that has the richness of the reports where I set out to get a set of data? And I think it's going to be pretty good. There's one story that I'm already itching to tell, which is that I wear, I wear the Fitbit and the basis, like, you know, whenever they have batteries, I'm wearing them. So most of the time when I sleep, I wear them and they keep track of steps. But then the Fitbit I keep in my pants pocket. So it's kind of a, it's a pants detector now. So if I look at the time from, like, first step in one of the other devices to time the first step of the Fitbit, I actually will know how long it takes me between getting out of bed and putting my pants on. I'll actually know how far it is. Like, how many miles did I walk? Yeah.",
      "id": "ep_45_ut_77"
    },
    {
      "end": 1118146,
      "speaker": "Moritz Stefaner",
      "start": 1116370,
      "text": "Pantlessly. Yeah.",
      "id": "ep_45_ut_78"
    },
    {
      "end": 1121472,
      "speaker": "Nicholas Felton",
      "start": 1118338,
      "text": "Wow. Yeah. So I like to think of the Fitbit as a pants detector.",
      "id": "ep_45_ut_79"
    },
    {
      "end": 1129320,
      "speaker": "Moritz Stefaner",
      "start": 1121536,
      "text": "Yeah. It's a great example of how, like two simple things, once you get that information together, you know, in the difference, suddenly a third thing.",
      "id": "ep_45_ut_80"
    },
    {
      "end": 1129968,
      "speaker": "Nicholas Felton",
      "start": 1129400,
      "text": "Exactly.",
      "id": "ep_45_ut_81"
    },
    {
      "end": 1132152,
      "speaker": "Moritz Stefaner",
      "start": 1130064,
      "text": "So they become together. A pants detector.",
      "id": "ep_45_ut_82"
    },
    {
      "end": 1145900,
      "speaker": "Nicholas Felton",
      "start": 1132216,
      "text": "Yeah, yeah. And I can also do a phone detector because I have moves, tracking steps. And so if I have steps where the phone isn't a part of it, I know, like it was sitting on my desk or something else. Yeah.",
      "id": "ep_45_ut_83"
    },
    {
      "end": 1149902,
      "speaker": "Moritz Stefaner",
      "start": 1146750,
      "text": "And if you would only use one of them, you would trust them blindly.",
      "id": "ep_45_ut_84"
    },
    {
      "end": 1150214,
      "speaker": "Nicholas Felton",
      "start": 1149966,
      "text": "Right.",
      "id": "ep_45_ut_85"
    },
    {
      "end": 1157158,
      "speaker": "Moritz Stefaner",
      "start": 1150262,
      "text": "But now that you use three moves and the two physical devices, you understand also, I guess, how flaky they are probably.",
      "id": "ep_45_ut_86"
    },
    {
      "end": 1194040,
      "speaker": "Nicholas Felton",
      "start": 1157254,
      "text": "Yeah. And it's just I like to compare them to tamagotchis. You remember those digital pets. Sure. So you had to keep them fed and everything. And so physical tracking devices are tamagotchis. Right. They need to be, first of all, with you. Right. That's, for some people is the hardest thing to just remember to put it on or not put it in the wash. Right. Then they need to be charged with electricity and then, so then you can get the data and then they need to be synced. Like, you got to get it off. Right. So these really needy creatures, I think for most people, the. The value isn't there to really, like.",
      "id": "ep_45_ut_87"
    },
    {
      "end": 1198164,
      "speaker": "Enrico Bertini",
      "start": 1195860,
      "text": "I used to have a jawbone, which I loved.",
      "id": "ep_45_ut_88"
    },
    {
      "end": 1198460,
      "speaker": "Nicholas Felton",
      "start": 1198212,
      "text": "Yeah.",
      "id": "ep_45_ut_89"
    },
    {
      "end": 1204356,
      "speaker": "Enrico Bertini",
      "start": 1198500,
      "text": "But I'm just too lazy or stupid to remember to charge the butter and then it doesn't.",
      "id": "ep_45_ut_90"
    },
    {
      "end": 1208856,
      "speaker": "Nicholas Felton",
      "start": 1204388,
      "text": "No, I just think you didn't, you didn't care enough, like give you enough value.",
      "id": "ep_45_ut_91"
    },
    {
      "end": 1224464,
      "speaker": "Enrico Bertini",
      "start": 1208928,
      "text": "I think that's the thing. The thing of value. Value is a very important aspect here because you keep caring of these things only if they provide a lot of value. I think there is a sort of threshold there. Right. If there is enough value, you don't take care of them.",
      "id": "ep_45_ut_92"
    },
    {
      "end": 1227504,
      "speaker": "Nicholas Felton",
      "start": 1224552,
      "text": "Exactly. And your phone has the same demands.",
      "id": "ep_45_ut_93"
    },
    {
      "end": 1227984,
      "speaker": "Enrico Bertini",
      "start": 1227552,
      "text": "Yeah, yeah.",
      "id": "ep_45_ut_94"
    },
    {
      "end": 1230300,
      "speaker": "Nicholas Felton",
      "start": 1228032,
      "text": "But your phone is proved it's worth.",
      "id": "ep_45_ut_95"
    },
    {
      "end": 1234664,
      "speaker": "Moritz Stefaner",
      "start": 1231520,
      "text": "It's a tough world out there. It's little creatures.",
      "id": "ep_45_ut_96"
    },
    {
      "end": 1235430,
      "speaker": "Enrico Bertini",
      "start": 1234752,
      "text": "Yeah, it is.",
      "id": "ep_45_ut_97"
    },
    {
      "end": 1239802,
      "speaker": "Nicholas Felton",
      "start": 1235520,
      "text": "It is. Yeah. So the ones that survive are the ones that are on your phone at the moment.",
      "id": "ep_45_ut_98"
    },
    {
      "end": 1240234,
      "speaker": "Moritz Stefaner",
      "start": 1239866,
      "text": "Right.",
      "id": "ep_45_ut_99"
    },
    {
      "end": 1246282,
      "speaker": "Nicholas Felton",
      "start": 1240322,
      "text": "Or I think. I think the watch will do pretty well, the Apple Watch, because it will also, like, be a communication device.",
      "id": "ep_45_ut_100"
    },
    {
      "end": 1246858,
      "speaker": "Enrico Bertini",
      "start": 1246346,
      "text": "Yeah.",
      "id": "ep_45_ut_101"
    },
    {
      "end": 1260910,
      "speaker": "Nicholas Felton",
      "start": 1246994,
      "text": "See your Instagram likes and your tweets and things on it. And those are giving you enough value that even though it's tracking your heartbeat, you're like, I don't know what that's good for. It's kind of interesting. And you wouldn't keep it alive on its own, but.",
      "id": "ep_45_ut_102"
    },
    {
      "end": 1266852,
      "speaker": "Moritz Stefaner",
      "start": 1261660,
      "text": "Yeah, but in a few years, we will find it quite funny that we would have a dedicated step track.",
      "id": "ep_45_ut_103"
    },
    {
      "end": 1268340,
      "speaker": "Enrico Bertini",
      "start": 1266916,
      "text": "You know, that's what I'm wondering.",
      "id": "ep_45_ut_104"
    },
    {
      "end": 1270164,
      "speaker": "Moritz Stefaner",
      "start": 1268380,
      "text": "It sounds like a funny idea.",
      "id": "ep_45_ut_105"
    },
    {
      "end": 1275396,
      "speaker": "Enrico Bertini",
      "start": 1270292,
      "text": "Is the future more on integrating everything on one device or. Yeah, maybe.",
      "id": "ep_45_ut_106"
    },
    {
      "end": 1281200,
      "speaker": "Moritz Stefaner",
      "start": 1275468,
      "text": "Or like, super distribute everything or super thing. Everything gets synced with everything. And there you go.",
      "id": "ep_45_ut_107"
    },
    {
      "end": 1284200,
      "speaker": "Nicholas Felton",
      "start": 1282500,
      "text": "Versus DNS. Right?",
      "id": "ep_45_ut_108"
    },
    {
      "end": 1286040,
      "speaker": "Moritz Stefaner",
      "start": 1284940,
      "text": "Injections.",
      "id": "ep_45_ut_109"
    },
    {
      "end": 1287120,
      "speaker": "Nicholas Felton",
      "start": 1286340,
      "text": "Yeah.",
      "id": "ep_45_ut_110"
    },
    {
      "end": 1297210,
      "speaker": "Enrico Bertini",
      "start": 1288150,
      "text": "So how much stuff you collect about. Are you also collecting bio things? Biosensors. Do you have anything like that?",
      "id": "ep_45_ut_111"
    },
    {
      "end": 1316330,
      "speaker": "Nicholas Felton",
      "start": 1298230,
      "text": "This watch keeps heartbeat. Let's see how nervous I am right now. I'm at about 60, so I'm okay. And it also has galvanic skin response, so how sweaty you are, and skin temperature, so it's a pretty good lie detector.",
      "id": "ep_45_ut_112"
    },
    {
      "end": 1317794,
      "speaker": "Enrico Bertini",
      "start": 1316730,
      "text": "How is it called again?",
      "id": "ep_45_ut_113"
    },
    {
      "end": 1318818,
      "speaker": "Nicholas Felton",
      "start": 1317882,
      "text": "This one's called basis.",
      "id": "ep_45_ut_114"
    },
    {
      "end": 1319490,
      "speaker": "Enrico Bertini",
      "start": 1318874,
      "text": "Oh, basis.",
      "id": "ep_45_ut_115"
    },
    {
      "end": 1338938,
      "speaker": "Nicholas Felton",
      "start": 1319570,
      "text": "There's a second gen out, but I think most of the watches that do fitness tracking are now, like, Fitbit has ones that also do the heart rate stuff. It's pretty common. I just don't know that anybody's doing anything that interesting with heart rate. It's kind of a like. Because you can. You do.",
      "id": "ep_45_ut_116"
    },
    {
      "end": 1342270,
      "speaker": "Enrico Bertini",
      "start": 1338994,
      "text": "But the only thing that comes.",
      "id": "ep_45_ut_117"
    },
    {
      "end": 1355900,
      "speaker": "Nicholas Felton",
      "start": 1343200,
      "text": "Yeah, but sometimes it'll say my heartbeat's, like, really high, and then it all. You know how with music you can be like, is this 120 bpm or 60 bpm? And I think it gets. Yeah, I think it gets confused sometimes and it, like, flops down.",
      "id": "ep_45_ut_118"
    },
    {
      "end": 1365256,
      "speaker": "Enrico Bertini",
      "start": 1357880,
      "text": "I think there was this project from Jen Lowe. She was sharing her heartbeat. Her heartbeat for a while. Is it still active? I don't even.",
      "id": "ep_45_ut_119"
    },
    {
      "end": 1367740,
      "speaker": "Moritz Stefaner",
      "start": 1365368,
      "text": "It could be. We should look it up. Yeah, yeah.",
      "id": "ep_45_ut_120"
    },
    {
      "end": 1391230,
      "speaker": "Enrico Bertini",
      "start": 1368770,
      "text": "And another thing I wanted to ask you. Have you ever tried one of these devices to track? I think there are some sort of bands that you can put on your heads right now, and they tell you how much focus you are or stuff like that. I think that's really interesting. I'm always struggling with focus, so that would be something that would be really much interesting because it's so hard to gain focus today.",
      "id": "ep_45_ut_121"
    },
    {
      "end": 1394710,
      "speaker": "Moritz Stefaner",
      "start": 1392010,
      "text": "I think we might have punished.",
      "id": "ep_45_ut_122"
    },
    {
      "end": 1400750,
      "speaker": "Nicholas Felton",
      "start": 1396730,
      "text": "But I think there's a proxy for that on the computer, which is rest, rescue time, so.",
      "id": "ep_45_ut_123"
    },
    {
      "end": 1401670,
      "speaker": "Enrico Bertini",
      "start": 1400830,
      "text": "Oh, yeah, sure.",
      "id": "ep_45_ut_124"
    },
    {
      "end": 1405262,
      "speaker": "Nicholas Felton",
      "start": 1401750,
      "text": "That keeps track of, certainly how distracted you are, right?",
      "id": "ep_45_ut_125"
    },
    {
      "end": 1405662,
      "speaker": "Enrico Bertini",
      "start": 1405326,
      "text": "Yeah.",
      "id": "ep_45_ut_126"
    },
    {
      "end": 1417730,
      "speaker": "Nicholas Felton",
      "start": 1405726,
      "text": "By keeping track of the apps that you use and the websites you visit. And so I think that that score, for me, certainly it pulls pretty close to my focus or my stress level.",
      "id": "ep_45_ut_127"
    },
    {
      "end": 1420094,
      "speaker": "Enrico Bertini",
      "start": 1418390,
      "text": "Yeah, yeah, yeah.",
      "id": "ep_45_ut_128"
    },
    {
      "end": 1439438,
      "speaker": "Moritz Stefaner",
      "start": 1420182,
      "text": "How do you integrate these reflections into your daily life? Like, are you only reviewing the year after it's done and then you go deep? Or is it like. I mean, you could also sit down every evening or sit down every weekend? No, I'm just thinking, like, if it's, like, worthwhile to, you know, look back on your data and, like, what's your hardest?",
      "id": "ep_45_ut_129"
    },
    {
      "end": 1440918,
      "speaker": "Nicholas Felton",
      "start": 1439454,
      "text": "I think it's ultimately too much.",
      "id": "ep_45_ut_130"
    },
    {
      "end": 1441382,
      "speaker": "Moritz Stefaner",
      "start": 1441014,
      "text": "Yeah.",
      "id": "ep_45_ut_131"
    },
    {
      "end": 1470162,
      "speaker": "Nicholas Felton",
      "start": 1441446,
      "text": "And for what. What I'm interested in, which is not behavior change, but is capturing a story and natural behavior. Like, I'm trying to, you know, be the wilderness photographer who's like, here is Nicholas Felton in his natural state. So I want them to intrude as little as possible on me, and then at the end of the year, I can look at it and try and see if there's, you know, I'm just as interested in. This is a cool correlation as this is a funny story, or, you know.",
      "id": "ep_45_ut_132"
    },
    {
      "end": 1477786,
      "speaker": "Moritz Stefaner",
      "start": 1470266,
      "text": "But you more like, the tracking is project one, and, like, analysis and presentation, project number two. And it comes afterwards.",
      "id": "ep_45_ut_133"
    },
    {
      "end": 1483910,
      "speaker": "Nicholas Felton",
      "start": 1477858,
      "text": "January 1. I take the day off. January 2. Yeah. I dig into all that data. Yeah, yeah, yeah.",
      "id": "ep_45_ut_134"
    },
    {
      "end": 1489954,
      "speaker": "Moritz Stefaner",
      "start": 1484370,
      "text": "Wow. And so now. Oh, actually, I just realized, in two weeks, basically, you will have done your last measurement.",
      "id": "ep_45_ut_135"
    },
    {
      "end": 1491060,
      "speaker": "Nicholas Felton",
      "start": 1490002,
      "text": "Right? Yes.",
      "id": "ep_45_ut_136"
    },
    {
      "end": 1492448,
      "speaker": "Moritz Stefaner",
      "start": 1491760,
      "text": "That's a big.",
      "id": "ep_45_ut_137"
    },
    {
      "end": 1493544,
      "speaker": "Nicholas Felton",
      "start": 1492504,
      "text": "Yeah, I know.",
      "id": "ep_45_ut_138"
    },
    {
      "end": 1497100,
      "speaker": "Moritz Stefaner",
      "start": 1493672,
      "text": "Yeah. Wow. Because the last report, 10th edition.",
      "id": "ep_45_ut_139"
    },
    {
      "end": 1499648,
      "speaker": "Nicholas Felton",
      "start": 1497520,
      "text": "This is it, 2014. 10th edition.",
      "id": "ep_45_ut_140"
    },
    {
      "end": 1499928,
      "speaker": "Moritz Stefaner",
      "start": 1499744,
      "text": "Yeah.",
      "id": "ep_45_ut_141"
    },
    {
      "end": 1501320,
      "speaker": "Enrico Bertini",
      "start": 1499944,
      "text": "That's gonna be the last one. Right?",
      "id": "ep_45_ut_142"
    },
    {
      "end": 1517220,
      "speaker": "Nicholas Felton",
      "start": 1501400,
      "text": "Yeah. I'm. I'm gonna retire making these books and. And then hopefully reproduce them in a nice, sort of, like, coffee table book and put some process in there, do some meta analysis. I don't know. Yeah.",
      "id": "ep_45_ut_143"
    },
    {
      "end": 1522894,
      "speaker": "Moritz Stefaner",
      "start": 1518030,
      "text": "And then in ten years, you can do, like, a, you know, come back for another report or.",
      "id": "ep_45_ut_144"
    },
    {
      "end": 1525170,
      "speaker": "Nicholas Felton",
      "start": 1522942,
      "text": "Yeah, you're broke or something, kid.",
      "id": "ep_45_ut_145"
    },
    {
      "end": 1529050,
      "speaker": "Moritz Stefaner",
      "start": 1527910,
      "text": "Perfect, man.",
      "id": "ep_45_ut_146"
    },
    {
      "end": 1531410,
      "speaker": "Enrico Bertini",
      "start": 1529390,
      "text": "Perfect for tracking because.",
      "id": "ep_45_ut_147"
    },
    {
      "end": 1535382,
      "speaker": "Moritz Stefaner",
      "start": 1533630,
      "text": "They hang still and no problem.",
      "id": "ep_45_ut_148"
    },
    {
      "end": 1538102,
      "speaker": "Nicholas Felton",
      "start": 1535486,
      "text": "Exactly. I know where they're the only other.",
      "id": "ep_45_ut_149"
    },
    {
      "end": 1544590,
      "speaker": "Enrico Bertini",
      "start": 1538286,
      "text": "Other human being that you can track without asking, without problems. You can just embed stuff on.",
      "id": "ep_45_ut_150"
    },
    {
      "end": 1550038,
      "speaker": "Moritz Stefaner",
      "start": 1544710,
      "text": "There is actually, like, in the whole quantified self community, of course. There's also. Especially for toddlers or babies.",
      "id": "ep_45_ut_151"
    },
    {
      "end": 1550350,
      "speaker": "Nicholas Felton",
      "start": 1550094,
      "text": "Yeah.",
      "id": "ep_45_ut_152"
    },
    {
      "end": 1555126,
      "speaker": "Moritz Stefaner",
      "start": 1550390,
      "text": "There's a lot of tracking going on. There's dedicated apps and sensors or whatever.",
      "id": "ep_45_ut_153"
    },
    {
      "end": 1559470,
      "speaker": "Nicholas Felton",
      "start": 1555238,
      "text": "Yeah. And I think I've heard stories during pregnancy already. Really?",
      "id": "ep_45_ut_154"
    },
    {
      "end": 1560694,
      "speaker": "Enrico Bertini",
      "start": 1559510,
      "text": "Oh, yeah, sure. Absolutely.",
      "id": "ep_45_ut_155"
    },
    {
      "end": 1561450,
      "speaker": "Moritz Stefaner",
      "start": 1560742,
      "text": "Of course.",
      "id": "ep_45_ut_156"
    },
    {
      "end": 1577512,
      "speaker": "Nicholas Felton",
      "start": 1564590,
      "text": "I've heard that some parents will sort of exchange access to children's location data for a cell phone. Oh, so, like, that's. That's the bargain. You get a cell phone, but, you know, you need to be broadcasting your location to me.",
      "id": "ep_45_ut_157"
    },
    {
      "end": 1579540,
      "speaker": "Moritz Stefaner",
      "start": 1577576,
      "text": "So. And then we both benefit.",
      "id": "ep_45_ut_158"
    },
    {
      "end": 1583040,
      "speaker": "Enrico Bertini",
      "start": 1581400,
      "text": "Or everyone is super anxious.",
      "id": "ep_45_ut_159"
    },
    {
      "end": 1583696,
      "speaker": "Moritz Stefaner",
      "start": 1583160,
      "text": "Yeah.",
      "id": "ep_45_ut_160"
    },
    {
      "end": 1584144,
      "speaker": "Nicholas Felton",
      "start": 1583808,
      "text": "Yeah.",
      "id": "ep_45_ut_161"
    },
    {
      "end": 1584496,
      "speaker": "Enrico Bertini",
      "start": 1584192,
      "text": "Right.",
      "id": "ep_45_ut_162"
    },
    {
      "end": 1602060,
      "speaker": "Moritz Stefaner",
      "start": 1584568,
      "text": "Yeah, that's true. Yeah. And people thought too, like, can you take my phone somewhere else? Because I want to meet this, you know? Yeah, that's exactly one of these borders again. Like, is it okay if parents survey their kids with a cell phone? Right? To some degree, probably, yeah, yeah, yeah, yeah.",
      "id": "ep_45_ut_163"
    },
    {
      "end": 1603136,
      "speaker": "Enrico Bertini",
      "start": 1602400,
      "text": "I don't know.",
      "id": "ep_45_ut_164"
    },
    {
      "end": 1603840,
      "speaker": "Moritz Stefaner",
      "start": 1603208,
      "text": "Interesting.",
      "id": "ep_45_ut_165"
    },
    {
      "end": 1605552,
      "speaker": "Nicholas Felton",
      "start": 1603920,
      "text": "I think it's kind of taken for granted, right?",
      "id": "ep_45_ut_166"
    },
    {
      "end": 1606120,
      "speaker": "Enrico Bertini",
      "start": 1605616,
      "text": "Yeah.",
      "id": "ep_45_ut_167"
    },
    {
      "end": 1616260,
      "speaker": "Nicholas Felton",
      "start": 1606240,
      "text": "I mean, that's what it's like. That's why it's a big brother state. It's not like a mother or father state. Right. Because there, it's just expected they're gonna be snooping on you.",
      "id": "ep_45_ut_168"
    },
    {
      "end": 1624428,
      "speaker": "Moritz Stefaner",
      "start": 1617760,
      "text": "But if they like. Yeah. If they have the tools to really do full digital surveillance, it's quite intrusive. Right?",
      "id": "ep_45_ut_169"
    },
    {
      "end": 1625800,
      "speaker": "Nicholas Felton",
      "start": 1624584,
      "text": "Yeah, yeah.",
      "id": "ep_45_ut_170"
    },
    {
      "end": 1667874,
      "speaker": "Moritz Stefaner",
      "start": 1627340,
      "text": "So let's take a short break to talk about our sponsor. As you know, Datastories is supported by Tableau software, helping people see and understand their data. Tableau lets people connect to any kind of data and visualize it on the fly. Databases, spreadsheets, and even big data sources are easily combined into interactive visualizations, reports, and dashboards. What is your data trying to tell you? For your free trial, visit Tableau software at table software.com Datastories. And now back to the interview. And will you maintain your apps as well? Is that something you want to continue or now you have reporter?",
      "id": "ep_45_ut_171"
    },
    {
      "end": 1696428,
      "speaker": "Nicholas Felton",
      "start": 1667962,
      "text": "Yeah, definitely. Datum is kind of limping along. We're hoping to rejuvenate it next year at some point. I would like to give it an API, and I think that would make it pretty useful. Reporter is cranking along. We've been working on a roadmap for next couple iterations of that. And, yeah, there's one other thing I'm working on that will hopefully see the light of day. Maybe in the spring. Yeah, very nice.",
      "id": "ep_45_ut_172"
    },
    {
      "end": 1697412,
      "speaker": "Moritz Stefaner",
      "start": 1696484,
      "text": "Very nice. Yeah.",
      "id": "ep_45_ut_173"
    },
    {
      "end": 1699212,
      "speaker": "Enrico Bertini",
      "start": 1697516,
      "text": "Still connected to tracking.",
      "id": "ep_45_ut_174"
    },
    {
      "end": 1703320,
      "speaker": "Nicholas Felton",
      "start": 1699356,
      "text": "Yeah, yeah, you'll see it and you'll go, that makes sense. Yeah.",
      "id": "ep_45_ut_175"
    },
    {
      "end": 1711650,
      "speaker": "Enrico Bertini",
      "start": 1706790,
      "text": "So another thing I wanted to ask you is more about how do you actually create the books?",
      "id": "ep_45_ut_176"
    },
    {
      "end": 1716846,
      "speaker": "Nicholas Felton",
      "start": 1712110,
      "text": "Oh, yeah. I mean, there's a lot of hair pulling.",
      "id": "ep_45_ut_177"
    },
    {
      "end": 1722318,
      "speaker": "Enrico Bertini",
      "start": 1716998,
      "text": "First of all, how did you come up with the idea of creating a book rather than just publishing this thing on the web?",
      "id": "ep_45_ut_178"
    },
    {
      "end": 1784038,
      "speaker": "Nicholas Felton",
      "start": 1722454,
      "text": "Right. So I put the first one. The 2005 annual report was just a bunch of jpegs online. And so I heard this feedback that people liked it and even some people were saying, I want to do this myself. And because I don't think you get that many great ideas in your career, I decided I wanted this one to be attached to me. Yeah. So I thought that's, it's fine if other people want to do that. That supports my thinking that this is interesting, but I'm gonna one up them and I'm gonna make a printed one. And so that was 2006. I started to print it, and, you know, they started off pretty, pretty naive. They were all just spreadsheet based, and all the maps were initially made by hand. The scaling and positioning of the dots, I was even, I think, in 2007, I even traced the entire street map of Manhattan because I had this vision of. I just wanted, like, thin vector lines for the entire street map. So I just got Google maps. Yeah, I just traced the whole thing.",
      "id": "ep_45_ut_179"
    },
    {
      "end": 1786050,
      "speaker": "Moritz Stefaner",
      "start": 1784144,
      "text": "But that was before OpenStreetMap, probably.",
      "id": "ep_45_ut_180"
    },
    {
      "end": 1815632,
      "speaker": "Nicholas Felton",
      "start": 1786090,
      "text": "Yeah, I think OpenStreetMap might have existed, but I wasn't aware of it. Or maybe it wasn't even that complete. It could be, yeah, yeah, yeah, and, yeah. 2008, I definitely took advantage of OpenStreetMap and getting PDF's from there. And then I think for a couple of years back then, people had been saying, oh, if you learn processing, oh, boy, you should learn processing. I was like, I'm not a coder. People can do really cool stuff, but it's just not for me.",
      "id": "ep_45_ut_181"
    },
    {
      "end": 1817996,
      "speaker": "Enrico Bertini",
      "start": 1815826,
      "text": "So your background is what is.",
      "id": "ep_45_ut_182"
    },
    {
      "end": 1818860,
      "speaker": "Nicholas Felton",
      "start": 1818028,
      "text": "It's in graphic design.",
      "id": "ep_45_ut_183"
    },
    {
      "end": 1819532,
      "speaker": "Enrico Bertini",
      "start": 1818940,
      "text": "Graphic design.",
      "id": "ep_45_ut_184"
    },
    {
      "end": 1821812,
      "speaker": "Nicholas Felton",
      "start": 1819596,
      "text": "Okay. Print and a little bit of web.",
      "id": "ep_45_ut_185"
    },
    {
      "end": 1823892,
      "speaker": "Enrico Bertini",
      "start": 1821996,
      "text": "You were not able to program yet?",
      "id": "ep_45_ut_186"
    },
    {
      "end": 1824720,
      "speaker": "Nicholas Felton",
      "start": 1824036,
      "text": "No.",
      "id": "ep_45_ut_187"
    },
    {
      "end": 1825988,
      "speaker": "Enrico Bertini",
      "start": 1825060,
      "text": "That's really interesting.",
      "id": "ep_45_ut_188"
    },
    {
      "end": 1893388,
      "speaker": "Nicholas Felton",
      "start": 1826044,
      "text": "Till 2009. That's the first year that has some processing projects in it. And I guess I decided, I don't know what the impetus was, but I found a person in New York who taught processing at SVA, and I wanted him to organize a public class so that I could learn. And he offered, I think I, like, tweeted about it and got some interest, and I think we had, like, six or seven people showed up. And he did a first class for free where he introduced us to the live drawing stuff and the random function. And I thought it was great, but no one wanted to take the class after that except for me. But he was, he was really kind and let me just, like, keep following up with him on the weekends and asking him questions. And between him and the Dan Schiffman book. Oh, yeah, yeah. The orange processing book, that really just got me going. And, you know, some of it is just understanding how the system works. And then there's other little, like, boilerplate bits.",
      "id": "ep_45_ut_189"
    },
    {
      "end": 1894548,
      "speaker": "Enrico Bertini",
      "start": 1893444,
      "text": "Oh, yeah, absolutely.",
      "id": "ep_45_ut_190"
    },
    {
      "end": 1914030,
      "speaker": "Nicholas Felton",
      "start": 1894644,
      "text": "Yeah. I think I still rely on this one split function for turning a. A CSV into a 2d array of numbers. And I'm like, I probably still couldn't write that thing, but I just copy and paste it, copy and paste it and reuse it. Yeah. And it's, you know, it's fail proof.",
      "id": "ep_45_ut_191"
    },
    {
      "end": 1943352,
      "speaker": "Enrico Bertini",
      "start": 1914110,
      "text": "Yeah, that's really interesting because quite often we got the question of whether in order to do this, you should be able to code. And I'm glad that you are telling this story because I think me and Moritz were always saying, well, yes, you can do it without coding, but if you code, it's much better. And probably learning how to code in order to do these things is not that hard. You don't have to become a software engineer, right. You have to learn enough to be able to build your visualizations. That is not extremely hard.",
      "id": "ep_45_ut_192"
    },
    {
      "end": 1966474,
      "speaker": "Nicholas Felton",
      "start": 1943416,
      "text": "And I think for certainly, I mean, processing is what I use and it works for me because it outputs to PDF and I need in vectors. And, yeah, there are just a couple of pathways to getting stuff on screen that once you've done it, like making a map, that's easy. And getting your data in and you.",
      "id": "ep_45_ut_193"
    },
    {
      "end": 1968002,
      "speaker": "Enrico Bertini",
      "start": 1966482,
      "text": "Can reuse lots of code. Right?",
      "id": "ep_45_ut_194"
    },
    {
      "end": 1991260,
      "speaker": "Nicholas Felton",
      "start": 1968066,
      "text": "Yeah, I use databases now, so I use the, what's it called? Bayesia SQL library or something for processing. And that allows me to, to use more robust queries there on a little local server. But otherwise it's just, sometimes it's object oriented, sometimes it's just procedural.",
      "id": "ep_45_ut_195"
    },
    {
      "end": 1999664,
      "speaker": "Moritz Stefaner",
      "start": 1993160,
      "text": "That's the nice thing about processing. You can take an isolated snippet and it will just work. You don't need to build all these structures wrong.",
      "id": "ep_45_ut_196"
    },
    {
      "end": 2009328,
      "speaker": "Enrico Bertini",
      "start": 1999832,
      "text": "I think it's important to remove this huge wall that people in front of them and actually send this message. That is not that hard. I mean, you don't have to build a complex.",
      "id": "ep_45_ut_197"
    },
    {
      "end": 2019052,
      "speaker": "Moritz Stefaner",
      "start": 2009384,
      "text": "The work is a great tip, I think, because he's really great at getting people started. The other thing I think everybody should learn about is typography.",
      "id": "ep_45_ut_198"
    },
    {
      "end": 2020372,
      "speaker": "Enrico Bertini",
      "start": 2019116,
      "text": "Typography, it's like the.",
      "id": "ep_45_ut_199"
    },
    {
      "end": 2023800,
      "speaker": "Moritz Stefaner",
      "start": 2020436,
      "text": "Yeah, it's maybe the most complex ignorance.",
      "id": "ep_45_ut_200"
    },
    {
      "end": 2025600,
      "speaker": "Enrico Bertini",
      "start": 2024220,
      "text": "I'm here to learn.",
      "id": "ep_45_ut_201"
    },
    {
      "end": 2030916,
      "speaker": "Moritz Stefaner",
      "start": 2025940,
      "text": "I never heard anybody like traditional data visualization actually talk about typography.",
      "id": "ep_45_ut_202"
    },
    {
      "end": 2031372,
      "speaker": "Enrico Bertini",
      "start": 2030948,
      "text": "Oh yeah.",
      "id": "ep_45_ut_203"
    },
    {
      "end": 2038852,
      "speaker": "Moritz Stefaner",
      "start": 2031436,
      "text": "And it's so important. Like, you know, little differences in typography can make such a difference in. Oh yeah, like how well something works.",
      "id": "ep_45_ut_204"
    },
    {
      "end": 2072640,
      "speaker": "Nicholas Felton",
      "start": 2038916,
      "text": "You know, when people started paying me to do graphs for their magazines, I thought that the only real added value I brought was maybe some interesting colors, but nice typography, like stuff that they couldn't do in excel and that that was what I was getting paid for. And so when I have taught Dataviz, there's always, you know, we've always got to spend at least an hour or two just on like typographic conventions, like know your em dashes and don't use hyphens here and typographic selection. But it makes such a difference.",
      "id": "ep_45_ut_205"
    },
    {
      "end": 2086120,
      "speaker": "Moritz Stefaner",
      "start": 2073700,
      "text": "Also how to establish hierarchies of importance. It's all very fundamental to book design or magazine style designs, and that's also super important to information design systems.",
      "id": "ep_45_ut_206"
    },
    {
      "end": 2103522,
      "speaker": "Nicholas Felton",
      "start": 2087180,
      "text": "I think also authorship, like being able, being in a position where you can change the wordsmithing of things to work better or to fit better, is also really. Yeah, the whole massage, the massaging activities.",
      "id": "ep_45_ut_207"
    },
    {
      "end": 2107018,
      "speaker": "Moritz Stefaner",
      "start": 2103626,
      "text": "Right? Yeah, like putting it into shape and it's really. Right.",
      "id": "ep_45_ut_208"
    },
    {
      "end": 2130058,
      "speaker": "Nicholas Felton",
      "start": 2107114,
      "text": "And it's, it's kind of the difference too between building, you know, building a system where it has to be bulletproof. And you're like, I need a solution here for when I have a 100 character label and it's going to truncate or get smaller versus, you know what this is, this is the only instance of this visualization that's going to exist, and I'm just going to type in a shorter name here and it will be fine. Or use an acronym.",
      "id": "ep_45_ut_209"
    },
    {
      "end": 2140482,
      "speaker": "Moritz Stefaner",
      "start": 2130114,
      "text": "Right, that's true. Like this. Yeah. Solving one design instance really well, that's also something like you do in typography.",
      "id": "ep_45_ut_210"
    },
    {
      "end": 2180768,
      "speaker": "Nicholas Felton",
      "start": 2140586,
      "text": "You set one page, and I think also in the typography hierarchy thing, I've always thought of the Dataviz as, you know, it's coming kind of out of like a logo design tradition where in a logo you're working on all the contrasts that people see and trying to move their eye around. Right. And so if the contrast is wrong in one place, people's eyes get stuck. And so if you can have the most beautiful visualization, then you go to label it and you put on some clunking type and all of a sudden the entire texture of the page is ruined. Then you can't see. You can't see what you want to draw people's eyes to anymore. Right, right.",
      "id": "ep_45_ut_211"
    },
    {
      "end": 2199856,
      "speaker": "Moritz Stefaner",
      "start": 2180904,
      "text": "Yeah, let's say, I mean, it's always difficult how to, you know, tell people how to start from scratch, but are there any resources where you say like this is a great like, primer on how to get started on, on typography, or how would you, let's say somebody's interested but not capable yet, like how can they improve?",
      "id": "ep_45_ut_212"
    },
    {
      "end": 2201460,
      "speaker": "Enrico Bertini",
      "start": 2200048,
      "text": "I am one of those.",
      "id": "ep_45_ut_213"
    },
    {
      "end": 2258620,
      "speaker": "Nicholas Felton",
      "start": 2202000,
      "text": "There's some really good books, I think, about facet. I don't know if it's in print anymore, but that's a. It's a really nice overview of typography. But, um, yeah, I don't, I don't know if there's just like a thin little book that would do that introduction. And so much of it is about typographic texture. Like you can really get into the weeds in typography very quickly. Like people don't need to know, like what, you know, the aperture of a g is called, right. Or need to know the differences between different families of typefaces. But thinking about, you know, I'm gonna set this label and sort of spaced out all caps because that's gonna be easier on the eye than something that's like a tightly fitted upper and lowercase label that is gonna have more jagginess and is gonna be like a little bit more like over here. Look at me, guys. And that stuff I haven't really seen discussed that much.",
      "id": "ep_45_ut_214"
    },
    {
      "end": 2269382,
      "speaker": "Moritz Stefaner",
      "start": 2259240,
      "text": "And a lot of it is common sense. Once you start looking for it, you know, it's like one of these things, like once you're aware of all the differences that exist, you see them everywhere.",
      "id": "ep_45_ut_215"
    },
    {
      "end": 2335446,
      "speaker": "Nicholas Felton",
      "start": 2269446,
      "text": "Yeah. And so much of it is just my pickiness about things, you know, I'm always gonna be looking at, you know, how are the numbers handled in this typeface? And I remember I've fallen in love with the way that certain numbers were rendered in one typeface, but the percent sign was terrible, so I redrew the percent sign and just flopped it in everywhere. Or this year I used, I think you've latched onto this typeface as well. Info by font bureau, which is gorgeous. Yeah, but I had a bunch of titles at the top of the page and the kerning on the proportional version of the typeface, it gets kind of iffy at larger sizes. And so I had to copy out all the titles into one document and then like manually space them all out. Yeah. Card everything and then print it and mark it up, space it again, print it. And just to get it right, because I knew that it, if it came back from the printer and there was one like, you know, v hanging out too far, drive me nuts, but I think so.",
      "id": "ep_45_ut_216"
    },
    {
      "end": 2353586,
      "speaker": "Enrico Bertini",
      "start": 2335478,
      "text": "My impression is that in visualization there is a tradition by which there is not a lot of discussion how to use labels or text properly. There is a lot of emphasis on how to encode information through graphical marks, colors and all the rest. But I've never seen, even in the best books out there.",
      "id": "ep_45_ut_217"
    },
    {
      "end": 2354090,
      "speaker": "Moritz Stefaner",
      "start": 2353678,
      "text": "Yeah.",
      "id": "ep_45_ut_218"
    },
    {
      "end": 2381724,
      "speaker": "Enrico Bertini",
      "start": 2354170,
      "text": "There is not a proper discussion of text. Right. How do you actually label this data? How do you use text? And it's crucial. Yeah, it's literally crucial, right. So you get a simple scatter plot and you add a few labels. It makes a huge difference, right. And it's not easy, sometimes it's not easy to choose how to label, what to label when you have too much data on the screen, you have to use some strategy and then of course the typeface and all the rest.",
      "id": "ep_45_ut_219"
    },
    {
      "end": 2442356,
      "speaker": "Nicholas Felton",
      "start": 2381772,
      "text": "So it's really, I have a really aggravating exercise that I'll do sometimes in workshops where I'll give students a us map, I'll say label this. And, you know, you can, I think that the habit is to like start on the west coast, like, oh, California and Texas. I can, I can use some beautiful typography here. And I'm like, you need, need to start in New England and you need to come up with a system, right? So like everything is hanging off to the left with a line, but that's not enough. And so you're gonna have to keep like adding little iterations to your system. But we don't want to wind up with just, you know, a custom solution. Like this is a 22 degree line and this is a 14 degree line. And so thinking about this systematically and like building up at the, at the problem spots to a coherent system, they could actually be codified and like turned into something systematic.",
      "id": "ep_45_ut_220"
    },
    {
      "end": 2460420,
      "speaker": "Moritz Stefaner",
      "start": 2442548,
      "text": "And the basic tension is always, it's always great to label something in place. Like if you have a line chart, instead of having a legend on the right hand side that is far away, you want to have the label at the highest point of the line, at the peak, you know, so because this is where people look. And right next to that, you want to see, ah, that's the, I don't know what.",
      "id": "ep_45_ut_221"
    },
    {
      "end": 2463412,
      "speaker": "Enrico Bertini",
      "start": 2460500,
      "text": "And of course, labeling is connected to annotation as well.",
      "id": "ep_45_ut_222"
    },
    {
      "end": 2465548,
      "speaker": "Moritz Stefaner",
      "start": 2463476,
      "text": "Totally. It makes such a big difference.",
      "id": "ep_45_ut_223"
    },
    {
      "end": 2467356,
      "speaker": "Enrico Bertini",
      "start": 2465644,
      "text": "It's a whole layer that is not.",
      "id": "ep_45_ut_224"
    },
    {
      "end": 2486148,
      "speaker": "Moritz Stefaner",
      "start": 2467388,
      "text": "Very much discussed and it's very hard. Like the strategy I just described, you could even implement that. But what if you have two lines that are close together and then you need a human to say like, yeah, let's put this one on the right hand side and this one on the left hand side, because for good reason, and I haven't seen any really, really good implementations of these strategies, I think.",
      "id": "ep_45_ut_225"
    },
    {
      "end": 2489298,
      "speaker": "Nicholas Felton",
      "start": 2486164,
      "text": "Probably map making is where you would find the best discussion of that.",
      "id": "ep_45_ut_226"
    },
    {
      "end": 2495814,
      "speaker": "Moritz Stefaner",
      "start": 2489444,
      "text": "Yeah, so there's all these old Imhoff papers, like a swiss cartographer and he, he describes these strategies.",
      "id": "ep_45_ut_227"
    },
    {
      "end": 2498050,
      "speaker": "Enrico Bertini",
      "start": 2495862,
      "text": "So they are like, who does that?",
      "id": "ep_45_ut_228"
    },
    {
      "end": 2519554,
      "speaker": "Moritz Stefaner",
      "start": 2498870,
      "text": "He's a swiss cartographer and he has like papers on how to position labels on maps. Like, how do you, how do you label a river? Like, in which situations? And what if it makes a bend that is so tight that you would smear your letters into each other? And there is like, rules, there's a fallback strategies and like, second best solutions, third best solutions, because they can't use lines.",
      "id": "ep_45_ut_229"
    },
    {
      "end": 2521722,
      "speaker": "Nicholas Felton",
      "start": 2519682,
      "text": "Their entire vocabulary of lines is already taken.",
      "id": "ep_45_ut_230"
    },
    {
      "end": 2539410,
      "speaker": "Moritz Stefaner",
      "start": 2521826,
      "text": "Exactly. Space is defined. You have to sort of work on top of that. So. Yeah, but there's little, I think, implementations of these strategies. I know Mike Magursky had like once something where he would place all the labels and then fix the problems by shuffling them around and, you know, having.",
      "id": "ep_45_ut_231"
    },
    {
      "end": 2543560,
      "speaker": "Enrico Bertini",
      "start": 2539450,
      "text": "These few algorithms out there. I think it's under researched.",
      "id": "ep_45_ut_232"
    },
    {
      "end": 2545420,
      "speaker": "Moritz Stefaner",
      "start": 2543640,
      "text": "Yeah, it's a really interesting problem.",
      "id": "ep_45_ut_233"
    },
    {
      "end": 2548300,
      "speaker": "Enrico Bertini",
      "start": 2546960,
      "text": "It is, it is.",
      "id": "ep_45_ut_234"
    },
    {
      "end": 2557800,
      "speaker": "Moritz Stefaner",
      "start": 2549520,
      "text": "But good typography alone, like, without even like being super smart, but just being smart about font choices and, like, font sizes and, you know, that alone and.",
      "id": "ep_45_ut_235"
    },
    {
      "end": 2563896,
      "speaker": "Enrico Bertini",
      "start": 2557840,
      "text": "Being aware of the fact that this layer must be curated, it's not something optional, I guess.",
      "id": "ep_45_ut_236"
    },
    {
      "end": 2564600,
      "speaker": "Moritz Stefaner",
      "start": 2563968,
      "text": "Yeah, yeah.",
      "id": "ep_45_ut_237"
    },
    {
      "end": 2568660,
      "speaker": "Enrico Bertini",
      "start": 2564640,
      "text": "I mean, labeling is the thing that gives meaning to the things that you see on the screen.",
      "id": "ep_45_ut_238"
    },
    {
      "end": 2570908,
      "speaker": "Nicholas Felton",
      "start": 2569260,
      "text": "And it has a voice as well.",
      "id": "ep_45_ut_239"
    },
    {
      "end": 2571740,
      "speaker": "Enrico Bertini",
      "start": 2571044,
      "text": "Oh, yeah, sure.",
      "id": "ep_45_ut_240"
    },
    {
      "end": 2576004,
      "speaker": "Nicholas Felton",
      "start": 2571780,
      "text": "Has a trustworthiness. It has associations that people are aware of.",
      "id": "ep_45_ut_241"
    },
    {
      "end": 2591332,
      "speaker": "Moritz Stefaner",
      "start": 2576132,
      "text": "Yeah. Do you care about completeness more or more about, like, highlighting, highlight decision you make at this point often? Like, yeah. Is everything equally important or is it okay to just point to five of these things and say the rest is just the rest?",
      "id": "ep_45_ut_242"
    },
    {
      "end": 2592164,
      "speaker": "Nicholas Felton",
      "start": 2591516,
      "text": "Yeah.",
      "id": "ep_45_ut_243"
    },
    {
      "end": 2594268,
      "speaker": "Moritz Stefaner",
      "start": 2592292,
      "text": "These are the editorial decisions that happened.",
      "id": "ep_45_ut_244"
    },
    {
      "end": 2594980,
      "speaker": "Nicholas Felton",
      "start": 2594354,
      "text": "Yeah.",
      "id": "ep_45_ut_245"
    },
    {
      "end": 2606152,
      "speaker": "Enrico Bertini",
      "start": 2597480,
      "text": "Yeah. You can even imagine visualizations where there is a progression, where the visualization itself doesn't change, but the progression includes new labels.",
      "id": "ep_45_ut_246"
    },
    {
      "end": 2606820,
      "speaker": "Nicholas Felton",
      "start": 2606216,
      "text": "Right.",
      "id": "ep_45_ut_247"
    },
    {
      "end": 2629964,
      "speaker": "Enrico Bertini",
      "start": 2607360,
      "text": "A series of things that are interesting and you should. Yeah. Another thing I wanted to ask you is more, is there anyone out there who is doing anything similar to what you do that you like? Or maybe the answer could be no. I mean, in these old quantities. Mortified self phenomenon or something else. I don't know.",
      "id": "ep_45_ut_248"
    },
    {
      "end": 2724130,
      "speaker": "Nicholas Felton",
      "start": 2630052,
      "text": "Yeah, I mean, I think some of the people who've done things that I like tend to be artists or in that realm exclusively. So, yeah. People I've pointed to previously, like Sophie Kyle. I think a lot of the, like, rule driven work that she's done has certainly been something that inspired me. Like, she had a set of all the items that she received for her birthday in a bunch of vitrines and that was one exhibit that she produced. And I think there's. There's also kind of like a. Like a pseudo scientific aspect to a lot of that. That art that I like, or even obsessiveness. There's one. I think it's Jim Dyne. He did a piece at the Tate modern where they sent a bunch of people out into the bank of the Thames, and they just collected. No, it's Mark. It's a mark dione. They collected all the different bits that they found in the bank, and it spans the entire course of history. So it's like, it might be like, pottery shards from, like, the 12th century and a horse's tooth from, like, the 18 hundreds and a cell phone battery from last year, but they're all collected, and, like, a taxonomy is made, and they're kind of, like, grouped by. By shape or by color, and put in this cabinet of curiosities. And I love that. Just, like, meticulous approach to the world and try and pull stuff out, and there doesn't have to be an optimization or something that comes out of it, or like a research finding that horses teeth tend to be found next to cell phone batteries.",
      "id": "ep_45_ut_249"
    },
    {
      "end": 2756768,
      "speaker": "Moritz Stefaner",
      "start": 2726510,
      "text": "And that's also the other really interesting aspect. Like, data. It means, like, data means given, right? So it's something. And that's often assumed that it's given to us from high above. Data was given to us. And I think in your work, you can also see how much the data collection process is like a creative act or like an act in the world, and, you know, it has consequences. And. And also, there's a lot of decisions to be made. Like, what do I even track? And what does that even mean?",
      "id": "ep_45_ut_250"
    },
    {
      "end": 2757016,
      "speaker": "Nicholas Felton",
      "start": 2756824,
      "text": "Right?",
      "id": "ep_45_ut_251"
    },
    {
      "end": 2763584,
      "speaker": "Moritz Stefaner",
      "start": 2757048,
      "text": "And if you just say, yeah, that's a given. Like, the numbers are there. You abstract away from that whole process, and tracking is.",
      "id": "ep_45_ut_252"
    },
    {
      "end": 2764778,
      "speaker": "Nicholas Felton",
      "start": 2763632,
      "text": "It's work. Right?",
      "id": "ep_45_ut_253"
    },
    {
      "end": 2765498,
      "speaker": "Moritz Stefaner",
      "start": 2764834,
      "text": "That's true.",
      "id": "ep_45_ut_254"
    },
    {
      "end": 2766226,
      "speaker": "Nicholas Felton",
      "start": 2765594,
      "text": "Yeah.",
      "id": "ep_45_ut_255"
    },
    {
      "end": 2786018,
      "speaker": "Enrico Bertini",
      "start": 2766378,
      "text": "That's a really good point. And actually, I think the data in the past used to be like that. It used to be scientists who want to collect it, like, decided exactly what was needed to collect in order to study the phenomenon. Right. It's only recently that we got into this point where. Where data is a given. Right?",
      "id": "ep_45_ut_256"
    },
    {
      "end": 2831500,
      "speaker": "Nicholas Felton",
      "start": 2786074,
      "text": "Yeah. But even now, like, deciding, you know, NASA deciding that, like, some API for exoplanets should be available. Of course, it's not free either. It's still a management process. And there are so many dead ends as well. I've looked through the NYC data repositories, and you can see this summer I was interested in finding all the water fountains in New York. City, it was knowable once and someone had scraped it and gave me that data. You know, it's also a massively, like, fluctuating thing. And perhaps the city decided, you know what, it's more trouble than it's worth. We know where they all used to be, and maybe that's enough for us.",
      "id": "ep_45_ut_257"
    },
    {
      "end": 2870540,
      "speaker": "Moritz Stefaner",
      "start": 2834800,
      "text": "Yeah, but you get more sensitive, you know, for these things once you have collected your own data. That's at least my hunch that once you went through that process of, oh, man, I forgot to put on my tracker on Sunday. Now, the data not there, you know, yeah, those are. And it's not a zero, but it's an unknown. And that's really bad for my bar chart that I want to take. How do you deal with missing data? Like, there's. I think that's one of the other big challenges. Like, is something really zero or is it just we don't know, like known knowns and known unknowns, like, have you been, have you encountered that problem? How have you tackled it?",
      "id": "ep_45_ut_258"
    },
    {
      "end": 2960894,
      "speaker": "Nicholas Felton",
      "start": 2871640,
      "text": "So last year I embraced some of that unknownness with the conversations where I just said, you know what? If I can get nine tenths of all interactions tracked, but just the conversations themselves is going to be some low percentage, but it's going to be infinite percentage more than most people have about their conversations. And this year, relying on devices, I mean, I don't think you understand, like, how incomplete they are until you're really striving for completeness. And so, you know, this watch is always running out of batteries or I think at the beginning of the year there was some, you know, screw up with the software and it lost a week of my data. And I thought that was the, I thought that was the end of the world. And, you know, maybe like the stuff that's relying on Bluetooth, it doesn't always connect. And so, yeah, of course that's gonna be missing. A and I think that's just the state of the world. I'm kind of interested in seeing what are the most reliable ones. But there is going to be some, you know, 96% of the year was tracked, or maybe it's 99 or maybe other ones are like 40% of the year was tracked. Like, moves. Whenever I see moves off for 6 hours, like, that pains me as well, or when I know that what it represents is a discrepancy from what really happened. And actually this is kind of like, I think it's in the, like, can.",
      "id": "ep_45_ut_259"
    },
    {
      "end": 2962862,
      "speaker": "Enrico Bertini",
      "start": 2960902,
      "text": "You give us some example? Because that's really interesting.",
      "id": "ep_45_ut_260"
    },
    {
      "end": 2999610,
      "speaker": "Nicholas Felton",
      "start": 2962886,
      "text": "Yeah, well, I think this is in the, like, 90% completeness world, you get into this kind of uncanny valley of, like, the closer it approaches accuracy, the more you demand of it and the more frustrating it is when it is incorrect. So, yeah, sometimes it'll just, like, be a timeline of all my activity for the day, but they'll be with one black bar of like 13 minutes off. I have no understanding of why that happened. And the fact that I had everything but 13 minutes of the day, particularly if I was moving and I can see these disconnected lines, is very hurtful to me.",
      "id": "ep_45_ut_261"
    },
    {
      "end": 3013168,
      "speaker": "Moritz Stefaner",
      "start": 3003390,
      "text": "I wonder, like, how will you approach next year? Do you think you will have a cold turkey and on a weekday you will go back to trekking, or will you track secretly but just publish it?",
      "id": "ep_45_ut_262"
    },
    {
      "end": 3016688,
      "speaker": "Nicholas Felton",
      "start": 3013224,
      "text": "Well, there's always, there's always, like, a little data hangover that happens, right?",
      "id": "ep_45_ut_263"
    },
    {
      "end": 3017312,
      "speaker": "Enrico Bertini",
      "start": 3016864,
      "text": "Yeah.",
      "id": "ep_45_ut_264"
    },
    {
      "end": 3018864,
      "speaker": "Nicholas Felton",
      "start": 3017376,
      "text": "So I'm actually.",
      "id": "ep_45_ut_265"
    },
    {
      "end": 3020032,
      "speaker": "Moritz Stefaner",
      "start": 3018992,
      "text": "The emptiness.",
      "id": "ep_45_ut_266"
    },
    {
      "end": 3034200,
      "speaker": "Nicholas Felton",
      "start": 3020216,
      "text": "Yeah, well, I'm still. I have to, like, detrain myself and train myself for a new one each year. Like, this year, I won't have to train myself for a new one, but I also have to decide, do I want these things on my wrist still? Yeah, and I think I'm trying to.",
      "id": "ep_45_ut_267"
    },
    {
      "end": 3035912,
      "speaker": "Enrico Bertini",
      "start": 3034200,
      "text": "Take a picture of you with all the stuff.",
      "id": "ep_45_ut_268"
    },
    {
      "end": 3083146,
      "speaker": "Nicholas Felton",
      "start": 3036016,
      "text": "Yeah. And my tan line from this one, it's like a salamander skin underneath the watch. So I think the Nike band will come off. I don't really need that, but I like the watch, particularly when I run, so I'm going to keep that. And actually, the Fitbit that I have in my pocket, that's a legacy from 2008, when I was made aware of this data set, like the invisible set of my steps that I thought was interesting. And so at the end of the year, it wasn't really a cost to stop using it. And so I just decided, you know what, keep on. Let's keep going with this one. And I think the cost that I pay for continuous location tracking, which is, you know, ten to 20% of my cell phone battery each day for me, is worth it. Like, I'm not gonna delete that app.",
      "id": "ep_45_ut_269"
    },
    {
      "end": 3089106,
      "speaker": "Moritz Stefaner",
      "start": 3083178,
      "text": "So also, as a casual, like, user, you would still keep tracking it and maybe look at it like one point in time.",
      "id": "ep_45_ut_270"
    },
    {
      "end": 3095050,
      "speaker": "Nicholas Felton",
      "start": 3089138,
      "text": "Yeah. And I still want to make tools in this world for other people to explore their data. So having data of my own.",
      "id": "ep_45_ut_271"
    },
    {
      "end": 3098752,
      "speaker": "Moritz Stefaner",
      "start": 3095130,
      "text": "So you need some testing, lots of justifications for keeping on.",
      "id": "ep_45_ut_272"
    },
    {
      "end": 3148810,
      "speaker": "Nicholas Felton",
      "start": 3098816,
      "text": "Yeah. I don't know. It's been a while since I've been doing visualizations of other people's data, but in my world, especially working with my own data, it's always like a mirror. Like, if I can see myself reflected in it, I know that I've, I've done it correctly. And so it's almost like a testing suite for checking the effectiveness of something. If I don't see myself in it, then I know it's not really me or it's not an effective visualization. I know that's, it's a lot harder when you're working with other data where you don't have that intimacy with it. Right. Like, you rely on that first time series or, like, map to, like, you're like, okay, that's what it is. And now I'm going to dive deeper in it. But your initial encounter with it is based on those first few vises that you do. Right. And that sets your expectation for what you're trying to.",
      "id": "ep_45_ut_273"
    },
    {
      "end": 3161998,
      "speaker": "Moritz Stefaner",
      "start": 3148850,
      "text": "Very much fun, like, to track, like everybody tracks. And then you exchange data set of this sort of exploration of what can you learn and what were the misguided speculation. So that's a really, that's kind of.",
      "id": "ep_45_ut_274"
    },
    {
      "end": 3178210,
      "speaker": "Nicholas Felton",
      "start": 3162014,
      "text": "Like what Jared Thorpe did with flood watch, okay. Where he gave the ads that he was served to an Amazon Turker and had them write his biography. And it was all like, he seems to be kind of like a lonely guy based on these ads that he see.",
      "id": "ep_45_ut_275"
    },
    {
      "end": 3194818,
      "speaker": "Moritz Stefaner",
      "start": 3179870,
      "text": "But again, that sort of raises sensibilities of what. Yeah. What happens in between the lines and what is suggested by certain data points much more than if you do it for yourself because you know the truth and you're just looking for is the truth represented in the data. But if you don't even know the.",
      "id": "ep_45_ut_276"
    },
    {
      "end": 3197770,
      "speaker": "Enrico Bertini",
      "start": 3194954,
      "text": "But this is so much missing in all the other cases, right?",
      "id": "ep_45_ut_277"
    },
    {
      "end": 3198710,
      "speaker": "Moritz Stefaner",
      "start": 3197810,
      "text": "Yeah, yeah.",
      "id": "ep_45_ut_278"
    },
    {
      "end": 3200498,
      "speaker": "Enrico Bertini",
      "start": 3199130,
      "text": "It's a huge difference.",
      "id": "ep_45_ut_279"
    },
    {
      "end": 3208320,
      "speaker": "Nicholas Felton",
      "start": 3200594,
      "text": "Yeah. Like, can you, do you recognize the economy or do you recognize migration patterns? Really not because you're working at this higher order. Yeah.",
      "id": "ep_45_ut_280"
    },
    {
      "end": 3213880,
      "speaker": "Moritz Stefaner",
      "start": 3208410,
      "text": "Yeah. That's interesting. So maybe we should have, like, little surveillance clubs and, like, little contests.",
      "id": "ep_45_ut_281"
    },
    {
      "end": 3215980,
      "speaker": "Nicholas Felton",
      "start": 3215140,
      "text": "Who's the best?",
      "id": "ep_45_ut_282"
    },
    {
      "end": 3218796,
      "speaker": "Moritz Stefaner",
      "start": 3216020,
      "text": "Like, data detective on other people's lives. Yeah.",
      "id": "ep_45_ut_283"
    },
    {
      "end": 3219204,
      "speaker": "Nicholas Felton",
      "start": 3218828,
      "text": "Yeah.",
      "id": "ep_45_ut_284"
    },
    {
      "end": 3225652,
      "speaker": "Moritz Stefaner",
      "start": 3219292,
      "text": "Could have whole mystery stories, like little crimes stories, or maybe unfold in data.",
      "id": "ep_45_ut_285"
    },
    {
      "end": 3238200,
      "speaker": "Nicholas Felton",
      "start": 3225796,
      "text": "Or maybe it's like a bunch. It's, you know, you have four or five sets of data and you have a bunch of people visualize them all, but they're not really labeled, and then you have to, like, match them up. Like, I think that one and that one are the same.",
      "id": "ep_45_ut_286"
    },
    {
      "end": 3241122,
      "speaker": "Moritz Stefaner",
      "start": 3238810,
      "text": "Oh, one of them is fake. Yeah. It's like.",
      "id": "ep_45_ut_287"
    },
    {
      "end": 3241666,
      "speaker": "Nicholas Felton",
      "start": 3241186,
      "text": "Yeah.",
      "id": "ep_45_ut_288"
    },
    {
      "end": 3244018,
      "speaker": "Moritz Stefaner",
      "start": 3241778,
      "text": "Very nice. Data fiction.",
      "id": "ep_45_ut_289"
    },
    {
      "end": 3245354,
      "speaker": "Nicholas Felton",
      "start": 3244154,
      "text": "Yeah, yeah, yeah.",
      "id": "ep_45_ut_290"
    },
    {
      "end": 3254154,
      "speaker": "Enrico Bertini",
      "start": 3245442,
      "text": "I think one interesting thing is this idea of benchmark data sets that they had in the bus challenge. We had an episode where they actually.",
      "id": "ep_45_ut_291"
    },
    {
      "end": 3255682,
      "speaker": "Moritz Stefaner",
      "start": 3254242,
      "text": "Make up data sets.",
      "id": "ep_45_ut_292"
    },
    {
      "end": 3268334,
      "speaker": "Enrico Bertini",
      "start": 3255866,
      "text": "They create data sets that look real, but. And they embed the discoveries manually, but it's not real. It's basically synthetic data set that doesn't look synthetic, but they build a little.",
      "id": "ep_45_ut_293"
    },
    {
      "end": 3272710,
      "speaker": "Moritz Stefaner",
      "start": 3268422,
      "text": "Drama that you can unravel by exploring the data. Wow.",
      "id": "ep_45_ut_294"
    },
    {
      "end": 3274170,
      "speaker": "Enrico Bertini",
      "start": 3272830,
      "text": "It's very advanced.",
      "id": "ep_45_ut_295"
    },
    {
      "end": 3286090,
      "speaker": "Moritz Stefaner",
      "start": 3276270,
      "text": "Very advanced. Nerdery spending your weekends wrapping stories around data and data.",
      "id": "ep_45_ut_296"
    },
    {
      "end": 3293530,
      "speaker": "Enrico Bertini",
      "start": 3288310,
      "text": "I think that's important because you can get fooled very easily with visualization.",
      "id": "ep_45_ut_297"
    },
    {
      "end": 3298630,
      "speaker": "Moritz Stefaner",
      "start": 3294030,
      "text": "Yeah, that's the thing. Nice. Anything else you want to.",
      "id": "ep_45_ut_298"
    },
    {
      "end": 3305930,
      "speaker": "Enrico Bertini",
      "start": 3299290,
      "text": "I want to ask one last thing. So if somebody wants to do anything that is similar to what you are doing. Yeah, yeah.",
      "id": "ep_45_ut_299"
    },
    {
      "end": 3307122,
      "speaker": "Moritz Stefaner",
      "start": 3306010,
      "text": "How should they do it?",
      "id": "ep_45_ut_300"
    },
    {
      "end": 3360288,
      "speaker": "Nicholas Felton",
      "start": 3307266,
      "text": "How should they do it? Yeah, yeah. I think finding some sort of novel set of data and striking out on your own, like, I've always seen this as a little bit of like R and D and exploration. So I've. I've liked to be in this bubble of tracking stuff about myself that is really unknowable without just some hard work. And that that set of things has become fewer and fewer, but as sensors and software has improved. But I think that's where the really interesting stuff is and that's how you become an expert. So when someone does invent that, you know, I don't know, the itches I feel sensor, you're like, I am the expert in this data set. I kept track of all the different times that itches over the last year, and I have a story to tell that's both universal but unrecorded by anyone else. And so I think that's a good position to be in.",
      "id": "ep_45_ut_301"
    },
    {
      "end": 3367296,
      "speaker": "Enrico Bertini",
      "start": 3360304,
      "text": "Yeah, that's a really good point. So your suggestion is start with tracking one very interesting thing that nobody else.",
      "id": "ep_45_ut_302"
    },
    {
      "end": 3370016,
      "speaker": "Nicholas Felton",
      "start": 3367328,
      "text": "That you've never seen before. Yeah, that's a good point.",
      "id": "ep_45_ut_303"
    },
    {
      "end": 3374260,
      "speaker": "Moritz Stefaner",
      "start": 3370128,
      "text": "Yeah. Okay, nice.",
      "id": "ep_45_ut_304"
    },
    {
      "end": 3378800,
      "speaker": "Enrico Bertini",
      "start": 3375160,
      "text": "Well, great question coming here and talking to us.",
      "id": "ep_45_ut_305"
    },
    {
      "end": 3380260,
      "speaker": "Nicholas Felton",
      "start": 3378880,
      "text": "Thanks for having me. This is very.",
      "id": "ep_45_ut_306"
    },
    {
      "end": 3383738,
      "speaker": "Enrico Bertini",
      "start": 3380650,
      "text": "Lots of fun. Yeah, thank you. Bye bye.",
      "id": "ep_45_ut_307"
    },
    {
      "end": 3384122,
      "speaker": "Nicholas Felton",
      "start": 3383794,
      "text": "Cheers.",
      "id": "ep_45_ut_308"
    },
    {
      "end": 3384450,
      "speaker": "Moritz Stefaner",
      "start": 3384186,
      "text": "Thanks.",
      "id": "ep_45_ut_309"
    },
    {
      "end": 3385150,
      "speaker": "Nicholas Felton",
      "start": 3384490,
      "text": "Bye.",
      "id": "ep_45_ut_310"
    },
    {
      "end": 3418700,
      "speaker": "Enrico Bertini",
      "start": 3389810,
      "text": "Datastory is supported by Tableau software, helping people see and understand their data. Get answers from interactive dashboards. Wherever you go for your free trial, visit Tableau software at T A B l e a U once again, table ausoftware.com data stories. Don't forget to put data stories because it's very important that they know that you are coming from us. Thanks a lot for supporting us with this. Bye.",
      "id": "ep_45_ut_311"
    }
  ],
  "confidence": 0.919691909218999,
  "audio_duration": 3420,
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_status_code": null,
  "webhook_auth": false,
  "webhook_auth_header_name": null,
  "speed_boost": false,
  "auto_highlights_result": null,
  "auto_highlights": false,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_audio_quality": null,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "content_safety": false,
  "iab_categories": true,
  "content_safety_labels": {
    "status": "unavailable",
    "results": [],
    "summary": {}
  },
  "language_detection": false,
  "language_detection_threshold": null,
  "language_confidence": null,
  "custom_spelling": null,
  "throttled": false,
  "auto_chapters": true,
  "summarization": false,
  "summary_type": null,
  "summary_model": null,
  "custom_topics": false,
  "topics": [],
  "speech_threshold": null,
  "speech_model": "best",
  "chapters": [
    {
      "summary": "Datastores is supported by Tableau software, helping people see and understand their data. Get answers from interactive dashboards wherever you go for a free trial. We had ambitious plans for very ambitious interactive installations. These things are tough, but we're getting there.",
      "gist": "Datastores: In the Elevator With Tableau",
      "headline": "Datastores is supported by Tableau software, helping people see and understand their data",
      "start": 240,
      "end": 68046,
      "id": "ep_45_ch_0"
    },
    {
      "summary": "Nick Felton is famous for his personal annual reports he's been doing now for almost a decade. They started off as a design idea, and developed a life of their own. Felton: The more you try and get at one thing, the more it starts to rope in other things.",
      "gist": "In the Elevator With Nick Felton",
      "headline": "Nick Felton is famous for his annual reports about his life",
      "start": 68198,
      "end": 434300,
      "id": "ep_45_ch_1"
    },
    {
      "summary": "The more you discover things about yourself, the more you are affected by that. Do you think that, in a way, this could actually be applied on a large scale or it's something that can be only done?",
      "gist": "Have You Changed Your Behavior Since Tracking Your Own Behavior?",
      "headline": "By tracking your own behavior, you might actually change your behavior",
      "start": 435000,
      "end": 787390,
      "id": "ep_45_ch_2"
    },
    {
      "summary": "How do you think about your self surveillance now in the view of the Snowden revelations and the mass surveillance discussions? As someone who is trying to make products to help people leverage their own personal data, there, you really have a much larger burden to provide value.",
      "gist": "Your Self Surveillance",
      "headline": "How do you think about your self surveillance now in view of the Snowden revelations",
      "start": 788140,
      "end": 945730,
      "id": "ep_45_ch_3"
    },
    {
      "summary": "How do you actually track your data in practice? How many different channels? You use devices or your own app? I don't know. This year, I'm interested in the state of the market for surveillance objects and apps.",
      "gist": "How to Track Your Data",
      "headline": "How do you actually track your data in practice? How many different channels",
      "start": 946390,
      "end": 1256594,
      "id": "ep_45_ch_4"
    },
    {
      "summary": "Nicholas Felton: Is the future more on integrating everything on one device or. Or like, super distribute everything. How do you integrate these reflections into your daily life?",
      "gist": "How to Track Your Life",
      "headline": "Is the future more on integrating everything on one device or. Or like, super distribute everything",
      "start": 1256762,
      "end": 1506376,
      "id": "ep_45_ch_5"
    },
    {
      "summary": "There's a lot of tracking going on. Especially for toddlers or babies. Some parents will exchange access to children's location data for a cell phone. If they have the tools to really do full digital surveillance, it's quite intrusive.",
      "gist": "Does Your Child Need More Digital Surveillance?",
      "headline": "Some parents exchange access to children's location data for a cell phone",
      "start": 1506528,
      "end": 1625800,
      "id": "ep_45_ch_6"
    },
    {
      "summary": "Tableau lets people connect to any kind of data and visualize it on the fly. Datum is kind of limping along. Reporter is cranking along. There's one other thing I'm working on that will hopefully see the light of day.",
      "gist": "Tableau Software Interviews Datastores",
      "headline": "Tableau lets people connect to data and visualize it on the fly",
      "start": 1627340,
      "end": 1703320,
      "id": "ep_45_ch_7"
    },
    {
      "summary": "How did you come up with the idea of creating a book rather than just publishing this thing on the web? My background is what is. It's in graphic design. And probably learning how to code in order to do these things is not that hard.",
      "gist": "How Do You Make a Book?",
      "headline": "How did you come up with the idea of creating a book rather than just publishing",
      "start": 1706790,
      "end": 2015160,
      "id": "ep_45_ch_8"
    },
    {
      "summary": "The other thing everybody should learn about is typography. Little differences in typography can make such a difference in. how well something works. It's all very fundamental to book design or magazine style designs. Are there any resources where you say like this is a great primer on how to get started on typography?",
      "gist": "Dataviz: More on Typography",
      "headline": "The other thing I think everybody should learn about is typography",
      "start": 2015460,
      "end": 2506262,
      "id": "ep_45_ch_9"
    },
    {
      "summary": "Good typography alone, without even like being super smart, but just being smart about font choices and, like, font sizes. labeling is the thing that gives meaning to the things that you see on the screen. Do you care about completeness more or more about highlighting?",
      "gist": "Do You Care About Completteness?",
      "headline": "Good typography requires more than just being smart about font choices",
      "start": 2506366,
      "end": 2611020,
      "id": "ep_45_ch_10"
    },
    {
      "summary": "The data collection process is like a creative act or like an act in the world. It's only recently that we got into this point where data is a given. How do you deal with missing data?",
      "gist": "Likely the artists who inspire you",
      "headline": "Is there anyone out there doing anything similar to what you do that you like",
      "start": 2614480,
      "end": 3021576,
      "id": "ep_45_ch_11"
    },
    {
      "summary": "Nerder: In my world, especially working with my own data, it's always like a mirror. And I still want to make tools in this world for other people to explore their data. Maybe we should have little surveillance clubs and, like, little contests. Who's the best data detective?",
      "gist": "The Cost of Tracking Your Fitness",
      "headline": "I have to, like, detrain myself and train myself for new fitness trackers",
      "start": 3021728,
      "end": 3296978,
      "id": "ep_45_ch_12"
    },
    {
      "summary": "If somebody wants to do anything similar to what you are doing, how should they do it? Start with tracking one very interesting thing that nobody else. That you've never seen before. That's how you become an expert.",
      "gist": "Anatomy: The Search for Discovery",
      "headline": "Your suggestion is start with tracking one very interesting thing that nobody else has",
      "start": 3297154,
      "end": 3385150,
      "id": "ep_45_ch_13"
    },
    {
      "summary": "Datastory is supported by Tableau software, helping people see and understand their data. Get answers from interactive dashboards. Don't forget to put data stories because it's very important.",
      "gist": "Tableau Software: Data Stories",
      "headline": "Datastory is supported by Tableau software, helping people see and understand their data",
      "start": 3389810,
      "end": 3418700,
      "id": "ep_45_ch_14"
    }
  ],
  "disfluencies": false,
  "entity_detection": false,
  "sentiment_analysis": false,
  "sentiment_analysis_results": null,
  "entities": null,
  "speakers_expected": null,
  "summary": null,
  "custom_topics_results": null,
  "is_deleted": null,
  "episode_num": "45",
  "episode_metadata": {
    "speakers": [
      "Moritz Stefaner",
      "Enrico Bertini",
      "Nicholas Felton"
    ],
    "WPid": "231",
    "url": "https://datastori.es/podlove/file/542/s/feed/c/mp3/data-stories-45-with-nicholas-felton.mp3",
    "episode_title": "Nicholas Felton"
  }
}