{
  "id": "002c4be4-e60a-4f72-b947-8c1782068132",
  "language_model": "assemblyai_default",
  "acoustic_model": "assemblyai_default",
  "language_code": "en_us",
  "status": "completed",
  "audio_url": "https://datastori.es/podlove/file/1005/s/feed/c/mp3/Datastories-56.mp3",
  "utterances": [
    {
      "end": 2714,
      "speaker": "Amanda Cox",
      "start": 160,
      "text": "I would give two of my left fingers for this. Data.",
      "id": "ep_56_ut_0"
    },
    {
      "end": 24074,
      "speaker": "Moritz Stefaner",
      "start": 4694,
      "text": "Datastores is supported by Tableau software, helping people see and understand their data. Get answers from interactive dashboards. Wherever you go for your free trial, visit Tableau software@Tableau.com. Datastories. That's Tableau.com Datastories.",
      "id": "ep_56_ut_1"
    },
    {
      "end": 39148,
      "speaker": "Enrico Bertini",
      "start": 34524,
      "text": "Hi, everyone. Data stories number 56. Hey, Moritz.",
      "id": "ep_56_ut_2"
    },
    {
      "end": 40556,
      "speaker": "Moritz Stefaner",
      "start": 39196,
      "text": "Hey, Enrico. How are you doing?",
      "id": "ep_56_ut_3"
    },
    {
      "end": 48224,
      "speaker": "Enrico Bertini",
      "start": 40620,
      "text": "How's it going? I've heard you're having better summer in Germany than in New York.",
      "id": "ep_56_ut_4"
    },
    {
      "end": 57984,
      "speaker": "Moritz Stefaner",
      "start": 49044,
      "text": "Starting with the weather again. It's a strong opening. Yeah, the weather is real bad. It's horrible. I'm wearing a scarf. That's not.",
      "id": "ep_56_ut_5"
    },
    {
      "end": 60560,
      "speaker": "Enrico Bertini",
      "start": 58504,
      "text": "Yeah, no, we don't have a scarf issue here.",
      "id": "ep_56_ut_6"
    },
    {
      "end": 61096,
      "speaker": "Moritz Stefaner",
      "start": 60592,
      "text": "No.",
      "id": "ep_56_ut_7"
    },
    {
      "end": 66844,
      "speaker": "Enrico Bertini",
      "start": 61240,
      "text": "But, yeah. Not very sunny, though. Yeah. What can I do?",
      "id": "ep_56_ut_8"
    },
    {
      "end": 70256,
      "speaker": "Moritz Stefaner",
      "start": 67144,
      "text": "Perfect weather to record a podcast inside, right?",
      "id": "ep_56_ut_9"
    },
    {
      "end": 71912,
      "speaker": "Enrico Bertini",
      "start": 70280,
      "text": "It's perfect. Yeah. Yeah.",
      "id": "ep_56_ut_10"
    },
    {
      "end": 73764,
      "speaker": "Moritz Stefaner",
      "start": 72008,
      "text": "What have you been up to? Any news?",
      "id": "ep_56_ut_11"
    },
    {
      "end": 86226,
      "speaker": "Enrico Bertini",
      "start": 76184,
      "text": "No, not really. Pretty flat and boring. No, I'm doing some work, but no. No major news, no scandals.",
      "id": "ep_56_ut_12"
    },
    {
      "end": 86970,
      "speaker": "Moritz Stefaner",
      "start": 86330,
      "text": "No excitement.",
      "id": "ep_56_ut_13"
    },
    {
      "end": 88290,
      "speaker": "Enrico Bertini",
      "start": 87002,
      "text": "No scandals. Let me think.",
      "id": "ep_56_ut_14"
    },
    {
      "end": 93774,
      "speaker": "Moritz Stefaner",
      "start": 88362,
      "text": "Yeah, same here. I'm just holding up, trying to progress with a project.",
      "id": "ep_56_ut_15"
    },
    {
      "end": 96986,
      "speaker": "Enrico Bertini",
      "start": 94314,
      "text": "Yeah, it's that part of the year.",
      "id": "ep_56_ut_16"
    },
    {
      "end": 101330,
      "speaker": "Moritz Stefaner",
      "start": 97130,
      "text": "It's like that, the pre vacation finishing up time.",
      "id": "ep_56_ut_17"
    },
    {
      "end": 108090,
      "speaker": "Enrico Bertini",
      "start": 101482,
      "text": "Yeah, I'm not sure when I'm gonna have vacation, but. Yeah, fine, fine. Don't complain.",
      "id": "ep_56_ut_18"
    },
    {
      "end": 108854,
      "speaker": "Moritz Stefaner",
      "start": 108202,
      "text": "Maybe.",
      "id": "ep_56_ut_19"
    },
    {
      "end": 114234,
      "speaker": "Enrico Bertini",
      "start": 109454,
      "text": "Well, my family is leaving soon to Italy. I'm so jealous.",
      "id": "ep_56_ut_20"
    },
    {
      "end": 117874,
      "speaker": "Moritz Stefaner",
      "start": 114654,
      "text": "Yeah, but then maybe you can finally get some work done. Who knows?",
      "id": "ep_56_ut_21"
    },
    {
      "end": 124754,
      "speaker": "Enrico Bertini",
      "start": 118534,
      "text": "Yeah. I don't know. Yeah. There is this whole theory that you can do more work when you have a family rather than less.",
      "id": "ep_56_ut_22"
    },
    {
      "end": 126194,
      "speaker": "Moritz Stefaner",
      "start": 125214,
      "text": "Totally.",
      "id": "ep_56_ut_23"
    },
    {
      "end": 131154,
      "speaker": "Enrico Bertini",
      "start": 126654,
      "text": "You have more motivation. Maybe. I don't know. Or maybe it's just bullshit.",
      "id": "ep_56_ut_24"
    },
    {
      "end": 143114,
      "speaker": "Moritz Stefaner",
      "start": 132454,
      "text": "Could be. Anyways, I would say, as we don't have much to say, let's just bring our guest on. So today we have a super special guest, and it's Amanda Cox. Hi, Amanda.",
      "id": "ep_56_ut_25"
    },
    {
      "end": 144486,
      "speaker": "Amanda Cox",
      "start": 143814,
      "text": "Hi.",
      "id": "ep_56_ut_26"
    },
    {
      "end": 147670,
      "speaker": "Enrico Bertini",
      "start": 144630,
      "text": "Hi. Great having you here. How are you?",
      "id": "ep_56_ut_27"
    },
    {
      "end": 154974,
      "speaker": "Amanda Cox",
      "start": 147822,
      "text": "I'm well. Thanks for having me. Yeah, you set a high bar with the introduction weather, and there's nothing going on.",
      "id": "ep_56_ut_28"
    },
    {
      "end": 166724,
      "speaker": "Moritz Stefaner",
      "start": 155054,
      "text": "Yeah, that's like, what else could we now talk about? You know, it's all being said. Amanda, can you introduce yourself? I think most people know you, but still, it's. Yeah.",
      "id": "ep_56_ut_29"
    },
    {
      "end": 188364,
      "speaker": "Amanda Cox",
      "start": 167744,
      "text": "I am a graphics editor at the New York Times, one of dozens. And, yeah, I have a background in statistics before the time. So the work that I do tends to be a little bit more statistically oriented than some of my colleagues who are, say, better artists or developers or whatever else.",
      "id": "ep_56_ut_30"
    },
    {
      "end": 200514,
      "speaker": "Moritz Stefaner",
      "start": 188824,
      "text": "And how did you end up at the New York Times? Did you study statistics and then directly go journalism, or did you do different things in between? What was the story there?",
      "id": "ep_56_ut_31"
    },
    {
      "end": 261570,
      "speaker": "Amanda Cox",
      "start": 201574,
      "text": "Yeah, I was in grad school, and I hated it. So the first year that you're in statistics grad school, they don't let you touch any data at all. It's all epsilons and greek letters. And so I didn't know what else I wanted to do with my life, but it wasn't epsilons and greek letters. And so I started applying for random things, in part just to see what I would be disappointed. Went by when they rejected me. And one of them was to be the Times intern on the graphics desk that summer. And so they were in a. Steve, Dwayne was in a think outside the box mode. Why not hire an intern who doesn't know any of the skills that we use in our work? And so I spent the summer as an intern, then I went back to grad school. My second year of grad school is better because they let you touch data. But near the end of that, I got a call. They said, hey, we have a slot. Do you know anyone? I said, I do. I know her very well. And so that was how I fell into the times, right through the internship program was my introduction to it.",
      "id": "ep_56_ut_32"
    },
    {
      "end": 268254,
      "speaker": "Moritz Stefaner",
      "start": 261602,
      "text": "And at the time, would you say you were the most, like, technical or statistical minded person on the team or.",
      "id": "ep_56_ut_33"
    },
    {
      "end": 286088,
      "speaker": "Amanda Cox",
      "start": 269394,
      "text": "Definitely not technical. Maybe proper statistics, you know, certainly. Probably the most formal definition of uncertainty or whatever, but definitely not technical because.",
      "id": "ep_56_ut_34"
    },
    {
      "end": 288864,
      "speaker": "Moritz Stefaner",
      "start": 286136,
      "text": "There were a few hackers and coders around.",
      "id": "ep_56_ut_35"
    },
    {
      "end": 297776,
      "speaker": "Amanda Cox",
      "start": 289024,
      "text": "Yeah. Matt Erickson was doing who knows what, and Bill McNulty was doing fancy stuff with maps at the time. Sure. So. Yeah. Yeah.",
      "id": "ep_56_ut_36"
    },
    {
      "end": 303528,
      "speaker": "Moritz Stefaner",
      "start": 297800,
      "text": "But it's true. I mean, you won't see so many trained statisticians in newsrooms, maybe in the nineties or something.",
      "id": "ep_56_ut_37"
    },
    {
      "end": 303760,
      "speaker": "Amanda Cox",
      "start": 303576,
      "text": "Right.",
      "id": "ep_56_ut_38"
    },
    {
      "end": 310134,
      "speaker": "Moritz Stefaner",
      "start": 303792,
      "text": "Because it seemed a bit remote from. Yeah. What a typical journalist profile might be. Right?",
      "id": "ep_56_ut_39"
    },
    {
      "end": 332534,
      "speaker": "Amanda Cox",
      "start": 311314,
      "text": "Yeah. I mean, there aren't a lot of, I think, trained statisticians in the nineties and the world, period. It's a field that has grown amazing. Like, you see the people who talk about their undergraduate program, enrollment in statistics, and those charts are all, you know, they're exponentially growing at a lot of the big schools, so. But, yeah, you're right that.",
      "id": "ep_56_ut_40"
    },
    {
      "end": 339170,
      "speaker": "Moritz Stefaner",
      "start": 333194,
      "text": "Yeah, it used to be a really unsexy job, right? Like, yeah. And now it has the same.",
      "id": "ep_56_ut_41"
    },
    {
      "end": 356494,
      "speaker": "Amanda Cox",
      "start": 339202,
      "text": "I don't know if it was ever unsexy, especially for, you know, I was always. I feel like actuary was always rated, like, you know, most charming career that you can, like, make a solid chunk of money and go home at 05:00 without any stress. Right? I don't know.",
      "id": "ep_56_ut_42"
    },
    {
      "end": 369194,
      "speaker": "Enrico Bertini",
      "start": 359474,
      "text": "So. And Amanda, when did you start doing, creating charts and visualizations? Right away, or there has been a development over time.",
      "id": "ep_56_ut_43"
    },
    {
      "end": 442562,
      "speaker": "Amanda Cox",
      "start": 369614,
      "text": "Yeah. So my very first job after college, I worked as an RA at the Federal Reserve Board. And their sort of, your price of admission is supposed to be to make the briefing charts for the economists. They have these meetings with the chairman, and they bring these books of charts. And if you're a good Ra, I think you're supposed to kind of hate making the charts. And then, but you do that 50% of the time. So your other half of the time, you get to spend on your research or whatever. Right? Like, I only liked making the charts. And so, and then, you know, when I was in grad school, I got myself into a point where I'd acquired like three or four different research assistantships. And instead of doing the work I was supposed to be doing the statistical work, I would just make what I would call, like the art of the week, which was just like a chart that fooled people into thinking I was actually working because I couldn't juggle all these properly at the same time. And so I think both of those, you can tell a coherent, backward looking story. In terms of making charts, though, I think it's cheating a little bit because I think there's probably 100 different things I could have ended up doing. And you could tell some kind of coherent story. If, you know, you cherry pick your.",
      "id": "ep_56_ut_44"
    },
    {
      "end": 444454,
      "speaker": "Moritz Stefaner",
      "start": 442618,
      "text": "Hindsight, it almost makes sense.",
      "id": "ep_56_ut_45"
    },
    {
      "end": 478284,
      "speaker": "Enrico Bertini",
      "start": 445884,
      "text": "And is it making charts something that you got or learned out of school or something that you learned afterwards or just on your own? Just curious to hear about, because I'm not aware of how degree in statistics work, but I know that statisticians have been developing a lot of interesting charts. And in general, there is a lot of research on visualization, on the statistics side. So I'm curious if you also get taught this kind of stuff in school or not.",
      "id": "ep_56_ut_46"
    },
    {
      "end": 496604,
      "speaker": "Amanda Cox",
      "start": 478824,
      "text": "I had just one class. It was like an elective class. I was taught by a guy named Thomas Lumley, who's a brilliant statistician and a hilarious man. But it was a not very much work kind of elective. And so it was not the most rigorous part of my statistical education.",
      "id": "ep_56_ut_47"
    },
    {
      "end": 505668,
      "speaker": "Enrico Bertini",
      "start": 498224,
      "text": "And so. And how long have you been at New York Times right now? I think it's been quite a while, right?",
      "id": "ep_56_ut_48"
    },
    {
      "end": 517076,
      "speaker": "Amanda Cox",
      "start": 505756,
      "text": "Ten years. This summer will be my anniversary. And I know that. I know that only because my first week, Hurricane Katrina happened, which was a gentle introduction to the grassroots.",
      "id": "ep_56_ut_49"
    },
    {
      "end": 517944,
      "speaker": "Moritz Stefaner",
      "start": 517100,
      "text": "Quite a start.",
      "id": "ep_56_ut_50"
    },
    {
      "end": 520852,
      "speaker": "Amanda Cox",
      "start": 518284,
      "text": "So, yeah, ten years this summer. A long time.",
      "id": "ep_56_ut_51"
    },
    {
      "end": 534624,
      "speaker": "Moritz Stefaner",
      "start": 520908,
      "text": "Wow, that's cool. Yeah. And you use mostly r for at least for developing, exploring data and developing your basic visualization ideas? That right?",
      "id": "ep_56_ut_52"
    },
    {
      "end": 549384,
      "speaker": "Amanda Cox",
      "start": 535444,
      "text": "I do still do most of my sketching. We've acquired this data, or we need to acquire this data from somewhere on the Internet. What does it look like? How might we approach it? I do most of that work in r still, not all now, but most of it.",
      "id": "ep_56_ut_53"
    },
    {
      "end": 579334,
      "speaker": "Moritz Stefaner",
      "start": 550284,
      "text": "And is it because the tool, is it like. Mostly it's one tool where it gets so fluent that it's just fun to work with? And could it also be with another tool, the same relationship? Or is it something about R and the packages it offers or the workflows that you think make it uniquely actually the best tool for the type of work you do? What's your experience with R and also how it evolved over the years? I guess you have followed the development quite a bit.",
      "id": "ep_56_ut_54"
    },
    {
      "end": 635374,
      "speaker": "Amanda Cox",
      "start": 580994,
      "text": "Yeah, I think for me a lot of it is just being fluent. I think there's nothing particularly special about R other than it just being the greatest software on earth, so. But there's, you know, I'm not actually using r for many of the things that R is great at. You know, we're not usually fitting very complicated models or doing that kind of work, but I think part of it is fluency and, but part of it is some of the choices made in r being written by people who don't really care about data structure or care about, want to allow users to, you know, do whatever they want with data and reshape it. And, you know, sort of that kind of things that come for free are useful. You know, the idea, like, I don't want to draw my own axies, I want you to draw them for me. Right. Like some of that kind of stuff, stuff that comes for free. Those decisions, I think, are uniquely delightful in our.",
      "id": "ep_56_ut_55"
    },
    {
      "end": 645034,
      "speaker": "Moritz Stefaner",
      "start": 636474,
      "text": "And how is it organized? So it's a little. So it has its own programming language, right, and its own idea of how data should be structured in order to work with it properly.",
      "id": "ep_56_ut_56"
    },
    {
      "end": 677594,
      "speaker": "Amanda Cox",
      "start": 645074,
      "text": "So it's, I think it largely doesn't care how data should be structured. I mean, so there are things like data frames, which you can think of as just an excel spreadsheet, you know, rows and columns functionally. And the data frame, I think, is languages that don't have a data frame. I don't understand how anyone does anything interesting in them, especially with structured type data, things that are rows and columns, you end up just hacking together your own version of a data frame. If it doesn't come with a data frame for free, sure.",
      "id": "ep_56_ut_57"
    },
    {
      "end": 684318,
      "speaker": "Moritz Stefaner",
      "start": 679054,
      "text": "And then there's lots of packages or different libraries. Is there a technical term?",
      "id": "ep_56_ut_58"
    },
    {
      "end": 764404,
      "speaker": "Amanda Cox",
      "start": 684366,
      "text": "Probably thousands of them. And some people claim that's some of the success of our development. But I think it's really interesting now what's going on in that space. And there's a lot of people, me included, who have worked basically the same way and are for a very, very long time. And in the last six months, year and a half, I don't know, there have been some really great packages. So Hadley Wickham is sort of an r celebrity, but I never fallen into the Hadley verse before. But his link, do you mean Hadley Wickham? Hadley Wickham? Yeah, his latest. He has a package called dplyr, which you can, and some other people's works too, that there's this idea of chaining commands together. So first I sort, now I filter, then I mutate some columns in my data. And that stuff for the first time is really fun. And there's other people working on stuff, too. That makes r feel a little bit more natural with the Internet. Hadley is working on some of that, too, but that work space is exciting. So I think r is becoming a lot more of a grown up for the type of work that we do. It's changed a lot, I think, in the past year or so.",
      "id": "ep_56_ut_59"
    },
    {
      "end": 770004,
      "speaker": "Enrico Bertini",
      "start": 765304,
      "text": "So you've been using it from the very beginning, or there was something that you used before?",
      "id": "ep_56_ut_60"
    },
    {
      "end": 771820,
      "speaker": "Amanda Cox",
      "start": 770564,
      "text": "No, from the beginning.",
      "id": "ep_56_ut_61"
    },
    {
      "end": 772524,
      "speaker": "Enrico Bertini",
      "start": 771892,
      "text": "Okay.",
      "id": "ep_56_ut_62"
    },
    {
      "end": 819834,
      "speaker": "Moritz Stefaner",
      "start": 772644,
      "text": "Yeah. I mean, I always wanted to get started with r because everybody was like, oh, you have to use r, it's so cool. But I never got into it, really, because. Exactly. This whole ecosystem was so overwhelming. I think it's a bit like. So I do web development a lot, and I know that ecosystem quite well, but I could imagine if you get started with that, it's the same. It's like there's a billion libraries that do basically the same thing, but 90% of them are broken, and you have to figure out which. And it's super complicated. And then I felt you have to learn a lot by heart or like, yeah, just learn these commands from that package. And if you use a different package, they are different. It's like, it seems like a big hurdle there. Do you have any tips, like how to get started? If you're confused as I am.",
      "id": "ep_56_ut_63"
    },
    {
      "end": 877600,
      "speaker": "Amanda Cox",
      "start": 821734,
      "text": "That's a good question. So many people are Hadley fans, and so you could just decide for our work, I am only going to reuse packages, written libraries, written by Hadley and that's. It would be one. And that would get you of the type of work that we do. That would get you 95% of the weighted done. And so stuff would work kind of consistently or just stick and stay roughly in base r. Like base r does 85% of the work that we do. So just no libraries at all. I only want points and lines and text, and I've been sort of that way for a while too. We're not doing stuff that's that complicated. We're merging data and filtering it, whatever. You can do that with a dozen commands. I scraped my. Not scraped, I processed all of the r code I had written at one point, and there were only 100 things I use all the time.",
      "id": "ep_56_ut_64"
    },
    {
      "end": 896940,
      "speaker": "Moritz Stefaner",
      "start": 877792,
      "text": "So you were looking for which commands you used the most? Yeah, that's super interesting. Cool. Good idea. Meta analysis. Yeah, yes, yeah, yeah, yeah, yeah. That's a good tip, though. Like sticking with like one guy and then get into his mindset and then, you know, it makes sense. Hopefully that's a good idea. So I might give that a shot.",
      "id": "ep_56_ut_65"
    },
    {
      "end": 900504,
      "speaker": "Amanda Cox",
      "start": 896972,
      "text": "I'll let you know how it's time marks you'll like.",
      "id": "ep_56_ut_66"
    },
    {
      "end": 937428,
      "speaker": "Enrico Bertini",
      "start": 901004,
      "text": "But I have to say that this is the kind of tip that I give to people who want to start doing visualization, that there are so many tools out there and you can get attracted by all of them, but it's a huge mess. Right. I think it's much, much better to stick with one and learn it very well. And especially another part of it is rather than choosing something that is new and is going to disappear tomorrow, I always say choose between the few, very few options that are out there that probably are going to be here in five or even ten years. Right. And there are not many that have these characteristics.",
      "id": "ep_56_ut_67"
    },
    {
      "end": 938784,
      "speaker": "Moritz Stefaner",
      "start": 937476,
      "text": "Yeah, that's true.",
      "id": "ep_56_ut_68"
    },
    {
      "end": 939640,
      "speaker": "Enrico Bertini",
      "start": 938884,
      "text": "Yeah.",
      "id": "ep_56_ut_69"
    },
    {
      "end": 956924,
      "speaker": "Moritz Stefaner",
      "start": 939832,
      "text": "And now what do you output mostly with R? Like, would you like output mostly PDF's and then review the PDF's and annotate those? Or do you output like inductive little dashboards or what's your typical product you would produce with R?",
      "id": "ep_56_ut_70"
    },
    {
      "end": 987662,
      "speaker": "Amanda Cox",
      "start": 957424,
      "text": "Yeah, no, mine is mostly PDF's. And so if you're making a print graphic, that's great because you can just open it in illustrator and clean it up. And if you're making a web graphic, it's. PDF is a little disappointing. Now you have a place to start, so. But even I am a believer even for sketching in things that we call like, poor man's animation. Poor man's animation is just like holding the page down, key down on a PDF, your own flipbook.",
      "id": "ep_56_ut_71"
    },
    {
      "end": 987862,
      "speaker": "Enrico Bertini",
      "start": 987718,
      "text": "Yeah.",
      "id": "ep_56_ut_72"
    },
    {
      "end": 993354,
      "speaker": "Moritz Stefaner",
      "start": 987878,
      "text": "But you can drop back and forth and. Yeah, I mean, PDF's do have some advantages, for sure.",
      "id": "ep_56_ut_73"
    },
    {
      "end": 1002854,
      "speaker": "Amanda Cox",
      "start": 993774,
      "text": "Yeah. So, you know, if you want to make, like, you know, deeply interactive work, it's probably not the best way to start.",
      "id": "ep_56_ut_74"
    },
    {
      "end": 1017330,
      "speaker": "Enrico Bertini",
      "start": 1003394,
      "text": "Yeah. This is actually a question that I had for you because I think the only big limitation I see for doing visualization with r is that as soon as you need interaction, it seems to be very, very limited. Right.",
      "id": "ep_56_ut_75"
    },
    {
      "end": 1053404,
      "speaker": "Amanda Cox",
      "start": 1017482,
      "text": "I mean, people have changed that, I think, a lot in the last year or so. Hadley works at a company called RSTudio, and they have this thing called shiny, which allows it's not the best interaction. And there's another guy blanking on his name who does this stuff that up. Two reals, D3 in a really graceful way if you're just making the same type of scatter plot over and over and over again. So some of that people are making, I feel like, real progress currently on connecting r to the web in a deeper way than it has been before.",
      "id": "ep_56_ut_76"
    },
    {
      "end": 1074188,
      "speaker": "Moritz Stefaner",
      "start": 1053824,
      "text": "Also, Tableau can make calls to r subroutines, basically. So if you want to do complicated statistics in the background, you know, you can. Yeah. Write a routine that calculates something, gives the results back and these things. That's super interesting, I think. Yeah. Because many of the tools are so isolated and all have their strengths and. Yeah, that's kind of cool.",
      "id": "ep_56_ut_77"
    },
    {
      "end": 1087446,
      "speaker": "Enrico Bertini",
      "start": 1074236,
      "text": "So is there Amanda, if some of our listeners want to start with her, do you have any suggestions where to start? Maybe if there is a nice tutorial you like or, I don't know, whatever. A book maybe?",
      "id": "ep_56_ut_78"
    },
    {
      "end": 1144768,
      "speaker": "Amanda Cox",
      "start": 1087590,
      "text": "Yeah, I think I just go to RSTudio way. So download the RSTudio and just do whatever. Play with it, whatever it is they tell you to do. I'm sure there's an intro there somewhere. I think. For learning, though, you'll never learn anything if you try to learn that way. So for learning, it's like, have a problem that you actually want to solve. And so our problems are problems where first I need to scrape some data off the Internet, and then I don't know what it looks like, but I want to try on different chart forms or just sort of explore the data I think are the best, sort of, like, at least in our space, the best learning with our kind of things. And so some of the advantages from that, like, you know, that you can scrape and plot and analyze and clean your data all in the same place. That's some of our strengths from my end. So, like, figure out the project that it is that you actually want to do that fits those, those categories and then become an r disciple.",
      "id": "ep_56_ut_79"
    },
    {
      "end": 1153056,
      "speaker": "Enrico Bertini",
      "start": 1144896,
      "text": "So is there any other major tool that you guys use at New York Times other than r or r ching?",
      "id": "ep_56_ut_80"
    },
    {
      "end": 1177774,
      "speaker": "Amanda Cox",
      "start": 1153200,
      "text": "You know, D3 is the obvious for all the interactive work. And then other people, you know, you spoke to Gregor, I think, about some of the charting tools he's made for. Very simple charts where, you know, I just want to make a bar chart. So some internal tools for that. All of our print work and many of our web mock ups go through illustrator. We'd be lying if we didn't pretend that Excel was a workhorse in the department.",
      "id": "ep_56_ut_81"
    },
    {
      "end": 1200150,
      "speaker": "Enrico Bertini",
      "start": 1179914,
      "text": "Yeah, of course. So. And how does this work at New York Times? So can you describe a little bit what is the process, how a new piece starts and how do you get to the final graphics? I'm sure a lot of listeners are curious about what's the process there.",
      "id": "ep_56_ut_82"
    },
    {
      "end": 1271194,
      "speaker": "Amanda Cox",
      "start": 1200302,
      "text": "Sure. So I think the process happens in a bunch of different ways. One graphics editor is attached, at least one is attached to all the major desks. And so they go to their meetings, and increasingly, we do our own work. So here is an issue that I think is important to the world, or here is a news event that we need to respond to. We've always sort of done our own work on breaking news because there's not really time to coordinate. So we have a meeting in the morning around 1015, or Steve or Archie or someone else who leads to death says, here are the paper's priorities for the day. How are we going to respond to them? And then those of us who are not working on something daily go back to work that may run this weekend or two weeks from now or some time, unknown time in the future. And the work, it's often small teams, two, three, four people whose skillsets overlap, but usually someone's a stronger reporter, someone's maybe a stronger designer, someone's a stronger developer, and so very collaborative, kind of. But those teams are sort of organic in terms of just what an idea needs to get done.",
      "id": "ep_56_ut_83"
    },
    {
      "end": 1299536,
      "speaker": "Enrico Bertini",
      "start": 1272054,
      "text": "And I guess, at least for some projects, one of the main problems is also finding the right. The right data for the problem that you want to. Right. I remember, I think I met Kevin Quilly a few weeks ago or days ago. No, weeks ago. And he was telling me this interesting story about a recent piece that you've done on upshot. I think it was on what people eat at. What was it about?",
      "id": "ep_56_ut_84"
    },
    {
      "end": 1300496,
      "speaker": "Amanda Cox",
      "start": 1299720,
      "text": "Chipotle.",
      "id": "ep_56_ut_85"
    },
    {
      "end": 1314902,
      "speaker": "Enrico Bertini",
      "start": 1300600,
      "text": "Chipotle. Which is hard. How do you get this data? And I guess there are instances where finding data is probably straightforward than other cases where you have to, I don't know, maybe even give up.",
      "id": "ep_56_ut_86"
    },
    {
      "end": 1367224,
      "speaker": "Amanda Cox",
      "start": 1315078,
      "text": "Yeah, I think my favorite ones are where the data is not a struggle. Like, I'm totally uninterested for the most part, in data that, like, you can just. It's the result of your first Google search or whatever those are. Those are not our, you know, sometimes if you have something clever to say about it or some. Some news peg to attach it to or something, but those. The acquisition or the acquiring of the data, the figuring out what their fallback plan is for that one in particular. Kevin and I were teaching a class at NYU at the time, and our fallback. Fallback. Fallback plan was that that week's homework assignment was going to be to make all of our 20 students go figure out each are responsible for 20 people's Chipotle orders or something. So, yeah, I think engaging with the world and the most interesting data is probably not the data that. That comes up after your first Google search.",
      "id": "ep_56_ut_87"
    },
    {
      "end": 1375504,
      "speaker": "Enrico Bertini",
      "start": 1367384,
      "text": "So do you have any interesting story about data that has been particularly hard or, I don't know, fun to find?",
      "id": "ep_56_ut_88"
    },
    {
      "end": 1470194,
      "speaker": "Amanda Cox",
      "start": 1375624,
      "text": "Hard or fun, huh? Here's a fun one about sort of just acquiring with technology. A few years ago, I talked about this one a lot, but Sean Carter wanted to know where trailers come from in movies. So, you know, are the scenes in the trailer, do they come mostly from the beginning of the movie or the middle of the movie or the end of the movie? And so he had set up some code to, you know, essentially test it to reduce the images to, you know, their edges and then to just test, you know, does black and white from the trailer match the black and white stills from the movie? And one of them we were really struggling with was Argo. It was a best picture nominee. I think this was in 2013. And I assumed it was just because Sean's code was bad. Right. He'd never done edge matching before or image process, not a ton of image analysis. I just assumed he didn't know what he was doing or. The other problem was that the movies, we didn't have the movies from the most official sources in all cases, so who knows what was going on? But it turns out that the trailer for Argo, they're cheating in a few places. So, for example, there's a scene in the movie that shows the Hollywood sign in California, like, it looked like in the 1970s, the movie set in the 1970s, and it was falling down in disrepair. Like, half the letters were, like, on the ground but in the trailer, they just showed the Hollywood sign now, because all they want to do is read Hollywood. And then.",
      "id": "ep_56_ut_89"
    },
    {
      "end": 1473234,
      "speaker": "Moritz Stefaner",
      "start": 1470574,
      "text": "So they used scenes that were not in the movie, actually.",
      "id": "ep_56_ut_90"
    },
    {
      "end": 1496270,
      "speaker": "Amanda Cox",
      "start": 1474014,
      "text": "Yeah, but very similar. So there was one scene of people looking at a tv screen, and in the movie it was a woman who was a leader in Iranian hostage crisis who was in the tv screen, but in the trailer, they just swapped that for Jimmy Carter's face. Just because it reads better. It reads as seventies or Hollywood, not. It's like, what is that? I don't understand. Whatever. So that was a fun one.",
      "id": "ep_56_ut_91"
    },
    {
      "end": 1501404,
      "speaker": "Moritz Stefaner",
      "start": 1496462,
      "text": "Really thought about the trailer, all the sweated, all the details. Yeah. Nice.",
      "id": "ep_56_ut_92"
    },
    {
      "end": 1537314,
      "speaker": "Amanda Cox",
      "start": 1502224,
      "text": "I mean, it was a fun one in that we learned things through the acquisition of data that I don't think we would have learned if we could have just called up a publicist and said, like, tell me where the trailer comes from. Like, what scenes in the movie does it come from? But then, so, you know, Sean has acquired some of these image processing skills. And so then we applied them to a story about forgery in chinese art, you know, a couple, a year later or six months later or something. And so I thought it's both a fun example of acquisition and also the tools influencing the kind of. Or your skillset influencing the kind of work that you do.",
      "id": "ep_56_ut_93"
    },
    {
      "end": 1547298,
      "speaker": "Moritz Stefaner",
      "start": 1537474,
      "text": "Yeah. And then technology also becomes your journalistic tool, more or less, to actually find something out, which is pretty cool.",
      "id": "ep_56_ut_94"
    },
    {
      "end": 1548054,
      "speaker": "Amanda Cox",
      "start": 1547386,
      "text": "Yeah.",
      "id": "ep_56_ut_95"
    },
    {
      "end": 1556334,
      "speaker": "Enrico Bertini",
      "start": 1550954,
      "text": "And I think in the case of Chipotle, you ended up doing like scribbling something online.",
      "id": "ep_56_ut_96"
    },
    {
      "end": 1590038,
      "speaker": "Amanda Cox",
      "start": 1557094,
      "text": "No. One of our colleagues, Ellen McLean, had gotten a huge dataset from Grubhub for a different story, for just like an enterprise project several years earlier. So Alan had not worked at the Times for maybe three years by the time we ran the Chipotle graphic. But when we couldn't get data from an official source, we said, well, we have this huge data that Alan got just lying around that we never done anything with. And there were thousands of Chipotle orders in that dataset.",
      "id": "ep_56_ut_97"
    },
    {
      "end": 1656854,
      "speaker": "Moritz Stefaner",
      "start": 1590166,
      "text": "That's a good time to take a little break and talk about our sponsor this week. This week, data stories is supported by Tableau software, helping people see and understand their data. Tableau lets people connect to any kind of data and visualize it on the fly. Databases, spreadsheets, and even big data sources are easily combined into interactive visualizations, reports and dashboards. In the latest version, Tableau nine, you'll find features that make the product smarter about what you are doing from a new start experience with data prep tools to more analytics features and smart maps with geographic search, and across the entire analytical flow, they have invested really heavily in performance and new features to help you share your findings and collaborate with data. So what is your data trying to tell you? To find out, get your free trial@Tableau.com. Datastories. That's Tableau.com Datastories. And now back to the show.",
      "id": "ep_56_ut_98"
    },
    {
      "end": 1685624,
      "speaker": "Enrico Bertini",
      "start": 1657514,
      "text": "So, shall we read some of the questions that our listeners posted? There are some interesting ones, maybe some of the stuff we covered already. Yeah, that's a good one. I think this is from Mushon. So Amanda Cox said, annotation is the most important thing we or they at New York Times graphics do. Can annotation itself become interactive?",
      "id": "ep_56_ut_99"
    },
    {
      "end": 1698044,
      "speaker": "Amanda Cox",
      "start": 1685964,
      "text": "So I think probably the most consequential graphic of all time has interactive annotation. Do you know which one I'm talking about? Do you have a guess?",
      "id": "ep_56_ut_100"
    },
    {
      "end": 1700124,
      "speaker": "Moritz Stefaner",
      "start": 1698544,
      "text": "Interactive annotation?",
      "id": "ep_56_ut_101"
    },
    {
      "end": 1707084,
      "speaker": "Enrico Bertini",
      "start": 1701424,
      "text": "Yeah, I think it depends what interactive annotation means. I'm not even sure.",
      "id": "ep_56_ut_102"
    },
    {
      "end": 1740478,
      "speaker": "Amanda Cox",
      "start": 1708384,
      "text": "So I want to claim that the GPS dot on your Google map, or whatever it is, is the ultimate important and actually changing the world, uh, kind of version of interactive annotation. Uh, and then if you don't buy that that is real annotation, then I can say, well, you know, Google will let me know in text on the map that you have a restaurant reservation here tonight or not, because I told Google, but just because it's in my email. And so I think for sure, uh, that is an annotation.",
      "id": "ep_56_ut_103"
    },
    {
      "end": 1743758,
      "speaker": "Moritz Stefaner",
      "start": 1740526,
      "text": "Like, you mean the blue dot, right? Like where you are, right?",
      "id": "ep_56_ut_104"
    },
    {
      "end": 1747164,
      "speaker": "Amanda Cox",
      "start": 1743886,
      "text": "Yeah, yeah, the, where you are. Yeah, I think.",
      "id": "ep_56_ut_105"
    },
    {
      "end": 1747804,
      "speaker": "Moritz Stefaner",
      "start": 1747214,
      "text": "Sure.",
      "id": "ep_56_ut_106"
    },
    {
      "end": 1781394,
      "speaker": "Amanda Cox",
      "start": 1748944,
      "text": "And I think it's super interactive. Right. You move and it updates. So I think that's the people are doing. So if you think that's cheating, I think there's lots of other examples, too. So Jake Barton and some of his museum work is doing this kind of cool stuff where they are trying to teach kids about physics. And so essentially how it works is the kids just do whatever they want, and then they draw stylized lines on top of the path of the ball they threw automatically.",
      "id": "ep_56_ut_107"
    },
    {
      "end": 1820436,
      "speaker": "Moritz Stefaner",
      "start": 1782214,
      "text": "Yeah. So that's basically dynamic annotations maybe, right. It's like you don't just have, like, a static text pinned to a position in the graphic, but somehow you're reacting to what the user does or what the context is of an information query, and then you construct an annotation. Right. So you also recently had this article where the. The content, well, actually the text contents of the whole article changed depending on the user selection in a map right. Can you tell us a bit more about. I don't, I can't recall how much you involved in that project, but it was a New York Times project for sure.",
      "id": "ep_56_ut_108"
    },
    {
      "end": 1936594,
      "speaker": "Amanda Cox",
      "start": 1820460,
      "text": "Yeah. So, yeah. Kevin and Gregor and I and some others, Matthew Black and some of our colleagues in INt worked on a map about essentially what are good places and bad places for kids to grow up. So if you have to grow up poor, if you grow up in some places, you end up doing better on average than you would if you had grown up in a different place. And so I think we know, or we suspect that if we just show people a Us county map, the way you interpret it is, you see, like, oh, what does my county look like? And then learn about the broader world first. So we decided to sort of invert it on this one and say, like, let's not show you the map and force you to interact with it. Like, in some ways just get rid of interaction altogether and say, let's just guess about what you care about most based on where you're reading this from. So we'll geolocate where you're reading from and just show you a very zoomed in map for your area and then update the text in a relatively straightforward way. So I don't know if I consider that example annotation. But then after we did that one, we did another one off of the same research where we asked people to draw a chart for us and we talked about annotating that drawing. We talked about annotating that drawing as you were drawing it directly in the chart. But there's just to tell you, here's what you're doing. We could have, but the problem is there's no space for the annotation on mobile. Mobile has killed annotation in some ways. You just don't have room to say anything interesting. And so we killed that idea and just put the same text that we would have essentially put on your drawing inside of it, pointing to something just below, but also a little bit dynamic. I wouldn't call either of these super dynamic. There's baked out combinations.",
      "id": "ep_56_ut_109"
    },
    {
      "end": 1952366,
      "speaker": "Moritz Stefaner",
      "start": 1937174,
      "text": "Yeah, but it was fairly sophisticated. I remember Gregor posted part of the logic sometime on Twitter and they were like, 1015 different categories of curves you try to identify. Like, is it more s shaped or is it consistently below or above?",
      "id": "ep_56_ut_110"
    },
    {
      "end": 1966502,
      "speaker": "Amanda Cox",
      "start": 1952430,
      "text": "Yeah, there were ten or 15 different types of curves. There were basically three types of lines and then some four types of lines and then some edge cases about whether you did weird stuff at the beginning or the end of your line. So it wasn't so crazy complicated.",
      "id": "ep_56_ut_111"
    },
    {
      "end": 1980054,
      "speaker": "Moritz Stefaner",
      "start": 1966558,
      "text": "Yeah, I think it was fairly dynamic. Tell us more about the project. I think it's been a super surprising and extremely fun project, and not all of our listeners might know the basic idea behind it.",
      "id": "ep_56_ut_112"
    },
    {
      "end": 2084380,
      "speaker": "Amanda Cox",
      "start": 1980214,
      "text": "Oh, sure. So there's these researchers at Harvard on this one, and they have this amazing data set. I would give two of my left fingers for this data about how much people earn, and they've been able to link that to their parents earnings for basically everyone in the United States who's around my age. So who's around, you know, 30, 35. And so this data, the drawing example was, what's the chance that you go to college, depending on your parents income or your parents income rank, too. So, you know, if you were raised in the 25th percentile family, you have this percent of chance of going to college. And the chart is just, just amazing. And so part of the reason it's cool is because they have so much data. Lots of people have done this exercise for quartiles or quintiles, but that's, you know, you get four data points, five data points. It's not, it's not that sexy, but so they have, you know, they did it for every percentile. So they have 100 data points, and they form, essentially a perfectly straight line, which I find just mind blowing. The idea that, you know, it's, there's some, you know, you know, of course it's averages, and there's a lot of variation in between. But on average, the power of classes is so straight, right? Like, it doesn't top out. The difference between being raised in the 10th percentile and the 20th percentile is the same as the difference between being raised in the 80th and the 90th, which I find just like a crazy idea. But then the question is, like, how do we make this chart that's a straight line? And some people, like, be excited about this, have your mind be blown about, because it's just a stupid, you know, it's just, it's perfectly straight.",
      "id": "ep_56_ut_113"
    },
    {
      "end": 2090020,
      "speaker": "Moritz Stefaner",
      "start": 2084412,
      "text": "It's not that interesting, and it's actually exciting statistically. But it doesn't look exciting, right?",
      "id": "ep_56_ut_114"
    },
    {
      "end": 2117682,
      "speaker": "Amanda Cox",
      "start": 2090212,
      "text": "Yes, exactly right. Like, it's like, it's like, the fact that it is linear is amazing to me. You know, linear throughout the whole income spectrum, you know, not basically linear in the middle, but just linear, linear, linear, linear. I think it was actually, you know, Kevin's idea. He was like, well, what if we just ask, like, famous people, you know, smart, famous economists to do it for us? He had a couple in particular he was thinking about. But then that just evolved into, like, what if we just ask everyone to do it? So.",
      "id": "ep_56_ut_115"
    },
    {
      "end": 2125978,
      "speaker": "Moritz Stefaner",
      "start": 2117858,
      "text": "Yeah, because if you had asked celebrities or, like, you know, famous people, it's sort of shaming, then, you know, like, oh, they are so wrong. Right.",
      "id": "ep_56_ut_116"
    },
    {
      "end": 2126418,
      "speaker": "Amanda Cox",
      "start": 2126106,
      "text": "Sure.",
      "id": "ep_56_ut_117"
    },
    {
      "end": 2181162,
      "speaker": "Moritz Stefaner",
      "start": 2126466,
      "text": "And if you try it yourself, I think, what's so smart about it? So the site asks you to draw the curve. What do you think? Like, how is the curve looking? And then comments on that and shows you the real curve, but also shows you how others have drawn. So it's not just presenting you with facts, but first of all, asks a question that really forces you to think through, like, what is my model like? You know, can I develop a model in my head now of how I think the world works in this little, like, question and then also compare that, like, to how other people think and so on. And I think that this type of knowledge sticks so well, right, where you actually had to, where you were, like, hypothesizing yourself, like, how could it be? Is it like an s curve or is it like exponential? You know, and suddenly you learn so much about statistics because you have to apply it yourself. Right?",
      "id": "ep_56_ut_118"
    },
    {
      "end": 2211004,
      "speaker": "Amanda Cox",
      "start": 2181338,
      "text": "Yeah. There's some cognitive psychology. I tried for like a half hour before we published this project to find it and to say, you know what? People who do this professionally actually think about this sort of stunt. And I didn't come up with anything great. But after we published, there were some education professors and others who, talking amongst themselves on Twitter, were passing around some interesting papers about how it's, in a lot of teaching, it's better to actually get it wrong first, struggle with it and then fix it at the end.",
      "id": "ep_56_ut_119"
    },
    {
      "end": 2255464,
      "speaker": "Moritz Stefaner",
      "start": 2212584,
      "text": "And often people have this idea that then you have the wrong conceptual idea in mind. But I absolutely agree. In my experience, if you ever actually struggling with something and then finally you succeed or, you know, or finally you figure it out that it's there and it doesn't go away anymore. Yeah. Jake Barton, I also saw, he had this really nice slide. I just saw the photo of the slide. But it was also about this phenomenon that if you tell people the answer straight away, like, if you just present facts, you know, then people forget the question. And actually the question is the whole, the exciting part. Right? It's like, yeah, if you just answer this question straight away, the question itself becomes totally irrelevant. Yeah. It's solved.",
      "id": "ep_56_ut_120"
    },
    {
      "end": 2264344,
      "speaker": "Enrico Bertini",
      "start": 2258804,
      "text": "Which has quite a lot of implications on the way we teach in general, I guess.",
      "id": "ep_56_ut_121"
    },
    {
      "end": 2269744,
      "speaker": "Moritz Stefaner",
      "start": 2266284,
      "text": "So many. How many responses did you get? It was quite a lot. Right?",
      "id": "ep_56_ut_122"
    },
    {
      "end": 2294168,
      "speaker": "Amanda Cox",
      "start": 2270084,
      "text": "Yeah. So I think I forget how many. So we have. We're saying, I think, 100,000 people, roughly on the version of the graphic that we publish right now. But that's only people who were logged in and registered. We did something a little bit different with people who were anonymous. So logged in and registered plus anonymous is a lot bigger than that. So hundreds of. Wow.",
      "id": "ep_56_ut_123"
    },
    {
      "end": 2300724,
      "speaker": "Moritz Stefaner",
      "start": 2294216,
      "text": "Wow. So actually, you could now do a whole social study on how people think reality is.",
      "id": "ep_56_ut_124"
    },
    {
      "end": 2306454,
      "speaker": "Amanda Cox",
      "start": 2301264,
      "text": "We did, Kevin did do a follow up post the next about, you know, what people.",
      "id": "ep_56_ut_125"
    },
    {
      "end": 2308334,
      "speaker": "Moritz Stefaner",
      "start": 2306834,
      "text": "That's for sure, what people thought.",
      "id": "ep_56_ut_126"
    },
    {
      "end": 2312058,
      "speaker": "Enrico Bertini",
      "start": 2309714,
      "text": "So shall we read another question?",
      "id": "ep_56_ut_127"
    },
    {
      "end": 2312814,
      "speaker": "Moritz Stefaner",
      "start": 2312146,
      "text": "Yes.",
      "id": "ep_56_ut_128"
    },
    {
      "end": 2333372,
      "speaker": "Enrico Bertini",
      "start": 2314474,
      "text": "Okay. We have some few ones from Scott Murray. So let's start from the first one. How has launch of upshot New York Times changed your workflow? And I think there is another one that is similar to that. Probably we can group them together.",
      "id": "ep_56_ut_129"
    },
    {
      "end": 2482612,
      "speaker": "Amanda Cox",
      "start": 2333498,
      "text": "Yeah, sure. So the upshot is sort of like a section at the New York Times. I guess in some ways, it has a handful of reporters attached to it, people who are experts in the economy or politics or healthcare or gender and technology. And so we're, you know, a relatively small section within the times. And so I've been attached to it for, for about a year and a half now. One of the ways where I say it's changed things for me, I'll tell you, tell you an anecdote, is that I like to say, like, we have a little bit more freedom to what I sometimes call, like, making things up. And David Leonhardt, who's the editor of the upshot, he hates when I say that. He calls it analytical judgments. And so you can tell why, why one of the two of us used to be the Washington bureau chief of the New York Times, and one of us is, one of us is a graphic sensor. But I think we have a little bit more freedom in making some of these analytical judgments. So the example, or one of the examples that I'm proud of is on election night, you know, we're sort of doing a little bit of live analysis of the results as they came in to say, you know, like, given what we know so far, here's how we think the night might end up. Like that kind of an exercise is one of the ways, I think the upshot is maybe a little bit different. The other way, obviously, Gregor made us, made the times, this tool called Mister chartmaker, that enables reporters, and the upshot reporters are the ones who get access to this tool to make their own charts, to essentially say, if you want to put a bar chart in your story, that's great. But I don't want to spend my afternoon on it. And so that has changed, I think, our interactions in some way. So both in good and bad ways. Right. Like the good way, obviously, they do not interrupt me when they want a bar chart in their story. And the bad way, I think we sometimes miss some opportunities that graphic senators and other sections would have picked up on about. Like here you have a stub of an idea, and that would result in a totally different idea that I can make something really cool out of. But that is one way the upshot works differently than the rest of the times. Right.",
      "id": "ep_56_ut_130"
    },
    {
      "end": 2531654,
      "speaker": "Moritz Stefaner",
      "start": 2482628,
      "text": "Now, how do you see this developing? There's also, of course, 538, Nate Silver's maybe similar data journalistic publication. And then there's the upshot. These are, I guess, the two big data journalistic platforms at the moment. Right. And how do you think, will this develop? Will they stay the same in character as they are now? Does that affect also maybe, like, do you do now all the data heavy stuff and the New York Times becomes a bit more lighter in data? Or how do you think this relationship will develop? Is it not at all, but just different presentation, or how do you see the relationship?",
      "id": "ep_56_ut_131"
    },
    {
      "end": 2572964,
      "speaker": "Amanda Cox",
      "start": 2531994,
      "text": "Yeah, I don't think upshot graphics are aggressively different from, or even different at all from the rest of the New York Times graphics. I also think that most data journalism is sort of a, how do I say this in a polite way? I think data journalism is successful when you don't need the adjective. So, you know, I've said before that, like, the more adjectives you have, like, the less power you have, right? Like, you never want to be like the assistant deputy vice president or whatever. Or you know that, like, you know that gay marriage is real when it's just marriage, right? When you don't need the adjective in front of it. So I think data journalism is only successful when it's, when it's indistinguishable from journalism journalism.",
      "id": "ep_56_ut_132"
    },
    {
      "end": 2585384,
      "speaker": "Moritz Stefaner",
      "start": 2574504,
      "text": "But still, I mean, upshot and 538, they have a data flavor to them. And I think that's, that's the idea, right? It's like, these are data ish outlets, right?",
      "id": "ep_56_ut_133"
    },
    {
      "end": 2632954,
      "speaker": "Amanda Cox",
      "start": 2585804,
      "text": "Yeah. I think that is, you know, Nate Silver's conception of journalism is that, you know, the journalism that he is good at is very data focused. I think that upshot has many reporters who are on the spectrum of that attitude, though obviously believe that, you know, I'm basically indifferent to the mechanism behind your story, right? Like, I always think, for example, like, you know, whenever a New York Times story has to tell you how many interviews it conducted. Like, to me, that's an inner signal to stop reading, right. If you have to say, like, the time spent six months talking to 85 people, that's just saying, like, and we didn't find anything. So we just have to impress you by, like, how much Harvey tried, tried.",
      "id": "ep_56_ut_134"
    },
    {
      "end": 2635130,
      "speaker": "Moritz Stefaner",
      "start": 2632994,
      "text": "Really hard, but still didn't work.",
      "id": "ep_56_ut_135"
    },
    {
      "end": 2660274,
      "speaker": "Amanda Cox",
      "start": 2635322,
      "text": "Yes. Right. Because if you found something cool, you would just tell me the cool thing. You wouldn't tell me that, like, we had to talk to 85 people, you know, like, whatever. And so I feel the same way about, like, data. Like, I don't care really, like, how you get to truth if it comes from quotes or if it comes from a spreadsheet or whatever. Like, I find that to be not the really interesting part. Like, the how. The how part I think is, like, not, I don't care that much about it.",
      "id": "ep_56_ut_136"
    },
    {
      "end": 2675714,
      "speaker": "Moritz Stefaner",
      "start": 2661574,
      "text": "But that means you trust your journalists quite well, right? Like, if you say, well, the exact method, I don't even want to go there, or I don't even want to know how large the sample size was because I trust these people.",
      "id": "ep_56_ut_137"
    },
    {
      "end": 2709764,
      "speaker": "Amanda Cox",
      "start": 2676374,
      "text": "No, I think you still have to, you know, you're still showing it's a different type of evidence. Right. Like, I'm saying that I've not, by default, I don't value some types of evidence more than other types of evidence. Right. Like, you still need to lay out your case about why, you know, why this is a proper view of the world and why these people know what they're talking about and how this data was collected. Methodological issues, you know, you still are doing, you know, you're arguing with evidence. But I don't think there are certain types of evidence that on their face are, you know, blanketly better, you know, for certain types of problems, sure.",
      "id": "ep_56_ut_138"
    },
    {
      "end": 2730396,
      "speaker": "Moritz Stefaner",
      "start": 2709884,
      "text": "But no, sure, you could have like a million data points, be horribly wrong. Like, and even, you know, you do the right thing. Technically, yeah, but there's like, this huge bias in the data set or you totally missed one obvious, like, yeah, just flaw, and then the whole thing breaks down. You can have millions of data points.",
      "id": "ep_56_ut_139"
    },
    {
      "end": 2752720,
      "speaker": "Amanda Cox",
      "start": 2730580,
      "text": "Or it doesn't really mean what you think it means. So yesterday, behind me, Jeremy Ashkenas was looking at hate crimes reported in the United States. And different jurisdictions do it differently. So apparently there was only one in the state of Mississippi for a whole year. So, you know, like, it's not, the data isn't actually about hate crimes. It's about the reporting of hate crimes. So, you know, like, all of those.",
      "id": "ep_56_ut_140"
    },
    {
      "end": 2770124,
      "speaker": "Moritz Stefaner",
      "start": 2752752,
      "text": "Kind of issues how do you deal with that? Like, how much do you think about what will people think when they read that? As opposed to you knowing something is factually right? Like, have you ever stopped the factually right stories because you had the feeling people might get it wrong?",
      "id": "ep_56_ut_141"
    },
    {
      "end": 2793148,
      "speaker": "Amanda Cox",
      "start": 2771624,
      "text": "Sure. Or I'm trying to think of a good example, but I'm sure there are. Yeah, sure. I think in odd ways about, like, that's not how I actually interpret this or. Hmm. I'm trying to think of a good example. I don't have one off the top of my head, but, yeah, I mean, the interpretation of it is super important.",
      "id": "ep_56_ut_142"
    },
    {
      "end": 2847580,
      "speaker": "Moritz Stefaner",
      "start": 2793236,
      "text": "Yeah, yeah, yeah. I just had to think of, like, the guardian had like a actually quite nice interactive application where they would show all the. Well, nice. In this context, not a good word, but it was about police killings and, like, who, you know, who was killed by police. And technically they had all the statistics. Right. But for instance, they just reported the percentages of victims and then the race or the ethnicity. Yeah, but it would probably have made more sense to relate that to the share of population as well. Like, you know, so. Because in their data, it sounded like there's not many Hispanics and many blacks affected, but if you would relate it to the actual share in that population of that ethnicity, it's much higher. So, yeah, these are all these things, like, if you just report the numbers and you're not super careful about how they will be read, then you're in trouble.",
      "id": "ep_56_ut_143"
    },
    {
      "end": 2857496,
      "speaker": "Enrico Bertini",
      "start": 2847772,
      "text": "Yeah. And even then it wouldn't be perfect because the process behind data collection for these kind of data sets is very complicated.",
      "id": "ep_56_ut_144"
    },
    {
      "end": 2858484,
      "speaker": "Moritz Stefaner",
      "start": 2857560,
      "text": "Right, right.",
      "id": "ep_56_ut_145"
    },
    {
      "end": 2868744,
      "speaker": "Enrico Bertini",
      "start": 2858784,
      "text": "There are huge biases in how things are reported. Yeah. Should we continue with the questions?",
      "id": "ep_56_ut_146"
    },
    {
      "end": 2870004,
      "speaker": "Moritz Stefaner",
      "start": 2868784,
      "text": "More questions. Yes.",
      "id": "ep_56_ut_147"
    },
    {
      "end": 2884314,
      "speaker": "Enrico Bertini",
      "start": 2871024,
      "text": "So, yes, two more. One is, I don't know exactly what he means, but he just says, thoughts on teaching? I don't know if it means. Yeah. How to teach visualization or something like that.",
      "id": "ep_56_ut_148"
    },
    {
      "end": 2966752,
      "speaker": "Amanda Cox",
      "start": 2885334,
      "text": "I think you may know. A couple weeks ago was at IO, and we walked back at night, like the nighttime venue was like a half hour away from the hotel. And we walked back together one night, and I was telling him the story about. So Kevin and I. Kevin Quailey and I teach a class at NYU in the journalism program. Sometimes science, sometimes studio 20, sometimes other things about data, largely. I wouldn't call it data visualization necessarily, but I was telling him that I think the days that we go in, like, totally unprepared, not totally unprepared, we go in like a surgeon. Right? Like, we call it, like, going in like, you know, like, I've prepared my whole life for this, so I just show up to do what I tried to do. Those days, I think I have a tendency to be like, way better classes, like, both more fun, both more pedagogically engaging. Both people actually learn things more than days where I spend like 4 hours preparing some guided bullet point tutorial, classically super prepared. So I was telling him that I find there's this interesting thing. It's inversely how much you prepare on paper to how good it is, which is maybe he actually wanted a straight answer about teaching, but that's what I think of. That's what I think of in the last week when I think of.",
      "id": "ep_56_ut_149"
    },
    {
      "end": 3032384,
      "speaker": "Enrico Bertini",
      "start": 2966848,
      "text": "No, but I have to say this totally resonates with my experience as well. I mean, as soon as I just try to be the professor and just spreading my wisdom through the classroom, it just doesn't work. Right. But if you manage to start with a couple of interesting questions and you make it clear that not necessarily you already know the answer, it's just an exercise that we are doing together, then everything gets so much more interesting. I have to say, for instance, in my, I've been teaching my visualization course three or four times already. And the part where I see my students learning a lot is really like when they show me what they've done, I sit next to them and I say, hey, look, you should have. Maybe you should try this and that. And they learn so much faster this way. Whereas if I present slides for ten days and then I ask a question, I'm always disappointed by the answer. Right. So I think that's a very interesting thing that happens when you teach visualization. And probably it's not only with visualization that this happens.",
      "id": "ep_56_ut_150"
    },
    {
      "end": 3033284,
      "speaker": "Amanda Cox",
      "start": 3032544,
      "text": "Yeah.",
      "id": "ep_56_ut_151"
    },
    {
      "end": 3039324,
      "speaker": "Enrico Bertini",
      "start": 3034784,
      "text": "And the next question was, how to tolerate Kevin Quilly.",
      "id": "ep_56_ut_152"
    },
    {
      "end": 3041200,
      "speaker": "Amanda Cox",
      "start": 3040184,
      "text": "It's a great question.",
      "id": "ep_56_ut_153"
    },
    {
      "end": 3044564,
      "speaker": "Enrico Bertini",
      "start": 3041232,
      "text": "Poor Kevin. We should have him on the show sometime.",
      "id": "ep_56_ut_154"
    },
    {
      "end": 3099350,
      "speaker": "Amanda Cox",
      "start": 3045384,
      "text": "Kevin and I say that all of the bad parts of ourselves are the same. And then. So there, there are also, you know, Kevin has many good parts that are unique for me, but all of the bad parts of us are exactly the same. And so I tolerate him. But we also. So we used to joke for a long time when we disagreed about something that there would be a chapter in our memoirs called disagreements. Right. But lately, lately that joke has evolved into, like. So it's no longer just a chapter in our memoirs. I think our memoirs now is just titled disagreements. And so it's like, you know, chapter, we'll stick this in chapter four of, you know, not or chapter seven or, you know, so it's no. So Kevin and I were both attached to the upshot. We sit, you know, two and a half feet from each other. We teach together. My. So Kevin is. Kevin is a good friend of mine, so.",
      "id": "ep_56_ut_155"
    },
    {
      "end": 3129364,
      "speaker": "Enrico Bertini",
      "start": 3099382,
      "text": "But on a little, little more serious note. So you've been talking about disagreeing on something. I'm just wondering now. I guess it happens sometimes, maybe even often, that during the process of creating a new piece, you disagree. So not just you and Kevin, I think in general. So what kind of disagreements you guys have? Is it more on the story itself, on the interpretation, on the way to visualize something? I'm just curious about that.",
      "id": "ep_56_ut_156"
    },
    {
      "end": 3141684,
      "speaker": "Amanda Cox",
      "start": 3129534,
      "text": "Yeah. So Kevin likes video. I hate video. Kevin, I like complicated things. Kevin likes tables. What else? What are the other classic ones?",
      "id": "ep_56_ut_157"
    },
    {
      "end": 3145124,
      "speaker": "Moritz Stefaner",
      "start": 3143184,
      "text": "You can make a complicated table?",
      "id": "ep_56_ut_158"
    },
    {
      "end": 3154836,
      "speaker": "Amanda Cox",
      "start": 3147664,
      "text": "Complicated tables are the worst kind of tables, right? If you're gonna make a table, just make a table. That's like the worst position to be in.",
      "id": "ep_56_ut_159"
    },
    {
      "end": 3158724,
      "speaker": "Enrico Bertini",
      "start": 3154960,
      "text": "Do you guys have any favorite chart? Chart type?",
      "id": "ep_56_ut_160"
    },
    {
      "end": 3220654,
      "speaker": "Amanda Cox",
      "start": 3158764,
      "text": "I mean, we're calling 2015 the year of the histogram. I think the histogram is an interesting example of how defaults matter a ton in software. So, you know, histograms, they teach them in kindergarten. Like, no joke. That's one of the first charting forms you ever experience. You know, how many of us are six? How many of us are seven, whatever, right? And then they die at some point. And I think part of the reason they die is because it's not easy to make a histogram in excel. And so I think the histograms are a fun example of ways defaults in software change people's approach to the world, even when they're not necessarily aware of it or not necessarily biased against histograms. Just biased because it's hard. In the same way that, like, for a long time I was, you know, biased against bezier curves because they weren't trivial in r for, you know, kind of like how, how defaults influence what you think about.",
      "id": "ep_56_ut_161"
    },
    {
      "end": 3247614,
      "speaker": "Enrico Bertini",
      "start": 3221034,
      "text": "Yeah. And I'm curious to hear from you, what's your take on complicated charts or more than complicated type of charts that may be effective, but people don't know how to interpret right away? I think there are a quite solid set of charts that you can expect people to understand, at least to some extent, and some other chart types that people have probably never seen. Right. So how do you handle that?",
      "id": "ep_56_ut_162"
    },
    {
      "end": 3289122,
      "speaker": "Amanda Cox",
      "start": 3248394,
      "text": "You probably know I say it a lot, but I'm a fan of maximizing what I call net joy. So if you cause, like, one person, infinite joy or understanding or whatever with your chart, and, like, the rest of the world is numb to it. It's possible that that is better than, you know, just doing something that, like, almost all of the world is, like, slightly above numb to. And so I, in the maximization problem that is these decisions, I'm a fan of arguing for net, and whereas a lot of people, I think, are fans of arguing for minimum, and that difference between net and minimum, I think, changes a lot of how you think about things.",
      "id": "ep_56_ut_163"
    },
    {
      "end": 3292854,
      "speaker": "Moritz Stefaner",
      "start": 3289258,
      "text": "Yeah. You can easily show that in a histogram, by the way.",
      "id": "ep_56_ut_164"
    },
    {
      "end": 3295894,
      "speaker": "Amanda Cox",
      "start": 3293154,
      "text": "Yes, very much so. Yeah.",
      "id": "ep_56_ut_165"
    },
    {
      "end": 3302650,
      "speaker": "Moritz Stefaner",
      "start": 3297114,
      "text": "That's great. Shall we come to Lynn's questions?",
      "id": "ep_56_ut_166"
    },
    {
      "end": 3304250,
      "speaker": "Enrico Bertini",
      "start": 3302842,
      "text": "Let's go there.",
      "id": "ep_56_ut_167"
    },
    {
      "end": 3313374,
      "speaker": "Moritz Stefaner",
      "start": 3304322,
      "text": "Yeah. The first one was, Amanda, do you have any burning topics of interest that you would like to work on but you cannot get the data for it?",
      "id": "ep_56_ut_168"
    },
    {
      "end": 3348560,
      "speaker": "Amanda Cox",
      "start": 3314974,
      "text": "Sure. So, I mean, I think I said this earlier, that data that is really great data is not on the Internet. And so I think I'm interested in all kinds of data. That's the proprietary data that people actually make decisions off of, whether that's your Walmart, target, Google, driverless cars, slash medical policy, whatever, all of that kind of stuff. Like, you know, any data that people actually make actionable decisions off of is stuff that I think I'm kind of jealous of.",
      "id": "ep_56_ut_169"
    },
    {
      "end": 3359244,
      "speaker": "Moritz Stefaner",
      "start": 3348632,
      "text": "But let's say you were working then at Uber, or, you know, some other company that has, like, super deep, interesting data. Wouldn't you then be bored? Because then it's also, like, readily available and just too easy to get.",
      "id": "ep_56_ut_170"
    },
    {
      "end": 3381400,
      "speaker": "Amanda Cox",
      "start": 3360064,
      "text": "Maybe. Or, you know, after six months, maybe. Right? Like, you run out of. You're like, oh, but then it stops being like, Uber. It's like you're like, oh, my Uber grader is great, but it'd be really great if I can merge it with proprietary data from whatever other place. So it's always like, you're always attracted to what you can't have, right?",
      "id": "ep_56_ut_171"
    },
    {
      "end": 3398558,
      "speaker": "Moritz Stefaner",
      "start": 3381512,
      "text": "It's like the grass, the data sets you can easily find on the Internet. Are you not interested because you would assume they have been explored already sufficiently, or the low hanging fruit is maybe already done? Or is it more?",
      "id": "ep_56_ut_172"
    },
    {
      "end": 3401086,
      "speaker": "Amanda Cox",
      "start": 3398646,
      "text": "I mean, that's not entirely part of.",
      "id": "ep_56_ut_173"
    },
    {
      "end": 3403154,
      "speaker": "Moritz Stefaner",
      "start": 3401110,
      "text": "The whole experience for you.",
      "id": "ep_56_ut_174"
    },
    {
      "end": 3433452,
      "speaker": "Amanda Cox",
      "start": 3404734,
      "text": "I'm exaggerating when I say that, but some of all of those things, a lot of my best work probably really is commodity data. So I don't know what data stories episode. It was the video one where you talked about Gregor, about 3d yield curves. That data is all just sitting on the Internet. I still think that's a cool chart. And so, you know, I'm being unfair when I say data on the Internet isn't cool, but yeah.",
      "id": "ep_56_ut_175"
    },
    {
      "end": 3447184,
      "speaker": "Moritz Stefaner",
      "start": 3433508,
      "text": "Yeah. And Lynn had a second tweet. Another big question. What are the current hard problems you see in viz, beyond visualizing uncertainty, which is sort of the default answer to that?",
      "id": "ep_56_ut_176"
    },
    {
      "end": 3536324,
      "speaker": "Amanda Cox",
      "start": 3448084,
      "text": "Yeah. I mean, I think in part forcing ourselves to work on problems that actually matter is not the easiest thing. And I was trying to think about why that is any different for visualization than for anyone else in the world. Because they're hard. Because whatever. But I think there is something interesting about the visualization and that by default, the really easy stuff for us is the questions about what and where and when. Visualization of different types is really good at answering those kind of questions. But the why and the how questions, I think, are always, like, way more interesting and important. But in visualization, those kind of devolve into unfun things because they're either, you know, they're estimates then, so you don't resonate with what the units are or whatever. And so I think there's some. But the, the why and the how questions are always way better questions, you know, questions that have consequences and questions that matter to the world. And so I don't know, there's some like eyes on the prize thing. I think that is difficult about visualization because, you know, the, ends up that the, you know, the best answer for guiding policy or whatever is really the best form for that is a, it's a bar chart or something, you know, with some uncertainty bands on it. But that's not necessarily the, you know, a two line bar chart is not like, doesn't, you know. Yeah, this is, by the way.",
      "id": "ep_56_ut_177"
    },
    {
      "end": 3538352,
      "speaker": "Enrico Bertini",
      "start": 3537144,
      "text": "Oh, sorry. Sorry.",
      "id": "ep_56_ut_178"
    },
    {
      "end": 3539568,
      "speaker": "Amanda Cox",
      "start": 3538488,
      "text": "No, go ahead.",
      "id": "ep_56_ut_179"
    },
    {
      "end": 3549360,
      "speaker": "Enrico Bertini",
      "start": 3539656,
      "text": "I was just saying that this is, by the way, where people fight the most. Right. On why and how things happen. Right.",
      "id": "ep_56_ut_180"
    },
    {
      "end": 3558564,
      "speaker": "Amanda Cox",
      "start": 3549552,
      "text": "Yeah. I mean, because it's, you know, there's, there's interpretation problems and there's estimation problems. But those are really the interesting questions, I think.",
      "id": "ep_56_ut_181"
    },
    {
      "end": 3572936,
      "speaker": "Moritz Stefaner",
      "start": 3559224,
      "text": "Yeah. And I mean, in many ways, maybe you need to think more in terms of illustration and explanation and storytelling and, you know, these types of things. If you. Yeah, the more you go into these, these how and why.",
      "id": "ep_56_ut_182"
    },
    {
      "end": 3585648,
      "speaker": "Amanda Cox",
      "start": 3573120,
      "text": "Sure. But then it's just this mushy thing, like this mushy universe that you invented in your head and there's like arrows flowing from who knows where to who knows where that, like, you know, has no, like, grounding in anything other than.",
      "id": "ep_56_ut_183"
    },
    {
      "end": 3595382,
      "speaker": "Moritz Stefaner",
      "start": 3585776,
      "text": "Exactly. And this is maybe why we dodged this a bit and just concentrate on the what? Because there we have. It's more like the home turf.",
      "id": "ep_56_ut_184"
    },
    {
      "end": 3597954,
      "speaker": "Amanda Cox",
      "start": 3595558,
      "text": "Yeah, it is what it is. Yeah.",
      "id": "ep_56_ut_185"
    },
    {
      "end": 3616934,
      "speaker": "Moritz Stefaner",
      "start": 3600294,
      "text": "So you mean the hard problems, actually, to be relevant. Could you actually say that, like, struggling with this? Okay, we can plot a lot of data. We can actually, like, analyze lots of data, but how. How can we make our work actually. Actually relevant?",
      "id": "ep_56_ut_186"
    },
    {
      "end": 3656954,
      "speaker": "Amanda Cox",
      "start": 3617914,
      "text": "Yeah, I think so. You know, I think it's a question people struggle with. And, you know, people are always pointing to, like, Jon Snow or something. He, you know, he didn't fix cholera with his map. That was marketing material. You know, totally. Like, he knew the answer and then he needed some marketing material. And so the, you know, the question is how can we. How can we work on problems that, you know, actually change, change thinking or change behavior or help us make better decisions or that, you know, eyes on the prize, kind of like, how do we work on stuff that's important, issues that are actually important as opposed to gravitate towards data that's readily available on the Internet or easy to, like, Fitzroy forums. We're interested. Well, whatever.",
      "id": "ep_56_ut_187"
    },
    {
      "end": 3669174,
      "speaker": "Enrico Bertini",
      "start": 3657774,
      "text": "So do you know, do you have any visualization in mind that can either come from New York Times or other sources that you think had some degree of impact on people's lives?",
      "id": "ep_56_ut_188"
    },
    {
      "end": 3683614,
      "speaker": "Amanda Cox",
      "start": 3670594,
      "text": "I'm going to go back to my, you know, the Google map. Right. Like, and the driverless cars that are going to result as exhaust from the Google map. I think it's going to save hundreds of thousands of people's lives.",
      "id": "ep_56_ut_189"
    },
    {
      "end": 3684734,
      "speaker": "Enrico Bertini",
      "start": 3683954,
      "text": "Yeah.",
      "id": "ep_56_ut_190"
    },
    {
      "end": 3690362,
      "speaker": "Amanda Cox",
      "start": 3686274,
      "text": "So it's not the actual visualization. It's not the looking at the Google map that doesn't.",
      "id": "ep_56_ut_191"
    },
    {
      "end": 3712256,
      "speaker": "Enrico Bertini",
      "start": 3690498,
      "text": "Yeah. The question of impact is always a tricky one because I am pretty sure that there are lots of things happening out there that we are just not aware of. Right. So, I mean, in a lot of organizations and even among scientists, there are lots of things happening that are at least partially done through visualization that have a strong impact, but we just don't know it.",
      "id": "ep_56_ut_192"
    },
    {
      "end": 3735116,
      "speaker": "Amanda Cox",
      "start": 3712320,
      "text": "Right, sure. And I think that probably the visualization that they're doing, not in all cases, but in many cases is not going to be. Is going to be the type of, like, you know, four lines. Four lines on a chart or that, you know, the most important sort of work is not always the most interesting visualization, I think.",
      "id": "ep_56_ut_193"
    },
    {
      "end": 3776894,
      "speaker": "Enrico Bertini",
      "start": 3735180,
      "text": "Oh, yeah, yeah, yeah, yeah. No, I have to say, I had a revealing moment some time ago. I think one year ago or so, I was giving a presentation here at NYU, and one of my colleagues from, I think he's a computer scientist, biologist. I was arguing that we don't know whether visualization is having an impact in some domains and so on, especially in science. Right. He was raising his hand and saying, wait a minute, I can give you so many examples in biology where visualization was part of the process and had a huge impact on people's discoveries and communication of scientific knowledge. So it's definitely not true. It's more like that. We, we just don't see these things.",
      "id": "ep_56_ut_194"
    },
    {
      "end": 3778494,
      "speaker": "Amanda Cox",
      "start": 3777714,
      "text": "Yeah.",
      "id": "ep_56_ut_195"
    },
    {
      "end": 3802574,
      "speaker": "Enrico Bertini",
      "start": 3781514,
      "text": "I think we have one last question. Right. So we have one from Petra Eisenberg. I'm not totally sure I understand the question completely. So Petra asks favorite design tools in the spectrum of data stories that offer free interpretation to unambiguous messages.",
      "id": "ep_56_ut_196"
    },
    {
      "end": 3866714,
      "speaker": "Amanda Cox",
      "start": 3804604,
      "text": "So I'm choosing to interpret that. And we are sorry, Petra, if we're wrong about what are the favorite design tools, ranging from kind of more exploratory graphics to more explanatory graphics. And I'm going to stick with r across the spectrum because it's time for more. It's to learn. I can't think of anything better at any point other than the very, very, very final end. I also, I think, you know, in the times there was a part where the explorer graphic, there was a phase three or four years ago where the explorer graphic was kind of popular. It was like we can put some filters and some sliders and some something. And that phase, I think we've grown out of that phase. We've grown up a little bit or phones have caused us to just disregard it a little bit. So I think we're, it's possible that I'm going to miss the exploratory tools just because we don't do very much of that work anymore for a variety of reasons.",
      "id": "ep_56_ut_197"
    },
    {
      "end": 3892194,
      "speaker": "Moritz Stefaner",
      "start": 3867254,
      "text": "Yeah. And also the tools market is really evolving. But as we said before, everybody has their tools that they are fluent with and that's such a huge value. If you have an environment that you're happy with and you can just work is such a big value. So I also feel like, yeah, we might be missing lots of great tools, so maybe we should have one day a show on all the new web based tools popping up and maybe we discover something new.",
      "id": "ep_56_ut_198"
    },
    {
      "end": 3920814,
      "speaker": "Amanda Cox",
      "start": 3892234,
      "text": "Who knows though, whenever, you know, academics in particular ask me what should they learn, what should they, I always say, like whatever it is that you're always already using. So I really hate context switching. So like people is a Stata, people make your graphs in Stata. And if you are people are our people, do it in r. And if your people are web development people just use your sketch in D3 or what? You know, like whatever. I feel like wherever you already are is the best tool.",
      "id": "ep_56_ut_199"
    },
    {
      "end": 3923414,
      "speaker": "Moritz Stefaner",
      "start": 3921834,
      "text": "So I won't learn r?",
      "id": "ep_56_ut_200"
    },
    {
      "end": 4000554,
      "speaker": "Amanda Cox",
      "start": 3923754,
      "text": "No, I don't know. I think in some ways some of the most interesting tool work that's going on right now, and this is also something that I should have said that different about the upshot earlier is I think we're integrating words not in a fancy design way, but just like, here's a paragraph, here's a chart, here's a paragraph, here's a chart. And so like the stuff that came out a couple weeks ago, I think, from, I'm going to say it wrong, Bestiario or whatever, like that quadrogram maybe it's called that idea that like we're really just using expository tools. And so you should be able to write your paragraph and dump your charts inside of it and then write your next paragraph and make a chart. And it shouldn't be like a bunch of switching or, you know, it shouldn't feel aggressively different. I think those kind of tools are interesting. You know, I know someone in, in Jeff Heer's group at the University of Washington who's working on more kind of Google Doc style creation of charts. So some of the collaborative stuff, like, not sort of like GitHub tag team kind of merge conflict, that will fix it, but real more Google Docs, the barriers over the lower end, it feels a little bit more collaborative. That stuff, I think is also interesting in the tools space.",
      "id": "ep_56_ut_201"
    },
    {
      "end": 4051574,
      "speaker": "Moritz Stefaner",
      "start": 4000894,
      "text": "Yeah, that's true. And Quadrigram.com, I found that really interesting too, because it offers simple charts, but it has this idea of, there's a document and the document consists of a mixture or sequence of simple blocks. Right. This is something I think we all now learn to appreciate with all the mobile devices and, you know, and all these different consumption situations. And we used to do this huge, monolithic, super detailed blocks. Yeah. That are super integrated, which is nice too, like, you know, double spread print page or something. But now we have to think more about how we can, how can we chop it up into sequences of little blocks. And quadrogram has a really interesting model there. So. Yeah, we should talk about that one maybe as well. Do you know how the tool from Jeff Heer's group is called? Is that something that's available or is it currently being.",
      "id": "ep_56_ut_202"
    },
    {
      "end": 4054814,
      "speaker": "Amanda Cox",
      "start": 4051654,
      "text": "I think it's someone's research project. I think it's someone's dissertation.",
      "id": "ep_56_ut_203"
    },
    {
      "end": 4056758,
      "speaker": "Moritz Stefaner",
      "start": 4054974,
      "text": "So it will come out at some point. Maybe.",
      "id": "ep_56_ut_204"
    },
    {
      "end": 4057674,
      "speaker": "Amanda Cox",
      "start": 4056806,
      "text": "Yeah, maybe.",
      "id": "ep_56_ut_205"
    },
    {
      "end": 4066794,
      "speaker": "Moritz Stefaner",
      "start": 4058054,
      "text": "Yeah. Sounds good too. Great. I think we have to wrap it up. We are good. Yeah. Over an hour was great talking to you.",
      "id": "ep_56_ut_206"
    },
    {
      "end": 4068154,
      "speaker": "Amanda Cox",
      "start": 4067134,
      "text": "Cut something.",
      "id": "ep_56_ut_207"
    },
    {
      "end": 4073886,
      "speaker": "Moritz Stefaner",
      "start": 4068894,
      "text": "We'll leave it all in there. Yeah, it was all good. Cool. Thanks so much.",
      "id": "ep_56_ut_208"
    },
    {
      "end": 4075230,
      "speaker": "Amanda Cox",
      "start": 4073910,
      "text": "Thanks for having me. Thank you.",
      "id": "ep_56_ut_209"
    },
    {
      "end": 4075702,
      "speaker": "Moritz Stefaner",
      "start": 4075262,
      "text": "Yeah, thanks.",
      "id": "ep_56_ut_210"
    },
    {
      "end": 4076398,
      "speaker": "Enrico Bertini",
      "start": 4075758,
      "text": "Thanks, Amanda.",
      "id": "ep_56_ut_211"
    },
    {
      "end": 4076774,
      "speaker": "Moritz Stefaner",
      "start": 4076446,
      "text": "Bye bye.",
      "id": "ep_56_ut_212"
    },
    {
      "end": 4077174,
      "speaker": "Enrico Bertini",
      "start": 4076814,
      "text": "Bye.",
      "id": "ep_56_ut_213"
    },
    {
      "end": 4078314,
      "speaker": "Amanda Cox",
      "start": 4077254,
      "text": "Bye bye.",
      "id": "ep_56_ut_214"
    },
    {
      "end": 4102224,
      "speaker": "Enrico Bertini",
      "start": 4081254,
      "text": "Data stories is supported by Tableau software, helping people see and understand their data. Get answers from interactive dashboards. Wherever you go for your free trial, visit Tableau software@Tableau.com. Datastories this is Tableau.com Datastories.",
      "id": "ep_56_ut_215"
    }
  ],
  "confidence": 0.922896755172409,
  "audio_duration": 4102,
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_status_code": null,
  "webhook_auth": false,
  "webhook_auth_header_name": null,
  "speed_boost": false,
  "auto_highlights_result": null,
  "auto_highlights": false,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_audio_quality": null,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "content_safety": false,
  "iab_categories": true,
  "content_safety_labels": {
    "status": "unavailable",
    "results": [],
    "summary": {}
  },
  "language_detection": false,
  "language_detection_threshold": null,
  "language_confidence": null,
  "custom_spelling": null,
  "throttled": false,
  "auto_chapters": true,
  "summarization": false,
  "summary_type": null,
  "summary_model": null,
  "custom_topics": false,
  "topics": [],
  "speech_threshold": null,
  "speech_model": "best",
  "chapters": [
    {
      "summary": "Data. Datastores is supported by Tableau software, helping people see and understand their data. Get answers from interactive dashboards. Wherever you go for a free trial, visit Tableau. Datastories.",
      "gist": "Tableau: Data. Datastories.",
      "headline": "Datastores supported by Tableau software helps people see and understand their data",
      "start": 160,
      "end": 24074,
      "id": "ep_56_ch_0"
    },
    {
      "summary": "Enrico: I've heard you're having better summer in Germany than in New York. The weather is real bad. Perfect weather to record a podcast inside, right? It's perfect. Any news? No, not really. Pretty flat and boring.",
      "gist": "Summer in Germany",
      "headline": "Start with the weather again. It's horrible. No major news, no scandals",
      "start": 34524,
      "end": 133110,
      "id": "ep_56_ch_1"
    },
    {
      "summary": "Today we have a super special guest, and it's Amanda Cox. Great having you here. How are you? I'm well. Thanks for having me.",
      "gist": "Amanda Cox On The Ellen Interview",
      "headline": "Today we have a super special guest, and it's Amanda Cox",
      "start": 133182,
      "end": 160034,
      "id": "ep_56_ch_2"
    },
    {
      "summary": "Amanda is a graphics editor at the New York Times. She has a background in statistics before the time. How did she end up at the Times? There aren't a lot of trained statisticians in newsrooms. The field has grown amazing.",
      "gist": "How a statistician landed at The New York Times",
      "headline": "Amanda is a graphics editor at the New York Times",
      "start": 161454,
      "end": 356494,
      "id": "ep_56_ch_3"
    },
    {
      "summary": "Amanda Keen: When did you start doing, creating charts and visualizations? Keen: My very first job after college was as an RA at the Federal Reserve Board. Keen: Most of that work in r still, not all now, but most of it. What's your experience with R and how it evolved over the years?",
      "gist": "Making Charts in R",
      "headline": "When did you start doing, creating charts and visualizations",
      "start": 359474,
      "end": 779020,
      "id": "ep_56_ch_4"
    },
    {
      "summary": "The only big limitation I see for doing visualization with R is that as you need it, it seems to be very, very limited. Do you have any tips, like how to get started?",
      "gist": "R2.0: Starting with R",
      "headline": "Do you have any tips on how to start using R for visualization",
      "start": 779132,
      "end": 1074188,
      "id": "ep_56_ch_5"
    },
    {
      "summary": "Amanda: Download the RSTudio and just do whatever. For learning, it's like, have a problem that you actually want to solve. You can scrape and plot and analyze and clean your data all in the same place. So, like, figure out the project that it is that you want to do and then become an r disciple.",
      "gist": "How to start learning R in 2017",
      "headline": "For learning, it's like, have a problem that you actually want to solve",
      "start": 1074236,
      "end": 1144768,
      "id": "ep_56_ch_6"
    },
    {
      "summary": "D3 is the obvious for all the interactive work. All of our print work and many of our web mock ups go through illustrator. We'd be lying if we didn't pretend that Excel was a workhorse in the department.",
      "gist": "What's the Workflow at The New York Times?",
      "headline": "All of our interactive work goes through illustrator. All of our print work and many of web mock ups go through",
      "start": 1144896,
      "end": 1183202,
      "id": "ep_56_ch_7"
    },
    {
      "summary": "The process happens in a bunch of different ways. One graphics editor is attached, at least one is attached to all the major desks. Increasingly, we do our own work on breaking news. It's often small teams, two, three, four people whose skillsets overlap.",
      "gist": "Inside The New York Times' Graphics Team",
      "headline": "How does New York Times develop graphics for breaking news stories",
      "start": 1183258,
      "end": 1271194,
      "id": "ep_56_ch_8"
    },
    {
      "summary": "One of the main problems is also finding the right. The right data for the problem that you want to. My favorite data are where the data is not a struggle. The most interesting data is probably not the data that comes up after your first Google search.",
      "gist": "Finding the Right Data for a Project",
      "headline": "One of the main problems is finding the right data for a project",
      "start": 1272054,
      "end": 1367224,
      "id": "ep_56_ch_9"
    },
    {
      "summary": "Here's a fun one about sort of just acquiring with technology. Sean Carter wanted to know where trailers come from in movies. Technology also becomes your journalistic tool, more or less, to actually find something out.",
      "gist": "The Art of Finding Where Films Come From",
      "headline": "Sean Carter wanted to know where trailers come from in movies",
      "start": 1367384,
      "end": 1590038,
      "id": "ep_56_ch_10"
    },
    {
      "summary": "This week, data stories is supported by Tableau software. Tableau lets people connect to any kind of data and visualize it on the fly. In the latest version, Tableau nine, you'll find features that make the product smarter. To find out more, get your free trial@Tableau. com.",
      "gist": "Tableau",
      "headline": "Data stories is supported by Tableau software, helping people see and understand data",
      "start": 1590166,
      "end": 1654494,
      "id": "ep_56_ch_11"
    },
    {
      "summary": "Can annotation itself become interactive? I think probably the most consequential graphic of all time has interactive annotation. There's no space for the annotation on mobile. Mobile has killed annotation in many ways.",
      "gist": "Has Interactive Annotations Become Involveful?",
      "headline": "Can annotation itself become interactive? Can maps have interactive annotations",
      "start": 1654954,
      "end": 1968246,
      "id": "ep_56_ch_12"
    },
    {
      "summary": "Harvard researchers have created a chart that links income to chance of going to college. The site asks you to draw the curve. Then comments on that and shows you the real curve, but also shows you how others have drawn. It's a fun project that forces you to think through statistics.",
      "gist": "The Hidden Truth about How Much Money People Earn",
      "headline": "Researchers at Harvard have created a chart that compares college chances based on income",
      "start": 1968310,
      "end": 2312058,
      "id": "ep_56_ch_13"
    },
    {
      "summary": "Scott Murray: How has launch of upshot New York Times changed your workflow? Murray: Most data journalism is successful when you don't need the adjective. How do you see this developing? There's also, of course, 538, Nate Silver's maybe similar data journalistic publication.",
      "gist": "Has the Upshot New York Times changed your workflow?",
      "headline": "How has launch of upshot New York Times changed your workflow",
      "start": 2312146,
      "end": 2732636,
      "id": "ep_56_ch_14"
    },
    {
      "summary": "The interpretation of data is super important. Have you ever stopped the factually right stories because you had the feeling people might get it wrong? There are huge biases in how things are reported.",
      "gist": "The bias of hate crimes",
      "headline": "The interpretation of hate crime data is super important, says Jeremy Ashkenas",
      "start": 2732700,
      "end": 2870004,
      "id": "ep_56_ch_15"
    },
    {
      "summary": "Kevin Quailey and I teach a class at NYU in the journalism program. He says it's inversely how much you prepare on paper to how good it is in the classroom. If you start with interesting questions, students learn so much faster, he says.",
      "gist": "How to teach data visualization",
      "headline": "How to teach visualization is inversely related to how prepared you are",
      "start": 2871024,
      "end": 3033284,
      "id": "ep_56_ch_16"
    },
    {
      "summary": "And the next question was, how to tolerate Kevin Quilly. Kevin and I say that all of the bad parts of ourselves are the same. I think our memoirs now is just titled disagreements.",
      "gist": "How To Tolerate Kevin Quilly",
      "headline": "How to tolerate Kevin Quilly is a great question",
      "start": 3034784,
      "end": 3103134,
      "id": "ep_56_ch_17"
    },
    {
      "summary": "Kevin: I hate video. Kevin, I like complicated things. Kevin likes tables. Complicated tables are the worst kind of tables. Is it more on the story itself, on the interpretation or on the way to visualize something?",
      "gist": "In the Elevator With Kevin Flanery",
      "headline": "You and Kevin sometimes disagree on something during the process of creating a piece",
      "start": 3103214,
      "end": 3154836,
      "id": "ep_56_ch_18"
    },
    {
      "summary": "The histogram is an interesting example of how defaults matter a ton in software. Part of the reason they die is because it's not easy to make a histogram in excel. I think the histograms are a fun example of ways defaults in software change people's approach to the world.",
      "gist": "The History of the Histogram",
      "headline": "I think the histogram is an interesting example of how defaults matter in software",
      "start": 3154960,
      "end": 3221370,
      "id": "ep_56_ch_19"
    },
    {
      "summary": "I'm a fan of maximizing what I call net joy. What's your take on complicated charts that may be effective, but people don't know how to interpret right away? I think there are a quite solid set of charts that you can expect people to understand.",
      "gist": "More Complex Charts",
      "headline": "I'm a fan of maximizing what I call net joy with charts",
      "start": 3221402,
      "end": 3295894,
      "id": "ep_56_ch_20"
    },
    {
      "summary": "Amanda: Data that is really great data is not on the Internet. That's the proprietary data that people actually make decisions off of. A lot of my best work probably really is commodity data. Are you interested in topics that have been explored already?",
      "gist": "Amanda on Interest in Data",
      "headline": "Amanda, do you have any burning topics of interest but cannot get data",
      "start": 3297114,
      "end": 3437384,
      "id": "ep_56_ch_21"
    },
    {
      "summary": "By default, the really easy stuff for us is the questions about what and where and when. But the why and the how questions, I think, are always more interesting and important. Maybe you need to think more in terms of illustration and explanation and storytelling.",
      "gist": "What are the current hard problems you see in viz",
      "headline": "What are the current hard problems you see in viz, beyond visualizing uncertainty",
      "start": 3438004,
      "end": 3597954,
      "id": "ep_56_ch_22"
    },
    {
      "summary": "How can we make our work actually relevant? Yeah, I think it's a question people struggle with. How can we work on problems that, you know, actually change, change thinking or change behavior or help us make better decisions?",
      "gist": "What Does It Mean for Work to Be relevant?",
      "headline": "How do we make our work actually relevant? Yeah, I think so",
      "start": 3600294,
      "end": 3656954,
      "id": "ep_56_ch_23"
    },
    {
      "summary": "The question of impact is always a tricky one because I am pretty sure that there are lots of things happening out there that we are just not aware of. In a lot of organizations and even among scientists, there are things happening that are at least partially done through visualization that have a strong impact.",
      "gist": "Has Visualization Had an Impact on People's Lives?",
      "headline": "The question of whether visualization has an impact on people's lives is tricky",
      "start": 3657774,
      "end": 3778494,
      "id": "ep_56_ch_24"
    },
    {
      "summary": "The tools market is really evolving. I'm going to stick with r across the spectrum because it's time for more. Some of the most interesting tool work is going on right now. Maybe we should have a show on all the new web based tools popping up.",
      "gist": "What are your favorite design tools?",
      "headline": "Petra asks favorite design tools that offer free interpretation to unambiguous messages",
      "start": 3781514,
      "end": 4102224,
      "id": "ep_56_ch_25"
    }
  ],
  "disfluencies": false,
  "entity_detection": false,
  "sentiment_analysis": false,
  "sentiment_analysis_results": null,
  "entities": null,
  "speakers_expected": null,
  "summary": null,
  "custom_topics_results": null,
  "episode_num": 56,
  "episode_metadata": {
    "speakers": [
      "Amanda Cox",
      "Moritz Stefaner",
      "Enrico Bertini"
    ],
    "WPid": "332",
    "url": "https://datastori.es/podlove/file/1005/s/feed/c/mp3/datastories-56.mp3",
    "episode_title": "Amanda Cox on Working With R, NYT Projects, Favorite Data"
  }
}