{
  "id": "69cde857-e515-46b3-b84c-98c6ac892284",
  "language_model": "assemblyai_default",
  "acoustic_model": "assemblyai_default",
  "language_code": "en_us",
  "status": "completed",
  "audio_url": "https://datastori.es/podlove/file/126/s/feed/c/mp3/Datastories-25.mp3",
  "utterances": [
    {
      "end": 14486,
      "speaker": "Enrico Bertini",
      "start": 7760,
      "text": "Hi, everyone. Data stories number 25. Hi, Moritz. How are you?",
      "id": "ep_25_ut_0"
    },
    {
      "end": 15886,
      "speaker": "Moritz Stefaner",
      "start": 14678,
      "text": "How are you doing? Good.",
      "id": "ep_25_ut_1"
    },
    {
      "end": 23406,
      "speaker": "Enrico Bertini",
      "start": 15998,
      "text": "Summer is here. Summer is here. Maybe it's not in Germany. It is. It is still a bit cool.",
      "id": "ep_25_ut_2"
    },
    {
      "end": 28020,
      "speaker": "Moritz Stefaner",
      "start": 23478,
      "text": "Sometimes raining, but mostly. Yeah, mostly nice. Yeah.",
      "id": "ep_25_ut_3"
    },
    {
      "end": 29580,
      "speaker": "Enrico Bertini",
      "start": 28320,
      "text": "What's going on?",
      "id": "ep_25_ut_4"
    },
    {
      "end": 36720,
      "speaker": "Moritz Stefaner",
      "start": 30080,
      "text": "I'm wrapping up things. I'm off to leave for vacations. Yeah, the day after tomorrow.",
      "id": "ep_25_ut_5"
    },
    {
      "end": 37760,
      "speaker": "Enrico Bertini",
      "start": 36880,
      "text": "Oh, I'm jealous.",
      "id": "ep_25_ut_6"
    },
    {
      "end": 43328,
      "speaker": "Moritz Stefaner",
      "start": 37800,
      "text": "So I'm in this sort of limbo state now of. I have to finish everything.",
      "id": "ep_25_ut_7"
    },
    {
      "end": 44096,
      "speaker": "Enrico Bertini",
      "start": 43384,
      "text": "Yeah, wrap up.",
      "id": "ep_25_ut_8"
    },
    {
      "end": 45820,
      "speaker": "Moritz Stefaner",
      "start": 44128,
      "text": "I couldn't finish everything.",
      "id": "ep_25_ut_9"
    },
    {
      "end": 50500,
      "speaker": "Enrico Bertini",
      "start": 47080,
      "text": "I already gave up having this kind of feeling. I mean, yeah.",
      "id": "ep_25_ut_10"
    },
    {
      "end": 58280,
      "speaker": "Moritz Stefaner",
      "start": 51480,
      "text": "I have actually two to do lists and I don't tell people on which to do list. Their stuff is. But.",
      "id": "ep_25_ut_11"
    },
    {
      "end": 59084,
      "speaker": "Enrico Bertini",
      "start": 58660,
      "text": "Yeah.",
      "id": "ep_25_ut_12"
    },
    {
      "end": 63080,
      "speaker": "Moritz Stefaner",
      "start": 59132,
      "text": "And the one is looking good and the other one. Well, what can you do? Right?",
      "id": "ep_25_ut_13"
    },
    {
      "end": 82772,
      "speaker": "Enrico Bertini",
      "start": 64140,
      "text": "Yeah. I am myself in a very risky situation because for holidays I'm gonna stay here in New York. So it's, you know, I mean, if you don't leave and go somewhere else. Yeah. It can be very nice. But there is always the temptation to go back to work for any given reason. I hope that's not gonna happen.",
      "id": "ep_25_ut_14"
    },
    {
      "end": 83932,
      "speaker": "Moritz Stefaner",
      "start": 82836,
      "text": "No, just be disappointed.",
      "id": "ep_25_ut_15"
    },
    {
      "end": 87812,
      "speaker": "Enrico Bertini",
      "start": 83956,
      "text": "I'll do my best. I just trash my laptop somewhere.",
      "id": "ep_25_ut_16"
    },
    {
      "end": 89000,
      "speaker": "Moritz Stefaner",
      "start": 87876,
      "text": "Just get drunk.",
      "id": "ep_25_ut_17"
    },
    {
      "end": 93966,
      "speaker": "Enrico Bertini",
      "start": 89430,
      "text": "Do they sell locks for laptops? Yeah, you could like.",
      "id": "ep_25_ut_18"
    },
    {
      "end": 97446,
      "speaker": "Moritz Stefaner",
      "start": 93998,
      "text": "Yeah. Lock it away for a week. Like secret code. Yeah.",
      "id": "ep_25_ut_19"
    },
    {
      "end": 107450,
      "speaker": "Enrico Bertini",
      "start": 97518,
      "text": "Give the key to my wife, to your lawyer, the best person. No, I think my wife would be much, much harder to convince than my lawyer.",
      "id": "ep_25_ut_20"
    },
    {
      "end": 114840,
      "speaker": "Moritz Stefaner",
      "start": 108110,
      "text": "Yeah, it's a good idea. I actually go to a hut in the mountains. Like, I don't think they have wifi.",
      "id": "ep_25_ut_21"
    },
    {
      "end": 130468,
      "speaker": "Enrico Bertini",
      "start": 115030,
      "text": "Yeah, I don't think. Well, you never know. Have you ever seen those map where you. Basically. I think it's a map of the few places that are completely unreachable. There are very few areas around the.",
      "id": "ep_25_ut_22"
    },
    {
      "end": 131964,
      "speaker": "Moritz Stefaner",
      "start": 130484,
      "text": "World, like no cell phone.",
      "id": "ep_25_ut_23"
    },
    {
      "end": 137500,
      "speaker": "Enrico Bertini",
      "start": 132052,
      "text": "No cell phone, no signal at all. I mean, there are very few ones. Very, very few, unfortunately.",
      "id": "ep_25_ut_24"
    },
    {
      "end": 139140,
      "speaker": "Moritz Stefaner",
      "start": 137540,
      "text": "Probably some bunkers somewhere in Russia.",
      "id": "ep_25_ut_25"
    },
    {
      "end": 144998,
      "speaker": "Enrico Bertini",
      "start": 139180,
      "text": "Some bunkers. Yeah. In Switzerland, there are some bunkers as well. When I lived there. There are many.",
      "id": "ep_25_ut_26"
    },
    {
      "end": 145958,
      "speaker": "Moritz Stefaner",
      "start": 145054,
      "text": "We could go there.",
      "id": "ep_25_ut_27"
    },
    {
      "end": 160758,
      "speaker": "Enrico Bertini",
      "start": 146094,
      "text": "Yeah, there are many, many around. Anyway, let's start these episodes. We have another fantastic guest today. We have Dominicos Bau and we're going to talk about mobile and touch interfaces for visualization. Hi, Dominicos, how are you?",
      "id": "ep_25_ut_28"
    },
    {
      "end": 162718,
      "speaker": "Dominikus Baur",
      "start": 160934,
      "text": "Hi, Enrico. I'm good, thanks.",
      "id": "ep_25_ut_29"
    },
    {
      "end": 206682,
      "speaker": "Enrico Bertini",
      "start": 162854,
      "text": "So Dominicos is an expert in this area. If you didn't hear about him yet, I suggest you to go to his webpage. That is dot minic, dot as. And it's a very nice URL. But you will find it in the blog post. And he gave a very nice presentation at the Openviz conference on data visualization on mobile and touch interfaces, and we decided to invite him. Plus he's a very old friend of us, so it's a great pleasure to have him here in hosted in data stories. So, Dominicos, you want to tell something about yourself, introduce yourself a little bit longer or more details than I did.",
      "id": "ep_25_ut_30"
    },
    {
      "end": 265540,
      "speaker": "Dominikus Baur",
      "start": 206746,
      "text": "Sure. Yeah, I can do that. So I'm Dominikus Baur. I work as a visualization freelancer in Munich at the moment. And I also do a lot of interaction design, mostly on mobile. And so the thing that I'm most thrilled about at the moment is touch and how to combine touch input with information visualization and data visualization. So actually, I haven't been doing this freelance thing for too long. I was in academia for a while, so I did my PhD in information visualization and I started working on this whole touch topic there. But I also did more exotic things about live vlogging. So tracking details of your life, like music listening histories, for example, and trying to make sense of that by doing visualization, that was kind of my thing.",
      "id": "ep_25_ut_31"
    },
    {
      "end": 274180,
      "speaker": "Enrico Bertini",
      "start": 266280,
      "text": "I remember your stuff on music visualization. That was, that was really cool. It was quite some time ago, right? When did you do that?",
      "id": "ep_25_ut_32"
    },
    {
      "end": 280808,
      "speaker": "Dominikus Baur",
      "start": 275160,
      "text": "Oh, so I started my PhD in 2007. Five years ago.",
      "id": "ep_25_ut_33"
    },
    {
      "end": 281412,
      "speaker": "Enrico Bertini",
      "start": 280944,
      "text": "Yeah.",
      "id": "ep_25_ut_34"
    },
    {
      "end": 284200,
      "speaker": "Dominikus Baur",
      "start": 281496,
      "text": "Oh, that's. Time flies.",
      "id": "ep_25_ut_35"
    },
    {
      "end": 287244,
      "speaker": "Enrico Bertini",
      "start": 284780,
      "text": "Yeah. Never look back.",
      "id": "ep_25_ut_36"
    },
    {
      "end": 299524,
      "speaker": "Dominikus Baur",
      "start": 287412,
      "text": "Yeah. No, that was a lot of fun, this whole music listening stuff, especially as people could relate. So most of them were thrilled when they heard, oh, it's possible to track all the music that I listen to. That's awesome. I want to do that.",
      "id": "ep_25_ut_37"
    },
    {
      "end": 308930,
      "speaker": "Enrico Bertini",
      "start": 299612,
      "text": "Yeah. That's actually the fantastic thing of visualization, of personal data that people can relate to it in an instant. And that's really, really cool.",
      "id": "ep_25_ut_38"
    },
    {
      "end": 311050,
      "speaker": "Dominikus Baur",
      "start": 309100,
      "text": "Yeah, definitely, like a lot.",
      "id": "ep_25_ut_39"
    },
    {
      "end": 323110,
      "speaker": "Enrico Bertini",
      "start": 312390,
      "text": "So, Moritz, we have an imbalance of German accent today. We didn't invite any Italian yet, so we have to. That's true.",
      "id": "ep_25_ut_40"
    },
    {
      "end": 327650,
      "speaker": "Moritz Stefaner",
      "start": 323230,
      "text": "Yeah, yeah. But at least it's euro, you know, at least.",
      "id": "ep_25_ut_41"
    },
    {
      "end": 330334,
      "speaker": "Enrico Bertini",
      "start": 328190,
      "text": "Yeah, it's gonna be quite exotic today.",
      "id": "ep_25_ut_42"
    },
    {
      "end": 333330,
      "speaker": "Moritz Stefaner",
      "start": 330502,
      "text": "We're all a big family and if you're from Europe.",
      "id": "ep_25_ut_43"
    },
    {
      "end": 356770,
      "speaker": "Enrico Bertini",
      "start": 336910,
      "text": "So. Dominicos. So why don't we start discussing about why doing visualization on mobile devices at all? I mean, I think that's the main question. I will start from that. So what is the need of moving visualization on a device that is mobile, actually?",
      "id": "ep_25_ut_44"
    },
    {
      "end": 392156,
      "speaker": "Dominikus Baur",
      "start": 358790,
      "text": "So I guess the reason is that mobile is becoming more and more popular. So I think this year we actually reached a point where people spend more time using their mobile devices than using their desktops and laptops. So. Well, I guess it's just a sign of the times you can't really avoid it. And of course, the thing is, if you have something online, for example, and you want people to see that, then you need to be able to support them even if they use a mobile device.",
      "id": "ep_25_ut_45"
    },
    {
      "end": 394048,
      "speaker": "Enrico Bertini",
      "start": 392338,
      "text": "Oh, sure, sure.",
      "id": "ep_25_ut_46"
    },
    {
      "end": 394820,
      "speaker": "Dominikus Baur",
      "start": 394144,
      "text": "Yeah.",
      "id": "ep_25_ut_47"
    },
    {
      "end": 397512,
      "speaker": "Enrico Bertini",
      "start": 396000,
      "text": "Makes a lot of sense.",
      "id": "ep_25_ut_48"
    },
    {
      "end": 414688,
      "speaker": "Dominikus Baur",
      "start": 397696,
      "text": "Sure, yeah. So, because, I mean, I guess all of us are, I don't know, checking out Twitter feeds on our mobile devices, and if there's a link that doesn't work on our smartphone, then we don't really go to our laptops and check it there, I guess. At least I don't.",
      "id": "ep_25_ut_49"
    },
    {
      "end": 418152,
      "speaker": "Moritz Stefaner",
      "start": 414864,
      "text": "You don't type in the URL you're just reading on the iPhone?",
      "id": "ep_25_ut_50"
    },
    {
      "end": 424740,
      "speaker": "Dominikus Baur",
      "start": 418296,
      "text": "Nope. Usually you don't. So there's already one person that you've lost, so.",
      "id": "ep_25_ut_51"
    },
    {
      "end": 426420,
      "speaker": "Enrico Bertini",
      "start": 425680,
      "text": "Sure.",
      "id": "ep_25_ut_52"
    },
    {
      "end": 431900,
      "speaker": "Moritz Stefaner",
      "start": 426960,
      "text": "So what do you say? What's the main difference? Or is it the same thing in small?",
      "id": "ep_25_ut_53"
    },
    {
      "end": 477730,
      "speaker": "Dominikus Baur",
      "start": 434160,
      "text": "Not really. I mean, the other thing that's very different for mobile is, as the name implies, that the whole context is changing. So the usage context is. Can be completely different. I mean, people can still sit on the couch and use their smartphone while watching tv or something, but mostly they, I don't know, they're waiting for their bus or whatever or walking around somewhere waiting for friends. So they're in a completely different space than people who are sitting in front of their laptops and. Yeah. That makes it difficult to address both scenarios, I guess.",
      "id": "ep_25_ut_54"
    },
    {
      "end": 487670,
      "speaker": "Moritz Stefaner",
      "start": 478510,
      "text": "Right, yeah. And it's very small devices. I mean, that's the other thing. Like, we're very used to making like, very dense representations, lots of numbers, little.",
      "id": "ep_25_ut_55"
    },
    {
      "end": 488782,
      "speaker": "Dominikus Baur",
      "start": 487750,
      "text": "Sure, sure.",
      "id": "ep_25_ut_56"
    },
    {
      "end": 492330,
      "speaker": "Moritz Stefaner",
      "start": 488966,
      "text": "And, yeah, then you just have a few inches to work with.",
      "id": "ep_25_ut_57"
    },
    {
      "end": 514570,
      "speaker": "Dominikus Baur",
      "start": 493750,
      "text": "I guess. That was actually one of the reasons why a lot of researchers avoided mobile devices for a long time. Just because it seems like, okay, for visualization, we want to have as much screen real estate as possible and fill everything with data. Why would we restrict ourselves to something that is only four inches?",
      "id": "ep_25_ut_58"
    },
    {
      "end": 564480,
      "speaker": "Moritz Stefaner",
      "start": 515270,
      "text": "Yeah, it seems like a step back if you just look at the display. Right. But I think you're absolutely right that it opens all these very interesting contexts, like different locations where people are new life situations. Mobile is also a very personal device. It's much more personal than personal air quotes, computer. And so that's kind of interesting. Yeah, yeah. But I also find it hard. It's. Yeah, if you're used to building, like, desktop visualizations, it's hard to wrap your head around, like, how to do it right. On mobile, what's your experience? What are the biggest, like, what are the things you have to learn when you switch from desktop to designing for mobile?",
      "id": "ep_25_ut_59"
    },
    {
      "end": 608976,
      "speaker": "Dominikus Baur",
      "start": 566300,
      "text": "I guess the major difference is the input modality that we have on mobile, because for a desktop, well, we have mostly a touchpad or something like that, or a mouse. So some pointing device and of course a usable keyboard compared to mobile. I'm always frustrated by those virtual things. And I mean, that's kind of to add insult to injury, not only do we have a smaller screen, but we also have huge fingers that occlude content on there. So I guess this whole touch input is the major difference, really.",
      "id": "ep_25_ut_60"
    },
    {
      "end": 626560,
      "speaker": "Enrico Bertini",
      "start": 609088,
      "text": "And of course, the screen size at the same time. My feeling is that being able to touch a visualization virtually is also a sort of better direct manipulation. Right. So I'm sure that there are lots of limitations, but there might be also some advantages. Did you notice that? Do you have any experience with that?",
      "id": "ep_25_ut_61"
    },
    {
      "end": 631508,
      "speaker": "Dominikus Baur",
      "start": 626860,
      "text": "So direct manipulation is really key in this regard.",
      "id": "ep_25_ut_62"
    },
    {
      "end": 636240,
      "speaker": "Enrico Bertini",
      "start": 631564,
      "text": "I mean, in this case, it's really direct. Right. You are really kind of like touching the thing.",
      "id": "ep_25_ut_63"
    },
    {
      "end": 667150,
      "speaker": "Dominikus Baur",
      "start": 636780,
      "text": "It actually is direct. So when the term was originally coined, the whole direct manipulation happened with a mouse, which is, well, kind of ironic, but yeah, now we're actually directly manipulating stuff on screen. And I would say it feels different than using a mouse, especially if you're able to use more than one finger, which is really rare still. But I guess we're getting.",
      "id": "ep_25_ut_64"
    },
    {
      "end": 681530,
      "speaker": "Moritz Stefaner",
      "start": 667230,
      "text": "Everybody remembers the first time they used Google maps on a tablet, right? Not really. I mean, for me at least, it was like, oh, man, I can totally move this map sounds so trivial.",
      "id": "ep_25_ut_65"
    },
    {
      "end": 687828,
      "speaker": "Enrico Bertini",
      "start": 682060,
      "text": "I mean, think about zooming. Zooming on an iPad is so much easier. I mean, it's amazing.",
      "id": "ep_25_ut_66"
    },
    {
      "end": 688844,
      "speaker": "Moritz Stefaner",
      "start": 687924,
      "text": "It's fun, right?",
      "id": "ep_25_ut_67"
    },
    {
      "end": 694932,
      "speaker": "Enrico Bertini",
      "start": 688972,
      "text": "And it's fun. And it's fun. Or even rotating. Think about rotating with a map.",
      "id": "ep_25_ut_68"
    },
    {
      "end": 708960,
      "speaker": "Moritz Stefaner",
      "start": 695076,
      "text": "You move two fingers and, you know, they stay where they are. And the photo or the map, like rotates according to what you do. I mean, yeah, before it was always just like much more discreet actions like Zoom in, move left.",
      "id": "ep_25_ut_69"
    },
    {
      "end": 709816,
      "speaker": "Enrico Bertini",
      "start": 709040,
      "text": "Yeah, exactly.",
      "id": "ep_25_ut_70"
    },
    {
      "end": 725832,
      "speaker": "Dominikus Baur",
      "start": 709888,
      "text": "Yeah, pretty much. And you had some labeled buttons that did something. And now you actually do. You directly do the thing that you want to do and it just happens. You don't have to look for the button that says zoom in, but you just use your fingers.",
      "id": "ep_25_ut_71"
    },
    {
      "end": 733380,
      "speaker": "Moritz Stefaner",
      "start": 726016,
      "text": "It's like really like acting in a space as opposed to executing command. Yeah, to some degree, yeah.",
      "id": "ep_25_ut_72"
    },
    {
      "end": 761832,
      "speaker": "Dominikus Baur",
      "start": 734410,
      "text": "Of course, the downside of that is that more abstract commands are more difficult to pull off. You often find that people have some pretty much arbitrary gestures to do something. So swipe up with three fingers to do x and then you have to memorize that. Yeah, it's a fine line.",
      "id": "ep_25_ut_73"
    },
    {
      "end": 771580,
      "speaker": "Enrico Bertini",
      "start": 761976,
      "text": "Yeah. And I guess the screen real estate is reduced by the fact that you need large areas to let people interact with the user interface, right?",
      "id": "ep_25_ut_74"
    },
    {
      "end": 804980,
      "speaker": "Dominikus Baur",
      "start": 772280,
      "text": "Yeah, usually you do. I mean, the advantage of having gestures is that you don't have to have really discreet areas that you can interact with. So when we think back to the, to the maps example, you can use your fingers on any part of the map to do something with it. So you don't have specific interaction areas, but. Yeah. Well, sometimes you do. And of course, it always depends on the type of application that you want to do.",
      "id": "ep_25_ut_75"
    },
    {
      "end": 806220,
      "speaker": "Enrico Bertini",
      "start": 805480,
      "text": "Sure.",
      "id": "ep_25_ut_76"
    },
    {
      "end": 825220,
      "speaker": "Moritz Stefaner",
      "start": 806720,
      "text": "The other thing are, of course, sensors. So you can also work with how the device is positioned or where you are in the world and where you pointed away. So you had this really interesting project where you would use a smartphone as a sort of a lens on a projected display.",
      "id": "ep_25_ut_77"
    },
    {
      "end": 852650,
      "speaker": "Dominikus Baur",
      "start": 827440,
      "text": "You mean this virtual projection thing? Yeah, that was interesting. So basically, we recreated kind of this notion of optical projection by tracking the, the smartphone in front of a large display, and then you could use your virtual projection cone to interact with the stuff on the large tv.",
      "id": "ep_25_ut_78"
    },
    {
      "end": 860638,
      "speaker": "Moritz Stefaner",
      "start": 853390,
      "text": "So you would point your smartphone somewhere and it would be as if the smartphone would emit light and project something.",
      "id": "ep_25_ut_79"
    },
    {
      "end": 862694,
      "speaker": "Dominikus Baur",
      "start": 860694,
      "text": "Right, exactly. Yeah, yeah.",
      "id": "ep_25_ut_80"
    },
    {
      "end": 863850,
      "speaker": "Moritz Stefaner",
      "start": 862862,
      "text": "But it didn't.",
      "id": "ep_25_ut_81"
    },
    {
      "end": 871992,
      "speaker": "Dominikus Baur",
      "start": 864430,
      "text": "No, of course it didn't. That was actually the first thing that people always asked. How do you do that?",
      "id": "ep_25_ut_82"
    },
    {
      "end": 873848,
      "speaker": "Moritz Stefaner",
      "start": 872056,
      "text": "How did you get the projector in there?",
      "id": "ep_25_ut_83"
    },
    {
      "end": 877776,
      "speaker": "Dominikus Baur",
      "start": 873984,
      "text": "Yeah, but no, it was all just simulated.",
      "id": "ep_25_ut_84"
    },
    {
      "end": 889140,
      "speaker": "Moritz Stefaner",
      "start": 877968,
      "text": "What happened to augmented reality and layer and all these types of applications? Is that still a thing or is that like in the valley of. How is it called? The value of despair?",
      "id": "ep_25_ut_85"
    },
    {
      "end": 897448,
      "speaker": "Dominikus Baur",
      "start": 890880,
      "text": "I actually think it's coming because, of course, I'm also saying that about touchable visualization.",
      "id": "ep_25_ut_86"
    },
    {
      "end": 898720,
      "speaker": "Moritz Stefaner",
      "start": 897624,
      "text": "For years now.",
      "id": "ep_25_ut_87"
    },
    {
      "end": 927722,
      "speaker": "Dominikus Baur",
      "start": 898840,
      "text": "Yeah, I mean, now we have reached a point in the hardware development where it actually makes sense to do augmented reality because you have all these sensors and powerful mobile computers. I don't know if you guys seen the first augmented reality prototypes. That was always a huge 30 kilo backpack and, yeah, it was pretty ridiculous. But now we have all this power just in a smartphone.",
      "id": "ep_25_ut_88"
    },
    {
      "end": 941790,
      "speaker": "Moritz Stefaner",
      "start": 927876,
      "text": "Yeah, but it's interesting because two years ago it made big headlines and now we actually have the power. But now it doesn't seem to be very present, but it might just come in a half a year and then be really integrated in product.",
      "id": "ep_25_ut_89"
    },
    {
      "end": 947166,
      "speaker": "Dominikus Baur",
      "start": 941870,
      "text": "Maybe. Yeah. I mean, there is stuff like Google Glass coming up, for example, and that is.",
      "id": "ep_25_ut_90"
    },
    {
      "end": 948182,
      "speaker": "Moritz Stefaner",
      "start": 947358,
      "text": "It's pretty organized.",
      "id": "ep_25_ut_91"
    },
    {
      "end": 951690,
      "speaker": "Dominikus Baur",
      "start": 948206,
      "text": "It was very promising and scary, of course.",
      "id": "ep_25_ut_92"
    },
    {
      "end": 982962,
      "speaker": "Enrico Bertini",
      "start": 953550,
      "text": "Yeah. Yeah. So I was actually thinking about your work on your. I think it's called touchwave. Right. I mean, so where you basically, if I. If I remember correctly, you. You've been implementing some specific kind of new interaction techniques for the tablet that actually solves or try to solve some of the limitations of stack graphs, right?",
      "id": "ep_25_ut_93"
    },
    {
      "end": 984024,
      "speaker": "Dominikus Baur",
      "start": 983026,
      "text": "I. Yeah.",
      "id": "ep_25_ut_94"
    },
    {
      "end": 986140,
      "speaker": "Enrico Bertini",
      "start": 984072,
      "text": "Is that correct? Do I remember correctly?",
      "id": "ep_25_ut_95"
    },
    {
      "end": 987880,
      "speaker": "Dominikus Baur",
      "start": 986640,
      "text": "That is correct, yeah.",
      "id": "ep_25_ut_96"
    },
    {
      "end": 993940,
      "speaker": "Enrico Bertini",
      "start": 987920,
      "text": "So can you tell us a little more about what you've been doing there and what's the outcome of this work?",
      "id": "ep_25_ut_97"
    },
    {
      "end": 994712,
      "speaker": "Dominikus Baur",
      "start": 994280,
      "text": "Sure.",
      "id": "ep_25_ut_98"
    },
    {
      "end": 1009140,
      "speaker": "Enrico Bertini",
      "start": 994776,
      "text": "That's really interesting because I think it's a nice example of how using touch interfaces can actually be. Can provide some benefits that we might not actually get by using standard interfaces. Standard devices, actually.",
      "id": "ep_25_ut_99"
    },
    {
      "end": 1058435,
      "speaker": "Dominikus Baur",
      "start": 1009720,
      "text": "Yeah. Yeah. Thank you. That was kind of what we were going for. So Touchwave was a research project that I did last year at the University of Calgary with Sheelagh Carpentale and Wang Shen Li. And the basic idea was we wanted to use or to show how interacting with touch is not necessarily a downside or something that you have to design around, but can be something that actually enriches interaction and makes certain visualization techniques usable. Because, I mean, you often see that you have some visualization technique that doesn't really work that well in its static form, and then you tack on interaction to make it better.",
      "id": "ep_25_ut_100"
    },
    {
      "end": 1069157,
      "speaker": "Enrico Bertini",
      "start": 1058507,
      "text": "Yeah, I think in general, this is a huge topic which goes very well beyond the problem of touch interfaces. It's really interesting. Yeah. Sorry for interrupting.",
      "id": "ep_25_ut_101"
    },
    {
      "end": 1173050,
      "speaker": "Dominikus Baur",
      "start": 1069323,
      "text": "No, no, that's fine. Yeah, so they kind of went into the same direction. So we wanted to have something that's pretty. So we took stacked graphs because they are. But they're just. Well, they. I mean, there's this huge discussion going on about how useful they actually are as a visualization technique. And I don't want to go into that, don't want to make any enemies, but we said that, okay, we want to have stack graphs on an iPad. Now, what can we do using touch? And the basic idea behind touch wave was to have the visualization as a virtual object. So going back to this direct manipulation idea, to have this visualization as something that is behind this little layer of glass there and that you can manipulate using your fingers. And based on this metaphor, we came up with certain interaction techniques and stuff that became possible by using your fingers so you could take single layers from the stacked graphs and drag them out and use, of course, multiple fingers to zoom in on certain areas and kind of squish and distort the whole thing. So, yeah, that was, of course it was just a research project, so can't really buy it. But it was an interesting experiment in trying to harness the power of touch for visualization and I think that could definitely be something that we might do more often in the future.",
      "id": "ep_25_ut_102"
    },
    {
      "end": 1174918,
      "speaker": "Enrico Bertini",
      "start": 1174390,
      "text": "Sure.",
      "id": "ep_25_ut_103"
    },
    {
      "end": 1183610,
      "speaker": "Dominikus Baur",
      "start": 1175014,
      "text": "Because right now, I mean, there's not a lot of visualization happening on tablets, unfortunately.",
      "id": "ep_25_ut_104"
    },
    {
      "end": 1209360,
      "speaker": "Enrico Bertini",
      "start": 1184430,
      "text": "So do you think that there are some potential interaction mechanisms on top of some visualizations that are too costly when performed on a desktop device and become. If you move the visualization to a touch device, they become much less costly and feasible and then they become much more useful. You see what I mean?",
      "id": "ep_25_ut_105"
    },
    {
      "end": 1216600,
      "speaker": "Dominikus Baur",
      "start": 1213460,
      "text": "No, not really. Sure. No.",
      "id": "ep_25_ut_106"
    },
    {
      "end": 1264090,
      "speaker": "Enrico Bertini",
      "start": 1217300,
      "text": "I try to reformulate the question. It's probably my fault. So if you think about new interaction techniques in visualization, you can potentially develop a new visualization. Sorry, a new interaction technique for manipulating visualizations that doesn't necessarily depend on which device you use. Right. Kind of like I think now you've been mentioning taking one layer and moving this layer off to another, to another area of the screen. Right. So in principle you can do that with the mouse as well, but it's probably too costly. Right. So I think nobody did it before because just the. It doesn't make sense if you do it with a mouse, but if you do it with your hand, all in a sudden it becomes feasible and it makes sense.",
      "id": "ep_25_ut_107"
    },
    {
      "end": 1306590,
      "speaker": "Dominikus Baur",
      "start": 1264810,
      "text": "See what you mean? Yeah, yeah, that's definitely the case. So, I mean, just the whole pinch to zoom thing that became so iconic. Of course you could enlarge and shrink photos before that, but it just wasn't as much fun because you had some plus button that you had to click on. So, yeah, that was definitely also a part of the project that we could just go crazy with all of these things that suddenly became much more feasible, as you say, and also much more fun. So fun was definitely an aspect of the whole project.",
      "id": "ep_25_ut_108"
    },
    {
      "end": 1356220,
      "speaker": "Moritz Stefaner",
      "start": 1309850,
      "text": "Yeah, I mean, the other thing is really multi touch and it's hard. I think we're all very much trained on this one pointer paradigm, but there's really many things you can do with multiple pointers, like what we've seen also with the data sculptures that you can mark, for instance, with your left hand, one part of the graphic or the sculpture, and then interact with the other, but still keep your index, like your index finger to mark just one position, stuff like that, which you wouldn't do on screen because you leave ugly traces and it doesn't fit to your mouse interaction. But suddenly on a tablet it can make total sense to say, I'll use the left hand just to fix something and keep it in place more or less interacts with the right hand, stuff like that.",
      "id": "ep_25_ut_109"
    },
    {
      "end": 1380936,
      "speaker": "Dominikus Baur",
      "start": 1356380,
      "text": "Yeah, yeah. Especially if you know that the visualization that you see on the tablet will somewhat behave like a physical object. So that also makes stuff like discoverability and learnability and so on much more, much easier. It's always nice if people know or if nothing unexpected happens in an app to put it like that.",
      "id": "ep_25_ut_110"
    },
    {
      "end": 1382056,
      "speaker": "Moritz Stefaner",
      "start": 1381068,
      "text": "Nothing breaks.",
      "id": "ep_25_ut_111"
    },
    {
      "end": 1382744,
      "speaker": "Dominikus Baur",
      "start": 1382168,
      "text": "Yeah.",
      "id": "ep_25_ut_112"
    },
    {
      "end": 1394740,
      "speaker": "Moritz Stefaner",
      "start": 1382872,
      "text": "How do you feel? So I feel like on mobile it's a bit harder to do very exploratory visualizations or very complex ones, but you have lots of filter settings and different options.",
      "id": "ep_25_ut_113"
    },
    {
      "end": 1402392,
      "speaker": "Enrico Bertini",
      "start": 1396440,
      "text": "You just told my question mark, how.",
      "id": "ep_25_ut_114"
    },
    {
      "end": 1429110,
      "speaker": "Moritz Stefaner",
      "start": 1402416,
      "text": "Do you work with that? I mean, is it just because we are not so used to do complex things on a mobile? Orlando, should we just like keep things a bit simpler and a bit more, let's say, put things, let's rather produce a series of five simple charts and put them in a nice sequence instead of producing that big data visualization. What's your take on that? Is it like visible difference or just.",
      "id": "ep_25_ut_115"
    },
    {
      "end": 1484970,
      "speaker": "Dominikus Baur",
      "start": 1431730,
      "text": "So. I think that when we think back to the whole context thing, so if I'm waiting for a bus somewhere and I have two minutes to kill, then maybe I don't want to go into the full scale data analysis that I had planned for weeks. So I guess it's definitely better to do complex analysis on a laptop, on a computer, especially as the screen is bigger and so on. So mobile definitely has its place, of course. But I think it's more relevant for more of these small scale visualizations that are heavily focused on presentation, for example. So the stuff you see a lot in journalism, for example, where the actual message is clear and you can explore a little bit, but not too much.",
      "id": "ep_25_ut_116"
    },
    {
      "end": 1524370,
      "speaker": "Enrico Bertini",
      "start": 1486560,
      "text": "But at the same time I'm wondering if there is a space for some sort of analytical kind of tasks performed with this kind of devices. I don't know. I imagine people working in the field or have you ever heard anything like that? I'm just curious because I'm not familiar with anything similar to that. But I guess in principle there might be people around who actually need to do some sort of analytical task on the field. And having mobile devices with some sort of visualization there might help. I don't know. Have you ever heard of anything like that?",
      "id": "ep_25_ut_117"
    },
    {
      "end": 1568962,
      "speaker": "Dominikus Baur",
      "start": 1524950,
      "text": "Yeah, definitely. There are these things, of course, you don't hear too much about them because they're mostly specifically developed for a certain use case. So you have, I don't know, engineers for example, that are working on something like on a ship or so. But I guess even for regular people it might be interesting if we think back to the whole live vlogging stuff. So if I want to look up something while I'm on the go. So imagine you have this great song that's stuck in your head and you can't remember the name and you want to look it up to tell it to your friend. I mean that's somewhat an analytical task. It's very small, but just how to.",
      "id": "ep_25_ut_118"
    },
    {
      "end": 1570586,
      "speaker": "Moritz Stefaner",
      "start": 1568986,
      "text": "Book a flight or something, you know.",
      "id": "ep_25_ut_119"
    },
    {
      "end": 1571978,
      "speaker": "Dominikus Baur",
      "start": 1570658,
      "text": "Or something like that.",
      "id": "ep_25_ut_120"
    },
    {
      "end": 1605960,
      "speaker": "Moritz Stefaner",
      "start": 1572154,
      "text": "It's a complex task too. I mean it's really hard to book a good flight. Right. And I'm always frustrated then if the mobile application just, you know, offers a list of three flights and a big buy now, but, and then I have to go back to the desktop actually and you know, use kayak or hipmunkers or something like that. And so. Yeah, and I think there could be really nice applications for also these, let's say, halfway complex tasks.",
      "id": "ep_25_ut_121"
    },
    {
      "end": 1638920,
      "speaker": "Enrico Bertini",
      "start": 1606780,
      "text": "Yeah. And I also think, as you mentioned, the whole area of life logging and also this trend, what is it called, quantified self. The idea of monitoring yourself is probably very interesting there. Right. You might want. So as soon as you have reached sources that are monitoring aspects of your own life, you might want to be able to check that with some sort of visualization on a regular basis. Right. And then a mobile, mobile visualization would work really well there. Right?",
      "id": "ep_25_ut_122"
    },
    {
      "end": 1650878,
      "speaker": "Dominikus Baur",
      "start": 1639220,
      "text": "Yeah. It's a lot of data that you can collect about yourself, especially if you do it automatically. So visualization is usually the way to go, I would say.",
      "id": "ep_25_ut_123"
    },
    {
      "end": 1651626,
      "speaker": "Enrico Bertini",
      "start": 1651044,
      "text": "Yeah.",
      "id": "ep_25_ut_124"
    },
    {
      "end": 1656178,
      "speaker": "Moritz Stefaner",
      "start": 1651738,
      "text": "But again, wouldn't you use the mobile to collect it? But then the desktop probably too.",
      "id": "ep_25_ut_125"
    },
    {
      "end": 1660122,
      "speaker": "Dominikus Baur",
      "start": 1656354,
      "text": "Yeah, but you might want to have access to your data on the go as well.",
      "id": "ep_25_ut_126"
    },
    {
      "end": 1660870,
      "speaker": "Moritz Stefaner",
      "start": 1660186,
      "text": "Yeah.",
      "id": "ep_25_ut_127"
    },
    {
      "end": 1675510,
      "speaker": "Dominikus Baur",
      "start": 1661170,
      "text": "So I think that's the use case. Of course, if you want to do something more complex like, I don't know, comparing your nutritional behavior to your health or whatever, then you will probably use your desktop for that.",
      "id": "ep_25_ut_128"
    },
    {
      "end": 1696140,
      "speaker": "Enrico Bertini",
      "start": 1675890,
      "text": "Yeah, but I think that's all things. The whole idea of monitoring yourself, I think in order to be effective you have to have some sort of steady kind of feedback. So I think that there will be a need for visualizations on a mobile device that give you a regular access, continuous access to what's going on there. Right.",
      "id": "ep_25_ut_129"
    },
    {
      "end": 1722636,
      "speaker": "Moritz Stefaner",
      "start": 1697120,
      "text": "And I mean, and the other thing is, of course you and your surroundings like I'm in the city, you know, what's around me, where are my friends, all these types of things. That's huge. And I think none of the, let's say traditional visualization people have that on the radar even because it's not a use case for your desktop. Really strong. The use case is not as strong as on the mobile.",
      "id": "ep_25_ut_130"
    },
    {
      "end": 1735740,
      "speaker": "Dominikus Baur",
      "start": 1722788,
      "text": "Yeah. That's one really interesting thing that I haven't really seen so far, location based visualization. So filtering your data based on where you are at the moment, for example.",
      "id": "ep_25_ut_131"
    },
    {
      "end": 1740856,
      "speaker": "Moritz Stefaner",
      "start": 1738280,
      "text": "That would be pretty cool and stuff like that.",
      "id": "ep_25_ut_132"
    },
    {
      "end": 1756360,
      "speaker": "Dominikus Baur",
      "start": 1741008,
      "text": "Yeah. So the map applications are far beyond that. Yeah, of course maps are visualizations, but in some way. No, they've been around for so long, little niche area, nobody uses them anyway.",
      "id": "ep_25_ut_133"
    },
    {
      "end": 1758336,
      "speaker": "Moritz Stefaner",
      "start": 1756400,
      "text": "No, no.",
      "id": "ep_25_ut_134"
    },
    {
      "end": 1802660,
      "speaker": "Enrico Bertini",
      "start": 1758368,
      "text": "But now I'm thinking that mobile devices could imprint. I don't know if anyone is already using that for this purpose, but in principle they can also have some sensing devices on, attached to them. Right. And if there is anything that you need to sense from the environment, then you might need to have some sort of visualization to. To display whatever it's sensed. Right. I mean, I'm reasoning on a very abstract level, but I think the smell of gram. Yeah, the smell of. I was good to say something really bad. Yeah, whatever. I don't know. I mean, why not? Why not? At least from an artistic, for artistic purposes, that would be nice.",
      "id": "ep_25_ut_135"
    },
    {
      "end": 1804376,
      "speaker": "Dominikus Baur",
      "start": 1803680,
      "text": "Sure.",
      "id": "ep_25_ut_136"
    },
    {
      "end": 1821058,
      "speaker": "Enrico Bertini",
      "start": 1804528,
      "text": "Do you remember those glasses that they used to, I don't know if you had that in Germany, we used to have that in Italy that you could buy these glasses that allegedly they allowed you to see. To see through clothes. I don't know.",
      "id": "ep_25_ut_137"
    },
    {
      "end": 1822474,
      "speaker": "Dominikus Baur",
      "start": 1821114,
      "text": "Yours work? I don't know.",
      "id": "ep_25_ut_138"
    },
    {
      "end": 1829570,
      "speaker": "Enrico Bertini",
      "start": 1822482,
      "text": "I never tried, but I remember when I was a kid, this, this kind of glasses, they were sold in magazines.",
      "id": "ep_25_ut_139"
    },
    {
      "end": 1830874,
      "speaker": "Moritz Stefaner",
      "start": 1829610,
      "text": "All your pocket money on the.",
      "id": "ep_25_ut_140"
    },
    {
      "end": 1833790,
      "speaker": "Enrico Bertini",
      "start": 1830922,
      "text": "Yeah, yeah, yeah.",
      "id": "ep_25_ut_141"
    },
    {
      "end": 1836190,
      "speaker": "Moritz Stefaner",
      "start": 1834290,
      "text": "Now it's an app on the app store.",
      "id": "ep_25_ut_142"
    },
    {
      "end": 1840042,
      "speaker": "Dominikus Baur",
      "start": 1839490,
      "text": "Buy it.",
      "id": "ep_25_ut_143"
    },
    {
      "end": 1840870,
      "speaker": "Moritz Stefaner",
      "start": 1840066,
      "text": "It works.",
      "id": "ep_25_ut_144"
    },
    {
      "end": 1848582,
      "speaker": "Enrico Bertini",
      "start": 1841010,
      "text": "Sure. I should actually totally works. You tried? Of course. Yeah.",
      "id": "ep_25_ut_145"
    },
    {
      "end": 1850494,
      "speaker": "Moritz Stefaner",
      "start": 1848646,
      "text": "I don't know. Yeah. Interesting.",
      "id": "ep_25_ut_146"
    },
    {
      "end": 1852182,
      "speaker": "Enrico Bertini",
      "start": 1850582,
      "text": "Yeah, very interesting.",
      "id": "ep_25_ut_147"
    },
    {
      "end": 1864654,
      "speaker": "Moritz Stefaner",
      "start": 1852286,
      "text": "But it's. Right, I mean, I haven't seen that much really great visualization on mobile device. Like occasionally a nice app or a nice little trick, but it's probably very early, right.",
      "id": "ep_25_ut_148"
    },
    {
      "end": 1872956,
      "speaker": "Enrico Bertini",
      "start": 1864702,
      "text": "I mean, visualization itself is very young visualization on mobile touch devices. It's really, really young. Right?",
      "id": "ep_25_ut_149"
    },
    {
      "end": 1875732,
      "speaker": "Moritz Stefaner",
      "start": 1873148,
      "text": "Yeah. And there's also a technical barrier.",
      "id": "ep_25_ut_150"
    },
    {
      "end": 1884640,
      "speaker": "Enrico Bertini",
      "start": 1875916,
      "text": "Yeah. So Dominicos, what's the coolest thing you have seen on the coolest visualization you've seen on mobile devices apart from yours except your.",
      "id": "ep_25_ut_151"
    },
    {
      "end": 1931620,
      "speaker": "Dominikus Baur",
      "start": 1885300,
      "text": "Oh man. I wanted to say that. So actually, one of my personal favorites is the Datum app. So the companion app to Nicholas Felton's live logging service. So I think that is really well done. And he did that, I don't know, two or three years ago. Even. So, it's really old as well for app store lifespans. So, yeah, that is really neat. It uses visualization to present your data and you can even explore it a little bit. Of course, it works better using a browser and a laptop, but that is really nicely done.",
      "id": "ep_25_ut_152"
    },
    {
      "end": 1937532,
      "speaker": "Moritz Stefaner",
      "start": 1931780,
      "text": "He has a new app now, but I don't think it's public. But he has a reporter app that nags him every 15 minutes.",
      "id": "ep_25_ut_153"
    },
    {
      "end": 1944300,
      "speaker": "Dominikus Baur",
      "start": 1937716,
      "text": "Yeah, I heard that. So he's still teasing that it's supposed to be come out in fall or so.",
      "id": "ep_25_ut_154"
    },
    {
      "end": 1945960,
      "speaker": "Moritz Stefaner",
      "start": 1944340,
      "text": "I don't know if it's a mass product.",
      "id": "ep_25_ut_155"
    },
    {
      "end": 1948660,
      "speaker": "Enrico Bertini",
      "start": 1947740,
      "text": "What is that?",
      "id": "ep_25_ut_156"
    },
    {
      "end": 1950504,
      "speaker": "Dominikus Baur",
      "start": 1948780,
      "text": "Maybe he's the only one who wants that.",
      "id": "ep_25_ut_157"
    },
    {
      "end": 1958220,
      "speaker": "Moritz Stefaner",
      "start": 1950652,
      "text": "It nags you every 15 minutes to enter some data. Like, what are you doing? Who are you with? Are you having fun? And so on.",
      "id": "ep_25_ut_158"
    },
    {
      "end": 1964780,
      "speaker": "Dominikus Baur",
      "start": 1960960,
      "text": "So if you want to do annual reports, then you need something like that, I guess.",
      "id": "ep_25_ut_159"
    },
    {
      "end": 1973808,
      "speaker": "Moritz Stefaner",
      "start": 1965280,
      "text": "No, but I agree, the data map is really kind of neat. It's very simple and it more or less automatically creates all these graphs based on your data. It's kind of nice.",
      "id": "ep_25_ut_160"
    },
    {
      "end": 2038320,
      "speaker": "Dominikus Baur",
      "start": 1973944,
      "text": "Yeah. And, I mean, so you can find a lot of visualization things on the app store, but they mostly fall into two categories. So on the one hand, you have these presentation apps that allow you to create some type of presentation, like haiku deck or Apple's keynote, of course. So you have your pie charts handy and you can present them immediately. And then the other category is business intelligence. So it's things like, even things like Tableau, for example, that have an iPad version. So you can find that. But all of these apps aren't terribly exciting, I think. So there. Well, there are bar charts and pie charts and line charts, and it works and it's well done usually, but it doesn't really use touch, to be honest.",
      "id": "ep_25_ut_161"
    },
    {
      "end": 2050080,
      "speaker": "Enrico Bertini",
      "start": 2038620,
      "text": "But what kind of need do you think they cover? I'm curious about that. So why do people use Tableau on an iPhone? I mean, it's because they.",
      "id": "ep_25_ut_162"
    },
    {
      "end": 2063220,
      "speaker": "Dominikus Baur",
      "start": 2055900,
      "text": "Kind of mislead if you're sitting on your couch and trying to do some data analysis. I don't know.",
      "id": "ep_25_ut_163"
    },
    {
      "end": 2095082,
      "speaker": "Moritz Stefaner",
      "start": 2064640,
      "text": "I think at the moment, a lot of tablet apps are being like, are for many companies the chance to try something new? So they have a website already, but you cannot change that too much. You know, it's like, yeah, we can't lose like confuse the people, you know, and so on. But if you work on the iPad app, you can basically do what you want. And so I think many people tryouts like, funny stuff in the apps just to see what happens. Yeah. What happens and what makes sense and what doesn't. So it's actually kind of.",
      "id": "ep_25_ut_164"
    },
    {
      "end": 2113332,
      "speaker": "Dominikus Baur",
      "start": 2095186,
      "text": "That could be. Yeah. And also you shouldn't underestimate the business market for things like that, I guess. So that people not only want to have some application for the PCs of their workforce, but also for the tablets of the managers.",
      "id": "ep_25_ut_165"
    },
    {
      "end": 2114776,
      "speaker": "Enrico Bertini",
      "start": 2113426,
      "text": "Yeah, sure.",
      "id": "ep_25_ut_166"
    },
    {
      "end": 2128780,
      "speaker": "Moritz Stefaner",
      "start": 2114928,
      "text": "I've seen a few nice sports apps, like visualizations. Like there was like a real time visualization of soccer matches, I think, two or three years ago already. Can't remember the name though.",
      "id": "ep_25_ut_167"
    },
    {
      "end": 2131304,
      "speaker": "Dominikus Baur",
      "start": 2129320,
      "text": "Yeah, that was during some World Cup.",
      "id": "ep_25_ut_168"
    },
    {
      "end": 2150960,
      "speaker": "Moritz Stefaner",
      "start": 2131352,
      "text": "World cup, yes, exactly. Yeah. You see, we're all experts here, but that's a good use case. Of course, this whole second screen, like, you support like a sports event or like some shared event with an extra layer of information. Everybody's after that, basically.",
      "id": "ep_25_ut_169"
    },
    {
      "end": 2161252,
      "speaker": "Enrico Bertini",
      "start": 2151700,
      "text": "So in a way, now that I think about it, even your Moritz, even your Emoto project could have been something developed on a. Yeah, yeah, we had.",
      "id": "ep_25_ut_170"
    },
    {
      "end": 2184494,
      "speaker": "Moritz Stefaner",
      "start": 2161276,
      "text": "That use case in mind. I mean, we didn't like really aim it exactly at that, but we had that use case in mind. And we also had a few mock ups with like an iPad, our site, running on it. It basically also worked, but we also learned you have to sort of. Yeah, you have to boil things down a bit more than for the desktop in order to make it really work nicely on a mobile.",
      "id": "ep_25_ut_171"
    },
    {
      "end": 2186102,
      "speaker": "Enrico Bertini",
      "start": 2184622,
      "text": "Yeah, sure.",
      "id": "ep_25_ut_172"
    },
    {
      "end": 2204750,
      "speaker": "Moritz Stefaner",
      "start": 2186286,
      "text": "Yeah. You know what would be nice on a tablet? A really nice atlas. Like something you can browse through forever, like super detailed maps and statistics around the world. Like, where's National Geographic these days? Yeah, I mean, they could totally do something like that.",
      "id": "ep_25_ut_173"
    },
    {
      "end": 2208610,
      "speaker": "Dominikus Baur",
      "start": 2204830,
      "text": "Yeah, they have an iPad app, but it's just for the articles.",
      "id": "ep_25_ut_174"
    },
    {
      "end": 2218090,
      "speaker": "Moritz Stefaner",
      "start": 2209350,
      "text": "Right. And I think they had some sort of a Globe app, like world Factbook type thing, but it didn't go very deep.",
      "id": "ep_25_ut_175"
    },
    {
      "end": 2224024,
      "speaker": "Enrico Bertini",
      "start": 2220390,
      "text": "But I'm sure we are going to see much more stuff coming.",
      "id": "ep_25_ut_176"
    },
    {
      "end": 2233612,
      "speaker": "Moritz Stefaner",
      "start": 2224142,
      "text": "No, I think it's going away. Mobile is not staying. I think ghetto blasters are coming back.",
      "id": "ep_25_ut_177"
    },
    {
      "end": 2241604,
      "speaker": "Enrico Bertini",
      "start": 2233676,
      "text": "And we're gonna go back to this bulky, huge, exactly like strap.",
      "id": "ep_25_ut_178"
    },
    {
      "end": 2247108,
      "speaker": "Moritz Stefaner",
      "start": 2241652,
      "text": "You know, you have to carry a computer with a strap. I think it's kind of cool.",
      "id": "ep_25_ut_179"
    },
    {
      "end": 2265200,
      "speaker": "Enrico Bertini",
      "start": 2247284,
      "text": "Yeah, yeah, it's gonna be fun when we will tell our kids that these things existed. I still remember my, the first portable computer. My, my dad bought some quite many years ago. That was really weird.",
      "id": "ep_25_ut_180"
    },
    {
      "end": 2267196,
      "speaker": "Moritz Stefaner",
      "start": 2265580,
      "text": "The size of a washing machine.",
      "id": "ep_25_ut_181"
    },
    {
      "end": 2267884,
      "speaker": "Enrico Bertini",
      "start": 2267308,
      "text": "Yeah, yeah.",
      "id": "ep_25_ut_182"
    },
    {
      "end": 2272800,
      "speaker": "Moritz Stefaner",
      "start": 2267932,
      "text": "It was really, really bulky, portable. Well, if you have ten friends around.",
      "id": "ep_25_ut_183"
    },
    {
      "end": 2327300,
      "speaker": "Enrico Bertini",
      "start": 2274860,
      "text": "That was really weird. Anyway, so another thing I wanted to ask to Dominicos, I think another interesting kind of application is interaction between different devices, right? So in a way, you could. So as soon as you have this kind of mobile touch devices, they can also interact with other screens or devices. Right. So for instance, here we have been, I have seen people in my lab interested in the idea of interacting with large displays using touch devices in the rans. Right. And I guess there is a whole ecology of devices that might want to interact one to another, and it's going to be much easier to interact with one and use this one to pilot something else in other devices, right?",
      "id": "ep_25_ut_184"
    },
    {
      "end": 2398420,
      "speaker": "Dominikus Baur",
      "start": 2328000,
      "text": "Yeah, yeah. I think that makes a lot of sense, especially as we have, most of us have these really small portable devices like smartphones, and then we are surrounded by larger displays in our environment that are not necessarily touch enabled and not necessarily reachable. So I think it makes sense to use your own smartphone to remotely control something, and you don't really see that too often in the consumer market, of course. So I guess it's still a research thing, but people are using their mobile devices while they're watching tv, for example. So having some kind of connection between those might be interesting. I think the next generation of game consoles, like the new Xbox and PlayStation are doing something like that, but I guess it won't go too deep. So you can, I don't know, maybe change the channel using your smartphone or something.",
      "id": "ep_25_ut_185"
    },
    {
      "end": 2421324,
      "speaker": "Enrico Bertini",
      "start": 2398960,
      "text": "Yeah, I think for visualization, that's an interesting opportunity because you can migrate some components of the user interface on the mobile device and free up some space on the visualization side. And also, I have one device that works really well in terms of interaction and one device that works really, really well in terms of visualization.",
      "id": "ep_25_ut_186"
    },
    {
      "end": 2432700,
      "speaker": "Dominikus Baur",
      "start": 2421452,
      "text": "True. Yeah. You can also use your smartphone as a pointing device to select a certain region of the visualization, for example, and do something with that. I don't know, filter it or so.",
      "id": "ep_25_ut_187"
    },
    {
      "end": 2456660,
      "speaker": "Moritz Stefaner",
      "start": 2432860,
      "text": "Yeah, it's kind of exciting perspective. You think about all these screens being around and you could just walk up to a screen and you have your mobile on you. That's your data and your identification token, more or less. You can just grab one of these display spaces and interact with it with your mobile and then move on and stuff like that. So that's very good perspective to have there.",
      "id": "ep_25_ut_188"
    },
    {
      "end": 2473926,
      "speaker": "Dominikus Baur",
      "start": 2457040,
      "text": "If it's fast enough and you don't have any cables, then that might actually be fun. Yeah, of course, the main downside of portable devices is that the screens are so small, so doing something about that might actually be nice.",
      "id": "ep_25_ut_189"
    },
    {
      "end": 2475970,
      "speaker": "Moritz Stefaner",
      "start": 2474078,
      "text": "Battery life is another issue.",
      "id": "ep_25_ut_190"
    },
    {
      "end": 2489726,
      "speaker": "Dominikus Baur",
      "start": 2476430,
      "text": "Oh yeah, that, yeah, I think by now we've already reached the point where a laptop battery actually lasts longer than a smartphone battery.",
      "id": "ep_25_ut_191"
    },
    {
      "end": 2496530,
      "speaker": "Enrico Bertini",
      "start": 2489798,
      "text": "It's true, it's true. My iPhone is terrible.",
      "id": "ep_25_ut_192"
    },
    {
      "end": 2508772,
      "speaker": "Dominikus Baur",
      "start": 2497940,
      "text": "Oh, yours as well? Yeah, at some point the batteries just give in. I guess that's just the way it works, so.",
      "id": "ep_25_ut_193"
    },
    {
      "end": 2529480,
      "speaker": "Enrico Bertini",
      "start": 2508796,
      "text": "But that's the thing from the technological point of view, how much harder it is to implement visualization on, let's say, an iPad or any other mobile device. I think the technological component or challenges there is also a very interesting angle. So what's your experience with that?",
      "id": "ep_25_ut_194"
    },
    {
      "end": 2630876,
      "speaker": "Dominikus Baur",
      "start": 2530180,
      "text": "Okay, so I think there are two ways to develop visualizations at the moment, I think for any platform. So one is do it natively, so create an actual application that is specifically written for this type of device or do it on the web. And of course the web is newer and better and we have D3 there, so everything is great. But the problem with using a web based visualization on a mobile device is that mobile devices are really slow compared to an actual computer. So with the Touchwave project, we started out with a web based visualization and then we went to a native implementation just because it didn't work at all. So it was just basically it looked like this terrible slideshow of a visualization. So yeah, I can, I don't know, it always depends on what you want to do. So if you have a more complex visualization and animations and things like that, then you probably can't avoid going native. And of course that has all the downsides of if you develop for iOS, then it won't run on Android and vice versa. And you have this whole zoo of devices and operating systems and yeah, you always restrict your, your market.",
      "id": "ep_25_ut_195"
    },
    {
      "end": 2638290,
      "speaker": "Enrico Bertini",
      "start": 2631068,
      "text": "So you basically code everything if you want to cover more than one native device.",
      "id": "ep_25_ut_196"
    },
    {
      "end": 2651326,
      "speaker": "Dominikus Baur",
      "start": 2638670,
      "text": "Pretty much, yeah. So, and iOS is objective C, of course, and Android is Java, so it's completely different. You can't really reuse any code. Okay. Yeah.",
      "id": "ep_25_ut_197"
    },
    {
      "end": 2659718,
      "speaker": "Enrico Bertini",
      "start": 2651358,
      "text": "And how are the graphical libraries there? Are they usable, reasonably usable or it's just.",
      "id": "ep_25_ut_198"
    },
    {
      "end": 2691334,
      "speaker": "Dominikus Baur",
      "start": 2659774,
      "text": "Yeah, my main experience is with iOS and core animation, I think it's called on iOS, there's also called core graphics, which is on OS X then, and that is a really nice library. So once you get the whole objective c stuff, once you understand that, which takes you around, I don't know, a year maybe, that's a really great library.",
      "id": "ep_25_ut_199"
    },
    {
      "end": 2694850,
      "speaker": "Enrico Bertini",
      "start": 2691422,
      "text": "Fantastic. Only one year.",
      "id": "ep_25_ut_200"
    },
    {
      "end": 2697730,
      "speaker": "Dominikus Baur",
      "start": 2695310,
      "text": "Yeah, it's a bargain.",
      "id": "ep_25_ut_201"
    },
    {
      "end": 2721786,
      "speaker": "Moritz Stefaner",
      "start": 2698430,
      "text": "I mean, one option might be to have good performance on both platforms, but I'm not 100% sure. But I know that Cinder runs really well on iOS, so it's a C library and you can compile like to have it run on iOS and it like uses hardware acceleration. It's really fast and I think you can also target Android with it, but I'm not 100% sure.",
      "id": "ep_25_ut_202"
    },
    {
      "end": 2726522,
      "speaker": "Dominikus Baur",
      "start": 2721938,
      "text": "Yeah, you can use C code for Android as well, but I don't know.",
      "id": "ep_25_ut_203"
    },
    {
      "end": 2737194,
      "speaker": "Moritz Stefaner",
      "start": 2726546,
      "text": "How then if the talking to the native drivers and whatever, how seamless that works. But that might be an option.",
      "id": "ep_25_ut_204"
    },
    {
      "end": 2759040,
      "speaker": "Dominikus Baur",
      "start": 2737322,
      "text": "Yeah, but of course you always have some necessary work for the adaptation for a different. I don't know what's easier actually, to port a windows application to macOS or iOS application to Android. I'm not sure. You don't want to be in the same ballpark. No.",
      "id": "ep_25_ut_205"
    },
    {
      "end": 2775310,
      "speaker": "Moritz Stefaner",
      "start": 2760580,
      "text": "But for, let's say for prototyping or trying things out. Do you think web, web based technology is an option? If so, how? I mean, occasionally you just rewrote the better life index to work on tablets as well.",
      "id": "ep_25_ut_206"
    },
    {
      "end": 2779478,
      "speaker": "Dominikus Baur",
      "start": 2775430,
      "text": "Oh yeah, that's happened and you got it to work.",
      "id": "ep_25_ut_207"
    },
    {
      "end": 2787422,
      "speaker": "Moritz Stefaner",
      "start": 2779534,
      "text": "So I think there is, if you work hard, an option to make it work with web technologies as well.",
      "id": "ep_25_ut_208"
    },
    {
      "end": 2825046,
      "speaker": "Dominikus Baur",
      "start": 2787566,
      "text": "Yeah, you can do that. Of course you lose all the niceties of things like SVG for example, where you just say, okay, this object needs some type of interactivity, do it browser, but you have to derive where a touch landed and things like that. So yeah, optimization is everything. And I guess it's gonna be better pretty soon. So I guess next year's devices are, will be able to run all these web based visualizations without a problem, right?",
      "id": "ep_25_ut_209"
    },
    {
      "end": 2835918,
      "speaker": "Moritz Stefaner",
      "start": 2825118,
      "text": "Yeah, yeah. So this one was done in canvas in the end, so we tried out a few alternatives in the beginning and in the end I think you threw out most of the third party libraries.",
      "id": "ep_25_ut_210"
    },
    {
      "end": 2847980,
      "speaker": "Dominikus Baur",
      "start": 2836014,
      "text": "Yeah, we actually started with paper js as a graphics library that sat on top of canvas, but that was too slow. Even. So now everything's happening natively.",
      "id": "ep_25_ut_211"
    },
    {
      "end": 2854120,
      "speaker": "Enrico Bertini",
      "start": 2848600,
      "text": "So this is what migration of the better life index on mobile devices, right?",
      "id": "ep_25_ut_212"
    },
    {
      "end": 2864224,
      "speaker": "Moritz Stefaner",
      "start": 2854160,
      "text": "Yeah. So there's a complete HTML five rewrite. At the moment it's just the fallback option, but soon it's going to be the default because it's very, very close to the flash version.",
      "id": "ep_25_ut_213"
    },
    {
      "end": 2868536,
      "speaker": "Enrico Bertini",
      "start": 2864312,
      "text": "So this is something you guys are still working on or it's something that is out.",
      "id": "ep_25_ut_214"
    },
    {
      "end": 2870360,
      "speaker": "Moritz Stefaner",
      "start": 2868688,
      "text": "It's basically done, but it's not out.",
      "id": "ep_25_ut_215"
    },
    {
      "end": 2871260,
      "speaker": "Enrico Bertini",
      "start": 2870440,
      "text": "Okay.",
      "id": "ep_25_ut_216"
    },
    {
      "end": 2873460,
      "speaker": "Moritz Stefaner",
      "start": 2872240,
      "text": "Limbo again?",
      "id": "ep_25_ut_217"
    },
    {
      "end": 2875060,
      "speaker": "Dominikus Baur",
      "start": 2873760,
      "text": "Limbo again.",
      "id": "ep_25_ut_218"
    },
    {
      "end": 2909390,
      "speaker": "Enrico Bertini",
      "start": 2877380,
      "text": "Okay, so another thing I wanted to ask to Dominicos. I mean, I'm really interested on the research side, as you may guess. And I'm wondering, I know that you know research really well, so are there any other results around or other than your, your work that we've been talking about before? Every researcher trying try to tackle this kind of issues and understand what works when, how, stuff like that.",
      "id": "ep_25_ut_219"
    },
    {
      "end": 2912642,
      "speaker": "Dominikus Baur",
      "start": 2910730,
      "text": "You mean for mobile devices?",
      "id": "ep_25_ut_220"
    },
    {
      "end": 2915630,
      "speaker": "Enrico Bertini",
      "start": 2912826,
      "text": "I mean for visualization on mobile devices.",
      "id": "ep_25_ut_221"
    },
    {
      "end": 3023980,
      "speaker": "Dominikus Baur",
      "start": 2916330,
      "text": "Okay, so there's, there's been this, this really old line of research, so old in terms of computer science, you know how it is. So this five year old line of research that has been going for visualizations on these personal digital assistants and feature phones. So that was really interesting. So you had actually scatter plots on feature phones that you could control using your numpad and then that line of stopped for some reason. But I guess visualization was more of a topic in the tabletop community. So with these really huge touch enabled table like interactive surfaces. And there was a lot of research that went into this direction, especially if you think about collaboration. For example, tabletops are huge enough that more than one person can use them at the same time. So multitouch was always a topic just because you had multiple people interacting with the visualization. And then the question became, okay, how do you solve problems like the orientation of the interface, for example, that labels are still readable even if people are standing around the table? So yeah, there's a lot of research in this regard. The question of course is how much of it is applicable to our current state of affairs. So the current mobile devices and touch enabled tablets?",
      "id": "ep_25_ut_222"
    },
    {
      "end": 3025312,
      "speaker": "Enrico Bertini",
      "start": 3024880,
      "text": "Sure.",
      "id": "ep_25_ut_223"
    },
    {
      "end": 3030620,
      "speaker": "Dominikus Baur",
      "start": 3025376,
      "text": "Because, well, I don't know. Enrico, do you have a tabletop at home? An interactive one?",
      "id": "ep_25_ut_224"
    },
    {
      "end": 3103154,
      "speaker": "Enrico Bertini",
      "start": 3031640,
      "text": "I just ordered one also. That was you? No, honestly, what I would really like to do is to. So I have an interest for touch displays and I think I've been discussing this thing with Moritz before offline and I think, I don't know, I know that quite a lot of researchers have been spending time observing people interacting on top of tabletops, but I would be really curious to see people interacting on touch displays that are not too, too big and they are vertical. So my gut feeling is that there is quite a big difference there and I have no idea why. Oh, maybe it's, I mean, maybe this research is taking place and I don't know anything about it, but my feeling is that standing in front of a touch display is going to be a much richer kind of experience. So, for instance, the problem that you just mentioned, the fact that you, you have an orientation problem, that's not going to happen if two persons are standing in front of a screen, right?",
      "id": "ep_25_ut_225"
    },
    {
      "end": 3103946,
      "speaker": "Dominikus Baur",
      "start": 3103242,
      "text": "Sure. Yeah.",
      "id": "ep_25_ut_226"
    },
    {
      "end": 3149046,
      "speaker": "Enrico Bertini",
      "start": 3104018,
      "text": "And at the same time, I think that it's even kind of a more natural kind of interaction between people. People are very much used on standing in front of a whiteboard. So it's a very natural transfer from the whiteboard to a touch display. Right. And the other thing I've seen quite a lot in research is people interacting with very large displays, but very, very large, and again, with indirect devices. Right. So I'm actually really wondering why there's not a lot of research, as far as I know, on people interacting on this medium sized kind of touch displays. Because to me it looks something like really, really interesting and much, much more natural than all the rest. I don't know.",
      "id": "ep_25_ut_227"
    },
    {
      "end": 3151022,
      "speaker": "Moritz Stefaner",
      "start": 3149198,
      "text": "It's also more realistic in an apartment.",
      "id": "ep_25_ut_228"
    },
    {
      "end": 3151846,
      "speaker": "Enrico Bertini",
      "start": 3151046,
      "text": "It's much more realistic.",
      "id": "ep_25_ut_229"
    },
    {
      "end": 3156610,
      "speaker": "Moritz Stefaner",
      "start": 3151878,
      "text": "Or an office to have like something big on the wall and something big in the middle of the room.",
      "id": "ep_25_ut_230"
    },
    {
      "end": 3158274,
      "speaker": "Enrico Bertini",
      "start": 3156690,
      "text": "Yeah, yeah, yeah.",
      "id": "ep_25_ut_231"
    },
    {
      "end": 3177114,
      "speaker": "Moritz Stefaner",
      "start": 3158322,
      "text": "If you think about it, yeah, no, yeah, I totally agree. And I mean, these like 50 inch type displays, they are totally coming and they're getting much more, much cheaper and they're really nice things to have, like many of the new tvs also have now this type of size. And, yeah, why not touch enable all of them and yeah, yeah.",
      "id": "ep_25_ut_232"
    },
    {
      "end": 3203038,
      "speaker": "Dominikus Baur",
      "start": 3177162,
      "text": "Especially as you can just buy, buy and touch overlay for, I don't know, $150 or so to refit the whole thing to touch. Yeah, it somehow seems that all of these vertical interactive types of displays are. They always had to be huge. So really wall size, everything on the.",
      "id": "ep_25_ut_233"
    },
    {
      "end": 3228640,
      "speaker": "Enrico Bertini",
      "start": 3203054,
      "text": "Wall size is a big ego boosting kind of problem here. No, see, I'm serious. I mean, I think it's the fact that having a huge display, looks, having shows how powerful you are or something like that. I mean, I can totally sympathize with this thing. I would like to have my own huge display, but I cannot afford it yet. But, yeah, but I think it would be much, much interesting.",
      "id": "ep_25_ut_234"
    },
    {
      "end": 3236420,
      "speaker": "Moritz Stefaner",
      "start": 3228680,
      "text": "And what do you do with information? Like on the tip of your knees? It doesn't help you that much.",
      "id": "ep_25_ut_235"
    },
    {
      "end": 3244296,
      "speaker": "Dominikus Baur",
      "start": 3236960,
      "text": "Yeah, that maybe might have been an outcome of this whole notion of the more pixels we have, the more data we can display.",
      "id": "ep_25_ut_236"
    },
    {
      "end": 3245032,
      "speaker": "Moritz Stefaner",
      "start": 3244408,
      "text": "Yeah.",
      "id": "ep_25_ut_237"
    },
    {
      "end": 3250304,
      "speaker": "Dominikus Baur",
      "start": 3245176,
      "text": "So if we have this wall full of data, then we can get all the insights.",
      "id": "ep_25_ut_238"
    },
    {
      "end": 3251952,
      "speaker": "Enrico Bertini",
      "start": 3250392,
      "text": "Even though it must be related to.",
      "id": "ep_25_ut_239"
    },
    {
      "end": 3253672,
      "speaker": "Moritz Stefaner",
      "start": 3251976,
      "text": "This big data hype that it has.",
      "id": "ep_25_ut_240"
    },
    {
      "end": 3262512,
      "speaker": "Dominikus Baur",
      "start": 3253696,
      "text": "To be like life size. You should put the big data on a big wall. And that might solve all the problems. Yeah, yeah.",
      "id": "ep_25_ut_241"
    },
    {
      "end": 3275936,
      "speaker": "Enrico Bertini",
      "start": 3262536,
      "text": "But then it's crazy, because you have the problem that you have to. You cannot stand too close, and if you are too close, you. You lose the context. Right. So you have many more peaks running.",
      "id": "ep_25_ut_242"
    },
    {
      "end": 3277020,
      "speaker": "Moritz Stefaner",
      "start": 3275968,
      "text": "Around, like back and forth.",
      "id": "ep_25_ut_243"
    },
    {
      "end": 3287040,
      "speaker": "Enrico Bertini",
      "start": 3277060,
      "text": "Yeah, you have many, many more pixels, but your field of view is. I mean, the interaction with your field of view is much, much more complex. Right, sure.",
      "id": "ep_25_ut_244"
    },
    {
      "end": 3298188,
      "speaker": "Dominikus Baur",
      "start": 3287660,
      "text": "Well, the cute thing about these walls is that you actually make zooming and panning a physical thing, because you have to walk in front of the wall to and fro.",
      "id": "ep_25_ut_245"
    },
    {
      "end": 3299240,
      "speaker": "Enrico Bertini",
      "start": 3298284,
      "text": "Sure, sure.",
      "id": "ep_25_ut_246"
    },
    {
      "end": 3302624,
      "speaker": "Dominikus Baur",
      "start": 3299820,
      "text": "I don't know. Maybe that was the idea.",
      "id": "ep_25_ut_247"
    },
    {
      "end": 3329770,
      "speaker": "Enrico Bertini",
      "start": 3302772,
      "text": "Yeah, yeah, yeah, yeah. Well, when I was in Konstanz, we had this huge power wall. There is an old room that is called power wall room, actually. I think they actually just kind of renovated it a few weeks ago. This is what I heard. And it's. It was stunning. Definitely. It was really stunning. I mean, and it's. It's really nice when you can come. When you can come closer. You can see a lot of details. It really scales very well. But in terms of interaction is a nightmare.",
      "id": "ep_25_ut_248"
    },
    {
      "end": 3332374,
      "speaker": "Moritz Stefaner",
      "start": 3329840,
      "text": "I mean, did it have touch interaction? No, it's.",
      "id": "ep_25_ut_249"
    },
    {
      "end": 3355422,
      "speaker": "Enrico Bertini",
      "start": 3332422,
      "text": "No, of course, you cannot even. You're not even allowed touch it because you. It can get dirty and the power is too powerful. Yeah, yeah. It's a totally cool piece of technology. If you go in the. In the back room and you see the projectors that are working there to project these images that are very high resolution.",
      "id": "ep_25_ut_250"
    },
    {
      "end": 3356326,
      "speaker": "Moritz Stefaner",
      "start": 3355446,
      "text": "So it's a back projection.",
      "id": "ep_25_ut_251"
    },
    {
      "end": 3370218,
      "speaker": "Enrico Bertini",
      "start": 3356358,
      "text": "Yeah, it's back projection, and it's a whole array of projectors. And I I think they had to develop their own infrastructure to pilot these projectors in a way that they are very well aligned and that they synchronize themselves.",
      "id": "ep_25_ut_252"
    },
    {
      "end": 3372990,
      "speaker": "Moritz Stefaner",
      "start": 3370274,
      "text": "It's nuclear reactor in the yard.",
      "id": "ep_25_ut_253"
    },
    {
      "end": 3377230,
      "speaker": "Enrico Bertini",
      "start": 3373890,
      "text": "There is a huge fan that is taken care of.",
      "id": "ep_25_ut_254"
    },
    {
      "end": 3380310,
      "speaker": "Moritz Stefaner",
      "start": 3377970,
      "text": "The whole city of console is probably heated.",
      "id": "ep_25_ut_255"
    },
    {
      "end": 3396320,
      "speaker": "Enrico Bertini",
      "start": 3382730,
      "text": "Yeah. Plus, I think even the glass itself is a very special kind of glass. It's a very fine piece of technology. Really, really stunning. Yeah. But then, in terms of interaction is really complicated.",
      "id": "ep_25_ut_256"
    },
    {
      "end": 3413372,
      "speaker": "Dominikus Baur",
      "start": 3397500,
      "text": "Yeah. So you mentioned before this interaction between multiple different types of devices, and of course, such a powerball might become much more usable if you have smartphones or tablets that people can then use to.",
      "id": "ep_25_ut_257"
    },
    {
      "end": 3417404,
      "speaker": "Moritz Stefaner",
      "start": 3413396,
      "text": "Point at stuff, interact with it like this. Yeah, that totally makes sense.",
      "id": "ep_25_ut_258"
    },
    {
      "end": 3420440,
      "speaker": "Dominikus Baur",
      "start": 3417492,
      "text": "But then why do you have this huge wall?",
      "id": "ep_25_ut_259"
    },
    {
      "end": 3423492,
      "speaker": "Enrico Bertini",
      "start": 3421780,
      "text": "Yeah, yeah.",
      "id": "ep_25_ut_260"
    },
    {
      "end": 3430716,
      "speaker": "Moritz Stefaner",
      "start": 3423516,
      "text": "Maybe just for, like, having this landscape in context, and then the details happen on more high res, smaller devices.",
      "id": "ep_25_ut_261"
    },
    {
      "end": 3431324,
      "speaker": "Dominikus Baur",
      "start": 3430908,
      "text": "Maybe.",
      "id": "ep_25_ut_262"
    },
    {
      "end": 3437692,
      "speaker": "Moritz Stefaner",
      "start": 3431372,
      "text": "But there's also like this, you know, minority report. I don't know if we open like this box now, but I mean, these are the.",
      "id": "ep_25_ut_263"
    },
    {
      "end": 3438644,
      "speaker": "Dominikus Baur",
      "start": 3437796,
      "text": "It's getting late.",
      "id": "ep_25_ut_264"
    },
    {
      "end": 3456636,
      "speaker": "Moritz Stefaner",
      "start": 3438732,
      "text": "Yeah, it's getting late for that. But I mean, no, there is an actual problem there that it's very fatiguing just to interact with these big things. Yeah, you need to make big gestures which cost you big energy and are big time. Very unusual. And, yeah, after ten minutes you're like, what?",
      "id": "ep_25_ut_265"
    },
    {
      "end": 3484076,
      "speaker": "Dominikus Baur",
      "start": 3456788,
      "text": "Yeah, and not only with big things. I mean, we also have that with touch enabled laptops, for example, where you actually have to reach out and move stuff on the display. And I think people still prefer mice to do that just because it's much more ergonomical. So I mean, that's a huge downside of the whole touch thing, that you often have to lift your arms and that is very tiresome.",
      "id": "ep_25_ut_266"
    },
    {
      "end": 3486300,
      "speaker": "Moritz Stefaner",
      "start": 3484188,
      "text": "Makes strange types of movements as well.",
      "id": "ep_25_ut_267"
    },
    {
      "end": 3499128,
      "speaker": "Dominikus Baur",
      "start": 3486460,
      "text": "Yeah, so I mean, of course, minority report, it's very impressive. And he only has to use the interface for, I don't know, 30 seconds per day, so that's fine.",
      "id": "ep_25_ut_268"
    },
    {
      "end": 3523624,
      "speaker": "Moritz Stefaner",
      "start": 3499324,
      "text": "Exactly. Yeah, yeah. But there's one since like oblong industries, they actually, they built these interfaces and they sell them and also these big screen like combinations of different screens and. Yeah, it's very interesting. Also, we could also have an episode on these types of interfaces at some point, gestures like in space, but it's also. Yeah, it's a whole new type of sport you have to become good at.",
      "id": "ep_25_ut_269"
    },
    {
      "end": 3565020,
      "speaker": "Enrico Bertini",
      "start": 3523712,
      "text": "And speaking of big screens, why not having your personal dome? That would be fun. Okay, there is one last thing I wanted to ask to Dominicos. So I'm wondering maybe some of our listeners might want to start doing visualization on mobile devices. So can you give some suggestions on how to start in terms of technology, even in terms of design, things to watch for? What are the main principles or what are the main technologies to start with? So what's the best way to start with visualization on mobile devices?",
      "id": "ep_25_ut_270"
    },
    {
      "end": 3611536,
      "speaker": "Dominikus Baur",
      "start": 3566720,
      "text": "Okay, so I guess it depends on what type of visualization you want to do. So if you want to just port your run of the mill type of visualizations to a tablet, then I would use the web for that. If you already have a background in D3, for example, then you can just use that. And there's a lot of resources on how to program how to do JavaScript for mobile safari, for example, or also for chrome on Android. And well, basically you just have to replace your mouse events with a touch events and you're all set.",
      "id": "ep_25_ut_271"
    },
    {
      "end": 3614112,
      "speaker": "Moritz Stefaner",
      "start": 3611728,
      "text": "So it's make your buttons bigger, of.",
      "id": "ep_25_ut_272"
    },
    {
      "end": 3665796,
      "speaker": "Dominikus Baur",
      "start": 3614136,
      "text": "Course, and make your buttons bigger. It's a takeaway message from this episode, but I think if you want to do something more interesting and also more intense from a graphical point of view. So if you want to have animations and things like that, then there's no way around actually learning one of those two major frameworks. So either programming for iOS or Android and for the whole design thing, there's lots and lots of resources on the web for interaction design, for mobile, and there's great stuff out there. I mean there are all these conferences even about this type of things. So. Yeah.",
      "id": "ep_25_ut_273"
    },
    {
      "end": 3675760,
      "speaker": "Enrico Bertini",
      "start": 3665908,
      "text": "Is there any specific book or resource on the web that you might want to mention? I don't know, people might be curious about that.",
      "id": "ep_25_ut_274"
    },
    {
      "end": 3686508,
      "speaker": "Dominikus Baur",
      "start": 3678420,
      "text": "So of course I always had this plan of having a blog about touchable visualizations and that's coming, I promise.",
      "id": "ep_25_ut_275"
    },
    {
      "end": 3692990,
      "speaker": "Enrico Bertini",
      "start": 3686604,
      "text": "Okay, cool. So just go to Dominico's blog in the future and keep an eye.",
      "id": "ep_25_ut_276"
    },
    {
      "end": 3695110,
      "speaker": "Dominikus Baur",
      "start": 3693530,
      "text": "Go to my future blog.",
      "id": "ep_25_ut_277"
    },
    {
      "end": 3708074,
      "speaker": "Moritz Stefaner",
      "start": 3696970,
      "text": "Yeah, that would be nice because I think, yeah, there's no, especially for visualization, there's no clear, not even a clear point where you would follow the latest projects, right?",
      "id": "ep_25_ut_278"
    },
    {
      "end": 3712330,
      "speaker": "Dominikus Baur",
      "start": 3708242,
      "text": "Yeah, you can find them on the usual blogs, of course. Yeah.",
      "id": "ep_25_ut_279"
    },
    {
      "end": 3723080,
      "speaker": "Moritz Stefaner",
      "start": 3712370,
      "text": "But I think there should be more. If you're really into the mobile and follow that, you should maybe find more than what's showing up on flowing data or info statics.",
      "id": "ep_25_ut_280"
    },
    {
      "end": 3728660,
      "speaker": "Dominikus Baur",
      "start": 3723200,
      "text": "Yeah, I'll make sure to put that on my blog. That's cool. Very cool. Now we have it on a podcast.",
      "id": "ep_25_ut_281"
    },
    {
      "end": 3730352,
      "speaker": "Enrico Bertini",
      "start": 3729680,
      "text": "Nice. Bitch.",
      "id": "ep_25_ut_282"
    },
    {
      "end": 3732064,
      "speaker": "Moritz Stefaner",
      "start": 3730376,
      "text": "You totally committed yourself.",
      "id": "ep_25_ut_283"
    },
    {
      "end": 3733352,
      "speaker": "Dominikus Baur",
      "start": 3732192,
      "text": "Yep. Shit.",
      "id": "ep_25_ut_284"
    },
    {
      "end": 3740340,
      "speaker": "Enrico Bertini",
      "start": 3733416,
      "text": "Now you cannot escape Dominicos. And this whole blog thing is a nightmare. I can tell you.",
      "id": "ep_25_ut_285"
    },
    {
      "end": 3742656,
      "speaker": "Moritz Stefaner",
      "start": 3741160,
      "text": "It's worse than academia.",
      "id": "ep_25_ut_286"
    },
    {
      "end": 3743820,
      "speaker": "Dominikus Baur",
      "start": 3742728,
      "text": "What did I do?",
      "id": "ep_25_ut_287"
    },
    {
      "end": 3756770,
      "speaker": "Enrico Bertini",
      "start": 3748150,
      "text": "I think we had a nice. Oh, Dominicans. I think we had a nice meeting together. Talking about visualization blogs. Right? Some time ago.",
      "id": "ep_25_ut_288"
    },
    {
      "end": 3761050,
      "speaker": "Dominikus Baur",
      "start": 3757150,
      "text": "Yeah, we had that two years ago or so.",
      "id": "ep_25_ut_289"
    },
    {
      "end": 3764174,
      "speaker": "Moritz Stefaner",
      "start": 3761630,
      "text": "And did you agree never to write blogs again or.",
      "id": "ep_25_ut_290"
    },
    {
      "end": 3770494,
      "speaker": "Enrico Bertini",
      "start": 3764302,
      "text": "Well, that was fun. I think Robert was there as well. It was kind of like 20 people.",
      "id": "ep_25_ut_291"
    },
    {
      "end": 3771758,
      "speaker": "Dominikus Baur",
      "start": 3770542,
      "text": "The usual suspects?",
      "id": "ep_25_ut_292"
    },
    {
      "end": 3775374,
      "speaker": "Enrico Bertini",
      "start": 3771814,
      "text": "Yeah, the usual suspects. It was quite lively actually. And that was.",
      "id": "ep_25_ut_293"
    },
    {
      "end": 3776318,
      "speaker": "Dominikus Baur",
      "start": 3775422,
      "text": "Yeah, it was nice.",
      "id": "ep_25_ut_294"
    },
    {
      "end": 3779678,
      "speaker": "Enrico Bertini",
      "start": 3776454,
      "text": "Yeah, yeah, yeah, it would be a.",
      "id": "ep_25_ut_295"
    },
    {
      "end": 3798530,
      "speaker": "Moritz Stefaner",
      "start": 3779694,
      "text": "Great topic for a blog. So I wouldn't mind at all if you would start that. Okay, I agree. Cool. Excellent episode. I think we're basically through, unless you have something more you want to mention. Anything else you want to get rid of?",
      "id": "ep_25_ut_296"
    },
    {
      "end": 3801478,
      "speaker": "Enrico Bertini",
      "start": 3800550,
      "text": "Any secrets?",
      "id": "ep_25_ut_297"
    },
    {
      "end": 3807432,
      "speaker": "Dominikus Baur",
      "start": 3801534,
      "text": "Well, any more commitments, that's enough commitment.",
      "id": "ep_25_ut_298"
    },
    {
      "end": 3811540,
      "speaker": "Enrico Bertini",
      "start": 3807456,
      "text": "You know, we are specialist in destroying people's career here.",
      "id": "ep_25_ut_299"
    },
    {
      "end": 3847170,
      "speaker": "Dominikus Baur",
      "start": 3812200,
      "text": "Oh, nobody told me before. So maybe one last thing just to close this whole thing off here. So I think it's this whole mobile and touch enabled visualization stuff is very, very interesting. I think we barely scratched the surface there, especially what's possible from an interaction design point of view. So this whole notion of having visualizations is something that you can manipulate using your hands. I find it very exciting and I'm really looking forward to future developments there.",
      "id": "ep_25_ut_300"
    },
    {
      "end": 3853278,
      "speaker": "Enrico Bertini",
      "start": 3848230,
      "text": "Fantastic. Thanks a lot, Dominicos. It's been great having you on the show.",
      "id": "ep_25_ut_301"
    },
    {
      "end": 3855294,
      "speaker": "Moritz Stefaner",
      "start": 3853454,
      "text": "Yeah, thanks for coming.",
      "id": "ep_25_ut_302"
    },
    {
      "end": 3865660,
      "speaker": "Enrico Bertini",
      "start": 3855382,
      "text": "We're looking forward to your blog and your future developments. We want to see the life better life index coming up soon.",
      "id": "ep_25_ut_303"
    },
    {
      "end": 3867620,
      "speaker": "Dominikus Baur",
      "start": 3866200,
      "text": "Yeah, it's pretty cool.",
      "id": "ep_25_ut_304"
    },
    {
      "end": 3872440,
      "speaker": "Enrico Bertini",
      "start": 3869160,
      "text": "Okay, thanks. Take care. Bye.",
      "id": "ep_25_ut_305"
    }
  ],
  "confidence": 0.918209417786308,
  "audio_duration": 3880,
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_status_code": null,
  "webhook_auth": false,
  "webhook_auth_header_name": null,
  "speed_boost": false,
  "auto_highlights_result": null,
  "auto_highlights": false,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_audio_quality": null,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "content_safety": false,
  "iab_categories": true,
  "content_safety_labels": {
    "status": "unavailable",
    "results": [],
    "summary": {}
  },
  "language_detection": false,
  "language_detection_threshold": null,
  "language_confidence": null,
  "custom_spelling": null,
  "throttled": false,
  "auto_chapters": true,
  "summarization": false,
  "summary_type": null,
  "summary_model": null,
  "custom_topics": false,
  "topics": [],
  "speech_threshold": null,
  "speech_model": "best",
  "chapters": [
    {
      "summary": "Moritz: Summer is here. I'm off to leave for vacations the day after tomorrow. There is always the temptation to go back to work for any given reason. Have you ever seen a map of the few places that are completely unreachable?",
      "gist": "Workaholics and the holidays",
      "headline": "Moritz is preparing to leave for vacation tomorrow",
      "start": 7760,
      "end": 147890,
      "id": "ep_25_ch_0"
    },
    {
      "summary": "We have another fantastic guest today. We're going to talk about mobile and touch interfaces for visualization. Dominicos Bau is an expert in this area. Plus he's a very old friend of us, so it's a great pleasure to have him here.",
      "gist": "Fooled by Mobile and Touch Interfaces",
      "headline": "Dominicos Bau talks about mobile and touch interfaces for visualization",
      "start": 148510,
      "end": 199746,
      "id": "ep_25_ch_1"
    },
    {
      "summary": "Dominikus Baur is a visualization freelancer in Munich. He did his PhD in information visualization and also did more exotic things about live vlogging. The thing he's most thrilled about at the moment is touch and how to combine touch input with information visualization.",
      "gist": "In the Elevator With Dominikus Baur",
      "headline": "Dominikus Baur works as a visualization freelancer in Munich",
      "start": 199818,
      "end": 311050,
      "id": "ep_25_ch_2"
    },
    {
      "summary": "So, Moritz, we have an imbalance of German accent today. But at least it's euro, you know, at least. Yeah, it's gonna be quite exotic today. We're all a big family and if you're from Europe. Dominicos.",
      "gist": "A German accent at the party",
      "headline": "Moritz: We have an imbalance of German accent today",
      "start": 312390,
      "end": 339590,
      "id": "ep_25_ch_3"
    },
    {
      "summary": "Mobile is becoming more and more popular. People spend more time using their mobile devices than using their desktops and laptops. The whole context is changing. Mobile is also a very personal device. It's hard to wrap your head around how to do it right.",
      "gist": "Why do we need to visualize on mobile devices?",
      "headline": "People spend more time using mobile devices than using desktops and laptops",
      "start": 339670,
      "end": 551034,
      "id": "ep_25_ch_4"
    },
    {
      "summary": "The major difference is the input modality that we have on mobile. Being able to touch a visualization virtually is also a better direct manipulation. The screen real estate is reduced by the fact that you need large areas to let people interact with the user interface.",
      "gist": "On Mobile vs. Desktop",
      "headline": "On mobile, what's your experience? What are the biggest, like, challenges",
      "start": 551082,
      "end": 877776,
      "id": "ep_25_ch_5"
    },
    {
      "summary": "I actually think it's coming because, of course, I'm also saying that about touchable visualization. Now we have reached a point in the hardware development where it actually makes sense to do augmented reality. It might just come in a half a year and then be really integrated in product.",
      "gist": "What Happened to Augmented-Reality?",
      "headline": "What happened to augmented reality and layer and all these types of applications",
      "start": 877968,
      "end": 955090,
      "id": "ep_25_ch_6"
    },
    {
      "summary": "Researchers at the University of Calgary have developed new interaction techniques for the iPad. The project aims to solve some of the limitations of stack graphs. It's an example of how using touch interfaces can actually be. Can provide benefits that we might not get using standard interfaces.",
      "gist": "Touch Wave: The visualization of the iPad",
      "headline": "You've been working on new interaction techniques for the iPad",
      "start": 955130,
      "end": 1306590,
      "id": "ep_25_ch_7"
    },
    {
      "summary": "On mobile it's a bit harder to do very exploratory visualizations or very complex ones. But I think it's more relevant for more of these small scale visualizations that are heavily focused on presentation. I'm wondering if there is a space for some sort of analytical kind of tasks performed with mobile devices.",
      "gist": "Is there a place for analytical visualization on a mobile device?",
      "headline": "I'm wondering if there is a space for analytical tasks performed on mobile devices",
      "start": 1309850,
      "end": 1605960,
      "id": "ep_25_ch_8"
    },
    {
      "summary": "The idea of monitoring yourself is probably very interesting there. There will be a need for visualizations on a mobile device that give you a regular access to what's going on there. Location based visualization is not as strong as on the mobile.",
      "gist": "Analyzing your life with a mobile device",
      "headline": "There will be need for visualizations on a mobile device to monitor yourself",
      "start": 1606780,
      "end": 1876516,
      "id": "ep_25_ch_9"
    },
    {
      "summary": "Dominicos: One of my personal favorites is the Datum app. It uses visualization to present your data and you can even explore it a little bit. Dominicos: A lot of tablet apps are being like, are for many companies the chance to try something new.",
      "gist": "What's the coolest thing you have seen in a data visualization app",
      "headline": "Dominicos: A lot of visualization apps are available on mobile devices",
      "start": 1876628,
      "end": 2247108,
      "id": "ep_25_ch_10"
    },
    {
      "summary": "I still remember my, the first portable computer. That was really weird. The size of a washing machine. It was really, really bulky, portable. It's gonna be fun when we will tell our kids that these things existed.",
      "gist": "How portable was the first PC?",
      "headline": "I still remember my, the first portable computer. That was really weird",
      "start": 2247284,
      "end": 2276400,
      "id": "ep_25_ch_11"
    },
    {
      "summary": "Another interesting kind of application is interaction between different devices. How much harder it is to implement visualization on, let's say, an iPad or any other mobile device. There are two ways to develop visualizations for any platform.",
      "gist": "Ways of interaction between mobile and non-mobile devices",
      "headline": "Dominos: Another interesting application is interaction between different devices",
      "start": 2276820,
      "end": 2875060,
      "id": "ep_25_ch_12"
    },
    {
      "summary": "Enrico: I have an interest for touch displays. Would be really curious to see people interacting on touch displays that are not too, too big and they are vertical. Standing in front of a touch display is going to be a much richer kind of experience.",
      "gist": "Interactive displays in the future",
      "headline": "Dominicos: I'm interested in research on medium sized touch displays",
      "start": 2877380,
      "end": 3304040,
      "id": "ep_25_ch_13"
    },
    {
      "summary": "Well, when I was in Konstanz, we had this huge power wall. It really scales very well. But in terms of interaction is a nightmare. You need to make big gestures which cost you big energy. Why not have your personal dome? That would be fun.",
      "gist": "Looking Through a Power Wall",
      "headline": "You mentioned before this interaction between multiple different types of devices",
      "start": 3304160,
      "end": 3532170,
      "id": "ep_25_ch_14"
    },
    {
      "summary": "Dominos: What's the best way to start with visualization on mobile devices? If you want to have animations and things like that, then there's no way around actually learning one of those two major frameworks. There's lots and lots of resources on the web for interaction design, for mobile.",
      "gist": "The Best Way to Start Drawing on Mobile Devices",
      "headline": "Dominico: Maybe some listeners might want to start doing visualization on mobile devices",
      "start": 3535670,
      "end": 3788734,
      "id": "ep_25_ch_15"
    },
    {
      "summary": "Dominicos: I think it's this whole mobile and touch enabled visualization stuff is very, very interesting. We're looking forward to your blog and your future developments. We want to see the life better life index coming up soon.",
      "gist": "Democracy in the Elevator",
      "headline": "Dominicos: I find mobile and touch enabled visualization very interesting",
      "start": 3788862,
      "end": 3872440,
      "id": "ep_25_ch_16"
    }
  ],
  "disfluencies": false,
  "entity_detection": false,
  "sentiment_analysis": false,
  "sentiment_analysis_results": null,
  "entities": null,
  "speakers_expected": null,
  "summary": null,
  "custom_topics_results": null,
  "is_deleted": null,
  "episode_num": "25",
  "episode_metadata": {
    "speakers": [
      "Enrico Bertini",
      "Moritz Stefaner",
      "Dominikus Baur"
    ],
    "WPid": "86",
    "url": "https://datastori.es/podlove/file/126/s/feed/c/mp3/datastories-25.mp3",
    "episode_title": "Visualization on Mobile & Touch Devices w/ Dominikus Baur"
  }
}