{
  "id": "79984174-529d-4ef4-a07d-81adb804d827",
  "language_model": "assemblyai_default",
  "acoustic_model": "assemblyai_default",
  "language_code": "en_us",
  "status": "completed",
  "audio_url": "https://datastori.es/podlove/file/4381/s/feed/c/mp3/ds-106-data-sculptures-with-adrien-segal.mp3",
  "utterances": [
    {
      "end": 7474,
      "speaker": "Adrien Segal",
      "start": 200,
      "text": "I think the work should stand on its own as a physical object, and I want people to be inquisitive about the object.",
      "id": "ep_106_ut_0"
    },
    {
      "end": 59422,
      "speaker": "Enrico Bertini",
      "start": 12054,
      "text": "Data stories is brought to you by click. Are you missing out on meaningful relationships hidden in your data? Unlock the old story with Qlik sense through personalized visualizations and dynamic dashboards, which you can download for free at Qlik Datastories. Hey, everyone, welcome to a new episode of Data Stories. My name is Enrico Bertini. I am a professor at NYU in New York, and I do research in data visualization.",
      "id": "ep_106_ut_1"
    },
    {
      "end": 65570,
      "speaker": "Moritz Stefaner",
      "start": 59588,
      "text": "And I'm Moritz Stefaner. I'm an independent designer of data visualizations, so I'm more on the practical side of things.",
      "id": "ep_106_ut_2"
    },
    {
      "end": 72194,
      "speaker": "Enrico Bertini",
      "start": 65722,
      "text": "And together we talk about data visualization, analysis, and generally the role that data plays in our lives.",
      "id": "ep_106_ut_3"
    },
    {
      "end": 81378,
      "speaker": "Moritz Stefaner",
      "start": 72354,
      "text": "And usually we also do that with guests we invite on the show. And today we have a special guest again, Adrien Segal. Hi, Adrian. Good to have you on.",
      "id": "ep_106_ut_4"
    },
    {
      "end": 82090,
      "speaker": "Enrico Bertini",
      "start": 81426,
      "text": "Hi, Adrian.",
      "id": "ep_106_ut_5"
    },
    {
      "end": 83642,
      "speaker": "Adrien Segal",
      "start": 82162,
      "text": "Hi. Thanks for having me.",
      "id": "ep_106_ut_6"
    },
    {
      "end": 91252,
      "speaker": "Moritz Stefaner",
      "start": 83698,
      "text": "Great to have you. So, Adrian, can you tell us a bit about what you do and what your background is, what you're currently working on?",
      "id": "ep_106_ut_7"
    },
    {
      "end": 125814,
      "speaker": "Adrien Segal",
      "start": 91338,
      "text": "Yes, I am a sculptor. I make physical representations of data. My background is in furniture design, which is what my degree is in, and spent about ten years doing woodworking, functional fabrication, and non functional, and really building up a base work of skills to make physical things that I want to make. Throughout that process, I've incorporated data quite a bit into my work to drive a conceptual inquiry.",
      "id": "ep_106_ut_8"
    },
    {
      "end": 135626,
      "speaker": "Moritz Stefaner",
      "start": 126554,
      "text": "And did you first really produce practical furniture, or did you dive into data sculpture straight away? How did you get started?",
      "id": "ep_106_ut_9"
    },
    {
      "end": 230704,
      "speaker": "Adrien Segal",
      "start": 135770,
      "text": "That's a good question. I started in furniture design because I didn't want to do a fine art specific major, and I didn't want to do a design specific major in furniture, particularly in the program I was at at California College of the Arts. Fit right in between both of those. So there was no requirement that you had to make functional things, and there was also no requirement that they were made out of particular materials. So you could focus mostly on design and try and work for a firm when you were done with school, or you could just go crazy and make weird stuff, which is more or less what I did. So I started out just learning how to build things, how to work on machines in a full woodshop, welding, metalworking, kind of a range of fabrication techniques. And during school, the very last year, I got to do a project in my thesis work that was fully self directed, and that's really where I came to data design. And it wasn't a direct line of thought it started with visual illusion and perception and how we read visual forms and symbols and how we interpret them. And that really led me to Edward Tufte's work, which changed my process and really made me go straight into data visualization.",
      "id": "ep_106_ut_10"
    },
    {
      "end": 236464,
      "speaker": "Moritz Stefaner",
      "start": 231564,
      "text": "That is funny, because now he does sculptures, too. Right. So maybe he was inspired as well.",
      "id": "ep_106_ut_11"
    },
    {
      "end": 240566,
      "speaker": "Adrien Segal",
      "start": 237244,
      "text": "He does. I'm not a huge fan of his sculptures.",
      "id": "ep_106_ut_12"
    },
    {
      "end": 245294,
      "speaker": "Moritz Stefaner",
      "start": 240700,
      "text": "His information to some stuff is better, too. Yeah, but it's a funny parallel, actually.",
      "id": "ep_106_ut_13"
    },
    {
      "end": 255826,
      "speaker": "Adrien Segal",
      "start": 245634,
      "text": "Yeah. And he's actually quite controversial. His ideas are, you know, people love him, and he's the guru of, like, the foundation of data. Dataviz.",
      "id": "ep_106_ut_14"
    },
    {
      "end": 256210,
      "speaker": "Moritz Stefaner",
      "start": 255890,
      "text": "Sure.",
      "id": "ep_106_ut_15"
    },
    {
      "end": 300792,
      "speaker": "Adrien Segal",
      "start": 256282,
      "text": "But he's also very. Some of his. I don't know if you've read any of his books recently, but he's very pointed and very opinionated. And it's of an era. It's dated a bit now, but really, really had a big influence on what I wanted to do. I think what I was trying to figure out is I loved building things and I wasn't motivated enough by making functional furniture, like making someone a desk that had a special drawer in the right place, just wasn't enough of intellectual investigation for me. And trying to do something with bigger ideas outside of myself was really what drove me to do more conceptual work through physical materials.",
      "id": "ep_106_ut_16"
    },
    {
      "end": 311392,
      "speaker": "Moritz Stefaner",
      "start": 300888,
      "text": "Yeah. And so your degree project, it was called Tidal Datum. Right. And this was basically the first data sculpture, furniture project you did, right?",
      "id": "ep_106_ut_17"
    },
    {
      "end": 313304,
      "speaker": "Adrien Segal",
      "start": 311488,
      "text": "Yeah, that was the first one, yeah.",
      "id": "ep_106_ut_18"
    },
    {
      "end": 325282,
      "speaker": "Moritz Stefaner",
      "start": 313384,
      "text": "Can you tell us a bit about it? But, like, what does it depict? How does it look? It's a bit hard. Always on the podcast, we will, of course, link photos, but still, maybe you can describe a bit the impression you get from the piece.",
      "id": "ep_106_ut_19"
    },
    {
      "end": 389586,
      "speaker": "Adrien Segal",
      "start": 325408,
      "text": "Yeah, yeah. So it is a full cycle of tide charts from a location in San Francisco Bay, which I sourced the data from the NOAA's online historic. Historic tide database. And you can actually search back for tide data from when that station was first set up. I think in, like, the 1850s. It's one of the longest continually operating tide stations in the. At least in the US, I'm not sure, in the world. But the tide graphs, I collected 29 of them, because that's a full cycle of how long it takes the moon to go around the sun. And there's two highs and two low tides per day at this location. And obviously, throughout that cycle, there's more extreme tides and less extreme tides. And so I turned all of those into flat bar steel by printing them out at full scale and then bending them physically by hand with a bending, Jake.",
      "id": "ep_106_ut_20"
    },
    {
      "end": 390978,
      "speaker": "Moritz Stefaner",
      "start": 389650,
      "text": "Oh, wow. Okay.",
      "id": "ep_106_ut_21"
    },
    {
      "end": 408410,
      "speaker": "Adrien Segal",
      "start": 391106,
      "text": "Yeah. Into each individual day of tides, and then built a framework that holds them up relative to sea level so that you get a three dimensional, physical representation of that full cycle of tide patterns as they ebb and flood over the month.",
      "id": "ep_106_ut_22"
    },
    {
      "end": 415386,
      "speaker": "Moritz Stefaner",
      "start": 408522,
      "text": "And they look like waves again. So this is. This nice. So it comes full circle, basically, because it looks like a wave progression.",
      "id": "ep_106_ut_23"
    },
    {
      "end": 486126,
      "speaker": "Adrien Segal",
      "start": 415490,
      "text": "Yeah, yeah. And that piece really started because all my work really starts with a personal experience. There's a beautiful site not too far from the Golden Gate bridge called the Sutro Baths, and it's these ruins that are left over. In the 1850s, there was a huge bathhouse built there that was super popular and then kind of got unpopular and then mysteriously burned down through an arson fire. And now it's these ruins with these, like, leftover pools, like, where people used to swim. And when the pools were active, they were all circulated. The water was circulated fully by the tides. So it was this super interesting site where they were harnessing the power of the tides for, like, human entertainment. But also, now, if you visit the site, it's really the tides just taking back these ruins as they're going back into the ocean. And that experience of visiting that site had a really profound impact on me and was really the inspiration for looking at tide patterns, because I wanted to understand how we use science to analyze the natural world and what those things look like through that lens.",
      "id": "ep_106_ut_24"
    },
    {
      "end": 521236,
      "speaker": "Enrico Bertini",
      "start": 486230,
      "text": "Yeah. If anyone is listening to this and wondering how this looks like, hey, if you can just stop for a moment and go to Adrian's website, every single project is very well documented, and there are lots of. Lots of images. I love that, even though I have to say I would love to see it in person. But even just looking at the pictures is so beautiful. And I love the fact that you are showing the intermediary stages and how you actually design the idea, the sketches.",
      "id": "ep_106_ut_25"
    },
    {
      "end": 528924,
      "speaker": "Moritz Stefaner",
      "start": 521340,
      "text": "And also the scientific graphs. Scientific data, it's very nice. Yeah, great.",
      "id": "ep_106_ut_26"
    },
    {
      "end": 530944,
      "speaker": "Adrien Segal",
      "start": 529004,
      "text": "Yeah, it's very research heavy.",
      "id": "ep_106_ut_27"
    },
    {
      "end": 537064,
      "speaker": "Enrico Bertini",
      "start": 532604,
      "text": "Yeah. I love the fact that you are exposing the process. That's awesome.",
      "id": "ep_106_ut_28"
    },
    {
      "end": 580674,
      "speaker": "Adrien Segal",
      "start": 537434,
      "text": "Thank you. Yeah, I think the work should stand on its own as a physical object, or as most of us will experience those things through a photo. And I want people to be inquisitive about the object because I think there's an intuitive sense that there's something going on, that the object is telling you something more than just meets the eye. And that's why I think it's really important to have that information along with the whole project, so that those people who recognize that can go in and dig in and really discover all of the background of how that piece, what's it telling them? What's incorporated, embedded into it.",
      "id": "ep_106_ut_29"
    },
    {
      "end": 623304,
      "speaker": "Moritz Stefaner",
      "start": 580754,
      "text": "Yeah. Shall we talk about a few more projects, just so people get a sense of what types of things you have also done in the meantime? So this one is more than ten years ago already. You've done a lot of projects along the lines of data sculptures, often with, let's say, ecological data. And there were a few that also go beyond just let's say, physical incorporation or you explored a lot of different directions there. So one I found really interesting is the Grewingk Glacier project you had on the site where you, or maybe you tell a bit about it. I found it very interesting.",
      "id": "ep_106_ut_30"
    },
    {
      "end": 625992,
      "speaker": "Adrien Segal",
      "start": 623384,
      "text": "Yeah, the ice sculpture.",
      "id": "ep_106_ut_31"
    },
    {
      "end": 627204,
      "speaker": "Moritz Stefaner",
      "start": 626088,
      "text": "Yeah, exactly.",
      "id": "ep_106_ut_32"
    },
    {
      "end": 633074,
      "speaker": "Adrien Segal",
      "start": 628144,
      "text": "Someone once asked me, wait, it's ice. Is that art? How can you sell it?",
      "id": "ep_106_ut_33"
    },
    {
      "end": 635954,
      "speaker": "Moritz Stefaner",
      "start": 634374,
      "text": "That's a bad idea.",
      "id": "ep_106_ut_34"
    },
    {
      "end": 863644,
      "speaker": "Adrien Segal",
      "start": 640214,
      "text": "I appreciated that question. Yes. So I did a residency at this wonderful art gallery in Homer, Alaska, which is a really remote, tiny town that only has about 5000 people that live there. But it's beautiful. It's right on Kachemak Bay. It's across, across the bay from this really big ice field that has a ton of glaciers. And I was there for a month kind of researching and working with the community, and I met with a whole bunch of scientists there, and one of them was studying glaciers and glacial retreats. So through that research, I ended up learning that there's not actually very much data available about how much mass is lost in glaciers. Only more recently have they started doing lidar scans where they can see a bit deeper and understand more about the thickness that's lost. So the only kind of longer term datasets they have on glacial retreat are mapping the perimeter as it's receding. And so the earliest versions of that from the 18 hundreds are from observation, from people exploring those areas, and then more recently from aerial photos. And obviously now that satellites have been up for about 30 years, the last most recent data is from that. And obviously that process of melting has increased since then. So I met with a scientist who provided me with a bunch of different maps of glaciers right outside Homer. And one of them you can visit, it's super cool. You take a water taxi across this bay, they drop you off, you hike in maybe 6 miles, and you're at the base of the glacier you can, which is actually a lake now. So it used to be the actual glacier, and now it's a big glacial lake, and then the glacier is kind of in the distance. And I went to this site and decided to do a piece about that particular glacier. And so I took the perimeter maps and was able to create a three dimensional form, that one axis, the vertical axis, is time. So showing how that glacier's changed shape from the 18 hundreds when the first maps were taken to current day, I think the data ended in about 2012, and I used a computer program called Rhino for 3d modeling those pieces by essentially lofting the perimeters into each other to create a more fluid form and then slicing it up and making it out of a physical material back into analog with plywood and then carving that into a really smooth, kind of curvaceous form. And then because this piece was about this ephemeral idea of glaciers and ice and how they're melting and disappearing, I went through and did a few more steps to create a two part mold of that positive plywood sculpture with silicone over it, which is a nice bright pink color if you look on the photos online, which captures the texture and the detail in the positive form and then is very loose and rubbery and need structures. So then you create a two part mother mold to give that rubber structure, and then you take out the plywood and you can fill it with different materials to make castings. So I ended up casting it in water and then filming the piece melting sort of as the main form of documentation of that piece.",
      "id": "ep_106_ut_35"
    },
    {
      "end": 873004,
      "speaker": "Moritz Stefaner",
      "start": 863804,
      "text": "Yeah. So that's quite elaborate. Basically, first apply, but then the silicone and then the ice and then melted again. So kind of a crazy, crazy process.",
      "id": "ep_106_ut_36"
    },
    {
      "end": 873646,
      "speaker": "Adrien Segal",
      "start": 873164,
      "text": "Yeah.",
      "id": "ep_106_ut_37"
    },
    {
      "end": 894122,
      "speaker": "Moritz Stefaner",
      "start": 873740,
      "text": "But the plywood itself, it looks much more like a canyon, so I can see how it wouldn't capture the. Yeah, the ice aspect as well, so. And the ice looks so nice. It's very clearly frozen. How did you manage to get it to freeze so nicely? Did you have any special tricks there? It's like crystal clear. It's like, really. It looks very pure.",
      "id": "ep_106_ut_38"
    },
    {
      "end": 964234,
      "speaker": "Adrien Segal",
      "start": 894298,
      "text": "Yes. There is much you can learn about material properties in trying to make ice castings. So it depends on the source of your water. And if you boil the water first, it comes out crystal clear. I actually did a few different castings. This happened over a longer time. You know, it's never linear. So I did the initial design while I was in Alaska, but I didn't have access to facilities to fabricate anything. So about a year later, I did a different residency in Colorado, where I had a wood shop available with a CNC router. So the plywood form was initially cut parts on a CNC router that I then hand shaped once they were assembled into a solid block at that facility is where I was able to do the ice castings and the filming. And it took several tests to figure out what kind of water to use first. Also, how long to put it in the freezer so that I could take it out at six in the morning, set it up with a GoPro, and then have it melt all in one day.",
      "id": "ep_106_ut_39"
    },
    {
      "end": 965732,
      "speaker": "Moritz Stefaner",
      "start": 964764,
      "text": "Oh, man.",
      "id": "ep_106_ut_40"
    },
    {
      "end": 1011834,
      "speaker": "Adrien Segal",
      "start": 965908,
      "text": "Yeah, yeah. And one day it started snowing, so I had to take the GoPro back inside. And the video that ended up working the best, actually was pretty cool, because in the background of the video, there's these kind of smokestack forms. It was at Anderson Ranch Art center, which also has a big kiln yard, and they were doing a wood firing that particular day. So there's these smokestacks releasing smoke in the background of this ephemeral ice sculpture based on a glacier that's just melting before your eyes. So it's about an eight hour filming that's condensed into, I think, 45 seconds, maybe a minute.",
      "id": "ep_106_ut_41"
    },
    {
      "end": 1019770,
      "speaker": "Moritz Stefaner",
      "start": 1012854,
      "text": "And in the beginning it's really slow. You don't really notice anything happening. And then suddenly it's really quick. Right. It's like collapses.",
      "id": "ep_106_ut_42"
    },
    {
      "end": 1051904,
      "speaker": "Adrien Segal",
      "start": 1019902,
      "text": "Yeah. The moment where it collapses, I've definitely. When I've shown this to groups of people, there's sort of like a. Oh, like, there's that moment, like, I love. I love feeling that that hit, in a way, because that's when I know that it works the way that I thought it might. Cause you never. You know, when you start a project, you never know if it's really gonna work. But, yeah, there's a moment where it just falls over and then. And you get to nothing at the end. It's really sad, actually.",
      "id": "ep_106_ut_43"
    },
    {
      "end": 1055784,
      "speaker": "Moritz Stefaner",
      "start": 1053924,
      "text": "And you can't sell it. So.",
      "id": "ep_106_ut_44"
    },
    {
      "end": 1127226,
      "speaker": "Adrien Segal",
      "start": 1058124,
      "text": "I did actually show that piece recently in a gallery, which was kind of difficult. It was kind of crazy. It didn't work super great because it's just a lot of work to keep casting new ones. And the mold is not like an industrial mold, so it's not really made to be cast a whole bunch. But I ended up making a plinth that the sculpture could sit on that had sort of a very discreet drain in the bottom so that the water wouldn't just drip all over the gallery or the pedestal. And it was just whenever people came in, it was shown at different states of being melted. So the actual ice sculpture was shown, and it was cool because of the opening, people out of context, people don't quite. They can't put together in their heads. Why? There would be ice in a gallery, which is quite beautiful. So many people. I mean, if it was actually, like, a piece of artwork. You're never supposed to touch artwork in a gallery, but I think because it was ice, and people wanted to know if it was real and have that tactile, visceral feeling of touching it. A whole lot of people were touching it at the opening.",
      "id": "ep_106_ut_45"
    },
    {
      "end": 1128694,
      "speaker": "Enrico Bertini",
      "start": 1127370,
      "text": "Oh, that's beautiful.",
      "id": "ep_106_ut_46"
    },
    {
      "end": 1154702,
      "speaker": "Adrien Segal",
      "start": 1129874,
      "text": "Someone may have licked it. I'm not sure. Yeah. It's just. I like those moments when people are just so enticed by the form or the material, and I think the material really should speak to the initial idea, which is why ice was really important for this piece, even though. No, it's not really sellable. Although there have been other ice artworks that are sellable.",
      "id": "ep_106_ut_47"
    },
    {
      "end": 1158714,
      "speaker": "Moritz Stefaner",
      "start": 1154798,
      "text": "Okay. Along with a freezer, then freezer comes for free.",
      "id": "ep_106_ut_48"
    },
    {
      "end": 1194444,
      "speaker": "Adrien Segal",
      "start": 1162374,
      "text": "I forget the artist. But there is a man who made these. These frozen. Okay. It's his own head, like his own bust with his own blood frozen in the shape of his head. And then it comes with a whole refrigerated unit. This is a very famous artist. I can't remember his name. And there was a story that one of them was sold to a collector, and once it's sold, it's the collector's responsibility to make sure it stays frozen. And someone accidentally unplugged this.",
      "id": "ep_106_ut_49"
    },
    {
      "end": 1196964,
      "speaker": "Enrico Bertini",
      "start": 1195144,
      "text": "So you got blood everywhere.",
      "id": "ep_106_ut_50"
    },
    {
      "end": 1201964,
      "speaker": "Adrien Segal",
      "start": 1197624,
      "text": "Yep. Gone forever. Yeah. So I'm not the first.",
      "id": "ep_106_ut_51"
    },
    {
      "end": 1265834,
      "speaker": "Moritz Stefaner",
      "start": 1204744,
      "text": "Yeah. It's crazy, but I love that. Yeah. To work with these types of materials, and it's. Yeah, it raises totally new questions. Right. About, like. Yeah. What you do and what it stands for. And so, yeah, it's very nice. You have lots other projects on the website. There's a recent project, but, like. Like, ball chains about a river. California water rights. Lots of wood projects. So you do a lot with plywood. Right. It's like, different layers and then bring them back into shapes. There's a beautiful snow water equivalent cabinet showing the. What is it, the ice or snow pack heights on a path. Sierra Nevada. Really beautiful projects, and many of them are sort of. They have something to do with, like, wind or water or ice or, like, all these rough, basic elements. Right. Is that a fair characterization?",
      "id": "ep_106_ut_52"
    },
    {
      "end": 1339638,
      "speaker": "Adrien Segal",
      "start": 1266734,
      "text": "Yeah, I think that's fair. I don't really know. I kind of know why. Like, I think I started with tides, and then I just. I have so much. I get so much inspiration from being in nature. I grew up in Colorado. I've spent a lot of time in the mountains, and I think that it's one of those things that many people just find peaceful, kind of reflective time when they're in a natural environment. And I definitely feel that. And I think that noticing changes in the landscape often is tied back to things like water. I have a piece on fire, so related to the lack of water, and it's definitely a recurring theme in my work. But I'm not limiting myself to that specific theme for choosing what data I work with. I really wait until I find the idea or the data set that will reveal something really interesting and let that drive the project. So water is definitely a recurring theme, but not limited to that.",
      "id": "ep_106_ut_53"
    },
    {
      "end": 1411812,
      "speaker": "Moritz Stefaner",
      "start": 1339766,
      "text": "Yeah, yeah. But it's such an interesting combination because you have these fundamental, elemental forces, basically, and then you have these huge, often really big, massive, but also very elegant objects you craft from them and what drives them, basically, the shape is the data, which is so abstract and non tangible. And I think somehow it comes together really beautifully. And again, you have to go to the site, but there's a very distinct style you have and a very distinct approach, and I think the pieces are just super fascinating. What I was wondering about is how does this actually work? These are so big pieces sometimes, and so much physical work going into them. How do you produce these types of things? Can you tell us a bit about the practical side of these, of the production, but also of the design and the prototyping, and, I don't know, the shipping or the storing. I can imagine there's so much stuff you have to take care of with these massive, huge pieces. Like, the larger wood pieces must be heavy too, right? Like, how do you handle all this? Can you tell us a bit about the everyday aspect of being a sculptural data artist?",
      "id": "ep_106_ut_54"
    },
    {
      "end": 1431514,
      "speaker": "Adrien Segal",
      "start": 1411908,
      "text": "Yeah, yeah, that's a great question. I work primarily out of a shared woodshop and full access, all machinery. They're really nice because they let me carve a lot of plywood, which is not fun to be around when that's happening.",
      "id": "ep_106_ut_55"
    },
    {
      "end": 1434106,
      "speaker": "Moritz Stefaner",
      "start": 1431594,
      "text": "Is it dusty or is it loud, or. What's the problem?",
      "id": "ep_106_ut_56"
    },
    {
      "end": 1467444,
      "speaker": "Adrien Segal",
      "start": 1434130,
      "text": "It's really dusty. Dusty. The shop we share is really loud anyways. But there's a particular tool I use, a die grinder, that makes a sound not unlike a dentist drill. And it's a variable speed, so the harder you squeeze the trigger, the faster it goes, which is great for carving because you have so much control. And it's also really powerful. I think it's like 40,000 rpms, so it's like a dremel, but way more powerful.",
      "id": "ep_106_ut_57"
    },
    {
      "end": 1475424,
      "speaker": "Moritz Stefaner",
      "start": 1467824,
      "text": "You hold in your hand and you move it across the surface. And by modulating the pressure, you can modulate how strong it carves, basically.",
      "id": "ep_106_ut_58"
    },
    {
      "end": 1529694,
      "speaker": "Adrien Segal",
      "start": 1475504,
      "text": "Yeah. Yeah. So, I mean, carving is honestly, like, there's a lot of plywood carved pieces on my website. And the reason for that is that it's so easy to index layers of things in a material that is flat, comes easily in a four by eight sheet, and can be cut into very crazy shapes. When you start using solid wood for things, there's a lot of wood moves is essentially the basic rule. So wood is a natural material that expands and contracts, and it gets more complicated to be able to cut specific shapes out of it and stack them in a way that the grain will work and it won't crack or bow or break later on. So plywood primarily has been the material I've used because it's so easy to index and cut shapes out of and assemble into a bigger form.",
      "id": "ep_106_ut_59"
    },
    {
      "end": 1544886,
      "speaker": "Moritz Stefaner",
      "start": 1530074,
      "text": "The basic approach is you slice it into little, let's say, terraces of the files form you want to have. Right. So it's, first, it looks like, different, like. Yeah. You see the slices, and then you will take away all the sharp edges and becomes a smooth form.",
      "id": "ep_106_ut_60"
    },
    {
      "end": 1572854,
      "speaker": "Adrien Segal",
      "start": 1544950,
      "text": "Right, yeah, yeah. So I'll have it. I'll design at my house. I finalize the design. I get all the parts that I need to have cut. Sometimes I have them cut by a CNC friend, or sometimes I cut them myself, depending on what I'm doing. I'll bring them back to my shop, glue them up into a big, solid form. So it's a big mess. There's, like, layers that are all uneven edges. There's glue squeezing out everywhere, and then enable everything to.",
      "id": "ep_106_ut_61"
    },
    {
      "end": 1576014,
      "speaker": "Moritz Stefaner",
      "start": 1572894,
      "text": "Right. Otherwise you lose track of what's where. Right.",
      "id": "ep_106_ut_62"
    },
    {
      "end": 1577190,
      "speaker": "Adrien Segal",
      "start": 1576094,
      "text": "Oh, that's a puzzle.",
      "id": "ep_106_ut_63"
    },
    {
      "end": 1580006,
      "speaker": "Moritz Stefaner",
      "start": 1577382,
      "text": "Yeah, exactly. You need to be super organized.",
      "id": "ep_106_ut_64"
    },
    {
      "end": 1646566,
      "speaker": "Adrien Segal",
      "start": 1580070,
      "text": "Yeah, it's a big puzzle. And, I mean, oftentimes I'll have to give my CNC guy a map of each part and have it labeled. Sometimes it's by the date. You know, it'll be like, this one's 1998, and I get them all back and I have to assemble them. And then once they're all assembled, I carve them all. And that's really, it's such a fun. It's such a fun experience. The carving part is beautiful because I don't have to problem solve or think about it anymore. I get to tap into an intuitive action in my body. It's a direct expression of how I'm holding a tool, how I'm using the tool like, my muscle memory and then abrading and shaping that form. And plywood's also really nice for shaping forms because as you carve through it, the lines, the contours of the lines come out, and you have this beautiful reference point to control how those shapes reveal themselves. And some of the sculptures I've made, actually, I've changed the angle that the plywood is cut at so that I can accentuate those curves, and they look.",
      "id": "ep_106_ut_65"
    },
    {
      "end": 1658754,
      "speaker": "Moritz Stefaner",
      "start": 1646590,
      "text": "Again, a bit like the isolines you would get on maps. Right. So that's another, like, nice data visualization back reference in a way, visually, that the plywood makes these concentric lines around the mountains. And so.",
      "id": "ep_106_ut_66"
    },
    {
      "end": 1668522,
      "speaker": "Adrien Segal",
      "start": 1658854,
      "text": "Yeah, yeah, yeah. And, I mean, it takes a long time to go from design to fabrication to, like, finished.",
      "id": "ep_106_ut_67"
    },
    {
      "end": 1681334,
      "speaker": "Moritz Stefaner",
      "start": 1668658,
      "text": "And, like, how many pieces do you mess up at some point? Is it, like, pretty much that you nail it every time, or is it, like, every second piece, you. Somewhere in the middle, you screw it all up and you have to restart? Like.",
      "id": "ep_106_ut_68"
    },
    {
      "end": 1711596,
      "speaker": "Adrien Segal",
      "start": 1683034,
      "text": "I don't make as much mistakes in terms of, like, where I. Where I've made something that I just can't use. I think it's more like, you know, artists have a really good understanding of this. Not every single piece you make is gonna be, like, awesome. And I've definitely tried things that are not in my portfolio online. You know, like, I don't show them publicly because I just don't feel like they captured the idea or the movement or that.",
      "id": "ep_106_ut_69"
    },
    {
      "end": 1720526,
      "speaker": "Moritz Stefaner",
      "start": 1711660,
      "text": "But it wasn't, like, a practical problem that you, like, made a mistake in the processing the material. But it's more like, artistically, you don't say it's quite there.",
      "id": "ep_106_ut_70"
    },
    {
      "end": 1797652,
      "speaker": "Adrien Segal",
      "start": 1720630,
      "text": "Yeah, I mean, I have made mistakes in, like, you know, I cut a bunch of plywood pieces out of an extra sheet that were the wrong thickness. And when you're stacking things, they all need to be the same thickness. So then I had to get that sheet recut, you know, those kind of mistakes which happen. Any fabricator knows that happens all the time, but never where I've gotten halfway through a piece and been like, this is not working. I'm just gonna throw it away. It takes me so long to get an idea developed enough to dive in to make it. You know, like, there's lots of ideas. I've gotten through a design to a design, but can't resolve something about how to make it oftentimes, because I don't start with what I want the finished piece to be. I don't. I don't know how to make it until I get to the point of fabricating, and sometimes I get stuck where I don't know how to fabricate something, or there's some geometry in the form that is really complicated and not very easy to fabricate. Or I need to learn a new material to be able to realize it the way that I think it should be done. So there's so many steps and checks and balances to get to the point of fabrication that once I start fabricating, I pretty much know exactly what I.",
      "id": "ep_106_ut_71"
    },
    {
      "end": 1811646,
      "speaker": "Moritz Stefaner",
      "start": 1797668,
      "text": "Need to do also. I mean, just financially, probably, it's a huge cost you would take just to try something out in huge. Right. So there's lots of work and a lot of material involved as well.",
      "id": "ep_106_ut_72"
    },
    {
      "end": 1814794,
      "speaker": "Adrien Segal",
      "start": 1811710,
      "text": "Yeah. It's easy to spend $1,000 on plywood.",
      "id": "ep_106_ut_73"
    },
    {
      "end": 1824994,
      "speaker": "Moritz Stefaner",
      "start": 1816254,
      "text": "But I guess you get some discount by now. Do you have, like, a shop where they are very happy when you show up again? It's like, oh, it's private time.",
      "id": "ep_106_ut_74"
    },
    {
      "end": 1854726,
      "speaker": "Adrien Segal",
      "start": 1826694,
      "text": "Yeah. In the grand scheme of things, people like, I mean, my shop is mainly shared with fabricators doing, like, kitchen cabinets and large scale furniture. So they buy actually a lot more material than I do. But financially, yeah, if I'm gonna make a piece that doesn't have a client, that I'm putting all that money in myself, which is fine, I don't. I wanna make things I care about, and if I have to fund that myself, I'm fine with that.",
      "id": "ep_106_ut_75"
    },
    {
      "end": 1943594,
      "speaker": "Enrico Bertini",
      "start": 1854830,
      "text": "Yeah. As I'm looking through the images of your works and listening to you talking about how you do it, it makes me want to do something similar. I never do that. I live in a digital world. It's terrible. It's like I spend most of my time in front of my computer when I want to create something. So for me, creation is mostly creating something digital. And fortunately, it's visible most of the time. But there are people out there who create things that are not even visible. So one thing I wanted to ask you is, so one aspect that I really like related to that is that you are kind of like, bringing back tangible information from digital information. So you're going the opposite way rather than going. So normally, data is normally the kind of, like, recording something, aspects or information of some real phenomena that happen out there. Right. And you go the other way. You start from digital and you put it back into the physical world. That's something that I really love of your work. So what do you think are, say, the advantages or disadvantages of working in a digital versus physical world? What is possible to do with data sculptures that is hard to recreate or communicate with in the digital world?",
      "id": "ep_106_ut_76"
    },
    {
      "end": 1957652,
      "speaker": "Adrien Segal",
      "start": 1944084,
      "text": "That's a good question. I've been doing a lot of research into the relationship between data, information, knowledge, and wisdom. Have you guys seen the pyramid?",
      "id": "ep_106_ut_77"
    },
    {
      "end": 1959464,
      "speaker": "Enrico Bertini",
      "start": 1957788,
      "text": "Yeah. Yeah.",
      "id": "ep_106_ut_78"
    },
    {
      "end": 2063565,
      "speaker": "Adrien Segal",
      "start": 1961844,
      "text": "And I'm really interested in the knowledge side of that because I feel like there's so much information out there, and it's not necessarily coming through and being applied to a knowledge or a knowing or a synthesized learning that people can actually utilize in their lives. And I'm speaking very generally here, but that's something I've been looking at. And in terms of science, in terms of removing the human element or the subjectivity from how we look at the natural world, I'm most interested in applying the information that science is collecting and aggregating and turning that into knowledge by having an observer and by creating a physical experience that that observer can then intuit the information that's available. And that's really why I feel like physical sculptures are the way that I've realized my work. I don't know if artwork is the most generally accessible format for that, but I think that the physical experience, the storytelling, the connection between humans that can happen through an experience, is one of the key elements to push the scientific information and the data overload that we have towards something that can be applied to knowledge. And that's why I've really been digging deeper into the physical realm of representing data.",
      "id": "ep_106_ut_79"
    },
    {
      "end": 2118764,
      "speaker": "Enrico Bertini",
      "start": 2063669,
      "text": "Yeah. And I have to say that, I mean, right now, like, the totality of information that we acquire from digital devices is mostly exclusively visual. Right. But I think there is a lot of evidence out there that we acquire information from our environment in many different ways. Right. So I guess having even in surprising ways and, yeah, I think that's fascinating that there's. I mean, right now, there's simply no way to have a similar experience to the one that you have when you see an actual physical object. Right. I mean, despite the recent advances in virtual reality, it's just completely different. Right. So much richer. And, yeah, I don't think we are at a stage where we can even simulate at all this kind of experience.",
      "id": "ep_106_ut_80"
    },
    {
      "end": 2183464,
      "speaker": "Adrien Segal",
      "start": 2119064,
      "text": "Yeah. Well, and we have to remember that the original instruments for data collection are our senses. And I feel, personally, a lot of push and pull with the digital world because it's trying to mediate and take away my being able to rely on my own senses. And that that includes sounds and smells and sight and touch. And there is a lot of VR more recently, that's trying to incorporate a broad spectrum of sensual activation in their experiences, but it's true. It's never gonna come close to the feeling you get being outside in a forest, hearing wind through the trees and feeling that wind on your face. Those are the moments that I'm after, and that's what really inspires the work that I make. And I want to show people that they can rely on their senses and be more in touch and intuitive with them.",
      "id": "ep_106_ut_81"
    },
    {
      "end": 2210246,
      "speaker": "Moritz Stefaner",
      "start": 2184524,
      "text": "That's true. Yeah. One thing I also find striking is when you create these massive objects out of data, you give also the data a lot of really actual weight because you say this data set is so important. You know, I want to really have, like, an object representing it. It's not something you would swap out easily or go to the next page or, you know, or delete or change the formula. It's.",
      "id": "ep_106_ut_82"
    },
    {
      "end": 2212998,
      "speaker": "Enrico Bertini",
      "start": 2210390,
      "text": "Yeah, it forces you to engage the physical form.",
      "id": "ep_106_ut_83"
    },
    {
      "end": 2231098,
      "speaker": "Moritz Stefaner",
      "start": 2213086,
      "text": "Yeah. And it's like you give it an actual weight in actual importance. And I think that's. Yeah, if everything, like, can be changed anytime, like, in the digital world, nothing's really final or actually important. You know, anything could be different anytime. And these word objects, they stay the way they are.",
      "id": "ep_106_ut_84"
    },
    {
      "end": 2234322,
      "speaker": "Adrien Segal",
      "start": 2231266,
      "text": "Yeah. There's no undo button when you're carving. Exactly.",
      "id": "ep_106_ut_85"
    },
    {
      "end": 2253448,
      "speaker": "Moritz Stefaner",
      "start": 2234458,
      "text": "Yeah. But that also gives then the underlying data this extra meaning, I think. Or at least you show that you really care about that data if you go through this lengthy process of casting or applying or carving something to represent it. Right.",
      "id": "ep_106_ut_86"
    },
    {
      "end": 2331722,
      "speaker": "Adrien Segal",
      "start": 2253626,
      "text": "Yeah. It is a really interesting process that only after doing several works have I been able to reflect on and, like, look inside myself and understand what's happening. And I have, I don't write code. I don't. I've tried. It's not my thing. I don't approach data from a digital knowing, and I've really come at it from this backdoor of literally plotting things on graph paper. At some points, I've gotten better with some of the tools I use, Excel spreadsheets, quite a bit. But I think having a more intuitive, embodied knowledge of that data, going through all the steps from design to fabrication to a finished thing, my body actually has an interaction with the patterns and the trends and the relationships and the changes in landscape that are happening that I'm dealing with in a very non cognitive way. It's a very embodied way, and it's a really strange experience to have, but it's something that really keeps driving my work forward.",
      "id": "ep_106_ut_87"
    },
    {
      "end": 2375312,
      "speaker": "Moritz Stefaner",
      "start": 2331858,
      "text": "Yeah. I think it's like we had an episode once where you talked about indexical visualizations, all these data less information displays, and I think your work is very close to that in a sense that some of the techniques are almost like, let's say, how do you say, long time exposure in photography or something like this, right. Where you would apply a physical trick to manipulate time or to work time, for instance, into a piece. If you extrude the shape of a glacier or a river a long time and make a sculpture out of that, you can see that as a data visualization or as a perceptual trick in a way, or like a data less information display as well. I think that's very intriguing.",
      "id": "ep_106_ut_88"
    },
    {
      "end": 2402154,
      "speaker": "Adrien Segal",
      "start": 2375448,
      "text": "Yeah. And we can't see the landscape. We see it in the moment. Like tides. You go to the ocean, you see it. If you spend 6 hours there, you can see it go from high tide to low tide. But to make that a static object that you can take in as a whole in relation to each other, it kind of. It reveals something that you can't see in a moment that I am interested in.",
      "id": "ep_106_ut_89"
    },
    {
      "end": 2408394,
      "speaker": "Moritz Stefaner",
      "start": 2402734,
      "text": "Super interesting. Can we briefly talk about art and science again? It's one of my favorite topics.",
      "id": "ep_106_ut_90"
    },
    {
      "end": 2410834,
      "speaker": "Adrien Segal",
      "start": 2409614,
      "text": "Absolutely.",
      "id": "ep_106_ut_91"
    },
    {
      "end": 2431130,
      "speaker": "Moritz Stefaner",
      "start": 2411134,
      "text": "Exactly. At the border. So I have somebody I can talk to about this. So do you. I just suspect you get a lot of this comments like, yeah, this all looks very nice, but is it really rigorous? And I can't really read the data. I'm missing a legend here. Do you get these types of comments or are you still.",
      "id": "ep_106_ut_92"
    },
    {
      "end": 2544524,
      "speaker": "Adrien Segal",
      "start": 2431162,
      "text": "Yeah, legibility is a big question when it comes to data. I'm an artist, which is very intentional choice. I often get asked if I have a scientific background, which I do not, and I kind of like that. I don't have any expertise in science per se. A lot of scientific reports, which can be very dry, particularly about climate change, can be very depressing as well. And I have a lot of personal feelings about how the bureaucracy of science is limiting the ability for that field to spread some of the really important work that's happening in the scientific field, specifically regarding the environment. But in many things no one's ever said specifically, like, I don't think this is useful because there's no scientific rigor behind it. It's a question that comes up. But I like to say that because I'm an artist, this is very much my interpretation of what that science is. And I have no qualms about that, that I'm very open with that. But I definitely do strive, in the way that I'm representing the work, to stay as accurate as possible. And because I'm showing forms that represent changes over time, typically not all of them are, but a lot of them are. I'm looking more at a longer term trend or a longer term pattern that is more about seeing relationships than it is about looking literally at one part and saying, how can I pull the numbers off of this piece and make sure it matches the data set you started with?",
      "id": "ep_106_ut_93"
    },
    {
      "end": 2552776,
      "speaker": "Moritz Stefaner",
      "start": 2545264,
      "text": "And you can always point back to the original reports and the original charts. If somebody really wants to know exactly.",
      "id": "ep_106_ut_94"
    },
    {
      "end": 2603490,
      "speaker": "Adrien Segal",
      "start": 2552880,
      "text": "What the data was, absolutely, they're welcome to research, too. I mean, I think I just want to get people excited about learning more about these things. I think it's a way to have a conversation that science sometimes has a challenging time getting across to people because it's a really dry format in the ways sometimes that science is limited to expressing an idea. So I've definitely got a lot of emails from scientists specifically that have seen my work, maybe work in the field of the data that I've used, and say a lot of them are really appreciative. Actually, I think they've all been appreciative that someone is trying to convey that idea, that message, in a format that. That would totally go over someone else's head in the scientific format. So I've actually gotten quite a bit of positive response from the scientific community.",
      "id": "ep_106_ut_95"
    },
    {
      "end": 2612454,
      "speaker": "Moritz Stefaner",
      "start": 2603642,
      "text": "Do you also get commissions from scientists where they say, oh, we have this new data set, and we would like you to work on the representation?",
      "id": "ep_106_ut_96"
    },
    {
      "end": 2704834,
      "speaker": "Adrien Segal",
      "start": 2613114,
      "text": "I've had people interested. I've never gotten a specific commission from that. I am doing a project right now with the University of Lethbridge. There's a great program in data visualization there. It's up in Canada. And they invited six data visualization artists to work on two specific data sets that they've partnered with scientists up there for that are related to wheat production. One is a wheat breeder who is trying to develop a perennial version of wheat, and the other one is a genetic scientist who's trying to genetically engineer a version of wheat that is a very to wheat rust, which is a really terrible fungus that can wipe out a whole wheat crop. So I have been approached with specific datasets, and I kind of see those as a challenge to do something I wouldn't normally choose. And I really kind of like that challenge. That's where the designer in me really comes out, because it's more about solving a problem. But it is also really challenging when I don't have complete control over what data sets I find, because usually you don't know what data set is going to give you that moment of realization or reveal that unseen thing. So the research part of that needs to let you find that data set specifically. I'm still learning how to have someone approach me with a data set and just jump right in and get something really meaningful out of it.",
      "id": "ep_106_ut_97"
    },
    {
      "end": 2749448,
      "speaker": "Moritz Stefaner",
      "start": 2704954,
      "text": "Yeah. Yeah, it's true. It all needs to come together, and it's not obvious that even somebody who might have an interesting data set, that it would be an interesting piece. Sure. Interesting. It's so intriguing. I think it's very unique, what you do. Also, in the beginning, I had sort of. I get it much better now, but I had trouble understanding if you're more like a designer who is on the artistic side, or more like a scientist who has, like, a design angle or an artist who is really on the fringes there. But I think now it's much clearer to me that you do place yourself in the art context. Right. And this is how you operate.",
      "id": "ep_106_ut_98"
    },
    {
      "end": 2770782,
      "speaker": "Adrien Segal",
      "start": 2749576,
      "text": "I kind of like. I like keeping people guessing. I like walking the line between all of those things. And I think the interdisciplinary work is really the most exciting to me, because I don't want to be put in a box, but, yeah, I think all of those titles work in a way, and I don't know.",
      "id": "ep_106_ut_99"
    },
    {
      "end": 2772234,
      "speaker": "Moritz Stefaner",
      "start": 2770878,
      "text": "Who cares in the end.",
      "id": "ep_106_ut_100"
    },
    {
      "end": 2779954,
      "speaker": "Adrien Segal",
      "start": 2772694,
      "text": "Yeah, I don't know. I think I land on artist because artist really. No one really knows what that means.",
      "id": "ep_106_ut_101"
    },
    {
      "end": 2782074,
      "speaker": "Moritz Stefaner",
      "start": 2780294,
      "text": "Yeah, that's always a plus.",
      "id": "ep_106_ut_102"
    },
    {
      "end": 2792474,
      "speaker": "Adrien Segal",
      "start": 2782574,
      "text": "Yeah. It's abstract enough that people. The first question is, usually, do you pay paint? No. It can mean anything at this point in time.",
      "id": "ep_106_ut_103"
    },
    {
      "end": 2830478,
      "speaker": "Moritz Stefaner",
      "start": 2792894,
      "text": "Super interesting. We briefly talked a bit about technique. This is something I'm also really interested in. So can you give us a quick rundown of what techniques are out there? There's so much interesting industrial production happening right now that we have access to. You talked about CNC machines, electronic milling devices. Right. But I think you could also use lasers or 3d print or. I don't know what else is out there. Like, what do you enjoy working with to produce these sculptures?",
      "id": "ep_106_ut_104"
    },
    {
      "end": 2844062,
      "speaker": "Adrien Segal",
      "start": 2830566,
      "text": "Yeah, I would say for prototyping, I definitely will use laser cutters to do, like, small scale versions. The process of figuring out proportions and scale and kind of that stuff is really great.",
      "id": "ep_106_ut_105"
    },
    {
      "end": 2848394,
      "speaker": "Moritz Stefaner",
      "start": 2844118,
      "text": "To always cut a thin material with a laser or wood also.",
      "id": "ep_106_ut_106"
    },
    {
      "end": 2924692,
      "speaker": "Adrien Segal",
      "start": 2848474,
      "text": "Yeah, you can cut wood. You can cut, you know, acrylic if you're doing something clear. You know, there's paper depending on the piece, depending on how quickly you're trying to work with it, and just kind of get an idea. Yeah, yeah. Like, thick cardboard can work really well too. I've definitely used I use digital fabrication help mostly in the prototyping phase, and I've also used water jet cutters to cut parts. You can cut plywood on a water jet cutter. There's reasons why it's not. It's way more expensive in some ways than using a CNC router. But it is a facility that can work, especially for certain kinds of parts, depending on how complicated they are. I've never been able to utilize 3d printing in, and I know specifically why. It's because a lot of the forms that I'm pulling out are really organic and fluid and have a lot of complicated shapes happening. And I've had a lot of issues having CAD modeling programs that give me enough control over the forms to really make the piece without distorting the data a lot.",
      "id": "ep_106_ut_107"
    },
    {
      "end": 2925920,
      "speaker": "Moritz Stefaner",
      "start": 2924758,
      "text": "Okay. Okay.",
      "id": "ep_106_ut_108"
    },
    {
      "end": 2949472,
      "speaker": "Adrien Segal",
      "start": 2926072,
      "text": "And unless you have a watertight CAD model, you can't actually 3d print anything. So I've mostly used rhino as a program to create the forms, and then I can put it into other programs to slice it up into layers and then cut things out in 3d materials from, you know, the digital to analog is a really fun process.",
      "id": "ep_106_ut_109"
    },
    {
      "end": 2954684,
      "speaker": "Moritz Stefaner",
      "start": 2949648,
      "text": "Okay. So the 3d part is much harder if you want to 3d print, is that right?",
      "id": "ep_106_ut_110"
    },
    {
      "end": 2987754,
      "speaker": "Adrien Segal",
      "start": 2954844,
      "text": "For me personally, yes. Just because of the forms that I'm pulling out are very organic. I definitely have seen other Dataviz physical visualization artists who are much more on the programming and much more on the design end, who do make their work with 3d printing and power to them. If I could just push a button and have it come out like, that'd be cool. I also. You can't make things at the scale I want to make them, or in the material.",
      "id": "ep_106_ut_111"
    },
    {
      "end": 3012132,
      "speaker": "Moritz Stefaner",
      "start": 2988054,
      "text": "Exactly. So I can see why it's not a good fit. Yeah, yeah. And if somebody would want to start, like, on a very, like, lo fi level, what do you think? What could be the best way to get started quickly? Like, could even. I don't know, you could even do pottery, I guess, or, like, what would be easy ways to experiment with sculptures or cardboard or. What's the best starting point? What would you say?",
      "id": "ep_106_ut_112"
    },
    {
      "end": 3053654,
      "speaker": "Adrien Segal",
      "start": 3012228,
      "text": "Yeah, I've done some really fun little series of smaller sculptures that are not data based, but more on a process based, where I've started with a plasticine clay, which is an oil based clay that doesn't ever dry. And it's really easy to sculpt and mold just with your hands. It's a really enjoyable process. I've taught workshops on this process, and people love the clay part because you just get your hands into it. And I've taught a lot of woodworking classes, particularly in the Bay area. Most of my students, which are adult, you know, nighttime classes, work in programming or in computer science, and they come into this class, and they're like, I just need to use my hands for something.",
      "id": "ep_106_ut_113"
    },
    {
      "end": 3056614,
      "speaker": "Enrico Bertini",
      "start": 3053994,
      "text": "Yeah. Yeah, that's me. That's me.",
      "id": "ep_106_ut_114"
    },
    {
      "end": 3152852,
      "speaker": "Adrien Segal",
      "start": 3057514,
      "text": "Well, for you, I would recommend plasticine clay. Get a two pound block of it and just start playing with it. Good idea. There's a really fun process that I've used. Used with. I don't know if you guys have heard of 123 D catch. I think they've changed it to revit. I'm not quite sure. It's an Autodesk product that is free, and you can take a series of photographs around an object from different angles. And I think it's between 35 to 70 photographs, and it will use those photographs to stitch the photographs into a CAD model, a mesh that you. Yeah, it's a really great way to streamline and actually cut out CAD modeling something from scratch, which can be a huge learning curve if you don't have CAD modeling experience. It takes a lot of time and energy to get the ability to make things you really want to make that don't just look like they're designed on a computer. So if you use 123 D catch, take photos, you can turn that into a mesh, and then with that mesh, you can. Can do some basic edits to it. You can scale it to a much larger scale, and then you can put it into another program and slice it up and then have parts to build. And that's a really great process for prototyping because you start with clay, go to a digital mesh, and then you can slice it up, cut those parts out on a laser cutter out of cardboard, and pretty quickly, immediately have a new version of that thing you made in clay.",
      "id": "ep_106_ut_115"
    },
    {
      "end": 3156344,
      "speaker": "Moritz Stefaner",
      "start": 3152948,
      "text": "That sounds great. I'll do that straight away. I'll get this clay.",
      "id": "ep_106_ut_116"
    },
    {
      "end": 3180224,
      "speaker": "Adrien Segal",
      "start": 3158984,
      "text": "It's a super fun process. I just kind of, like, you know, put on a show, mess with Clay for a really long time until I get a thing I like, and then just. Yeah, it's a way to be more intuitive and immediate in the way you make sometimes planning these huge sculptures. You get to a point where you're like, I need to just make something.",
      "id": "ep_106_ut_117"
    },
    {
      "end": 3189688,
      "speaker": "Moritz Stefaner",
      "start": 3180384,
      "text": "Right, right, yeah, yeah. Just be inspired by the form and. Yeah, just see what happens and not think everything out and just. Yeah, be a bit more intuitive.",
      "id": "ep_106_ut_118"
    },
    {
      "end": 3190378,
      "speaker": "Enrico Bertini",
      "start": 3189776,
      "text": "Yeah, exactly.",
      "id": "ep_106_ut_119"
    },
    {
      "end": 3191154,
      "speaker": "Adrien Segal",
      "start": 3190416,
      "text": "Exactly.",
      "id": "ep_106_ut_120"
    },
    {
      "end": 3196246,
      "speaker": "Moritz Stefaner",
      "start": 3191774,
      "text": "Fascinating. That's super interesting. It's crazy. It's a crazy world.",
      "id": "ep_106_ut_121"
    },
    {
      "end": 3197054,
      "speaker": "Enrico Bertini",
      "start": 3196430,
      "text": "Yeah.",
      "id": "ep_106_ut_122"
    },
    {
      "end": 3220514,
      "speaker": "Moritz Stefaner",
      "start": 3197174,
      "text": "And I'm so grateful for all this technology also that allows people like you to build all this stuff. You know, it's like, I don't know, ten years ago or 15 years ago, it would have been super hard to do these things. I mean, you got started around that time, but the progress in these areas is amazing. And I love that people like you use it for aesthetic and artistic purposes, not just industry or something.",
      "id": "ep_106_ut_123"
    },
    {
      "end": 3257974,
      "speaker": "Adrien Segal",
      "start": 3220594,
      "text": "Yeah, there's a lot of it being used for industry, for sure, but it is wonderful. There's so many tools out there that can just help you. Like, oh, that step can just be done this way, and it just allows it to kind of come quicker. That being said, I don't really make pieces quicker, but it would be nice if that did work. Equate. Have you guys ever thought about taking some of your data projects? I know, Moritz, you do like your food projects, which is this beautiful, experiential way to engage with data. But have you guys ever thought about going into a three dimensional realm with some of your work?",
      "id": "ep_106_ut_124"
    },
    {
      "end": 3280406,
      "speaker": "Enrico Bertini",
      "start": 3259994,
      "text": "Not really, but I am aware of a few researchers who've been doing some of these things. We actually had a couple of people in the past talking about 3d printed charts and. Yeah, there are a few people who are doing that. Yeah.",
      "id": "ep_106_ut_125"
    },
    {
      "end": 3289710,
      "speaker": "Moritz Stefaner",
      "start": 3280470,
      "text": "And also the episode with domestic data streamers who do these type of social sculptures, like, evolving 3d pieces, basically. I think this is awesome.",
      "id": "ep_106_ut_126"
    },
    {
      "end": 3293126,
      "speaker": "Adrien Segal",
      "start": 3289742,
      "text": "Oh, I love their work. It's very engaging. Yeah.",
      "id": "ep_106_ut_127"
    },
    {
      "end": 3364574,
      "speaker": "Moritz Stefaner",
      "start": 3293270,
      "text": "And the piece grows with the people interacting, which is always, like, such a nice thing and. Yeah, and this is also fascinating. Yeah, I mean, we once did a piece where we also CNC meld, like, out of, like, how's it called? This artificial words, like. Yeah, very dense material. And we had, like, these sort of also little landscapes depicting the ups and downs of the tweets around the Olympics 2014 or something. Yeah, I can't remember, but, yeah, it must have been. And, yeah, that was super fun. But I also got a lot of respect for all the complexities of actually producing something. It's, like, in physical form, so there's a lot of stuff that can go wrong, and it's hard to fix. And so we managed well. But it's, for instance, we had to, because the paint, it took, like, a week to dry, and we wanted to show the piece right after the Olympics. We had to produce the first plates during the Olympics, but we didn't know the scale of the data ultimately, because the data set wasn't finished when we started producing stuff like this was a bit crazy, but it worked out okay.",
      "id": "ep_106_ut_128"
    },
    {
      "end": 3426824,
      "speaker": "Enrico Bertini",
      "start": 3366034,
      "text": "Yeah, yeah. And there is actually. So in my office, I have a chart that has been donated to me by Pierre and Yvonne. We had them on the show back then. I think that was episode 17. And I love it. I always keep it in front of me. And they've been trying to study the thing from kind of, like, systematically from the scientific point of view. And they have very interesting findings. Like, yeah, they've been experimenting with different forms. And what people tend to do with physical bar charts is that they use their hands a lot. They point their finger to some bars. They compare bars by using two fingers. Right. So there is this whole idea of physical manipulation that is just so cumbersome to do it with a digital object. Right. So I think what you can do with your hands other than your eyes is also very, very important.",
      "id": "ep_106_ut_129"
    },
    {
      "end": 3428780,
      "speaker": "Adrien Segal",
      "start": 3427484,
      "text": "So, yeah, I've also.",
      "id": "ep_106_ut_130"
    },
    {
      "end": 3429692,
      "speaker": "Enrico Bertini",
      "start": 3428852,
      "text": "And it's beautiful.",
      "id": "ep_106_ut_131"
    },
    {
      "end": 3440990,
      "speaker": "Adrien Segal",
      "start": 3429788,
      "text": "I've also seen some really great projects using sound, you know, turning data into sound compositions, as well as some olfactory based pieces that are really.",
      "id": "ep_106_ut_132"
    },
    {
      "end": 3441686,
      "speaker": "Moritz Stefaner",
      "start": 3441142,
      "text": "Oh, wow.",
      "id": "ep_106_ut_133"
    },
    {
      "end": 3442334,
      "speaker": "Adrien Segal",
      "start": 3441750,
      "text": "Quite.",
      "id": "ep_106_ut_134"
    },
    {
      "end": 3468174,
      "speaker": "Moritz Stefaner",
      "start": 3442494,
      "text": "We didn't have that yet. Cool. I think we have to wrap up. It's super long already, but as always, we could go on chatting forever. But that was super interesting. And I'm really into this clay thing now. I'm already playing with something similar in my hands here, and I hope maybe some of the listeners also got on the data sculpture track and started to buy plywood for thousands of dollars.",
      "id": "ep_106_ut_135"
    },
    {
      "end": 3471034,
      "speaker": "Adrien Segal",
      "start": 3469554,
      "text": "You can start smaller.",
      "id": "ep_106_ut_136"
    },
    {
      "end": 3486362,
      "speaker": "Moritz Stefaner",
      "start": 3471154,
      "text": "Yeah, 100 is fine, too. Yeah. Cool. Adrian, thanks so much for joining us and sharing your work and perspective. That was fascinating. And we'll link to your site and all the projects in the show notes. So please take a look at the website.",
      "id": "ep_106_ut_137"
    },
    {
      "end": 3487650,
      "speaker": "Adrien Segal",
      "start": 3486458,
      "text": "Yeah, thanks so much.",
      "id": "ep_106_ut_138"
    },
    {
      "end": 3488738,
      "speaker": "Enrico Bertini",
      "start": 3487722,
      "text": "Thanks so much, Adrian.",
      "id": "ep_106_ut_139"
    },
    {
      "end": 3489890,
      "speaker": "Moritz Stefaner",
      "start": 3488786,
      "text": "Thanks for coming. Bye bye.",
      "id": "ep_106_ut_140"
    },
    {
      "end": 3490762,
      "speaker": "Adrien Segal",
      "start": 3489922,
      "text": "Bye bye.",
      "id": "ep_106_ut_141"
    },
    {
      "end": 3528494,
      "speaker": "Enrico Bertini",
      "start": 3490898,
      "text": "So, and before we stop, let's quickly mention some related episodes. If you are into data. Data sculptures. Now you have the data sculptures fever. We have at least three episodes that are related to this one. Back then, we already mentioned some of them. We have number 17, it's called data sculptures with Pierre Dragicevich and Ivan Jensen. And, yeah, mostly about how some research on what happens when you show people data that has been printed in physical world.",
      "id": "ep_106_ut_142"
    },
    {
      "end": 3554566,
      "speaker": "Moritz Stefaner",
      "start": 3528614,
      "text": "We also had a great episode with domestic data streamers, number 58. They do basically interactive data installations that are very physical. So people can maybe take a thread and tie it to the sculpture and answer some questions through that or drop something somewhere or build something together. And it's always, like, very fascinating and, yeah, very human work episode 58. Very nice one.",
      "id": "ep_106_ut_143"
    },
    {
      "end": 3572580,
      "speaker": "Enrico Bertini",
      "start": 3554630,
      "text": "Yeah. And the last one. We also already mentioned it. It's the one about indexical visualization with Dietmar off an Uber. And that's number 80. So you have enough to listen to. Yeah. To the next time.",
      "id": "ep_106_ut_144"
    },
    {
      "end": 3573732,
      "speaker": "Moritz Stefaner",
      "start": 3572692,
      "text": "Yeah. See you, man.",
      "id": "ep_106_ut_145"
    },
    {
      "end": 3599144,
      "speaker": "Enrico Bertini",
      "start": 3573828,
      "text": "Bye bye bye. Data stories is brought to you by click. Are you missing out on meaningful relationships even in your daily data? Unlock the old story with Qlik sense through personalized visualizations and dynamic dashboards, which you can download for free at click de data stories.",
      "id": "ep_106_ut_146"
    }
  ],
  "confidence": 0.934842657478197,
  "audio_duration": 3599,
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_status_code": null,
  "webhook_auth": false,
  "webhook_auth_header_name": null,
  "speed_boost": false,
  "auto_highlights_result": null,
  "auto_highlights": false,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_audio_quality": null,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "content_safety": false,
  "iab_categories": true,
  "content_safety_labels": {
    "status": "unavailable",
    "results": [],
    "summary": {}
  },
  "language_detection": false,
  "language_detection_threshold": null,
  "language_confidence": null,
  "custom_spelling": null,
  "throttled": false,
  "auto_chapters": true,
  "summarization": false,
  "summary_type": null,
  "summary_model": null,
  "custom_topics": false,
  "topics": [],
  "speech_threshold": null,
  "speech_model": "best",
  "chapters": [
    {
      "summary": "Data stories is brought to you by click. Are you missing out on meaningful relationships hidden in your data? Unlock the old story with Qlik sense through personalized visualizations and dynamic dashboards. Today we have a special guest again, Adrien Segal.",
      "gist": "Data Stories",
      "headline": "Enrico Bertini talks with Adrien Segal about data visualization",
      "start": 200,
      "end": 84594,
      "id": "ep_106_ch_0"
    },
    {
      "summary": "Adrian is a sculptor who makes physical representations of data. His background is in furniture design. His first data sculpture was a full cycle of tide charts from San Francisco Bay. He says Edward Tufte's work inspired him to go straight into data visualization.",
      "gist": "Adrian's Tidal Datum",
      "headline": "Adrian Webb makes physical representations of data through furniture",
      "start": 84674,
      "end": 581442,
      "id": "ep_106_ch_1"
    },
    {
      "summary": "The artist did a residency in Homer, Alaska, studying glaciers and glacial retreats. He used a computer program called Rhino for 3d modeling those pieces. Someone once asked him, wait, it's ice. Is that art? How can you sell it?",
      "gist": "Slowing the Earth",
      "headline": "You've done a lot of data sculptures, often with ecological data",
      "start": 581618,
      "end": 878954,
      "id": "ep_106_ch_2"
    },
    {
      "summary": "Ice sculpture based on a glacier melting before your eyes. It's about an eight hour filming that's condensed into 45 seconds, maybe a minute. The moment where it collapses, I've definitely. loved. It. There are other iceworks that are sellable.",
      "gist": "Ice Sculpture Made in the Ice",
      "headline": "How did you get the ice to freeze so nicely? Did you have any special tricks",
      "start": 879114,
      "end": 1212304,
      "id": "ep_106_ch_3"
    },
    {
      "summary": "Sculptural data artist works primarily out of a shared woodshop and full access, all machinery. What drives them, basically, the shape is the data, which is so abstract and non tangible. Can you tell us a bit about the practical side of these, of the production and the design.",
      "gist": "Sculptural Data Artists",
      "headline": "You have lots of interesting wood sculptures on your website",
      "start": 1212344,
      "end": 1607120,
      "id": "ep_106_ch_4"
    },
    {
      "summary": "I get to tap into an intuitive action in my body. plywood's also really nice for shaping forms. It takes a long time to go from design to fabrication to finished. Not every single piece you make is gonna be awesome.",
      "gist": "How to Make a Plywood Sculpture",
      "headline": "It takes a long time from design to fabrication to, like, finished pieces",
      "start": 1607192,
      "end": 1886594,
      "id": "ep_106_ch_5"
    },
    {
      "summary": "I've been doing a lot of research into the relationship between data, information, knowledge, and wisdom. Right now, there's simply no way to have a similar experience to the one that you have when you see an actual physical object. That's why I've really been digging deeper into the physical realm of representing data.",
      "gist": "Skulpture Drawing From Physical Data",
      "headline": "You bring tangible information from digital to the physical world through sculptures",
      "start": 1887314,
      "end": 2403838,
      "id": "ep_106_ch_6"
    },
    {
      "summary": "Art and science is one of my favorite topics. I often get asked if I have a scientific background, which I do not. Because I'm an artist, this is very much my interpretation of what that science is. I've actually gotten quite a bit of positive response from the scientific community.",
      "gist": "\"Art and Science\"",
      "headline": "Can we briefly talk about art and science again? It's one of my favorite topics",
      "start": 2403966,
      "end": 2603490,
      "id": "ep_106_ch_7"
    },
    {
      "summary": "I am doing a project right now with the University of Lethbridge. They invited six data visualization artists to work on two specific data sets related to wheat production. The interdisciplinary work is really the most exciting to me. I like keeping people guessing.",
      "gist": "Do Data Visualization Artists Get Commissions?",
      "headline": "Do you get commissions from scientists where they say they have new data set",
      "start": 2603642,
      "end": 2794194,
      "id": "ep_106_ch_8"
    },
    {
      "summary": "For prototyping, I definitely will use laser cutters to do, like, small scale versions. Unless you have a watertight CAD model, you can't actually 3d print anything. What could be the best way to get started quickly?",
      "gist": "Slaying Sculptures With a 3-D Printer",
      "headline": "We briefly talked a bit about technique. You talked about CNC machines, electronic milling devices",
      "start": 2794734,
      "end": 3202670,
      "id": "ep_106_ch_9"
    },
    {
      "summary": "You know, it's like, ten years ago or 15 years ago, it would have been super hard to do these things. And I love that people like you use it for aesthetic and artistic purposes, not just industry or something. There's so many tools out there that can just help you.",
      "gist": "Tools for Making Artful Pieces",
      "headline": "The progress in these areas is amazing. You know, it's like,",
      "start": 3202702,
      "end": 3239534,
      "id": "ep_106_ch_10"
    },
    {
      "summary": "Have you guys ever thought about going into a three dimensional realm with some of your work? Not really, but I am aware of a few researchers who've been doing some of these things. What you can do with your hands other than your eyes is also very, very important.",
      "gist": "Have You Guys Ever Thought About Taking Your Data Projects to 3-",
      "headline": "Have you guys ever thought about taking some of your data projects into 3D",
      "start": 3241594,
      "end": 3443954,
      "id": "ep_106_ch_11"
    },
    {
      "summary": "Adrian: I'm really into this clay thing now. I hope maybe some of the listeners also got on the data sculpture track and started to buy plywood. Adrian, thanks so much for joining us and sharing your work and perspective.",
      "gist": "Interview",
      "headline": "Adrian, thanks so much for joining us and sharing your work",
      "start": 3445334,
      "end": 3490762,
      "id": "ep_106_ch_12"
    },
    {
      "summary": "Data sculptures. Now you have the data sculptures fever. We have at least three episodes that are related to this one. And the last one is the one about indexical visualization with Dietmar off an Uber. So you have enough to listen to.",
      "gist": "Data Stories: The Story of Indexical visualization",
      "headline": "So, and before we stop, let's quickly mention some related episodes",
      "start": 3490898,
      "end": 3599144,
      "id": "ep_106_ch_13"
    }
  ],
  "disfluencies": false,
  "entity_detection": false,
  "sentiment_analysis": false,
  "sentiment_analysis_results": null,
  "entities": null,
  "speakers_expected": null,
  "summary": null,
  "custom_topics_results": null,
  "episode_num": 106,
  "episode_metadata": {
    "speakers": [
      "Adrien Segal",
      "Enrico Bertini",
      "Moritz Stefaner"
    ],
    "WPid": "1028",
    "url": "https://datastori.es/podlove/file/4381/s/feed/c/mp3/ds-106-data-sculptures-with-adrien-segal.mp3",
    "episode_title": "Data Sculptures with Adrien Segal"
  }
}