{
  "id": "922bc21f-80e5-4eff-8f18-df0c64988aa0",
  "language_model": "assemblyai_default",
  "acoustic_model": "assemblyai_default",
  "language_code": "en_us",
  "status": "completed",
  "audio_url": "https://datastori.es/podlove/file/674/s/feed/c/mp3/data-stories-51-smart-cities-w-dietmar-offenhuber.mp3",
  "utterances": [
    {
      "end": 39842,
      "speaker": "Moritz Stefaner",
      "start": 1520,
      "text": "Data stories is brought to you by Qlik, who allows you to explore the hidden relationships within your data that lead to meaningful insights. Let your instincts lead the way to create personalized visualizations and dynamic dashboards with Qlik sense, which you can download for free at Qlik Datastories. That's q dash deries. Hey, everyone. Datastore is 51. I'm Moritz. And there's Enrico.",
      "id": "ep_51_ut_0"
    },
    {
      "end": 42270,
      "speaker": "Enrico Bertini",
      "start": 39946,
      "text": "Hey, Moritz, how's it going?",
      "id": "ep_51_ut_1"
    },
    {
      "end": 45834,
      "speaker": "Moritz Stefaner",
      "start": 42690,
      "text": "Good. A bit of a cold, but that's usually, I guess.",
      "id": "ep_51_ut_2"
    },
    {
      "end": 48258,
      "speaker": "Enrico Bertini",
      "start": 45882,
      "text": "Yeah, that's the right time of the year.",
      "id": "ep_51_ut_3"
    },
    {
      "end": 50322,
      "speaker": "Moritz Stefaner",
      "start": 48394,
      "text": "Sipping tea. Ginger tea.",
      "id": "ep_51_ut_4"
    },
    {
      "end": 52790,
      "speaker": "Enrico Bertini",
      "start": 50426,
      "text": "Shame on you. Normally it's wine.",
      "id": "ep_51_ut_5"
    },
    {
      "end": 62624,
      "speaker": "Moritz Stefaner",
      "start": 53090,
      "text": "Yeah, I'm getting old. Yeah, no, I'm just gathering my powers here. Drinking some ginger tea.",
      "id": "ep_51_ut_6"
    },
    {
      "end": 63020,
      "speaker": "Enrico Bertini",
      "start": 62722,
      "text": "Yeah.",
      "id": "ep_51_ut_7"
    },
    {
      "end": 66108,
      "speaker": "Moritz Stefaner",
      "start": 63060,
      "text": "How are things for you? Still busy probably with this semester.",
      "id": "ep_51_ut_8"
    },
    {
      "end": 84988,
      "speaker": "Enrico Bertini",
      "start": 66204,
      "text": "Yeah, busy with this semester, but it's getting better. I'm really excited about my class. I think we assigned a lot of interesting projects, so now I'm curious to see what they are able to do. So let's see, last year it was a lot of fun and this year, hopefully it's going to be even more fun. Let's see what happens.",
      "id": "ep_51_ut_9"
    },
    {
      "end": 87508,
      "speaker": "Moritz Stefaner",
      "start": 85044,
      "text": "So you're beyond the introductions and now you get into the.",
      "id": "ep_51_ut_10"
    },
    {
      "end": 123440,
      "speaker": "Enrico Bertini",
      "start": 87564,
      "text": "Yeah, now I'm getting to the core part of it. And actually I think next lecture is going to be on visual encoding, which is kind of like the soul of heart and soul of visualization. And I still. So this year, for the first time, I would like to create some smart exercises because I think especially the encoding part is something that, where students need to play with things a lot before they understand exactly what's. What it is and how powerful it is. So if you have any suggestions, I'm happy.",
      "id": "ep_51_ut_11"
    },
    {
      "end": 125872,
      "speaker": "Moritz Stefaner",
      "start": 123480,
      "text": "Yeah, I would totally do the 37 75 exercise.",
      "id": "ep_51_ut_12"
    },
    {
      "end": 127536,
      "speaker": "Enrico Bertini",
      "start": 125896,
      "text": "Oh, yeah, yeah, absolutely.",
      "id": "ep_51_ut_13"
    },
    {
      "end": 133344,
      "speaker": "Moritz Stefaner",
      "start": 127728,
      "text": "I do it every time and it's always a huge success and very eye opening. It's really good. So.",
      "id": "ep_51_ut_14"
    },
    {
      "end": 149480,
      "speaker": "Enrico Bertini",
      "start": 133472,
      "text": "Yeah, yeah, yeah, I vaguely remember. I think Kim Reese has one where she gives buttons, spare buttons, to the class and then they have to arrange things with buttons. That's a really good one. Well.",
      "id": "ep_51_ut_15"
    },
    {
      "end": 155252,
      "speaker": "Moritz Stefaner",
      "start": 151940,
      "text": "And good idea to do something practical because you can talk about.",
      "id": "ep_51_ut_16"
    },
    {
      "end": 162484,
      "speaker": "Enrico Bertini",
      "start": 155316,
      "text": "Yeah, you cannot really learn encoding by thinking about it, I guess. I think you have to try and try again.",
      "id": "ep_51_ut_17"
    },
    {
      "end": 163400,
      "speaker": "Dietmar Offenhuber",
      "start": 162652,
      "text": "Yeah.",
      "id": "ep_51_ut_18"
    },
    {
      "end": 172740,
      "speaker": "Moritz Stefaner",
      "start": 165980,
      "text": "Cool. Two quick updates for me. I just came back from future everything. So as you can see, I'm traveling all the time now. It's this time of the year.",
      "id": "ep_51_ut_19"
    },
    {
      "end": 173172,
      "speaker": "Enrico Bertini",
      "start": 172820,
      "text": "Nice.",
      "id": "ep_51_ut_20"
    },
    {
      "end": 212284,
      "speaker": "Moritz Stefaner",
      "start": 173236,
      "text": "Future everything. Good conference on digital culture. And they had a track on haunted machines investigating the relation of magic and technology. And it sounds like a joke, but it's really good. Turns out it's a really interesting perspective to take, and it allows you to talk about what's going on in tech culture today in a bit of a metaphorical world, and that allows you to sort of think different thoughts, I think. And that was really fascinating. And they had a whole sub conference on this water theme, like six, seven different talks they will be on, I will link to them. I think they were quite enlightening and also fun.",
      "id": "ep_51_ut_21"
    },
    {
      "end": 214840,
      "speaker": "Enrico Bertini",
      "start": 212412,
      "text": "Can you give us an example of what happens there?",
      "id": "ep_51_ut_22"
    },
    {
      "end": 262752,
      "speaker": "Moritz Stefaner",
      "start": 215180,
      "text": "Yeah, I mean, it's just transferring this whole world, let's say what happens in the startups and in Silicon Valley and at Apple, and transfer that into the world of mages and wizards and witches, and suddenly a lot of things, you can talk about things in a different way. And, I mean, technology is still a very opaque, black box magic type thing to many people. The people who exercise it have great powers, right? And nobody really knows how, how this works, you know, except the people doing it. And there's also charlatans and mystics and, you know, people who just use the same symbols, but actually don't really know what's going on. And there's white hats and blackheads, you know, if you think it through, it all makes sense suddenly, you know, you.",
      "id": "ep_51_ut_23"
    },
    {
      "end": 278932,
      "speaker": "Enrico Bertini",
      "start": 262776,
      "text": "Just reminded me of a story many, many years back, when I was still in Rome, the shop where I used to go to buy computers and devices, there was a lady who actually came and she was super scared about getting a virus from her computer.",
      "id": "ep_51_ut_24"
    },
    {
      "end": 280800,
      "speaker": "Moritz Stefaner",
      "start": 279076,
      "text": "Exactly right.",
      "id": "ep_51_ut_25"
    },
    {
      "end": 286868,
      "speaker": "Enrico Bertini",
      "start": 282140,
      "text": "So that's really interesting. I found it really interesting, and in.",
      "id": "ep_51_ut_26"
    },
    {
      "end": 345226,
      "speaker": "Moritz Stefaner",
      "start": 286884,
      "text": "A way, it's exactly what we want to avoid. Also that people think it's magic. You know, we want to be very transparent and simple, but the way it plays out is much different. So it's. It's a very interesting theme, and I think it becomes a whole, whole longer discourse, I think, around it. So if you follow haunted machines on Twitter or search for the word hauntology, which I can, that's a good starting point, and we will link to that from the show notes, of course. Second, we finally launched on the web, our Broadway installation. So the project we did with Romanovich, Domenico Spauld and Gotemara, we put that on the web so you can actually browse the same data as we have in the interactive installation at New York Public Library. And, yeah, I think it turned out really well. Dominicos did a fantastic job of making that work in normal browsers. It's quite amazing, and you should give it a shot. We'll link to it from the blog post.",
      "id": "ep_51_ut_27"
    },
    {
      "end": 348790,
      "speaker": "Enrico Bertini",
      "start": 345418,
      "text": "So can we go visiting at the public library?",
      "id": "ep_51_ut_28"
    },
    {
      "end": 380930,
      "speaker": "Moritz Stefaner",
      "start": 349650,
      "text": "Yeah, that's. Anyways, so that's the whole year. It's in the ground floor, no entrance fee. If you go to New York Public Library, you can play with the application and also see the rest of the exhibition, which is really great. It's 175 years of photography and really great pieces from the whole time span. Or you go to the URL provided in the blog post and then you can play with the interactive application yourself and also see the documentation and some of the thinking behind it and where the data came from, things like this.",
      "id": "ep_51_ut_29"
    },
    {
      "end": 382478,
      "speaker": "Enrico Bertini",
      "start": 381710,
      "text": "Great.",
      "id": "ep_51_ut_30"
    },
    {
      "end": 401286,
      "speaker": "Moritz Stefaner",
      "start": 382654,
      "text": "Yeah. And that leads me directly seguing nicely to our guest today because he's also really into cities, among many other things, but also cities. And that's Dietmar Offenhube, and he's sitting right next to Enrico now, but I'm sitting in Germany, so it's totally a strange situation.",
      "id": "ep_51_ut_31"
    },
    {
      "end": 403078,
      "speaker": "Enrico Bertini",
      "start": 401398,
      "text": "We have an interesting setting today.",
      "id": "ep_51_ut_32"
    },
    {
      "end": 406502,
      "speaker": "Moritz Stefaner",
      "start": 403134,
      "text": "Yeah, very confusing, but. Hi, Dietmar.",
      "id": "ep_51_ut_33"
    },
    {
      "end": 409010,
      "speaker": "Dietmar Offenhuber",
      "start": 406566,
      "text": "Yeah. Hi, Moritz. Hi, Lincoln.",
      "id": "ep_51_ut_34"
    },
    {
      "end": 423110,
      "speaker": "Moritz Stefaner",
      "start": 409670,
      "text": "Great avenue here since we met. So actually, just anecdotally, Dietma was organizing, for instance, a workshop called the center of Information in Linz, 2007.",
      "id": "ep_51_ut_35"
    },
    {
      "end": 425446,
      "speaker": "Dietmar Offenhuber",
      "start": 423190,
      "text": "Yeah, it was a couple of years ago. Yeah.",
      "id": "ep_51_ut_36"
    },
    {
      "end": 431890,
      "speaker": "Moritz Stefaner",
      "start": 425638,
      "text": "And this is where I first met Lev Manovic. So you see how everything's connected. It's all a big conspiracy, actually.",
      "id": "ep_51_ut_37"
    },
    {
      "end": 434798,
      "speaker": "Dietmar Offenhuber",
      "start": 433750,
      "text": "All the conspiracy.",
      "id": "ep_51_ut_38"
    },
    {
      "end": 439610,
      "speaker": "Moritz Stefaner",
      "start": 434894,
      "text": "Yeah, yeah. It always comes back to the same people.",
      "id": "ep_51_ut_39"
    },
    {
      "end": 440262,
      "speaker": "Dietmar Offenhuber",
      "start": 439950,
      "text": "Yeah.",
      "id": "ep_51_ut_40"
    },
    {
      "end": 445770,
      "speaker": "Moritz Stefaner",
      "start": 440286,
      "text": "Thanks for having me. Can you tell us a bit about your background and what you're doing now?",
      "id": "ep_51_ut_41"
    },
    {
      "end": 487050,
      "speaker": "Dietmar Offenhuber",
      "start": 446270,
      "text": "Yeah. So, Diet Maufenhofer. I'm currently on faculty at Northeastern University in Boston, and I'm heading a new MFA program for information design and visualization, which is very exciting because we are exploring many different things, trying to figure out how to position this in a really interdisciplinary framework. But I also have a kind of a second life as a, as an urban planner, and I've always been fascinated with, you know, reading the city in different way and understanding how, you know, space in a way. What is the role of space in society?",
      "id": "ep_51_ut_42"
    },
    {
      "end": 497350,
      "speaker": "Moritz Stefaner",
      "start": 489030,
      "text": "Yeah. And I mean, you have quite a diverse background. So when did you start, like, working creatively with computers? There must have been.",
      "id": "ep_51_ut_43"
    },
    {
      "end": 497686,
      "speaker": "Enrico Bertini",
      "start": 497430,
      "text": "Yeah.",
      "id": "ep_51_ut_44"
    },
    {
      "end": 601880,
      "speaker": "Dietmar Offenhuber",
      "start": 497718,
      "text": "So, yeah, in the nineties, I started as an architecture student without really having the firm plan to ever become an architect. I just found it interesting. And I started, this was actually in architecture, I have to say, the nineties were very interesting time because everyone was playing around with all kinds of different technology. Nobody actually designed buildings. Everyone designed virtual kind of sculptures and responsive things, and we all thought that this is really important and this very cutting edge. But then I got a little bit sidetracked, and I worked with Arcektronika Futurelab, which is a little bit like a small Austrian media lab where we worked on all kinds of different projects and installations. And, yeah, I spent there around ten years before finally finishing my architecture degree. And then after a couple of other things, I joined the media lab at MIT in the sociable media group with Judith Donath, who is an amazing academic, and she was pretty much ahead of her time in terms of social media, but I always knew that was more interested in urban systems. So then I followed with a PhD at the Urban Planning Institute at MIT with Sensible city lab. And, yeah, that is the story so far.",
      "id": "ep_51_ut_45"
    },
    {
      "end": 606716,
      "speaker": "Moritz Stefaner",
      "start": 603100,
      "text": "And then you went to northeastern. Are you now fully employed at Northeast?",
      "id": "ep_51_ut_46"
    },
    {
      "end": 615406,
      "speaker": "Dietmar Offenhuber",
      "start": 606748,
      "text": "Yeah, yeah, yeah. I'm basically. So the MFA program basically takes all my time, so I'm fully immersed in that at the moment.",
      "id": "ep_51_ut_47"
    },
    {
      "end": 617390,
      "speaker": "Enrico Bertini",
      "start": 615548,
      "text": "So this is the school of design?",
      "id": "ep_51_ut_48"
    },
    {
      "end": 634026,
      "speaker": "Dietmar Offenhuber",
      "start": 617770,
      "text": "Yeah, it's at the school of Design, but I have a dual appointment also in the public policy and urban affairs program. So this is something that northeastern likes to do, having, you know, mixing things up and having people associated with different departments.",
      "id": "ep_51_ut_49"
    },
    {
      "end": 634790,
      "speaker": "Enrico Bertini",
      "start": 634138,
      "text": "Nice.",
      "id": "ep_51_ut_50"
    },
    {
      "end": 655664,
      "speaker": "Moritz Stefaner",
      "start": 636650,
      "text": "Yeah, that sounds really promising. And, yeah, if you're looking for a good MFA, this might be one. Yeah. Because also these young study programs, there's still a chance. So it might be a bit more unorganized, but there's also still a chance to own it and sort of make it the way you want it. Right?",
      "id": "ep_51_ut_51"
    },
    {
      "end": 699000,
      "speaker": "Dietmar Offenhuber",
      "start": 655832,
      "text": "It is. I mean, it requires definitely a lot of, you know, people have. We're looking for students who have a vision, who want to go into a certain direction. And it's quite interesting, actually. I have people who are marine biologists or people who come from completely different fields, but then got interested in visualization. And this is actually. I mean, I think visualization, in a way, is. I always think of visualization as a kind of a boundary discipline that is most powerful at the boundary between different disciplines, where it's always about translating or facilitating. Yeah. Exchange.",
      "id": "ep_51_ut_52"
    },
    {
      "end": 731492,
      "speaker": "Enrico Bertini",
      "start": 699460,
      "text": "Yeah, this is so true. I'm always amazed, especially going through so many interviews in data stories, how many different backgrounds people have in this area. It's really, really amazing. I mean, you have a background in architecture, then you do stuff in design, then urban planning is very, very interesting. And I don't know myself. I am a computer engineer, but devoted to visualization, and other people have completely different kinds of background. That's probably the beauty of it. I mean, probably that's the reason why.",
      "id": "ep_51_ut_53"
    },
    {
      "end": 740260,
      "speaker": "Moritz Stefaner",
      "start": 731516,
      "text": "We like to work with all the experts in the other. Exactly, exactly. Because usually you have a topic outside of visualization to work on. Yeah.",
      "id": "ep_51_ut_54"
    },
    {
      "end": 744604,
      "speaker": "Enrico Bertini",
      "start": 740420,
      "text": "And there are so many different kinds of people who do need visualization. Right.",
      "id": "ep_51_ut_55"
    },
    {
      "end": 756544,
      "speaker": "Dietmar Offenhuber",
      "start": 744772,
      "text": "And also, if you look back in history, I mean, a lot of the visualization, the milestones came from different disciplines, not necessarily graphic design. Oh, absolutely.",
      "id": "ep_51_ut_56"
    },
    {
      "end": 760136,
      "speaker": "Enrico Bertini",
      "start": 756732,
      "text": "A lot of statisticians have done good things in visualization.",
      "id": "ep_51_ut_57"
    },
    {
      "end": 761100,
      "speaker": "Dietmar Offenhuber",
      "start": 760248,
      "text": "Exactly.",
      "id": "ep_51_ut_58"
    },
    {
      "end": 780024,
      "speaker": "Moritz Stefaner",
      "start": 762600,
      "text": "Cool. So shall we talk about a few of your projects before we come to your recent books? And also the main topic of what we want to talk about? So one project I found really, really interesting is Wegzeit, which translates to way time. Could you say that?",
      "id": "ep_51_ut_59"
    },
    {
      "end": 846910,
      "speaker": "Dietmar Offenhuber",
      "start": 780192,
      "text": "Yeah, so it was, this was, this was actually my architecture thesis in. I. I worked on it in 1999, and until 2000 I was interested in the notion of relative space, how Los Angeles as a city that is really, really regular for most of its part, becomes distorted in the subjective experience of time, of attention and all those different things. This was actually before, you know, there was really an audience for this type of visualization. And processing, I think, was also more or less at the same time when Ben and Casey started developing processing. So there were not really any tools that. So I worked with, mostly with technology that doesn't work anymore today. So the project is more or less lost, but yeah, it was something called word tools. It came out from the. Yeah, they had a web three. They had very big plans for Web 3D.",
      "id": "ep_51_ut_60"
    },
    {
      "end": 853422,
      "speaker": "Moritz Stefaner",
      "start": 847930,
      "text": "It was a bit like you, like the slog that unity has today was captured by virtual at the time.",
      "id": "ep_51_ut_61"
    },
    {
      "end": 860050,
      "speaker": "Dietmar Offenhuber",
      "start": 853526,
      "text": "Yeah, exactly. So. Yeah, but a couple of years ago it more or less disappeared from the stage.",
      "id": "ep_51_ut_62"
    },
    {
      "end": 861934,
      "speaker": "Enrico Bertini",
      "start": 861350,
      "text": "Too bad.",
      "id": "ep_51_ut_63"
    },
    {
      "end": 865702,
      "speaker": "Moritz Stefaner",
      "start": 861982,
      "text": "But you still have some 160 by 120. Quick demo.",
      "id": "ep_51_ut_64"
    },
    {
      "end": 871646,
      "speaker": "Dietmar Offenhuber",
      "start": 865846,
      "text": "Yeah, exactly. Historical documents. Yeah, yeah.",
      "id": "ep_51_ut_65"
    },
    {
      "end": 881420,
      "speaker": "Moritz Stefaner",
      "start": 871678,
      "text": "But I think, I thought the thinking behind it is still very current. You know, we have geographical space and then we have the sort of extra layers that distort this so called real world.",
      "id": "ep_51_ut_66"
    },
    {
      "end": 881732,
      "speaker": "Dietmar Offenhuber",
      "start": 881500,
      "text": "Yeah.",
      "id": "ep_51_ut_67"
    },
    {
      "end": 893964,
      "speaker": "Moritz Stefaner",
      "start": 881756,
      "text": "And are maybe actually more real than the actual physical world. Like. Yeah, I was real time and the digital overlays and so on. I think that's a very. Still a theme we're all still working on, I guess, right?",
      "id": "ep_51_ut_68"
    },
    {
      "end": 894324,
      "speaker": "Dietmar Offenhuber",
      "start": 894052,
      "text": "Yeah.",
      "id": "ep_51_ut_69"
    },
    {
      "end": 899996,
      "speaker": "Enrico Bertini",
      "start": 894372,
      "text": "Maybe you want to describe how these visualizations look like. I know it's hard to describe things like that.",
      "id": "ep_51_ut_70"
    },
    {
      "end": 901084,
      "speaker": "Dietmar Offenhuber",
      "start": 900028,
      "text": "Yeah, well, I mean, I just to.",
      "id": "ep_51_ut_71"
    },
    {
      "end": 903306,
      "speaker": "Enrico Bertini",
      "start": 901092,
      "text": "Give an impression of what is about.",
      "id": "ep_51_ut_72"
    },
    {
      "end": 1034480,
      "speaker": "Dietmar Offenhuber",
      "start": 903468,
      "text": "So the issue is with time space. I was really influenced by all these human geographers from the late sixties and early seventies. And this kind of difficulty at representing, once you replace absolute units of space with relative units, the whole geometry of space more or less falls apart, because when you go from point a to point b, but the distance from point b to point a, so the opposite direction might be a completely different one. So the whole consistency of space falls apart. So I had to think of different geometrical interpretations to deal with these distinctions. For example, for this kind of distances, I. I use this metaphor that you basically climb a mountain, so when you're on the slower path and it goes down if you're on the faster track. And so basically, as you choose your route through the city, the whole city more or less becomes a kind of a three dimensional shape that basically always tells you whether you're on the fast or on the lower track. But this was just one of seven different ones. One funny thing was, I tried to reconstruct the city based on telephone conversations. So I called up different companies from the yellow pages and asked them to describe the way to the office. Then I used this as my virtual starting point and asked another company, and I think I had about 50 or more than 50 of these conversations. And then I basically tried to reconstruct the city just based from this discrete. And it worked remarkably well. That was the interesting thing, because LA in, and this is something special about LA that people, you know, are used to driving. And so they have a very. They're very good at giving directions. And it was amazing.",
      "id": "ep_51_ut_73"
    },
    {
      "end": 1038580,
      "speaker": "Enrico Bertini",
      "start": 1034600,
      "text": "And then you have stripes. I saw that one where you have stripes that represent time.",
      "id": "ep_51_ut_74"
    },
    {
      "end": 1061940,
      "speaker": "Dietmar Offenhuber",
      "start": 1039000,
      "text": "Yeah, that was the other thing. I mean, this was more or less like Google Street View, but only in 2000, where I basically mounted two cameras in the side windows of my cardinal. And I systematically traveled different parts of LA and mapped the time distances at the same time, but also the traffic light phases and those kind of things.",
      "id": "ep_51_ut_75"
    },
    {
      "end": 1066684,
      "speaker": "Enrico Bertini",
      "start": 1062060,
      "text": "This means that the stripes have the same length, but they also represent the same amount of time.",
      "id": "ep_51_ut_76"
    },
    {
      "end": 1075810,
      "speaker": "Dietmar Offenhuber",
      "start": 1066812,
      "text": "Yes, but they also deformed based on their shape changed. So that's the kind of distortion based thing. Yeah.",
      "id": "ep_51_ut_77"
    },
    {
      "end": 1078250,
      "speaker": "Enrico Bertini",
      "start": 1075980,
      "text": "So you've done that in the. In 2000?",
      "id": "ep_51_ut_78"
    },
    {
      "end": 1085810,
      "speaker": "Dietmar Offenhuber",
      "start": 1078550,
      "text": "Yeah, this was. This was 2001 when I did the kind of distortion based representations. Pretty cool.",
      "id": "ep_51_ut_79"
    },
    {
      "end": 1090478,
      "speaker": "Moritz Stefaner",
      "start": 1086550,
      "text": "Yeah, it's a great project. So I hope there's some documentation still left.",
      "id": "ep_51_ut_80"
    },
    {
      "end": 1095030,
      "speaker": "Dietmar Offenhuber",
      "start": 1090654,
      "text": "Yeah, maybe if one of. And I really have time, I can go back to problem.",
      "id": "ep_51_ut_81"
    },
    {
      "end": 1105258,
      "speaker": "Enrico Bertini",
      "start": 1095110,
      "text": "I think we discussed that before, Moritz. I don't remember with whom, but how do we create archives? I think with Manuel Lima. We discussed that. Right. How do you create archives? Right.",
      "id": "ep_51_ut_82"
    },
    {
      "end": 1106282,
      "speaker": "Moritz Stefaner",
      "start": 1105414,
      "text": "It's a huge problem.",
      "id": "ep_51_ut_83"
    },
    {
      "end": 1106990,
      "speaker": "Enrico Bertini",
      "start": 1106346,
      "text": "Yeah.",
      "id": "ep_51_ut_84"
    },
    {
      "end": 1112630,
      "speaker": "Moritz Stefaner",
      "start": 1108330,
      "text": "Maybe we should all screen capture much more of our work.",
      "id": "ep_51_ut_85"
    },
    {
      "end": 1130448,
      "speaker": "Dietmar Offenhuber",
      "start": 1113090,
      "text": "Well, at Arthur Electronica, this was a big issue all the time because, you know, new media art, since, let's say, the mid nineties, has taken many different forms and shapes and. Yeah, this archival aspect is a really crucial one.",
      "id": "ep_51_ut_86"
    },
    {
      "end": 1134996,
      "speaker": "Moritz Stefaner",
      "start": 1130634,
      "text": "Yeah. I mean, the other option is always to do just more projects and even better ones.",
      "id": "ep_51_ut_87"
    },
    {
      "end": 1139560,
      "speaker": "Dietmar Offenhuber",
      "start": 1135068,
      "text": "Yeah, I think that's the better choice because, you know, who cares about old stuff?",
      "id": "ep_51_ut_88"
    },
    {
      "end": 1144548,
      "speaker": "Enrico Bertini",
      "start": 1140900,
      "text": "I don't know. I tend to be a little sentimental about this thing.",
      "id": "ep_51_ut_89"
    },
    {
      "end": 1168144,
      "speaker": "Moritz Stefaner",
      "start": 1144644,
      "text": "No, absolutely. And also, I love to show we feel fine, for instance, but this one's going away. You know, nobody uses blogger anymore. Java is hard to get to run. You know, it's. At the moment, you can see it go away, basically, and in half a year, it's gone. And that's tough. Yeah, yeah. So. But I think we need to solve that at another day. We won't solve that today.",
      "id": "ep_51_ut_90"
    },
    {
      "end": 1171060,
      "speaker": "Enrico Bertini",
      "start": 1168272,
      "text": "Maybe we should invite Jonathan Harris sometime.",
      "id": "ep_51_ut_91"
    },
    {
      "end": 1173312,
      "speaker": "Moritz Stefaner",
      "start": 1171640,
      "text": "Maybe so at least it would be.",
      "id": "ep_51_ut_92"
    },
    {
      "end": 1178060,
      "speaker": "Dietmar Offenhuber",
      "start": 1173336,
      "text": "Audio documented, give him some tasks, audio update and document it. Yeah.",
      "id": "ep_51_ut_93"
    },
    {
      "end": 1194732,
      "speaker": "Moritz Stefaner",
      "start": 1180040,
      "text": "And then you did a lot of great work, actually, more on visualization, like a lot of network visualizations. So the comment flow. And I think you developed a whole network visualization framework for a couple of network related projects, right?",
      "id": "ep_51_ut_94"
    },
    {
      "end": 1228600,
      "speaker": "Dietmar Offenhuber",
      "start": 1194836,
      "text": "Yeah, this was during my time at the media lab. I was also back at ARs electronic. I was interested in networks. And this was around 2004, when network social networking started to become an issue, an interesting issue. And at that time, I worked with basically self described diagram researcher Gehartiya Moser. You should check out his work. He's doing amazing stuff.",
      "id": "ep_51_ut_95"
    },
    {
      "end": 1230880,
      "speaker": "Moritz Stefaner",
      "start": 1229380,
      "text": "He's the master of network.",
      "id": "ep_51_ut_96"
    },
    {
      "end": 1305220,
      "speaker": "Dietmar Offenhuber",
      "start": 1234300,
      "text": "It was from him that I heard the term diagrammatics for the first time. And so he has this huge collection of all kinds of diagrams and networks. And so he always tried, and I think he's still working on that, coming up with all kinds of different taxonomies of representations that performative taxonomies, or all kinds of different ways of categorizing and understanding diagrams. And so he had all these images. And this was around 2005, maybe. So we tried to, I developed a Java program for him to organize those things in three D, and this became a network tool, sema space that a couple of people in the humanities mostly used. But at this point, I'm not developing it actively anymore. But back then, the main interest was just to get as much performance out of the computers that were available at that time as possible.",
      "id": "ep_51_ut_97"
    },
    {
      "end": 1331520,
      "speaker": "Moritz Stefaner",
      "start": 1305960,
      "text": "Yeah, I remember it worked really well. Like was very fluent. It had like auto layout. So the layout was constantly updating when you were doing selections. So technically that was quite, quite a feat. But these things are tough to like. Yeah, once you. It's easy to get a good start, but then to maintain a network visualization library, really, it's tough. I mean, then you really need to get into computer science and have a bigger team probably.",
      "id": "ep_51_ut_98"
    },
    {
      "end": 1340880,
      "speaker": "Dietmar Offenhuber",
      "start": 1332060,
      "text": "But luckily it's not necessary anymore because there are so many great tools at the moment that give fee. So why, why bother?",
      "id": "ep_51_ut_99"
    },
    {
      "end": 1376414,
      "speaker": "Moritz Stefaner",
      "start": 1342100,
      "text": "No, but at the time it was very helpful to have it and also useful. But you're right. I mean, at some point then it's time to move on. And then, well, we briefly had an encounter together in the mapping the archive project. That was fun, like looking at the RS electronica archive, all the submissions to Rs Electronica, working with the metadata there. And then you went to MIT pretty much right after. And I think the first project you were involved in was already a huge success. The trash track project.",
      "id": "ep_51_ut_100"
    },
    {
      "end": 1433410,
      "speaker": "Dietmar Offenhuber",
      "start": 1376542,
      "text": "Yeah. So yeah, Trashtrack was very interesting project. So I didn't come up with the idea. So the project already started before I came to sensible city lab. But I then basically took the lead and over the largest part of the deployment. So basically what we did is we attached 2500 GPS trackers to garbage in order to find out where the garbage goes, which is brilliant. It was a great project and it was actually many difficulties that you wouldn't expect. So how do you do that? How do you attach a GPS tracker to, you know, old banana peel or something like that? Well, okay, the details, so they are very messy details, I have to say.",
      "id": "ep_51_ut_101"
    },
    {
      "end": 1435822,
      "speaker": "Moritz Stefaner",
      "start": 1433790,
      "text": "You need gloves first of all.",
      "id": "ep_51_ut_102"
    },
    {
      "end": 1504010,
      "speaker": "Dietmar Offenhuber",
      "start": 1435926,
      "text": "Yeah, yeah. There was actually, we used epoxy foam that is normally used for insulating bow tiles and filling surfboards. So this was a foam that really encapsulated the GPS tracker and attached it to the object so that you couldn't rip it off anymore. And all of that was necessary because we were concerned that the trackers would get separated from the object. But we also wanted to hide it. So you don't see. But you also had to make sure that, I mean, as you can imagine that the waste stream is not really a hospitable place for sensitive electronic devices. So there had to be a physical protection and water proving. So, and all of that we managed to accomplish with this foam. But at the same time it had to be fast because it was very work intense to prepare those items. So yeah, we developed a whole process to do that.",
      "id": "ep_51_ut_103"
    },
    {
      "end": 1508010,
      "speaker": "Moritz Stefaner",
      "start": 1504310,
      "text": "And there are no precedents for that. So there's no blogs on how to.",
      "id": "ep_51_ut_104"
    },
    {
      "end": 1543340,
      "speaker": "Dietmar Offenhuber",
      "start": 1508470,
      "text": "I mean, there has been a few people who worked with different kinds of tracking mechanisms for single objects as a. I think even Greenpeace did a. They tracked one monitor to Nigeria, but not so that they had to basically always follow the device because there was no, you know, no back channel. I mean, it's trivial to get the GPS location from the object, but how do you get the data back? That's the big question. Yeah, sure.",
      "id": "ep_51_ut_105"
    },
    {
      "end": 1545412,
      "speaker": "Moritz Stefaner",
      "start": 1543500,
      "text": "So how did you do and how did you.",
      "id": "ep_51_ut_106"
    },
    {
      "end": 1566360,
      "speaker": "Dietmar Offenhuber",
      "start": 1545556,
      "text": "So in our case, we used the cell phone network, which of course also doesn't exist on the ocean. And unfortunately it's very spotty in many places where landfills and those kind of trash facilities are. But yeah, I mean, it was actually much better than we expected in the beginning.",
      "id": "ep_51_ut_107"
    },
    {
      "end": 1573560,
      "speaker": "Moritz Stefaner",
      "start": 1566820,
      "text": "So the devices were constantly like pinging a server with their current location and the server would.",
      "id": "ep_51_ut_108"
    },
    {
      "end": 1618232,
      "speaker": "Dietmar Offenhuber",
      "start": 1574020,
      "text": "Well, that was the other problem that we really wanted to have those devices to survive for six months. But if you think about those trackers, they look like very small cell phones. But usually cell phones don't last that long. So with the engineers, we had to figure out a way how they would save as much energy as possible. And basically they would only turn themselves on every 6 hours or so, send one ping, and if they cannot reach a signal, then they basically give up. Yeah, exactly.",
      "id": "ep_51_ut_109"
    },
    {
      "end": 1621080,
      "speaker": "Enrico Bertini",
      "start": 1618336,
      "text": "So how many of them arrived at their destination?",
      "id": "ep_51_ut_110"
    },
    {
      "end": 1628660,
      "speaker": "Dietmar Offenhuber",
      "start": 1621200,
      "text": "Yeah, we were getting good at it because in the end we got 80% success rate. Beginning was lower, but yeah.",
      "id": "ep_51_ut_111"
    },
    {
      "end": 1631530,
      "speaker": "Enrico Bertini",
      "start": 1629190,
      "text": "And how big was one of the sensors?",
      "id": "ep_51_ut_112"
    },
    {
      "end": 1646330,
      "speaker": "Dietmar Offenhuber",
      "start": 1631950,
      "text": "It was maybe like a matchbox, something like that. Okay, so it's not like those James bond type of trackers that are, you know, tiny that you don't see. Still small enough to be. Yes.",
      "id": "ep_51_ut_113"
    },
    {
      "end": 1651582,
      "speaker": "Moritz Stefaner",
      "start": 1647310,
      "text": "Is this something that would be. I mean, this is now how many years ago? Six or seven.",
      "id": "ep_51_ut_114"
    },
    {
      "end": 1691720,
      "speaker": "Dietmar Offenhuber",
      "start": 1651646,
      "text": "Yeah, we started in 2009, but the project. Project took quite a while because we had to wait until all the items have settled that we tracked. And then the data analysis part was quite work intense. And so, yeah, we did a couple of follow ups with informal waste systems and international movement of waste and things like that. So it's still, in a way a challenge to look at infrastructures that way. And I guess there are many opportunities.",
      "id": "ep_51_ut_115"
    },
    {
      "end": 1717886,
      "speaker": "Moritz Stefaner",
      "start": 1692900,
      "text": "Yeah, I love this general idea that we take something a. That we take for granted as, yeah, trash somehow works. Yeah, that's not my problem. But it's also very intransparent and, you know, nobody knows how it works. Probably not even the people running it and just, you know, throw out a couple of pros, gather data and see what you can learn about that. I think that's so valuable. Really?",
      "id": "ep_51_ut_116"
    },
    {
      "end": 1718694,
      "speaker": "Enrico Bertini",
      "start": 1717998,
      "text": "Yeah.",
      "id": "ep_51_ut_117"
    },
    {
      "end": 1728970,
      "speaker": "Moritz Stefaner",
      "start": 1718862,
      "text": "And I'm just thinking, like, if somebody wanted to do something like this today, would you use the same technology or what would your tech approach be if you were to start it today?",
      "id": "ep_51_ut_118"
    },
    {
      "end": 1775276,
      "speaker": "Dietmar Offenhuber",
      "start": 1729590,
      "text": "Well, I mean, I guess you would still pretty much have to rely on active location sensors, on sensors that have a battery and have a radio that sends back the data. And in some countries and in some cities, they are working with passive sensors, with RFID. And there's this smart city idea that all your waste bins and everything is identified by smart tags. And then all the facilities and all the trash trucks have reading devices that would identify all those different tags, and then you get this kind of know, total legibility of your infrastructure.",
      "id": "ep_51_ut_119"
    },
    {
      "end": 1776160,
      "speaker": "Moritz Stefaner",
      "start": 1775428,
      "text": "Yeah.",
      "id": "ep_51_ut_120"
    },
    {
      "end": 1780636,
      "speaker": "Enrico Bertini",
      "start": 1777660,
      "text": "And our RFId is much smaller, right?",
      "id": "ep_51_ut_121"
    },
    {
      "end": 1813330,
      "speaker": "Dietmar Offenhuber",
      "start": 1780748,
      "text": "Yeah, and much cheaper. So, you know, if you really want to build a whole citywide system like that, GPS doesn't make sense, but GPS makes sense if you don't, don't have any leads where those things might go. And also if you want to look at those things in a kind of accountability or forensic perspective, for example, if you want to find out whether, you know, someone is smuggling e waste into out of the country and things like that.",
      "id": "ep_51_ut_122"
    },
    {
      "end": 1829308,
      "speaker": "Moritz Stefaner",
      "start": 1816190,
      "text": "Cool. I think it's a very fascinating project, and I wish there was more in this direction. There's also in Barcelona the citizen sensor toolkit project, which I'm looking into.",
      "id": "ep_51_ut_123"
    },
    {
      "end": 1829932,
      "speaker": "Dietmar Offenhuber",
      "start": 1829444,
      "text": "Absolutely.",
      "id": "ep_51_ut_124"
    },
    {
      "end": 1850700,
      "speaker": "Moritz Stefaner",
      "start": 1829956,
      "text": "And they also have a bee fork, so it's something for beehives and it's kind of cool. And they have, like, a lot of tools around, like DIY tracking. And so if somebody's interested there, they are. A good starting point, I think, as well. And I'm super curious what comes out of this whole scene of DIY tracking, I think.",
      "id": "ep_51_ut_125"
    },
    {
      "end": 1852680,
      "speaker": "Enrico Bertini",
      "start": 1850820,
      "text": "Oh, yeah, I think it's totally cool.",
      "id": "ep_51_ut_126"
    },
    {
      "end": 1992728,
      "speaker": "Moritz Stefaner",
      "start": 1853880,
      "text": "So that's a good time to talk about our sponsor. Click. Imagine an analytics tool so intuitive that anyone in your company could easily create personalized visualizations and dynamic dashboards to find meaningful insights. That's Qlik sense. Qlik sense was launched in July 2014 and pairs Qlik's market proven data indexing engine with the ability to drag and drop visualizations into your dashboard. Above all, Qlik Sense is intuitive. Qlik sense lets you rapidly create visualizations, explore data deeply, reveal connections instantly, and see opportunities from every angle. Qlik Sense's data storytelling functionality is noteworthy as well, making it easy to share analysis with colleagues and collaborate more effectively. And Qlik Sense isn't just limited to the desktop. Access your analytics on the go on a tablet or a smartphone, you can find your insights in real time. And if you want to get started quickly with Qlik sense, you can also use the Senseit extension for Google Chrome, which allows you to drag and drop data and visualize it directly in click. We will link it from the show notes, so try it out today. You can download Qlik Sense at Qlik deries. And don't forget the data stories. And now back to the show. And I mean, then we are right in the main topic of smart cities, right? So this exactly, as you say, is about infrastructure and how we can make this sort of, these super complex networks of activity more transparent. And you've been like working a lot on this topic of smart cities, especially at sensible city level, I guess. So I thought maybe you can describe a bit to us, maybe to our listeners as well, what the general idea of smart cities is. And maybe start with the positive, like the most utopian vision we get presented as well. And then maybe we can also talk a bit about the flip side and what are the challenges for smart city theory at the moment. And maybe not everything is that cool as it sounds in a two minute demo video or so. So how did it all start? What's the current state of smart cities? Can you give us a brief overview for the somebody who has no idea, like me, for instance?",
      "id": "ep_51_ut_127"
    },
    {
      "end": 2114991,
      "speaker": "Dietmar Offenhuber",
      "start": 1992784,
      "text": "No, I think what you just mentioned, the Barcelona Smart Citizen project, is a really good example for civic technologies, where this is this idea that you develop infrastructures from the bottom up to make sense of your environment, and that you have a better understanding of things that matter to you, like safety or air quality and all those kinds of things. But this is maybe one of the more recent phenomena in that space. The idea of the smart city, or let's say the intelligent city, is a very old idea. I found it fascinating that even at the end, let's say, of the 19th century, when wireless communication and telephone came up, people started thinking about how those things would change our cities. And it actually did from very early moment on. If you think about we are here in Brooklyn, or if you think about New York and these early skyscrapers, you needed telephone, you know, I mean, how do you communicate in such a space? So the communication technology, in a way, made it possible to have a physical shape for buildings and then also for cities that wouldn't have been possible otherwise, and also then in the thirties, I think Frank Lloyd Wright in his Broadacre city, he said that, well, you know, because we have cars, we have telephones, and we have automation, cities will disappear so that we don't need this concentration anymore because we can easily beat the physical distance with the car, the kind of communication distance with the telephone. And we can basically scale this up so everyone has access to it, which.",
      "id": "ep_51_ut_128"
    },
    {
      "end": 2116299,
      "speaker": "Enrico Bertini",
      "start": 2115015,
      "text": "Is kind of happening.",
      "id": "ep_51_ut_129"
    },
    {
      "end": 2156408,
      "speaker": "Dietmar Offenhuber",
      "start": 2117079,
      "text": "It is. Well, it's interesting because there are always many different. So the problem with this, that this would be called usually as a techno determinism where you say, okay, this is my technology and it will have this deterministic historical outcome. And in some sense it happens, but there's also another side to it and you have lots of paradoxical effects usually happening. So, for example, we know that CDC didn't, didn't really disappear. I mean, more than half of the population. Exactly.",
      "id": "ep_51_ut_130"
    },
    {
      "end": 2158048,
      "speaker": "Moritz Stefaner",
      "start": 2156544,
      "text": "Yeah. It's a clear trend. Yeah.",
      "id": "ep_51_ut_131"
    },
    {
      "end": 2159600,
      "speaker": "Dietmar Offenhuber",
      "start": 2158104,
      "text": "And well, even in.",
      "id": "ep_51_ut_132"
    },
    {
      "end": 2161120,
      "speaker": "Enrico Bertini",
      "start": 2159640,
      "text": "Maybe it just takes longer.",
      "id": "ep_51_ut_133"
    },
    {
      "end": 2164072,
      "speaker": "Dietmar Offenhuber",
      "start": 2161240,
      "text": "Maybe it takes longer. I mean, who knows, you know, I mean, I was right.",
      "id": "ep_51_ut_134"
    },
    {
      "end": 2165640,
      "speaker": "Enrico Bertini",
      "start": 2164136,
      "text": "It's just that it takes longer.",
      "id": "ep_51_ut_135"
    },
    {
      "end": 2168000,
      "speaker": "Dietmar Offenhuber",
      "start": 2165720,
      "text": "Yeah, that's true. That's true. I mean, who knows?",
      "id": "ep_51_ut_136"
    },
    {
      "end": 2179864,
      "speaker": "Moritz Stefaner",
      "start": 2168040,
      "text": "Yeah, I think it's always a balance of forces and this might be a force repelling people or like making it possible to go somewhere else, but then there's attracting forces that might be stronger and things like that.",
      "id": "ep_51_ut_137"
    },
    {
      "end": 2255240,
      "speaker": "Dietmar Offenhuber",
      "start": 2179952,
      "text": "Right. Yeah. And just you have this paradoxical effect that suddenly the place becomes really valuable, becomes a kind of prestigious element. I mean, you could basically run a company from the middle of some ex urban business park, but you don't want to have your headquartered there necessarily unless you're in a particular. And so you have all those kind of social political forces that basically mess with the technology and then basically you get lots of interesting effects. I mean, for me, in my own, when I talked about how did I arrive at this point when I started working with Futurelab and speculating about future technologies, which was in the nineties, the main thing, but after some time, I got more interested in how people actually use technology at the moment because all those things became in a way, mainstream. And then you get all these interesting social phenomena that all those kind of subcultures and whatsoever, and suddenly the future is not the main interesting thing anymore.",
      "id": "ep_51_ut_138"
    },
    {
      "end": 2283320,
      "speaker": "Moritz Stefaner",
      "start": 2258380,
      "text": "Yeah, it's very interesting. And I mean, currently, who, like, are there many smart cities already? Are many cities like becoming smarter and smarter? And who does this? Is it like, do the administrations like do interesting things with data? Or is it citizens? Is it corporations? What's your current feeling of the landscape there.",
      "id": "ep_51_ut_139"
    },
    {
      "end": 2314142,
      "speaker": "Dietmar Offenhuber",
      "start": 2283360,
      "text": "I think all of them have a stake in that game, but they all know are basically have a different idea of what a smart city is. I mean, it's really interesting because I was just last year I was invited to a conference in Germany about smart cities. And just way during the panel, I realized that they have a completely different understanding and definition of what a smart city is than what I thought.",
      "id": "ep_51_ut_140"
    },
    {
      "end": 2315756,
      "speaker": "Enrico Bertini",
      "start": 2314246,
      "text": "Can you give us an example?",
      "id": "ep_51_ut_141"
    },
    {
      "end": 2369280,
      "speaker": "Dietmar Offenhuber",
      "start": 2315918,
      "text": "Well, what I'm so basically, I always try to keep concepts very narrow and not basically expand them too much. And the way how I remember smart city, Bill Mitchell at the media lab, he had this group, smart cities. And this was, I think around 2000 he started this group. And a couple of years later, IBM more or less adopted this term for smarter planet and smarter cities. And if you remember IBM as a kind of IT technology, since the 1970s and sixties, they've been providing it infrastructure. And so their vision for a smart city was a very infrastructural one. It was all about attaching sensors to existing infrastructure and then optimizing and making everything more efficient.",
      "id": "ep_51_ut_142"
    },
    {
      "end": 2371812,
      "speaker": "Moritz Stefaner",
      "start": 2370340,
      "text": "Like a big machine, right?",
      "id": "ep_51_ut_143"
    },
    {
      "end": 2464836,
      "speaker": "Dietmar Offenhuber",
      "start": 2371916,
      "text": "Yeah, right. There's the city as a machine, and then there's this fascinating control center in Rio de Janeiro that I think many of you have seen. And, you know, you have these huge screens where you have data feeds that come in from all different parts of the city, all different infrastructures of the city. And, yeah, so this is a little bit, this kind of, one could say cybernetic idea of the smart city, where you look at the city as this kind of feedback system, where you have a kind of a machine intelligence that tries to optimize that. And of course, this is something that raises a lot of criticisms as well. First of all, because some of these things have already been tried in the sixties and seventies, and some of them fails in very spectacular ways. So, for example, in New York, there was a big project where in the 1970s, they tried to optimize the fire response system through a cybernetic. Through a cybernetic algorithm. The Rand Corporation worked on that. And as a result, there were many areas that were underserved by those fire trucks, and then there were a lot of fires that basically had a really huge catastrophic impact on the inner cities.",
      "id": "ep_51_ut_144"
    },
    {
      "end": 2466840,
      "speaker": "Moritz Stefaner",
      "start": 2464868,
      "text": "You might have tried it out on something less.",
      "id": "ep_51_ut_145"
    },
    {
      "end": 2543830,
      "speaker": "Dietmar Offenhuber",
      "start": 2467340,
      "text": "Yes, exactly. But the thing is, that's a story that has been told many times, even here, that there are many layers to it, because the reason why this has failed is because the planners did not think about the political and social issues and then, of course, a certain politician has an influence, a specific fire station has to be in a specific place, and not every voice has the same weight. So that's the interesting thing about cities that you cannot escape. And those are the main things, those social and political issues. But I actually read this rand report from the seventies on the fire stations, and actually, the algorithm is interesting. And as far as I know, it's still used today in fire response. So there are many interesting aspects to it. But I think there's quite a consensus that this cybernetic idea of the smart city that basically only focuses on the infrastructure is not really something that we want.",
      "id": "ep_51_ut_146"
    },
    {
      "end": 2548530,
      "speaker": "Enrico Bertini",
      "start": 2545330,
      "text": "So what is your definition of smart city?",
      "id": "ep_51_ut_147"
    },
    {
      "end": 2549226,
      "speaker": "Moritz Stefaner",
      "start": 2548650,
      "text": "What do you.",
      "id": "ep_51_ut_148"
    },
    {
      "end": 2559410,
      "speaker": "Dietmar Offenhuber",
      "start": 2549258,
      "text": "Yeah, I mean, smart city as a definition. I mean, smart city is, in a way, a branded term. It's like big data, smart city, and social software Web 2.0.",
      "id": "ep_51_ut_149"
    },
    {
      "end": 2570730,
      "speaker": "Enrico Bertini",
      "start": 2566990,
      "text": "I'm just curious to pick your brain. What do you think is a smart city?",
      "id": "ep_51_ut_150"
    },
    {
      "end": 2573690,
      "speaker": "Moritz Stefaner",
      "start": 2571790,
      "text": "What would be the positive vision?",
      "id": "ep_51_ut_151"
    },
    {
      "end": 2687532,
      "speaker": "Dietmar Offenhuber",
      "start": 2574710,
      "text": "Yeah, I mean, we've already touched upon this more community integrated aspect of civic technologies, where you look at urban governance not so much as an optimization problem, but more as a communication problem between government and its citizens. So it becomes a kind of co production where citizens play a role in decisions. And of course, participation is also a term that has been misused many times, but in the end, there are many different layers to that as well. So in Boston, there is, for example, in city hall, they have an office for new urban mechanics, how they call themselves. And they are all about making city services accessible through technology. And they are really interested in this idea of engaging the citizen so that they would see infrastructure or the city as a public good, and they are contributing to that. But of course, there's also the opposite, where it's not about this friendly idea of engagement, but where it's really about conflict and accountability. And sometimes, if the city is not responsible or is not responsive, the citizens might just start building their own own tools to, you know, in a more activist mode and start to call attention to an issue that they discover. And there are also many historical examples, especially also in the US, with, you know, issues of pollution and toxic waste that are unfortunately still hidden and buried in many cities.",
      "id": "ep_51_ut_152"
    },
    {
      "end": 2703980,
      "speaker": "Moritz Stefaner",
      "start": 2687606,
      "text": "Here you also had Mike Migurski on one of the shows who built the Oakland crime spotting thing, which also basically took an existing data feed, but then made it more visible, and that fed back into the political discussion. And things are all quite interesting.",
      "id": "ep_51_ut_153"
    },
    {
      "end": 2713432,
      "speaker": "Enrico Bertini",
      "start": 2704480,
      "text": "So what are the most interesting or most common data feeds coming from a city typically, and what can you do with them?",
      "id": "ep_51_ut_154"
    },
    {
      "end": 2807632,
      "speaker": "Dietmar Offenhuber",
      "start": 2713616,
      "text": "So in terms of open data? So, I mean, the basic idea of open data is that you not only give access to data that is generated by the city, but you also give access in a way that you can have it machine readable, that you basically have real time feeds that can automatically be processed in all kinds of apps that can be developed. And there are a couple of, I mean, a lot of people are working with this kind of three one one data sets, which are kind of community incident reports when people complain about things, but which are not necessarily, they're not necessarily emergencies, but it's basically, you know, just suggestions for improvements. And those are, I mean, they are definitely, these reports are definitely interesting datasets because they allow you really to read the city in a very granular way. Transit is a big issue. When urban transit systems finally got around to deliver real time data streams, started developing transit apps to plan your route through the city. And in a way, you could also.",
      "id": "ep_51_ut_155"
    },
    {
      "end": 2811656,
      "speaker": "Moritz Stefaner",
      "start": 2807656,
      "text": "Say taxi rides for New York. You have a full data set of taxi rides.",
      "id": "ep_51_ut_156"
    },
    {
      "end": 2813780,
      "speaker": "Dietmar Offenhuber",
      "start": 2811728,
      "text": "Yeah, that's an amazing data set.",
      "id": "ep_51_ut_157"
    },
    {
      "end": 2817272,
      "speaker": "Moritz Stefaner",
      "start": 2814480,
      "text": "170 million trips.",
      "id": "ep_51_ut_158"
    },
    {
      "end": 2843772,
      "speaker": "Dietmar Offenhuber",
      "start": 2817376,
      "text": "Yeah, exactly, exactly. And even when you go back in history in the nineties, even something like GPS. GPS used to be military technology, but if you think about how many, many current applications depend on GPS as a kind of open, real time dataset that everyone has more or less access to, I mean, it's not strictly speaking a dataset, but I think that the idea is the same.",
      "id": "ep_51_ut_159"
    },
    {
      "end": 2851280,
      "speaker": "Enrico Bertini",
      "start": 2843956,
      "text": "So is there anyone doing something interesting with cameras? Because there are so many cameras spread around every cd?",
      "id": "ep_51_ut_160"
    },
    {
      "end": 2893540,
      "speaker": "Dietmar Offenhuber",
      "start": 2851660,
      "text": "Yeah, I mean, this is an definitely interesting thing. I mean, you definitely always run into the discussion of privacy when you talk about data collection in public space. And it's a very tricky thing because legally, everyone more or less can take a picture in public space because it's public, then if you basically scrape all this information from public space and basically use it in all kinds of, aggregate it in all kinds of different ways, then you definitely have.",
      "id": "ep_51_ut_161"
    },
    {
      "end": 2894836,
      "speaker": "Enrico Bertini",
      "start": 2893700,
      "text": "You can connect the dots.",
      "id": "ep_51_ut_162"
    },
    {
      "end": 2936190,
      "speaker": "Dietmar Offenhuber",
      "start": 2894908,
      "text": "Exactly. You can connect the dots and you have a privacy problem and you also have a governance issue. So I think Chicago has this program where they installed these streetlights that are smart streetlights, and so they, you know, count the pedestrians. They do have all kinds of environmental sensors, they have sound sensors, everything. But they look like a very old fashioned lamp, like from the Paris, 1920 or something like that. So it's very romantic, sentimental object, but that basically records all that stuff. So.",
      "id": "ep_51_ut_163"
    },
    {
      "end": 2939778,
      "speaker": "Moritz Stefaner",
      "start": 2938090,
      "text": "It's almost like an art project.",
      "id": "ep_51_ut_164"
    },
    {
      "end": 3001400,
      "speaker": "Dietmar Offenhuber",
      "start": 2939874,
      "text": "Yeah, exactly. So what I'm interested in is this question of infrastructure legibility. I mean, can we, I mean, it should be possible to make sense or to understand when something is recording something and also having access to the data that those things collect. But then you also have a governance issue because what happens, who decides how long this data gets stored and so on. So all those kind of, for me at the moment, those kind of governance issues, especially when you have all this algorithmic decision making that is taking over many, many different traditional aspects of public life where, how accountable are these algorithms? I mean, who, if, let's say a self driving cardinal has an accident, who is responsible? And those kind of questions.",
      "id": "ep_51_ut_165"
    },
    {
      "end": 3001816,
      "speaker": "Enrico Bertini",
      "start": 3001520,
      "text": "Yeah.",
      "id": "ep_51_ut_166"
    },
    {
      "end": 3018120,
      "speaker": "Moritz Stefaner",
      "start": 3001848,
      "text": "That scales to any size problem. Of course. Yeah, yeah. I think the other huge problem is sort of one of, sort of, if you naively follow just your sensor data, you will automatically focus on the areas where a lot is being measured.",
      "id": "ep_51_ut_167"
    },
    {
      "end": 3018696,
      "speaker": "Dietmar Offenhuber",
      "start": 3018200,
      "text": "Yeah.",
      "id": "ep_51_ut_168"
    },
    {
      "end": 3054390,
      "speaker": "Moritz Stefaner",
      "start": 3018808,
      "text": "So sort of this re, is this self fulfilling prophecy? Sort of, yeah. Or we had, I think, with Kate Crawford, this discussion that they had the sort of program in Boston where you could report bad streets with your smartphone, but then where people report bad streets is where people have smartphones to report them. So you suddenly just optimize the part of the city where you get the most reports. Most people have the technology and time to, you know, and the awareness of that. So exactly how do you deal with this? Like these blind spots that appear and all these. Yeah, I mean, misreadings.",
      "id": "ep_51_ut_169"
    },
    {
      "end": 3072378,
      "speaker": "Dietmar Offenhuber",
      "start": 3054970,
      "text": "I think the question whether this kind of crowdsourced or volunteered information is biased or not doesn't make sense because it's biased by definition. I mean, it's, you know, there's self selection going on and maybe it's more.",
      "id": "ep_51_ut_170"
    },
    {
      "end": 3077634,
      "speaker": "Enrico Bertini",
      "start": 3072394,
      "text": "A matter of awareness. Right. Knowing that you are using this data. Yes, there is a.",
      "id": "ep_51_ut_171"
    },
    {
      "end": 3284042,
      "speaker": "Dietmar Offenhuber",
      "start": 3077762,
      "text": "Absolutely. And, yeah, I mean, that's one of the big, the big challenges, because all those kind of big data sets are, you know, they're big, but they're also unstructured and they have all kinds of distortions. And anyway, if you think about what the term data actually means, I mean, the way, how I would define it, I see. I mean, data points are observations, but observations that are made in a systematic way and that are encoded into symbols. So you have all these different steps, you know, the observation, the encoding and the categorization. You have to think about the symbolic language that is fitting. All those are human decisions that someone has to make at some point. So the question whether data is a raw material or whether it's something that is socially constructed also doesn't make sense because it's clear that it's heavily constructed. And if you work with, let's say, data sets from astronomy where you're hunting for planets, this is not really a problem, because what can go wrong if you're dealing with urban data sets? You're constantly confronted with this question of all those kind of social political issues that are implicated in not only the data collection, but also in the way how data is stored and at any point. And I think so lately, I've been thinking a lot about bias, because there's a lot of discussion about the definition or the nature or the quality of data. But the bias is a concept that we all take for granted. We just say data is biased, but what do we actually mean when we talk about bias? And my answer to that is that when we deal with crowdsourced information, very often the term bias does not really capture everything that is going on, because bias actually means that there is a truth and the bias is a deviation of the truth. But in many different aspects of these datasets, there is no truth. There is no kind of canonical form. It is basically just, lets say you report a broken street to the city, you, you can think about bias in terms of to what extent a certain demographic is represented in the reports, and then you can say, okay, there are people who don't have smartphones and you have less reports from them. But then if you look at the content, there is no true form, how such a report is supposed to take shape. And there are many different mechanisms for reporting. I'm inclined to also think more about not just this bias, but also on the assumptions that go into the design of the technology. And the design basically includes not only, let's say, the interface that is used for capturing, but also the language and the categories and the basically the social protocols. And basically, it's a very broad, it's a very broad thing.",
      "id": "ep_51_ut_172"
    },
    {
      "end": 3318610,
      "speaker": "Enrico Bertini",
      "start": 3284146,
      "text": "So I'm curious, in your experience, to what extent do you think that people who make decisions based on these data, coming from smart cities, are aware of these problems? Because if I understand correctly what you're saying, you're kind of like saying the solution is not in creating better data or unbiased data, because this might actually be even impossible, but more making these assumptions explicitly. So people who make decisions on top of this data, do you think they are aware of these distortions or biases or whatever you want to call it?",
      "id": "ep_51_ut_173"
    },
    {
      "end": 3394972,
      "speaker": "Dietmar Offenhuber",
      "start": 3318730,
      "text": "I mean, there's a cynical answer to this. Could be that from an economic standpoint it doesn't really matter, because let's say if you use predictive analytics systems to make decisions and you are wrong, four times out of five, it might not matter if the one time you're right. Really, it's a very pragmatic. And that's a real problem. That's why all those kind of smart city companies are interested in correlation and not in causality, because the causality doesn't really. Is not really that actionable. They're not really concerned that they're always right, but they're concerned that in the cases when they are right, they have enough profit or have enough advantage to make it worthwhile to do the whole thing. And this idea of the false positive, is the false positive a good or a bad thing? Either from an epistemological standpoint, it's a bad thing. But maybe from an economic standpoint, maybe it's not, I don't know, an example of what.",
      "id": "ep_51_ut_174"
    },
    {
      "end": 3399720,
      "speaker": "Enrico Bertini",
      "start": 3395036,
      "text": "Oh, sorry. Moritz, can you give us an example of what these companies are trying to predict?",
      "id": "ep_51_ut_175"
    },
    {
      "end": 3483128,
      "speaker": "Dietmar Offenhuber",
      "start": 3400500,
      "text": "Well, I mean, we know, I mean, I'm not an expert in the kind of social media marketing. I mean, there are whole industries that are dedicated to that, so I'm not going to talk about that. But let's say with this predictive analytics in policing, that's actually a big deal, because, you know, police forces are also, there are budget cuts and they cannot be everywhere. So they are using all kinds of spatial statistics methods to figure out where most likely a crime would occur. And again, it's not important for them that every single time they go to a specific place that there is actually a crime that they prevent, but they are just interested in. To prevent in one of the, I don't know, one of 100 times when actually something happens that they are there. But this, of course, creates also the whole social externalities. And in New York, it's a huge issue with the. With all those kind of police tactics of stop and frisk. So I think those are the governance and social issues that are at stake.",
      "id": "ep_51_ut_176"
    },
    {
      "end": 3505138,
      "speaker": "Moritz Stefaner",
      "start": 3483184,
      "text": "Yeah. That comes back to this question of what it means to optimize. Yeah, exactly. Often you optimize for a certain countable metric, and we had that in the US quite a bit, that certain police departments had to deliver so and so many stops in a given time frame. Frame. But I don't think that necessarily optimized the quality of life for the citizens.",
      "id": "ep_51_ut_177"
    },
    {
      "end": 3506986,
      "speaker": "Dietmar Offenhuber",
      "start": 3505194,
      "text": "Exactly. Yeah.",
      "id": "ep_51_ut_178"
    },
    {
      "end": 3513706,
      "speaker": "Moritz Stefaner",
      "start": 3507018,
      "text": "I mean, so they optimized a simple countable metric, but at the same time de optimized actual quality of life.",
      "id": "ep_51_ut_179"
    },
    {
      "end": 3514666,
      "speaker": "Dietmar Offenhuber",
      "start": 3513898,
      "text": "Absolutely.",
      "id": "ep_51_ut_180"
    },
    {
      "end": 3517642,
      "speaker": "Moritz Stefaner",
      "start": 3514738,
      "text": "Then it becomes problematic, I guess.",
      "id": "ep_51_ut_181"
    },
    {
      "end": 3537322,
      "speaker": "Dietmar Offenhuber",
      "start": 3517786,
      "text": "Yeah, no, I think the whole idea of what does it mean to optimize some, this is also something that has changed as a city. I mean, this cybernetic idea of finding the most efficient way to run a city is not really.",
      "id": "ep_51_ut_182"
    },
    {
      "end": 3538426,
      "speaker": "Enrico Bertini",
      "start": 3537386,
      "text": "I don't want my city to be.",
      "id": "ep_51_ut_183"
    },
    {
      "end": 3541106,
      "speaker": "Dietmar Offenhuber",
      "start": 3538458,
      "text": "Yeah, exactly. Exactly. I mean, it doesn't make sense.",
      "id": "ep_51_ut_184"
    },
    {
      "end": 3542138,
      "speaker": "Enrico Bertini",
      "start": 3541218,
      "text": "I like this man.",
      "id": "ep_51_ut_185"
    },
    {
      "end": 3542938,
      "speaker": "Dietmar Offenhuber",
      "start": 3542194,
      "text": "Exactly.",
      "id": "ep_51_ut_186"
    },
    {
      "end": 3544714,
      "speaker": "Enrico Bertini",
      "start": 3543074,
      "text": "Otherwise I wouldn't live in New York.",
      "id": "ep_51_ut_187"
    },
    {
      "end": 3572190,
      "speaker": "Dietmar Offenhuber",
      "start": 3544802,
      "text": "Exactly, exactly, exactly. Yeah. And the cities are getting more chaotic. I mean, everything gets, gets more informal in a certain way. I think people are also not so concerned about this idea of efficiency anymore because, you know, or if you want to have a resilient city, you actually want a city that is not efficient because the efficient city breaks down and then it's gone.",
      "id": "ep_51_ut_188"
    },
    {
      "end": 3593602,
      "speaker": "Enrico Bertini",
      "start": 3574930,
      "text": "Even though I think that we don't even realize, mean, normal citizens don't realize and I don't realize how much much is going on in a city every single day. Right. There are lots of people who are, whose job is running this city, right. Every single day. So that's another interesting, I mean, you're absolutely right.",
      "id": "ep_51_ut_189"
    },
    {
      "end": 3605516,
      "speaker": "Moritz Stefaner",
      "start": 3593626,
      "text": "It's a great opportunity for data analysis and visualization because I think I also did a few city visualization projects and it's always so fascinating because, because it feels like you're looking at an organism.",
      "id": "ep_51_ut_190"
    },
    {
      "end": 3605796,
      "speaker": "Dietmar Offenhuber",
      "start": 3605588,
      "text": "Right.",
      "id": "ep_51_ut_191"
    },
    {
      "end": 3614964,
      "speaker": "Moritz Stefaner",
      "start": 3605828,
      "text": "So it's like there is this higher order thing going on, you know, that we can suddenly observe and I think that's just so it's cool to work on.",
      "id": "ep_51_ut_192"
    },
    {
      "end": 3618140,
      "speaker": "Dietmar Offenhuber",
      "start": 3615052,
      "text": "No, absolutely. And just also, what do you think.",
      "id": "ep_51_ut_193"
    },
    {
      "end": 3637480,
      "speaker": "Moritz Stefaner",
      "start": 3618300,
      "text": "Looking ten years ahead, what will be the biggest impact this whole city sensing and making sense of cities and sorting out cities and all these things, what's the biggest impact this will have? Like how will it change how we live? What's your wild guest? Or what would you put your money on today?",
      "id": "ep_51_ut_194"
    },
    {
      "end": 3766530,
      "speaker": "Dietmar Offenhuber",
      "start": 3638380,
      "text": "Yeah, I don't know. I mean, if you look at the global scale of how cities change, we see that the biggest cities are no longer in the US and in Europe. I think if we, there are these kind of un predictions of 2030 and from the 25 biggest cities in this prediction, I think only two or three in Europe and the US and all the other ones are in Southeast Asia and in many places that we used to call developing countries. But that description doesn't make sense anymore because they're actually very dynamic places. But if we look at one, one aspect that I think is very interesting and will be very important in the future, it's the question of informality. If you think of many cities in the global south, you have a huge informal economy that basically runs waste collection and street vendors and all kinds of things. And in the 1970s, we thought that those are just a kind of temporary phenomenon. They will go away. And after everything is modernized, there will be no informality anymore. But now we know that this is not going to happen. It's exactly the opposite. And I think that it's not the biggest point, but I think technology also has a role in that because in a way, technology makes the formal more informal because you can communicate more easily. But on the other hand, it also makes the informal more formal because suddenly even a casual telephone conversation leaves all kinds of traces that, in a way, become a formal document. And this dynamic between formality and informality, maybe this is a little bit too philosophical, but I think this will have many implications.",
      "id": "ep_51_ut_195"
    },
    {
      "end": 3788934,
      "speaker": "Moritz Stefaner",
      "start": 3767510,
      "text": "Yeah. And higher opportunities for self organization and flexibility. I mean, Uber, I mean, it's a horrible company, but the general trend is interesting that suddenly everybody can be a taxi driver, basically because they have a smartphone. And if you think that through Airbnb and so on, suddenly you have these self run places, maybe at some point.",
      "id": "ep_51_ut_196"
    },
    {
      "end": 3810198,
      "speaker": "Dietmar Offenhuber",
      "start": 3789022,
      "text": "Yeah. And Uber is an interesting example because, I mean, I also. Yeah, I mean, I share your concerns about it, but it's interesting the way, how it makes the whole process legible again. So also in terms of visualization, you call a cab, you see where the cab is, you can follow it, you get in.",
      "id": "ep_51_ut_197"
    },
    {
      "end": 3810870,
      "speaker": "Moritz Stefaner",
      "start": 3810254,
      "text": "Brilliant.",
      "id": "ep_51_ut_198"
    },
    {
      "end": 3847718,
      "speaker": "Dietmar Offenhuber",
      "start": 3810990,
      "text": "Yeah. And even after you arrived at your destination, you see exactly where you went and have this connection with the driver. You can rate them. And so you have a completely mediated experience that doesn't just start when you enter the car and ends when you leave it, but it basically is a bigger part of a bigger thing. And that is scary in some ways. You know, there was this anecdote. What was this? The rites of glory. Do you remember this story?",
      "id": "ep_51_ut_199"
    },
    {
      "end": 3848730,
      "speaker": "Enrico Bertini",
      "start": 3847814,
      "text": "No. I.",
      "id": "ep_51_ut_200"
    },
    {
      "end": 3873242,
      "speaker": "Dietmar Offenhuber",
      "start": 3850870,
      "text": "Started to publicize those cases where someone would take an uber to a place that is not their own home on Saturday night and come late at night and come back home in the morning, implying, of course, there was something going on. And, you know, I guess many people were not amused about that, so.",
      "id": "ep_51_ut_201"
    },
    {
      "end": 3894750,
      "speaker": "Moritz Stefaner",
      "start": 3873426,
      "text": "Yeah. And then you're suddenly in all this mess of privacy and then it suddenly goes all wrong. Right. It's. Yeah, that's, that's so interesting. Yeah. But I think that's interesting that they say it's actually a chance to move out of Kafkaesque, like authorities running the place. Yeah. To much more self organized I mean, people are super quick.",
      "id": "ep_51_ut_202"
    },
    {
      "end": 3910606,
      "speaker": "Dietmar Offenhuber",
      "start": 3895250,
      "text": "Exactly. I mean, people are super quick at developing all kinds of tactics against this. So we are still trying to wrap our head around what is predictive analytics and what are the implications. But people already know exactly how to game it and how to take advantage.",
      "id": "ep_51_ut_203"
    },
    {
      "end": 3922150,
      "speaker": "Moritz Stefaner",
      "start": 3910638,
      "text": "Of it, draw shapes in the city with GPS tracks when running. And so if you're looking for the hackable city, is that right?",
      "id": "ep_51_ut_204"
    },
    {
      "end": 3925890,
      "speaker": "Dietmar Offenhuber",
      "start": 3922190,
      "text": "Exactly. Well, that's one vision. Of course. Yeah.",
      "id": "ep_51_ut_205"
    },
    {
      "end": 3934012,
      "speaker": "Moritz Stefaner",
      "start": 3927300,
      "text": "Cool. It's fantastic. Enrico, do you have more questions? I think we're coming to an end soon.",
      "id": "ep_51_ut_206"
    },
    {
      "end": 3935564,
      "speaker": "Enrico Bertini",
      "start": 3934076,
      "text": "We are coming to an end soon.",
      "id": "ep_51_ut_207"
    },
    {
      "end": 3938920,
      "speaker": "Moritz Stefaner",
      "start": 3935692,
      "text": "We could, as usual, go on for five more hours.",
      "id": "ep_51_ut_208"
    },
    {
      "end": 3973504,
      "speaker": "Enrico Bertini",
      "start": 3939860,
      "text": "No, I'm just curious. So you've been mentioning the idea that most of the big cities are in South Asia and considering other regions of the world. I'm wondering. Wondering if the whole idea of smart cities is happening in other regions. Like, for instance, in Africa, where I think Africa had a very interesting development in terms of technology. Where, for instance, I don't know, mobile technology was adopted much, much quicker than computers. Right?",
      "id": "ep_51_ut_209"
    },
    {
      "end": 3974648,
      "speaker": "Dietmar Offenhuber",
      "start": 3973672,
      "text": "Absolutely.",
      "id": "ep_51_ut_210"
    },
    {
      "end": 3980336,
      "speaker": "Enrico Bertini",
      "start": 3974824,
      "text": "So I'm wondering how these impacts the whole concept of smart cities.",
      "id": "ep_51_ut_211"
    },
    {
      "end": 4084390,
      "speaker": "Dietmar Offenhuber",
      "start": 3980488,
      "text": "Yeah, I mean, I think this is. Exactly. And I also think that something like bitcoin, you know, I mean, also has a kind of strange reputation, but I think it's actually a very. It's a technology that will have a big impact on, and especially on the, you know, developing world, where bitcoin suddenly becomes a way to send back money across the globe very easily without fees and without this kind of. So, yeah, I mean, I, I would also count those places and I've been working in Brazil with this kind of waste picker cooperatives who are actually pretty sophisticated in the way how they operate their businesses. And so they create this impeccable material, recyclable material that is very valuable. And they all have cell phones, of course, some of them cannot read or write, but they know how to operate a smartphone and it's not for them. This is not a contradiction because it's also, if you look at this question of the digital divide, I mean, there's certainly a digital divide in terms of education, but if you look at the actual price of technology and what you can get out of it, I would say that living and apartment and rents and those kind of things are much more expensive than a mobile phone. And so the mobile phone becomes a very important economic facilitator for many of these cities and the kind of populations that work in the informal sector.",
      "id": "ep_51_ut_212"
    },
    {
      "end": 4088250,
      "speaker": "Enrico Bertini",
      "start": 4085130,
      "text": "So do you know of any existing projects in these areas.",
      "id": "ep_51_ut_213"
    },
    {
      "end": 4150314,
      "speaker": "Dietmar Offenhuber",
      "start": 4088410,
      "text": "Yeah. So I just. Colleagues came back from Jakarta in Indonesia, and it's apparently one of the places where most cell phones are and smartphones the highest smartphone density. And, you know, people, everyone has more or less their own business and using the phone to do certain things, whether it's organizing parking spaces or things like that. Then there's the whole space of disaster response, where digital tools for coordination. Our colleagues are working on a flooding, a crowdsourced flooding response system in Jakarta. Crowdsourcing is difficult, of course, because you need a crowd, but that you don't always have. There's also something that's taken for granted, but, yeah, good, good stuff.",
      "id": "ep_51_ut_214"
    },
    {
      "end": 4151850,
      "speaker": "Enrico Bertini",
      "start": 4150402,
      "text": "Good stuff. Very interesting.",
      "id": "ep_51_ut_215"
    },
    {
      "end": 4152538,
      "speaker": "Dietmar Offenhuber",
      "start": 4151890,
      "text": "All right.",
      "id": "ep_51_ut_216"
    },
    {
      "end": 4154650,
      "speaker": "Moritz Stefaner",
      "start": 4152674,
      "text": "Good having you on. Super fascinating.",
      "id": "ep_51_ut_217"
    },
    {
      "end": 4155930,
      "speaker": "Dietmar Offenhuber",
      "start": 4154730,
      "text": "Thanks for having me.",
      "id": "ep_51_ut_218"
    },
    {
      "end": 4157870,
      "speaker": "Moritz Stefaner",
      "start": 4156090,
      "text": "Yeah, thanks so much.",
      "id": "ep_51_ut_219"
    },
    {
      "end": 4188849,
      "speaker": "Enrico Bertini",
      "start": 4163860,
      "text": "Data stories is brought to you by Qlik, who allows you to explore the relationships within your data that lead to meaningful insights. Let your instincts lead the way to create personalized visualizations and dynamic dashboards with Qlik sense, which you can download for free at Qlik Datastories. That's Qlik de data stories.",
      "id": "ep_51_ut_220"
    }
  ],
  "confidence": 0.920529663873929,
  "audio_duration": 4216,
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_status_code": null,
  "webhook_auth": false,
  "webhook_auth_header_name": null,
  "speed_boost": false,
  "auto_highlights_result": null,
  "auto_highlights": false,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_audio_quality": null,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "content_safety": false,
  "iab_categories": true,
  "content_safety_labels": {
    "status": "unavailable",
    "results": [],
    "summary": {}
  },
  "language_detection": false,
  "language_detection_threshold": null,
  "language_confidence": null,
  "custom_spelling": null,
  "throttled": false,
  "auto_chapters": true,
  "summarization": false,
  "summary_type": null,
  "summary_model": null,
  "custom_topics": false,
  "topics": [],
  "speech_threshold": null,
  "speech_model": "best",
  "chapters": [
    {
      "summary": "Data stories is brought to you by Qlik, who allows you to explore the hidden relationships within your data that lead to meaningful insights. Let your instincts lead the way to create personalized visualizations and dynamic dashboards with Qlik sense.",
      "gist": "Data Stories",
      "headline": "Qlik allows you to explore hidden relationships within your data that lead to meaningful insights",
      "start": 1520,
      "end": 63020,
      "id": "ep_51_ch_0"
    },
    {
      "summary": "Next lecture is going to be on visual encoding, which is kind of like the soul of heart and soul of visualization. This year, for the first time, I would like to create some smart exercises. If you have any suggestions, I'm happy.",
      "gist": "How are things for the class this semester",
      "headline": "How are things for you? Still busy probably with this semester",
      "start": 63060,
      "end": 166516,
      "id": "ep_51_ch_1"
    },
    {
      "summary": "Good conference on digital culture. Track on haunted machines investigating relation of magic and technology. Broadway installation finally launched on the web. Can we go visiting at the public library?",
      "gist": "Haunted Machines: New York Public Library",
      "headline": "Two quick updates for me. First, we finally launched our Broadway installation on the web",
      "start": 166588,
      "end": 383222,
      "id": "ep_51_ch_2"
    },
    {
      "summary": "Our guest today is Dietmar Offenhube. He's also really into cities, among many other things, but also cities. And this is where he first met Lev Manovic. So you see how everything's connected. It's all a big conspiracy, actually.",
      "gist": "Interviews with Lev Manovic",
      "headline": "Dietmar Offenhube is really into cities and information",
      "start": 383326,
      "end": 441094,
      "id": "ep_51_ch_3"
    },
    {
      "summary": "Diet Maufenhofer is currently on faculty at Northeastern University in Boston. He's heading a new MFA program for information design and visualization. Also has a second life as a, as an urban planner.",
      "gist": "Dieter Maufenhofer on Information Design and Visualization",
      "headline": "Diet Maufenhofer is heading a new MFA program for visualization",
      "start": 441222,
      "end": 772136,
      "id": "ep_51_ch_4"
    },
    {
      "summary": "Wegzeit was actually my architecture thesis in 1999. I was interested in the notion of relative space. This was before there was really an audience for this type of visualization. Still a theme we're all still working on, I guess.",
      "gist": "In the Elevator With Ben and Casey",
      "headline": "So one project I found really, really interesting is Wegzeit",
      "start": 772208,
      "end": 893964,
      "id": "ep_51_ch_5"
    },
    {
      "summary": "New media art has taken many different forms and shapes since the mid nineties. How do we create archives? It's a huge problem. Maybe we should all screen capture much more of our work.",
      "gist": "How do you reconstruct the city?",
      "headline": "Once you replace absolute units of space with relative units, the whole geometry falls apart",
      "start": 894052,
      "end": 1178060,
      "id": "ep_51_ch_6"
    },
    {
      "summary": "You developed a whole network visualization framework for a couple of network related projects. The first project you were involved in was already a huge success. The Trashtrack project attached 2500 GPS trackers to garbage. To maintain a network visualization library, really, it's tough.",
      "gist": "Tutorials in Network Vatigation",
      "headline": "You developed a whole network visualization framework for several network related projects",
      "start": 1180040,
      "end": 1688440,
      "id": "ep_51_ch_7"
    },
    {
      "summary": "In some countries and in some cities, they are working with passive sensors, with RFID. And there's this smart city idea that all your waste bins and everything is identified by smart tags. There's also in Barcelona the citizen sensor toolkit project. And they have, like, a lot of tools around, like DIY tracking.",
      "gist": "How to Track a Trash bin",
      "headline": "There's this smart city idea that all your waste bins are identified by smart tags",
      "start": 1689060,
      "end": 1852680,
      "id": "ep_51_ch_8"
    },
    {
      "summary": "Qlik sense was launched in July 2014 and pairs Qlik's market proven data indexing engine with the ability to drag and drop visualizations into your dashboard. Access your analytics on the go on a tablet or a smartphone, you can find your insights in real time.",
      "gist": "Qlik Sense",
      "headline": "Qlik Sense lets you rapidly create visualizations and explore data deeply",
      "start": 1853880,
      "end": 1919208,
      "id": "ep_51_ch_9"
    },
    {
      "summary": "The idea of the smart city, or let's say the intelligent city, is a very old idea. But there's also another side to it and you have lots of paradoxical effects usually happening. What are the challenges for smart city theory at the moment?",
      "gist": "What is the Smart City?",
      "headline": "You've been working a lot on smart cities, especially at sensible city level",
      "start": 1919384,
      "end": 2259696,
      "id": "ep_51_ch_10"
    },
    {
      "summary": "David Wheeler: Are many cities like becoming smarter and smarter? And who does this? He says many have a different idea of what a smart city is. Wheeler: This cybernetic idea of the smart city that focuses on the infrastructure is not really something that we want.",
      "gist": "Is the Smart City a Real Thing?",
      "headline": "There are many different ideas of what a smart city is",
      "start": 2259828,
      "end": 2543830,
      "id": "ep_51_ch_11"
    },
    {
      "summary": "Smart city is, in a way, a branded term. It's like big data, smart city, and social software Web 2.0. What do you think is a smart city? What would be the positive vision?",
      "gist": "So what is your definition of Smart City?",
      "headline": "What do you think is a smart city? What would be the positive vision",
      "start": 2545330,
      "end": 2703980,
      "id": "ep_51_ch_12"
    },
    {
      "summary": "The basic idea of open data is that you give access to data generated by the city. You also give access in a way that you can have it machine readable. Real time feeds can automatically be processed in all kinds of apps that can be developed.",
      "gist": "What is open data in the City of London?",
      "headline": "Open data gives access to real time feeds that can be processed in apps",
      "start": 2704480,
      "end": 2843772,
      "id": "ep_51_ch_13"
    },
    {
      "summary": "You can connect the dots and you have a privacy problem and you also have a governance issue. What I'm interested in is this question of infrastructure legibility. How accountable are these algorithms? And those kind of questions. That scales to any size problem.",
      "gist": "The Future of Surveillance in Public Spaces",
      "headline": "You run into the discussion of privacy when you talk about data collection in public space",
      "start": 2843956,
      "end": 3161750,
      "id": "ep_51_ch_14"
    },
    {
      "summary": "Moritz: In many different aspects of these datasets, there is no truth. I'm inclined to also think more about not just this bias, but also on the assumptions that go into the design of the technology. Do you think people who make decisions on top of this data are aware of these distortions?",
      "gist": "Predicting crime with crowdsourced data",
      "headline": "When we deal with crowdsourced information, bias does not really capture everything",
      "start": 3162850,
      "end": 3483520,
      "id": "ep_51_ch_15"
    },
    {
      "summary": "The cities are getting more chaotic. Everything gets, gets more informal in a certain way. Technology also has a role in that. Looking ten years ahead, what will be the biggest impact this whole city sensing and making sense of cities?",
      "gist": "What is the future of the city?",
      "headline": "Looking ten years ahead, what will be the biggest impact this whole city sensing",
      "start": 3483600,
      "end": 3924790,
      "id": "ep_51_ch_16"
    },
    {
      "summary": "Of course. We could, as usual, go on for five more hours. I think we're coming to an end soon. Enrico, do you have more questions?",
      "gist": "A Taste of the Oscars",
      "headline": "Enrico: I think we're coming to an end soon",
      "start": 3924830,
      "end": 3938920,
      "id": "ep_51_ch_17"
    },
    {
      "summary": "Most of the big cities are in South Asia and considering other regions of the world. Wondering if the whole idea of smart cities is happening in other regions. Mobile phone becomes a very important economic facilitator for many of these cities.",
      "gist": "Is the whole idea of smart cities feasible in other regions?",
      "headline": "I'm wondering if the whole idea of smart cities is happening in other regions",
      "start": 3939860,
      "end": 4151850,
      "id": "ep_51_ch_18"
    },
    {
      "summary": "Data stories is brought to you by Qlik, who allows you to explore the relationships within your data. Let your instincts lead the way to create personalized visualizations and dynamic dashboards with Qlik sense.",
      "gist": "Data Stories",
      "headline": "Qlik allows you to explore relationships within your data that lead to meaningful insights",
      "start": 4151890,
      "end": 4188849,
      "id": "ep_51_ch_19"
    }
  ],
  "disfluencies": false,
  "entity_detection": false,
  "sentiment_analysis": false,
  "sentiment_analysis_results": null,
  "entities": null,
  "speakers_expected": null,
  "summary": null,
  "custom_topics_results": null,
  "is_deleted": null,
  "episode_num": "51",
  "episode_metadata": {
    "speakers": [
      "Moritz Stefaner",
      "Enrico Bertini",
      "Dietmar Offenhuber"
    ],
    "WPid": "260",
    "url": "https://datastori.es/podlove/file/674/s/feed/c/mp3/data-stories-51-smart-cities-w-dietmar-offenhuber.mp3",
    "episode_title": "Smart Cities w/ Dietmar Offenhuber"
  }
}