{
  "id": "30228fb0-edfb-4f7f-9d7a-fe2ca5dcc2cf",
  "language_model": "assemblyai_default",
  "acoustic_model": "assemblyai_default",
  "language_code": "en_us",
  "status": "completed",
  "audio_url": "https://datastori.es/podlove/file/327/s/feed/c/mp3/Datastories-32.mp3",
  "utterances": [
    {
      "end": 20494,
      "speaker": "Moritz Stefaner",
      "start": 10920,
      "text": "Hi, folks, this is data stories number 32. I'm actually in New York, so I'm sitting for once in the same room with Enrico in the recording. Hi, Enrico.",
      "id": "ep_32_ut_0"
    },
    {
      "end": 21326,
      "speaker": "Enrico Bertini",
      "start": 20582,
      "text": "Hi.",
      "id": "ep_32_ut_1"
    },
    {
      "end": 22278,
      "speaker": "Moritz Stefaner",
      "start": 21518,
      "text": "How are you doing?",
      "id": "ep_32_ut_2"
    },
    {
      "end": 26286,
      "speaker": "Enrico Bertini",
      "start": 22374,
      "text": "It's great. I'm excited. We are in the same room. Feels weird.",
      "id": "ep_32_ut_3"
    },
    {
      "end": 26878,
      "speaker": "Moritz Stefaner",
      "start": 26358,
      "text": "Happy to be here.",
      "id": "ep_32_ut_4"
    },
    {
      "end": 28210,
      "speaker": "Enrico Bertini",
      "start": 26894,
      "text": "I can slap your face.",
      "id": "ep_32_ut_5"
    },
    {
      "end": 35070,
      "speaker": "Moritz Stefaner",
      "start": 30930,
      "text": "Kick my legs when I say something stupid. Yeah, happens all the time.",
      "id": "ep_32_ut_6"
    },
    {
      "end": 47550,
      "speaker": "Enrico Bertini",
      "start": 37250,
      "text": "It's great to be in New York together. We are having good weather and we are in a nice setting right now. Right. We are hosted by accurate in New York.",
      "id": "ep_32_ut_7"
    },
    {
      "end": 49570,
      "speaker": "Moritz Stefaner",
      "start": 47930,
      "text": "And it's nice studio.",
      "id": "ep_32_ut_8"
    },
    {
      "end": 55830,
      "speaker": "Enrico Bertini",
      "start": 49650,
      "text": "Super nice studio in downtown. And cozy place. A little hot here.",
      "id": "ep_32_ut_9"
    },
    {
      "end": 57352,
      "speaker": "Moritz Stefaner",
      "start": 56480,
      "text": "That's true.",
      "id": "ep_32_ut_10"
    },
    {
      "end": 60464,
      "speaker": "Enrico Bertini",
      "start": 57496,
      "text": "And yeah, it's fantastic. Yeah.",
      "id": "ep_32_ut_11"
    },
    {
      "end": 68920,
      "speaker": "Moritz Stefaner",
      "start": 60592,
      "text": "But before we come to the main part, let's talk about listener feedback. So last time we asked our listeners to send in a bit more comments and, yeah, we actually get some.",
      "id": "ep_32_ut_12"
    },
    {
      "end": 71064,
      "speaker": "Enrico Bertini",
      "start": 69040,
      "text": "So that's cool if you ask for.",
      "id": "ep_32_ut_13"
    },
    {
      "end": 87964,
      "speaker": "Moritz Stefaner",
      "start": 71152,
      "text": "Yeah, that's what you get. So there's a few really nice suggestions. We had one on Twitter coming from Andrew. He said we should talk about accessibility for information, graphics. I think that's a topic everybody is like, dodges a bit, you know, not really working on. So that's cool.",
      "id": "ep_32_ut_14"
    },
    {
      "end": 109076,
      "speaker": "Enrico Bertini",
      "start": 88132,
      "text": "I think it's a great topic. I mean, it's a little counterintuitive, doing visualization for blind people or visually impaired people. But, man, I mean, if we want to have more vis around the world and communicating more through this channel, then we have to take care of these people who are visually impaired or even blind. Yeah, I mean, otherwise they would be excluded.",
      "id": "ep_32_ut_15"
    },
    {
      "end": 111400,
      "speaker": "Moritz Stefaner",
      "start": 109108,
      "text": "There's also color blindness or all kinds of.",
      "id": "ep_32_ut_16"
    },
    {
      "end": 127476,
      "speaker": "Enrico Bertini",
      "start": 112420,
      "text": "Yeah, sure. So you can go from the more from the subtler things up to people who cannot even see. How do they, how do they experience the charts and visualizations that we produce? That's a big problem.",
      "id": "ep_32_ut_17"
    },
    {
      "end": 133908,
      "speaker": "Moritz Stefaner",
      "start": 127588,
      "text": "We should work on that. And I think the other suggestions, we had a lot of suggestions, actually talking about tools. So some people talk about.",
      "id": "ep_32_ut_18"
    },
    {
      "end": 136668,
      "speaker": "Enrico Bertini",
      "start": 133924,
      "text": "You always want tools to talk about tools.",
      "id": "ep_32_ut_19"
    },
    {
      "end": 168596,
      "speaker": "Moritz Stefaner",
      "start": 136764,
      "text": "So either programming tools like Raphael, so Sia Bonga Africa said on Facebook, you'd love to hear more about alternatives. Like, for instance, 200 and D3, something like this. Or if you know about Matplotlib, or coming from Python and Sven. Eric Schellhorn, actually a friend of mine, also commented on Facebook that he's really excited about Tableau with the r integration and would like to talk about big data analysis tools, things like that, who is nothing.",
      "id": "ep_32_ut_20"
    },
    {
      "end": 193340,
      "speaker": "Enrico Bertini",
      "start": 168618,
      "text": "Sure. Yeah. I think that when you guys, when you suggest us to discuss more about tools, I think you should come up with some names and then it's easier. Who do you want us to invite? Yeah, we need people. We are happy to invite people, but we need new ideas. I think we had some few techies in the past, so if you guys want more techies, just let us know. You want us to interview?",
      "id": "ep_32_ut_21"
    },
    {
      "end": 194980,
      "speaker": "Moritz Stefaner",
      "start": 193720,
      "text": "Yeah, I agree.",
      "id": "ep_32_ut_22"
    },
    {
      "end": 195776,
      "speaker": "Enrico Bertini",
      "start": 195320,
      "text": "Right?",
      "id": "ep_32_ut_23"
    },
    {
      "end": 196500,
      "speaker": "Moritz Stefaner",
      "start": 195848,
      "text": "Yes.",
      "id": "ep_32_ut_24"
    },
    {
      "end": 200704,
      "speaker": "Enrico Bertini",
      "start": 198240,
      "text": "What else? More comments? No.",
      "id": "ep_32_ut_25"
    },
    {
      "end": 210488,
      "speaker": "Moritz Stefaner",
      "start": 200832,
      "text": "Kim made a comment on the blog. She said it's super important that there's also tools, like non standard tools and not the super techie tools, but more the creative ones.",
      "id": "ep_32_ut_26"
    },
    {
      "end": 211120,
      "speaker": "Giorgia Lupi",
      "start": 210544,
      "text": "I agree.",
      "id": "ep_32_ut_27"
    },
    {
      "end": 216096,
      "speaker": "Enrico Bertini",
      "start": 211240,
      "text": "Oh, she said I have to respectfully disagree with Enrico. Thanks, Kim.",
      "id": "ep_32_ut_28"
    },
    {
      "end": 219420,
      "speaker": "Moritz Stefaner",
      "start": 216288,
      "text": "Thanks Kim. Somebody helping me. That's nice.",
      "id": "ep_32_ut_29"
    },
    {
      "end": 239910,
      "speaker": "Enrico Bertini",
      "start": 221510,
      "text": "Yeah. You know. No, but I fully understand your point. But at the same time I think that we are too much. There's, I think we have to find the right balance. There are so many tools around it. I think that, I mean, people who enter the field for the first time, they are totally blown off. It's really hard to find the right path. Yeah.",
      "id": "ep_32_ut_30"
    },
    {
      "end": 247790,
      "speaker": "Moritz Stefaner",
      "start": 240070,
      "text": "The other thing is tools in the podcast is also always tricky. But yeah, some of you need to sit at the same machine and, you know, try something out sometimes.",
      "id": "ep_32_ut_31"
    },
    {
      "end": 248366,
      "speaker": "Enrico Bertini",
      "start": 247830,
      "text": "Yeah.",
      "id": "ep_32_ut_32"
    },
    {
      "end": 253210,
      "speaker": "Moritz Stefaner",
      "start": 248518,
      "text": "At least the people behind the tools or experts at using the tools. I'm super happy to invite.",
      "id": "ep_32_ut_33"
    },
    {
      "end": 257176,
      "speaker": "Enrico Bertini",
      "start": 253640,
      "text": "Absolutely. Sure. Should we start with our special guest?",
      "id": "ep_32_ut_34"
    },
    {
      "end": 258660,
      "speaker": "Moritz Stefaner",
      "start": 257248,
      "text": "Absolutely can do it.",
      "id": "ep_32_ut_35"
    },
    {
      "end": 262900,
      "speaker": "Enrico Bertini",
      "start": 259040,
      "text": "Guess what we are at accurate. So who could it be?",
      "id": "ep_32_ut_36"
    },
    {
      "end": 267192,
      "speaker": "Moritz Stefaner",
      "start": 264400,
      "text": "So today we have Georgia Lupi from accurate.",
      "id": "ep_32_ut_37"
    },
    {
      "end": 269088,
      "speaker": "Enrico Bertini",
      "start": 267296,
      "text": "Hi Georgia. Welcome.",
      "id": "ep_32_ut_38"
    },
    {
      "end": 271820,
      "speaker": "Giorgia Lupi",
      "start": 269264,
      "text": "Thank you for having me. And thank you for coming to the office.",
      "id": "ep_32_ut_39"
    },
    {
      "end": 276144,
      "speaker": "Moritz Stefaner",
      "start": 272360,
      "text": "Yeah, it's so beautiful. One of the nicest offices and also it's beautiful.",
      "id": "ep_32_ut_40"
    },
    {
      "end": 279000,
      "speaker": "Enrico Bertini",
      "start": 276192,
      "text": "Yes, beautiful here. Can you come some days to work here?",
      "id": "ep_32_ut_41"
    },
    {
      "end": 282968,
      "speaker": "Giorgia Lupi",
      "start": 279040,
      "text": "Of course. You're more than welcome to bring some pastries or views.",
      "id": "ep_32_ut_42"
    },
    {
      "end": 289520,
      "speaker": "Enrico Bertini",
      "start": 283024,
      "text": "Yeah, it's not too far from where you live. Yeah. So we're gonna talk Italian today.",
      "id": "ep_32_ut_43"
    },
    {
      "end": 291680,
      "speaker": "Moritz Stefaner",
      "start": 290100,
      "text": "Sisi, Sisi.",
      "id": "ep_32_ut_44"
    },
    {
      "end": 303480,
      "speaker": "Giorgia Lupi",
      "start": 300860,
      "text": "So I'm officially your first Italian guest.",
      "id": "ep_32_ut_45"
    },
    {
      "end": 304748,
      "speaker": "Enrico Bertini",
      "start": 303980,
      "text": "I guess so.",
      "id": "ep_32_ut_46"
    },
    {
      "end": 305400,
      "speaker": "Giorgia Lupi",
      "start": 304804,
      "text": "B.",
      "id": "ep_32_ut_47"
    },
    {
      "end": 311520,
      "speaker": "Moritz Stefaner",
      "start": 306700,
      "text": "We always want to have Paolo, but somehow it never makes time. Yeah, but we shouldn't.",
      "id": "ep_32_ut_48"
    },
    {
      "end": 333460,
      "speaker": "Enrico Bertini",
      "start": 312720,
      "text": "Yeah, he's too busy. Paolo, you are too busy. Try to find some time for us. Okay. Giorgia. Luby. So Giorgia, why don't you introduce yourself? This is what we always ask for our guests. Who is Georgia Luby? What are you doing? Okay, so what are you doing in New York?",
      "id": "ep_32_ut_49"
    },
    {
      "end": 404470,
      "speaker": "Giorgia Lupi",
      "start": 333920,
      "text": "Having fun? No, actually I am co founder and design director at Accurate, which is an Italian information design company. And now we have an office in New York and we are very happy about that. I'm also finishing my PhD at density design lab at Politecnico di Milano. And yes, everybody knows about density, but yeah, I have to be honest, the specific field of data visualization was a bit foreign to me until a couple of years ago. In fact, I studied architecture at the university. I've never really been working as an architect, but you know, during all the architectural studies, I've always been interested in the aspect concerning the representation of information, even if it comes to the architectural drawings and something. And I think that I just always try to push all of my architectural and urban projects within the university toward working with information and mapping systems. Also, my master degree thesis was definitely an information mapping project. And then it came naturally to me that then I started working in the interaction design field. In basically in 2011, I both co founded the company and started the PhD. This is a little bit of short story.",
      "id": "ep_32_ut_50"
    },
    {
      "end": 408890,
      "speaker": "Moritz Stefaner",
      "start": 407290,
      "text": "That were two busy years, right?",
      "id": "ep_32_ut_51"
    },
    {
      "end": 412550,
      "speaker": "Giorgia Lupi",
      "start": 408930,
      "text": "Yeah, really, really busy. But I mean, I'm happy.",
      "id": "ep_32_ut_52"
    },
    {
      "end": 417234,
      "speaker": "Moritz Stefaner",
      "start": 412850,
      "text": "And you have some music background as well, aren't you dancing or like posing or something?",
      "id": "ep_32_ut_53"
    },
    {
      "end": 444130,
      "speaker": "Giorgia Lupi",
      "start": 417322,
      "text": "I know I've been doing so many different kind of things when I was younger, I've been dancing contemporary dance for, say, something like 20 years. So until I was little, little. And also I've been playing the piano and composing music. So I think that when I was 18, I still was wondering whether to go to the architectural university or whether to try to be a dancer or a musician. I think my parents kind of convinced me that maybe dancing and music not so good.",
      "id": "ep_32_ut_54"
    },
    {
      "end": 448174,
      "speaker": "Moritz Stefaner",
      "start": 445270,
      "text": "What do they say now? Do they understand now what you're doing?",
      "id": "ep_32_ut_55"
    },
    {
      "end": 471940,
      "speaker": "Giorgia Lupi",
      "start": 448262,
      "text": "Yeah, I think that just lately they understand what I do. At the very beginning, when I started to say, that's okay, I degree the university architecture, but I want to work with information and, you know, representing information, they couldn't really get it. And also when we started the company, they were like, we trust you guys. We don't really understand what you're going to do, but that's okay. But now I think they're becoming pretty much experts.",
      "id": "ep_32_ut_56"
    },
    {
      "end": 475316,
      "speaker": "Enrico Bertini",
      "start": 472100,
      "text": "Yeah, that's everyone's problem, right? How do you introduce yourself?",
      "id": "ep_32_ut_57"
    },
    {
      "end": 477880,
      "speaker": "Moritz Stefaner",
      "start": 475388,
      "text": "Maybe we should do a recording with our parents before.",
      "id": "ep_32_ut_58"
    },
    {
      "end": 481760,
      "speaker": "Enrico Bertini",
      "start": 479540,
      "text": "That would be fun. That would be super fun.",
      "id": "ep_32_ut_59"
    },
    {
      "end": 484892,
      "speaker": "Moritz Stefaner",
      "start": 482380,
      "text": "So, Accurat, how many people are you now altogether?",
      "id": "ep_32_ut_60"
    },
    {
      "end": 524729,
      "speaker": "Giorgia Lupi",
      "start": 485036,
      "text": "So before I forget, everybody, I have. No cheers. No, actually we have three partners. And so the original partners, just to give you a little bit of background of who we are, Simone, the partner that now is in Milan, he's a sociologist as a background, Gabriel, he's a designer, but funnily, he's now managing the company. So he's now into design part, and I am an architect. And then we have seven full time designers. Some of them specialize in data solidization, in some of them more on the information design, interaction design side, and I like to name them here. So we have Alex, Marco, Michele, Federica, Stefania, Francesco and Pietro.",
      "id": "ep_32_ut_61"
    },
    {
      "end": 528009,
      "speaker": "Enrico Bertini",
      "start": 524849,
      "text": "Lots of Italian, you feel at home.",
      "id": "ep_32_ut_62"
    },
    {
      "end": 563266,
      "speaker": "Giorgia Lupi",
      "start": 528129,
      "text": "And only one of them is in New York is Michele, that is like next room. And we have a CTO, which is. Marco is a very skilled developer and also all around problem solver. And we have another full time developer whose name is Francesco, and he was a postdocular researcher in the field of big data analysis. We also have another data analyst with a particular background. His name is Glaucon. He studied archaeology in his first place, and then he specialized in statistics, and then he had a PhD in information science and a postdoc in the digital humanities field.",
      "id": "ep_32_ut_63"
    },
    {
      "end": 564470,
      "speaker": "Enrico Bertini",
      "start": 563458,
      "text": "A blame?",
      "id": "ep_32_ut_64"
    },
    {
      "end": 596926,
      "speaker": "Giorgia Lupi",
      "start": 565770,
      "text": "Yeah, totally. And then our very, very first employee, who was with us from the very beginning, Davide, who manages an essential part of the company, he is an architect. He's an architect as a background, as I am. He right now works mainly on the data research part, but he also is like in charge of lots of operation in the company. Plus we have some regular collaborators for both the design and development side. Valerio, Federico, Ricardo, Daniela, Mauro, another Marco, and tutor Mazzo, actually.",
      "id": "ep_32_ut_65"
    },
    {
      "end": 597494,
      "speaker": "Moritz Stefaner",
      "start": 597038,
      "text": "Wow.",
      "id": "ep_32_ut_66"
    },
    {
      "end": 617536,
      "speaker": "Giorgia Lupi",
      "start": 597582,
      "text": "And then we have an intern guys, right now, the stuff. So it's like 15 people, the full time taffy, 15. And I mean, I'm still impressed in two years. I mean, I know that we are a small company, but to me, 15 is a very big number.",
      "id": "ep_32_ut_67"
    },
    {
      "end": 618168,
      "speaker": "Moritz Stefaner",
      "start": 617608,
      "text": "Big number.",
      "id": "ep_32_ut_68"
    },
    {
      "end": 621180,
      "speaker": "Enrico Bertini",
      "start": 618224,
      "text": "Sure, it's a big responsibility.",
      "id": "ep_32_ut_69"
    },
    {
      "end": 631400,
      "speaker": "Moritz Stefaner",
      "start": 621640,
      "text": "And how did it start? So you were three founders and did you, like, bootstrap it? More or less that you had a few small commissions and they became bigger. Did you have funding or investment?",
      "id": "ep_32_ut_70"
    },
    {
      "end": 685242,
      "speaker": "Giorgia Lupi",
      "start": 631520,
      "text": "No, we didn't have any funding at all, and we still don't have any investment. Basically, Simone and I, we've been working together for the last, I mean, for two years before starting a company in this company called Interaction Design Lab. And two of us, we were really focused on information visualization, and for us, it just like, came natural that we wanted to start something ours, you know, somehow the company, and also Gabriel has a company before, and it just quit the company because after five years, you were just like trying to do something else, and we just tried to do something together in the. The company actually started because we had a first offer for a job for an Italian bank to work for their online magazine to, you know, communicate their financial ideas through graphics and videos. And actually, we had to build a company because they had to sign the first contract. This is how everything started, actually.",
      "id": "ep_32_ut_71"
    },
    {
      "end": 686082,
      "speaker": "Enrico Bertini",
      "start": 685386,
      "text": "Okay.",
      "id": "ep_32_ut_72"
    },
    {
      "end": 686538,
      "speaker": "Giorgia Lupi",
      "start": 686186,
      "text": "Yeah.",
      "id": "ep_32_ut_73"
    },
    {
      "end": 689790,
      "speaker": "Moritz Stefaner",
      "start": 686594,
      "text": "And, you know, so it had to happen. You didn't have a choice.",
      "id": "ep_32_ut_74"
    },
    {
      "end": 693826,
      "speaker": "Giorgia Lupi",
      "start": 692210,
      "text": "You're very happy about that. Yeah.",
      "id": "ep_32_ut_75"
    },
    {
      "end": 694482,
      "speaker": "Enrico Bertini",
      "start": 693858,
      "text": "Nice.",
      "id": "ep_32_ut_76"
    },
    {
      "end": 727996,
      "speaker": "Giorgia Lupi",
      "start": 694666,
      "text": "But I think that really, we focused on data visualization a little bit later. At the very beginning, we were just like, more working with, I would say infographic is not really, really working on quantitative data analysis and representation. And we really started working on that with the opportunity, with Corriere della Sera, which is the main Italian newspaper, that density design published on that before, and then we kind of succeeded. And this was really in 2012, the very first moment that we realized that that's okay. Data visualization is, how can we define?",
      "id": "ep_32_ut_77"
    },
    {
      "end": 740320,
      "speaker": "Enrico Bertini",
      "start": 728068,
      "text": "So I'm curious to hear, how did you discover this then? I mean, was there a time where at some point you thought, oh, my God, there is there, is this out there? Or is it just happen?",
      "id": "ep_32_ut_78"
    },
    {
      "end": 775256,
      "speaker": "Giorgia Lupi",
      "start": 741100,
      "text": "Well, I think it's always another opportunity. So we started with this more qualitative data representation, which is really like, I would call infographic, even if I know that the definitions and the difference is kind of like blurry. So I don't know. But then, because other kind of clients ask us to analyze their data just because they saw that we could represent information visually, we started, you know, figuring out that we needed data analysts and then we needed a developer, and then we needed to have more designers. And so, I don't know, I think that things came naturally to us.",
      "id": "ep_32_ut_79"
    },
    {
      "end": 775856,
      "speaker": "Enrico Bertini",
      "start": 775368,
      "text": "Sure.",
      "id": "ep_32_ut_80"
    },
    {
      "end": 795486,
      "speaker": "Giorgia Lupi",
      "start": 775968,
      "text": "And I think that another introduction has to be that you have to know that in Italy, the market and I, and also the scene around universalization is not that big as is maybe worldwide lately, with density, design and all of this kind of experimentation that Lalitura and Francesco Franchi did, I think that Italian.",
      "id": "ep_32_ut_81"
    },
    {
      "end": 796302,
      "speaker": "Moritz Stefaner",
      "start": 795558,
      "text": "It's growing, too.",
      "id": "ep_32_ut_82"
    },
    {
      "end": 807494,
      "speaker": "Giorgia Lupi",
      "start": 796366,
      "text": "Yeah, it's growing too. But at the very beginning, we really had a hard time explaining what we wanted to do, what we, I mean, what the potential of this field was. So I don't know if I answered your question.",
      "id": "ep_32_ut_83"
    },
    {
      "end": 812450,
      "speaker": "Enrico Bertini",
      "start": 807582,
      "text": "Sure you did. Absolutely. And then you moved to New York. How did you.",
      "id": "ep_32_ut_84"
    },
    {
      "end": 818754,
      "speaker": "Moritz Stefaner",
      "start": 814450,
      "text": "Within the two years of, you know, craziness. Yeah.",
      "id": "ep_32_ut_85"
    },
    {
      "end": 858850,
      "speaker": "Giorgia Lupi",
      "start": 818842,
      "text": "So something very personal. I think that as my twenties came to an end, I realized that I had to try to live abroad. I never did it, but I mean, I really, really wanted, and I was in New York in the first place for my PhD, spending six months of visiting, researching at Parsons, and I fell in love with the city day number two. And there was something in me saying, that's okay, I have to try to live here. And then Gabriel, my other partner, is also my partner in life, came along, and we just tried, without any kind of marketing strategies to see if it was possible for us to find a market here. And it happened. This is the short story.",
      "id": "ep_32_ut_86"
    },
    {
      "end": 896144,
      "speaker": "Enrico Bertini",
      "start": 860550,
      "text": "I have to confess. So I met Georgia and Gabriele when they were in New York before coming back to Italy. I met them, and then they were kind of like, oh, we would like to go back to New York. Maybe sometime we would like to open a company. And honestly, in the back of my mind, I was kind of like, here we go. Another. Another wishful thinking, kind of. I would never expect them to come back and do it for real. And then when they came back, I was kind of like, oh, my God, they did it. And having success, I mean, that was really great.",
      "id": "ep_32_ut_87"
    },
    {
      "end": 897780,
      "speaker": "Giorgia Lupi",
      "start": 896272,
      "text": "I take it as a positive.",
      "id": "ep_32_ut_88"
    },
    {
      "end": 903364,
      "speaker": "Enrico Bertini",
      "start": 899000,
      "text": "Yeah, absolutely. I'm sorry.",
      "id": "ep_32_ut_89"
    },
    {
      "end": 925804,
      "speaker": "Giorgia Lupi",
      "start": 903552,
      "text": "Yeah, I know. I think that in New York is also very easy to find people that come here with a three month, you know, touristic visa, and then it's very hard to get a working visa, and so they have to go back. So, yeah, I think it's very common and likely to find people that stay here desperately want to stay and stay longer, but they finally couldn't make it. So. Yeah, I understand your point.",
      "id": "ep_32_ut_90"
    },
    {
      "end": 926560,
      "speaker": "Enrico Bertini",
      "start": 925892,
      "text": "Yeah.",
      "id": "ep_32_ut_91"
    },
    {
      "end": 939850,
      "speaker": "Moritz Stefaner",
      "start": 927300,
      "text": "We actually, we had a question from Twitter from Scott, Scott Murray. And he asked, I found it interesting if there are any aesthetic or visual design style differences between Milan and New York or Europe.",
      "id": "ep_32_ut_92"
    },
    {
      "end": 942846,
      "speaker": "Enrico Bertini",
      "start": 940670,
      "text": "I think Milan is a long history in design.",
      "id": "ep_32_ut_93"
    },
    {
      "end": 943294,
      "speaker": "Giorgia Lupi",
      "start": 942918,
      "text": "Sure.",
      "id": "ep_32_ut_94"
    },
    {
      "end": 944050,
      "speaker": "Moritz Stefaner",
      "start": 943382,
      "text": "Yeah.",
      "id": "ep_32_ut_95"
    },
    {
      "end": 1000420,
      "speaker": "Giorgia Lupi",
      "start": 945150,
      "text": "Yeah. I found this question interesting as well. I don't really think there is a kind of specific geographical difference. I don't really think there is a difference. But then in recognizing you will help me later. I think it depends on the need for a specific output. And I also think there has been a coincidence on what Italian digitalization designer have been known for. So I think that a lot of designers teams such as density design lab Francesco Franchi, are mostly recognized for the work that they've been doing. And we've been doing for newspapers and magazines that somehow share a set of visual constraints that, like, you know, this kind of yellow and pinkish background or the serif font or, I mean, it set a visual style for itself in a way. But again, I don't think that there is really a difference. I would love to ask Scott why he has this question. So how is he eventual differences? Please, Scott, comment on that.",
      "id": "ep_32_ut_96"
    },
    {
      "end": 1013680,
      "speaker": "Moritz Stefaner",
      "start": 1002000,
      "text": "But it could be that maybe the density style is something that has, to me, it also has a European flavor. And so maybe that's sort of for the animal, but I'm not sure.",
      "id": "ep_32_ut_97"
    },
    {
      "end": 1029628,
      "speaker": "Giorgia Lupi",
      "start": 1013720,
      "text": "No, but I think. I don't know. In my opinion, it's just my idea. It really also really depends on the opportunities that have on the kind of work that you are asked to do. So really, we've been working a lot with newspaper that for themselves, they set a kind of visual style. I don't know.",
      "id": "ep_32_ut_98"
    },
    {
      "end": 1041236,
      "speaker": "Moritz Stefaner",
      "start": 1029684,
      "text": "And also, as we know, the whole world, like, is in context now, you know, especially in these small fields, like, everybody's aware of everybody else's work anyways. And so I don't see the big regional differences either.",
      "id": "ep_32_ut_99"
    },
    {
      "end": 1043360,
      "speaker": "Giorgia Lupi",
      "start": 1041348,
      "text": "What do you think, Enrico, about Italian?",
      "id": "ep_32_ut_100"
    },
    {
      "end": 1049940,
      "speaker": "Enrico Bertini",
      "start": 1044700,
      "text": "I'm not sure. Honestly. I don't know. I don't see. I see a German style out there.",
      "id": "ep_32_ut_101"
    },
    {
      "end": 1050470,
      "speaker": "Moritz Stefaner",
      "start": 1050100,
      "text": "I.",
      "id": "ep_32_ut_102"
    },
    {
      "end": 1081210,
      "speaker": "Enrico Bertini",
      "start": 1050540,
      "text": "It's, it's obviously precise and stylish in a, in a, in a neat, very super neat way. Italian style. I don't know. I'm not sure. I don't see too many differences. Yeah. I'm wondering if, in general, stuff coming from Europe is more designy than stuff coming from the US. I'm not sure. I'm just guessing. I don't know.",
      "id": "ep_32_ut_103"
    },
    {
      "end": 1095514,
      "speaker": "Giorgia Lupi",
      "start": 1081290,
      "text": "I know. Some comments that we had, I don't know, from some American clients or American people we've been talking to is that our data visualization design seemed tailored, you know, in a way kind of customized and very different all the time.",
      "id": "ep_32_ut_104"
    },
    {
      "end": 1096250,
      "speaker": "Moritz Stefaner",
      "start": 1095682,
      "text": "Right.",
      "id": "ep_32_ut_105"
    },
    {
      "end": 1099410,
      "speaker": "Giorgia Lupi",
      "start": 1096370,
      "text": "I like this idea of tailoring data visualizations.",
      "id": "ep_32_ut_106"
    },
    {
      "end": 1132566,
      "speaker": "Enrico Bertini",
      "start": 1099570,
      "text": "Yeah, sure. Absolutely. So why don't we talk about. I think it's the first time we have a person from, from a studio, from a design studio. Right. Doing visualization. We normally have freelancers or techies or whatever professors. We have all sorts of people, but I think we never really talked about how it is to do visualization in a design studio, in a team. So why don't you tell us something about that? How does it work? I mean.",
      "id": "ep_32_ut_107"
    },
    {
      "end": 1133414,
      "speaker": "Giorgia Lupi",
      "start": 1132758,
      "text": "Yeah.",
      "id": "ep_32_ut_108"
    },
    {
      "end": 1146998,
      "speaker": "Enrico Bertini",
      "start": 1133542,
      "text": "Must be hard coordinating. Coordinating all these people and. Yeah, how does it work? Do you have a predefined workflow or it just happens or. I don't know.",
      "id": "ep_32_ut_109"
    },
    {
      "end": 1221644,
      "speaker": "Giorgia Lupi",
      "start": 1147134,
      "text": "Yeah. So this is a hard question because we are also, every time, trying to, you know, shifting things on the fly while we understand what is the project, what the project needs, how long it's gonna take, we don't really have a specific model to set up. The teams we know that we have some lead designers, and the lead designers are always the people that have the contacts with the clients because we don't really want to put somebody like accountant people in between. And so the lead designer, it depends on how big the project is. If the project is small, it can also be that the designer work on the project for itself. If the project is bigger, the designer could be helped. Yeah. Could use the help of other designer or of developers if the project needs interactivity. And we always have me and Simone, who are, you know, kind of like the most senior, just because we are older guys in the company working in a kind of transversal way in design part, which is my part, and in the content part, which is more Simone part. But, you know, it's. I think it was hard for me to start learning how to delegate to other designers.",
      "id": "ep_32_ut_110"
    },
    {
      "end": 1224172,
      "speaker": "Enrico Bertini",
      "start": 1221772,
      "text": "It takes a while when you work in team.",
      "id": "ep_32_ut_111"
    },
    {
      "end": 1225028,
      "speaker": "Giorgia Lupi",
      "start": 1224276,
      "text": "Yeah.",
      "id": "ep_32_ut_112"
    },
    {
      "end": 1227804,
      "speaker": "Enrico Bertini",
      "start": 1225204,
      "text": "You know, Moritz, do you ever delegate your work?",
      "id": "ep_32_ut_113"
    },
    {
      "end": 1228852,
      "speaker": "Moritz Stefaner",
      "start": 1227892,
      "text": "Yeah, sure.",
      "id": "ep_32_ut_114"
    },
    {
      "end": 1230644,
      "speaker": "Enrico Bertini",
      "start": 1228956,
      "text": "How does it work?",
      "id": "ep_32_ut_115"
    },
    {
      "end": 1245260,
      "speaker": "Moritz Stefaner",
      "start": 1230652,
      "text": "It depends. You always have to figure out, like, which part you can delegate. Probably. That's exactly the problem. And many of the decisions you make sort of happen somewhere while you play with the data or develop ideas. And so.",
      "id": "ep_32_ut_116"
    },
    {
      "end": 1276830,
      "speaker": "Giorgia Lupi",
      "start": 1247120,
      "text": "But I, right now, I feel that it's really a value for us, the fact that we have built this company, and I'm super happy about that, and also something that I wasn't really sure if I had, if I would have enjoyed. So right now, I'm very happy that we started to create job opportunities for people also in Italy, young designers that are happy right now working in, they say, amazing projects, and so. And they're learning, and we are learning from them because I think that we are learning every day from younger designers.",
      "id": "ep_32_ut_117"
    },
    {
      "end": 1280826,
      "speaker": "Enrico Bertini",
      "start": 1277250,
      "text": "So you have designers from Italy coming to New York for some time?",
      "id": "ep_32_ut_118"
    },
    {
      "end": 1290522,
      "speaker": "Giorgia Lupi",
      "start": 1280938,
      "text": "Actually, yes, we try to do that. It depends. Of course, it's hard because of the visas, but as long as we can do everything legally, we can do it.",
      "id": "ep_32_ut_119"
    },
    {
      "end": 1291186,
      "speaker": "Moritz Stefaner",
      "start": 1290586,
      "text": "Yeah.",
      "id": "ep_32_ut_120"
    },
    {
      "end": 1297562,
      "speaker": "Enrico Bertini",
      "start": 1291338,
      "text": "So if you're a great designer living in Italy and wanting to spend some time in New York, you know who.",
      "id": "ep_32_ut_121"
    },
    {
      "end": 1325760,
      "speaker": "Giorgia Lupi",
      "start": 1297626,
      "text": "To contact, you know, how else can I elaborate on the company? I think it's nice because you don't have typical days. You just have, you just, like, pass from designing and, you know, more organizing and also trying to find clients and then revising the design and doing, you know, meetings with people within the company. I like it, and I like the atmosphere in the Milan office. I think this is the only thing that I miss about Italy.",
      "id": "ep_32_ut_122"
    },
    {
      "end": 1329414,
      "speaker": "Enrico Bertini",
      "start": 1327420,
      "text": "Everyone misses Italy.",
      "id": "ep_32_ut_123"
    },
    {
      "end": 1331670,
      "speaker": "Giorgia Lupi",
      "start": 1329612,
      "text": "I just miss this kind of thing.",
      "id": "ep_32_ut_124"
    },
    {
      "end": 1339986,
      "speaker": "Enrico Bertini",
      "start": 1332210,
      "text": "How do you split work from here to Milan? Are you handling different projects or not really.",
      "id": "ep_32_ut_125"
    },
    {
      "end": 1385748,
      "speaker": "Giorgia Lupi",
      "start": 1340098,
      "text": "Not really. I think that we are mainly, I mean, we are just like three of us here in New York, and there are some small projects that we can handle right here. But basically we are communicating a lot with Italy and we would, like, wake up very early every morning to have Skype eco with them. And we also learned to work remotely, which, yeah, I mean, yeah, it's very fine as long as you really are precise with the timings and yeah, you set the workflow. But we are still working really, really very close to the Milan office. I don't know. We don't really. I have to be honest, we don't really have strategy. We plan things when we have projects, and as long as one project comes, we figure out how to do it. Maybe we seem more structured than we are. No.",
      "id": "ep_32_ut_126"
    },
    {
      "end": 1400772,
      "speaker": "Moritz Stefaner",
      "start": 1385884,
      "text": "So what do you think? How many projects do you have running in parallel? I know you're also working on a big European project, for instance, a research project. Probably some other projects are more short term. So what is the typical mix of.",
      "id": "ep_32_ut_127"
    },
    {
      "end": 1438648,
      "speaker": "Giorgia Lupi",
      "start": 1400916,
      "text": "Well, I think that we have every time something like 15 projects in the air in a way, but I would say less than ten, something like seven, eight really running at high speed. And also we, as an average, we also have something like a couple of two more research oriented, which like, lie in the background, more slow piece, and so, but I'd say not more than really eight to ten projects ongoing at the same time. And we really try to set this kind of, you know, threshold. Otherwise we would just, like, go crazy and split everybody into human projects.",
      "id": "ep_32_ut_128"
    },
    {
      "end": 1442856,
      "speaker": "Enrico Bertini",
      "start": 1438744,
      "text": "So you still have time to work on personal projects if you want to.",
      "id": "ep_32_ut_129"
    },
    {
      "end": 1453720,
      "speaker": "Giorgia Lupi",
      "start": 1442968,
      "text": "What do you really mean with personal projects? Yeah, we try to do that, and I think that at least a couple of these kind of projects per year, we want to do that.",
      "id": "ep_32_ut_130"
    },
    {
      "end": 1455364,
      "speaker": "Enrico Bertini",
      "start": 1454700,
      "text": "Cool.",
      "id": "ep_32_ut_131"
    },
    {
      "end": 1456240,
      "speaker": "Giorgia Lupi",
      "start": 1455492,
      "text": "Yeah.",
      "id": "ep_32_ut_132"
    },
    {
      "end": 1457852,
      "speaker": "Enrico Bertini",
      "start": 1457540,
      "text": "Yeah.",
      "id": "ep_32_ut_133"
    },
    {
      "end": 1465160,
      "speaker": "Moritz Stefaner",
      "start": 1457876,
      "text": "It's sort of important just to try out new ideas, because in client settings, you're always in a rush and it's, you have external factors.",
      "id": "ep_32_ut_134"
    },
    {
      "end": 1490750,
      "speaker": "Enrico Bertini",
      "start": 1467620,
      "text": "So what is your part in the process? I know, as a matter of fact, that you do a lot of drawing. I think we really wanted to know more about your own process. How does it work? I mean, the kind of visuals that you guys produce, I think they have a pretty unique kind of style, and I'm really curious to hear how this works.",
      "id": "ep_32_ut_135"
    },
    {
      "end": 1555096,
      "speaker": "Giorgia Lupi",
      "start": 1490910,
      "text": "Yeah, I don't know why, but your question also made me think about what do I love in the design? What do I really like in the design process? And I would just, like, start by saying that I really love the beginning part and the end. Like, I'm very excited to come up with the best ideas and solution, visually speaking. But at the same time, it's really satisfying to, you know, wrap up a project and see it come to life. But I really think that I like the beginning, like, the anticipation of the project in doing research to find material. And this is with all of the drawing starts, you know, like, I really love to come up with visual ideas in the sketch phase. So I say that, you know, my design process is really, really very much based on sketching out ideas and drawing and trying to be inspired from different kind of fields and not only exist in desusion and trying to translate these things that I naturally like, like abstract paintings or architectural drawings or, you know, musical notations, landscape to design clues for the designs that we are about to do.",
      "id": "ep_32_ut_136"
    },
    {
      "end": 1571092,
      "speaker": "Enrico Bertini",
      "start": 1555258,
      "text": "So do you start from, I mean, the idea can come from anywhere. Does it start from the data, from a question, from a visual design that you have in mind, regardless, the data, how does it work? Is it all of that?",
      "id": "ep_32_ut_137"
    },
    {
      "end": 1610604,
      "speaker": "Giorgia Lupi",
      "start": 1571236,
      "text": "Is it. I think it's all of that, and it really depends. I think that sometimes the design of the data start from the data that we have, and so, you know, a topic that we want to explore or a data set that we found. And so, of course, all of the ideas come from the analyzing of the data set and then coming up with visual models to show them. Other times, it's just like, why don't we visualize this like that? So we might, you know, even didn't have the data at hand. We suppose that we can find the data, but we just have a visual idea to say, why don't we visualize this kind of thing like that? Just to give you an example?",
      "id": "ep_32_ut_138"
    },
    {
      "end": 1611156,
      "speaker": "Enrico Bertini",
      "start": 1610732,
      "text": "Yeah.",
      "id": "ep_32_ut_139"
    },
    {
      "end": 1612524,
      "speaker": "Giorgia Lupi",
      "start": 1611228,
      "text": "It didn't happen to you.",
      "id": "ep_32_ut_140"
    },
    {
      "end": 1625800,
      "speaker": "Enrico Bertini",
      "start": 1612652,
      "text": "Well, no, it cannot happen to me. It's such a strange idea for me doing visualization without the data. And that's the reason why I'm really interested to understand how this works. And.",
      "id": "ep_32_ut_141"
    },
    {
      "end": 1629156,
      "speaker": "Moritz Stefaner",
      "start": 1627980,
      "text": "Do you have an example?",
      "id": "ep_32_ut_142"
    },
    {
      "end": 1630788,
      "speaker": "Enrico Bertini",
      "start": 1629268,
      "text": "Yeah, give us an example.",
      "id": "ep_32_ut_143"
    },
    {
      "end": 1641698,
      "speaker": "Giorgia Lupi",
      "start": 1630884,
      "text": "Then I can also link you to the visualization because it's kind of hard to talk about visualization without seeing that. But we did one for Puerto de la Sierra. It's a European subway map.",
      "id": "ep_32_ut_144"
    },
    {
      "end": 1643430,
      "speaker": "Enrico Bertini",
      "start": 1641794,
      "text": "If you give me the title, I will.",
      "id": "ep_32_ut_145"
    },
    {
      "end": 1701500,
      "speaker": "Giorgia Lupi",
      "start": 1644370,
      "text": "Okay, you can go to our flicker. And it's called European subterranean bays. And it basically is a map of Europe with all of the subways of the cities, you know, just, like, added up one after the others. And this started just because I was reading that London Underground is the sum of all of the underground lengths is 400 was just like, say, oh, isn't it huge? Could we go to Paris with the underground? And the visualization was almost there. So we did this kind of overlapping bubbles that I mentioned, which is just like one, you know, the underground line one after the others. But we didn't, we didn't find the data before. I was like, I was coming to the guys in the office and say, can we find the data about all of the European underground? Because I have this idea which was visual before even, you know. Yeah, that's really cool.",
      "id": "ep_32_ut_146"
    },
    {
      "end": 1704324,
      "speaker": "Moritz Stefaner",
      "start": 1701580,
      "text": "So it's always around one idea of how to.",
      "id": "ep_32_ut_147"
    },
    {
      "end": 1705020,
      "speaker": "Enrico Bertini",
      "start": 1704452,
      "text": "Yeah.",
      "id": "ep_32_ut_148"
    },
    {
      "end": 1708452,
      "speaker": "Moritz Stefaner",
      "start": 1705140,
      "text": "To map a certain theme or a topic.",
      "id": "ep_32_ut_149"
    },
    {
      "end": 1712720,
      "speaker": "Giorgia Lupi",
      "start": 1708556,
      "text": "Yeah, yeah. No, I missed the question because I was actually.",
      "id": "ep_32_ut_150"
    },
    {
      "end": 1719758,
      "speaker": "Moritz Stefaner",
      "start": 1714820,
      "text": "Start with the central idea of how do we, how do we map that one thing, like, oh, what's the metaphor?",
      "id": "ep_32_ut_151"
    },
    {
      "end": 1778950,
      "speaker": "Giorgia Lupi",
      "start": 1719814,
      "text": "We chose something like that, but also another one when we distorted the timeline of Italian historical eclipses according to the number of pages they dedicated for each historical period. And it just started because in Italy, we would used to study history in a very chronological, linear way. And we would have something like the first year of the high school with the hencian time, the second year with the medieval time, the third year more on the Renaissance time, and then just a couple of last year with a very actual and contemporary topic. And in my mind was like, you know, I think that our mental image of the time span is really distorted according to how much time we spend studying that. And the visualization was already there, it was like two parallel, distorted timelines to indicate this kind of distortion. So sometimes it happened like this, but somehow the times, of course, when this kind of intuition didn't happen, didn't happen. We start from the data, of course.",
      "id": "ep_32_ut_152"
    },
    {
      "end": 1817534,
      "speaker": "Enrico Bertini",
      "start": 1779330,
      "text": "Yeah. And I'm thinking, now that I think about it, I mean, even though I think I never tried to sketch any visualization without knowing what kind of data I want to use. I do draw a lot of sketches on paper when I think about visualization, maybe new visualization techniques or, and there is a lot of research out there explaining how and why paper prototyping works. Right. And this is something I tell to my students all the time, just try to sketch something on paper as fast as you can. It's just the difference. I never do it without having a problem in front of me. Right.",
      "id": "ep_32_ut_153"
    },
    {
      "end": 1818262,
      "speaker": "Giorgia Lupi",
      "start": 1817582,
      "text": "Yeah.",
      "id": "ep_32_ut_154"
    },
    {
      "end": 1836862,
      "speaker": "Enrico Bertini",
      "start": 1818446,
      "text": "But sketching on paper, I think there is a lot of value there and probably not enough information out there on how to do that. Properly. Right. That would be really interesting. A guidance on paper, this paper prototyping or something like that, that would be really cool, right?",
      "id": "ep_32_ut_155"
    },
    {
      "end": 1838558,
      "speaker": "Giorgia Lupi",
      "start": 1836966,
      "text": "I think that you could do that.",
      "id": "ep_32_ut_156"
    },
    {
      "end": 1842930,
      "speaker": "Enrico Bertini",
      "start": 1838694,
      "text": "I could try and Stephanie does that as well. Right? We are sure.",
      "id": "ep_32_ut_157"
    },
    {
      "end": 1871104,
      "speaker": "Moritz Stefaner",
      "start": 1844950,
      "text": "But one thing I'm wondering, because in my process, it's often a bit more the other way around, that I first take the data and then see which shapes deliver the most interesting views on that data set. So do you see attention there? Or is it something you bring in later in the process? Or let's say you have a great visual idea, but then it turns out on paper, look good. Like, how do you deal with that?",
      "id": "ep_32_ut_158"
    },
    {
      "end": 1971884,
      "speaker": "Giorgia Lupi",
      "start": 1871192,
      "text": "Sure. So basically, I think that the kind of process that I was explaining before, like coming up with visual ideas even before the data is not happening that often. I think that 90% of the time, maybe say 80% of the time, we start from a data set and analyzing data. And my process is that I always sketch, but I have different kind of phases. The first phase, when I'm basically most interested in categories of data, meaning the number of variables that we have or, you know, the kind of topics we're talking about, the possible correlation, or just like the total number of elements to shape the story. And in this phase, I honestly don't really use the real data and the actual values and number. I just like sketch kind of possible, I would say architecture, the visualization, sort of spatial layout. And then a second phase would, I would just like re sketch again or elaborate in the first idea, or coming up with something totally different when we went, when we go more in depth with the data. And I also have to be honest, I never analyze the data. People in the office make fun of me because I don't want to openly excel. I have them telling me the highest numbers, the smallest one, but this is another story. And so this is the second part when we re sketch, and I re sketch also to communicate to my designers, of course, because to me is also a very. It's the best way to communicate what I have in mind, just like to sketch them out. And to conclude, we also sketch with illustrator. So, of course, then once we see how really the data behave and if the visual model was the best to convey the story, we also sketch and have different kind of draft in illustrator. But I think it's always an iteration of that.",
      "id": "ep_32_ut_159"
    },
    {
      "end": 1998756,
      "speaker": "Moritz Stefaner",
      "start": 1971972,
      "text": "Here's another question that something I always struggle with, too, is what do you show the clients? And when, like, so, you know, you have this vision of how things look, but maybe it's hard to formulate exactly at the beginning. And how much do you involve the clients also in the creation? Do you give them alternatives or do you like, I know other people, like, postpone the client meeting to the very last minute so there cannot be too much interference.",
      "id": "ep_32_ut_160"
    },
    {
      "end": 1999596,
      "speaker": "Giorgia Lupi",
      "start": 1998868,
      "text": "I hate that.",
      "id": "ep_32_ut_161"
    },
    {
      "end": 2001508,
      "speaker": "Moritz Stefaner",
      "start": 1999668,
      "text": "So how do you work with, I.",
      "id": "ep_32_ut_162"
    },
    {
      "end": 2022668,
      "speaker": "Giorgia Lupi",
      "start": 2001524,
      "text": "Mean, since I think it's very easy for me to come up with a drawing that maybe is also, you know, intelligible, because, I mean, I've always been drawing and I did architecture. I mean, I spent five years drawing manually, these kind of plans and layer sims. I'm very quick in drawing. I like to share the first ideas as long as they are in a kind of intelligence form.",
      "id": "ep_32_ut_163"
    },
    {
      "end": 2027068,
      "speaker": "Moritz Stefaner",
      "start": 2022804,
      "text": "Also, because I already, as a sketch, you would say, like, this is an idea we have and we're now working on it.",
      "id": "ep_32_ut_164"
    },
    {
      "end": 2075310,
      "speaker": "Giorgia Lupi",
      "start": 2027084,
      "text": "Yeah. And I tried to explain how they should abstract the sketch and not really take everything that is there as the final design. And I like, we like this part because I think they really like, they have feedback from the clients because since we are really, like, working crosswise with different fields, we want to have, you know, opinions from the very experts in the field if our design is okay for them. And I see that there is a value to really have lots of feedback from the client. Of course, you have to educate them not to tell you, you know, thousands of things. And another funny thing is that sometimes clients, it happened at the very beginning. They fell in love with the sketch. They were like, oh, but so, you know, the very last taste and feel would be like that, right? No, not really.",
      "id": "ep_32_ut_165"
    },
    {
      "end": 2077830,
      "speaker": "Enrico Bertini",
      "start": 2076210,
      "text": "There is an anchoring effect.",
      "id": "ep_32_ut_166"
    },
    {
      "end": 2082640,
      "speaker": "Moritz Stefaner",
      "start": 2078300,
      "text": "No. And it's really important. Like, the first things, the clancy often primes the whole project.",
      "id": "ep_32_ut_167"
    },
    {
      "end": 2095084,
      "speaker": "Giorgia Lupi",
      "start": 2083060,
      "text": "I think it's easier if it is a sketch and not a digital mocap, because if it is a digital mocap, they would be focusing on, you know, the font and the layout and something while a sketch is more abstract as well.",
      "id": "ep_32_ut_168"
    },
    {
      "end": 2096428,
      "speaker": "Moritz Stefaner",
      "start": 2095212,
      "text": "It looks like work in progress.",
      "id": "ep_32_ut_169"
    },
    {
      "end": 2097480,
      "speaker": "Giorgia Lupi",
      "start": 2096484,
      "text": "Yeah, totally.",
      "id": "ep_32_ut_170"
    },
    {
      "end": 2107918,
      "speaker": "Moritz Stefaner",
      "start": 2099020,
      "text": "Yeah. I mean, there's also even tools like balsamic, you know, for wire framing or so that imitates catchy lines. Yeah. Just to make the status clear of a draft of.",
      "id": "ep_32_ut_171"
    },
    {
      "end": 2113146,
      "speaker": "Enrico Bertini",
      "start": 2107964,
      "text": "Yeah, yeah. Which is part of the reason why prototyping works, right?",
      "id": "ep_32_ut_172"
    },
    {
      "end": 2138448,
      "speaker": "Moritz Stefaner",
      "start": 2113258,
      "text": "Yeah. There's also Jason Dykes. They did some research. So it's a researcher in London, and they said sketchiness is also a nice way to represent, like, uncertainty or vague data. So, you know, the more something looks like a chalkboard drawing or a pencil sketch, the more people will maybe take not every number to the second digit behind the convoy. It's a nice technique.",
      "id": "ep_32_ut_173"
    },
    {
      "end": 2143116,
      "speaker": "Enrico Bertini",
      "start": 2138634,
      "text": "So how does it work? Do you have someone programming the whole thing at the end or.",
      "id": "ep_32_ut_174"
    },
    {
      "end": 2170566,
      "speaker": "Giorgia Lupi",
      "start": 2143308,
      "text": "Of course, it depends. I think that in all of the static visualization that we did, and I think that they are the thing that we are mostly known for, the visuals for creator data sera, we do everything just like from Excel to illustrator. And so it's really, really excel and Adobe illustrator for, of course, the interactive project that we did. And then we do, we have two full time developers, but I think that for static images, we never had anything coded or programmed.",
      "id": "ep_32_ut_175"
    },
    {
      "end": 2172694,
      "speaker": "Enrico Bertini",
      "start": 2170638,
      "text": "So you do it basically on illustrator?",
      "id": "ep_32_ut_176"
    },
    {
      "end": 2173326,
      "speaker": "Giorgia Lupi",
      "start": 2172742,
      "text": "Yeah.",
      "id": "ep_32_ut_177"
    },
    {
      "end": 2174382,
      "speaker": "Enrico Bertini",
      "start": 2173478,
      "text": "Okay.",
      "id": "ep_32_ut_178"
    },
    {
      "end": 2176814,
      "speaker": "Giorgia Lupi",
      "start": 2174566,
      "text": "You seem not so happy about the fans here.",
      "id": "ep_32_ut_179"
    },
    {
      "end": 2179570,
      "speaker": "Enrico Bertini",
      "start": 2176942,
      "text": "No, no, sorry.",
      "id": "ep_32_ut_180"
    },
    {
      "end": 2181650,
      "speaker": "Giorgia Lupi",
      "start": 2180590,
      "text": "Poor people.",
      "id": "ep_32_ut_181"
    },
    {
      "end": 2193318,
      "speaker": "Enrico Bertini",
      "start": 2183190,
      "text": "Honestly, I'm not happy because I have absolutely no idea how this works in illustrator. I feel totally ignorant. How do you connect that to visuals in illustrator?",
      "id": "ep_32_ut_182"
    },
    {
      "end": 2203358,
      "speaker": "Giorgia Lupi",
      "start": 2193414,
      "text": "Well, actually, we can draft some charts out from Excel and then really retrace the charts in illustrator. Or we can use the charts from illustrator.",
      "id": "ep_32_ut_183"
    },
    {
      "end": 2205758,
      "speaker": "Enrico Bertini",
      "start": 2203534,
      "text": "You can connect the charts to the original data.",
      "id": "ep_32_ut_184"
    },
    {
      "end": 2213038,
      "speaker": "Moritz Stefaner",
      "start": 2205814,
      "text": "Yeah, but that's horrible. That's all horrible. In illustrator, there's a bar chart, there's a bubble chart, but they are not great.",
      "id": "ep_32_ut_185"
    },
    {
      "end": 2216846,
      "speaker": "Enrico Bertini",
      "start": 2213174,
      "text": "So you are basically constrained to the basic charts, and then you can draw on top.",
      "id": "ep_32_ut_186"
    },
    {
      "end": 2218150,
      "speaker": "Moritz Stefaner",
      "start": 2216878,
      "text": "You calculate yourself basically.",
      "id": "ep_32_ut_187"
    },
    {
      "end": 2218558,
      "speaker": "Giorgia Lupi",
      "start": 2218190,
      "text": "Right.",
      "id": "ep_32_ut_188"
    },
    {
      "end": 2220294,
      "speaker": "Moritz Stefaner",
      "start": 2218654,
      "text": "If a circle needs to have a certain size.",
      "id": "ep_32_ut_189"
    },
    {
      "end": 2220686,
      "speaker": "Giorgia Lupi",
      "start": 2220342,
      "text": "Yeah, sure.",
      "id": "ep_32_ut_190"
    },
    {
      "end": 2222382,
      "speaker": "Moritz Stefaner",
      "start": 2220718,
      "text": "You type it in. Yeah.",
      "id": "ep_32_ut_191"
    },
    {
      "end": 2223630,
      "speaker": "Giorgia Lupi",
      "start": 2222486,
      "text": "Everything is copy paste.",
      "id": "ep_32_ut_192"
    },
    {
      "end": 2230414,
      "speaker": "Enrico Bertini",
      "start": 2223670,
      "text": "Lots of copy pasted by this super manual approach. I think we had a similar discussion with Stephanie when she was on the show.",
      "id": "ep_32_ut_193"
    },
    {
      "end": 2246286,
      "speaker": "Giorgia Lupi",
      "start": 2230582,
      "text": "I still think that, and maybe it's just because I cannot code. I still think that it's easier, at least for me, to do very customized visuals and new and experimental visuals if I start really from what I want and not from what the tools can provide me with.",
      "id": "ep_32_ut_194"
    },
    {
      "end": 2247490,
      "speaker": "Enrico Bertini",
      "start": 2246358,
      "text": "Yeah, sure, sure.",
      "id": "ep_32_ut_195"
    },
    {
      "end": 2249214,
      "speaker": "Giorgia Lupi",
      "start": 2248150,
      "text": "I still think it needs to be.",
      "id": "ep_32_ut_196"
    },
    {
      "end": 2278520,
      "speaker": "Moritz Stefaner",
      "start": 2249222,
      "text": "That's the other interesting thing I think about your style, is that I don't think you think too much in diagram types, like, let's make a stream graph or let's make a bubble chart. But it's much more about what visual properties signify what and what are the visual variables we're using for what and what does the arrangement symbolize or. Yeah, maybe that's also because why every like of your design seems fresh, because you always come with a new combination of things.",
      "id": "ep_32_ut_197"
    },
    {
      "end": 2325110,
      "speaker": "Giorgia Lupi",
      "start": 2278900,
      "text": "We also try really to experiment on that. I think that especially with the corded Vasero work, which is totally exploratory, and we still keep on doing, we, on purpose try to experiment with rich narratives, but with, I'd say, non common aesthetics to convey this kind of data density. Just like to, you know, I had this kind of big ideas, which is so crazy to try to create new languages, new visual languages for this kind of density city of data, which is. I know it's a very crazy thing, but I loved, I mean, and we were talking about that before, of course, when we are delivering rich narratives, lots of people just like simply say, it's too complicated, I cannot get it. I'd love to find ways for, you know, just like convey complicated data sets, you know, rich visuals in a way that people then can understand.",
      "id": "ep_32_ut_198"
    },
    {
      "end": 2361174,
      "speaker": "Enrico Bertini",
      "start": 2326810,
      "text": "One thing I'm curious about, so when you are sketching your visualizations and you're thinking about, I'm sure at some point you have to think about, especially when you have projects that are driven by data, you have to think about how do I encode this data property into a visual property? Are you, are you somewhat influenced by stuff like the past work of Jacques Bertin on visual encoding or something like that? Or you just do it naturally. Is there anything that you read in the past that helps you in this process or is it just your experience in doing that?",
      "id": "ep_32_ut_199"
    },
    {
      "end": 2374926,
      "speaker": "Giorgia Lupi",
      "start": 2361342,
      "text": "I have to be honest, it's very natural. And really think about the fact that until two years ago I really didn't was into data visualization and my background is totally different. So it's just that I'm not.",
      "id": "ep_32_ut_200"
    },
    {
      "end": 2403538,
      "speaker": "Enrico Bertini",
      "start": 2374958,
      "text": "But that's the reason why I'm asking. I'm curious about it because you seem to do it in a very natural way. And yeah, I think the way I work is more. I think I am very much influenced by what I read in the past. So the reason the way I work is more kind of like, oh, I have a categorical variable and this can be mapped to these visual variables. I have some, some kind of shortcuts. I don't know if it's good or bad.",
      "id": "ep_32_ut_201"
    },
    {
      "end": 2408074,
      "speaker": "Giorgia Lupi",
      "start": 2403714,
      "text": "I know that I'm very ignorant from this side, so maybe that's a blast.",
      "id": "ep_32_ut_202"
    },
    {
      "end": 2521140,
      "speaker": "Enrico Bertini",
      "start": 2408202,
      "text": "This is not what I'm trying to say. I'm just trying to say that. I mean, I think I find it an interesting. An interesting thing in the way you work. And I think we were discussing, me and Moritz, that one thing that is really interesting in your work is the fact that you have sometimes you have very complex drawings, or let's say sophisticated drawings with very high density. And it doesn't happen very often that you see high density handle visualizations out there first. Because what I notice is that most people don't get it. I mean, not only those people who are reading the charts, but also the designers themselves. There are people, especially early practitioners, they don't have these. They are not used to create high, these high density visuals. Whereas I think that this is one of the coolest thing in visualization. I mean, if you flip through Edward Tufte's books, the reason why you love this, some of these pictures, at least this is true for me, is that some of this stuff is highly dense, but not in an overwhelming way. It's high density, but you can see these data different levels. You can see something, you can see a big picture. Then you can see the details. You have this micro, macro, micro views, stuff like that. I think this is true in your work, but at the same time, your visuals became very popular. So I think what is really unique in your work is the fact that you still managed to publish stuff that is very complex, but it's very popular. So, and I'm also wondering, so a second question about that. How much do you worry about whether people can read what you do?",
      "id": "ep_32_ut_203"
    },
    {
      "end": 2628220,
      "speaker": "Giorgia Lupi",
      "start": 2521220,
      "text": "I mean, yeah, this is an interesting point. I think that to begin with, we cannot think about designing for everybody. Never. So I think that basically, every time that you design something, it is targeted to a kind of audience. I mean, potentially, I'd love to design things that everybody, everybody would love the same way, but basically, I think it's kind of impossible. So, um, I know for sure that lots of people just, like, may say it's too complicated, but I also think that trying to, first of all, catch readers eyes with pleasant aesthetics within this kind of data density could be, for them, a jumping point to say, oh, it's beautiful. Let's try to understand more. So this is our idea, like, attracting readers with hopefully beautiful aesthetics to get them, um, you know, exploring the data. Then when it comes to say, it's dense, but it's not overwhelming, as you say before, like, talk to you or something like that. I think that this is super important to establish hierarchies and making them clear. So we're really, really working very hard with hierarchy of information, with something like first stories that could be understood at a glance and then more details. And I always use this sentence that I love from Sean Carter, the designer, New York Times. And he talks about designing for both Bart Simpson and Lisa Simpson. I love this. And he thinks about his audience, like, you know, you have to design for a bar, Simpson, that maybe just want to go there, have a quick fix, and just, like, walk away. But then the same piece should also be understood and really enjoyed by Elisa Simpson that maybe she could gonna spend times and understanding stay there. I love that.",
      "id": "ep_32_ut_204"
    },
    {
      "end": 2643316,
      "speaker": "Moritz Stefaner",
      "start": 2628300,
      "text": "Yeah, no, it's really nice. And I think for a while, people thought magazine graphics have to be all about bard only. Yeah, no, really. And so I'm happy that the more complex things you can study for minutes really are coming back.",
      "id": "ep_32_ut_205"
    },
    {
      "end": 2651160,
      "speaker": "Giorgia Lupi",
      "start": 2643348,
      "text": "So that's it is our aim to, you know, encouraging people to stay in a place for a while, to stay there and try to understand.",
      "id": "ep_32_ut_206"
    },
    {
      "end": 2696960,
      "speaker": "Enrico Bertini",
      "start": 2652620,
      "text": "I truly believe that visual sophistication is really important. It's just that it takes time for people to get it. And there is a learning process happening out there. Right. As more and more people are exposed to more complex and deep visuals, the more they have to learn how to read them. Right. And hopefully, at some point, there will be a much larger segment of the population who can read this stuff easily. Right. I think there is a huge problem out there in terms of visual literacy. Right. How do you teach people to read these things? And I think what is really interesting, what you mentioned, is that I think I never saw it this way, but if something is engaging, appealing, then people are happy to spend more time understanding it. Right.",
      "id": "ep_32_ut_207"
    },
    {
      "end": 2697736,
      "speaker": "Giorgia Lupi",
      "start": 2697080,
      "text": "I hope so.",
      "id": "ep_32_ut_208"
    },
    {
      "end": 2751100,
      "speaker": "Enrico Bertini",
      "start": 2697808,
      "text": "Actually, remember reminds me, I think there was a research paper a couple of years back at this called something like visual difficulties, blah, blah, blah. I remember from Jessica Hullman and Nick Jacomus. I think it's one of those who was tear apart by Stephen Few, but it doesn't matter too much. And I think the interesting point there is that it looks like there is a lot of psychological research out there showing that making things more difficult might actually be beneficial because people are more engaged. Okay. I don't know when this is true, how this mechanism works, but there is some theory out there that actually supports this mechanism. So I think that's interesting.",
      "id": "ep_32_ut_209"
    },
    {
      "end": 2767668,
      "speaker": "Giorgia Lupi",
      "start": 2751220,
      "text": "I think that the beautiful and unexpected part of that is important as well. So, yeah, complex, new, but also, I mean, it has to be beautiful. It has to be aesthetically pleasing so that you want to spend time on that. This is just my take just comes into my mind.",
      "id": "ep_32_ut_210"
    },
    {
      "end": 2788840,
      "speaker": "Enrico Bertini",
      "start": 2767724,
      "text": "How do you. So when we talk about engagement in visualization, I think that text plays a major role as well. So you have to have a very nice interplay between the visuals and the text annotation. The first thing you read is probably the header. Right. And then the notes. So how do you do that?",
      "id": "ep_32_ut_211"
    },
    {
      "end": 2824630,
      "speaker": "Giorgia Lupi",
      "start": 2789380,
      "text": "Oh, okay. I think that also the text has to be layered the proper way so the headline is the story explanation, the big story explanation. So the headline should be pretty visible, but then all of the other text elements shouldn't distract from the visual elements. They should just like be in the background just to explain if the visual is not really able to do it automatically. And it's very hard to talk about these things and not drawing these kind of things. But I think that the text should be really balanced within the visual as if it was a visual element.",
      "id": "ep_32_ut_212"
    },
    {
      "end": 2831250,
      "speaker": "Moritz Stefaner",
      "start": 2826270,
      "text": "So usually you also do the text for the graphics, or is it something you client will work on.",
      "id": "ep_32_ut_213"
    },
    {
      "end": 2905684,
      "speaker": "Giorgia Lupi",
      "start": 2831870,
      "text": "So if we mean the text within the graph, we always do that. But in some pieces that we do from magazine, we also have an extra article written by a journalist. And it also happened a couple of times that we wrote the article, but just because we were. I don't know, I don't really know where because they asked us, can you just like write the article as well? Yes, no, but basically. So, yeah, we. Yeah, we do all of the text, the labeling, the legion and the explanation within the graph. But then you sometimes have an extra. Yeah, an extra article. But actually it's fun because we always talk about the project that we do for print. And I think that as Lynn pointed out on Twitter, we are mostly known for this kind of printed and static data visualization. While I think that basically more than 50% of the job that we do is really working with interactive data visualization and interactive tool to visually convey an access to the data, it's just that basically we are not able to release them all. And also some of them, we are about to release them just because we've been working on them for the last six months. I think that I don't. Yeah, we are still pretty much known and we are always been asked questions about printers process and.",
      "id": "ep_32_ut_214"
    },
    {
      "end": 2924356,
      "speaker": "Enrico Bertini",
      "start": 2905772,
      "text": "Yeah, I think this is true a little bit for everyone. There are not too many interactive tools out there, right? I mean, I think it's also the problem is that static features are much easier to share on Twitter, Facebook or whatever, so they just spread much faster.",
      "id": "ep_32_ut_215"
    },
    {
      "end": 2928920,
      "speaker": "Giorgia Lupi",
      "start": 2924508,
      "text": "And quicker to produce. So you can have lots of. Lots of them. Yeah.",
      "id": "ep_32_ut_216"
    },
    {
      "end": 2934228,
      "speaker": "Enrico Bertini",
      "start": 2930140,
      "text": "So what do you want to tell us something about the interactive projects that you.",
      "id": "ep_32_ut_217"
    },
    {
      "end": 2970240,
      "speaker": "Giorgia Lupi",
      "start": 2934404,
      "text": "No, it just like happened to my mind right now to say that also this conversation is like everything about the pieces that we did for print, which I think, I mean, it's easier for us to experiment with, you know, new metaphors and visuals and languages for these printed pieces, just because it's quicker, just because we can do it within a short time span. And so I also think this is why we are mostly known for this. We are about to release a couple of projects and we are also very happy about. I cannot tell you a lot, but we will release something.",
      "id": "ep_32_ut_218"
    },
    {
      "end": 2987960,
      "speaker": "Enrico Bertini",
      "start": 2973900,
      "text": "So another thing I wanted to ask you is more, I think many of your visualizations have been popularized by brain pickings. So can you tell us more about how this worked?",
      "id": "ep_32_ut_219"
    },
    {
      "end": 2992654,
      "speaker": "Giorgia Lupi",
      "start": 2988750,
      "text": "Well, it was very neutral when I came to New York in the first place.",
      "id": "ep_32_ut_220"
    },
    {
      "end": 3009950,
      "speaker": "Enrico Bertini",
      "start": 2992742,
      "text": "So maybe we should mention what brain pickings is to people who don't know what it is. You want to say what brain pickings is? I mean, I don't know much about it, but I know that it's a super famous blog written by Maria Popova. Right. Is she also based in New York?",
      "id": "ep_32_ut_221"
    },
    {
      "end": 3011718,
      "speaker": "Giorgia Lupi",
      "start": 3010030,
      "text": "Yeah, yeah, she lives in New York as well.",
      "id": "ep_32_ut_222"
    },
    {
      "end": 3024906,
      "speaker": "Enrico Bertini",
      "start": 3011774,
      "text": "Okay. I never met her. And she has this super popular blog where she creates, it's what basically she curates content taken from books or other sources. Yeah.",
      "id": "ep_32_ut_223"
    },
    {
      "end": 3035442,
      "speaker": "Giorgia Lupi",
      "start": 3024938,
      "text": "More cultural and literal content. And she curate all of these amazing posts. And I think this is very brilliant. And everybody who is not familiar with brainpix, you should go there and. Yeah, yeah, yeah.",
      "id": "ep_32_ut_224"
    },
    {
      "end": 3038642,
      "speaker": "Enrico Bertini",
      "start": 3035466,
      "text": "It's totally cool. I mean, if only I had enough time to read it.",
      "id": "ep_32_ut_225"
    },
    {
      "end": 3045880,
      "speaker": "Giorgia Lupi",
      "start": 3038666,
      "text": "Every day there's a Sunday Digest weekly you can subscribe to the Sunday email.",
      "id": "ep_32_ut_226"
    },
    {
      "end": 3047156,
      "speaker": "Enrico Bertini",
      "start": 3046820,
      "text": "Yeah.",
      "id": "ep_32_ut_227"
    },
    {
      "end": 3085326,
      "speaker": "Giorgia Lupi",
      "start": 3047188,
      "text": "So. But actually it was very simple. I've been always fascinated by her blog and I just wrote has her an email when I came to New York to say, I'm here. I love what you do. This is what I do. Shall we meet? And just. We met and we found common interest in lots of things. Like, I mean, she's very interested in visualization and so she's very open to experiment with visualization. And so as, every time that we did something related to her topics like cultural or literary, I would just like, send an email to her and say, you like it. If you like, you can publish it. And if she like it, she publish it. But lately we just, we also collaborated with her.",
      "id": "ep_32_ut_228"
    },
    {
      "end": 3086926,
      "speaker": "Enrico Bertini",
      "start": 3085358,
      "text": "So how are you spamming her?",
      "id": "ep_32_ut_229"
    },
    {
      "end": 3109346,
      "speaker": "Giorgia Lupi",
      "start": 3086998,
      "text": "Of course. Yes. No, but I mean, in a good way. I hope so. And. Yeah, but, but the last project that we did, we did it with her in collaboration with her. So it started from her idea and it was a relationship between sleeping habits of famous writers and their productivity. So the time writers wake up.",
      "id": "ep_32_ut_230"
    },
    {
      "end": 3110070,
      "speaker": "Enrico Bertini",
      "start": 3109378,
      "text": "Oh, yeah.",
      "id": "ep_32_ut_231"
    },
    {
      "end": 3132712,
      "speaker": "Giorgia Lupi",
      "start": 3110850,
      "text": "And also we teamed up with the illustrator Wendy McNaughton to do this project. And it's so nice because we kind of like shared and we mixed up this data visualization language and the illustration language. But actually this piece was totally curated by Maria and so she had the idea and she helped us with the criteria to find the data and. Yeah, so this was a real collaboration and we are also starting a new one.",
      "id": "ep_32_ut_232"
    },
    {
      "end": 3134192,
      "speaker": "Moritz Stefaner",
      "start": 3132896,
      "text": "Nice. That's good.",
      "id": "ep_32_ut_233"
    },
    {
      "end": 3135020,
      "speaker": "Enrico Bertini",
      "start": 3134296,
      "text": "Cool.",
      "id": "ep_32_ut_234"
    },
    {
      "end": 3147598,
      "speaker": "Moritz Stefaner",
      "start": 3135600,
      "text": "Lin also asks Lynn Cherney on Twitter, what would be your favorite kind of client or project? Or maybe talk about the future? Like, do you have any dreams, like, types of projects you would like to do?",
      "id": "ep_32_ut_235"
    },
    {
      "end": 3159990,
      "speaker": "Giorgia Lupi",
      "start": 3147744,
      "text": "So, talking about favorite clients, I think that, of course, the most ideal client would be the one that pays you a lot of money for doing something very experimental and also in approaches that you are learning something.",
      "id": "ep_32_ut_236"
    },
    {
      "end": 3165338,
      "speaker": "Moritz Stefaner",
      "start": 3160810,
      "text": "And then they promote it. Really well, of course, visualize it and.",
      "id": "ep_32_ut_237"
    },
    {
      "end": 3170030,
      "speaker": "Enrico Bertini",
      "start": 3165354,
      "text": "You get invited conferences and something like that.",
      "id": "ep_32_ut_238"
    },
    {
      "end": 3202140,
      "speaker": "Giorgia Lupi",
      "start": 3170850,
      "text": "But I mean, I think that, no, we are very happy with our collaboration with Korida, of course, because they really leave us experiment 100% without, I mean, really, really. We can do, in a way, whatever we like as long as the criteria are, you know, approved by them. We also, lately we've been working with. Yeah. For a platform that we will release on analytics about fashion trends. So qualitative individualization and fashion trend.",
      "id": "ep_32_ut_239"
    },
    {
      "end": 3203416,
      "speaker": "Moritz Stefaner",
      "start": 3202180,
      "text": "That's a good, good topic.",
      "id": "ep_32_ut_240"
    },
    {
      "end": 3204140,
      "speaker": "Giorgia Lupi",
      "start": 3203488,
      "text": "Yeah.",
      "id": "ep_32_ut_241"
    },
    {
      "end": 3223360,
      "speaker": "Enrico Bertini",
      "start": 3205040,
      "text": "Have you ever seen that one? I think there was a camera on the street picking clothes from people for a very long time and then playing with color. That was really cool. And our colors change with nice, with seasons. That was a really cool one. Sorry for interrupting. No problem.",
      "id": "ep_32_ut_242"
    },
    {
      "end": 3276500,
      "speaker": "Giorgia Lupi",
      "start": 3223520,
      "text": "It's interesting, I was just mentioning this client because they, they've been amazing throughout all the process, and I think that they really appreciate the design approach that we had, and we really let us experiment with non common visual models for visualizing this kind of thing. Then we are very happy with this collaboration and so like, to back up the answer. I think that the more the client is open to experiment and the more we are happy. So this is basically our favorite one. And in the future, I think that I'd love to. I think we'd love to work more with interactive data visualization, but also with the kind of feeling and approach that we have for aesthetic ones. So really, like, you know, customizing things, trying to build unexpected visuals. And I would also love to work for physical spaces like museums. I mean, I'm an artist and so I love to.",
      "id": "ep_32_ut_243"
    },
    {
      "end": 3306248,
      "speaker": "Enrico Bertini",
      "start": 3277040,
      "text": "That's a cool one. Yeah, yeah. I think working with public displays, that would be really cool, especially in New York. I've been thinking about it for a while. There are so many spaces out here that could be just perfect. I mean, every time I go to Times Square. What could we do with so many pixels? That would be really cool. I mean, and it's not very creative if you go there. It's the usual Coca Cola stuff going on for the last 20 years.",
      "id": "ep_32_ut_244"
    },
    {
      "end": 3310820,
      "speaker": "Giorgia Lupi",
      "start": 3306304,
      "text": "Well, I think we should convince visualization is better than advertising.",
      "id": "ep_32_ut_245"
    },
    {
      "end": 3325238,
      "speaker": "Enrico Bertini",
      "start": 3312360,
      "text": "Come on. That would be a nice competition. Right? Kind of like giving, for a few days the opportunity to summon designers to take care of Times Square's monitors. That would be huge.",
      "id": "ep_32_ut_246"
    },
    {
      "end": 3327022,
      "speaker": "Giorgia Lupi",
      "start": 3325374,
      "text": "Ask Coca Cola if it's so.",
      "id": "ep_32_ut_247"
    },
    {
      "end": 3340610,
      "speaker": "Enrico Bertini",
      "start": 3327046,
      "text": "If the new mayor is listening to this one to tell the stories. Please do that. I could actually pitch. I should pitch this idea. Yeah.",
      "id": "ep_32_ut_248"
    },
    {
      "end": 3341740,
      "speaker": "Moritz Stefaner",
      "start": 3340960,
      "text": "Nice.",
      "id": "ep_32_ut_249"
    },
    {
      "end": 3343780,
      "speaker": "Giorgia Lupi",
      "start": 3342760,
      "text": "We are in.",
      "id": "ep_32_ut_250"
    },
    {
      "end": 3358784,
      "speaker": "Enrico Bertini",
      "start": 3351720,
      "text": "What else? I think we're almost done. Do you plan to learn programming sometime in the future?",
      "id": "ep_32_ut_251"
    },
    {
      "end": 3365820,
      "speaker": "Giorgia Lupi",
      "start": 3358872,
      "text": "Not really. And I hope Stefan is not learning as well.",
      "id": "ep_32_ut_252"
    },
    {
      "end": 3368146,
      "speaker": "Moritz Stefaner",
      "start": 3367130,
      "text": "No, I don't think so.",
      "id": "ep_32_ut_253"
    },
    {
      "end": 3369066,
      "speaker": "Enrico Bertini",
      "start": 3368178,
      "text": "No, she's not.",
      "id": "ep_32_ut_254"
    },
    {
      "end": 3371430,
      "speaker": "Moritz Stefaner",
      "start": 3369098,
      "text": "No, I think she's staying strong.",
      "id": "ep_32_ut_255"
    },
    {
      "end": 3397928,
      "speaker": "Enrico Bertini",
      "start": 3373570,
      "text": "And, yeah, this pairs up well with my dream of teaching aesthetics to engineers, which would be really. Maybe we could organize a workshop where we teach programming to designers and aesthetics engineers. That would be nice. Nice thing to do. Okay, cool.",
      "id": "ep_32_ut_256"
    },
    {
      "end": 3398440,
      "speaker": "Giorgia Lupi",
      "start": 3398024,
      "text": "Nice.",
      "id": "ep_32_ut_257"
    },
    {
      "end": 3399352,
      "speaker": "Moritz Stefaner",
      "start": 3398520,
      "text": "Super nice.",
      "id": "ep_32_ut_258"
    },
    {
      "end": 3407624,
      "speaker": "Enrico Bertini",
      "start": 3399496,
      "text": "We've been talking for a while, right? Okay, good. Is there anything else?",
      "id": "ep_32_ut_259"
    },
    {
      "end": 3408856,
      "speaker": "Giorgia Lupi",
      "start": 3407712,
      "text": "Thank you, Moritz.",
      "id": "ep_32_ut_260"
    },
    {
      "end": 3411296,
      "speaker": "Moritz Stefaner",
      "start": 3409048,
      "text": "Yeah, thanks for being on. It was so nice to have you.",
      "id": "ep_32_ut_261"
    },
    {
      "end": 3414272,
      "speaker": "Enrico Bertini",
      "start": 3411408,
      "text": "Yeah. Now we can go for some coffee or whatever.",
      "id": "ep_32_ut_262"
    },
    {
      "end": 3415940,
      "speaker": "Giorgia Lupi",
      "start": 3414416,
      "text": "We have bagels here.",
      "id": "ep_32_ut_263"
    },
    {
      "end": 3418380,
      "speaker": "Enrico Bertini",
      "start": 3416640,
      "text": "We should be more often. More.",
      "id": "ep_32_ut_264"
    },
    {
      "end": 3420372,
      "speaker": "Moritz Stefaner",
      "start": 3418480,
      "text": "Yeah. It's nice to be in the same room.",
      "id": "ep_32_ut_265"
    },
    {
      "end": 3422212,
      "speaker": "Giorgia Lupi",
      "start": 3420436,
      "text": "Just come to New York more often.",
      "id": "ep_32_ut_266"
    },
    {
      "end": 3427000,
      "speaker": "Moritz Stefaner",
      "start": 3422396,
      "text": "I'm working on it. I mean, yeah, I have a few collaborators here now.",
      "id": "ep_32_ut_267"
    },
    {
      "end": 3440964,
      "speaker": "Enrico Bertini",
      "start": 3427860,
      "text": "So, guys, again, let me just remark again that if you want to send us comments, feedback, email, proposals, new episodes.",
      "id": "ep_32_ut_268"
    },
    {
      "end": 3443564,
      "speaker": "Moritz Stefaner",
      "start": 3441092,
      "text": "You can also rate us on iTunes. That will help.",
      "id": "ep_32_ut_269"
    },
    {
      "end": 3460060,
      "speaker": "Enrico Bertini",
      "start": 3443612,
      "text": "Oh, you can rate us on iTunes. That. That's apparently super, super useful in promoting the podcast. So if you have a few seconds to do that, please do it. But again, we are very happy to hear from you, so let us know what you want us to do.",
      "id": "ep_32_ut_270"
    },
    {
      "end": 3461888,
      "speaker": "Moritz Stefaner",
      "start": 3460880,
      "text": "That's right.",
      "id": "ep_32_ut_271"
    },
    {
      "end": 3463872,
      "speaker": "Enrico Bertini",
      "start": 3462064,
      "text": "Bye bye. Take care. See you. Bye.",
      "id": "ep_32_ut_272"
    }
  ],
  "confidence": 0.911260594402031,
  "audio_duration": 3477,
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_status_code": null,
  "webhook_auth": false,
  "webhook_auth_header_name": null,
  "speed_boost": false,
  "auto_highlights_result": null,
  "auto_highlights": false,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_audio_quality": null,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "content_safety": false,
  "iab_categories": true,
  "content_safety_labels": {
    "status": "unavailable",
    "results": [],
    "summary": {}
  },
  "language_detection": false,
  "language_detection_threshold": null,
  "language_confidence": null,
  "custom_spelling": null,
  "throttled": false,
  "auto_chapters": true,
  "summarization": false,
  "summary_type": null,
  "summary_model": null,
  "custom_topics": false,
  "topics": [],
  "speech_threshold": null,
  "speech_model": "best",
  "chapters": [
    {
      "summary": "This is data stories number 32. I'm actually in New York, so I'm sitting for once in the same room with Enrico in the recording. Feels weird. Happy to be here.",
      "gist": "Interview",
      "headline": "Data stories number 32 is hosted by accurate in New York",
      "start": 10920,
      "end": 60464,
      "id": "ep_32_ch_0"
    },
    {
      "summary": "We should talk about accessibility for information, graphics. How do they, how do they experience the charts and visualizations that we produce? That's a big problem.",
      "gist": "Comments on accessibility for information and graphics",
      "headline": "We asked our listeners to send in more comments on accessibility for graphics",
      "start": 60592,
      "end": 128796,
      "id": "ep_32_ch_1"
    },
    {
      "summary": "Enrico: You always want tools to talk about tools. But at the same time I think that we are too much. There are so many tools around it. We have to find the right balance. Who do you want us to invite?",
      "gist": "Suggestions for the Next Episode",
      "headline": "You always want tools to talk about tools. Yeah. And I think the other suggestions, we had a lot of suggestions about tools",
      "start": 128948,
      "end": 255160,
      "id": "ep_32_ch_2"
    },
    {
      "summary": "Today we have Georgia Lupi from accurate. com. Can you come some days to work here? Of course. You're more than welcome to bring some pastries or views. So we're gonna talk Italian today.",
      "gist": "Italian guest at accurate.com",
      "headline": "Georgia Lupi from accurate. com is your first Italian guest",
      "start": 255320,
      "end": 324112,
      "id": "ep_32_ch_3"
    },
    {
      "summary": "Georgia Luby is co founder and design director at Accurate, an Italian information design company. She is also finishing her PhD at density design lab at Politecnico di Milano. The field of data visualization was a bit foreign to her until a couple of years ago. Now her parents understand what she does.",
      "gist": "Georgia Luby",
      "headline": "Georgia Luby is co founder and design director at Accurate",
      "start": 324216,
      "end": 481760,
      "id": "ep_32_ch_4"
    },
    {
      "summary": "Accurat: How many people are you now altogether? We have three partners. We have seven full time designers. And then we have an intern guys, right now, the stuff. It's like 15 people, the full time taffy, 15.",
      "gist": "How many people are in the company now?",
      "headline": "Accurat: How many people are you now altogether",
      "start": 482380,
      "end": 617536,
      "id": "ep_32_ch_5"
    },
    {
      "summary": "Three founders of Interaction Design Lab started the company in 2012. The company focuses on information visualization. Did you have funding or investment? No, we didn't have any funding at all. The field is growing in Italy.",
      "gist": "Startup: Data Visualization in Italy",
      "headline": "You were three founders of Interaction Design Lab, which focuses on data visualization",
      "start": 617608,
      "end": 809690,
      "id": "ep_32_ch_6"
    },
    {
      "summary": "As my twenties came to an end, I realized that I had to try to live abroad. And there was something in me saying, that's okay, I have to live here. And then Gabriel, my other partner, came along, and we just tried. And having success, I mean, that was really great.",
      "gist": "How did you manage to live permanently in New York?",
      "headline": "And then you moved to New York. How did you get there",
      "start": 809990,
      "end": 926560,
      "id": "ep_32_ch_7"
    },
    {
      "summary": "There are no aesthetic or visual design style differences between Milan and New York or Europe. It really also really depends on the opportunities that have on the kind of work that you are asked to do. I'm wondering if, in general, stuff coming from Europe is more designy than stuff from the US.",
      "gist": "Are There Any Design Differences Between Milan and New York?",
      "headline": "Scott Murray asked if there are any aesthetic or visual design style differences between Milan",
      "start": 927300,
      "end": 1101390,
      "id": "ep_32_ch_8"
    },
    {
      "summary": "First time we have a person from a studio, from a design studio. Doing visualization. Must be hard coordinating all these people. Do you ever delegate your work? How does it work?",
      "gist": "How does a design studio work?",
      "headline": "Moritz: We never really talked about how to do visualization in a team",
      "start": 1104210,
      "end": 1276830,
      "id": "ep_32_ch_9"
    },
    {
      "summary": "So you have designers from Italy coming to New York for some time? Actually, yes, we try to do that. Of course, it's hard because of the visas. I like it, and I like the atmosphere in the Milan office. This is the only thing that I miss about Italy.",
      "gist": "Have Italian designers been coming to New York?",
      "headline": "So you have designers from Italy coming to New York for some time",
      "start": 1277250,
      "end": 1331670,
      "id": "ep_32_ch_10"
    },
    {
      "summary": "How do you split work from here to Milan? Are you handling different projects or not really. We are still working really, really very close to the Milan office. We don't really have strategy. As long as one project comes, we figure out how to do it.",
      "gist": "How do you split work from here to Milan?",
      "headline": "How do you split work from here to Milan? Are you handling different projects",
      "start": 1332210,
      "end": 1385748,
      "id": "ep_32_ch_11"
    },
    {
      "summary": "How many projects do you have running in parallel? I know you're also working on a big European project. Not more than really eight to ten projects ongoing at the same time. So you still have time to work on personal projects if you want to.",
      "gist": "How many projects do you have running at the same time?",
      "headline": "So what do you think? How many projects do you have running in parallel",
      "start": 1385884,
      "end": 1465160,
      "id": "ep_32_ch_12"
    },
    {
      "summary": "Design process is based on sketching out ideas and drawing. Sometimes the design of the data start from the data that we have. Other times, it's just like, why don't we visualize this like that? How does it work?",
      "gist": "How Does The Design Process Work?",
      "headline": "I'm curious about your visualization process. How does it work",
      "start": 1467620,
      "end": 1842930,
      "id": "ep_32_ch_13"
    },
    {
      "summary": "In 90% of the time, we start from a data set and analyzing data. My process is that I always sketch, but I have different kind of phases. Once we see how really the data behave, we also sketch and have different draft in illustrator.",
      "gist": "How Do You Come Up With a Design Idea?",
      "headline": "In your process, you come up with visual ideas before analyzing data",
      "start": 1844950,
      "end": 1971884,
      "id": "ep_32_ch_14"
    },
    {
      "summary": "How much do you involve the clients in the creation of a visualization? Do you have someone programming the whole thing at the end or. Do everything just like from Excel to illustrator?",
      "gist": "How To Design a Sketch in Illustrator vs. Excel",
      "headline": "How much do you involve the clients in the creation of your graphics",
      "start": 1971972,
      "end": 2325110,
      "id": "ep_32_ch_15"
    },
    {
      "summary": "Until two years ago I really didn't was into data visualization. I'm curious about it because you seem to do it in a very natural way. Is there anything that you read in the past that helps you in this process or is it just your experience in doing that?",
      "gist": "Does Data Visualization Have a Natural Method?",
      "headline": "You seem to do data visualization in a very natural way",
      "start": 2326810,
      "end": 2416410,
      "id": "ep_32_ch_16"
    },
    {
      "summary": "It doesn't happen very often that you see high density handle visualizations out there first. What is really unique in your work is the fact that you still managed to publish stuff that is very complex, but it's very popular.",
      "gist": "High-Density Visualizations in Visualization",
      "headline": "Your work has very high density, but it's very popular",
      "start": 2416950,
      "end": 2512440,
      "id": "ep_32_ch_17"
    },
    {
      "summary": "Every time that you design something, it is targeted to a kind of audience. I think there is a huge problem out there in terms of visual literacy. How do you teach people to read these things? If something is engaging, appealing, then people are happy to spend more time understanding it.",
      "gist": "No Design For Everybody",
      "headline": "How much do you worry about whether people can read what you do",
      "start": 2514060,
      "end": 2755436,
      "id": "ep_32_ch_18"
    },
    {
      "summary": "More than 50% of the job that we do is really working with interactive data visualization and interactive tool. We are mostly known for this kind of printed and static data visualization. About to release a couple of projects and we are also very happy about.",
      "gist": "Interactive Data Visualization in Science",
      "headline": "Text plays a major role in engagement in visualization, I think",
      "start": 2755508,
      "end": 2970240,
      "id": "ep_32_ch_19"
    },
    {
      "summary": "Many of your visualizations have been popularized by brain pickings. The blog is a super famous blog written by Maria Popova. Recently, the team has collaborated with her on other projects. Is this spam? Of course. But in a good way.",
      "gist": "In the Elevator With Brain Pickings",
      "headline": "Many of your visualizations have been popularized by brain pickings",
      "start": 2973900,
      "end": 3135020,
      "id": "ep_32_ch_20"
    },
    {
      "summary": "Lin also asks Lynn Cherney on Twitter, what would be your favorite kind of client or project? Or maybe talk about the future. Do you have any dreams, like, types of projects you would like to do?",
      "gist": "Top Design Students: Favorite Client and",
      "headline": "Lin asks Lynn Cherney on Twitter what would be your favorite kind of client",
      "start": 3135600,
      "end": 3341740,
      "id": "ep_32_ch_21"
    },
    {
      "summary": "Do you plan to learn programming sometime in the future? Not really. This pairs up well with my dream of teaching aesthetics to engineers. Maybe we could organize a workshop where we teach programming to designers and aesthetics engineers. That would be nice.",
      "gist": "Learning Programming in the Studio",
      "headline": "Do you plan to learn programming sometime in the future? Not really",
      "start": 3342760,
      "end": 3401500,
      "id": "ep_32_ch_22"
    },
    {
      "summary": "Moritz: If you want to send us comments, feedback, email, proposals, new episodes. You can also rate us on iTunes. That's apparently super, super useful in promoting the podcast. Take care. See you.",
      "gist": "Comments & Rate the Podcast",
      "headline": "Moritz: Just come to New York more often. That will help. I'm working on it",
      "start": 3404600,
      "end": 3463872,
      "id": "ep_32_ch_23"
    }
  ],
  "disfluencies": false,
  "entity_detection": false,
  "sentiment_analysis": false,
  "sentiment_analysis_results": null,
  "entities": null,
  "speakers_expected": null,
  "summary": null,
  "custom_topics_results": null,
  "is_deleted": null,
  "episode_num": "32",
  "episode_metadata": {
    "speakers": [
      "Moritz Stefaner",
      "Enrico Bertini",
      "Giorgia Lupi"
    ],
    "WPid": "152",
    "url": "https://datastori.es/podlove/file/327/s/feed/c/mp3/datastories-32.mp3",
    "episode_title": "High Density Infographics and Data Drawing w/ Giorgia Lupi"
  }
}