{
  "id": "7e00c559-2a01-4205-b766-ce88d5149c5d",
  "language_model": "assemblyai_default",
  "acoustic_model": "assemblyai_default",
  "language_code": "en_us",
  "status": "completed",
  "audio_url": "https://datastori.es/podlove/file/1272/s/feed/c/mp3/end-of-summer-episode-we-talk-about-upcoming-ds-events-and-some-of-our-recent-projects-ds60.mp3",
  "utterances": [
    {
      "end": 31034,
      "speaker": "Moritz Stefaner",
      "start": 360,
      "text": "We thought about other people's projects, but we didn't find any interesting ones. So we thought maybe let's just talk about ours. Data stories is brought to you by Qlik, who allows you to explore the hidden relationships within your data that lead to meaningful insights. Let your instincts lead the way to create personalized visualizations and dynamic dashboards with Qlik sense, which you can download for free at Qlik. Deries. That's Q l I K Datastories.",
      "id": "ep_60_ut_0"
    },
    {
      "end": 45812,
      "speaker": "Enrico Bertini",
      "start": 40964,
      "text": "Hey, everyone. Data stories number 60. Hey, Moritz, how are you?",
      "id": "ep_60_ut_1"
    },
    {
      "end": 48516,
      "speaker": "Moritz Stefaner",
      "start": 45948,
      "text": "Hey, Enrico. Good, how are you?",
      "id": "ep_60_ut_2"
    },
    {
      "end": 59994,
      "speaker": "Enrico Bertini",
      "start": 48660,
      "text": "I'm okay. Summer is almost gone, but. Yeah, I had some time to restore a little bit. Not too much, but yeah, at least.",
      "id": "ep_60_ut_3"
    },
    {
      "end": 65714,
      "speaker": "Moritz Stefaner",
      "start": 60034,
      "text": "We took a little data stories break. So that horrible part of your life hasn't been bothering you.",
      "id": "ep_60_ut_4"
    },
    {
      "end": 69642,
      "speaker": "Enrico Bertini",
      "start": 65874,
      "text": "Yeah, that was okay, too.",
      "id": "ep_60_ut_5"
    },
    {
      "end": 85628,
      "speaker": "Moritz Stefaner",
      "start": 69778,
      "text": "Yeah. Yeah. Yeah. It's kind of nice. Yeah, I did some traveling, too. I had a sort of a turbulent summer with a lot of deadlines, but also vacations, but also projects. And it's sort of confusing. A lot of miles in the end. But, yeah, I had a good August.",
      "id": "ep_60_ut_6"
    },
    {
      "end": 98284,
      "speaker": "Enrico Bertini",
      "start": 85826,
      "text": "Yeah. Yeah, me too. I didn't have a real proper vacation, but, yeah. But I've been hiking here and there. I've been visiting a lab in Washington state. It's pretty amazing there.",
      "id": "ep_60_ut_7"
    },
    {
      "end": 109240,
      "speaker": "Moritz Stefaner",
      "start": 98744,
      "text": "Cool. Nice. Yeah, I had one week of camping. Like one week really off the grid. I didn't even have cell phone reception, so that's nice.",
      "id": "ep_60_ut_8"
    },
    {
      "end": 113604,
      "speaker": "Enrico Bertini",
      "start": 109392,
      "text": "Yeah. And now it's the September craze. Right?",
      "id": "ep_60_ut_9"
    },
    {
      "end": 115200,
      "speaker": "Moritz Stefaner",
      "start": 114224,
      "text": "Crunch time again.",
      "id": "ep_60_ut_10"
    },
    {
      "end": 125234,
      "speaker": "Enrico Bertini",
      "start": 115272,
      "text": "That's. That's the hardest. One of the hardest this month, of the year. It's pretty crazy. So. Well, today it's me and you.",
      "id": "ep_60_ut_11"
    },
    {
      "end": 128326,
      "speaker": "Moritz Stefaner",
      "start": 125654,
      "text": "No special guests? No, the two of us.",
      "id": "ep_60_ut_12"
    },
    {
      "end": 158036,
      "speaker": "Enrico Bertini",
      "start": 128350,
      "text": "Yeah. It's a Moen or Enmo. And, yeah, I think we have done this a few times now, and we just want to talk about, I don't know, stuff that comes in our mind, hopefully. That's interesting. We have a long list of topics. I don't know if we will manage to cover everything, but I think we want to start with a few updates on data stories, which, surprisingly, we do. Not very often.",
      "id": "ep_60_ut_13"
    },
    {
      "end": 158764,
      "speaker": "Moritz Stefaner",
      "start": 158180,
      "text": "That's true.",
      "id": "ep_60_ut_14"
    },
    {
      "end": 207274,
      "speaker": "Enrico Bertini",
      "start": 158844,
      "text": "Yeah, that's true. We should do it more often. So let me give you a few updates about data stories. So the first one is that you might have noticed that we have some sort of new format that we internally call project episodes. So the idea here is that rather than having an episode that is fully focused on one specific topic and one person, we have an episode that is about one specific project. So recently we had one. The last one actually was on the climate change piece from the Bloomberg team. Previously we had an experimental one with Gregor Aish from New York Times on the yield curve. And did we have another one? Another?",
      "id": "ep_60_ut_15"
    },
    {
      "end": 207970,
      "speaker": "Moritz Stefaner",
      "start": 207354,
      "text": "No, I think that's.",
      "id": "ep_60_ut_16"
    },
    {
      "end": 235104,
      "speaker": "Enrico Bertini",
      "start": 208042,
      "text": "No, these are the two ones that we tried. We right now, don't we have plans to keep doing project episodes with video for a number of reasons, but we do want to continue project episodes because it's fun and because it's a different way. I think it's an interesting way for people to learn more about the specifics of a specific project. And we do have some more in the pipeline, right, Moritz?",
      "id": "ep_60_ut_17"
    },
    {
      "end": 237804,
      "speaker": "Moritz Stefaner",
      "start": 235224,
      "text": "Yeah, at least one that I'm aware of.",
      "id": "ep_60_ut_18"
    },
    {
      "end": 238968,
      "speaker": "Enrico Bertini",
      "start": 238544,
      "text": "Yeah.",
      "id": "ep_60_ut_19"
    },
    {
      "end": 258646,
      "speaker": "Moritz Stefaner",
      "start": 239016,
      "text": "So if you have any good ideas or any projects where you think like, wow, it could be cool to learn a bit more about the background there, about the design process or the history of a project, let us know and we can reach out to the people and maybe they will be willing to tell us a bit about the project.",
      "id": "ep_60_ut_20"
    },
    {
      "end": 308826,
      "speaker": "Enrico Bertini",
      "start": 258790,
      "text": "Yes. And related to that, you might or might not have noticed that we have now a sort of new format for the blog post now every single episode as an image gallery. So this means that you can go to the blog post and click on the gallery and see images that are related to the episode. Typically there are screenshots that we take, or even photos and pictures. So the idea here is that, I mean, we often talk about visual things, so being able to have a preview of the images we talk about is probably useful. This doesn't mean that you cannot listen to the episode without looking, looking at these images, but it's a nice preview if you want to use it.",
      "id": "ep_60_ut_21"
    },
    {
      "end": 325962,
      "speaker": "Moritz Stefaner",
      "start": 309010,
      "text": "And we also embed these images when it fits into the podcast itself. So it depends really a bit on the podcatcher or the application you use to play the podcast, but you might see the images if you're lucky. I know that on iPhone some of the players support it.",
      "id": "ep_60_ut_22"
    },
    {
      "end": 330934,
      "speaker": "Enrico Bertini",
      "start": 326098,
      "text": "Yeah. Unfortunately it's not very well established, the whole podcasting format.",
      "id": "ep_60_ut_23"
    },
    {
      "end": 356160,
      "speaker": "Moritz Stefaner",
      "start": 331554,
      "text": "It's also wonky and all proprietary. And even Apple who tried to improve the formats for a while, they are now not supporting their own features anymore. It's very confusing. So yeah, bear with us there, but we just try to give you more material as you listen to be able to follow what we're talking about. I think that's the main motivation there.",
      "id": "ep_60_ut_24"
    },
    {
      "end": 371766,
      "speaker": "Enrico Bertini",
      "start": 356352,
      "text": "Yep. And you now can also join our mailing list or newsletter, whatever you want to call it, and you will be receiving updates directly from us directly on your inbox. What else?",
      "id": "ep_60_ut_25"
    },
    {
      "end": 399824,
      "speaker": "Moritz Stefaner",
      "start": 371870,
      "text": "Basically the blog post, because we had this question if there is exclusive content on the mailing list. I think that's a good idea, though, now that I say it. But in principle, we just push out the blog post. It's just that. Also, again today, it's so unclear how people actually get notified of new stuff. Nobody reads RSS feeds anymore, I guess. And so some people are on Twitter, others have a podcatcher. But this could be a third way of how you can learn about a new episode. Just get an email.",
      "id": "ep_60_ut_26"
    },
    {
      "end": 439484,
      "speaker": "Enrico Bertini",
      "start": 400324,
      "text": "So one last thing I want to say about data stories is that, again, surprisingly, we never mentioned that on the show, but competition has become really high. So if you listen to data stories and you like it, and I'm sure you do, please rate us on iTunes teacher or any related podcast collector. This does actually make a difference. So if you are one of our fans, please spend just a couple of minutes to go to itunes or similar collections and rate us. That's important. That really makes a difference.",
      "id": "ep_60_ut_27"
    },
    {
      "end": 472316,
      "speaker": "Moritz Stefaner",
      "start": 439644,
      "text": "Yeah. And it's really interesting how podcasting took off the last year, right? I mean, somebody there, of course, before the wave. I mean, let's. That's clear. But now, yeah, now it sort of takes off. And there's like a whole lot of platforms. Like, I just got an email from podcast.com. never heard of them before, but they have a big podcast directory, their stitcher. They've been around for a while, but there were two or three other podcasting platforms and lots of also data related podcasts emerging. And it's kind of cool.",
      "id": "ep_60_ut_28"
    },
    {
      "end": 476424,
      "speaker": "Enrico Bertini",
      "start": 472460,
      "text": "It's kind of cool. Yeah. Do you listen to any of them?",
      "id": "ep_60_ut_29"
    },
    {
      "end": 507444,
      "speaker": "Moritz Stefaner",
      "start": 476604,
      "text": "Yeah, actually I listen more to not so tech data related stuff because I need a break at some point. But I'm aware of a couple of them. I listened into a few of them, like the talking machines. One, I didn't really follow up on that. It's probably too specific for me, or too technical maybe. I occasionally listen to our most direct competitor, Jon Schwabish, with this policy risk podcast. He has very similar guests, but also a few different ones.",
      "id": "ep_60_ut_30"
    },
    {
      "end": 510102,
      "speaker": "Enrico Bertini",
      "start": 508054,
      "text": "Also on Rad presenters, right?",
      "id": "ep_60_ut_31"
    },
    {
      "end": 524118,
      "speaker": "Moritz Stefaner",
      "start": 510238,
      "text": "He does rad presenters, but yeah, also the policy whiz podcast. And I think if you like data stories, people like these too, I would guess. Yeah, sure. Yeah, yeah, yeah. And you said you really enjoy data skeptic, right?",
      "id": "ep_60_ut_32"
    },
    {
      "end": 574898,
      "speaker": "Enrico Bertini",
      "start": 524246,
      "text": "Yeah. So out of all those new podcasts related to data, I have to say that data skeptic is the one that I don't know I enjoyed the most so far. I really like the way Kyle introduces a lot of different topics and he has kind of like a different couple of formats the same way we do. He has regular interviews, but also mini episodes explaining the basics of some data science topics. And it's just brief, very brief episodes, but very informative and fun. And one thing that I'm really jealous about is doing that with his wife, who is actually not a data expert. So that's that. I really like the format. So if you guys are interested in more data podcast, I strongly suggest you to.",
      "id": "ep_60_ut_33"
    },
    {
      "end": 577814,
      "speaker": "Moritz Stefaner",
      "start": 574946,
      "text": "I mean, the two of us are like an old couple, so.",
      "id": "ep_60_ut_34"
    },
    {
      "end": 581570,
      "speaker": "Enrico Bertini",
      "start": 580594,
      "text": "Same thing.",
      "id": "ep_60_ut_35"
    },
    {
      "end": 582090,
      "speaker": "Moritz Stefaner",
      "start": 581682,
      "text": "Same thing.",
      "id": "ep_60_ut_36"
    },
    {
      "end": 613842,
      "speaker": "Enrico Bertini",
      "start": 582122,
      "text": "Same thing here. Yeah, absolutely. Yeah. I mean, and I think we're gonna put a link on the blog post. There is so recently I have seen quite a few list of best data science related podcasts. There is a nice one on called the seven best data science and machine learning podcasts. So if you are curious about that, there are quite a few ones mentioned there, including data stories, of course.",
      "id": "ep_60_ut_37"
    },
    {
      "end": 618734,
      "speaker": "Moritz Stefaner",
      "start": 613898,
      "text": "I just wanted to ask like which, which position are we in?",
      "id": "ep_60_ut_38"
    },
    {
      "end": 624690,
      "speaker": "Enrico Bertini",
      "start": 619154,
      "text": "It's not a rank, it's not ranked. Yeah, yeah.",
      "id": "ep_60_ut_39"
    },
    {
      "end": 633460,
      "speaker": "Moritz Stefaner",
      "start": 624722,
      "text": "But they have. Yeah. They have data skeptic linear regressions I heard of never listened into partially derivative or Rayleigh data show. Yeah. So the FT. That's a good list. Cool.",
      "id": "ep_60_ut_40"
    },
    {
      "end": 634644,
      "speaker": "Enrico Bertini",
      "start": 633532,
      "text": "Yeah, it's a good list.",
      "id": "ep_60_ut_41"
    },
    {
      "end": 635264,
      "speaker": "Moritz Stefaner",
      "start": 634684,
      "text": "Yeah.",
      "id": "ep_60_ut_42"
    },
    {
      "end": 647940,
      "speaker": "Enrico Bertini",
      "start": 636324,
      "text": "I am totally sure we will see more in the future. That's growing so fast. It's actually amazing to have a podcast at this time, actually. It's really cool.",
      "id": "ep_60_ut_43"
    },
    {
      "end": 650772,
      "speaker": "Moritz Stefaner",
      "start": 648052,
      "text": "Yeah. It's the return of talk radio in a way.",
      "id": "ep_60_ut_44"
    },
    {
      "end": 651476,
      "speaker": "Enrico Bertini",
      "start": 650868,
      "text": "Oh yeah.",
      "id": "ep_60_ut_45"
    },
    {
      "end": 665624,
      "speaker": "Moritz Stefaner",
      "start": 651580,
      "text": "It's really amazing. And it's a great medium. And I mean, for me personally, I spent all day typing and reading and looking and it's so relaxing to just listen. That's just me.",
      "id": "ep_60_ut_46"
    },
    {
      "end": 670740,
      "speaker": "Enrico Bertini",
      "start": 666644,
      "text": "No, absolutely. It's the same for me. It's a great format.",
      "id": "ep_60_ut_47"
    },
    {
      "end": 673180,
      "speaker": "Moritz Stefaner",
      "start": 670852,
      "text": "And we have another great thing coming up.",
      "id": "ep_60_ut_48"
    },
    {
      "end": 673884,
      "speaker": "Enrico Bertini",
      "start": 673292,
      "text": "Yep.",
      "id": "ep_60_ut_49"
    },
    {
      "end": 707954,
      "speaker": "Moritz Stefaner",
      "start": 674004,
      "text": "People say we have the perfect faces for radio, but if you're in New York, you can also inspect our faces in real life IRL because I'll be in New York beginning of November for visualize conference. Great conference. I was there last year already and it's two days. Really packed. Two days. It's short talks, 15 to 20 minutes and really excellent people. Good conference. And we have the opportunity to do a data stories meetup as sort of a satellite event to the conference. It's kind of cool.",
      "id": "ep_60_ut_50"
    },
    {
      "end": 717710,
      "speaker": "Enrico Bertini",
      "start": 707994,
      "text": "That's great. I think you said first days of November, but I think first days of October. So it's first days of October.",
      "id": "ep_60_ut_51"
    },
    {
      "end": 720834,
      "speaker": "Moritz Stefaner",
      "start": 717822,
      "text": "Yeah. And the meetup is on Wednesday, October 7.",
      "id": "ep_60_ut_52"
    },
    {
      "end": 724494,
      "speaker": "Enrico Bertini",
      "start": 721574,
      "text": "Yep. So if you. Manhattan.",
      "id": "ep_60_ut_53"
    },
    {
      "end": 725234,
      "speaker": "Moritz Stefaner",
      "start": 724574,
      "text": "Yeah.",
      "id": "ep_60_ut_54"
    },
    {
      "end": 732310,
      "speaker": "Enrico Bertini",
      "start": 725734,
      "text": "Or plan to be in New York. Yeah. Come sign up.",
      "id": "ep_60_ut_55"
    },
    {
      "end": 734234,
      "speaker": "Moritz Stefaner",
      "start": 732502,
      "text": "Yeah. It's only $5.",
      "id": "ep_60_ut_56"
    },
    {
      "end": 735646,
      "speaker": "Enrico Bertini",
      "start": 735014,
      "text": "Yep.",
      "id": "ep_60_ut_57"
    },
    {
      "end": 771584,
      "speaker": "Moritz Stefaner",
      "start": 735750,
      "text": "Yep. It's a fair price in my view. Yeah. It's basically just to make sure that everybody who signs up actually shows up. We still don't know what we do there. So we will be around. Some of you will be around. Then we need to figure out what we do. So we have some ideas. But if you have ideas or if you have, you can also think about questions you want to ask us or, you know, we can talk about like, past episodes or future episodes or data related stuff. Of course. So, yeah. Let us know if you have any ideas because we need to figure something out.",
      "id": "ep_60_ut_58"
    },
    {
      "end": 774424,
      "speaker": "Enrico Bertini",
      "start": 772244,
      "text": "We do have some crazy ideas, but.",
      "id": "ep_60_ut_59"
    },
    {
      "end": 777264,
      "speaker": "Moritz Stefaner",
      "start": 775304,
      "text": "But there might be crazier ones around.",
      "id": "ep_60_ut_60"
    },
    {
      "end": 779604,
      "speaker": "Enrico Bertini",
      "start": 777344,
      "text": "Yeah, yeah, exactly. Yeah.",
      "id": "ep_60_ut_61"
    },
    {
      "end": 813594,
      "speaker": "Moritz Stefaner",
      "start": 780104,
      "text": "Anyways, could be good. We did this once at Viz conference. It was just nice to see, like, the listeners and what they, you know, it was good to hear, like, what they enjoy, what they don't enjoy. You know, how they came to listen to the show. For us, it makes it much more graspable. Right. Like we're just talking into the void here, and then somebody writes something on Twitter, you know, something like this. But we never have this direct contact with the listeners. And that's, it's just nice. It's also a bit awkward, obviously, but it also dies to actually meet in real life.",
      "id": "ep_60_ut_62"
    },
    {
      "end": 818034,
      "speaker": "Enrico Bertini",
      "start": 814854,
      "text": "Yeah, yeah, I agree. Seeing some faces is a good thing.",
      "id": "ep_60_ut_63"
    },
    {
      "end": 821474,
      "speaker": "Moritz Stefaner",
      "start": 819534,
      "text": "Yeah, I guess.",
      "id": "ep_60_ut_64"
    },
    {
      "end": 831358,
      "speaker": "Enrico Bertini",
      "start": 824694,
      "text": "I mean, it's hard to realize that listeners are actually out there. They're real people we can actually talk.",
      "id": "ep_60_ut_65"
    },
    {
      "end": 850786,
      "speaker": "Moritz Stefaner",
      "start": 831406,
      "text": "To with hands, legs, everything. Yeah, yeah. No, and for us, it's good Feedback. So if you. Yeah, you can come up, talk to us, and I'm sure it will be entertaining and informative to ours. It's at least how they announced it. So we'll see if we can live up to that.",
      "id": "ep_60_ut_66"
    },
    {
      "end": 851774,
      "speaker": "Enrico Bertini",
      "start": 850970,
      "text": "Yep.",
      "id": "ep_60_ut_67"
    },
    {
      "end": 889032,
      "speaker": "Moritz Stefaner",
      "start": 852234,
      "text": "Relatedly, we also have ask us anything session coming up on Reddit. So you might have seen there's a few people. Like, the Data is beautiful Subreddit, which is a great place for Dataverse. Anyways. And yeah, they have this new series of ask me anythings Ama's. And there was, who was there? Robert Kosara, Mike Bostock, Tamara Munzner. Tamara did one. So basically Data stories crowd. Anyways, as you can see, Santiago will do one next week.",
      "id": "ep_60_ut_68"
    },
    {
      "end": 889808,
      "speaker": "Enrico Bertini",
      "start": 889048,
      "text": "Santiago, yeah.",
      "id": "ep_60_ut_69"
    },
    {
      "end": 909234,
      "speaker": "Moritz Stefaner",
      "start": 889856,
      "text": "And we will do one in November. So if you have any, like, smart questions you want to ask us? Or even dumb ones or dumb ones or tricky ones, like. Yeah, whatever you can come up with. So you have two months to now formulate them in a nice way and then we will be there to answer them.",
      "id": "ep_60_ut_70"
    },
    {
      "end": 912914,
      "speaker": "Enrico Bertini",
      "start": 910654,
      "text": "That's great. I'm looking forward to it.",
      "id": "ep_60_ut_71"
    },
    {
      "end": 920394,
      "speaker": "Moritz Stefaner",
      "start": 913334,
      "text": "Yeah, I guess I too. I'm not sure. I never did it. I think it could be super stressful to do these things. You have to type a lot in short time, right?",
      "id": "ep_60_ut_72"
    },
    {
      "end": 925290,
      "speaker": "Enrico Bertini",
      "start": 921114,
      "text": "Yeah, yeah, but I don't know, I think it's a new format again. I'm so fascinated.",
      "id": "ep_60_ut_73"
    },
    {
      "end": 943042,
      "speaker": "Moritz Stefaner",
      "start": 925322,
      "text": "I just hope I don't get into another Internet fight. I have a tendency to get involved into these endless debates. Oh, man. You need to make sure I don't get caught up in something. Yeah, the Reddit police.",
      "id": "ep_60_ut_74"
    },
    {
      "end": 946214,
      "speaker": "Enrico Bertini",
      "start": 943178,
      "text": "Yeah, let's see what happens.",
      "id": "ep_60_ut_75"
    },
    {
      "end": 950818,
      "speaker": "Moritz Stefaner",
      "start": 946554,
      "text": "Yeah, I'll just unplug my Internet in case it gets too bad.",
      "id": "ep_60_ut_76"
    },
    {
      "end": 958614,
      "speaker": "Enrico Bertini",
      "start": 950986,
      "text": "Yeah, exactly. So shall we talk more about some of our recent projects?",
      "id": "ep_60_ut_77"
    },
    {
      "end": 971894,
      "speaker": "Moritz Stefaner",
      "start": 958954,
      "text": "Yeah, we thought about other people's projects, but we didn't find any interesting ones, so we thought maybe. Let's just talk about ours. They are pretty good. No, but that's terrible.",
      "id": "ep_60_ut_78"
    },
    {
      "end": 973770,
      "speaker": "Enrico Bertini",
      "start": 972674,
      "text": "Okay, say it again.",
      "id": "ep_60_ut_79"
    },
    {
      "end": 1012222,
      "speaker": "Moritz Stefaner",
      "start": 973882,
      "text": "Yeah, I'm a bad person, you know that. No, just being sarcastic. No, but I mean, for me, actually, it was like, it was a very busy end and I really. I wrapped up a few things before, like summer, and then I went into vacations, and then now suddenly all these websites pop up and get launched and, you know, it's kind of cool. It's, you know, you come back from vacations and all your stuff is online. That's kind of nice. Nice. As long as the clients don't send you emails during vacations, which some of them did, of course. Yeah. So, yeah, I can talk about a few projects. Shall I make a start? We can take turns, maybe.",
      "id": "ep_60_ut_80"
    },
    {
      "end": 1012806,
      "speaker": "Enrico Bertini",
      "start": 1012278,
      "text": "Absolutely.",
      "id": "ep_60_ut_81"
    },
    {
      "end": 1279250,
      "speaker": "Moritz Stefaner",
      "start": 1012870,
      "text": "Yeah. So the first one is still sort of in the making, but I want to nevertheless talk about it. It's kind of interesting. So it's called false positive, and I'm doing that together with Mark shepherd, who initiated the whole project, and Julian Oliver. They're both artists and scholars, but mostly artists. And. Yeah, it's a complex project. It's actually kind of hard to explain, but it deals with corporate profiling and how companies deal with data and control over networks and infrastructure and so on. And these are all topics that the three of us are pretty concerned with and interested in. And so, yeah, we're doing this art collaboration around it. It's a whole series of events, like it will be exhibited at four more places. It has been shown at Ars Electronica already, and then it tours sort of through Europe in the fall. And basically what we do is we pretend there's a new telecommunications provider called Candygram, which is like a really good name, I think. And Candygram is sort of an art company. It's a bit strange. Simply, it's never quite clear what to think of it. And the people who interact with Candygram at some point realize that Candygram keeps asking you for your email address, to sign up for something or to make a consultation or to get a service. And basically what we do is as soon as people provide their email address, is create data profiles on them. So we search on the web. What can we learn about this person in automatic ways, like scrape all the text of web pages where they appear and scrape their social media profiles and so on. And so basically, people learn at some point that Candygram knows quite a bit about them, and that sort of bleeds through all the communications with the company, and it sort of peaks in a data consultation. So you can book a date with one of the sales agents, and then they show you basically what Candygram has on you. And it's like a series of slides, like slideshow with words that are associated to you, other people that might be similar or you might know. And the most shocking thing is always a personality profile. So I'm calculating this personality profile along five different traits or five different dimensions. The big five, that's sort of a standard in psychology. And then everybody gets their data profile, personality guess, more or less. And I won't disclose too much, but I can also, the databases for this is highly speculative. Basically, what people see, half of it is more or less made up or loose speculation association, but the other half is quite accurate. And that sort of puts it into this interesting space where you don't really know what's going on and you don't really know what's, what's happening. And yeah, sometimes it's a bit hit and miss. These things are always a bit hit and miss. But for all of the people, it has always been a bit like, there was always one spooky moment for them, like, wow, how did you know that? Or, you know, like, how does the Internet know? I'm such a nervous person, you know, I tried to pretend to be normal or something like this. And, and the interesting question is, of course, like, when companies profile us and they do well, what if they are right? That's always the big fear, of course, that Google knows everything about us or things like this. But I think the much bigger problem is what if they are wrong? What if you get miscategorized because somebody has the same name as you or used your email address in fraudulent activity, or there's just a typo in the database, and then you land in a category where you don't belong and suddenly you have big problems. I think these are very real concerns or scenarios and we are playing a bit with that. Try people to help also to understand how these things work and then in the end show them a few ways of how they can maybe protect themselves or be smarter about their data, their personal data leaks.",
      "id": "ep_60_ut_82"
    },
    {
      "end": 1291634,
      "speaker": "Enrico Bertini",
      "start": 1279422,
      "text": "Yeah, absolutely. That's a great project, I think such a timely project because things are changing very fast, much faster than we can understand. Right.",
      "id": "ep_60_ut_83"
    },
    {
      "end": 1292218,
      "speaker": "Moritz Stefaner",
      "start": 1291754,
      "text": "Yeah.",
      "id": "ep_60_ut_84"
    },
    {
      "end": 1311254,
      "speaker": "Enrico Bertini",
      "start": 1292306,
      "text": "And I think it's not just a matter of. I'm wondering if you've been thinking about it. It's not just a matter of what companies can do with this data, which of course is a big concern, but also criminals. I think there is a big concern on what criminals can do with your data and how easy it is to access your data.",
      "id": "ep_60_ut_85"
    },
    {
      "end": 1315426,
      "speaker": "Moritz Stefaner",
      "start": 1311714,
      "text": "So I remember reading also identity theft and so on.",
      "id": "ep_60_ut_86"
    },
    {
      "end": 1315682,
      "speaker": "Enrico Bertini",
      "start": 1315450,
      "text": "Yeah.",
      "id": "ep_60_ut_87"
    },
    {
      "end": 1324178,
      "speaker": "Moritz Stefaner",
      "start": 1315738,
      "text": "You can buy people's profiles for like, low amounts of, like, you know, in the dozens of dollars you can buy somebody's all their online info, basically.",
      "id": "ep_60_ut_88"
    },
    {
      "end": 1324954,
      "speaker": "Enrico Bertini",
      "start": 1324226,
      "text": "Yeah, yeah.",
      "id": "ep_60_ut_89"
    },
    {
      "end": 1325986,
      "speaker": "Moritz Stefaner",
      "start": 1324994,
      "text": "And pretend you're them.",
      "id": "ep_60_ut_90"
    },
    {
      "end": 1378010,
      "speaker": "Enrico Bertini",
      "start": 1326050,
      "text": "Yeah, yeah. I mean, I remember reading some months ago this book called Future Crimes, and there is this interesting stories about a journalist who've been stolen a lot of information. And when they describe how this happened, it's crazy easy. I mean, me and you could have done it very easily. Right. So that's quite scary. Even scarier realizing that me, that I have a background in computer science and, I mean, I have a little bit of knowledge. Right. And still I was surprised by the kind of information I read there and what is possible today. So are you trying to, so I find it really interesting that you're not trying to be super accurate. So are you trying to increase awareness? So what is the main goal of the project?",
      "id": "ep_60_ut_91"
    },
    {
      "end": 1465808,
      "speaker": "Moritz Stefaner",
      "start": 1378202,
      "text": "Yeah, I mean, sure. I mean, it's an art project, so we want to leave the audience slightly puzzled and not be totally clear about what everybody wants to achieve because it's much more interesting if, if this happens somewhere else, like not in our concrete statements. Yeah, but sure. I mean, we want to. And also the project is deployed at places where there's, let's say, normal people around. So the next one will be in a shop, really. Like, there's also talk of a shopping mall where we might have a booth. And also at Electronica we had very like a whole mix of people and for them these topics are always like somehow in the news and you hear about Snowden and you hear about Amazon and you hear about Google, but it's very abstract and when it actually becomes about you and you see sort of a bit of the workings and also when it breaks and the underlying mechanisms, I think that's quite instructional and quite interesting. I mean, the problem is the personal data consultation as we do them, they are super intense and mark did such a great job of delivering them. He was like, really the data doctor know in a way, but that doesn't scale. And so now we're thinking about ways how we can achieve the same effects in a different way for a broader range of people. But yeah, it's an ongoing sort of investigation.",
      "id": "ep_60_ut_92"
    },
    {
      "end": 1470592,
      "speaker": "Enrico Bertini",
      "start": 1465936,
      "text": "That's nice. Can you disclose any of the mechanisms that you have behind the scenes?",
      "id": "ep_60_ut_93"
    },
    {
      "end": 1545820,
      "speaker": "Moritz Stefaner",
      "start": 1470688,
      "text": "Yeah, no, I will definitely write like a technical blog post in principle. It's a lot of python. I use a service called full contact. It's actually quite pricey, but what it does really well is resolve an email address to all the social media profiles that are associated with that email address. And that's hard work. It's possible, but it's really hard work, so I'm happy to pay for that. And it also gives you things like hometown and gender and estimated age of the person, things like this. And so then once I have the seeds data set, I do a bit of text analysis, a bit of, I don't know, machine learning things. Yeah. Come up with these profiles and then it's only web technologies in the front end, like revealjs, to have like a slideshow of different, like HTML based contents and reactjs D3. So, yeah, it's a wild mixture of. Wild mix of existing libraries, as usual, but I'll do a write up on that. That has been a journey in itself. And it's not quite finished yet because. Because it's hard to do something really. That's the other thing. It's really hard to do something that does automatic stuff just based on public information and your email address.",
      "id": "ep_60_ut_94"
    },
    {
      "end": 1546916,
      "speaker": "Enrico Bertini",
      "start": 1545932,
      "text": "Yeah, exactly.",
      "id": "ep_60_ut_95"
    },
    {
      "end": 1564476,
      "speaker": "Moritz Stefaner",
      "start": 1547020,
      "text": "The thing is, people assume, well, it's so easy to find out anything anyways. Everything's on Facebook, but Facebook doesn't give it to you. Yeah, it's actually kind of difficult to actually achieve that big reveal that people expect in that situation. Sometimes it works, sometimes it doesn't.",
      "id": "ep_60_ut_96"
    },
    {
      "end": 1567316,
      "speaker": "Enrico Bertini",
      "start": 1564540,
      "text": "So, yeah, nice.",
      "id": "ep_60_ut_97"
    },
    {
      "end": 1573784,
      "speaker": "Moritz Stefaner",
      "start": 1567500,
      "text": "Yeah, interesting project. Cost me a lot of nerves and everybody involved, but it's been quite rewarding too.",
      "id": "ep_60_ut_98"
    },
    {
      "end": 1578348,
      "speaker": "Enrico Bertini",
      "start": 1575804,
      "text": "Some of the best projects have like this. Yeah.",
      "id": "ep_60_ut_99"
    },
    {
      "end": 1594834,
      "speaker": "Moritz Stefaner",
      "start": 1578436,
      "text": "I mean, yeah. And it's so, like speculative and we wanted to do a lot with like actual network infrastructure and, you know, cell towers and so on, but base station, cell phone, base stations and so on. But these things are hard. I mean. I mean, it's waves, not particles.",
      "id": "ep_60_ut_100"
    },
    {
      "end": 1596634,
      "speaker": "Enrico Bertini",
      "start": 1595374,
      "text": "Yeah, yeah, yeah.",
      "id": "ep_60_ut_101"
    },
    {
      "end": 1608086,
      "speaker": "Moritz Stefaner",
      "start": 1597294,
      "text": "Waves are tricky. And also telecommunications technology is tricky. And so, yeah, all of that has been hard, but, yeah, it's a good project. Yeah.",
      "id": "ep_60_ut_102"
    },
    {
      "end": 1608994,
      "speaker": "Enrico Bertini",
      "start": 1608270,
      "text": "Nice.",
      "id": "ep_60_ut_103"
    },
    {
      "end": 1720204,
      "speaker": "Moritz Stefaner",
      "start": 1609374,
      "text": "This is a great time to take a little break and talk about our sponsor. This week, data stories is brought to you by Qlik, who allows you to explore the hidden relationships within your data that lead to meaningful insight. Let your instincts lead the way to create personalized visualizations and dynamic dashboards with Qlik sense, which you can download for free at Qlik Datastories. That's Qlik Datastories. And, you know, last time I told you a bit about Qlik sense 2.0, the new features that it brings. Also how Qlik was named a top ten innovative growth company by Forbes. This time I'd like to tell you a bit about three blog posts, posts on the click blog that I found really interesting. They're from visualization advocate Patrik Lundblad and he covers really the basics of data visualization really well in these three posts. So the first one is on data attributes. What types of data could we have? How are they different? What makes them special? The second part covers which visual encoding can we then choose for these data types? Which types of graphical variables can be used to express information? And the third part is about, well, what do you actually want to show? Like what's the purpose of your chart and which chart type do you pick accordingly? And I think these three blog posts, they present really nicely the foundations of data visualization. I think it's great that Qlik takes care of also educating the users a bit on what makes a good chart and how to best use data visualization, and they continue to do so. So if you want to try out their new product, Qlik sense 2.0, give it a try at Qlik Datastories. That's q l I K Datastories. And now back to the show. How about you? You've been involved in a few things too.",
      "id": "ep_60_ut_104"
    },
    {
      "end": 1788118,
      "speaker": "Enrico Bertini",
      "start": 1721024,
      "text": "Yes. So one of the things I want to talk about is a project that we have, an ongoing project that we have in collaboration with ProPublica here in New York, ProPublica is a newsroom. They do investigative journalism. We actually had Scott Klein on the show some time ago, so our listeners should know something about ProPublica. They do a lot of investigative journalism and then they publish interesting Internet applications and infographics and visualizations. So it's interesting what they do. And so what we started doing together is to look into very large sets of Yelp reviews, mainly on the data feed they produce on healthcare. So this includes typically doctors, nurses and hospitals and so on. So anything.",
      "id": "ep_60_ut_105"
    },
    {
      "end": 1790478,
      "speaker": "Moritz Stefaner",
      "start": 1788166,
      "text": "So did you filter it for that like from the start?",
      "id": "ep_60_ut_106"
    },
    {
      "end": 1800438,
      "speaker": "Enrico Bertini",
      "start": 1790526,
      "text": "Like no, Yelp gives us directly only this kind of feed. They have different categories and they, and they provide only this category to us.",
      "id": "ep_60_ut_107"
    },
    {
      "end": 1801406,
      "speaker": "Moritz Stefaner",
      "start": 1800526,
      "text": "Got it.",
      "id": "ep_60_ut_108"
    },
    {
      "end": 1825094,
      "speaker": "Enrico Bertini",
      "start": 1801590,
      "text": "But that's what we are interested in. That's what Probablica is interested in. And I think historically they've been working a lot on medic, anything related to medical. So I think they have an application where you can see how much money your doctor takes from pharmaceutical companies. You can literally type your doctor's name and you get a full list of.",
      "id": "ep_60_ut_109"
    },
    {
      "end": 1827474,
      "speaker": "Moritz Stefaner",
      "start": 1826114,
      "text": "That's kind of interesting.",
      "id": "ep_60_ut_110"
    },
    {
      "end": 1837734,
      "speaker": "Enrico Bertini",
      "start": 1827594,
      "text": "Yeah, yeah, yeah. And recently they published another piece on, I think, quality of surgeons and how many mistakes surgeons make.",
      "id": "ep_60_ut_111"
    },
    {
      "end": 1840266,
      "speaker": "Moritz Stefaner",
      "start": 1838234,
      "text": "That's good to know too. Yeah.",
      "id": "ep_60_ut_112"
    },
    {
      "end": 1846238,
      "speaker": "Enrico Bertini",
      "start": 1840290,
      "text": "If you're planning some surgery, you'd better check the name of your doctor there.",
      "id": "ep_60_ut_113"
    },
    {
      "end": 1850438,
      "speaker": "Moritz Stefaner",
      "start": 1846326,
      "text": "But a surgeon has only 3.5 stars on Yelp. You might reconsider.",
      "id": "ep_60_ut_114"
    },
    {
      "end": 1888824,
      "speaker": "Enrico Bertini",
      "start": 1850566,
      "text": "Yeah, you know, it's not as simple as this. And this is where, this is where I believe one of the reasons why this project is interesting because what we are doing is to build interactive user interfaces for them to look into this very large set of reviews. So right now we have almost 1.5 million of reviews only considering the healthcare data. So one of the first steps, we developed this tool that we call revex and which stands for review Explorer, guess what? And.",
      "id": "ep_60_ut_115"
    },
    {
      "end": 1893692,
      "speaker": "Moritz Stefaner",
      "start": 1890684,
      "text": "Scientists and names, we're not the.",
      "id": "ep_60_ut_116"
    },
    {
      "end": 1940464,
      "speaker": "Enrico Bertini",
      "start": 1893708,
      "text": "Best with that, but we have this initial interface where you can basically, the main idea is to use is to have an interface through which they can very quickly create data queries so that they want to single out reviews with special combination of parameters, right? So for instance, reviews that contain the name of a specific drug and have one star, and then you can see the distribution across other dimensions, like who are the providers, in what category and so on. And then for every single search you have a summary of the results through some tag clouds and then you can see the documents basically.",
      "id": "ep_60_ut_117"
    },
    {
      "end": 1944668,
      "speaker": "Moritz Stefaner",
      "start": 1942244,
      "text": "So it's a faceted search, it's basically.",
      "id": "ep_60_ut_118"
    },
    {
      "end": 1958318,
      "speaker": "Enrico Bertini",
      "start": 1944716,
      "text": "A faceted search kind of tool, and it's nothing too innovative, but it's really useful. And we are very much interested in understanding how people use these kind of tools to derive new insights and knowledge.",
      "id": "ep_60_ut_119"
    },
    {
      "end": 1970278,
      "speaker": "Moritz Stefaner",
      "start": 1958486,
      "text": "And it's amazingly fast. I was really blown away because it's millions of reviews and you have a demo with a million reviews on the website and everything just, it's there, you know, you click there. It's kind of amazing.",
      "id": "ep_60_ut_120"
    },
    {
      "end": 1987044,
      "speaker": "Enrico Bertini",
      "start": 1970406,
      "text": "Yeah, yeah, yeah. This is thanks to one of my students. His name is Christian Felix Dasilva. He's an amazing programmer, plus he has a very nice aesthetic sense, which honestly is pretty rare in computer science students. So yeah, he's amazing.",
      "id": "ep_60_ut_121"
    },
    {
      "end": 1992924,
      "speaker": "Moritz Stefaner",
      "start": 1988184,
      "text": "And how did you build the backend? Like the search indexing, he used elasticsearch.",
      "id": "ep_60_ut_122"
    },
    {
      "end": 2039264,
      "speaker": "Enrico Bertini",
      "start": 1994064,
      "text": "And the rest is just D3 JavaScript and angular J's. Yeah, as I said, I mean, it's a simple tool, but it's really, really powerful. And what is really interesting from my point of view is understanding how these tools help people derive new knowledge and insights. And I mean, honestly, at least from the point of view of an academic like me, it's stunning to see people using this tool. They literally use this tool to search for specific doctors. And they called, right, so they have the tool in front of them. They spot a doctor, they search for the number and call the doctor last week.",
      "id": "ep_60_ut_123"
    },
    {
      "end": 2041268,
      "speaker": "Moritz Stefaner",
      "start": 2039804,
      "text": "Tell me more about it.",
      "id": "ep_60_ut_124"
    },
    {
      "end": 2176242,
      "speaker": "Enrico Bertini",
      "start": 2041396,
      "text": "That's pretty amazing, right? Let's talk about actionable tools. That's amazing for me. I mean, being able to work on something that is so actionable is something really, really rewarding from my point of view. Nice. So they already published one article thanks to the things that they found through the using the tool. So if you go to the link that I will put on the blog post to the revax page, you can see you have an overview of the interface. There is a video showing the interface, how it works when you interact with it. There is also a little demo that is based on public data that Yelp published online. So this is not the data that actually, actually the folks at propublica use, but you can get a sense of how the tool works. And another very interesting thing, there is a, as I was saying, there is an article that they published on NPR. It's called on Yelp, doctors get reviewed like restaurants, and it rankles. And I think this is what I mean. If you're interested in the topic, I suggest you to read the article because it gives you a sense of how complex this space of review analysis is. It's not just spotting bad doctors and assuming that they are really bad. There is a whole interplay between what doctors need and what patients need. What are expectations of both sides. I think it's a very interesting space where a lot of different things are happening and it's very interesting. Right. Because you can. So let me just tell you one thing. Do you want your doctor to be, to actually to please you or to cure you? Right. So here there is a really interesting problem because in a way, you can clearly see that people give good reviews to doctors that take care of things that are not necessarily highly related to your health. Right. You can very clearly make an example of a doctor who is doing something that is not pleasing to you, but it's the right thing to do at that time.",
      "id": "ep_60_ut_125"
    },
    {
      "end": 2202136,
      "speaker": "Moritz Stefaner",
      "start": 2176418,
      "text": "Right. Yeah. Or, I mean, many, let's say alternative medicine, you know, successes, I think. I think partly just due to that people get attention and somebody actually listens to them and, you know, that makes them feel better already. You know, this is what they don't get at the normal medical doctor, which is bad. So, you know, these doctors should learn from that. But at the same time.",
      "id": "ep_60_ut_126"
    },
    {
      "end": 2236250,
      "speaker": "Enrico Bertini",
      "start": 2202330,
      "text": "Yeah. And of course. Of course you spot really bad doctors. Right. Some of them are really bad that you can spot them using the tool, which is scary. Right. But I think it's an interesting space where the interplay between physicians, doctors and patients and how the relationship is changing thanks to these new tools. It's very interesting. It's a world that has been. That is changing a lot thanks to tools like Yelp and other related review systems.",
      "id": "ep_60_ut_127"
    },
    {
      "end": 2245714,
      "speaker": "Moritz Stefaner",
      "start": 2236362,
      "text": "Yeah. But it's an interesting question what effect that has, like, all this online reviewing and, I mean, we can see how it changes the restaurant scene, for sure.",
      "id": "ep_60_ut_128"
    },
    {
      "end": 2246370,
      "speaker": "Enrico Bertini",
      "start": 2245794,
      "text": "Oh, yeah.",
      "id": "ep_60_ut_129"
    },
    {
      "end": 2257106,
      "speaker": "Moritz Stefaner",
      "start": 2246442,
      "text": "And, you know, if it goes to doctors and every type of service you get, it's. Yeah, it's. If everything is a chase for the five stars review, you know, it's.",
      "id": "ep_60_ut_130"
    },
    {
      "end": 2257802,
      "speaker": "Enrico Bertini",
      "start": 2257210,
      "text": "Exactly.",
      "id": "ep_60_ut_131"
    },
    {
      "end": 2259346,
      "speaker": "Moritz Stefaner",
      "start": 2257858,
      "text": "That can be problematic, too.",
      "id": "ep_60_ut_132"
    },
    {
      "end": 2272476,
      "speaker": "Enrico Bertini",
      "start": 2259450,
      "text": "It can be problematic. Yeah, it can. Right. But at the same time, you can argue that it's really good that you can see reviews. Right? I mean, it's much more freedom, much more democracy. So, yeah, it's amazing.",
      "id": "ep_60_ut_133"
    },
    {
      "end": 2286796,
      "speaker": "Moritz Stefaner",
      "start": 2272500,
      "text": "And also, when I was looking for a doctor, I posted on, like, a local group on Facebook and just got ten different opinions and. But, you know, five of them agreed that, like, one doctor is pretty good. And I was like, yeah, let's try this one out. And he's pretty good, you know, so.",
      "id": "ep_60_ut_134"
    },
    {
      "end": 2287854,
      "speaker": "Enrico Bertini",
      "start": 2286940,
      "text": "Yeah, yeah.",
      "id": "ep_60_ut_135"
    },
    {
      "end": 2301450,
      "speaker": "Moritz Stefaner",
      "start": 2289594,
      "text": "Wisdom of the crowds. Very nice. And will you do, like, a case study paper on how people use it, or how do you track how propublica uses it, or how do you document that?",
      "id": "ep_60_ut_136"
    },
    {
      "end": 2350102,
      "speaker": "Enrico Bertini",
      "start": 2301602,
      "text": "So right now we have something that should be a little, little paper that should come out sometime in October in, how is it called? Computational journalism conference. But this is just an initial step. This is more like telling the story of what happened and how the tool works. But I think one of the ideas that we have in mind, we have two ideas. One is, as I was saying at the beginning, using this tool as a way to better understand how people discover information with this kind of data interfaces. And another one, of course, is that the more we work with this kind of people, the more we uncover new needs that are not covered by existing tools. So it's more like a probe to uncover interesting problems, right?",
      "id": "ep_60_ut_137"
    },
    {
      "end": 2354222,
      "speaker": "Moritz Stefaner",
      "start": 2350158,
      "text": "Yeah. And if journalists can actually develop new types of stories based on these thoughts.",
      "id": "ep_60_ut_138"
    },
    {
      "end": 2354846,
      "speaker": "Enrico Bertini",
      "start": 2354318,
      "text": "Exactly.",
      "id": "ep_60_ut_139"
    },
    {
      "end": 2355518,
      "speaker": "Moritz Stefaner",
      "start": 2354910,
      "text": "That's great.",
      "id": "ep_60_ut_140"
    },
    {
      "end": 2356214,
      "speaker": "Enrico Bertini",
      "start": 2355606,
      "text": "Yeah, yeah.",
      "id": "ep_60_ut_141"
    },
    {
      "end": 2361314,
      "speaker": "Moritz Stefaner",
      "start": 2356254,
      "text": "Nice, good stuff. It seems like you're actually doing something useful. That's.",
      "id": "ep_60_ut_142"
    },
    {
      "end": 2369350,
      "speaker": "Enrico Bertini",
      "start": 2364374,
      "text": "The biggest achievement of 2015. I did something useful.",
      "id": "ep_60_ut_143"
    },
    {
      "end": 2377814,
      "speaker": "Moritz Stefaner",
      "start": 2369382,
      "text": "Somebody used it because you never know. And if you actually see somebody like, you know, like using your interface for real, I think that's great.",
      "id": "ep_60_ut_144"
    },
    {
      "end": 2422534,
      "speaker": "Enrico Bertini",
      "start": 2377894,
      "text": "No, but I mean, let me say that on a more serious note, I think this is really important for visualization in general. Right? Yeah, yeah. I mean, we have amazing examples of people who have done super useful visualization, made super useful visualization tools. Like, I don't know, I think about D. Three, of course, is a clear example, or, I don't know, other libraries or tools. But in general, I think thinking about usefulness in visualization is an important topic, and it's not just usefulness. Right. Anything related to data. Right. So, yeah. So what is next on your side?",
      "id": "ep_60_ut_145"
    },
    {
      "end": 2473804,
      "speaker": "Moritz Stefaner",
      "start": 2424474,
      "text": "Yeah, a couple of things coming up. So I have one more project I just finished. I wanted to talk about inclusive growth report for the World Economic Forum. Challenging, challenging project, but very interesting. And I had the chance to work with Stephanie Posavec on that, who was also on the show. So it's the first time we did a design project together, and it went really well. So, you know, you never know. It's like, are we compatible or not? The approaches. But it was great fun. Yeah, sure. No, it was great fun and very productive and. Yeah, super cool. But the funniest thing is like, the outcome is actually like what you would exactly expect if you put me and Stephanie in a room. Super, like, organic, nice colors, but also, like slightly geometric.",
      "id": "ep_60_ut_146"
    },
    {
      "end": 2475148,
      "speaker": "Enrico Bertini",
      "start": 2473964,
      "text": "So cliche.",
      "id": "ep_60_ut_147"
    },
    {
      "end": 2680838,
      "speaker": "Moritz Stefaner",
      "start": 2475316,
      "text": "And actually, we tried different things, but somehow now it's again like a leaf of a tree and it's like super organic, what can you do? But it works really well and it's a cool project. So you can check out the website, I'll give it a link. And the scorecards are the most interesting part, I think. So each country has a scorecard like Germany and so on, and you can see how each country performs. And these are pretty tight and neat and yeah, and yeah, thanks to Stephanie also for the great, great work there. And I learned a lot of technical stuff on that project because I was working also with nine elements. Great company, good people, and Matthias the coder there, he said up this super crazy, crazy framework and I think I've seen the future. I mean we'll see how it plays out. But for me it was like really a revelation in terms of how you can organize a web project and how to set everything up. And well, basically we used ES six, which is ECMAScript six, which is the success of JavaScript. It's a more sane version of JavaScript. The people who used actionscript three will recognize a lot of stuff. It's actually kind of similar, which is fun. And this helps a lot with organizing your code in a good way and having a really concise code. And it plays really well. We used Babel and that plays really well with react JS. React JS is a framework from Facebook, which has become hugely popular over the last year, and these two things play together really well. And everything was split up into individual modules. And also the CSS code that corresponded to a user interface element was bundled together with that. So you have very little dependencies. Everything's very neatly packaged and immediately accessible. I was very impressed. So it's great to work like that. And so I'm transitioning now to es a six, and I can really recommend that to everybody who's frustrated with JavaScript, as you should be. And you get to think in new ways, so you think much more in terms of mix ins and modules, rather than inheritance and big frameworks. It's much more like little parts neatly combined. And I like that style anyways. And now I'm working on two projects with Pixie J's and Pixie Js. Dominikus, another guest, it's the old data stories crowd, obviously. He pointed me to that and he used it for this year's better life index for the OCD. And it's a really nice rendering framework where you write code, again very similar to flash. This is probably why I like it so much. So you write like an abstract scene graph description of how your graphic should look like and behave. And it can be rendered in WebGl, which is super fast, or canvas, which is available anywhere else. And so you have a nice platform independent way of doing super high performance graphics. Just working now on a spinny globe thing with more than 4000 data points on particles and everything's being projected and drawn in real time and it's like basically at 60 FPS. So I'm happy.",
      "id": "ep_60_ut_148"
    },
    {
      "end": 2682742,
      "speaker": "Enrico Bertini",
      "start": 2680966,
      "text": "Nice. Yes, nice.",
      "id": "ep_60_ut_149"
    },
    {
      "end": 2696900,
      "speaker": "Moritz Stefaner",
      "start": 2682798,
      "text": "Yeah, so, and these things, they make everything that I did like half a year ago look really old. And it's like web development is so crazy. It's like every three months I basically throw away all my stuff and start from scratch. That's great.",
      "id": "ep_60_ut_150"
    },
    {
      "end": 2701284,
      "speaker": "Enrico Bertini",
      "start": 2696932,
      "text": "It's crazy. I mean, technology is changing so freaking fast.",
      "id": "ep_60_ut_151"
    },
    {
      "end": 2715024,
      "speaker": "Moritz Stefaner",
      "start": 2701404,
      "text": "Yeah, but es six and react are definitely here to stay. Also, if you say angular, forget angular, learn react if you have a chance. And es six and you should be safe for at least nine months, I would say.",
      "id": "ep_60_ut_152"
    },
    {
      "end": 2736608,
      "speaker": "Enrico Bertini",
      "start": 2716404,
      "text": "So. Do you have any kind of like internal rule on when, how to adapt some new technology? I mean, you work with this all the time, right? I'm sure you are exposed to a lot of new libraries and ways to implement stuff. How do you decide when to switch? Because of course there is always some cost associated with switching, right.",
      "id": "ep_60_ut_153"
    },
    {
      "end": 2806344,
      "speaker": "Moritz Stefaner",
      "start": 2736656,
      "text": "It's hard. I mean, I think with all these things, the community is the most important thing. So however, the website looks like, just look who's, who's behind that? Like who's behind the projects are these people who have been around for a while and who are really serious about this stuff. Because many, many projects on GitHub end at a 90% completion state, more or less, and nobody takes care of the rest. And you need to make sure you don't put all your money on one of those projects. So I'd give it some time and see if there's a solid community around at all. But you can be wrong. A lot of people thought angular is a great idea and then got super frustrated in projects. And react basically was, react and angular were like equal competitors for a while. And now it's so clear. Yeah, react has sort of made that race. So, yeah, I don't try to be the very early wave, but be second, just second wave. Yeah, maybe three months behind the curve and then you at least avoid the very bad mistakes.",
      "id": "ep_60_ut_154"
    },
    {
      "end": 2810894,
      "speaker": "Enrico Bertini",
      "start": 2808124,
      "text": "Yeah, yeah, yeah. It's a wild, wild world.",
      "id": "ep_60_ut_155"
    },
    {
      "end": 2821654,
      "speaker": "Moritz Stefaner",
      "start": 2811674,
      "text": "And I spend a few days often like refactoring something or like rewriting something to fit a new framework and then you realize it's crap. That's super frustrating, but I mean, what can you do?",
      "id": "ep_60_ut_156"
    },
    {
      "end": 2833298,
      "speaker": "Enrico Bertini",
      "start": 2822274,
      "text": "Yeah. So can you tell us more about the project itself, about excellence networks, the inclusive growth? Yeah, yeah, yeah.",
      "id": "ep_60_ut_157"
    },
    {
      "end": 2923934,
      "speaker": "Moritz Stefaner",
      "start": 2833426,
      "text": "I mean it's one of those reports. So I do a lot of these reports type things where you have countries and, and you learn something about those countries, like a default project category, but this one's quite nice. So it's about inclusive growth. So it means like how the economic growth in a country, how does it really fit for everybody in a country? Or do just little small amount of people profit from economic growth? So it's about equality and inclusiveness and so on. And the team measured loads of data, really it's hundreds of indicators that are aggregated into different categories, super much data. And the problem is we don't really provide a really high level ranking or a big picture view because it's sort of hard to come up with a definite single ranking. So we focus more on the individual country views and you can compare your country to your peer countries, things like this. But I mean, that's sometimes a problem with these types of projects, is it's hard to make definite statements, who's best or who's worst. You know, what you would like to see maybe from a design point of view, but it's just from a political point of view, not adequate to do these types of things. Sure, yeah, but yeah, I think we did a great job on that.",
      "id": "ep_60_ut_158"
    },
    {
      "end": 2929910,
      "speaker": "Enrico Bertini",
      "start": 2924734,
      "text": "So are you working on any other similar kind of projects?",
      "id": "ep_60_ut_159"
    },
    {
      "end": 2997394,
      "speaker": "Moritz Stefaner",
      "start": 2930102,
      "text": "Yeah, in some way, always. But right now I have a little break from these types of activities. I have two projects I'm really excited about. One is a wind forecast project. It's gonna take a while until it comes out. I'm pretty far already, but the data side needs to be there as well. But that's cool. Like real climate scientists making wind predictions, it's not about visualizing uncertainty and finding good visual models for wind predictions. So that's super fun and I'm really excited about that. And the second one is a big ambient visualization for a company that does cybersecurity. So I visualize all the hosts they're running and the attacks they are being, who's attacking who, how much, and so there's loads of stuff I can play with and they want something really cool too. So I think these two projects, they're gonna keep me busy for the fall, pretty much, yeah. How about you? What are you up to?",
      "id": "ep_60_ut_160"
    },
    {
      "end": 3112924,
      "speaker": "Enrico Bertini",
      "start": 2998174,
      "text": "So another thing I want to briefly talk about is that we just started a new project on human rights visualization. That's really nice. We got some funding from Cartoon foundation. Thanks, Carter foundation. I'm really excited because this is in collaboration with a couple of colleagues from NYU and especially with Meg Satterthwaite from NYU law and Odette nov from my same school, polytechnic school. And it's something we've been working together for quite a while, but now we have a project funded and a lot of new practical ideas and ways to make progress in this area. And it's really, really, really interesting. And again, this is another space where I believe we can have a lot of impact beyond doing exclusively academic work. So here is a nice project where I believe we can do both interesting work and at the same time having practical impact. And it's really interesting because human rights traditionally is a subject or an area where people didn't really work with quantitative data. Right. It's mostly about reading and writing and reading long reports. Lots of qualitative data performed by lawyers. Right. I don't want to say anything against lawyers, but I think they're not traditionally, they're not quantitative people. But of course this is changing as every other area in the world is changing and we are moving towards a lot more data, a lot more quantitative data. But human rights has very specific problems there. So one common problem, for instance, is that data is incomplete.",
      "id": "ep_60_ut_161"
    },
    {
      "end": 3113232,
      "speaker": "Moritz Stefaner",
      "start": 3113004,
      "text": "Right.",
      "id": "ep_60_ut_162"
    },
    {
      "end": 3155794,
      "speaker": "Enrico Bertini",
      "start": 3113268,
      "text": "Right. It's almost always incomplete. And they have lots of interesting rules. Human rights organizations have very interesting rules on what to show, what not to show and how to show it. Right. And this is developing all the time. And it's a very, very interesting space and very unique problems there. So I don't know, for instance, showing number of murders in a specific region on a map is problematic because you might very well just quote unquote, just represent the way data has been sampled. Right.",
      "id": "ep_60_ut_163"
    },
    {
      "end": 3156290,
      "speaker": "Moritz Stefaner",
      "start": 3155834,
      "text": "Yeah.",
      "id": "ep_60_ut_164"
    },
    {
      "end": 3161594,
      "speaker": "Enrico Bertini",
      "start": 3156402,
      "text": "And most of the time it's like that. That's the only thing that you are showing right now.",
      "id": "ep_60_ut_165"
    },
    {
      "end": 3166458,
      "speaker": "Moritz Stefaner",
      "start": 3161634,
      "text": "The first thing is always you show primarily population density, like where do people live.",
      "id": "ep_60_ut_166"
    },
    {
      "end": 3167930,
      "speaker": "Enrico Bertini",
      "start": 3166506,
      "text": "Yeah, that's another thing. Right.",
      "id": "ep_60_ut_167"
    },
    {
      "end": 3189434,
      "speaker": "Moritz Stefaner",
      "start": 3168002,
      "text": "Yeah, that's the, the first thing that goes wrong. And the second then is. Yeah. What do we measure actually, where. And that's also the same problem with these types of inclusive growth projects and so on. It's like where it matters the most, like, you know, in Africa and Asia and so on. You know, it's really hard to get reliable numbers because a lot of the data is self reported.",
      "id": "ep_60_ut_168"
    },
    {
      "end": 3190382,
      "speaker": "Enrico Bertini",
      "start": 3189774,
      "text": "Yeah.",
      "id": "ep_60_ut_169"
    },
    {
      "end": 3190950,
      "speaker": "Moritz Stefaner",
      "start": 3190478,
      "text": "And.",
      "id": "ep_60_ut_170"
    },
    {
      "end": 3206296,
      "speaker": "Enrico Bertini",
      "start": 3191062,
      "text": "Yeah, exactly. You know. Yeah, it's problematic. But at the same time, human rights. People feel like there is, there are a lot of opportunities there to do amazing things with visualization. Right?",
      "id": "ep_60_ut_171"
    },
    {
      "end": 3206984,
      "speaker": "Moritz Stefaner",
      "start": 3206360,
      "text": "Yeah.",
      "id": "ep_60_ut_172"
    },
    {
      "end": 3209296,
      "speaker": "Enrico Bertini",
      "start": 3207144,
      "text": "And so it's a very.",
      "id": "ep_60_ut_173"
    },
    {
      "end": 3212992,
      "speaker": "Moritz Stefaner",
      "start": 3209400,
      "text": "What do you visualize? What do you visualize? Can you tell us a bit more.",
      "id": "ep_60_ut_174"
    },
    {
      "end": 3229804,
      "speaker": "Enrico Bertini",
      "start": 3213048,
      "text": "Or is it still, I can briefly mention. So I cannot tell too much about what we are currently doing, but we are working on satellite images, which is a total new space for me, I think. I never, ever worked on images before.",
      "id": "ep_60_ut_175"
    },
    {
      "end": 3230668,
      "speaker": "Moritz Stefaner",
      "start": 3229924,
      "text": "That's very interesting.",
      "id": "ep_60_ut_176"
    },
    {
      "end": 3255290,
      "speaker": "Enrico Bertini",
      "start": 3230716,
      "text": "And this made me think about what is visualization. Is satellite images visualization? I guess so it is, right. But it's also a picture, I mean an image. Right. So it's this very interesting space where it's not something that is totally abstract, but it's not very concrete as well.",
      "id": "ep_60_ut_177"
    },
    {
      "end": 3272334,
      "speaker": "Moritz Stefaner",
      "start": 3255322,
      "text": "No, it's scientific imaging in a way like microscope images or large Hadron Collider measurements. And I agree, it's a very interesting space where you use images as sensors more or less, or like sensor output.",
      "id": "ep_60_ut_178"
    },
    {
      "end": 3292514,
      "speaker": "Enrico Bertini",
      "start": 3273154,
      "text": "Yeah. But I think in a way this is even more interesting because scientific images are most of the time used only by science scientists. Right. But in human rights, these images are used not only for internal analysis, but also to communicate information to the, to the, to the large public. Right.",
      "id": "ep_60_ut_179"
    },
    {
      "end": 3296450,
      "speaker": "Moritz Stefaner",
      "start": 3292674,
      "text": "Or to prove something or to show the effect of something. And yeah, sure.",
      "id": "ep_60_ut_180"
    },
    {
      "end": 3315606,
      "speaker": "Enrico Bertini",
      "start": 3296522,
      "text": "It's not rare to see these kind of images in a newspaper or magazine. Right. And of course there is also an emotional component there. So it's a very, very interesting space. And as I said, it's totally new to me. Me, I've never worked on images before and I find it really, really, really interesting.",
      "id": "ep_60_ut_181"
    },
    {
      "end": 3317114,
      "speaker": "Moritz Stefaner",
      "start": 3315710,
      "text": "Yeah. Cool.",
      "id": "ep_60_ut_182"
    },
    {
      "end": 3518502,
      "speaker": "Enrico Bertini",
      "start": 3318254,
      "text": "Yeah. So that's what I'm doing right now. And I just want to briefly mention that we have a new paper out from my lab about the climate work that we have done in the past with group of climate scientists. This is a project that we've been working on for a little bit more than two years, and that's the last paper we published on the topic. I want to briefly mention it because I think it's one of those academic works that can have some interesting implications on how people do visualization in practice. And I think I've been mentioning part of this work before on the show. But very briefly, the idea here is to come up with kind of like visualization guidelines by analyzing a large set of examples coming from a specific discipline. So in this case, we've been analyzing a large set of visualizations produced by climate scientists in their publications and talks as well. And we created a sort of taxonomy of issues, design visualization, design issues. And I think one thing that I really like about this project is that we didn't just stop the moment we created this taxonomy. We also spent quite a lot of time going back to the climate scientist and showing what we have done and created what we call matches and mismatches, which is mostly about what does a data visualization expert believe is correct and what does a climate scientist believe is correct and where does our opinion match, right. And doesn't match. And I find this part really, really interesting. And I would love to see much more of that. Right. So in a way, this study is very narrow. It's a group of, I don't know, 20 climate scientists, a specific kind of climate scientist. Scientists are somewhat, in a way, even if it's a lot of images, it's still a very small set compared to what people produce around the world. Right. But I would love to see more of this kind of research because it really gives a sense of not only what are the problems out there, the design problems out there, but also how different communities see different problems. Right. And you can see that in the, I mean, when there are these kind of twitter battles discussing about what is correct and what is not correct, you totally get a sense and a flavor of how many different opinions are out there. Right. But I think especially in the world of science there, we need to discuss this much, much more. And I think there is a lot to gain for science and science scientists in communicating with data visualization experts and designers just to better understand how to communicate science to others, not just to their peers. Right. And I think, but even there, I.",
      "id": "ep_60_ut_183"
    },
    {
      "end": 3553490,
      "speaker": "Moritz Stefaner",
      "start": 3518518,
      "text": "Think for both use cases, there can be a lot. There's a lot to be done. Nice. I think that's a great, great study. I'm just flipping through it and I think it's a super interesting topic. And I also agree sometimes we tend to be a bit cocky in a sense that we think just because we know visual variables and we have, we can suddenly, like, be experts on anything. And so it's good, this reality check that, you know, some plots might make sense after you are exposed to them for a decade.",
      "id": "ep_60_ut_184"
    },
    {
      "end": 3573530,
      "speaker": "Enrico Bertini",
      "start": 3553682,
      "text": "Yeah, yeah, absolutely. I mean, I am afraid of this kind of this gospel that we try to, I mean, of course, to some extent, you do need, I don't know, some systematic analysis and even prediction of content.",
      "id": "ep_60_ut_185"
    },
    {
      "end": 3595194,
      "speaker": "Moritz Stefaner",
      "start": 3573682,
      "text": "You know, with some best practices, you can improve a lot on all the standard graphics. I see the spaghetti plot. Like it's, it has ten different lines color codes, they all overlap. It's something where visualization expert says, yeah, that doesn't really work. Let's make small multiples. You make small multiples to the right of that immediately everybody says like, yeah, that makes sense.",
      "id": "ep_60_ut_186"
    },
    {
      "end": 3596846,
      "speaker": "Enrico Bertini",
      "start": 3595654,
      "text": "That totally works.",
      "id": "ep_60_ut_187"
    },
    {
      "end": 3611346,
      "speaker": "Moritz Stefaner",
      "start": 3596910,
      "text": "Like, why don't we do it like that? Right. But there might also be other cases where something seems obscure or sort of strange. But then it does make sense if you know a bit about the data and about the conventions in the domain. Ants on.",
      "id": "ep_60_ut_188"
    },
    {
      "end": 3618498,
      "speaker": "Enrico Bertini",
      "start": 3611490,
      "text": "Yeah, yeah, yeah, yeah. We had a lot of interesting discussions on the rainbow color map with them.",
      "id": "ep_60_ut_189"
    },
    {
      "end": 3618882,
      "speaker": "Moritz Stefaner",
      "start": 3618586,
      "text": "Right.",
      "id": "ep_60_ut_190"
    },
    {
      "end": 3628214,
      "speaker": "Enrico Bertini",
      "start": 3618938,
      "text": "Which is of course pervasive in climate science. And it's interesting, it's not that black and white as some people want us to believe.",
      "id": "ep_60_ut_191"
    },
    {
      "end": 3632694,
      "speaker": "Moritz Stefaner",
      "start": 3629274,
      "text": "It's not like about rainbows. I have my opinions.",
      "id": "ep_60_ut_192"
    },
    {
      "end": 3637194,
      "speaker": "Enrico Bertini",
      "start": 3633554,
      "text": "Yeah, maybe we should, maybe we should have a show.",
      "id": "ep_60_ut_193"
    },
    {
      "end": 3645278,
      "speaker": "Moritz Stefaner",
      "start": 3640094,
      "text": "But if it's not at least perceptually corrected, I'm not on board. I'm sorry.",
      "id": "ep_60_ut_194"
    },
    {
      "end": 3651914,
      "speaker": "Enrico Bertini",
      "start": 3645446,
      "text": "I agree. That's not what I'm saying, but I think it's, the story is more complicated than that.",
      "id": "ep_60_ut_195"
    },
    {
      "end": 3655302,
      "speaker": "Moritz Stefaner",
      "start": 3653654,
      "text": "Nice. That sounds good.",
      "id": "ep_60_ut_196"
    },
    {
      "end": 3656006,
      "speaker": "Enrico Bertini",
      "start": 3655438,
      "text": "Yep.",
      "id": "ep_60_ut_197"
    },
    {
      "end": 3660274,
      "speaker": "Moritz Stefaner",
      "start": 3656110,
      "text": "Maybe we should have a climate scientist on board at some point.",
      "id": "ep_60_ut_198"
    },
    {
      "end": 3663926,
      "speaker": "Enrico Bertini",
      "start": 3660814,
      "text": "Well, we had the Bloomberg, the Bloomberg episode. That was fun.",
      "id": "ep_60_ut_199"
    },
    {
      "end": 3669514,
      "speaker": "Moritz Stefaner",
      "start": 3663990,
      "text": "Yeah. And we were also both part of workshops, so we could have. Greg.",
      "id": "ep_60_ut_200"
    },
    {
      "end": 3678434,
      "speaker": "Enrico Bertini",
      "start": 3672774,
      "text": "Yeah. Climate. Very interesting area. Yeah, yeah.",
      "id": "ep_60_ut_201"
    },
    {
      "end": 3680074,
      "speaker": "Moritz Stefaner",
      "start": 3679174,
      "text": "And important.",
      "id": "ep_60_ut_202"
    },
    {
      "end": 3681542,
      "speaker": "Enrico Bertini",
      "start": 3680774,
      "text": "Very important.",
      "id": "ep_60_ut_203"
    },
    {
      "end": 3689030,
      "speaker": "Moritz Stefaner",
      "start": 3681638,
      "text": "Yeah, yeah. What else? Any other projects? Any upcoming things? Anything interesting?",
      "id": "ep_60_ut_204"
    },
    {
      "end": 3710184,
      "speaker": "Enrico Bertini",
      "start": 3689062,
      "text": "So from my point of view, one last thing I want to mention is that I am going to start my new infovis course next week on Monday. I am, as usual, excited and nervous at the same time. It's interesting how much of a struggle there is every year trying to come up with the right balance between things.",
      "id": "ep_60_ut_205"
    },
    {
      "end": 3717812,
      "speaker": "Moritz Stefaner",
      "start": 3712244,
      "text": "Will you ever do a MOOC where we all can take part and do your exercises? That's what I'm interested in.",
      "id": "ep_60_ut_206"
    },
    {
      "end": 3736368,
      "speaker": "Enrico Bertini",
      "start": 3717828,
      "text": "I hope so. I hope so. Yeah. We do have actually an online internal course that I recorded last year, but that's not freely available. But honestly, to tell you the truth, I believe that I'm still improving a lot. I'm never too happy about my course.",
      "id": "ep_60_ut_207"
    },
    {
      "end": 3737424,
      "speaker": "Moritz Stefaner",
      "start": 3736416,
      "text": "You're not ready yet?",
      "id": "ep_60_ut_208"
    },
    {
      "end": 3753448,
      "speaker": "Enrico Bertini",
      "start": 3737544,
      "text": "I'm not ready yet because I'm still experimenting with a lot of things, especially the right balance between, let's call it theory. In practice it's very hard. It's very hard to find the right balance, at least for me. I don't know, maybe for others is not.",
      "id": "ep_60_ut_209"
    },
    {
      "end": 3764472,
      "speaker": "Moritz Stefaner",
      "start": 3753576,
      "text": "No, it's the, it's the ongoing thing in database courses. Sure. Like how much do you try out how much background knowledge do you need? Like, before, after, like, yeah, I mean.",
      "id": "ep_60_ut_210"
    },
    {
      "end": 3784294,
      "speaker": "Enrico Bertini",
      "start": 3764528,
      "text": "Every year, my, towards the end of the course, I feel like I spend too much time giving lectures and students. I can literally see them learning much, much quicker when I sit next to them and criticize their work.",
      "id": "ep_60_ut_211"
    },
    {
      "end": 3807444,
      "speaker": "Moritz Stefaner",
      "start": 3785754,
      "text": "Maybe you should just start with projects and then demonstrate everything. On the concrete example, if somebody uses a funny color map, bring it up on the projector and say, yeah, what can we do here? Do you see alternatives or what do you think would be the textbook solution for? There's things like this.",
      "id": "ep_60_ut_212"
    },
    {
      "end": 3825836,
      "speaker": "Enrico Bertini",
      "start": 3807604,
      "text": "I think Tamara is an interesting, Tamara Munzner has an interesting solution to that. She basically splits her course in two halves. First half is the whole set of theory going through her book, and second half is project, only project, basically.",
      "id": "ep_60_ut_213"
    },
    {
      "end": 3827852,
      "speaker": "Moritz Stefaner",
      "start": 3826020,
      "text": "But it's first theory, then practice.",
      "id": "ep_60_ut_214"
    },
    {
      "end": 3843830,
      "speaker": "Enrico Bertini",
      "start": 3827948,
      "text": "Yeah. First theory, then practice. I think it's an interesting, interesting format. It. So if you guys have any suggestions, let me know. That's an ongoing struggle for me.",
      "id": "ep_60_ut_215"
    },
    {
      "end": 3846470,
      "speaker": "Moritz Stefaner",
      "start": 3843982,
      "text": "Yeah, I'll ask you again in three months.",
      "id": "ep_60_ut_216"
    },
    {
      "end": 3854234,
      "speaker": "Enrico Bertini",
      "start": 3846622,
      "text": "Yeah, we'll see. Yeah, yeah, yeah. How about you? Do you have anything else you want to talk about?",
      "id": "ep_60_ut_217"
    },
    {
      "end": 3857342,
      "speaker": "Moritz Stefaner",
      "start": 3854894,
      "text": "Not really. I'll be teaching a few workshops too, by the way.",
      "id": "ep_60_ut_218"
    },
    {
      "end": 3857766,
      "speaker": "Enrico Bertini",
      "start": 3857358,
      "text": "Oh, yes.",
      "id": "ep_60_ut_219"
    },
    {
      "end": 3869364,
      "speaker": "Moritz Stefaner",
      "start": 3857830,
      "text": "That's more internal, but yeah. So I'll face the same problems to. Yeah, I have a bit of conferences coming up, so if you are in Belgium, you could go to Kikk festival.",
      "id": "ep_60_ut_220"
    },
    {
      "end": 3871368,
      "speaker": "Enrico Bertini",
      "start": 3870024,
      "text": "Nice. What is that?",
      "id": "ep_60_ut_221"
    },
    {
      "end": 3954756,
      "speaker": "Moritz Stefaner",
      "start": 3871496,
      "text": "It's in November, and it's pretty cool. It's a big festival, and I think it's basically free or very low attendance fee because it's basically financed by cultural money, or it's like regional development funds, basically. And it's huge digital, like, festival. Really interesting stuff. Great speakers, conference, exhibition space and so on. So nice. That's worth checking out. Yeah, that's early November and mid November. I'm in Katowice in Poland for the art+bits festival, and that's gonna be good too. And yeah, I'm a huge, like, fan of what's going on in eastern Europe, and I'm always super interested. And these guys, they make a really good impression. They have, like, a media lab there that there's a. A lot with urban data and smart city type things. And also the conference here they have Lev Manovic, who I've been working with, as you know, Stephanie Posavec, who I've been working with. Niklas Roy, who is a super fun guy, super flux, great people from design fiction area. Dietmar Offenhuber, who we had on the show. Oh, yeah, and studio NAND and we also had Stefan on this show. So again, it's a data stories crew party basically. But mid November in Poland. Yeah.",
      "id": "ep_60_ut_222"
    },
    {
      "end": 3955708,
      "speaker": "Enrico Bertini",
      "start": 3954940,
      "text": "Nice.",
      "id": "ep_60_ut_223"
    },
    {
      "end": 3960756,
      "speaker": "Moritz Stefaner",
      "start": 3955876,
      "text": "If you happen to be around, I would love to drop by, say hi.",
      "id": "ep_60_ut_224"
    },
    {
      "end": 3961548,
      "speaker": "Enrico Bertini",
      "start": 3960900,
      "text": "Yeah.",
      "id": "ep_60_ut_225"
    },
    {
      "end": 3962644,
      "speaker": "Moritz Stefaner",
      "start": 3961676,
      "text": "What's coming up for you?",
      "id": "ep_60_ut_226"
    },
    {
      "end": 3971348,
      "speaker": "Enrico Bertini",
      "start": 3962684,
      "text": "This probably every year. So this 15 is in Chicago this time.",
      "id": "ep_60_ut_227"
    },
    {
      "end": 3972564,
      "speaker": "Moritz Stefaner",
      "start": 3971476,
      "text": "Chicago's not bad.",
      "id": "ep_60_ut_228"
    },
    {
      "end": 3981064,
      "speaker": "Enrico Bertini",
      "start": 3972644,
      "text": "And if you haven't seen it yet, there is the whole set of papers online. I think they also published video previews.",
      "id": "ep_60_ut_229"
    },
    {
      "end": 3984384,
      "speaker": "Moritz Stefaner",
      "start": 3981104,
      "text": "But the videos. Yeah, but the papers are not yet. No.",
      "id": "ep_60_ut_230"
    },
    {
      "end": 3989768,
      "speaker": "Enrico Bertini",
      "start": 3984544,
      "text": "I think at least the titles and authors out there, and I'm pretty sure they will, they're gonna post some.",
      "id": "ep_60_ut_231"
    },
    {
      "end": 3992484,
      "speaker": "Moritz Stefaner",
      "start": 3989816,
      "text": "You don't usually read more than the title or what.",
      "id": "ep_60_ut_232"
    },
    {
      "end": 4006724,
      "speaker": "Enrico Bertini",
      "start": 3993904,
      "text": "Well, you know, it's getting bigger and bigger, so you cannot actually read everything. Right. But you can get a sense. But you know who the main trends. And it's interesting, I think almost every year you can see some main trends.",
      "id": "ep_60_ut_233"
    },
    {
      "end": 4009494,
      "speaker": "Moritz Stefaner",
      "start": 4007114,
      "text": "What's your guess? What's gonna be big this year?",
      "id": "ep_60_ut_234"
    },
    {
      "end": 4013654,
      "speaker": "Enrico Bertini",
      "start": 4011274,
      "text": "I'm not sure yet. I'll tell you later.",
      "id": "ep_60_ut_235"
    },
    {
      "end": 4015970,
      "speaker": "Moritz Stefaner",
      "start": 4014674,
      "text": "After the conference.",
      "id": "ep_60_ut_236"
    },
    {
      "end": 4021794,
      "speaker": "Enrico Bertini",
      "start": 4016122,
      "text": "After the conference, I think. Yeah, let me think.",
      "id": "ep_60_ut_237"
    },
    {
      "end": 4022694,
      "speaker": "Moritz Stefaner",
      "start": 4021834,
      "text": "Light stuff.",
      "id": "ep_60_ut_238"
    },
    {
      "end": 4045980,
      "speaker": "Enrico Bertini",
      "start": 4023874,
      "text": "I'm not sure. I'm not sure. I didn't read more theory yet. Frameworks, I don't know. Yeah, I'll try to talk about it in one of our later shows. I'm not sure. I didn't read carefully, but I'm sure it's gonna be a really good visa. It's almost every year is a very good set of papers and events.",
      "id": "ep_60_ut_239"
    },
    {
      "end": 4050836,
      "speaker": "Moritz Stefaner",
      "start": 4046132,
      "text": "Yeah, last year was quite successful from what I gather, and the years before as well, so.",
      "id": "ep_60_ut_240"
    },
    {
      "end": 4052784,
      "speaker": "Enrico Bertini",
      "start": 4050900,
      "text": "Yeah, absolutely.",
      "id": "ep_60_ut_241"
    },
    {
      "end": 4074244,
      "speaker": "Moritz Stefaner",
      "start": 4053444,
      "text": "Cool. Yeah, you should do some live reporting again. I mean. I mean. Yeah, yeah, I can't stand that too often, but. Yeah, but last year was fun and. Yeah, maybe you should get Robert and I don't know who else will be there. Like, from good interview partners, I'm sure there will be some.",
      "id": "ep_60_ut_242"
    },
    {
      "end": 4081104,
      "speaker": "Enrico Bertini",
      "start": 4074584,
      "text": "Yeah. We shouldn't spend too much time without Robert and Andy and Alberto from time.",
      "id": "ep_60_ut_243"
    },
    {
      "end": 4084764,
      "speaker": "Moritz Stefaner",
      "start": 4081144,
      "text": "To time, we need a little dose of that.",
      "id": "ep_60_ut_244"
    },
    {
      "end": 4088040,
      "speaker": "Enrico Bertini",
      "start": 4087664,
      "text": "Yeah.",
      "id": "ep_60_ut_245"
    },
    {
      "end": 4090048,
      "speaker": "Moritz Stefaner",
      "start": 4088072,
      "text": "Alberto, he's writing a new book.",
      "id": "ep_60_ut_246"
    },
    {
      "end": 4091220,
      "speaker": "Enrico Bertini",
      "start": 4090136,
      "text": "He's writing a new book.",
      "id": "ep_60_ut_247"
    },
    {
      "end": 4096652,
      "speaker": "Moritz Stefaner",
      "start": 4091352,
      "text": "And it seems to be going along well and looking good so far.",
      "id": "ep_60_ut_248"
    },
    {
      "end": 4100444,
      "speaker": "Enrico Bertini",
      "start": 4096828,
      "text": "Yeah. What is that, the truthful art? Something like that.",
      "id": "ep_60_ut_249"
    },
    {
      "end": 4108784,
      "speaker": "Moritz Stefaner",
      "start": 4100604,
      "text": "Yeah. The first one was the functional art. Now he's all for truthful suddenly, now that, you know. I don't know where he has that from, but.",
      "id": "ep_60_ut_250"
    },
    {
      "end": 4113100,
      "speaker": "Enrico Bertini",
      "start": 4111044,
      "text": "Looking forward to reading that.",
      "id": "ep_60_ut_251"
    },
    {
      "end": 4116744,
      "speaker": "Moritz Stefaner",
      "start": 4113252,
      "text": "Yeah, it seems really good and. Yeah, we'll see.",
      "id": "ep_60_ut_252"
    },
    {
      "end": 4120204,
      "speaker": "Enrico Bertini",
      "start": 4117744,
      "text": "Okay, I think we can wrap it up here. Right.",
      "id": "ep_60_ut_253"
    },
    {
      "end": 4123416,
      "speaker": "Moritz Stefaner",
      "start": 4120624,
      "text": "I don't have anything else. I'm happy. Yeah.",
      "id": "ep_60_ut_254"
    },
    {
      "end": 4133760,
      "speaker": "Enrico Bertini",
      "start": 4123520,
      "text": "So I just want to say to our listeners, too, so if you want to suggest other guests to us, we are happy to receive suggestions.",
      "id": "ep_60_ut_255"
    },
    {
      "end": 4134724,
      "speaker": "Moritz Stefaner",
      "start": 4133952,
      "text": "Yeah.",
      "id": "ep_60_ut_256"
    },
    {
      "end": 4143624,
      "speaker": "Enrico Bertini",
      "start": 4136104,
      "text": "What else? If you can rate us on iTunes or other aggregators, podcast aggregators.",
      "id": "ep_60_ut_257"
    },
    {
      "end": 4145332,
      "speaker": "Moritz Stefaner",
      "start": 4143664,
      "text": "Yes. Stitcher maybe too.",
      "id": "ep_60_ut_258"
    },
    {
      "end": 4150076,
      "speaker": "Enrico Bertini",
      "start": 4145428,
      "text": "Yeah. And sign up to our mailing list and.",
      "id": "ep_60_ut_259"
    },
    {
      "end": 4151804,
      "speaker": "Moritz Stefaner",
      "start": 4150260,
      "text": "Yeah, follow us on Twitter.",
      "id": "ep_60_ut_260"
    },
    {
      "end": 4157884,
      "speaker": "Enrico Bertini",
      "start": 4151884,
      "text": "Follow us on Twitter if you are not. And, yeah. So that's all for today.",
      "id": "ep_60_ut_261"
    },
    {
      "end": 4160620,
      "speaker": "Moritz Stefaner",
      "start": 4158044,
      "text": "Yeah. Hear you soon.",
      "id": "ep_60_ut_262"
    },
    {
      "end": 4162004,
      "speaker": "Enrico Bertini",
      "start": 4160772,
      "text": "Yeah. Bye bye.",
      "id": "ep_60_ut_263"
    },
    {
      "end": 4162380,
      "speaker": "Moritz Stefaner",
      "start": 4162124,
      "text": "Bye.",
      "id": "ep_60_ut_264"
    },
    {
      "end": 4189413,
      "speaker": "Enrico Bertini",
      "start": 4162412,
      "text": "Bye bye. Data stories is brought to you by Qlik, who allows you to explore the hidden relationships within your data that lead to, to meaningful insights. Let your instincts lead the way to create personalized visualizations and dynamic dashboards with Qlik sense, which you can download for free at Qlik Datastories. That's Qlik de.",
      "id": "ep_60_ut_265"
    }
  ],
  "confidence": 0.921534589933449,
  "audio_duration": 4191,
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_status_code": null,
  "webhook_auth": false,
  "webhook_auth_header_name": null,
  "speed_boost": false,
  "auto_highlights_result": null,
  "auto_highlights": false,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_audio_quality": null,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "content_safety": false,
  "iab_categories": true,
  "content_safety_labels": {
    "status": "unavailable",
    "results": [],
    "summary": {}
  },
  "language_detection": false,
  "language_detection_threshold": null,
  "language_confidence": null,
  "custom_spelling": null,
  "throttled": false,
  "auto_chapters": true,
  "summarization": false,
  "summary_type": null,
  "summary_model": null,
  "custom_topics": false,
  "topics": [],
  "speech_threshold": null,
  "speech_model": "best",
  "chapters": [
    {
      "summary": "Data stories is brought to you by Qlik, who allows you to explore the hidden relationships within your data that lead to meaningful insights. Let your instincts lead the way to create personalized visualizations and dynamic dashboards with Qlik sense.",
      "gist": "Data Stories: No More September",
      "headline": "Data stories is brought to you by Qlik, who allows you to explore hidden relationships",
      "start": 360,
      "end": 120714,
      "id": "ep_60_ch_0"
    },
    {
      "summary": "Today it's me and you. No special guests? No, the two of us. And, yeah, I think we have done this a few times now, and we just want to talk about, I don't know, stuff that comes in our mind. We have a long list of topics.",
      "gist": "Wonders of the World",
      "headline": "Moen and Enmo talk about a variety of topics today",
      "start": 121374,
      "end": 161076,
      "id": "ep_60_ch_1"
    },
    {
      "summary": "We have some sort of new format that we internally call project episodes. Rather than having an episode that is fully focused on one specific topic and one person, we have an episode about one specific project. We do have some more in the pipeline, right, Moritz?",
      "gist": "Project Episodes",
      "headline": "We have some sort of new format that we internally call project episodes",
      "start": 161260,
      "end": 259470,
      "id": "ep_60_ch_2"
    },
    {
      "summary": "Every single episode now as an image gallery. You can go to the blog post and click on the gallery and see images that are related to the episode. You now can also join our mailing list or newsletter. Please rate us on iTunes or any related podcast collector.",
      "gist": "Data Story: A New format for the blog post",
      "headline": "Every data story blog post now includes an image gallery",
      "start": 259622,
      "end": 524118,
      "id": "ep_60_ch_3"
    },
    {
      "summary": "Data skeptic is the one that I don't know I enjoyed the most so far. If you guys are interested in more data podcast, I strongly suggest you to. We have the opportunity to do a data stories meetup as sort of a satellite event to the conference. Let us know if you have any ideas.",
      "gist": "Data Skeptic: A Podcast for Data Scientists",
      "headline": "Data skeptic is one of the best data science related podcasts so far",
      "start": 524246,
      "end": 795416,
      "id": "ep_60_ch_4"
    },
    {
      "summary": "We also have ask us anything session coming up on Reddit. So if you have any, like, smart questions you want to ask us, we will be there to answer them. I just hope I don't get into another Internet fight.",
      "gist": "Ask Me Anything",
      "headline": "We have ask us anything session coming up on Reddit",
      "start": 795480,
      "end": 952214,
      "id": "ep_60_ch_5"
    },
    {
      "summary": "For me, it was a very busy end. I wrapped up a few things before, like summer, and then I went into vacations. Now suddenly all these websites pop up and get launched. That's kind of cool. As long as clients don't send you emails during vacations.",
      "gist": "A Taste of our Recent Projects",
      "headline": "We thought about other people's projects, but we didn't find any interesting ones",
      "start": 954114,
      "end": 1006194,
      "id": "ep_60_ch_6"
    },
    {
      "summary": "The project deals with corporate profiling and how companies deal with data. It has been shown at Ars Electronica already, and then it tours sort of through Europe in the fall. Try people to help understand how these things work and then show them a few ways to protect themselves.",
      "gist": " false positives at Ars Electronica",
      "headline": "False positive project deals with corporate profiling and how companies deal with data",
      "start": 1006894,
      "end": 1466488,
      "id": "ep_60_ch_7"
    },
    {
      "summary": "Can you disclose any of the mechanisms that you have behind the scenes? It's a wild mixture of. existing libraries, as usual, but I'll do a write up on that. Cost me a lot of nerves and everybody involved, but it's been quite rewarding too.",
      "gist": "How to really reveal a person's identity in the future",
      "headline": "Can you disclose any of the mechanisms that you have behind the scenes",
      "start": 1466536,
      "end": 1608994,
      "id": "ep_60_ch_8"
    },
    {
      "summary": "This week, data stories is brought to you by Qlik. Let your instincts lead the way to create personalized visualizations and dynamic dashboards with Qlik sense 2.0. Three blog posts from Patrik Lundblad cover the basics of data visualization.",
      "gist": "Data Stories",
      "headline": "This week, data stories is brought to you by Qlik",
      "start": 1609374,
      "end": 1715552,
      "id": "ep_60_ch_9"
    },
    {
      "summary": "A project that we have in collaboration with ProPublica is to look into large sets of Yelp reviews. Right now we have almost 1.5 million of reviews only considering the healthcare data. We are very much interested in understanding how people use these kind of tools to derive new insights and knowledge.",
      "gist": "How to search through medical reviews on Yelp",
      "headline": "An ongoing project with ProPublica is looking into healthcare reviews on Yelp",
      "start": 1715688,
      "end": 2043164,
      "id": "ep_60_ch_10"
    },
    {
      "summary": "An article on NPR says doctors get reviewed like restaurants, and it rankles. There is a whole interplay between what doctors need and what patients need. ProPublica is working on a case study paper on how people use the tool. The paper should come out sometime in October.",
      "gist": "Actionable tools for doctors",
      "headline": "ProPublica has developed a tool that lets you review doctors online",
      "start": 2043324,
      "end": 2418854,
      "id": "ep_60_ch_11"
    },
    {
      "summary": "I'm transitioning to es a six, which is a more sane version of JavaScript. Now working on two projects with Pixie J's and Pixie Js. Also working on a spinny globe thing with more than 4000 data points on particles.",
      "gist": "What is next on your side?",
      "headline": "You worked on an inclusive growth report for the World Economic Forum",
      "start": 2420554,
      "end": 2715024,
      "id": "ep_60_ch_12"
    },
    {
      "summary": "How do you decide when to switch? I think with all these things, the community is the most important thing. Many, many projects on GitHub end at a 90% completion state. Give it some time and see if there's a solid community around.",
      "gist": "When to Switch from one framework to another?",
      "headline": "How do you decide when to switch to new technology",
      "start": 2716404,
      "end": 2822890,
      "id": "ep_60_ch_13"
    },
    {
      "summary": "It's about inclusive growth. So it's about equality and inclusiveness and so on. The team measured loads of data, really it's hundreds of indicators that are aggregated into different categories. But it's hard to make definite statements, who's best or who's worst.",
      "gist": "The Inclusive Growth Project",
      "headline": "The project is about inclusive growth, equality and inclusiveness",
      "start": 2823002,
      "end": 2923934,
      "id": "ep_60_ch_14"
    },
    {
      "summary": "Right now I have two projects I'm really excited about. One is a wind forecast project. The second one is a big ambient visualization for a company that does cybersecurity. They're gonna keep me busy for the fall, pretty much.",
      "gist": "What are you working on now?",
      "headline": "I have two projects I'm really excited about for the fall",
      "start": 2924734,
      "end": 2997394,
      "id": "ep_60_ch_15"
    },
    {
      "summary": "We just started a new project on human rights visualization. We got some funding from Cartoon foundation. Human rights traditionally is a subject or an area where people didn't really work with quantitative data. But at the same time, there are a lot of opportunities there to do amazing things with visualization.",
      "gist": "Human Rights Data Visualization",
      "headline": "We just started a new project on human rights visualization",
      "start": 2998174,
      "end": 3209296,
      "id": "ep_60_ch_16"
    },
    {
      "summary": "We are working on satellite images, which is a total new space for me. I never, ever worked on images before. Is satellite images visualization? But it's also a picture, I mean an image. In human rights, these images are used not only for internal analysis, but also to communicate information.",
      "gist": "What is visualization in human rights?",
      "headline": "We are working on satellite images visualization, which is new for me",
      "start": 3209400,
      "end": 3321534,
      "id": "ep_60_ch_17"
    },
    {
      "summary": "New paper analyzes a large set of visualizations produced by climate scientists. It creates a sort of taxonomy of issues, design visualization, design issues. There is a lot to gain for science and science scientists in communicating with data visualization experts and designers.",
      "gist": "The Taxonomy of Data Visualization",
      "headline": "A new paper from my lab looks at how climate scientists use visualization",
      "start": 3321694,
      "end": 3682590,
      "id": "ep_60_ch_18"
    },
    {
      "summary": "I am going to start my new infovis course next week on Monday. It's interesting how much of a struggle there is every year trying to come up with the right balance between things. I have a bit of conferences coming up, so if you are in Belgium, you could go to Kikk festival.",
      "gist": "New Course start next week",
      "headline": "I start my new infovis course next week on Monday",
      "start": 3682782,
      "end": 3961548,
      "id": "ep_60_ch_19"
    },
    {
      "summary": "This 15 is in Chicago this time. There is the whole set of papers online. Almost every year you can see some main trends. What's gonna be big this year? I'm not sure yet.",
      "gist": "WG15",
      "headline": "This 15 is in Chicago this time. What's your guess on what's expected this year",
      "start": 3961676,
      "end": 4116744,
      "id": "ep_60_ch_20"
    },
    {
      "summary": "Data stories is brought to you by Qlik, who allows you to explore the hidden relationships within your data. If you can rate us on iTunes or other aggregators, podcast aggregators. And sign up to our mailing list and follow us on Twitter. Hear you soon.",
      "gist": "Data Stories",
      "headline": "Okay, I think we can wrap it up here. I don't have anything else. So I just want to say to our listeners, too",
      "start": 4117744,
      "end": 4189413,
      "id": "ep_60_ch_21"
    }
  ],
  "disfluencies": false,
  "entity_detection": false,
  "sentiment_analysis": false,
  "sentiment_analysis_results": null,
  "entities": null,
  "speakers_expected": null,
  "summary": null,
  "custom_topics_results": null,
  "episode_num": 60,
  "episode_metadata": {
    "speakers": [
      "Moritz Stefaner",
      "Enrico Bertini"
    ],
    "WPid": "389",
    "url": "https://datastori.es/podlove/file/1272/s/feed/c/mp3/end-of-summer-episode-we-talk-about-upcoming-ds-events-and-some-of-our-recent-projects-ds60.mp3",
    "episode_title": "Upcoming DS Events and Some of Our Recent Projects"
  }
}