{
  "id": "77e6bfc1-94a9-4146-8c32-4272912258eb",
  "language_model": "assemblyai_default",
  "acoustic_model": "assemblyai_default",
  "language_code": "en_us",
  "status": "completed",
  "audio_url": "https://datastori.es/podlove/file/965/s/feed/c/mp3/data-stories-55-disinformation-visualization-and-data-obfuscation-w-mushon-zer-aviv.mp3",
  "utterances": [
    {
      "end": 5634,
      "speaker": "Mushon Zer-Aviv",
      "start": 120,
      "text": "It's supposed to be a bottomless pit, because the only bottom of a pit like this is a totalitarianism.",
      "id": "ep_55_ut_0"
    },
    {
      "end": 41792,
      "speaker": "Moritz Stefaner",
      "start": 7654,
      "text": "Data stories is supported by Tableau software, helping people see and understand their data. Get answers from interactive dashboards. Wherever you go for your free trial, visit Tableau software@Tableau.com. Datastories. That's Tableau.com Datastories. Hey, everyone. Datastories is 55. Hey, Enrico. How are you doing?",
      "id": "ep_55_ut_1"
    },
    {
      "end": 45144,
      "speaker": "Enrico Bertini",
      "start": 41968,
      "text": "I'm good. 55 is a nice number.",
      "id": "ep_55_ut_2"
    },
    {
      "end": 47152,
      "speaker": "Moritz Stefaner",
      "start": 45224,
      "text": "It's a nice, round number. That's true.",
      "id": "ep_55_ut_3"
    },
    {
      "end": 50444,
      "speaker": "Enrico Bertini",
      "start": 47248,
      "text": "It's. Yeah. Aesthetically pleasing, I guess.",
      "id": "ep_55_ut_4"
    },
    {
      "end": 54026,
      "speaker": "Moritz Stefaner",
      "start": 52224,
      "text": "How was your weekend? How are you doing?",
      "id": "ep_55_ut_5"
    },
    {
      "end": 75382,
      "speaker": "Enrico Bertini",
      "start": 54200,
      "text": "Um, okay. Busy? Yeah, a bit busy. Okay. Not the best weather in New York today. Yeah. I'm feeling a bit moody, but it's fine. I'm fine. Yeah. The semester is over, so now I can do some. Some work, some research, some proper work.",
      "id": "ep_55_ut_6"
    },
    {
      "end": 75870,
      "speaker": "Moritz Stefaner",
      "start": 75478,
      "text": "Yeah.",
      "id": "ep_55_ut_7"
    },
    {
      "end": 77510,
      "speaker": "Enrico Bertini",
      "start": 75942,
      "text": "Proper work. Yes.",
      "id": "ep_55_ut_8"
    },
    {
      "end": 81994,
      "speaker": "Moritz Stefaner",
      "start": 77662,
      "text": "Guess what? I had my first honey harvest of this year. This on the weekend.",
      "id": "ep_55_ut_9"
    },
    {
      "end": 83260,
      "speaker": "Enrico Bertini",
      "start": 82484,
      "text": "You had what?",
      "id": "ep_55_ut_10"
    },
    {
      "end": 85964,
      "speaker": "Moritz Stefaner",
      "start": 83332,
      "text": "My honey harvest. So the first time.",
      "id": "ep_55_ut_11"
    },
    {
      "end": 87940,
      "speaker": "Enrico Bertini",
      "start": 86084,
      "text": "Really? Oh, wow. That's amazing.",
      "id": "ep_55_ut_12"
    },
    {
      "end": 91684,
      "speaker": "Moritz Stefaner",
      "start": 87972,
      "text": "But it wasn't so much. It was maybe 20 pounds or something. 25. I don't know.",
      "id": "ep_55_ut_13"
    },
    {
      "end": 92464,
      "speaker": "Mushon Zer-Aviv",
      "start": 91724,
      "text": "We'll see.",
      "id": "ep_55_ut_14"
    },
    {
      "end": 101104,
      "speaker": "Enrico Bertini",
      "start": 93484,
      "text": "You should prepare some data stories, honey, especially this one. Yeah. Sell it on the web. Special edition.",
      "id": "ep_55_ut_15"
    },
    {
      "end": 103236,
      "speaker": "Mushon Zer-Aviv",
      "start": 102364,
      "text": "Yeah.",
      "id": "ep_55_ut_16"
    },
    {
      "end": 108144,
      "speaker": "Moritz Stefaner",
      "start": 103420,
      "text": "Last year's was amazing. So if this year's is, like, close to that.",
      "id": "ep_55_ut_17"
    },
    {
      "end": 110770,
      "speaker": "Enrico Bertini",
      "start": 108474,
      "text": "Yeah, I tried some. I tried some.",
      "id": "ep_55_ut_18"
    },
    {
      "end": 112370,
      "speaker": "Moritz Stefaner",
      "start": 110842,
      "text": "Yeah, it was amazing, right?",
      "id": "ep_55_ut_19"
    },
    {
      "end": 113734,
      "speaker": "Enrico Bertini",
      "start": 112522,
      "text": "Yeah, yeah. See?",
      "id": "ep_55_ut_20"
    },
    {
      "end": 121454,
      "speaker": "Moritz Stefaner",
      "start": 115914,
      "text": "Yeah, we'll see. Maybe another time in summer. Usually I harvest twice, so we'll see.",
      "id": "ep_55_ut_21"
    },
    {
      "end": 123306,
      "speaker": "Enrico Bertini",
      "start": 122394,
      "text": "Sounds great.",
      "id": "ep_55_ut_22"
    },
    {
      "end": 124174,
      "speaker": "Moritz Stefaner",
      "start": 123450,
      "text": "Yeah.",
      "id": "ep_55_ut_23"
    },
    {
      "end": 125826,
      "speaker": "Mushon Zer-Aviv",
      "start": 125274,
      "text": "Good.",
      "id": "ep_55_ut_24"
    },
    {
      "end": 129218,
      "speaker": "Enrico Bertini",
      "start": 125930,
      "text": "Shall we introduce our special guest for today?",
      "id": "ep_55_ut_25"
    },
    {
      "end": 130214,
      "speaker": "Moritz Stefaner",
      "start": 129306,
      "text": "Absolutely.",
      "id": "ep_55_ut_26"
    },
    {
      "end": 137718,
      "speaker": "Enrico Bertini",
      "start": 130634,
      "text": "Okay, so we have Mushon Zer-Aviv, directly from Israel. Hey, Mushon. How are you?",
      "id": "ep_55_ut_27"
    },
    {
      "end": 140550,
      "speaker": "Mushon Zer-Aviv",
      "start": 137806,
      "text": "I'm great. Hello. Hello. Great to be here.",
      "id": "ep_55_ut_28"
    },
    {
      "end": 141674,
      "speaker": "Moritz Stefaner",
      "start": 140582,
      "text": "Great to have you.",
      "id": "ep_55_ut_29"
    },
    {
      "end": 182776,
      "speaker": "Enrico Bertini",
      "start": 141974,
      "text": "I'm so happy that you are on the show. So, Mushon is a designer, and I think you also define yourself as an activist or maybe data activist, I don't know. And he does a lot of interesting stuff, and especially our attention with his work on disinformation, visualization. And we would like to discuss a little bit of that and many of the other very interesting things that he's been working on. So, Mushon, can you give us a little bit of an introduction about yourself? What's your background and what you are doing right now?",
      "id": "ep_55_ut_30"
    },
    {
      "end": 316734,
      "speaker": "Mushon Zer-Aviv",
      "start": 182840,
      "text": "Yeah, so I'm indeed a designer. And at some point when you do a lot of activism, you have to own it, I guess. And I go by media activists or data activists, and some article called me a disinformation activist, which is kind of funny. But yeah, I'm working in Tel Aviv, and my far background back in the nineties was actually in comics. I was publishing kind of an underground comics fanzen, and that's, I would say, my first introduction to where images meet text. And when the Internet started to be a thing that should be. Should get some attention. If you are interested in images and text, that has become an interesting thing for you. So that's where I went in the later nineties. And when, and in art school, actually, when I wanted to become a comics artist, I went to the art department. And when they told me there's no art, there's no comics art in the art department, only in the visual communication department. I was taking them at the word, and I became a visual communicator, I guess. Otherwise I would have become an artist, I guess. And after school, there wasn't much exciting places to work in the beginning of the two thousands if you wanted to do digital design. So together with Guy Sagui, we opened the chu al design studio, which is a small kind of boutique design studio. And I started teaching as well. But then towards 2005, I realized that I should have more to teach, so I should learn more. And that's what brought me to New York, to the ITP program at NYU, which I did from 2005 to 2007.",
      "id": "ep_55_ut_31"
    },
    {
      "end": 319090,
      "speaker": "Moritz Stefaner",
      "start": 317594,
      "text": "So you did a master's there.",
      "id": "ep_55_ut_32"
    },
    {
      "end": 394834,
      "speaker": "Mushon Zer-Aviv",
      "start": 319202,
      "text": "Yeah, I did my master's there, and that's where I got more into the open source world as well. I headed this open source project called Shift Space, which we continued to develop. I continued to develop as a resident at Eyebeam, the art and technology center at New York. I also taught at NYU and Parsons afterwards. And in 2010, I moved back to Israel. And here over the last five years, I've been doing a lot of work on open, open government data. So that's a bit of a different perspective to the kind of activism that I was involved in before, and that has gotten me even more involved with data from different perspectives. So, yeah, I'll probably talk about that a bit later. But I guess the disinformation visualization thing is something that I got to through the work, both from working on these issues and from teaching, I guess.",
      "id": "ep_55_ut_33"
    },
    {
      "end": 411878,
      "speaker": "Enrico Bertini",
      "start": 396694,
      "text": "So. I think I discovered the disinformation visualization piece a few months back. I think you wrote that on. Was it a blog post on tactical tech website or something like that?",
      "id": "ep_55_ut_34"
    },
    {
      "end": 412382,
      "speaker": "Mushon Zer-Aviv",
      "start": 412006,
      "text": "Yeah.",
      "id": "ep_55_ut_35"
    },
    {
      "end": 422724,
      "speaker": "Enrico Bertini",
      "start": 412438,
      "text": "But I guess you've been developing this concept for a while. So can you tell us the story of this concept and what you mean by disinformation? Visualization? That's really interesting.",
      "id": "ep_55_ut_36"
    },
    {
      "end": 525224,
      "speaker": "Mushon Zer-Aviv",
      "start": 422844,
      "text": "So it started kind of in a funny incident when I was invited to, I was invited to give, to be a guest lecturer, to give critique to students working in a data visualization class. And one by one, I saw the students going, struggling in front of us, trying to, to argue that there's this greater insight from the visualizations that they've made. And these were very kind of raw initial tries into the world of data visualization. And I felt like rather than telling them what they've done wrong and disappointing them, I wish I could tell them what they've done wrong and having them celebrate it. That is, if maybe as an academic assignment, it would be better for students not to try to tell the truth with data, but to try to lie with data and to have them explore the darker side of visualization. So I really liked that idea. So I decided to develop it as a workshop. And the first time I gave it was in the open Knowledge festival in Helsinki in 2012, where I missed Moritz's data cuisine.",
      "id": "ep_55_ut_37"
    },
    {
      "end": 527064,
      "speaker": "Moritz Stefaner",
      "start": 525684,
      "text": "Yeah. At the same time.",
      "id": "ep_55_ut_38"
    },
    {
      "end": 664304,
      "speaker": "Mushon Zer-Aviv",
      "start": 527784,
      "text": "At the same time. So that was a good excuse and a bad excuse to miss that. But that proved itself quite interesting. There were students who took different approaches there. Some of them took opinions that they disagreed with and decided to lie about them, to be kind of blatant about their lies. Others took even arguments, kind of messages that they were required to present through their work and exaggerate it and see how far can they push it. And still, for example, there was this student who worked for this wood company, and one of the messages in their, in their annual report was about the amount of wood that they cut. So he made a visualization. He tried to figure out how much wood is there in an Ikea stool. And he placed a 3d model of that stool on Google Earth in the same amount of. Of wood. So in that case, some of these would see this as a symbol of power, and some of that would be. Some would see it as a symbol of what the fuck? So that was an interesting way of addressing it. Another one, try to argue that alcohol consumption is actually making the world a safer place. And he made a world, a world map of alcohol consumption and created completely over the top correlations between how much alcohol is consumed and the well being of people. So he was specifically Iranian. So he was arguing, look at the turmoil in Iran. That's because you can't have alcohol there.",
      "id": "ep_55_ut_39"
    },
    {
      "end": 678404,
      "speaker": "Enrico Bertini",
      "start": 665004,
      "text": "So let me ask you something. The workshop was. So the workshop was organized in a way that you've been giving instruction, explicit instructions to create misleading charts or what?",
      "id": "ep_55_ut_40"
    },
    {
      "end": 713154,
      "speaker": "Mushon Zer-Aviv",
      "start": 678484,
      "text": "Yeah, so both. In the article that you mentioned that was published by Tactical Tech in their visualizing advocacy blog and in the workshop, I presented this approach to lying with data. And I equate it. Lying with data is the same kind of lying that you do on your cv, right? It's the kind of things that are true, technically true. Technically true, but completely over the top.",
      "id": "ep_55_ut_41"
    },
    {
      "end": 725122,
      "speaker": "Moritz Stefaner",
      "start": 714214,
      "text": "Or you can lie by omission, of course. Like the things you don't want to be seen, you just don't mention. It's not that you would actively lie, but you just leave them out. Right?",
      "id": "ep_55_ut_42"
    },
    {
      "end": 819734,
      "speaker": "Mushon Zer-Aviv",
      "start": 725298,
      "text": "So I give them the example. My example in the beginning of these workshops is that I've designed the most expensive map ever sold because I was the digital cartographer on Waze.com. and after Waze was sold to Google for a billion dollars, I guess technically I can say that no matter how many treasure maps you might find, the map that I've designed that was sold, was sold for the greatest number. Now, I haven't mentioned in that sentence that I wasn't the only one who ever designed it. This map is much more about data than about design. There was so much that I could do within the constructs of what the mapping engine could provide, and so on and so on and so on. Because this is not an important when what I'm trying to do is boost my cv and say that I've designed the most expensive map eversource. So actually, in the beginning of the workshops, we do this round of misrepresentations, when each participant actually misrepresents themselves by telling us something true about themselves, which is taken completely out of context. But this is exactly the kind of lies that we mean. It's not about lying about the data because that would be cheating.",
      "id": "ep_55_ut_43"
    },
    {
      "end": 824854,
      "speaker": "Moritz Stefaner",
      "start": 820394,
      "text": "Just presenting wrong data would be. Or made up data. That's cheating, right?",
      "id": "ep_55_ut_44"
    },
    {
      "end": 828298,
      "speaker": "Mushon Zer-Aviv",
      "start": 825714,
      "text": "That's cheating. At least in these rules.",
      "id": "ep_55_ut_45"
    },
    {
      "end": 829934,
      "speaker": "Moritz Stefaner",
      "start": 828426,
      "text": "Then you would be a politician.",
      "id": "ep_55_ut_46"
    },
    {
      "end": 843004,
      "speaker": "Mushon Zer-Aviv",
      "start": 833434,
      "text": "Another very sophisticated one. I think the most sophisticated politicians tell the truth in deceitful ways.",
      "id": "ep_55_ut_47"
    },
    {
      "end": 855444,
      "speaker": "Moritz Stefaner",
      "start": 843944,
      "text": "What's different? Like, what's different about lying with charts and data, as opposed to lying in a speech? Like, with words like, what do you think? What's the main difference?",
      "id": "ep_55_ut_48"
    },
    {
      "end": 968732,
      "speaker": "Mushon Zer-Aviv",
      "start": 856024,
      "text": "So I think this is very indicative of the time we're at. And Enrico can speak about that because he has actually research that when we are seeing a chart, we actually see that as representative of a scientific process. And automatically by seeing a chart in some form of representation that is a symbol of. There has been a rigorous process that maybe I'm not equipped to understand or this is already processed in a way that is professional in a way. Charts have become these icons of the scientific process. So when you can attach them to whatever you want and it would automatically become more credible. And that is kind of lowering our, our defenses when it comes to maybe a bit more critical thinking. Now, when we're just talking or when we're seeing a speech, we are as versed in speaking, or we have the tools of speech just as much as the next person or the person that we're listening to. So we're seeing this as this somewhat equal ground. But when someone else is presenting the data through this visual and kind of processed chart, we are seeing that as something much more credible or authoritative.",
      "id": "ep_55_ut_49"
    },
    {
      "end": 969556,
      "speaker": "Enrico Bertini",
      "start": 968868,
      "text": "I think.",
      "id": "ep_55_ut_50"
    },
    {
      "end": 972024,
      "speaker": "Moritz Stefaner",
      "start": 969700,
      "text": "Enrico, you did some research on that, right?",
      "id": "ep_55_ut_51"
    },
    {
      "end": 1058402,
      "speaker": "Enrico Bertini",
      "start": 972444,
      "text": "What were your findings recently? Done, this research, we published a paper, ACM CHI's conference last year or this year? This year. And so part of it is about just comparing, just checking how deceptive common distortion techniques are. Like for instance, the super famous by now truncated axis. So if you truncate the y axis of a bar chart or a timeline, you can actually exaggerate the difference between two or more numbers. And so we present this information to a lot of participants on Amazon mechanical Turk and try to see how much influence this distortion has. And of course it does have a lot of distortion. But I think what is really interesting is that there is part of this analysis that is qualitative. And what we find is that people are, when they are asked why they change or do not change their opinion about a specific topic, when they are presented some charts, they often mention the idea that numbers don't lie. Or it's clear, I saw it in a chart. And so lots of these kind of comments, right? And I think this is the most intriguing part because of course, there's always.",
      "id": "ep_55_ut_52"
    },
    {
      "end": 1059858,
      "speaker": "Moritz Stefaner",
      "start": 1058458,
      "text": "Numbers don't lie. That's amazing.",
      "id": "ep_55_ut_53"
    },
    {
      "end": 1121866,
      "speaker": "Enrico Bertini",
      "start": 1059906,
      "text": "Numbers don't lie. Or things like, oh, I was not persuaded. But after seeing this chart, it's clear where the truth is, right? And so I have to briefly correct myself because this part actually comes from a different paper that we had in mind about persuasion, and persuasion actually checking how and whether charts can persuade more than other visual forms. Like for instance, a simple table. But I think this is the most intriguing part. When you see people expressing themselves in a way that it's really, at least for us, it's surprising because they say things like that, numbers don't lie chart. I saw a chart and it was revealing and all the rest, right? As well as I have to say that some people just don't buy it, I think it's equally interesting that some people comment like, I don't care about the numbers, I don't care about the charts. Whatever you tell me, I will never change my opinion, which is equally worrying. Right?",
      "id": "ep_55_ut_54"
    },
    {
      "end": 1131384,
      "speaker": "Moritz Stefaner",
      "start": 1121930,
      "text": "I mean, some people change comes to mind, right, where there's, like a minority that is just resistant to any rational argument there, right?",
      "id": "ep_55_ut_55"
    },
    {
      "end": 1132724,
      "speaker": "Enrico Bertini",
      "start": 1131424,
      "text": "Totally resistant.",
      "id": "ep_55_ut_56"
    },
    {
      "end": 1312312,
      "speaker": "Mushon Zer-Aviv",
      "start": 1135664,
      "text": "There's this theory by Stuart Hall. Stuart hall is this media theorist. He wrote a very good argument, good article that I would really recommend everybody to read called encoding, decoding. And he's speaking about communication as something that, you know, there's this idea of communication cycle, like in the Sesame street kind of thing. I have a triangle, and I tell you my triangle. Now, you have a triangle and you, and you have a circle, and you tell me your circle. Both of us have both triangles and circles in our brains. But that's a very simplistic way of seeing communication, because what actually happens is there are a couple of creative processes in communication. So the first one is encoding, where I'm encoding my ideas into space or some other form of communication. And the second one is decoding, where you are hearing my speech or seeing my images of visualization, and you are in a creative process turning that into your framework of knowledge and so on. And he was mentioning three types of decoding. One is the hegemonic code. So whatever you say, that is like, numbers don't lie. Whatever you present to me, I would decode it with the same code, and I would completely agree with that. The second one is the negotiated code. So I know that some of it is true and some of it might be wrong, but I'll try to negotiate with it. And the third one is the oppositional code. And these are the ones who would say, no matter what you say, I see your bias, I see your code, and I would only use that as a way of dismissing you altogether. So the extents are kind of bad, because the extents are both, in a way, uncritical, because both of them are not negotiating. And the negotiated code, this idea of I'll take some and I'll dismiss some, and I'll try to understand the encoding of that message as something that is based in many interests and many fall abilities and culture and whatever, and I'll take from that what I might take. I actually use that example usually when I'm talking about interface, because in a way on the web, we don't have the option of negotiated or positional code. Everything on the web is hegemonic because we communicate with the same interface that we were given. But that's a completely different thread of my work, so let's not get into that.",
      "id": "ep_55_ut_57"
    },
    {
      "end": 1328484,
      "speaker": "Moritz Stefaner",
      "start": 1312368,
      "text": "Maybe later. What are some of the, like, some of the tricks or tips, like, for spotting bullshit or for spotting lies? Like, what are the things now that you have been working on this topic, what are you watching out for? What are the typical traps people set up?",
      "id": "ep_55_ut_58"
    },
    {
      "end": 1368224,
      "speaker": "Mushon Zer-Aviv",
      "start": 1329344,
      "text": "So I think, at least in the workshop, I was pointing at three areas of where this disinformation visualization can happen. The first one is even before the visualization. That's the content step. That's where the data is gathered. As I say, the term raw data is an oxymoron. There's no, raw data is a product of language. Even if it's a binary language, it's still language.",
      "id": "ep_55_ut_59"
    },
    {
      "end": 1375096,
      "speaker": "Moritz Stefaner",
      "start": 1368344,
      "text": "Yeah. And there's a measurement process behind it that might be faulty or, like, has a bias built in already and so on.",
      "id": "ep_55_ut_60"
    },
    {
      "end": 1401178,
      "speaker": "Mushon Zer-Aviv",
      "start": 1375280,
      "text": "Yes. So in the article, I'm giving the example of the pro choice, pro life debate, and I'm asking, should the killing of babies be legalized? Hopefully, people are not so much into killing babies, but then I could also ask, should women have the rights to their own bodies? And hopefully most people would say yes. And then, so you frame the same.",
      "id": "ep_55_ut_61"
    },
    {
      "end": 1406134,
      "speaker": "Moritz Stefaner",
      "start": 1401226,
      "text": "Problem, like, in two different ways. You establish a framing for it that's different.",
      "id": "ep_55_ut_62"
    },
    {
      "end": 1469116,
      "speaker": "Mushon Zer-Aviv",
      "start": 1406994,
      "text": "Yeah. And you could ask, should abortion be legal? And that would be somewhere in the middle and a bit more fair. But this is a very political debate. But at the same time, we can see whatever type of sampling, even the most scientific sampling, is open to diversion. So the first question should be about how was the data gathered? The second one should be about structure. So the Gallup has actually been polling the issue of a pro choice, pro life for the last almost 20 years. And the way they frame the question is much more fair, they call it, with respect to the abortion issue, would you consider yourself to be pro choice or pro life? So if you are an American, you probably know what the meaning of these terms are. And. And then they've been collecting data on.",
      "id": "ep_55_ut_63"
    },
    {
      "end": 1477828,
      "speaker": "Moritz Stefaner",
      "start": 1469180,
      "text": "Still, it's hard to say I'm not pro life. It's still, you know, it's. It's still like a very clear bias already, I think, in the question.",
      "id": "ep_55_ut_64"
    },
    {
      "end": 1601984,
      "speaker": "Mushon Zer-Aviv",
      "start": 1477916,
      "text": "Yeah, it's, it's kind of, it's kind of hard to even say you're not pro choice. It's like Americans are all about choice and American. Oh, yeah, maybe the words, the terms, these words are really important as it is. And that is the world we're living in. This is a part of language. So far, we haven't even visualized anything. We just collected data. But then how do you pull that data? So how do you sample that data? If you have a big data set, even like 20 years of people answering this question, you can choose to sample it, like every couple of years. You can choose to use every year and show the results. If you put it on a line graph, you can choose, are you showing the zero axis? How are you condensing the graph itself? And then you have different age groups. So one of the, one of those using this data was a site called liveaction.org. and you can guess where, on that balance, live action sits. And they decided to only poll ages 18 to 29. And you see these ages and you think to yourself, well, 18 to 29 makes sense. These are ages where people might have abortion. So there's no chance they pulled that because that's the kind of results that they wanted to get. So when they pull, when they query these age ranges, they get answers that are very much supportive of the pro life argument. So that is another way of. Of getting the answer you want.",
      "id": "ep_55_ut_65"
    },
    {
      "end": 1608444,
      "speaker": "Moritz Stefaner",
      "start": 1602024,
      "text": "So the younger people are more pro life actually currently or at the time of the survey.",
      "id": "ep_55_ut_66"
    },
    {
      "end": 1632996,
      "speaker": "Mushon Zer-Aviv",
      "start": 1608904,
      "text": "At the time of that survey. And I actually took that graph and tried to check it on all of society and to take a couple more samples from a few years after that graph was made. And it's still fluctuating. And it's not. There's nothing decisive. But when people are seeing also it's.",
      "id": "ep_55_ut_67"
    },
    {
      "end": 1640304,
      "speaker": "Moritz Stefaner",
      "start": 1633060,
      "text": "Opinion data, this comes back to the content aspect. If you talk about opinion data, everything can happen, right? It's like, yeah.",
      "id": "ep_55_ut_68"
    },
    {
      "end": 1802606,
      "speaker": "Mushon Zer-Aviv",
      "start": 1641444,
      "text": "And it's affected by who's in power in government right now, if I would say that I'm pro choice, am I supposed, is that a way of supporting Obama? And I don't want to support Obama or the other way around. I don't want to support Bush. No doubt that polls are very noisy in that sense, especially in big arguments like this, where we don't get a lot of negotiated code. People are not negotiating with a question. When you're asking them, it's like asking, which camp are you on? Like which football group you're for? It's not something you're debating that much. So that would be the structure. But then most fun is obviously happening in the presentation. Layer. So in this division of content, structure, presentation, the, when you're, when you're choosing the representation of the data, the visual representation of the data, that's where the most diversions can happen. And there I'm actually showing. And this is something you need to see, this icon of a mummy throwing a fetus to the garbage. It's kind of crazy. Kind of crazy. Completely over the top, but it really looks like the most iconic representation of a woman and the most iconic representation of a garbage can and what would be the most iconic representation of a fetus. But this mashup is kind of horrifying and at the same time, another thing that they've done there in this infographic, they put so much data and so many little kind of charts on the same infographic that you don't really get to that deliberative point. You just get the first impression and you move on and you move on and you move on. So that's another technique. If you don't want people to be very critical of what you're doing, just put a lot of it it and they'll just see another thing and another thing and another thing.",
      "id": "ep_55_ut_69"
    },
    {
      "end": 1805638,
      "speaker": "Moritz Stefaner",
      "start": 1802710,
      "text": "You just don't stop talking and everybody will be confused.",
      "id": "ep_55_ut_70"
    },
    {
      "end": 1808234,
      "speaker": "Mushon Zer-Aviv",
      "start": 1805726,
      "text": "Exactly. Exactly.",
      "id": "ep_55_ut_71"
    },
    {
      "end": 1826282,
      "speaker": "Enrico Bertini",
      "start": 1809054,
      "text": "Data stories is supported by Tableau software, helping people see and understand their data. Tableau lets people connect to any kind of data and visualize it on the fly. Databases, spreadsheets and even big data sources are easily combined into interactive visualization reports and dashboards.",
      "id": "ep_55_ut_72"
    },
    {
      "end": 1877884,
      "speaker": "Moritz Stefaner",
      "start": 1826338,
      "text": "And by now there's a new version out. So the latest version is Tableau nine. And in Tableau nine you'll find features that makes the product smarter about what you're doing from a new start experience with data prep tools to more analytics features and smart maps, for instance with geographic search. So you can just type in the name of a city directly, go there. Really nice. Across the entire analytical flow, they have invested heavily in performance and so everything's much faster now. And there's new features to help you share your findings and also collaborate with data. The thing I really like the most is the new data import tool because you can finally split individual columns by deliberate tests and also pivot directly a data table. So what you know from Excel, the pivot function is now directly into data import and that saves so much time. So I'm a big fan of that.",
      "id": "ep_55_ut_73"
    },
    {
      "end": 1892478,
      "speaker": "Enrico Bertini",
      "start": 1878454,
      "text": "Great. So if you want a free trial, visit Tableau software@Tableau.com. Datastories this is Tableau.com Datastories.",
      "id": "ep_55_ut_74"
    },
    {
      "end": 1894274,
      "speaker": "Moritz Stefaner",
      "start": 1892526,
      "text": "That's right. Now back to the interview.",
      "id": "ep_55_ut_75"
    },
    {
      "end": 1923436,
      "speaker": "Enrico Bertini",
      "start": 1895134,
      "text": "But I have to say that this is an example where the bias or the intent to persuade people to skew people's opinions towards a certain outcome is pretty clear. Right. But I think what is interesting is those cases where these, you cannot really spot that easily, these icons or this kind of really highly biased tendency. Right.",
      "id": "ep_55_ut_76"
    },
    {
      "end": 1935014,
      "speaker": "Moritz Stefaner",
      "start": 1923620,
      "text": "I agree. If it doesn't happen on the presentation layer, but if you have a very clean presentation, very, you know, the colors are all nicely picked and it's all clean. And this is when the worst things happen.",
      "id": "ep_55_ut_77"
    },
    {
      "end": 1935750,
      "speaker": "Mushon Zer-Aviv",
      "start": 1935174,
      "text": "Yeah.",
      "id": "ep_55_ut_78"
    },
    {
      "end": 2008588,
      "speaker": "Enrico Bertini",
      "start": 1935862,
      "text": "Once again, I think what is interesting here is this. I mean, I'm not a philosopher, but I think objectivity and how objectivity is perceived through data and charts is a very important and relevant topic here because I think historically we connect the idea, we connect data to science and science to objectivity. And because of that, when numbers are displayed either in a table or in graphical formats, we tend to believe that there is some truth. Right. And my impression is that to some extent it used to be like that because data was mostly the domain of science and statistics and done by people who are professional in this area and perceived as professionals. But right now the situation is completely different. Data is available everywhere and to everyone. So things are changing. But what has not changed yet is how people probably consume this information.",
      "id": "ep_55_ut_79"
    },
    {
      "end": 2044576,
      "speaker": "Mushon Zer-Aviv",
      "start": 2008716,
      "text": "Right, exactly. And that's where I have some issues with this term that Edward Tufte suggested in his, one of his books is, and I'm a big fan of Edward Tufte for the same reasons that many of us are, but he chose as a title of one of his books, he called it beautiful evidence. And I think that if we think about visualization as evidence, that's kind of counterproductive because the way you're already on the wrong track.",
      "id": "ep_55_ut_80"
    },
    {
      "end": 2048264,
      "speaker": "Moritz Stefaner",
      "start": 2044640,
      "text": "Right. It's like you start off on the wrong foot if you think of it this way.",
      "id": "ep_55_ut_81"
    },
    {
      "end": 2179310,
      "speaker": "Mushon Zer-Aviv",
      "start": 2048304,
      "text": "Yeah, it's. We should, what I'm suggesting is that we should think of visualization as arguments. So there might be beautiful arguments, there might be less beautiful arguments, but they are visual arguments and they are a part of speech. And if we think about them as a part of speech, then we can, we can be more mindful for different kinds of ways of decoding them. Right now, I think visualizations are. I don't see visualization as the enemy. I do visualization not because I've found, oh, amazing, I can lie to everybody and no one would notice, but because I actually think that where we are with media right now, they're kind of crucial because they are a way of communicating a bit of a more data driven or common ground driven debate. I would love the debate to be much more based on data, but I would like it to be a negotiated debate. I would like that to be negotiation, rather than seeing data and just saying, oh, there's no problem there, there's data. I would like more people to use data, and I would like to see more use of data and data visualization in debate by understanding that there are different ways of reading the data. And I'm not only talking about political data like pro choice, pro life, I'm talking about scientific data. And we can see, in the scientific field, you can see scientists continuously challenging ways of reading the data. But because visualization and data has become so fundamental in our lives, we need to be as versed in data and to accept it not as evidence, but as argument, and therefore something we should visualize. Background.",
      "id": "ep_55_ut_82"
    },
    {
      "end": 2235314,
      "speaker": "Moritz Stefaner",
      "start": 2179342,
      "text": "Yeah, I totally agree. And I would even go as far and say, like, visualization is actually the problem and the solution because it's like, for so many people, it's really a gateway drug into this whole general data science, investigative detective work, stream of activity that we all like. And so I think many people are drawn into these fields because they like these really interesting cool interfaces and these cool charts. And then once they built their own visualizations, they realize, oh, man, you really have to think about what the data means and what is being left out and how you actually measure something and not just take the results of an API, but think about how would I have to transform it to make it more truthful. So I'm a positive person. Of course I'm an optimist. I think actually data visualization part of the solution here.",
      "id": "ep_55_ut_83"
    },
    {
      "end": 2238310,
      "speaker": "Mushon Zer-Aviv",
      "start": 2236934,
      "text": "But I buy that.",
      "id": "ep_55_ut_84"
    },
    {
      "end": 2313424,
      "speaker": "Enrico Bertini",
      "start": 2238342,
      "text": "I have to say that at the same time, I'm not sure I fully agree with this, with this view, because if everything is an argument at some point, I'm not even sure why do we use data at all. Right. I mean, let me state it in a different way. I mean, I think one of the powerful functions of working with data and using a scientific approach to thought is that because through data manipulation or mathematical manipulation of symbols, we can distance ourselves from our, I don't know, our core beliefs or anything that is subjective. That's the very reason why we do it originally. Right? So I see a little bit of tension between these two worldviews. I don't know. I think there is a welcome world. Yeah, I mean, what I mean is that there is space for using data as a way to get to a truer truth. Right. That's what science tries to do. So I'm not sure that's always true.",
      "id": "ep_55_ut_85"
    },
    {
      "end": 2398264,
      "speaker": "Mushon Zer-Aviv",
      "start": 2313764,
      "text": "So the term I really like for it is from, I don't know if he made it, but David Weinberger wrote this book, too big to know, another recommendation, and he's talking about stopping points. So he's all about how, you know, in the subtitle of the room is how something like where experts are everywhere and the smartest person in the room is the room itself. But he's talking about the fact that we are not as based on books and experts as much. And that's actually a problem because the very important role of experts and books and let's say credible data, is that they provide stopping points. And I really like this term stopping points because at some point you need to stop debating and start building on top of things. You need to, you know, you can't just question and question and question and question. You need to move forward. And that is something that is very crucial to society at large. Science, definitely. But it's this balance.",
      "id": "ep_55_ut_86"
    },
    {
      "end": 2437744,
      "speaker": "Moritz Stefaner",
      "start": 2398384,
      "text": "But also in science, it's not just data, but it's agreed upon data. And I think that's a really, it's a big difference. It's not just data that move science forwards, but it's data that has been dewaded and has been whetted and has been verified and has been reproduced. And that's all the dialogue that's happening. And I think that's the dialogue you're asking for. Right. Not just take data and say, this is the end of it, but say, in order to make this a stepping stone for the next step, we need to have seen it from all sides. We need to have heard a few arguments around it. We all need to agree it's valid, you know, truthful data, if you like, and then we can move on.",
      "id": "ep_55_ut_87"
    },
    {
      "end": 2483458,
      "speaker": "Mushon Zer-Aviv",
      "start": 2438484,
      "text": "And then we can, you know, we can argue back with it. We can. There's room. There's room for. It's actually a way of making it better. Right. So one of the, one of the terms I'm kind of playing with is this kind of an answer to this culture of disambiguation, right. Every, like, disambiguation is a word that is used a lot in our field, but it's kind of, it was added into culture through mainly Wikipedia. Right. In Wikipedia, everything needs to be disambiguated before we can even start talking. Right. And when I, when I.",
      "id": "ep_55_ut_88"
    },
    {
      "end": 2485454,
      "speaker": "Moritz Stefaner",
      "start": 2483586,
      "text": "And also Google, did you mean.",
      "id": "ep_55_ut_89"
    },
    {
      "end": 2502936,
      "speaker": "Mushon Zer-Aviv",
      "start": 2485874,
      "text": "No, I didn't mean and I think there's something so important about ambiguity that it's not the enemy and there's room for ambiguity in culture. And scientists don't like it so much.",
      "id": "ep_55_ut_90"
    },
    {
      "end": 2506136,
      "speaker": "Moritz Stefaner",
      "start": 2502960,
      "text": "Scientists don't like it's just the artist.",
      "id": "ep_55_ut_91"
    },
    {
      "end": 2508032,
      "speaker": "Mushon Zer-Aviv",
      "start": 2506320,
      "text": "I would call for reambiguation.",
      "id": "ep_55_ut_92"
    },
    {
      "end": 2577934,
      "speaker": "Enrico Bertini",
      "start": 2508168,
      "text": "Again, I think a lot of people play with this ambiguity, right? I mean, sometimes this becomes, I don't know, a way to argue against something that is very scientifically supported. So again, it's a very fine line, right? On the one hand, you don't want to, you want to agree that even science to some extent is an argument. But on the other hand, if you open this door, then it's a pandora's box because everyone can poke this box and say, oh yeah, but this, but that, right? And so I think it's tricky. It's a tricky issue and probably we don't, at least I don't understand enough of it yet, but I see that there is a problem, right? So a typical example is climate science, right? So as far as I can tell, scientists seems to agree quite a lot on what is happening around the world, but there are people who are always debating against whatever scientific evidence they produce, right? So it's tricky.",
      "id": "ep_55_ut_93"
    },
    {
      "end": 2610884,
      "speaker": "Mushon Zer-Aviv",
      "start": 2577974,
      "text": "It's very tricky because those who argue that they don't really negotiate with the data, this is the classic oppositional reading, the classic oppositional decoding. They want to discredit the ideas. They don't want to challenge, they don't want to challenge the science, they want to challenge the politics, right? And they want to destable the scientific truth that was already agreed on.",
      "id": "ep_55_ut_94"
    },
    {
      "end": 2625334,
      "speaker": "Moritz Stefaner",
      "start": 2612664,
      "text": "We have the same with evolution, of course, when like evolution, it's just a theory, it's just an opinion somebody has about the world, right? I think that is devaluing what's, what's going on.",
      "id": "ep_55_ut_95"
    },
    {
      "end": 2708620,
      "speaker": "Mushon Zer-Aviv",
      "start": 2625374,
      "text": "So it is. But I'm okay with keeping everything within this field of discourse. Within the field of discourse. There are people that are very, very, very credible. And when they use language, I am completely with them and they make strong arguments. And even though these are arguments and maybe I can make arguments as well, that doesn't make them uncredible. I think if we can allow ourselves to have this range between very, very credible speech and complete bullshit within visualization as well, then we can get the best of both worlds and we can maybe evolve a bit from this culture of I trust the numbers. I've seen the numbers and I've seen God or something. And the opposite of don't show me, I don't need numbers. I already know. And there's nothing you can say that would convince me otherwise.",
      "id": "ep_55_ut_96"
    },
    {
      "end": 2737574,
      "speaker": "Moritz Stefaner",
      "start": 2708812,
      "text": "Yeah, it's a great topic, and I mean, it touches in the end really, on scientific theory as a whole, and as you mentioned already, communication theory and all kinds of things. So it's probably a topic for a whole PhD, if in case you're inclined. Can I ask something else? I don't know much about the situation in Israel, like open data wise and data visualization wise. And can you tell us a bit about that? What's going on in Israel, in this field?",
      "id": "ep_55_ut_97"
    },
    {
      "end": 2742774,
      "speaker": "Mushon Zer-Aviv",
      "start": 2737994,
      "text": "So Enrico just spent some time in the sun.",
      "id": "ep_55_ut_98"
    },
    {
      "end": 2750922,
      "speaker": "Enrico Bertini",
      "start": 2743554,
      "text": "Oh my God, I loved it. I loved it. I hope you can invite us again sometime in the future.",
      "id": "ep_55_ut_99"
    },
    {
      "end": 2923044,
      "speaker": "Mushon Zer-Aviv",
      "start": 2751098,
      "text": "So just a few weeks ago, we had the first is biz, the Israeii visualization conference. It was a day and a half. We had Enrico, we had Robert Kosara, we had. These are two usual suspects, no doubt. We had Barbara Otzewelsky from Stanford and Columbia universities. We had Giulio Frigieri from the Guardian. And the title of the conference was mechanized images for human eyes. So this question about this, like, what does it mean to have machines creating images for us? That was already embedded in the title and we were really pointing at reading it from the perspective of science and technology, design and visual culture, and then psychology and cognitive science. So this triangle was very apparent throughout the conference. And these questions that we have here were very alive. So that was very interesting. And that was, I would say that was, in a way, an inaugural event for the Israeii visualization community. It took place at Shinkao, that's the college where I teach it. We also teach visualization classes and so on. And as for Israel at large, Israel has a very thriving technology scene, a very thriving startup scene, and a lot of it has to do with data, a lot of it has to do with visualization, but it hasn't been a community yet. I can tell you that in the work that we're doing, I'm volunteering with a public knowledge workshop, which is an ngo doing government transparency and civic engagement. And a lot of the volunteers that come are technologists that are working a lot with data and designers that are working with visualization and trying to. And the approach that we have, and I would say for better or worse, the knowledge that people have from the science, from their, a military experience in intelligence used for, I wouldn't use the term evil, but not like data that doesn't come in peace. Let's say that we are trying to apply that for good.",
      "id": "ep_55_ut_100"
    },
    {
      "end": 2933226,
      "speaker": "Moritz Stefaner",
      "start": 2925464,
      "text": "Because people acquired the skills in the military, but they can also apply the same techniques, of course, on open data sets or for public good.",
      "id": "ep_55_ut_101"
    },
    {
      "end": 3086788,
      "speaker": "Mushon Zer-Aviv",
      "start": 2933330,
      "text": "Yeah, so you have kids that are coming out of the army at the age of 21, and they've already processed huge amounts of big data, and the python skills are top notch, and then they're trying to save their souls by making Israel work a bit better rather than the other way around. Don't get me started, but I can say that maybe as an example of something that we've encountered, where we encountered these dilemmas with data. Together with Adam Kariv, I'm heading the budget key project, looking at the Israeii budget data and trying to understand policy from the numbers. Two years ago, we launched this big project. This was a collaboration with a daily newspaper, calculist, in Israel, and we visualized the comparison of the budget that was inspired by a work of the New York Times. And. And that has really changed the debate on that budget that year. This visualization has become kind of the table of contents for the budget debates, even within the parliament itself. They actually used it instead of the books. And that was a huge moment for us. But as this was going, we actually realized that we presented everything in a very. In a pretty neutral and fair way. But there was a huge data set that we were completely ignoring. From the moment that the budget is signed into law and the budget year starts in Israel, the budget changes and changes and changes and changes. So we were telling everybody, look, try to compare this lie with this lie. These are two data sets that don't represent the actual policy. And that was a terrifying aha. Moment for us, that we were fooling ourselves as well.",
      "id": "ep_55_ut_102"
    },
    {
      "end": 3093724,
      "speaker": "Moritz Stefaner",
      "start": 3086916,
      "text": "But what is it they don't? So they set up guidelines every year of how to use the money, but then they use it differently. Is it like this?",
      "id": "ep_55_ut_103"
    },
    {
      "end": 3149624,
      "speaker": "Mushon Zer-Aviv",
      "start": 3093844,
      "text": "They set up guidelines, but as soon. But they set them up knowing that they would pass amendments and transactions from one item to another. And they know that they do it through a process that is completely opaque and where parliament is supposed to be doing oversight, but it's only a rubber stamp. So over the last two years, we've been focusing on that. We've been releasing, we've been getting them to release much more data. We've actually, within that data, there was a corruption case hiding that is just blowing up in Israel really big time. Another thing that is coming up. So this questioning of how do you even question the data yourself are also very revealing for us.",
      "id": "ep_55_ut_104"
    },
    {
      "end": 3159804,
      "speaker": "Moritz Stefaner",
      "start": 3151204,
      "text": "And sometimes you feel it's a bottomless pit. Like, you know, any problem you solve, you have five new ones, but at the same time, that's what progress looks like, I guess.",
      "id": "ep_55_ut_105"
    },
    {
      "end": 3182174,
      "speaker": "Mushon Zer-Aviv",
      "start": 3159844,
      "text": "Yeah, it's politics. It is politics and it's speech and it's policy. It's supposed to be a bottomless pit because the only bottom of a pit like this is totalitarianism. Right? So you want to continuously fall down that pit and try to hang it something and. And hope for the best.",
      "id": "ep_55_ut_106"
    },
    {
      "end": 3223324,
      "speaker": "Enrico Bertini",
      "start": 3183234,
      "text": "Let me ask you something, maybe somewhat personal, because. So it's really interesting to me to talk to people like you who are developing visualizations with such a strong potential political impact. And I had a similar experience talking to people who work on investigative journalism. So if I had to do the same, I would be so scared, right? Especially I would be so scared that a clever person can actually find a big fault in whatever I'm putting out there, which has such a strong argument. So how do you live with that?",
      "id": "ep_55_ut_107"
    },
    {
      "end": 3349484,
      "speaker": "Mushon Zer-Aviv",
      "start": 3224904,
      "text": "We consult with a lot of people. We try to communicate the fact that we are, as much as we are a very prominent NGO and we are very authoritari, we are very authoritative. There's a lot of. We're very respected in the Israeii media field and the political scene at the same time, we try to put up kind of small flags reminding people that this is just one way of reading the data. We are trying to use conversational language to remind people that this is not some faceless corporation or the scientific truth bubbling from the heart of the earth. These are people, volunteers, that are trying to look at this data and make sense of it. And then there's something that we've started working on which that we call the data tours. When we were launching the latest website, we included this guided tour within the site, and that was inviting people, kind of showing them the features and explaining a bit of the budget to them and the terminology and everything. And then we realized that this is actually a great way of telling a story, not a great way of doing annotation. But if we can take that and extend that, then we can turn annotations in visualization and data sites to be more than just a monologue, that can be a dialogue or an invitation for someone to speak back with visualization. So we're now developing this data tours as a platform for people to take, for anyone to take us on a tour of visualization. So that's something that we're playing with.",
      "id": "ep_55_ut_108"
    },
    {
      "end": 3368604,
      "speaker": "Moritz Stefaner",
      "start": 3350624,
      "text": "And by adding a narrator, you immediately add that personal commentary layer that helps frame the information the right way, but also makes clear. Okay. There's people behind that. I think in many cases, that can really, it's often just a matter of mindset. And if you're reminded there's a person there.",
      "id": "ep_55_ut_109"
    },
    {
      "end": 3394336,
      "speaker": "Mushon Zer-Aviv",
      "start": 3370664,
      "text": "Reminded that there's a human there, and that. And that human is. Is making one, making choices and pointing at things. And as much as they pointed at this data point within a chart, they. I could point at something else. And that is a way of reminding people, hey, we're still interesting.",
      "id": "ep_55_ut_110"
    },
    {
      "end": 3427496,
      "speaker": "Moritz Stefaner",
      "start": 3394480,
      "text": "Yeah. Because there's also the same phenomenon when you have news moderators or, like the. The anchorman at news shows on tv. Like, some of them, they are just purely, like, in the daily news in Germany. Some of them are just the medium, like the pure. I'm just reading this, you know, there's no emotion involved. And others, they might raise an eyebrow occasionally or, like, you know, like, shake the paper a bit. And then others, it's clear they have a strong opinion on, you know, what they are talking about. And I guess we have the same bandwidth in data visualization.",
      "id": "ep_55_ut_111"
    },
    {
      "end": 3454708,
      "speaker": "Mushon Zer-Aviv",
      "start": 3427560,
      "text": "Right. And that's. That's a range of emotions and personality that, that as humans, we've learned to identify really quickly, and we can already identify them, identify it more and more through text as well. But we want to have that within visualization as well. So that's something that we're trying to practice within the work that we do.",
      "id": "ep_55_ut_112"
    },
    {
      "end": 3455344,
      "speaker": "Moritz Stefaner",
      "start": 3454756,
      "text": "Great.",
      "id": "ep_55_ut_113"
    },
    {
      "end": 3496986,
      "speaker": "Enrico Bertini",
      "start": 3456644,
      "text": "I think what is interesting to notice is that right now we have situations that are at both ends of the spectrum. So what I mean is that you can have this kind of highly polished visualizations that are narrated by a person and basically walking you through a set of facts. And at the other end of the spectrum, we have visualizations that give you a little bit of introduction, but then let you completely explore everything on your own. Right. And both things are really interesting and probably will be. We will see developments in both areas in the future, I guess.",
      "id": "ep_55_ut_114"
    },
    {
      "end": 3499874,
      "speaker": "Mushon Zer-Aviv",
      "start": 3497050,
      "text": "Yeah. Cool.",
      "id": "ep_55_ut_115"
    },
    {
      "end": 3529466,
      "speaker": "Enrico Bertini",
      "start": 3499954,
      "text": "So, Mushon, so one thing that is really interesting in your work is also this idea of using, let's say, deceptive data or misleading data in a quote, unquote positive way or for a good purpose. I'm referring to your project called adnasium. Can you briefly explain what this is and what's the concept behind that?",
      "id": "ep_55_ut_116"
    },
    {
      "end": 3710566,
      "speaker": "Mushon Zer-Aviv",
      "start": 3529570,
      "text": "Sure. So I'll try to tie that into a bit of the discussion that we had. So, ad nauseum is this initiative. I'm a partner with Helen Nissenbaum of NYU and Danyel Howe, media artist. This is addressing the ad network privacy debate, the fact that without any consent, there are these profiles that are built on us just by the data that is collected on us. And then the ads that were being shown are based on that. And if we click on one of these ads, that's a strong signal of what we're interested in. And this profile is collected and collected and collected, and even attempts at regulating that, like the do not track initiative, haven't gone anywhere. As netizens or eyeballs, we are not even in a position to argue. And it's not like we've signed anything. So some people would want to know anything about it and hope for the best. Others know that we're pretty much fine and say, okay, that's just the way the world is. Others, and more so since the Snowden revelations, have started to protect themselves through different cyber security measures. And what we're trying to suggest is a fourth way, which is a bit more expressive and more fun, which is picking up a fight with them. So what we've done is we've built this browser plugin called ad nauseum, ad nauseam, IO that works with your ad blocker. And every ad that is blocked by your blocker is then silently clicked by ad nauseum. So we click every ad which pollutes your profile to the level that the data that is gathered on you doesn't make any sense anymore. And that is following this thread of work that Danyel and and Helen have been working on for a while under this approach of obfuscation. So, data obfuscation as a countermeasure for data gathering and data surveillance, rather than trying to hide, because none of us go online to hide, we go online to communicate. We go online to express ourselves, to learn about things we don't go online to hide. So if we take big data at its word, we can check how big this data can be.",
      "id": "ep_55_ut_117"
    },
    {
      "end": 3716518,
      "speaker": "Moritz Stefaner",
      "start": 3710670,
      "text": "Right? We all know you want data. We have data. Yeah, take the data.",
      "id": "ep_55_ut_118"
    },
    {
      "end": 3776372,
      "speaker": "Mushon Zer-Aviv",
      "start": 3716686,
      "text": "Take a lot of it. So it's a very expressive and kind of chaotic way of celebrating personality and expression on the web in a way that is also getting back to understanding what data is, what is its role within who we are, and what it means to collect data, what it means to make decisions based on data. We have this visualization within the add on that shows you at one spot all of the ads that you haven't seen. So at once you can see all of the banners and then kind of ask yourself, is this me? Is this my self portrait? Because I have clicked all of these. So that's kind of officially can I.",
      "id": "ep_55_ut_119"
    },
    {
      "end": 3783712,
      "speaker": "Moritz Stefaner",
      "start": 3776388,
      "text": "Ask you one thing? Do the ads get weirder and weirder that you get because you seem to be interested in everything? Do you get, like, more extreme stuff suddenly?",
      "id": "ep_55_ut_120"
    },
    {
      "end": 3785104,
      "speaker": "Mushon Zer-Aviv",
      "start": 3783848,
      "text": "So it's really hard.",
      "id": "ep_55_ut_121"
    },
    {
      "end": 3786216,
      "speaker": "Moritz Stefaner",
      "start": 3785184,
      "text": "Does it even out?",
      "id": "ep_55_ut_122"
    },
    {
      "end": 3798524,
      "speaker": "Mushon Zer-Aviv",
      "start": 3786280,
      "text": "Like, I think it evens out at some point. But one of the weirdest ones that I got is this invitation to become a project leader in the Mossad.",
      "id": "ep_55_ut_123"
    },
    {
      "end": 3802720,
      "speaker": "Moritz Stefaner",
      "start": 3801424,
      "text": "As a banner ad?",
      "id": "ep_55_ut_124"
    },
    {
      "end": 3804244,
      "speaker": "Mushon Zer-Aviv",
      "start": 3802832,
      "text": "As a banner ad.",
      "id": "ep_55_ut_125"
    },
    {
      "end": 3807524,
      "speaker": "Enrico Bertini",
      "start": 3805624,
      "text": "That was perfect targeting.",
      "id": "ep_55_ut_126"
    },
    {
      "end": 3810664,
      "speaker": "Mushon Zer-Aviv",
      "start": 3808204,
      "text": "Yeah. You know, I have the chops.",
      "id": "ep_55_ut_127"
    },
    {
      "end": 3817464,
      "speaker": "Moritz Stefaner",
      "start": 3812564,
      "text": "Apparently, with the rates this guy is clicking ads, he can do anything.",
      "id": "ep_55_ut_128"
    },
    {
      "end": 3821224,
      "speaker": "Mushon Zer-Aviv",
      "start": 3818324,
      "text": "This is big data in one spot.",
      "id": "ep_55_ut_129"
    },
    {
      "end": 3856436,
      "speaker": "Moritz Stefaner",
      "start": 3822764,
      "text": "There's also a similar project called Floodwatch, just for completeness. It started, I think, pretty much in parallel to yours. Right. It comes from the OCR collaboration with, I can't remember his name, but it was a collaboration, OCR and. Yeah. Jeff Orb. But there was also an external researcher who was working with them on the project, and they did a similar thing. But I think more in analytic. Here's all the ads you get presented. Like, what does that mean about you or your self image and things like.",
      "id": "ep_55_ut_130"
    },
    {
      "end": 3904678,
      "speaker": "Mushon Zer-Aviv",
      "start": 3856460,
      "text": "This, which is very interesting. OCR trying to do. Yeah. They're trying to say, let's try to see what they are doing. Let's try to collect the data ourselves, and maybe you can share it with researchers that you trust, or we'll give you some tools to process it yourself. The project is very similar in the way they are showing you your data. But I would say that Floodwatch still follows the same approach of let's analyze data and see what we can learn. We are interested in creating some data, so we're creating in getting the data to the point of it collapsing into.",
      "id": "ep_55_ut_131"
    },
    {
      "end": 3909294,
      "speaker": "Moritz Stefaner",
      "start": 3904726,
      "text": "Itself, which is moved from observer to activist, I guess, right?",
      "id": "ep_55_ut_132"
    },
    {
      "end": 3915870,
      "speaker": "Mushon Zer-Aviv",
      "start": 3909334,
      "text": "Yeah. And Jerry and I discussed it a bit. It should be. Should do something together, probably. Yeah.",
      "id": "ep_55_ut_133"
    },
    {
      "end": 3925484,
      "speaker": "Moritz Stefaner",
      "start": 3915942,
      "text": "It sounds like a good tag team of projects. Great, great stuff. Fantastic work. That's super interesting.",
      "id": "ep_55_ut_134"
    },
    {
      "end": 3926560,
      "speaker": "Mushon Zer-Aviv",
      "start": 3925864,
      "text": "Thanks so much.",
      "id": "ep_55_ut_135"
    },
    {
      "end": 3935164,
      "speaker": "Enrico Bertini",
      "start": 3926592,
      "text": "Yeah. We could go on forever talking about these things, as usual. As usual.",
      "id": "ep_55_ut_136"
    },
    {
      "end": 3943564,
      "speaker": "Mushon Zer-Aviv",
      "start": 3937864,
      "text": "Now, Enrico should say, or maybe Moritz should answer by saying, we've only scratched the surface.",
      "id": "ep_55_ut_137"
    },
    {
      "end": 3949084,
      "speaker": "Moritz Stefaner",
      "start": 3943864,
      "text": "Yeah, why not? I think, honestly, I think we've scratched the surface idioms.",
      "id": "ep_55_ut_138"
    },
    {
      "end": 3962164,
      "speaker": "Enrico Bertini",
      "start": 3949664,
      "text": "You know what we should do? We should just stop and repeat every single episode for next year to scratch each surface a little longer.",
      "id": "ep_55_ut_139"
    },
    {
      "end": 3965040,
      "speaker": "Moritz Stefaner",
      "start": 3962744,
      "text": "Oh, we just re invite the same people. That's fantastic.",
      "id": "ep_55_ut_140"
    },
    {
      "end": 3965376,
      "speaker": "Mushon Zer-Aviv",
      "start": 3965072,
      "text": "Exactly.",
      "id": "ep_55_ut_141"
    },
    {
      "end": 3965880,
      "speaker": "Enrico Bertini",
      "start": 3965400,
      "text": "That's what I'm saying.",
      "id": "ep_55_ut_142"
    },
    {
      "end": 3967924,
      "speaker": "Moritz Stefaner",
      "start": 3965912,
      "text": "Yeah. That's brilliant. Let's do that.",
      "id": "ep_55_ut_143"
    },
    {
      "end": 3970576,
      "speaker": "Enrico Bertini",
      "start": 3969864,
      "text": "Cool.",
      "id": "ep_55_ut_144"
    },
    {
      "end": 3972364,
      "speaker": "Moritz Stefaner",
      "start": 3970720,
      "text": "Okie dog. Thanks so much.",
      "id": "ep_55_ut_145"
    },
    {
      "end": 3973880,
      "speaker": "Enrico Bertini",
      "start": 3972824,
      "text": "Thanks a lot.",
      "id": "ep_55_ut_146"
    },
    {
      "end": 3975038,
      "speaker": "Moritz Stefaner",
      "start": 3974032,
      "text": "It was great having you.",
      "id": "ep_55_ut_147"
    },
    {
      "end": 3976882,
      "speaker": "Enrico Bertini",
      "start": 3975136,
      "text": "So let us know, if you organize.",
      "id": "ep_55_ut_148"
    },
    {
      "end": 3980186,
      "speaker": "Mushon Zer-Aviv",
      "start": 3976938,
      "text": "ISBIs again next year is this is happening again?",
      "id": "ep_55_ut_149"
    },
    {
      "end": 3981754,
      "speaker": "Moritz Stefaner",
      "start": 3980210,
      "text": "And if you need a keynote speaker.",
      "id": "ep_55_ut_150"
    },
    {
      "end": 3998494,
      "speaker": "Mushon Zer-Aviv",
      "start": 3981914,
      "text": "Yeah, yeah, yeah. We will talk. And, and the videos from this year are going to be online, hopefully soon. So I'll definitely ping you. If it's not ready for the time the show is out, I'll ping you on Twitter for that.",
      "id": "ep_55_ut_151"
    },
    {
      "end": 3999834,
      "speaker": "Moritz Stefaner",
      "start": 3998794,
      "text": "Fantastic.",
      "id": "ep_55_ut_152"
    },
    {
      "end": 4003574,
      "speaker": "Mushon Zer-Aviv",
      "start": 3999994,
      "text": "Yeah. So that was a lot of fun. Thank you, guys.",
      "id": "ep_55_ut_153"
    },
    {
      "end": 4004370,
      "speaker": "Enrico Bertini",
      "start": 4003874,
      "text": "Thank you.",
      "id": "ep_55_ut_154"
    },
    {
      "end": 4005010,
      "speaker": "Moritz Stefaner",
      "start": 4004402,
      "text": "Thanks so much.",
      "id": "ep_55_ut_155"
    },
    {
      "end": 4030954,
      "speaker": "Enrico Bertini",
      "start": 4005082,
      "text": "Bye bye. Data stories is supported by Tableau software, helping people see and understand their data. Get answers from interactive dashboards wherever you go for your free trial, visit Tableau software@Tableau.com. Datastories this is Tableau.com Datastories.",
      "id": "ep_55_ut_156"
    }
  ],
  "confidence": 0.925365968824667,
  "audio_duration": 4031,
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_status_code": null,
  "webhook_auth": false,
  "webhook_auth_header_name": null,
  "speed_boost": false,
  "auto_highlights_result": null,
  "auto_highlights": false,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_audio_quality": null,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "content_safety": false,
  "iab_categories": true,
  "content_safety_labels": {
    "status": "unavailable",
    "results": [],
    "summary": {}
  },
  "language_detection": false,
  "language_detection_threshold": null,
  "language_confidence": null,
  "custom_spelling": null,
  "throttled": false,
  "auto_chapters": true,
  "summarization": false,
  "summary_type": null,
  "summary_model": null,
  "custom_topics": false,
  "topics": [],
  "speech_threshold": null,
  "speech_model": "best",
  "chapters": [
    {
      "summary": "Data stories is supported by Tableau software, helping people see and understand their data. Get answers from interactive dashboards. Wherever you go for a free trial, visit Tableau. com Datastories.",
      "gist": "Data stories in the world with Tableau",
      "headline": "Data stories is supported by Tableau software, helping people see and understand data",
      "start": 120,
      "end": 27074,
      "id": "ep_55_ch_0"
    },
    {
      "summary": "Enrico: I had my first honey harvest of this year. Usually I harvest twice, so we'll see. You should prepare some data stories, honey, especially this one. Special edition. Datastories is 55.",
      "gist": "Enrico's first honey harvest",
      "headline": "Enrico had his first honey harvest this weekend",
      "start": 37264,
      "end": 130214,
      "id": "ep_55_ch_1"
    },
    {
      "summary": "Mushon Zer-Aviv is a designer and data activist. His work focuses on disinformation, visualization. We would like to discuss a little bit of that and many of the other very interesting things that he's been working on.",
      "gist": "Interview with Mushon Zer-Aviv",
      "headline": "Mushon Zer-Aviv is a designer and data activist",
      "start": 130634,
      "end": 172776,
      "id": "ep_55_ch_2"
    },
    {
      "summary": "Mushon is a designer working in Tel Aviv, Israel. His background was in comics. Has been doing a lot of work on open, open government data.",
      "gist": "Mushon on Data and Design",
      "headline": "Mushon is a designer working in Tel Aviv",
      "start": 172880,
      "end": 378252,
      "id": "ep_55_ch_3"
    },
    {
      "summary": "The disinformation visualization workshop aims to explore the darker side of data visualization. Lying with data is the same kind of lying that you do on your cv, right? It's the kind of things that are true, technically true, but completely over the top.",
      "gist": "Disinformation visualization",
      "headline": "You developed disinformation visualization as a workshop for data visualization students",
      "start": 378348,
      "end": 969556,
      "id": "ep_55_ch_4"
    },
    {
      "summary": "Enrico: People often mention the idea that numbers don't lie. He says there are two creative processes in communication. One is encoding and the other is decoding. Some people are resistant to any rational argument there, he says.",
      "gist": "Don't Count Me Out: Chart",
      "headline": "Research looks at whether charts can persuade more than other visual forms",
      "start": 969700,
      "end": 1313244,
      "id": "ep_55_ch_5"
    },
    {
      "summary": "The Gallup has been polling the issue of a pro choice, pro life for the last almost 20 years. The way they frame the question is much more fair. But whatever type of sampling, even the most scientific sampling, is open to diversion.",
      "gist": "How to Spot Distortion in Data",
      "headline": "There are three areas where disinformation visualization can happen",
      "start": 1313944,
      "end": 1808234,
      "id": "ep_55_ch_6"
    },
    {
      "summary": "Tableau lets people connect to any kind of data and visualize it on the fly. Databases, spreadsheets and even big data sources are easily combined into interactive visualization reports and dashboards. If you want a free trial, visit Tableau software@Tableau. com.",
      "gist": "Tableau Software: Update to 9",
      "headline": "Tableau lets people connect to any kind of data and visualize it on the fly",
      "start": 1809054,
      "end": 1885318,
      "id": "ep_55_ch_7"
    },
    {
      "summary": "How objectivity is perceived through data and charts is a very important and relevant topic. We should think of visualization as arguments. I would love the debate to be much more based on data, but I would like it to be a negotiated debate.",
      "gist": "Is Data Visualization Bad for You?",
      "headline": "I would like more people to use data and data visualization in debate",
      "start": 1885486,
      "end": 2313424,
      "id": "ep_55_ch_8"
    },
    {
      "summary": "In science, it's not just data that move science forwards, but it's data that has been dewaded and has been whetted. There's room for ambiguity in culture, but scientists don't like it so much. There are people who are always debating against whatever scientific evidence they produce.",
      "gist": "Talking Science: The Culture of Stopping Points",
      "headline": "David Weinberger says science needs stopping points to move forward",
      "start": 2313764,
      "end": 2725344,
      "id": "ep_55_ch_9"
    },
    {
      "summary": "A few weeks ago, we had the first Israeii visualization conference. Israel has a thriving technology scene, a very thriving startup scene. A lot of it has to do with data, but it hasn't been a community yet.",
      "gist": "Israel's openness to data visualization",
      "headline": "I don't know much about the situation in Israel regarding data visualization",
      "start": 2726124,
      "end": 3182174,
      "id": "ep_55_ch_10"
    },
    {
      "summary": "We are trying to use conversational language to remind people that this is not some faceless corporation or the scientific truth. And then there's something that we've started working on which that we call the data tours. We're now developing this data tours as a platform for people to take, for anyone to take us on a tour of visualization.",
      "gist": "Data Visualizations: A Personal Tour",
      "headline": "You talk to people developing visualizations with strong potential political impact",
      "start": 3183234,
      "end": 3499874,
      "id": "ep_55_ch_11"
    },
    {
      "summary": "Mushon: I'm a partner with Helen Nissenbaum of NYU and Danyel Howe, media artist. This is addressing the ad network privacy debate. Every ad that is blocked by your blocker is then silently clicked by ad nauseum. Do the ads get weirder because you seem to be interested in everything?",
      "gist": "Advertising Surveillance: Exploding the Web's Data",
      "headline": "Mushon: Adnasium addresses ad network privacy debate",
      "start": 3499954,
      "end": 3925484,
      "id": "ep_55_ch_12"
    },
    {
      "summary": "Thanks so much. We could go on forever talking about these things, as usual. Let us know, if you organize ISBIs again next year is this is happening again? And if you need a keynote speaker. The videos from this year are going to be online soon.",
      "gist": "ISBIs 2017: A Celebration of the Data Story",
      "headline": "We could go on forever talking about these things, as usual",
      "start": 3925864,
      "end": 4030954,
      "id": "ep_55_ch_13"
    }
  ],
  "disfluencies": false,
  "entity_detection": false,
  "sentiment_analysis": false,
  "sentiment_analysis_results": null,
  "entities": null,
  "speakers_expected": null,
  "summary": null,
  "custom_topics_results": null,
  "episode_num": 55,
  "episode_metadata": {
    "speakers": [
      "Mushon Zer-Aviv",
      "Moritz Stefaner",
      "Enrico Bertini"
    ],
    "WPid": "323",
    "url": "https://datastori.es/podlove/file/965/s/feed/c/mp3/data-stories-55-disinformation-visualization-and-data-obfuscation-w-mushon-zer-aviv.mp3",
    "episode_title": "Disinformation Visualization w/ Mushon Zer-Aviv"
  }
}