{
  "id": "1b268c31-728c-4809-833d-17ddda30f9f2",
  "language_model": "assemblyai_default",
  "acoustic_model": "assemblyai_default",
  "language_code": "en_us",
  "status": "completed",
  "audio_url": "https://datastori.es/podlove/file/2001/s/feed/c/mp3/70-rachel-binx.mp3",
  "utterances": [
    {
      "end": 6834,
      "speaker": "Rachel Binx",
      "start": 280,
      "text": "I guess this is the thing that you think about at night while you're trying to fall asleep. You're like, what if all of my work is just unintelligible?",
      "id": "ep_70_ut_0"
    },
    {
      "end": 27194,
      "speaker": "Moritz Stefaner",
      "start": 10454,
      "text": "This episode of data stories is sponsored by Quadrigram, a web based application designed to bring data stories to life. With Quadrigram, you can create and share interactive data stories without the need of any coding skills. Check it out at quadrigram.com.",
      "id": "ep_70_ut_1"
    },
    {
      "end": 38876,
      "speaker": "Enrico Bertini",
      "start": 35164,
      "text": "Hey, everyone, data stories number 70. Hi, Enrico.",
      "id": "ep_70_ut_2"
    },
    {
      "end": 40892,
      "speaker": "D",
      "start": 38980,
      "text": "Hey, how's it going, Moritz?",
      "id": "ep_70_ut_3"
    },
    {
      "end": 43676,
      "speaker": "Enrico Bertini",
      "start": 41068,
      "text": "Good, good, good. Just finishing off my week.",
      "id": "ep_70_ut_4"
    },
    {
      "end": 45084,
      "speaker": "D",
      "start": 43780,
      "text": "Yeah, same here.",
      "id": "ep_70_ut_5"
    },
    {
      "end": 54594,
      "speaker": "Enrico Bertini",
      "start": 45244,
      "text": "Yeah. So I had a playful Friday today. I played with image grids of image similarities and with ascii data visualization. So I had like, I had a good day.",
      "id": "ep_70_ut_6"
    },
    {
      "end": 58026,
      "speaker": "D",
      "start": 54634,
      "text": "Wow, this sounds so geeky. Congratulations.",
      "id": "ep_70_ut_7"
    },
    {
      "end": 62174,
      "speaker": "Enrico Bertini",
      "start": 58170,
      "text": "Yeah, I have serious stuff to do, so that's my procrastination.",
      "id": "ep_70_ut_8"
    },
    {
      "end": 64650,
      "speaker": "D",
      "start": 64114,
      "text": "Good, good.",
      "id": "ep_70_ut_9"
    },
    {
      "end": 66266,
      "speaker": "Enrico Bertini",
      "start": 64682,
      "text": "How about you? All good on your side?",
      "id": "ep_70_ut_10"
    },
    {
      "end": 76890,
      "speaker": "D",
      "start": 66330,
      "text": "Yeah, busy, busy with paper. Paper designing, paper writing. The vis deadline is coming up soon, so everyone is a little nervous here.",
      "id": "ep_70_ut_11"
    },
    {
      "end": 78210,
      "speaker": "Enrico Bertini",
      "start": 76962,
      "text": "It's getting tighter and tighter.",
      "id": "ep_70_ut_12"
    },
    {
      "end": 84454,
      "speaker": "D",
      "start": 78242,
      "text": "Yeah. Which is good. I like it in a way. Lots of stuff gets done in a few weeks.",
      "id": "ep_70_ut_13"
    },
    {
      "end": 93846,
      "speaker": "Enrico Bertini",
      "start": 85734,
      "text": "Very good. Okay, let's start. So today we have another very special guest. It's Rachel Binx. Hi, Rachel.",
      "id": "ep_70_ut_14"
    },
    {
      "end": 94494,
      "speaker": "D",
      "start": 93950,
      "text": "Hey, Rachel.",
      "id": "ep_70_ut_15"
    },
    {
      "end": 95154,
      "speaker": "Rachel Binx",
      "start": 94534,
      "text": "Hello.",
      "id": "ep_70_ut_16"
    },
    {
      "end": 110754,
      "speaker": "Enrico Bertini",
      "start": 95534,
      "text": "It's great to have you on. We wanted to have you on for a while already, and now we learned it's the perfect timing we have. So can you give us a little introduction of yourself? You have quite a diverse background. So what have you done in the past? What are you currently doing?",
      "id": "ep_70_ut_17"
    },
    {
      "end": 136404,
      "speaker": "Rachel Binx",
      "start": 111184,
      "text": "Sure. So I've been working in data visualization for several years at this point. I started off at Stamen design in San Francisco and from there was doing some freelancing work and did a couple small companies about making products. And then recently I've been at NASA JPL working on a telemetry visualization tool.",
      "id": "ep_70_ut_18"
    },
    {
      "end": 165966,
      "speaker": "Enrico Bertini",
      "start": 136804,
      "text": "Yeah. And you should definitely check out Rachel's website. She has a lot of really amazing projects, from cool data visualizations to also real products you can order and buy, like pillows and skirts with cool maps and so on, which I love. But I think today we want to mainly talk about the NASA gig because this is, of course, what everybody's interested in. So you've been working at NASA JPL, Jet propulsion laboratory.",
      "id": "ep_70_ut_19"
    },
    {
      "end": 166494,
      "speaker": "E",
      "start": 166030,
      "text": "Laboratory.",
      "id": "ep_70_ut_20"
    },
    {
      "end": 169674,
      "speaker": "Enrico Bertini",
      "start": 166574,
      "text": "Laboratory, right. So what's going on there?",
      "id": "ep_70_ut_21"
    },
    {
      "end": 193996,
      "speaker": "Rachel Binx",
      "start": 170694,
      "text": "Yeah, so JPL is the NASA center that's responsible for most of the, like, the spacecrafts in like outside of Earth. So the deeper spacecrafts, there's the Curiosity rover there, which is probably the most well known, but they also have opportunity and Cassini and dawn and SMAP, a bunch of Earth orbiters. So, yeah, lots of spacecraft.",
      "id": "ep_70_ut_22"
    },
    {
      "end": 195540,
      "speaker": "Enrico Bertini",
      "start": 194020,
      "text": "These are really cute names, by the way.",
      "id": "ep_70_ut_23"
    },
    {
      "end": 196260,
      "speaker": "D",
      "start": 195572,
      "text": "That's so geeky.",
      "id": "ep_70_ut_24"
    },
    {
      "end": 211384,
      "speaker": "Rachel Binx",
      "start": 196292,
      "text": "I know, right? Well, it's funny because they're like, some of them are the more public facing ones. So, like, curiosity is the Mars science laboratory, MSL, and Opportunity is the Mars exploration rover. Mer.",
      "id": "ep_70_ut_25"
    },
    {
      "end": 215544,
      "speaker": "Enrico Bertini",
      "start": 211924,
      "text": "Nice. And so how many people is it roughly there at the laboratory?",
      "id": "ep_70_ut_26"
    },
    {
      "end": 219832,
      "speaker": "Rachel Binx",
      "start": 216164,
      "text": "That's a good question. I think it's a couple thousand. So it's big.",
      "id": "ep_70_ut_27"
    },
    {
      "end": 220184,
      "speaker": "Moritz Stefaner",
      "start": 219928,
      "text": "Yes.",
      "id": "ep_70_ut_28"
    },
    {
      "end": 234804,
      "speaker": "Enrico Bertini",
      "start": 220224,
      "text": "Yeah, yeah. And what's been your job there? And in which unit and how is the whole thing organized? So just assume. I just know the name NASA and I have a big idea. That's pretty cool, but I know nothing how they operate.",
      "id": "ep_70_ut_29"
    },
    {
      "end": 290464,
      "speaker": "Rachel Binx",
      "start": 235384,
      "text": "Can you say? I am in the human interfaces group in the planning and sequencing section of JPL. And so planning and sequencing is about dealing with uplink and Downlink data. That telemetry is a general term for data that's being transmitted. Downlink is data that's received from the spacecraft, and then uplink is making the plan for what the spacecraft should do next. So the tool that I've been working on is mainly concerned with Downlink. So basically, when the spacecraft is transmitting data, it is received by the deep space network. And then operators at JPL need to view and analyze the telemetry to understand if the previous plan went off without a hitch or if there's any problems or all that sort of long term trending, but also daily analysis.",
      "id": "ep_70_ut_30"
    },
    {
      "end": 299340,
      "speaker": "Enrico Bertini",
      "start": 290764,
      "text": "So you get some data and you have to make it more digestible. So I would assume you personally do a lot of data visualization, is that right?",
      "id": "ep_70_ut_31"
    },
    {
      "end": 304984,
      "speaker": "Rachel Binx",
      "start": 299492,
      "text": "Yes, definitely. I've been leading a team that's working on this one particular tool called Vortex.",
      "id": "ep_70_ut_32"
    },
    {
      "end": 309412,
      "speaker": "E",
      "start": 306084,
      "text": "And they have it with the names.",
      "id": "ep_70_ut_33"
    },
    {
      "end": 315256,
      "speaker": "Rachel Binx",
      "start": 309468,
      "text": "Really well, it's funny because everything. Well, I don't know.",
      "id": "ep_70_ut_34"
    },
    {
      "end": 324680,
      "speaker": "E",
      "start": 315280,
      "text": "The government is very fond of acronyms. And at some point I came up with this. I was like, yeah, I want to call it Vortex. And my manager said, cool, what's that an acronym of?",
      "id": "ep_70_ut_35"
    },
    {
      "end": 326960,
      "speaker": "Rachel Binx",
      "start": 324712,
      "text": "And I was like, no, silly, it's just a name.",
      "id": "ep_70_ut_36"
    },
    {
      "end": 344896,
      "speaker": "E",
      "start": 326992,
      "text": "And he's like, well, no, we have to have it be an acronym so that we can explain it in PowerPoints, basically. So I spent like 2 hours coming up with a acronymn for it. So Vortex now stands for visually organize and represent telemetry for examination and exploration.",
      "id": "ep_70_ut_37"
    },
    {
      "end": 346694,
      "speaker": "D",
      "start": 345040,
      "text": "That's brilliant. Brilliant.",
      "id": "ep_70_ut_38"
    },
    {
      "end": 347854,
      "speaker": "Enrico Bertini",
      "start": 346854,
      "text": "Totally works.",
      "id": "ep_70_ut_39"
    },
    {
      "end": 349166,
      "speaker": "E",
      "start": 347974,
      "text": "I was very proud of myself with.",
      "id": "ep_70_ut_40"
    },
    {
      "end": 355742,
      "speaker": "D",
      "start": 349190,
      "text": "That, of course, they made the acronym backward. They first started from Vortex and then found.",
      "id": "ep_70_ut_41"
    },
    {
      "end": 358678,
      "speaker": "Rachel Binx",
      "start": 355918,
      "text": "Right, I know, right. It was kind of fun when I.",
      "id": "ep_70_ut_42"
    },
    {
      "end": 362954,
      "speaker": "E",
      "start": 358686,
      "text": "Was playing around with it. I'm like, oh, I need to come up with, like, you know, what's a good r?",
      "id": "ep_70_ut_43"
    },
    {
      "end": 371474,
      "speaker": "Enrico Bertini",
      "start": 367294,
      "text": "And so the project, what was the main focus of that?",
      "id": "ep_70_ut_44"
    },
    {
      "end": 408894,
      "speaker": "Rachel Binx",
      "start": 373034,
      "text": "So, to explain the project, I pretty much have to explain the types of data that are coming down from spacecrafts. So there's three categories. First are channels, which are basically time series data. So you might have the temperature of a particular component or the voltage. You can also kind of overload the meaning of this in these things called enumerated channels, where if you have something that's on or off, you would encode that as a zero and one and then decode that on the ground. And so these enumerated channels, you can keep track of many states that are going on on the spacecraft.",
      "id": "ep_70_ut_45"
    },
    {
      "end": 492274,
      "speaker": "E",
      "start": 410194,
      "text": "And so that's. So channels are. This time series data is, like, the first category. The second are event records, or EVRs. And EVRs are basically log statements of activities that are happening on the spacecraft. So they're basically pre programmed ahead of time. So, like, if a temperature is getting close to its limit, you might get a little like, hey, temperature is trending upward. Log statement. Or if there's anything like trips an alarm, then you'll get a warning. And so those are basically, you know, some bit of text and a timestamp. And then the third category is this, like everything else, data products, which is a bit of a cop out, but this could be something like images, or it could also be higher resolution data than a channel that's sort of zipped up and sent as one file. So data products are a little bit of a beast, but our application deals with channels and evrs, and a lot of the analysis that people have to do is sort of jumping back and forth between the two types of data. So you would have your typical sort of time series graph over time of channel data. But then you'll also have these particular evrs that you need to establish the context of what was happening around them. So it's a lot of jumping back and forth using time as your reference between these two data types.",
      "id": "ep_70_ut_46"
    },
    {
      "end": 502586,
      "speaker": "Enrico Bertini",
      "start": 492614,
      "text": "And is it mostly like monitoring in real time, or going back sometimes years to. Or is the past interesting at all, or is it more about real time monitoring?",
      "id": "ep_70_ut_47"
    },
    {
      "end": 548968,
      "speaker": "Rachel Binx",
      "start": 502770,
      "text": "Yeah, I mean, it sort of depends on both the type of spacecraft and what the operator's job is. So spacecrafts, like an Earth orbiter or a rover, are sending data back every single day, usually several times a day. So for those operators, it's a lot of kind of real time, like, okay, is everything okay? Is anything trending upwards? Should I be worried about anything? And then spacecrafts that have been operating for a long time, like dawn or Cassini, they're pretty much set in their path. You can make a plan for them several months and beam it up, and then it's just you're kind of monitoring to make sure that the plan is going well. According to plan for something like Cassini.",
      "id": "ep_70_ut_48"
    },
    {
      "end": 549976,
      "speaker": "E",
      "start": 549056,
      "text": "You need to do a lot of.",
      "id": "ep_70_ut_49"
    },
    {
      "end": 572354,
      "speaker": "Rachel Binx",
      "start": 550000,
      "text": "Long term trending because the hardware degrades over time. And so you want to make sure that if your battery life is shrinking over time, so you want to make sure that you're not going to overload the spacecraft with the science activities that you have planned. So there's a lot of ten year graphs that you need to check in with periodically to make sure that everything's functionally roughly what you'd expect.",
      "id": "ep_70_ut_50"
    },
    {
      "end": 584074,
      "speaker": "Enrico Bertini",
      "start": 575094,
      "text": "So what was your role? And can you give us describe a few concrete uis you have been designing and building?",
      "id": "ep_70_ut_51"
    },
    {
      "end": 651894,
      "speaker": "Rachel Binx",
      "start": 584494,
      "text": "Yeah, definitely. So I've been leading a team with a few designers and developers on it. We have four clients, which is why I kind of cycle between these different spacecrafts. There's SMAP, which is an Earth orbiter, MSL curiosity, and then Cassini and Dawn. And so my role, the project started off primarily for SMAP, and then MSL got brought on, and then Cassini and then dawn. So part of my role has been basically doing client services with the different missions, doing user research, interviewing operators, understanding the different use cases on a per spacecraft basis, and then translating those into features in the Ui. As you can expect, if there's a bunch of time series data, the sort of main application of this would be a really awesome graph, but there's so many different features that you can have on the graph and different ways to display it and filter the data and sort of tweak it until you arrive at the answer that you need.",
      "id": "ep_70_ut_52"
    },
    {
      "end": 680854,
      "speaker": "D",
      "start": 653074,
      "text": "So when we talk about visualization, I think it's interesting to distinguish between visualizations that have some clear users they're trying to target and those that are more for the general public. So I'm curious to hear from you, are there any specific methods or methodologies that you use to gather requirements from people? And what, what process did you follow there? I'm really curious about that.",
      "id": "ep_70_ut_53"
    },
    {
      "end": 714224,
      "speaker": "Rachel Binx",
      "start": 681714,
      "text": "Yeah, definitely. Well, it's funny because on some level, well, a lot of the power of this tool is that it's fast. And basically, elasticsearch came to JPL recently, and suddenly with the down sampling of data, you could make fast queries. And so getting these channel graphs used to take several minutes, if not hours, depending on the length of time and the spacecraft and how they're storing the data. And so now, if that query can return in seconds, that's just a game.",
      "id": "ep_70_ut_54"
    },
    {
      "end": 715644,
      "speaker": "E",
      "start": 714264,
      "text": "Changer for the operators.",
      "id": "ep_70_ut_55"
    },
    {
      "end": 718664,
      "speaker": "Rachel Binx",
      "start": 716784,
      "text": "So the primary goal of this was.",
      "id": "ep_70_ut_56"
    },
    {
      "end": 723284,
      "speaker": "E",
      "start": 718704,
      "text": "To provide a front end for that elasticsearch back end of the data.",
      "id": "ep_70_ut_57"
    },
    {
      "end": 733704,
      "speaker": "Rachel Binx",
      "start": 724344,
      "text": "And so, you know, on some level, from like a visualization perspective, it's kind of like shooting fish in a barrel, because you're just like, oh, here's a graph. And people are like, yeah, yeah, exactly.",
      "id": "ep_70_ut_58"
    },
    {
      "end": 737964,
      "speaker": "E",
      "start": 733744,
      "text": "It's so fast, we can use it so visual.",
      "id": "ep_70_ut_59"
    },
    {
      "end": 754124,
      "speaker": "D",
      "start": 740424,
      "text": "That's exactly the kind of aspects that I'm really interested in, because here you are maximizing for or optimizing for some, I would say unconventional kind of constraints and characteristics, right?",
      "id": "ep_70_ut_60"
    },
    {
      "end": 761044,
      "speaker": "Rachel Binx",
      "start": 754504,
      "text": "Definitely. And I mean, some of it also, like, the visualizations are a bit constrained by the ways that we can get data back from elasticsearch.",
      "id": "ep_70_ut_61"
    },
    {
      "end": 828226,
      "speaker": "E",
      "start": 761784,
      "text": "Like, for instance, the event records, there's depending on the mission, there's usually like up to seven different categories of types of event records. So you'll have like a command diagnostic activity, low activity, high warning, low warning, high fatal. And one of the things that we got from elasticsearch was basically, you know, a count, a roll up of the different types of EVRs in a particular time period and then bucketed that by, you know, certain smaller periods of time. And so once we realized that this was like an available feature of the data, it was like, oh, well, we might as well make a histogram of the different types. And so we put that together, and it was one of those things that, again, took a day to kind of slap together on the page. But the operators had never seen their data like that. And so every time we put it in front of people, they were like, oh my gosh, this is the heartbeat of my spacecraft. I've never seen this before. And so that's really exciting to, like, these people have been working on it for, you know, years, if not decades, and to show them a completely new way of viewing their data was pretty exciting for us.",
      "id": "ep_70_ut_62"
    },
    {
      "end": 848694,
      "speaker": "D",
      "start": 828290,
      "text": "So do these visualizations also go in some of the existing control rooms? That's my dream, to build a visualization that goes in a NASA control room. I saw it last year, I visited NASA and I saw one of these control rooms, and I was like, that's where I want to be next.",
      "id": "ep_70_ut_63"
    },
    {
      "end": 851744,
      "speaker": "E",
      "start": 849544,
      "text": "Me, too. I know. That room is gorgeous.",
      "id": "ep_70_ut_64"
    },
    {
      "end": 855064,
      "speaker": "Rachel Binx",
      "start": 851784,
      "text": "I love it. Yeah.",
      "id": "ep_70_ut_65"
    },
    {
      "end": 892674,
      "speaker": "E",
      "start": 855104,
      "text": "So our site is used for some of the. I think it comes up mostly for anomaly detection, because all of the projects that we work with were existing spacecrafts by the time that we started our software, so they had their process down. But our application is really useful for if something goes wrong. And they need to be able to pull up different types of data quickly and do this analysis on something that's not in their, like, handful of channels that they look at every day. So I think during anomaly analysis and resolution, that this is an application that people are using in a large room full of people.",
      "id": "ep_70_ut_66"
    },
    {
      "end": 912648,
      "speaker": "D",
      "start": 893134,
      "text": "Yeah. I think that's an amazing application for visualization that we don't talk enough about. The idea of using this for monitoring. It's a fascinating area that I feel like is not very well developed. I guess Moritz worked a little bit on that as well. Moritz, you had a security kind of project or something?",
      "id": "ep_70_ut_67"
    },
    {
      "end": 933024,
      "speaker": "Enrico Bertini",
      "start": 912726,
      "text": "Yeah, last year, I finished a project for a security company. They would monitor real time Internet security events. And it's true, it's very different, like how you have to design, like, an ambient display or something that is always there, and it's always a bit different, but should also have a predictable structure in some form.",
      "id": "ep_70_ut_68"
    },
    {
      "end": 1020204,
      "speaker": "Rachel Binx",
      "start": 933324,
      "text": "Yeah, this is something that we've worked on a bit as well, and it's one of those things that's kind of up in the. Up for debate because a lot of the sort of ambient monitoring. So a spacecraft is broken up into subsystems, so you might have, like, thermal or telecon or fault protection. And so basically, each subsystem has, you know, is responsible for making sure that their piece of the spacecraft is functioning nominally. And so they usually, you know, determine this by having a certain set of channels that have, you know, different thresholds. So, you know, there's, like, a range of acceptable temperatures or that it should always be in the functioning state. And so then you're able to kind of do this roll up of, like, okay, if everything, you know, if all my channels in my subsystem are all functioning within this range, then, like, call it good, you know, green for good kind of thing. But, you know, then, you know, other people that are looking at this like, there's systems engineers that are sort of in charge of making sure that every single system is all, you know, performing nominally. And so there's some debate, you know, because some people are like, oh, yeah, like a little green circle for each subsystem like, that's all I need to know. But, you know, other people are like, well, what if a channel is, like, trending upwards? Like, what if it's about to go out of range? Like, I need to see that, too. And, you know, so it's like, how do you design, like, situational awareness that, you know, is informing people of kind of what, what they need to be looking at in the near future?",
      "id": "ep_70_ut_69"
    },
    {
      "end": 1057243,
      "speaker": "Enrico Bertini",
      "start": 1021234,
      "text": "That's a great question because I was thinking about that too. Like, a lot could probably be automated, or there's probably rules and limits and thresholds for everything somewhere specified. Yeah, but at the same time, you have, as you say this. You want to see when something behaves a bit differently already, or you want to see the trend or if something's odd. And I think, as you say, there's also this emotional connection. It's a bit like, you know, like the ultrasound of your baby, right? It's like it's out there somewhere. And you have this super noisy channel that you can connect to your baby, right?",
      "id": "ep_70_ut_70"
    },
    {
      "end": 1112894,
      "speaker": "Rachel Binx",
      "start": 1057403,
      "text": "Definitely. Well, and it's funny because, like, I mean, there's this whole sort of vast alarms network where, you know, there's certain thresholds of alarms, of channels going in and out of range that will trigger, you know, at the very least you get, like, an email that's like, oh, this channel's going out of range. And then you escalate to a text message, and then, you know, the highest one is like alerting other people on the project that your channel's out of range. And you might get a phone call at 03:00 a.m. that says, you got to get to work right now because something's going down on the spacecraft. And basically these operators, the values of what's an acceptable range can change over time. In both the science activities that you're planning and however the hardware reacts over time, there's definitely some points where something can be trending upward and then hit one of those alarms, and then suddenly you've woken up everybody else on the project in the middle of the night because you forgot to adjust the alarm threshold of your channel.",
      "id": "ep_70_ut_71"
    },
    {
      "end": 1115682,
      "speaker": "Moritz Stefaner",
      "start": 1114474,
      "text": "That's a good time to take a.",
      "id": "ep_70_ut_72"
    },
    {
      "end": 1118154,
      "speaker": "Enrico Bertini",
      "start": 1115698,
      "text": "Little break and talk about our sponsor this week.",
      "id": "ep_70_ut_73"
    },
    {
      "end": 1202294,
      "speaker": "Moritz Stefaner",
      "start": 1118314,
      "text": "As you all know, modern life is complex, and this creates the need for digital creators to support their arguments with facts and figures. A data based narrative which intertwines annotations and media elements with data visualizations is the perfect way to communicate complex realities. It's not only important to understand and process lots of information, but we also need to have the tools to communicate findings in a structured and nice way. Now, Quadrigram.com is a web based application to create and share these types of data stories on the Internet. Its intuitive interface allows users to design interactive narratives by merging graphic elements such as texts, images, videos, and data visualization modules into a single data story. And you can then publish your work as a fully functional website or interactive slide presentation without the need of any coding skills. Readers can browse the story and discover their own findings, basically create their own unique synthesis. Quadrigram.com is a product by Bestiario, a design firm with more than ten years of experience in the wonderful field of data visualization. Quadrigram.com is free and you just need a Gmail account to start building and sharing your data stories. So check it out at quadrigram.com. dot that's q dash u a dash dash r dash dash dash.com. and now back to the show.",
      "id": "ep_70_ut_74"
    },
    {
      "end": 1243676,
      "speaker": "D",
      "start": 1203234,
      "text": "It looks like that anomaly detection is one of the few areas where machine learning almost completely failed. Right. There is a very nice paper I read a few months ago. It's called outside the closed world on using machine learning for network intrusion detection. These are security experts in the field we've been analyzing. Why actually intrusion detection, automated intrusion detection doesn't seem to have worked because in practice is not very much used. And I think that's a fascinating topic, understanding why automated solutions don't work. And visualization does seem to work, at least to some extent.",
      "id": "ep_70_ut_75"
    },
    {
      "end": 1291144,
      "speaker": "Rachel Binx",
      "start": 1243860,
      "text": "Yeah, totally. I mean, this is like one of the things that we've been encountering on this project is that I think from a visualization background you're like, oh, I can come up with some really slick way to roll up all of your data and you don't have to look at it, but these operators are like, no, I just want to see my data. It's my responsibility if it's abnormal. And you're like, okay, well, how do I tell if it's abnormal and I'll just take care of it? And they're like, no, no, I just want to see it. So that's why a lot of this tool is just like, okay, it's a table of event records that you can be filtering and sorting and, but at the end of the day you're like, okay, yeah, it's a table. And that's what people need. That's what people want. That's what we're going to give them. We're going to make it the best table they can possibly have. But it's still a table.",
      "id": "ep_70_ut_76"
    },
    {
      "end": 1325974,
      "speaker": "Enrico Bertini",
      "start": 1293164,
      "text": "I'm curious about process. It sounds a bit like that you talk to the stakeholders or the users. First of all, it's a very small user group. You can basically talk to the two or three users of your tool directly, which is a huge plus. And then how do you work out what to do? It sounds like a very almost casual, informal process that you come up with ideas and then you try it out and then you see if it works. Is it a bit like that? Yeah, I formulated in a more fancy way, of course.",
      "id": "ep_70_ut_77"
    },
    {
      "end": 1414064,
      "speaker": "Rachel Binx",
      "start": 1328394,
      "text": "Yeah. That's been one of the really nice things about working at JPL is that I think for previous projects that were more either public outreach or sort of marketing or, I don't know, you're just putting it out into the world at large and you're like, I hope this makes sense and you can do specific user testing, but if you're just hoping for a general audience, I don't know, that's still something I struggle with. How do you make sure that you're building understandable visualizations? But that's something that I don't have to worry about at JPL because my user base is 100% contained on lab and I can email and set up up meetings with them anytime that I want. And so yeah, it's been great. We've basically, the operators are excited about new tools and new ways to be analyzing their data. And so we can just sit there and talk to them and talk through their process and what's already taken care of for you, what are frustrations? And then start brainstorming ideas with them. In the beginning of the project, we did a much more formal, like paper prototype process where we'd be drawing up interfaces and then doing testing with them. But as you know, as it develops, like once we had a software base, it was easy to just start prototyping in code and then go back to users and say, okay, does this actually make sense? Does this solve the problem? Does this help you in any sort of trending analysis?",
      "id": "ep_70_ut_78"
    },
    {
      "end": 1415740,
      "speaker": "E",
      "start": 1414364,
      "text": "So it's been a really rewarding process.",
      "id": "ep_70_ut_79"
    },
    {
      "end": 1430014,
      "speaker": "Rachel Binx",
      "start": 1415812,
      "text": "Of being able to have sort of a direct align to the people that are using it and then they can email us saying like, hey, this dropdown list, actually it'd be really nice if I could filter it by text box. And you're like, okay, yeah, sure, I'll go get that and let you know in a couple days.",
      "id": "ep_70_ut_80"
    },
    {
      "end": 1451808,
      "speaker": "Enrico Bertini",
      "start": 1430134,
      "text": "Yeah, and it's funny because it's very different to a few of the projects you have done before. Right? So for instance, you did like these live tweet visualizations for Stamen for the MTV awards. That's like the absolute opposite. Like huge audience has to be absolutely done on exactly one point, right? And that it's hot for two days, then everybody moves on, right?",
      "id": "ep_70_ut_81"
    },
    {
      "end": 1501744,
      "speaker": "Rachel Binx",
      "start": 1451896,
      "text": "Yeah, seriously, those websites were basically built to last 4 hours and the whole thing is just trying to look super cool. And I remember in San Francisco, one of the first public talks that I gave and I was showing this project and someone in the audience was like, so how do you do user testing to make sure that what you've built is an understandable interface? And I was like, uh, well, oh, I mean, it's too short of a project. There's no way that I could possibly do it. Sorry. You know, next question. You know, looking back, I'm like, oh my gosh, what if I've been building like terrible things all these years that no one understands how to use? Like, I don't know, I guess this is like the thing that you like think about at night while you're trying to fall asleep. You're like, what if all of my work is just unintelligible?",
      "id": "ep_70_ut_82"
    },
    {
      "end": 1512858,
      "speaker": "Enrico Bertini",
      "start": 1506034,
      "text": "Yeah, but it's very interesting. But don't you miss like also launching something and then there's big fireworks and then it's done?",
      "id": "ep_70_ut_83"
    },
    {
      "end": 1516154,
      "speaker": "E",
      "start": 1512946,
      "text": "Like, I mean, yes, that's the other thing.",
      "id": "ep_70_ut_84"
    },
    {
      "end": 1596826,
      "speaker": "Rachel Binx",
      "start": 1516274,
      "text": "I don't know. And I mean, like, I think part of that is like an element of government work, I'd say, in that, you know, once you start something like momentum is very powerful, you know, in software projects at JPL because like once people start using it, then they're like, okay, well this needs to continue existing, it needs to be supported. And so that was also an interesting process in that I think a lot of the work that I've done previously has been either smaller projects or short term projects. And you can just kind of throw something together that mostly works and you'll be fine. But this was developing a full on application and once you start. We did a design refactor at one point that, but from my perspective, basically took the site offline for a month. I mean, not really. We left up the old design and then we're working in the background, but our customers are like, hey, what little new knobs have you added? And we're like, oh no, it's this gigantic knob in the background, but we can't show it to you because it's taking a while. And they're like, but it's been a month. And I'm like, I know, but this is a big new thing. And sorry, it's hard to put all of our work into a completely new architecture. So yeah, that's been interesting and kind of learning how to build more sustainable visualization projects.",
      "id": "ep_70_ut_85"
    },
    {
      "end": 1623132,
      "speaker": "D",
      "start": 1597010,
      "text": "Yeah, that's another interesting aspect. How do you write code that works for NASA? I mean, I think there is a, we have a note here. Is it safe to run JavaScript in space? I mean, it's a big change. I mean, between, I don't know, coming up with a little prototype and doing something that works for, for these people in these situations. Or maybe not.",
      "id": "ep_70_ut_86"
    },
    {
      "end": 1623908,
      "speaker": "E",
      "start": 1623268,
      "text": "It's true.",
      "id": "ep_70_ut_87"
    },
    {
      "end": 1628172,
      "speaker": "Rachel Binx",
      "start": 1623996,
      "text": "Well, I mean, I don't know, it's funny, I think technically vortex is an.",
      "id": "ep_70_ut_88"
    },
    {
      "end": 1655588,
      "speaker": "E",
      "start": 1628228,
      "text": "Experiment and they have it in the experimental category that basically all other of the JavaScript projects, JPL are in this experiment thing because there's a very rigorous security process. If we were to come out and say, okay, this is a tool that can be used for operations 100% of the time and there will never be any bugs, which, you know, when you're working on like a live application, you're like, oh, I don't, I don't know if I can promise that, like chrome.",
      "id": "ep_70_ut_89"
    },
    {
      "end": 1658452,
      "speaker": "Enrico Bertini",
      "start": 1655636,
      "text": "Updates and it doesn't work anymore, that would be bad, right?",
      "id": "ep_70_ut_90"
    },
    {
      "end": 1659544,
      "speaker": "E",
      "start": 1658548,
      "text": "Yeah, right.",
      "id": "ep_70_ut_91"
    },
    {
      "end": 1671628,
      "speaker": "Enrico Bertini",
      "start": 1661004,
      "text": "And so how's the process there? Like, would you then for the critical things? Do you have just super rigorous QA or do you use different tools altogether or how?",
      "id": "ep_70_ut_92"
    },
    {
      "end": 1714094,
      "speaker": "Rachel Binx",
      "start": 1671756,
      "text": "Yeah, so I mean, we write some automation tests, the whole site is built in react, so that's what we're using for our framework. And so there's some tools for building tests on both the back end and the front end using selenium. So there's tools out there, but a lot of it does come down to just at the end of the sprint we're like, okay, everybody take your assigned mission and just start clicking around and trying to see if you can break the site. And the good thing is that since we have such a personal connection with our users, that if there's anything that they do find that goes wrong, they can just email us, call us up like hey, this thing, it's broken, fix it.",
      "id": "ep_70_ut_93"
    },
    {
      "end": 1721446,
      "speaker": "Enrico Bertini",
      "start": 1714214,
      "text": "And they would know what a plausible curve is or they would immediately see if you would do something wrong on the calculation.",
      "id": "ep_70_ut_94"
    },
    {
      "end": 1730914,
      "speaker": "Rachel Binx",
      "start": 1721510,
      "text": "Yeah, definitely. They're very familiar with their data, so as soon as it's not what they're expecting, we get a good email.",
      "id": "ep_70_ut_95"
    },
    {
      "end": 1740794,
      "speaker": "Enrico Bertini",
      "start": 1731934,
      "text": "Are there any other things like when you're used to coding on earth that are different in space? Like oh my gosh, time.",
      "id": "ep_70_ut_96"
    },
    {
      "end": 1750422,
      "speaker": "E",
      "start": 1741414,
      "text": "Time, yeah, yeah, time is just, you think that time is complicated on Earth. And then like, as soon as you're dealing with things that leave Earth, it's.",
      "id": "ep_70_ut_97"
    },
    {
      "end": 1752430,
      "speaker": "Rachel Binx",
      "start": 1750438,
      "text": "Just, oh gosh, it's such a, what.",
      "id": "ep_70_ut_98"
    },
    {
      "end": 1756806,
      "speaker": "Enrico Bertini",
      "start": 1752462,
      "text": "Time zone is in space? Like, does it depend on where you.",
      "id": "ep_70_ut_99"
    },
    {
      "end": 1761166,
      "speaker": "Rachel Binx",
      "start": 1756830,
      "text": "Are local mean solar time? Oh, okay.",
      "id": "ep_70_ut_100"
    },
    {
      "end": 1764006,
      "speaker": "E",
      "start": 1761350,
      "text": "Yes. So there is like a standard, and.",
      "id": "ep_70_ut_101"
    },
    {
      "end": 1765358,
      "speaker": "Rachel Binx",
      "start": 1764030,
      "text": "Then, I mean, a lot of it.",
      "id": "ep_70_ut_102"
    },
    {
      "end": 1770542,
      "speaker": "E",
      "start": 1765366,
      "text": "Is based in like UTC, but I mean, you have to account for like relativity on the spacecraft.",
      "id": "ep_70_ut_103"
    },
    {
      "end": 1771086,
      "speaker": "Enrico Bertini",
      "start": 1770638,
      "text": "Oh, really?",
      "id": "ep_70_ut_104"
    },
    {
      "end": 1859104,
      "speaker": "E",
      "start": 1771150,
      "text": "Which is, yeah, kind of like every single data point is tagged with three times there's spacecraft emitted time, Earth received time, and then spacecraft clock time. So the spacecraft emitted and Earth received are both in UTC. And then the spacecraft clock is like, it's just a float number, which is the number of milliseconds that have elapsed since the last time that the computer booted up. And so it's this difficult thing where like, you know, let's see what, there's some part of this process. And then like the data ingesting that cuts off the milliseconds on the spacecraft emitted time, so that sometimes things will be out of order. And so you have to go by the spacecraft clock time to like reorder them, even though it's like you're given the same timestamp in JavaScript. Yeah. And then you have to do stuff like, since curiosity is on Mars, then you have Mars time. And each of the spacecrafts on Mars increment, they basically have a relative time from their landing. So they have Sol zero. Sol is a martian day, by the way. So each of them start with Sol zero when they land, and then you're incrementing time from there. Oh, and the other thing is that curiosity starts from Sol zero, but opportunity started on Sol one. No, I know, you're like, no, who does that?",
      "id": "ep_70_ut_105"
    },
    {
      "end": 1912184,
      "speaker": "Rachel Binx",
      "start": 1860524,
      "text": "Yeah. And martian time is about 36 minutes longer than Earth time. There's some crazy stories about like when they were landing, curiosity, they basically kept the operators on Mars time. So your day just kind of slowly shifts and suddenly it's like, oh, okay, it's, here I am, better wake up and go to work. There's some crazy stories. I don't know. My friend who works on that was telling me this thing where he went out for a run and then came back to his car to drive home, but there were groceries in the car and he couldn't remember if he had gotten the groceries before the run or if he had gotten them yesterday and left them in the car for a day. And then he drove home and he couldn't remember if he was supposed to take a shower and go to work or if it was time for him go to bed. And he took like, you know, ten minutes, like syncing up all those different calendars of like, I don't know when I am in time. Like.",
      "id": "ep_70_ut_106"
    },
    {
      "end": 1916492,
      "speaker": "D",
      "start": 1915244,
      "text": "This could be the basic, thank.",
      "id": "ep_70_ut_107"
    },
    {
      "end": 1920204,
      "speaker": "Rachel Binx",
      "start": 1916508,
      "text": "God they stopped doing that. I know, right?",
      "id": "ep_70_ut_108"
    },
    {
      "end": 1926504,
      "speaker": "Enrico Bertini",
      "start": 1920324,
      "text": "Yeah, yeah. It sounds like an astronaut going crazy on the space station, you know, after being a year alone or something. Yeah.",
      "id": "ep_70_ut_109"
    },
    {
      "end": 1927944,
      "speaker": "Rachel Binx",
      "start": 1926804,
      "text": "Oh my gosh.",
      "id": "ep_70_ut_110"
    },
    {
      "end": 1935790,
      "speaker": "Enrico Bertini",
      "start": 1929444,
      "text": "But I can imagine that time is the worst. I mean, already on Earth, but now the, oh man, there must have been.",
      "id": "ep_70_ut_111"
    },
    {
      "end": 2035974,
      "speaker": "Rachel Binx",
      "start": 1935822,
      "text": "Quite a, do you know anything about leap seconds? Wonderful. Yeah, it's incredible because basically time is this human construct of trying to understand the rotation of our planet around the sun. And so Earth doesn't spin at a constant rate, it's slowing every so often, which is why leap seconds get added. And there's just this group that decides to add a leap second based on calculations and stuff, but they sort of announce it six months ahead of when they're going to add this second. And then the interesting thing, and sort of from a web application perspective, is that the JavaScript time, I guess, object construct doesn't track leap seconds. So if you want the true time when you're calculating it, you basically have to go and find this file and then parse it and then find your date, and then add the number of seconds that have been added since leap seconds were established. This is why I get into fights with people all the time about moment.js, which is a wonderful JavaScript library, but it doesn't actually do extra time outside of earth very well. There's no leap seconds in JavaScript, so you can't get leap seconds for moment.js. And every single time that I mention anything about time on Twitter, people are like, oh, have you heard of moment JS? Why don't you try that? I'm like, I'm talking about calculating Mars time. Like why would moment Reyes calculate that? And they're like, well it's actually really good, it has time zones. I'm like, I know, but it's a different planet. Like come on, leave me alone.",
      "id": "ep_70_ut_112"
    },
    {
      "end": 2040770,
      "speaker": "D",
      "start": 2036314,
      "text": "But that's a totally cool library to make, somebody can do it.",
      "id": "ep_70_ut_113"
    },
    {
      "end": 2043986,
      "speaker": "Enrico Bertini",
      "start": 2040802,
      "text": "Yeah, like jquery Mars plugin, there's like.",
      "id": "ep_70_ut_114"
    },
    {
      "end": 2050372,
      "speaker": "E",
      "start": 2044010,
      "text": "An open like moment J's request of like hey, can you implement Mars time for the different rovers?",
      "id": "ep_70_ut_115"
    },
    {
      "end": 2055184,
      "speaker": "Rachel Binx",
      "start": 2050428,
      "text": "Any other creators? Moment J's are like, no, go figure it out.",
      "id": "ep_70_ut_116"
    },
    {
      "end": 2058344,
      "speaker": "D",
      "start": 2057164,
      "text": "Oh my God.",
      "id": "ep_70_ut_117"
    },
    {
      "end": 2070100,
      "speaker": "Enrico Bertini",
      "start": 2058684,
      "text": "Are there any other things that are totally different from the normal world, let's say. So I could imagine there's a lot of curious stuff happening at NASA. No? Any juicy, like inside stories?",
      "id": "ep_70_ut_118"
    },
    {
      "end": 2088144,
      "speaker": "Rachel Binx",
      "start": 2070292,
      "text": "I don't think I have access to that, honestly. I'm in, like, I'm in the operations department. So basically there's like two halves. There's the science and the operations. So like science, you know, they're all the people that are collecting interesting data and like, you know, making discoveries about the universe, and then operations are just the people that are like, yeah, I'm gonna show up to work and like.",
      "id": "ep_70_ut_119"
    },
    {
      "end": 2089352,
      "speaker": "E",
      "start": 2088184,
      "text": "Make sure that nothing went wrong.",
      "id": "ep_70_ut_120"
    },
    {
      "end": 2104784,
      "speaker": "Rachel Binx",
      "start": 2089408,
      "text": "And like, what's the plan for next day? Oh, we got like a time limit. Like better move fast. I don't know, it's like the adrenaline junkies on the operations side, but, you know, I'm thinking more about like hardware degradation than like interesting things happening in the galaxy.",
      "id": "ep_70_ut_121"
    },
    {
      "end": 2115180,
      "speaker": "D",
      "start": 2105564,
      "text": "So, Rachel, how does one get to work for NASA if some of our listeners want to do that? Do you have any suggestions?",
      "id": "ep_70_ut_122"
    },
    {
      "end": 2116884,
      "speaker": "Enrico Bertini",
      "start": 2115292,
      "text": "Or some of our podcast hosts?",
      "id": "ep_70_ut_123"
    },
    {
      "end": 2119584,
      "speaker": "D",
      "start": 2116924,
      "text": "Yeah, also or myself.",
      "id": "ep_70_ut_124"
    },
    {
      "end": 2136744,
      "speaker": "Rachel Binx",
      "start": 2123324,
      "text": "Yeah, well, I think step one would be going on the human interfaces JPL group website and then emailing a copy of your resume. We are definitely on the hunt for talented people that want to come join the team.",
      "id": "ep_70_ut_125"
    },
    {
      "end": 2147664,
      "speaker": "D",
      "start": 2137124,
      "text": "But what kind of background or, I mean, what would you look for in a cv of a person applying to NASA for this kind of job? Of course.",
      "id": "ep_70_ut_126"
    },
    {
      "end": 2175194,
      "speaker": "Rachel Binx",
      "start": 2148244,
      "text": "Yeah, definitely. Well, it's funny because I think that there's been web technology has taken off recently at JPL, so there's not that many people who are writing JavaScript. And so if someone came in and said, hey, I've been making web applications, I've been writing JavaScript, I've got D3 experience. All of those pretty standard visualization qualities I think would translate very well to a job opportunity at JPL.",
      "id": "ep_70_ut_127"
    },
    {
      "end": 2197208,
      "speaker": "Enrico Bertini",
      "start": 2176054,
      "text": "Yeah, that's interesting because I think you wouldn't have had that on the radar. And I remember I was quite surprised when I heard you at NASA and I was like, wow, how did that happen? But I thought, yeah, that totally makes sense, but it's not something you would directly have on the radar. That would be great if there was more, you know, exchange between these worlds. I could imagine.",
      "id": "ep_70_ut_128"
    },
    {
      "end": 2199284,
      "speaker": "Rachel Binx",
      "start": 2197256,
      "text": "Right, yeah, most definitely.",
      "id": "ep_70_ut_129"
    },
    {
      "end": 2209244,
      "speaker": "Enrico Bertini",
      "start": 2201184,
      "text": "Great. Is there anything else you want to talk about? I know you're into birds, you want to give a shout out to your favorite bird or something.",
      "id": "ep_70_ut_130"
    },
    {
      "end": 2219824,
      "speaker": "Rachel Binx",
      "start": 2212624,
      "text": "Shout out to macaws, conures, cockatiels, cockatoos, the whole gang. Really?",
      "id": "ep_70_ut_131"
    },
    {
      "end": 2223852,
      "speaker": "Enrico Bertini",
      "start": 2220924,
      "text": "No, it was really nice having you. Super interesting.",
      "id": "ep_70_ut_132"
    },
    {
      "end": 2225116,
      "speaker": "Rachel Binx",
      "start": 2223988,
      "text": "Yeah, thank you. So much.",
      "id": "ep_70_ut_133"
    },
    {
      "end": 2236820,
      "speaker": "Enrico Bertini",
      "start": 2225180,
      "text": "And I think this is amazing. And I really hope. Yeah. More like web type people look at these types of jobs because I think definitely a lot of really cool stuff can be done in that area.",
      "id": "ep_70_ut_134"
    },
    {
      "end": 2244264,
      "speaker": "D",
      "start": 2236972,
      "text": "Yeah, I think so, too. I hope there will be even more people doing database at NASA. That's just perfect. Marriage.",
      "id": "ep_70_ut_135"
    },
    {
      "end": 2246916,
      "speaker": "E",
      "start": 2246044,
      "text": "Sounds great.",
      "id": "ep_70_ut_136"
    },
    {
      "end": 2249820,
      "speaker": "Enrico Bertini",
      "start": 2247020,
      "text": "Yeah. Cool. Thanks so much, Rachel. Great having you.",
      "id": "ep_70_ut_137"
    },
    {
      "end": 2250428,
      "speaker": "D",
      "start": 2249852,
      "text": "Thank you, Rachel.",
      "id": "ep_70_ut_138"
    },
    {
      "end": 2250868,
      "speaker": "Enrico Bertini",
      "start": 2250476,
      "text": "Bye bye.",
      "id": "ep_70_ut_139"
    },
    {
      "end": 2252744,
      "speaker": "D",
      "start": 2250916,
      "text": "Thanks a lot. Bye bye bye.",
      "id": "ep_70_ut_140"
    },
    {
      "end": 2271444,
      "speaker": "Moritz Stefaner",
      "start": 2255204,
      "text": "This episode of Data Stories is sponsored by Quadrigram, a web based application designed to bring data stories to life. With Quadrigram, you can create and share interactive data stories without the need of any coding skills. Check it out at quadrigram.com.",
      "id": "ep_70_ut_141"
    }
  ],
  "confidence": 0.927555149439602,
  "audio_duration": 2272,
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_status_code": null,
  "webhook_auth": false,
  "webhook_auth_header_name": null,
  "speed_boost": false,
  "auto_highlights_result": null,
  "auto_highlights": false,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_audio_quality": null,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "content_safety": false,
  "iab_categories": true,
  "content_safety_labels": {
    "status": "unavailable",
    "results": [],
    "summary": {}
  },
  "language_detection": false,
  "language_detection_threshold": null,
  "language_confidence": null,
  "custom_spelling": null,
  "throttled": false,
  "auto_chapters": true,
  "summarization": false,
  "summary_type": null,
  "summary_model": null,
  "custom_topics": false,
  "topics": [],
  "speech_threshold": null,
  "speech_model": "best",
  "chapters": [
    {
      "summary": "This episode of data stories is sponsored by Quadrigram, a web based application designed to bring data stories to life. You can create and share interactive data stories without the need of any coding skills. This is data stories number 70.",
      "gist": "Data Stories",
      "headline": "This episode of data stories is sponsored by Quadrigram",
      "start": 280,
      "end": 86754,
      "id": "ep_70_ch_0"
    },
    {
      "summary": "Rachel Binx has been working in data visualization for several years. Recently she's been at NASA JPL working on a telemetry visualization tool. Check out Rachel's website. She has a lot of really amazing projects.",
      "gist": "Fooling around with Rachel Binx",
      "headline": "Rachel Binx is working in data visualization at NASA JPL",
      "start": 87174,
      "end": 152620,
      "id": "ep_70_ch_1"
    },
    {
      "summary": "JPL is the NASA center responsible for most of the spacecrafts in like outside of Earth. I am in the human interfaces group in the planning and sequencing section of JPL. I've been leading a team that's working on one particular tool called Vortex.",
      "gist": "My job at NASA's JPL",
      "headline": "Mer Mer works at NASA JPL, Jet propulsion laboratory",
      "start": 152812,
      "end": 371474,
      "id": "ep_70_ch_2"
    },
    {
      "summary": "Channels are basically time series data. The second are event records, or EVRs. And EVRs are basically log statements of activities that are happening on the spacecraft. Third is data products, which could be images. Is it mostly like monitoring in real time, or going back sometimes years to.",
      "gist": "NASA's Science Data Collection",
      "headline": "There are three categories of data coming down from spacecrafts",
      "start": 373034,
      "end": 572354,
      "id": "ep_70_ch_3"
    },
    {
      "summary": "I've been leading a team with a few designers and developers on it. We have four clients, which is why I kind of cycle between these different spacecrafts. The primary goal of this was. To provide a front end for that elasticsearch back end of the data. Do these visualizations also go in of the existing NASA control rooms?",
      "gist": "Working on the NASA visualization project",
      "headline": "Ui has been working on visualization tools for various NASA spacecraft",
      "start": 575094,
      "end": 1112894,
      "id": "ep_70_ch_4"
    },
    {
      "summary": " Quadrigram.com is a web based application to create and share these types of data stories on the Internet. Its intuitive interface allows users to design interactive narratives by merging graphic elements such as texts, images, videos, and data visualization modules. Free and you just need a Gmail account to start building and sharing your data stories.",
      "gist": "Quadrigram.com",
      "headline": "Quadrigram.com is a web based application to create and share data stories",
      "start": 1114474,
      "end": 1194582,
      "id": "ep_70_ch_5"
    },
    {
      "summary": "Anomaly detection is one of the few areas where machine learning almost completely failed. And visualization does seem to work, at least to some extent. Why actually intrusion detection, automated intrusion detection doesn't seem to have worked.",
      "gist": "Anomaly Detection",
      "headline": "Machine learning for anomaly detection has failed in many areas, including visualization",
      "start": 1194638,
      "end": 1291144,
      "id": "ep_70_ch_6"
    },
    {
      "summary": "JPL has a very small user group. You can basically talk to the two or three users of your tool directly. How do you make sure that you're building understandable visualizations? At JPL, your user base is 100% contained on lab.",
      "gist": "How To Build a Topical Data Visualization",
      "headline": "How do you do user testing for new visualizations at JPL",
      "start": 1293164,
      "end": 1485252,
      "id": "ep_70_ch_7"
    },
    {
      "summary": "How do you write code that works for NASA? Is it safe to run JavaScript in space? Do you have just super rigorous QA or do you use different tools altogether?",
      "gist": "How Do You Write Code for NASA?",
      "headline": "How do you write code that works for NASA? I mean, it's complicated",
      "start": 1485388,
      "end": 1730914,
      "id": "ep_70_ch_8"
    },
    {
      "summary": "Time is based in like UTC, but you have to account for like relativity on the spacecraft. And martian time is about 36 minutes longer than Earth time. From a web application perspective, JavaScript doesn't track leap seconds.",
      "gist": "Does Leap Time affect your coding on Earth?",
      "headline": "Are there any other things like when you're coding on earth that are different in space",
      "start": 1731934,
      "end": 2058344,
      "id": "ep_70_ch_9"
    },
    {
      "summary": "There's the science and the operations department at NASA. \"I'm thinking more about like hardware degradation than like interesting things happening in the galaxy,\" he says. Do you have any juicy, like inside stories?",
      "gist": "On the Secret Life of NASA",
      "headline": "NASA has two departments: science and operations",
      "start": 2058684,
      "end": 2104784,
      "id": "ep_70_ch_10"
    },
    {
      "summary": "Rachel: How does one get to work for NASA if some of our listeners want to do that? She says step one would be going on the human interfaces JPL group website and then emailing a copy of your resume. We are definitely on the hunt for talented people that want to come join the team.",
      "gist": "How to Get a Job at NASA",
      "headline": "Rachel: NASA is always looking for talented people to join its team",
      "start": 2105564,
      "end": 2201688,
      "id": "ep_70_ch_11"
    },
    {
      "summary": "Rachel: I hope there will be even more people doing database at NASA. This episode of Data Stories is sponsored by Quadrigram, a web based application designed to bring data stories to life.",
      "gist": "Data Stories",
      "headline": "Rachel: I hope there will be more people doing database jobs at NASA",
      "start": 2201776,
      "end": 2271444,
      "id": "ep_70_ch_12"
    }
  ],
  "disfluencies": false,
  "entity_detection": false,
  "sentiment_analysis": false,
  "sentiment_analysis_results": null,
  "entities": null,
  "speakers_expected": null,
  "summary": null,
  "custom_topics_results": null,
  "episode_num": 70,
  "episode_metadata": {
    "speakers": [
      "Rachel Binx",
      "Moritz Stefaner",
      "Enrico Bertini"
    ],
    "WPid": "541",
    "url": "https://datastori.es/podlove/file/2001/s/feed/c/mp3/70-rachel-binx.mp3",
    "episode_title": "Rocket Science with Rachel Binx"
  }
}