{
  "id": "a9420339-4cd6-4540-860f-dbaf64b562e0",
  "language_model": "assemblyai_default",
  "acoustic_model": "assemblyai_default",
  "language_code": "en_us",
  "status": "completed",
  "audio_url": "https://datastori.es/podlove/file/142/s/feed/c/mp3/Datastories-21.mp3",
  "utterances": [
    {
      "end": 15606,
      "speaker": "Enrico Bertini",
      "start": 9800,
      "text": "Hi, everyone. Data stories number 21. Hi, Moritz. How are you?",
      "id": "ep_21_ut_0"
    },
    {
      "end": 17462,
      "speaker": "Moritz Stefaner",
      "start": 15718,
      "text": "Hi, Enrico. How are you doing?",
      "id": "ep_21_ut_1"
    },
    {
      "end": 46476,
      "speaker": "Enrico Bertini",
      "start": 17606,
      "text": "Good, good. There is some sun coming from the windows, but it's chilly. It's still very chilly, which I don't like. It's good. I like it. So we have a couple of special, special guests today. And about the topic, can visualization save the world? And we have Kim Rees from periscopic. Hi, Kim. And we have Jake, poor way, from Datakind.",
      "id": "ep_21_ut_2"
    },
    {
      "end": 47388,
      "speaker": "Moritz Stefaner",
      "start": 46628,
      "text": "Wow.",
      "id": "ep_21_ut_3"
    },
    {
      "end": 49200,
      "speaker": "Enrico Bertini",
      "start": 47564,
      "text": "Hi, guys. How are you?",
      "id": "ep_21_ut_4"
    },
    {
      "end": 51960,
      "speaker": "Kim Rees",
      "start": 49780,
      "text": "Good. Hi, Enrico. I'm Moritz.",
      "id": "ep_21_ut_5"
    },
    {
      "end": 53388,
      "speaker": "Moritz Stefaner",
      "start": 52460,
      "text": "Hey, Kim.",
      "id": "ep_21_ut_6"
    },
    {
      "end": 66800,
      "speaker": "Enrico Bertini",
      "start": 53564,
      "text": "Hi, Kim. Hi, Jake. Are you there? No, Jake is not there yet, so bound to happen. He's gonna show up at some point.",
      "id": "ep_21_ut_7"
    },
    {
      "end": 70260,
      "speaker": "Moritz Stefaner",
      "start": 69260,
      "text": "He's taking a nap.",
      "id": "ep_21_ut_8"
    },
    {
      "end": 71484,
      "speaker": "Enrico Bertini",
      "start": 70300,
      "text": "I mean, he's taking a nap.",
      "id": "ep_21_ut_9"
    },
    {
      "end": 71980,
      "speaker": "Moritz Stefaner",
      "start": 71572,
      "text": "Why not?",
      "id": "ep_21_ut_10"
    },
    {
      "end": 79900,
      "speaker": "Enrico Bertini",
      "start": 72020,
      "text": "Or he's just too busy. Just too busy. It's nice to start with this, Kim.",
      "id": "ep_21_ut_11"
    },
    {
      "end": 81644,
      "speaker": "Moritz Stefaner",
      "start": 79940,
      "text": "We wanted to start with Kim anyways, right?",
      "id": "ep_21_ut_12"
    },
    {
      "end": 82888,
      "speaker": "Enrico Bertini",
      "start": 81692,
      "text": "Yeah, sure. No problem.",
      "id": "ep_21_ut_13"
    },
    {
      "end": 84080,
      "speaker": "Kim Rees",
      "start": 82984,
      "text": "I'm better anyway, so.",
      "id": "ep_21_ut_14"
    },
    {
      "end": 86232,
      "speaker": "Jake Porway",
      "start": 84120,
      "text": "Yeah, yeah.",
      "id": "ep_21_ut_15"
    },
    {
      "end": 91020,
      "speaker": "Enrico Bertini",
      "start": 86376,
      "text": "So, Kim Chem, visualization saved the world.",
      "id": "ep_21_ut_16"
    },
    {
      "end": 93352,
      "speaker": "Kim Rees",
      "start": 91760,
      "text": "Yes. Good night.",
      "id": "ep_21_ut_17"
    },
    {
      "end": 96176,
      "speaker": "Enrico Bertini",
      "start": 93496,
      "text": "Good night. End of the episode.",
      "id": "ep_21_ut_18"
    },
    {
      "end": 96856,
      "speaker": "Kim Rees",
      "start": 96248,
      "text": "Mic drop.",
      "id": "ep_21_ut_19"
    },
    {
      "end": 97580,
      "speaker": "Jake Porway",
      "start": 96928,
      "text": "Yeah.",
      "id": "ep_21_ut_20"
    },
    {
      "end": 189150,
      "speaker": "Kim Rees",
      "start": 99280,
      "text": "Can visualization save the world? You know, that's. I've been thinking about that a lot since you guys posed the question for this podcast, and I love that you guys are, you know, addressing this. I think it's a lot of, you know, it's interesting to think about. And it's funny, because even though I've been doing this for nine years now, under the tagline of do good with data, I think we don't. We rarely sort of take a step back and think about it and think about, well, are we really, you know, saving the world? Are we what? You know, what kind of impact are we having? And so it caused me to really think about it. And, you know, I think that I don't think there's, like, a silver bullet to save the world in any, you know, in any sort of sector or any technology or anything like that. But I think that, you know, we've made a lot of changes in the world, you know, and not just recently, not with the recent sort of, you know, the recent interest in data visualization. I think that data visualization has helped, you know, for centuries and in making the world a better place. You know, I think back to, you know, some of the historic examples of, like, Florence Nightingale and Jon Snow and people who were using visualization to explain things and to show people, you know, what is actually happening, to sort of demystify. There's Jake.",
      "id": "ep_21_ut_21"
    },
    {
      "end": 195770,
      "speaker": "Jake Porway",
      "start": 189530,
      "text": "Hey, guys. Sorry I'm late. Sorry. Carry on.",
      "id": "ep_21_ut_22"
    },
    {
      "end": 273300,
      "speaker": "Kim Rees",
      "start": 198470,
      "text": "But I think sort of these historic examples are good, because I think there are probably for as many of these famous examples, like Florence Nightingale and the others, there are probably hundreds of others that we don't know about, you know, that somebody has made a chart just to prove that there is a pollution somewhere or that people are being killed by accidents in, you know, whatever. So I'm sure that there have been even in things that we know about, like automobile safety, you know, that people have been, you know, analyzing this for decades and showing charts and graphs to prove that, you know, certain aspects are dangerous or that high speed limits lead to more fatalities and things like that. So I think that visualization has changed the world dramatically. I know that, you know, people use it for those. For those needs. And I think that people who are. Who naturally want to, you know, who are naturally drawn to data visualization or charts and graphs or whatever you want to call it, that they are naturally doing good in the world as well, because they sort of. They want to prove that those things exist and that there are those problems in the world. So that's my take.",
      "id": "ep_21_ut_23"
    },
    {
      "end": 302680,
      "speaker": "Enrico Bertini",
      "start": 274260,
      "text": "So, Kim, I wanted to ask you very briefly, so I think there might be people who are not totally familiar with what you guys do at periscopic. So can you briefly introduce. So if I go to your home page, I see periscopic do good with data, which resonates really well with the topic that we are discussing today. So can you tell us a little bit about the company, what you do and how you plan to do good with data, or you did good with data?",
      "id": "ep_21_ut_24"
    },
    {
      "end": 335310,
      "speaker": "Kim Rees",
      "start": 303460,
      "text": "We always do good with data. So, yeah, so we're periscopic. We are a socially conscious data visualization firm. We're based in Portland, Oregon. And like you said, our tagline is do good with data, which means that we help organizations and companies to compel people to action on issues such as environmentalism, human rights, data transparency, you know, sustainability, and many other issues. So that's basically it in a nutshell.",
      "id": "ep_21_ut_25"
    },
    {
      "end": 342002,
      "speaker": "Enrico Bertini",
      "start": 337610,
      "text": "Jake? Jake, are you there? No.",
      "id": "ep_21_ut_26"
    },
    {
      "end": 342466,
      "speaker": "Kim Rees",
      "start": 342066,
      "text": "Come on.",
      "id": "ep_21_ut_27"
    },
    {
      "end": 343750,
      "speaker": "Enrico Bertini",
      "start": 342498,
      "text": "I cannot believe it.",
      "id": "ep_21_ut_28"
    },
    {
      "end": 348482,
      "speaker": "Moritz Stefaner",
      "start": 346010,
      "text": "Excellent. Let's use the opportunity.",
      "id": "ep_21_ut_29"
    },
    {
      "end": 355562,
      "speaker": "Jake Porway",
      "start": 348506,
      "text": "I gotta call Time Warner and, yeah, give him a piece of my mind. Be quick. Ask me anything that can be answered in about 15 seconds.",
      "id": "ep_21_ut_30"
    },
    {
      "end": 359880,
      "speaker": "Enrico Bertini",
      "start": 355586,
      "text": "Jake, can you briefly introduce yourself and data kind?",
      "id": "ep_21_ut_31"
    },
    {
      "end": 399010,
      "speaker": "Jake Porway",
      "start": 360460,
      "text": "Yeah, surely. So, I'm Jake Porway, and I work at Datakind, where we try to team up pro bono data scientists and other data geeks, data artists, data visualists with social causes and social organizations who are suddenly finding themselves awash in data totally unexpectedly and who aren't really prepared to use those to fulfill their missions. So we try to get people who have the amazing skills to work with data and visualize data and want to do more with it, to work alongside groups like the Red Cross or the United nations who have all this data that they could use to further their missions, but may not really have the resources to do.",
      "id": "ep_21_ut_32"
    },
    {
      "end": 402070,
      "speaker": "Enrico Bertini",
      "start": 400910,
      "text": "Okay, great.",
      "id": "ep_21_ut_33"
    },
    {
      "end": 404158,
      "speaker": "Jake Porway",
      "start": 402190,
      "text": "Did I get it in there? Did it cut out?",
      "id": "ep_21_ut_34"
    },
    {
      "end": 405086,
      "speaker": "Enrico Bertini",
      "start": 404334,
      "text": "No, no, it's okay.",
      "id": "ep_21_ut_35"
    },
    {
      "end": 405742,
      "speaker": "Moritz Stefaner",
      "start": 405118,
      "text": "No, it's fine.",
      "id": "ep_21_ut_36"
    },
    {
      "end": 406650,
      "speaker": "Jake Porway",
      "start": 405846,
      "text": "It's fine.",
      "id": "ep_21_ut_37"
    },
    {
      "end": 408118,
      "speaker": "Enrico Bertini",
      "start": 406990,
      "text": "Don't worry.",
      "id": "ep_21_ut_38"
    },
    {
      "end": 409130,
      "speaker": "Jake Porway",
      "start": 408294,
      "text": "Okay.",
      "id": "ep_21_ut_39"
    },
    {
      "end": 429832,
      "speaker": "Moritz Stefaner",
      "start": 410390,
      "text": "And one thing I'm wondering is, like, are you just the broker, or do you also provide, let's say, shared workspace, or do you. I think you also run workshops occasionally. So are you just telling the people, you know, there's this other person you could talk to and then hope it works out, or how much do you hold hands in the process?",
      "id": "ep_21_ut_40"
    },
    {
      "end": 534930,
      "speaker": "Jake Porway",
      "start": 429936,
      "text": "Actually, that's a really great question. We're very hand holdy. We're friendly people, we're very touchy feely. So we actually go beyond and try to facilitate a whole, really collaboration between people. We try to bring groups of people who have the time and energy to work on a data science project together with the social organization and really make sure that throughout the process we're there. Making sure that if they need resources, we can get them. If we need to build the team, we're there to build it. If there's translation that needs to be done, we're there for that. I see everyone smiling. Maybe that's because I'm just cutting out a little bit, so I'll stop mentioning and just pray for the best. We'll edit this on my recorded version. So what I was going to say about that, though, is I think that you were highlighting something really important, though, which is that I imagine you guys see this in data visualization, and data work in general, is that it's very difficult in this stage to hand someone off to a data problem, because I think a lot of people who are looking for visualizations or looking for an analysis aren't really sure yet how to articulate what they need. We spend a lot of time sitting with social organizations who come in and say, I've got data, now. What do I do? And there's a lot of process where we sit them down and almost more like, I think we act more as therapists than project managers and just saying, that's okay. This is what we want to think about. This is sort of the, you know, this is how you can address data in this way. This is why you don't need to be scared of it. And let's really understand a little bit more about what you guys want to do. So, yes, lots of handholding, lots of hugs.",
      "id": "ep_21_ut_41"
    },
    {
      "end": 544290,
      "speaker": "Moritz Stefaner",
      "start": 539150,
      "text": "So your motto is relaxed with data. Periscoping is too good with data.",
      "id": "ep_21_ut_42"
    },
    {
      "end": 546230,
      "speaker": "Jake Porway",
      "start": 545470,
      "text": "It should be.",
      "id": "ep_21_ut_43"
    },
    {
      "end": 591160,
      "speaker": "Moritz Stefaner",
      "start": 546270,
      "text": "Exactly. Don't panic with data, good with data. I can imagine that because half of my clients, it's fairly similar that they come with the thought like, yeah, we totally need a visualization. And in the process you discover, okay, first we need to sort of establish a certain way of talking about data, investigating data, just getting comfortable with data before we can actually move to the real product. And yeah, probably you have seen Jeff Horbe's post for the HBR as well, where he also stresses that point that visualization shouldn't be thought from the end product, but more the process that happens in between. This is the exciting, the exciting part, and the actual, let's say, product is the process.",
      "id": "ep_21_ut_44"
    },
    {
      "end": 596840,
      "speaker": "Jake Porway",
      "start": 593900,
      "text": "Yeah, absolutely. I think that's a. Yeah.",
      "id": "ep_21_ut_45"
    },
    {
      "end": 599320,
      "speaker": "Enrico Bertini",
      "start": 598060,
      "text": "Yeah, go ahead, Jake.",
      "id": "ep_21_ut_46"
    },
    {
      "end": 673560,
      "speaker": "Jake Porway",
      "start": 599780,
      "text": "Sorry, this is, yeah, I didn't mean to interrupt, but I totally agree that. I'm glad you brought that up, actually, I thought that was a great time for that article to hit when we were getting ready to do this podcast, because I think so many people think of, at least on our end, I should say, I should say upfront, I'm not a designer or really a data visualization person myself. So you guys may see a very different environment and different community, but a lot of the people that come asking for visualization want to see. They want to see an answer is whether they're really looking for is they want to know, this is what happened with my donors, or this is how this program went, or I want this big, messy CSV to turn into something beautiful that I can see. And so much of the process of digging into data is exploratory that I really think that using visualization should be a process of asking those questions or getting to a point where you can ask questions of data. And I think that's really, I mean, I'll just leave it there and say, I think that's really what Jer was hitting on in a lot of ways. And I think very important for us to sort of take up as a responsibility is to convey that it's not just for this end goal, but for helping you explore something and raise other questions.",
      "id": "ep_21_ut_47"
    },
    {
      "end": 733750,
      "speaker": "Enrico Bertini",
      "start": 677510,
      "text": "Yeah, I think this is something that is emerging more and more clearly lately that, I mean, data visualization projects comprise a lot of different processes and stages, and we tend to discuss about the visualization we tend to discuss a lot about visualization design itself, which is basically a tiny proportion of the work that people do when they have to run a visualization project. And I've heard these kind of things all the time from many different sources, many different kind of professionals and organizations. So I think that's really interesting that visualization is actually not really only about visualization. It's more about data and exploring this data, putting this data in the format that you need and a lot of other, of other processes. Right, yeah, yeah, sorry.",
      "id": "ep_21_ut_48"
    },
    {
      "end": 735310,
      "speaker": "Jake Porway",
      "start": 734290,
      "text": "Go ahead, Kim.",
      "id": "ep_21_ut_49"
    },
    {
      "end": 830120,
      "speaker": "Kim Rees",
      "start": 736410,
      "text": "Yeah, I agree with that. I think there's so much, so much of the process is about everything else other than visualizing it. You know, I would say probably 90% of it is not visualization. And that visualization is this tiny little creative bit of it that's a, where, you know, sort of where the magic happens, where you can set, it's like turning on the light and suddenly, wow, there it is. And it's fantastic. And then you can start exploring things, but there's a lot of lead up to it, a lot of build up to it, a lot of gathering, a lot of parsing, a lot of making sure everything's in the right format, making sure that people know what data they're supposed to be getting us. You know, lots of questions that are asked, lots of, you know, we rely on the domain expertise of most of the organizations that we work with because they know their data inside and out. And so there's a lot of handholding up front in terms of, is this the best data to tell the story you want, or is this the best data, you know, to explore in terms of getting at that story? So there's, there's so much stuff that happens up front and just in terms of dialogue, and I think a lot of people, that's, that's kind of a scary part for a lot of people because they don't see much happening, and they're, they're like, where's the visualization? You know, where, when is this magic thing gonna happen? I think people expect to dump their data and then suddenly get some visual thing out of it. So, yeah, I mean, there's a huge process leading up to it, and then there's the magic bit, and then the rest is easy.",
      "id": "ep_21_ut_50"
    },
    {
      "end": 833484,
      "speaker": "Moritz Stefaner",
      "start": 830860,
      "text": "Yeah, just get the magic bit right and the rest.",
      "id": "ep_21_ut_51"
    },
    {
      "end": 834480,
      "speaker": "Kim Rees",
      "start": 833532,
      "text": "Yeah, exactly.",
      "id": "ep_21_ut_52"
    },
    {
      "end": 913200,
      "speaker": "Enrico Bertini",
      "start": 837100,
      "text": "I think that's really interesting because until recently, before we had this big data kind of thing happening, the way people used to approach problems was starting from a problem and then trying together the data they needed. Right and now it's kind of like the opposite. You start from the data and you think about, what kind of problem can I address with that? But I think by doing that, we lost a lot of important skills or at least the right approach to deal with some problems. And one thing that actually surprises me, I think I am a big fan of Jake's article. I really enjoyed reading it. And after reading it, I was thinking about, okay, we have this whole data visualization, data science kind of thing is a big, big hype right now. And so there are books and teachers about how to do this and that. A lot of visualization designs, how to do it correctly, how to run clustering algorithms, how to gather lots of data, lots of technical stuff. But there is very, very little training or even discussion about how to approach how to find the interesting problems or how to tackle interesting problems. And I think that that's a huge gap.",
      "id": "ep_21_ut_53"
    },
    {
      "end": 935780,
      "speaker": "Moritz Stefaner",
      "start": 916120,
      "text": "How do you deal with that? Kim, how do you decide which projects to work on? And is it more that you are reaching out to organizations where you say it would be worthwhile to do something for on this Topic, or is it more organizations know your work and come to you and say, we have this data set and can you do something with it?",
      "id": "ep_21_ut_54"
    },
    {
      "end": 1012184,
      "speaker": "Kim Rees",
      "start": 936480,
      "text": "It's mostly the latter. Organizations come to us and say, we're working in this area, and here's the data we've been gathering about it. And can you help us show, for instance, all of the oil exploration that's happening in Peru, for instance? And so then we work with them to sort of figure out what the best way to visualize that and show the impact of it and show the impact on the indigenous peoples and whatnot. But then there are times when we might contact an organization if we really like what they're doing and, you know, just to sort of initiate that ProCess and, you know, introduce ourselves and say we'd like to help them. And sometimes that, you know, leads to something. And then there's the third category, which is the internal projects that we do, which we have, you know, one or two a year typically that we do. And, you know, it's just went over. We have a bit of time, you know, when we have a couple of resources free in between projects, we just pick something that is either timely or somebody's interested in. So we have this sort of running list of what I would like to work on in my spare time. And we have this great list, and some of them are too old.",
      "id": "ep_21_ut_55"
    },
    {
      "end": 1014136,
      "speaker": "Moritz Stefaner",
      "start": 1012232,
      "text": "Is it getting bigger or smaller? The list?",
      "id": "ep_21_ut_56"
    },
    {
      "end": 1081140,
      "speaker": "Kim Rees",
      "start": 1014288,
      "text": "It's getting bigger. Which is great, but also really heartbreaking because we can't do all of them. But it's really rewarding to have those projects where we're not really hindered by anything other than our own time and imagination and whatnot. So we tackle everything from research to all the stuff we normally do, which is all of the steps to getting to visualization and then pr and whatnot. So that's really rewarding because I think that as an organization who has a tagline, do good with data, everybody who comes to work for us has that mindset. So they all have great ideas about, for instance, either the gun visualization that we just did, or we also did a debate tool around the presidential debates. And so it's really interesting because everybody sort of comes together with new ideas and throws everything together in the mix. And so we have this huge basecamp list of additional features, version three and whatnot. So it's a lot of fun.",
      "id": "ep_21_ut_57"
    },
    {
      "end": 1089710,
      "speaker": "Moritz Stefaner",
      "start": 1082190,
      "text": "Yeah. That gun piece was impressive. I think you published at the beginning of the year or sometime in January, right?",
      "id": "ep_21_ut_58"
    },
    {
      "end": 1091198,
      "speaker": "Kim Rees",
      "start": 1089870,
      "text": "End of January, yeah. Yeah.",
      "id": "ep_21_ut_59"
    },
    {
      "end": 1127764,
      "speaker": "Moritz Stefaner",
      "start": 1091254,
      "text": "And I think it was really interesting on the first day. It really raised a lot of awareness to the issue, I think, as far as I can see from, you know, my Twitter world. But at the same time, I also, it sparked a few discussions, really, on how to deal with these issues. If the approach is correct. I, a few people criticized it, but many were also really impressed with this combination of combining the storytelling and this sort of dramatic structure with such an exploratory approach. And so I think it was a very timely piece to publish.",
      "id": "ep_21_ut_60"
    },
    {
      "end": 1128116,
      "speaker": "Kim Rees",
      "start": 1127812,
      "text": "Yeah.",
      "id": "ep_21_ut_61"
    },
    {
      "end": 1128796,
      "speaker": "Moritz Stefaner",
      "start": 1128188,
      "text": "Yeah.",
      "id": "ep_21_ut_62"
    },
    {
      "end": 1311590,
      "speaker": "Kim Rees",
      "start": 1128948,
      "text": "Thank you. It was. We definitely were, you know, it's the whole new town thing spurred us into action in terms of, you know, it happened, and then we just said, you know, we have to. Everyone wanted to use their skill sets to address the issue. So there was really no question about, are we going to do a piece or not? We were. It was just a matter of, do we want to focus on just Newtown? Do we want to focus on gun control? Do we want to focus on something else? And so we took more of approach of looking at all the victims of the shootings, and we kind of felt like that was a way to bridge the gap between, like, the liberal and conservative mindsets, because everyone's so sort of indoctrinated into these camps of, you know, either gun control or gun advocacy that you really, it's so hard to break down those barriers. So we felt like if we focus just on the victims, that that could be a unifying point for people that could really bring people together, because there's no question that you don't, that these people should be dead. You know, you shouldn't be dead. Right. So it sort of allows, we were hoping it would allow people to discuss the issue in a more real way rather than just sort of bringing up their party's arguments or the NRA's arguments, the things that they've been programmed to say. And so we've actually been really, I think, surprised and happily. We just really enjoyed the outcome of it because it did spur a lot of those discussions where a gun advocate will come in and start saying, the NRA's arguments against gun control. And it really sort of starts a discussion about, let's not talk about gun control. Let's talk about what's happening with these almost 10,000 people who were killed. And what can we do other than, you know, the things that are being proposed? Are there other things we can do? You know, a lot of this is around domestic violence. So, you know, are there things we can do in domestic violence that are preventive rather than focusing just on these guns? You know? So I think it's, it's spurred a lot of conversation in, in terms of gun control and gun violence, and it's also spurred a lot of discussion in terms of data visualization and, and how to approach it. And it's been, it's been really exciting and really interesting. I went to, you know, every time I give a talk and show it, people are shocked. I mean, people in the US who know the gun problem in the US are still shocked by when they see the numbers roll out. And I have to stand up there and wait for this thing to play out, you know, so people are shocked. And that, to me, has, like, the biggest impact. It's, you know, if I'm standing there showing you this and you are sort of awestruck, that, to me, is a success.",
      "id": "ep_21_ut_63"
    },
    {
      "end": 1317442,
      "speaker": "Jake Porway",
      "start": 1312770,
      "text": "I had a question for you, Kim. Oh, sorry. I don't know if I'm interrupting.",
      "id": "ep_21_ut_64"
    },
    {
      "end": 1317730,
      "speaker": "Enrico Bertini",
      "start": 1317466,
      "text": "Go ahead.",
      "id": "ep_21_ut_65"
    },
    {
      "end": 1363540,
      "speaker": "Jake Porway",
      "start": 1317770,
      "text": "But it was interesting about that visualization to me was that it wasn't just forensic and didn't just look at the data that had happened and just said, here are the people who have died from gun violence, but then actually built a sort of rough model to say where people would have died otherwise. You actually drew in a World Health Organization data to try to project forward. And I thought that was an interesting approach, and I was just sort of wondering what the thought process was behind that. And also, if you could comment on a side conversation I'd heard where some people were actually trying to debate sort of the correctness of that model, which I think sort of misses the point a little bit. But I just thought that was very interesting to sort of look ahead and wonder what that design process is like for that.",
      "id": "ep_21_ut_66"
    },
    {
      "end": 1464870,
      "speaker": "Kim Rees",
      "start": 1367380,
      "text": "A lot of people take issue with that part of it, which I find interesting as well, because you can. It's interesting to me because a doctor could say, hey, if you quit smoking now, you could add ten years to your life or something. That's all we're doing is saying, hey, if you quit shooting for now, you might live longer. You might live to be 80. Based on the statistics, the drive behind it was that we were, you know, we had sort of tossed around a number of ways to approach this. And, you know, even internally, it was kind of surprising how divisive we were about gun control. And certain people wanted really strict controls. And some people said, that doesn't work. How about this? And, you know, we started to almost get into internal arguments about the proper approach to these things, which is surprising because we're all like on the same page. You know, we all want people to be alive. And so it's kind of surprising there. But then once we focused on victims, it really sort of solidified the idea about, you know, what this is actually going to look like and how we want to present it. And then, I don't know, it just like out of nowhere I had this idea of, well, it's really about the stolen lives. It's about the potential and it's about the things that were taken away. It's not so much about like, oh, you killed somebody and now they're.",
      "id": "ep_21_ut_67"
    },
    {
      "end": 1500760,
      "speaker": "Moritz Stefaner",
      "start": 1464910,
      "text": "Yeah, I mean, it opens up that alternative reality. You know, it doesn't just say our world is bad, you know, it says there would be a better world. And I mean, I think that's super important because, I mean, we. And personally, I'm also a bit torn if everybody should consume, like, global world news the way they are presented at the moment all the time, because I think it just makes you depressed. And depression is the surest way of not getting into action. There's a real danger there. I think if we present too many bad news that people just think it's worthless doing anything anyways.",
      "id": "ep_21_ut_68"
    },
    {
      "end": 1501940,
      "speaker": "Kim Rees",
      "start": 1500840,
      "text": "Right, right.",
      "id": "ep_21_ut_69"
    },
    {
      "end": 1516972,
      "speaker": "Moritz Stefaner",
      "start": 1502720,
      "text": "And I found it really interesting that your visualization also suggests that there would be another world, you know, where these people would live, should be moved towards that world. And, you know, and that makes it so strong, probably.",
      "id": "ep_21_ut_70"
    },
    {
      "end": 1535680,
      "speaker": "Kim Rees",
      "start": 1517156,
      "text": "Right. Yeah, I toyed around with an idea early on of, like, age progressing all of the, like, if we had portraits of. If we had photos of the victims to, like, age progress them to their. When they may have died, and that quickly became very creepy and weird.",
      "id": "ep_21_ut_71"
    },
    {
      "end": 1536352,
      "speaker": "Enrico Bertini",
      "start": 1535820,
      "text": "Yeah, yeah.",
      "id": "ep_21_ut_72"
    },
    {
      "end": 1537260,
      "speaker": "Kim Rees",
      "start": 1536416,
      "text": "But it did.",
      "id": "ep_21_ut_73"
    },
    {
      "end": 1542536,
      "speaker": "Moritz Stefaner",
      "start": 1537840,
      "text": "Children and new families they might have had. This is the house. And.",
      "id": "ep_21_ut_74"
    },
    {
      "end": 1596970,
      "speaker": "Kim Rees",
      "start": 1542728,
      "text": "Exactly. I mean, it sort of went to that end, like, well, what, you know, what are these people? And what. Yeah, exactly. The whole what if. What would happen and who. You know, I mean, you could take statistics to that level if you wanted to. How many, you know, you could say, you know, based on statistics, this person may have lived to 82. They would have died of pancreatic cancer. But then, you know, what percentage of these people would have kids? How many kids would they have? How many grandkids, that sort of thing, you know, how would they own a house? Blah, blah, blah. I mean, you could go nuts with this if you wanted to. I mean, we could have created entire lives for these people. And it's really. I mean, it's something that I think about that when I look at the piece, I look at it still almost every day just to see the updates. And, you know, it just really causes you to think about what may have been for these people, you know?",
      "id": "ep_21_ut_75"
    },
    {
      "end": 1614410,
      "speaker": "Moritz Stefaner",
      "start": 1597910,
      "text": "But I think it's a bit attackable on that end because, I mean, if I were a gun, a pro gun lobbyist, I would say, well, who knows? If they would have lived that long, they might have killed each other with a knife or, I don't know, dynamite or whatever.",
      "id": "ep_21_ut_76"
    },
    {
      "end": 1616574,
      "speaker": "Kim Rees",
      "start": 1616150,
      "text": "Yeah.",
      "id": "ep_21_ut_77"
    },
    {
      "end": 1623092,
      "speaker": "Moritz Stefaner",
      "start": 1616622,
      "text": "And so that's the tricky part, really, that you're suggesting that all these people would have led a happy life with.",
      "id": "ep_21_ut_78"
    },
    {
      "end": 1660666,
      "speaker": "Kim Rees",
      "start": 1623156,
      "text": "It's true. It's true. And I mean, a lot. You know, some of these people live in very, you know, violent prone areas. It's very tough to say what. What could have been. And it's very hard to say if that person didn't have a gun, would they have killed that person with a knife? You know, it's definitely a lot easier to kill someone with a gun. You don't have to be at close range and all sorts of things. You know, the belief is there's at least a higher percentage who would be, you know, who with guns would be killed. So, I mean, there are so many avenues that you could argue up and down and until you're just completely depressed and.",
      "id": "ep_21_ut_79"
    },
    {
      "end": 1668310,
      "speaker": "Moritz Stefaner",
      "start": 1660778,
      "text": "Yeah, yeah. But that's the tricky part. The more accurate you get from the scientific point, the less it fits into a headline. Right.",
      "id": "ep_21_ut_80"
    },
    {
      "end": 1669282,
      "speaker": "Kim Rees",
      "start": 1668650,
      "text": "That's true.",
      "id": "ep_21_ut_81"
    },
    {
      "end": 1680324,
      "speaker": "Moritz Stefaner",
      "start": 1669346,
      "text": "I think that's a balance we have to strike all the time. Like, how much do we boil it down and how much exactly do we respect all the details and all the intricacies and all the.",
      "id": "ep_21_ut_82"
    },
    {
      "end": 1732010,
      "speaker": "Kim Rees",
      "start": 1680412,
      "text": "Yeah, exactly. And there's also, like, I believe there's this, you know, what I like to call death by disclaimer, which is if you follow every. You know, like a lot of people took issue with our, you know, age, projected age. You know, if I had taken into every single demographic and this and that, I. We wouldn't have done it because it just would have been. There was no perfect way. You would never get to perfection unless you followed each one of those people around for their entire lives and had every little bit of information about them. There's no way to know that specifically. So, you know, if you start down that path, if you go too far down that path, you will just kill any concept, you know, any idea, any visualization, any creative thing that you have, because you will just suffer this death by disclaimer.",
      "id": "ep_21_ut_83"
    },
    {
      "end": 1747796,
      "speaker": "Moritz Stefaner",
      "start": 1733900,
      "text": "Just like a journalist, you have to develop a sense of what's right and what's the truth. And if you are really, really convinced that this is the way things are, I think then you can make that step and say, okay, I'll go out on a limb and say this person will live 64 years, you know.",
      "id": "ep_21_ut_84"
    },
    {
      "end": 1748124,
      "speaker": "Kim Rees",
      "start": 1747868,
      "text": "Right.",
      "id": "ep_21_ut_85"
    },
    {
      "end": 1750596,
      "speaker": "Moritz Stefaner",
      "start": 1748172,
      "text": "Because I know it checks out in the big picture.",
      "id": "ep_21_ut_86"
    },
    {
      "end": 1751148,
      "speaker": "Jake Porway",
      "start": 1750708,
      "text": "Exactly.",
      "id": "ep_21_ut_87"
    },
    {
      "end": 1768210,
      "speaker": "Kim Rees",
      "start": 1751204,
      "text": "Exactly. I'm going to put a stake in the ground. And I know that this is roughly right. And, you know, it may not be exactly, but, you know, if you took those 10,000 people and threw them in a hat and, you know, this is roughly what it would look like, give or take a few years here and there.",
      "id": "ep_21_ut_88"
    },
    {
      "end": 1772930,
      "speaker": "Moritz Stefaner",
      "start": 1769510,
      "text": "So do you think this one will change gun legislation?",
      "id": "ep_21_ut_89"
    },
    {
      "end": 1799728,
      "speaker": "Kim Rees",
      "start": 1775550,
      "text": "I would love to be that idealistic. You know, I think there are, the more people who are discussing it and the more people who are putting things out there to spark conversation, the better, you know, and we're sort of just adding to that dialogue. So if one person takes away something good from it, then to me, it's worthwhile.",
      "id": "ep_21_ut_90"
    },
    {
      "end": 1816610,
      "speaker": "Moritz Stefaner",
      "start": 1799824,
      "text": "I think that has happened. So I think we can be confident. I, for one, but I don't make laws. Jake, what's your experience with that problem? That awareness alone doesn't really move anything. And how do you get people to action? Like, do you have any?",
      "id": "ep_21_ut_91"
    },
    {
      "end": 1968066,
      "speaker": "Jake Porway",
      "start": 1816950,
      "text": "That's a really, really great question. I think that's one of the things that I'm going to sort of spin that a little bit related to something Enrico said earlier, which is that I think we see a lot of people these days who suddenly find themselves with access to amazing data visualization tools and for probably the first time ever, a huge amount of data available to them. Which means that I see more and more people creating data visualizations sort of on their own, maybe in a bubble where they believe that they're going to have some kind of effect or some action. Like I've related to the gun laws issue. I saw a lot of visualizations out about how many people had killed themselves or, excuse me, died of gun violence by age group. And that visualization sort of highlighted suicide rates or you see people going out and actually visualizing where gun owners live. And I think there's, you know, this excitement around using data and data visualization to try to raise awareness to a cause, which is absolutely critical. I think it's a very important first step. But I think one of the things that I love about what periscopic does is that they partner with people who actually are sort of familiar with the communities that are being affected. And I think that's one of the things that I would love to see more people really in any of the data world doing is sort of partnering with people who are close to the ground. It's one thing to download a data set off of data dot gov about pollution and make a pollution graph of where there's pollution in the US. It's another entirely to team up with someone from the EPA and say what would be interesting to see what here would drive an action. And I think that maybe comes back as well to the point about Jer's article about using data vis as sort of this end goal to say, Tada, here's what gun violence looks like, or here's what pollution looks like. Now everyone go and act versus having a little bit of a bringing it into more of a process of saying what do we want to learn that we can, alongside people who know the condition, actually adapt to and adjust to? And how do we then sort of decide we want to look at something else because of something that we saw in this? There was a little bit of a rambling answer there, but it's definitely a problem. But I think to me really the biggest thing would be stronger partnerships with people who are actually addressing these causes. I think that would be really, really heartening to me. I'm happy to expound on that, but I'm trying to keep everything within a short answer.",
      "id": "ep_21_ut_92"
    },
    {
      "end": 2086379,
      "speaker": "Enrico Bertini",
      "start": 1968218,
      "text": "Yeah, I think that's a super, super important topic. And in a way it's related to something that we discussed I think many times, even in the, in this podcast, that basically you can use visualization as an explanatory tool to communicate an idea that you have or something that you found in some data set, or you can use it as an exploratory tool. And I think the problem is that the large majority of visualizations we see on the web, which is the main mean we use to see visualizations, to discover new visualizations, is basically using visualization as a way to communicate something. But behind that there might be a lot of exploratory work that is done itself with some kind of visualization tools. So, for instance, I know Moritz has mentioned many times the fact that behind every single visualization he does, there is a lot of extra work, and some of this extra work is done with tools like Tableau or similar stuff. And that's always true. And I think that's very much connected also to the problem of doing visualization, using visualization as an exploratory tool, together with people who have the background knowledge to interpret whatever comes from the visualization itself. So I think these old set of things are very much related one to another. But I think. So one thing maybe I want to ask you this question, because I think that what is happening is that we see much more of these kind of visualizations. But just because it's easy to put this kind of visualizations on the web, if you want to be, if you want to present the process itself, it makes you need to either write a very long page description or whatever. So nobody's, or a very, very little percentage of people are actually publishing something about the whole process. Right. I think the whole process is happening anyway. And I think that's really, really interesting. I don't know, what's your experience, Kim and Jake?",
      "id": "ep_21_ut_93"
    },
    {
      "end": 2093495,
      "speaker": "Kim Rees",
      "start": 2090719,
      "text": "Jake, do you want to talk to them?",
      "id": "ep_21_ut_94"
    },
    {
      "end": 2159984,
      "speaker": "Jake Porway",
      "start": 2093647,
      "text": "Yeah, I mean, I think that's, I thought that was a very interesting point about the web just naturally being the way that we consume a lot of these things. And that maybe, if I understood correctly, maybe you were saying behind the scenes, like with Moritz creations or with someone else, that there's a lot of actual sort of iteration and work that goes on there. And I mean, I think that really does, I mean, that closely reflects with sort of what I've seen. And I don't want to take us too far off on a tangent. I'm not sure if I'm answering this question, but I will just sort of comment that I would love to see more people talking about process, and actually, you guys are really good about it. I would say in general, the data of Visworld and design world is actually better, I think, than a lot in talking about how they come up with the final products that they do that you see on the web all glittering and shiny. But I think with a lot of data in general, it's really black boxed. I mean, when someone, when a company, even if a company comes out and touts on their blog what they've done with data or how they've created some interactive or visualization, they don't usually talk about the missteps and they don't usually talk about the data sets. They didn't use values.",
      "id": "ep_21_ut_95"
    },
    {
      "end": 2160416,
      "speaker": "Moritz Stefaner",
      "start": 2160072,
      "text": "Sure.",
      "id": "ep_21_ut_96"
    },
    {
      "end": 2163616,
      "speaker": "Jake Porway",
      "start": 2160488,
      "text": "And I would love to see more of that.",
      "id": "ep_21_ut_97"
    },
    {
      "end": 2167660,
      "speaker": "Moritz Stefaner",
      "start": 2163688,
      "text": "They don't talk about how much time they spent with fixing Unicode errors in Python.",
      "id": "ep_21_ut_98"
    },
    {
      "end": 2170420,
      "speaker": "Jake Porway",
      "start": 2169400,
      "text": "Exactly.",
      "id": "ep_21_ut_99"
    },
    {
      "end": 2214688,
      "speaker": "Kim Rees",
      "start": 2173240,
      "text": "Yeah. I mean, Jake, I think you make a really good point, and it's kind of funny because I think there is a lot of mystique around it, but I think that it's also mysterious to us as well. A lot of the stuff I've been talking about in the last year or so at conferences is our process. And when I started doing that talk, it took me forever to write that talk because I had no idea, even though I did it every day for eight years, it was like, how do I do this? I know I put this in Tableau, but how do I make the decision?",
      "id": "ep_21_ut_100"
    },
    {
      "end": 2225220,
      "speaker": "Moritz Stefaner",
      "start": 2214784,
      "text": "It's so hard to generalize. It's more like a set of dispositions. Like how do you react when. But it's so hard to say. These are the top ten rules you have to follow. And this is how it works.",
      "id": "ep_21_ut_101"
    },
    {
      "end": 2226440,
      "speaker": "Kim Rees",
      "start": 2225380,
      "text": "Exactly.",
      "id": "ep_21_ut_102"
    },
    {
      "end": 2247910,
      "speaker": "Enrico Bertini",
      "start": 2227460,
      "text": "Don't you guys think that that's what is actually making the difference? I mean, being able to follow the quote, right process, I think it's very, very, it's a very important skill. Probably more important, even more important than being able to design a good visualization itself.",
      "id": "ep_21_ut_103"
    },
    {
      "end": 2305068,
      "speaker": "Moritz Stefaner",
      "start": 2248970,
      "text": "I mean, it's both. It's a muscle you can train. You know, it's like it's. But it's a muscle you have to train so it doesn't fall from the sky in the good side as well as the bad side. So everybody can learn it. I'm totally sure about that. Everybody can learn how to visualize data, but it's nothing you can just acquire by clicking through a few PowerPoint slides. I guess there's no one click way to save the world, I'm afraid. I think this is clear by now. Yeah, too bad. Bummer. Yeah, let's move on. That's tricky, but I think it's great that, I mean, also, Jake, what you're doing with data kind, I think, goes exactly in this direction of gradually teaching everybody who's involved step by step of what it takes and just, yeah, it takes a while to get there, I'm sure.",
      "id": "ep_21_ut_104"
    },
    {
      "end": 2412650,
      "speaker": "Jake Porway",
      "start": 2305244,
      "text": "Yeah, thank you for saying that. And, you know, not to sound like a broken record, but I think the biggest thing that we've sort of learned in doing this is the same thing that I think a lot of data scientists learn, which is that the data actually has very little to do with it when you're starting out. In fact, it's really, as I mentioned, those organizations that walk in and say, hey, we've got this, we've got so much data, what should we do? We actually spend a good couple of sessions just asking them about what they do, actually do. What is your, you know, if you're a human rights organization, like, what is your process? What questions do you want answered? What is it that would make you better? And from there, then it's the question of saying, okay, could this data actually answer that question? And if not, where could we get some that could? And I think that's, that's, to me, been. I know it's a little bit off the topic of visualization, but I think it relates heavily to anyone working, really, on any sort of data project, whether you're coming out with an analysis at the end or a visualization is really working with people to figure out what it is they're trying to accomplish with this. I think there is this hype that we really need to be vocal about, that data itself is not this magic bullet. And I know that's probably obvious to listeners of this podcast. In that case, I implore them, tell everyone you know, tell everyone who's talking about this or every relative who's emailing you David Brooks's article, to turn around and say, yeah, the data is not, it's not this end all and be all and big data is not going to alone just sort of answer all of these questions for us. We still need the people who are familiar with the questions, familiar with the space to really help guide us to where that data can be a resource in service of those things. So those are the little steps that I think would be really helpful in helping people understand when they think about data personally.",
      "id": "ep_21_ut_105"
    },
    {
      "end": 2472410,
      "speaker": "Kim Rees",
      "start": 2413190,
      "text": "Right. And to that point, too, I think that even when there are people who are skilled at data and analysis and are experts in whatever domain it is, two people can have two different worldviews and be looking at the exact same data and have completely different understanding of it. You know, and I think that, you know, we need all of these experts. And to the degree that it's still a dialogue at the end of the day, most of this is still not, you know, you can show the most detailed, nuanced, clearest picture and still somebody will read it differently because they will say, well, oh, that just proves that my thinking is correct because it's, you know, because of some weird way that they are seeing it. And, I mean, that comes up time and time again, and it's really fascinating to me. So I think that you're right that those, I mean, I think the domain experts need to even drive the dialogue after visualization.",
      "id": "ep_21_ut_106"
    },
    {
      "end": 2491336,
      "speaker": "Jake Porway",
      "start": 2473190,
      "text": "Well, here's something I'd love to ask you guys, is how do you deal with the sort of responsibility around the fact that data can be visualized or represented so many different ways? And, you know, we say this a lot in the statistics world is that if you torture the data enough, it'll say anything. And I think that's really important because.",
      "id": "ep_21_ut_107"
    },
    {
      "end": 2492816,
      "speaker": "Moritz Stefaner",
      "start": 2491408,
      "text": "A lot of it's very true as well.",
      "id": "ep_21_ut_108"
    },
    {
      "end": 2544820,
      "speaker": "Jake Porway",
      "start": 2492888,
      "text": "Yeah, right, right. A lot of statistics in data science is really more about rhetoric in a lot of ways than about sort of fact and truth. And I think there's this false conflation of data with truth. Like, if we just get enough data, no one will be able to dispute anything because the data is just right there. Right. But of course, there are these beautiful stories about, like, the Tesla test drive. If you guys followed that story where a New York Times reporter went out to test the Tesla car, the fully electric car, and he just wrote about how terrible it was and it broke down and it didn't, it seemed like it was lagging. And Tesla turned around and said, no, hey, we have all the data about that entire ride. The car records, car records, the tire pressure, the speed, the charging. And they wrote this really line by line takedown of all this guy's plans.",
      "id": "ep_21_ut_109"
    },
    {
      "end": 2554024,
      "speaker": "Moritz Stefaner",
      "start": 2547000,
      "text": "It was a huge discussion in the end on all the details and all the intricacies, again, of the data and how it's to be interpreted.",
      "id": "ep_21_ut_110"
    },
    {
      "end": 2583700,
      "speaker": "Jake Porway",
      "start": 2554072,
      "text": "So, and you just used exactly the word how it's to be interpreted. The data didn't actually clear up the story. It just presented a different viewpoint. And then you had the, in the end, I still feel like people kind of throw up their hands and go, well, you, we have to trust one of these people. So to go back, how is when you're visualizing data knowing that you could, with this flick of an aspect ratio, totally change the story you told, if there's a responsibility to that or how you sort of manage that.",
      "id": "ep_21_ut_111"
    },
    {
      "end": 2620156,
      "speaker": "Kim Rees",
      "start": 2584840,
      "text": "Well, yeah, I mean, I think that's, I mean, there's this, I mean, you can, this could be debilitating for a lot of people. I mean, it's like if you sat in bed in the morning and thought about all of these things, you just would not get out of bed, you know? And, I mean, there's this great book, I just got it. It's fantastic. It's called raw data as an oxymoron. And it's. Yeah, it's fantastic. And it talks to a lot of these issues that even before you have data, you make a ton of decisions about what are we going to include.",
      "id": "ep_21_ut_112"
    },
    {
      "end": 2627920,
      "speaker": "Moritz Stefaner",
      "start": 2620228,
      "text": "What to combine, what to call what, you know, what's being labeled as. What is a 37.9.",
      "id": "ep_21_ut_113"
    },
    {
      "end": 2695462,
      "speaker": "Kim Rees",
      "start": 2628990,
      "text": "Exactly. Exactly. I mean, it's, it is insane if you stop to question every detail. And so, I mean, I think there is a lot of faith that people have to put in, to data, into numbers and to statistics and to visualizations and. But it's also, I mean, I think it's healthy to be a skeptic as well and to go back and say, well, what was their source? If I disagree with this, you know, where can I go? And I mean, a lot of times if I read a, if I read an article that I find interesting and I, they reference a study, yet they don't link to the source. So, you know, like, I want to go back and check to make sure that they interpret that and interpreted that number correctly or the way that I interpreted it, you know, so it's a lot of, you know, I think people have to just be rigorous about citing sources and about being clear about their methods. And, you know, it's just, if you want to do the paper trail back to the beginning, then you can do that. If you want to go that whole analysis route or you put your faith in all the people that brought that data along the way, I think that's.",
      "id": "ep_21_ut_114"
    },
    {
      "end": 2772308,
      "speaker": "Moritz Stefaner",
      "start": 2695486,
      "text": "Really important just to document really clearly of how you process the data and what's behind it. What's the research maybe behind it? What's the research behind the model you chose for the life expectancy? And I think that that makes it much cleaner and much more easy to debate with or to identify, like, insecurities where you say, okay, this part we actually don't know exactly, but we took the best model we had or something like that. The other thing is really, I mean, a few years ago I was much more on the. I had the idea that I'm trying to express the data in its purest form or the information in its clearest form, and that this is my job. And by now I'm much more feeling. I'm like a photo reporter, you know? So I go to these lands, you know, like crazy countries of data, and I take a lot of pictures, like really many pictures with the people there and the food they eat and, you know, the funny animals. But in the end, you come back and then you have to think, like, okay, what were the three photos that characterize my whole experience in one picture? And it can be like a close up of a shoe, you know, or it can be like this huge panorama or so it just has to match my perception of what's right.",
      "id": "ep_21_ut_115"
    },
    {
      "end": 2970350,
      "speaker": "Jake Porway",
      "start": 2772444,
      "text": "Well, and that's such a great analogy because I think, I mean, it just fits perfectly, especially because I love picturing the calming shores of the data countries. But I think, you know, for I don't know how this happened culturally, if it was immediately apparent when photography first came out or if it took time. But I feel that the public, when they look at a picture, sort of aware of the photographer, aware of the fact that I know that if Moritz comes back and shows me his photo album, I've sort of already subconsciously absorbed that. I know it was because of where he went and he likes this. And of course, there's pictures of cakes or whatever, because he always takes pictures of cakes. That's sort of whatever, but that's sort of baked in. And I wonder if there's a way that we can raise awareness in the public who presumably should be consuming these data visualizations around the subjectivity of that process as well. And as you pointed out, not the subjectivity of the data itself. Even if you followed a cited source, like you said, so many decisions went into creating that data that I don't want to create a world of. I agree with you. I don't want to create a world of skeptics where you have to go back and actually, if you're going to use stop and frisk data, go back and interview every single person who was recorded and see if they actually were stopped and frisked for that thing. I don't want to see that kind of level of skepticism, but I would love if people would at least know what you pointed out about raw data and actually, on the stop and frisk example, to relate this, I don't know if anyone followed this, but in New York, there's a little bit of a brouhaha around a couple of visualizations of stop and frisk data. And I know that the NYCLU had taken the data, which I should point out is totally publicly available. If you want to go to the NYPD website, you can download all the SOP and frisks in incredible detail over the past ten ish years. And a lot of people have taken that data and visualized it to try to say something. WNYC here did something about showing stop and frisks versus where guns were found to sort of see if they correlated visually. Somebody else commented on that and said, look, they didn't use the right color scheme. So it leads to this misleading conclusion that stops and frisks are happening far away from where guns are actually found. But if you shade it a different way, it looks like they are. And there were all these debates around the different visualizations, yet no one actually went back and said, what was the process for the NYPD collecting this data? And if you actually. I mean, I shouldn't say no one, but fewer people. And when you actually get into that, you find out that, in fact, huge numbers of records are just missed because not every police officer writes down every stop and frisk. You know, they may just go up and they may just go up and talk to someone and then not actually record it. There's huge political aspects in the ways that they even do record it. If you actually look over the different years, the races, the actual race designations, white, black, hispanic, actually change, because at some point someone decided there needed to be white Hispanic and black Hispanic. So what are the huge political and social biases that were involved in even creating those taxonomies before even getting to any of the visualization of any of this? So, anyway, long way around to saying, could we raise that same awareness of the subjectivity of all of this?",
      "id": "ep_21_ut_116"
    },
    {
      "end": 2998272,
      "speaker": "Moritz Stefaner",
      "start": 2970810,
      "text": "But, you know, the discussion that happens is so, you know, worthwhile already if people start to criticize a chart, you know, because then they actually engage in actively questioning the data and arguing on the basis of data, at least, you know, and not on the basis of opinions or, I don't know how they feel today, you know, and so that's, that's already something, even if it's a big mess in the end. And I. And you feel there's no progress. I think this is progress already. So, yeah, that's true.",
      "id": "ep_21_ut_117"
    },
    {
      "end": 3001552,
      "speaker": "Jake Porway",
      "start": 2998296,
      "text": "You're getting them one step closer to actually thinking about the data.",
      "id": "ep_21_ut_118"
    },
    {
      "end": 3072790,
      "speaker": "Kim Rees",
      "start": 3001616,
      "text": "Hopefully, hopefully another approach that we've seen out there is to, we worked with this great organization called Project Votesmart, and they have a board of, I don't know, twelve people or something. It's an even number. And if somebody drops off the board and they have to get a new person, the new person on the board has to get their opposite to join the board. So that there's like, they're aiming for perfect parity. So even if you're a moderate, you still have to find someone who's like, moderate, you know, different enough. You know, they're still moderate, probably, but they're different on the viewpoints that you have that sort of lean one way or the other. And if you're way on one end, you have to find someone who's like, way on the other end of the spectrum. And it's really fascinating. I think it's a really great approach to sort of building your own watchdog group of, you know, so that way you can vet everything along the way of, you know, is this data? Is this okay? They do a ton of research, so, you know, they have to internally decide, is this, you know, are we capturing this data correctly?",
      "id": "ep_21_ut_119"
    },
    {
      "end": 3075798,
      "speaker": "Jake Porway",
      "start": 3073090,
      "text": "That's awesome. What was the name of that group again, Kim?",
      "id": "ep_21_ut_120"
    },
    {
      "end": 3077958,
      "speaker": "Kim Rees",
      "start": 3075914,
      "text": "It's Project Boat Smart.",
      "id": "ep_21_ut_121"
    },
    {
      "end": 3081890,
      "speaker": "Jake Porway",
      "start": 3078094,
      "text": "Project boat smart. Boat smart. That makes more sense.",
      "id": "ep_21_ut_122"
    },
    {
      "end": 3085966,
      "speaker": "Kim Rees",
      "start": 3083150,
      "text": "Smart boating jacket. Exactly.",
      "id": "ep_21_ut_123"
    },
    {
      "end": 3167180,
      "speaker": "Jake Porway",
      "start": 3086078,
      "text": "It's very controversial. So this, actually, I've been talking about this one interactive that I adore from the New York Times on the jobs report. I don't know if anyone saw this, but it was when the jobs report came out right before the election. And the interactive had sort of the raw jobs number in the sort of center. It was just the raw data, but then there were these red and blue glasses on either side. And if you press the red button, the red glasses, it would shift over. Yeah. It showed the interpretation and visualization of the data that supported the republican view. And if you move to the blue side, it showed the interpretation that supported the democrats view. And again, leaving aside the fact that the quote, unquote raw data itself has all these biases about what unemployment even is, leaving that aside, you can see by seeing the comparison of the two visualizations, I think it makes you instantly aware that there are these two extremes, and they come from the same sort of raw materials. And so the project votesmart thing reminds me a little bit of that, in that if you can have someone from the opposing viewpoint come and say, hey, this is what this would look like in the other extreme, that maybe it makes you at least aware of the fact that there's not sort of this one true interpretation. I just really liked that approach. Oh, disconnected again.",
      "id": "ep_21_ut_124"
    },
    {
      "end": 3171500,
      "speaker": "Moritz Stefaner",
      "start": 3170320,
      "text": "Jake, you're back.",
      "id": "ep_21_ut_125"
    },
    {
      "end": 3172712,
      "speaker": "Jake Porway",
      "start": 3171880,
      "text": "I believe so.",
      "id": "ep_21_ut_126"
    },
    {
      "end": 3176216,
      "speaker": "Moritz Stefaner",
      "start": 3172776,
      "text": "Ah, excellent. We just heard approach. We heard approach as last word.",
      "id": "ep_21_ut_127"
    },
    {
      "end": 3181160,
      "speaker": "Jake Porway",
      "start": 3176248,
      "text": "So that it was a good approach probably. Oh yeah, sure.",
      "id": "ep_21_ut_128"
    },
    {
      "end": 3182472,
      "speaker": "Enrico Bertini",
      "start": 3181280,
      "text": "That was a cool question.",
      "id": "ep_21_ut_129"
    },
    {
      "end": 3184432,
      "speaker": "Moritz Stefaner",
      "start": 3182616,
      "text": "I would guess so, yeah.",
      "id": "ep_21_ut_130"
    },
    {
      "end": 3186660,
      "speaker": "Jake Porway",
      "start": 3184456,
      "text": "Why not? Perfect timing.",
      "id": "ep_21_ut_131"
    },
    {
      "end": 3214620,
      "speaker": "Enrico Bertini",
      "start": 3187390,
      "text": "Let me ask something to Kim. Okay. So going back to our initial question, can visualization save the world? Can you tell us something about the biggest success stories that you've ever seen in data visualization? That's a. Yeah, I always answer, I always ask this question and the answer is always the same, kind of like. Well, I don't know.",
      "id": "ep_21_ut_132"
    },
    {
      "end": 3410702,
      "speaker": "Kim Rees",
      "start": 3216880,
      "text": "I think for our own work it's tough. We don't get a lot of feedback after we release them into the wild. So it's kind of frustrating. And a lot of our clients, there are organizations, they're nonprofits who perhaps don't have huge budgets to go out and figure out the success of any of these things. One thing that we're struggling with over time and something we're trying to get our clients to do more of is to not preach to the choir. You know, I think that a lot of people like to preach to the choir. They, you know, they put out things that are branded in, you know, in a certain way that have tell a story in a certain way that sort of any outsider, anybody who doesn't share that opinion is going to just immediately turn away from because they know that it's going to differ from their opinion. So being more inclusive is definitely on our radar. But I think for me personally, aside from the guns piece, which I think had a huge impact in terms of what I personally was trying to achieve with it or what periscopic was trying to achieve with it, I think that that's sort of a different, a different piece. But there was the piece we did for project Boat Smart, which is a voter education piece and it basically allowed people to enter in their views on certain issues. So like ten to twelve issues, they could say I'm pro choice. And I said how do you feel about gun control? And answer certain ways and how important it is to them and it would match them up with their best candidates. And the first version we put out was at the congressional level and I don't know if how much you know about the US Congress, but there are lots of candidates in the beginning and most people don't know all of the candidates who are running in their state. And so when they see this for the first time, they're like, oh, wow, they're, you know, there's Sally Jane, and I have no idea who she is. I've never heard of her, and I have to vote now. So when you're confronted with the actual data and all of these people have been researched, so we know, do they compare with your views or nothing. Suddenly people writing us saying, I had no idea. I'm in complete alignment with the Green Party. And I didn't know that was even an option. So that project to me was the most successful in terms of impact. There was one guy who wrote to us and said, I just registered to vote because now I know who to vote for. And it was, I mean, those kinds of stories are fantastic just in terms of, you know, people don't have access to those huge amounts of data. They would have to be, you know, political researchers to figure all that stuff out. And here's a tool that just helps them spend three minutes to figure that out. So those are the biggest impact ones for us personally at periscopic. And then I think just, there have been some historic ones in the world that I spoke to some of them earlier that I think have had, you know, obvious huge impacts in our society. So.",
      "id": "ep_21_ut_133"
    },
    {
      "end": 3429510,
      "speaker": "Enrico Bertini",
      "start": 3410886,
      "text": "Yeah. Yeah, that's a good one. Well, that's the kind of thing that I would like to see more often told in websites, blogs and all other sources. It's so hard to find sources where people say, look, this visualization had this kind of impact. And I think we can measure what.",
      "id": "ep_21_ut_134"
    },
    {
      "end": 3449744,
      "speaker": "Moritz Stefaner",
      "start": 3429550,
      "text": "Happens in people's heads. You know, that's, that's sort of the problem. But I would also be super interested in studies like show people the gun visualization, you know, the gun murders, and find some way of sort of measuring if their opinion has changed at least a bit, you know, that there must be a way to measure these things, probably.",
      "id": "ep_21_ut_135"
    },
    {
      "end": 3453160,
      "speaker": "Enrico Bertini",
      "start": 3449912,
      "text": "Absolutely, absolutely. I'm actually thinking about doing that.",
      "id": "ep_21_ut_136"
    },
    {
      "end": 3454312,
      "speaker": "Moritz Stefaner",
      "start": 3453280,
      "text": "Yeah, you should.",
      "id": "ep_21_ut_137"
    },
    {
      "end": 3457580,
      "speaker": "Enrico Bertini",
      "start": 3454456,
      "text": "Yeah, yeah, yeah. But it's very hard, actually.",
      "id": "ep_21_ut_138"
    },
    {
      "end": 3465970,
      "speaker": "Moritz Stefaner",
      "start": 3458320,
      "text": "Jake, are you aware of any, like, experiments or any studies or do you have any, any good stories on impact?",
      "id": "ep_21_ut_139"
    },
    {
      "end": 3537810,
      "speaker": "Jake Porway",
      "start": 3466510,
      "text": "Well, I'm so on the point you just made. I'm the wet blanket that says that measuring sort of changes in opinion is so difficult. I mean, this is something advertising. That's every advertiser's holy Grail, right? If I put a big part in this intersection, how many more people buy the product? I mean, we're getting, obviously, we're getting closer as we get more data streams because we're just getting more bottom up information. And heck, maybe one day you could actually do some kind of experiment. But I think it's better to talk about sort of the different measures of impact in terms of maybe just this doesn't sound so sexy, but how people are starting a discussion like just what these visualizations are getting people to think about differently, that's an unsatisfying answer, I know, but it's just something that we face a lot in our work, is that everyone wants to prove that the thing they did, they want to measure, they want to believe we must be able to measure the thing we did caused this dramatic needle shift in the public. It's just so, so difficult. And from a statistical point of view as well, to be able to say that your intervention alone was solely responsible for that is really, really tricky.",
      "id": "ep_21_ut_140"
    },
    {
      "end": 3544778,
      "speaker": "Moritz Stefaner",
      "start": 3537930,
      "text": "But can't we have like one game changer visualization so we can change the whole game?",
      "id": "ep_21_ut_141"
    },
    {
      "end": 3809854,
      "speaker": "Jake Porway",
      "start": 3544914,
      "text": "I mean, totally. Well, so what's mad? I'll take another boring answer to that, but one that I actually think is still inspiring, which is going back to what you were saying earlier about the visualizations we see out there being on the web as being sort of the big promoted ones. But if you think of visualization as just the aspect of exploring large amounts of data such that you can see things that you never saw before that drive an action, I'd say I see that happen internally for small groups all the time, and I'm sure that must happen all the time at periscopic. But I would even just think about some projects that we've done at Datakind. The really basic one was that a group was trying to, let's see, how should I put this? They had a community knowledge worker program where they had people in Uganda with cell phones that would go out to rural farmers and basically provide information for them. You're very information poor. If you're a rural farmer in Uganda, you don't even know what the weather is going to be like the next day. You have no idea what crop prices are around you. And so this program was really, really beneficial from a technological view, because you'd have these knowledge workers go out, ask the farmers, hey, what do you want to know? Do you want to know what the weather's like? Do you want to know what the crop prices are like? And they'd be able to actually search that for them and give them the information with the hopes that that info would help bring them out of poverty. Really cool project. And the kind of project that if you do well, if you can improve that program, you may actually bring people out of poverty, aka change the world. And what was really cool about it was that because these are cell phones, you're getting all this amazing, beautiful data out of this. You know, if you look back ten years, the way you would have had to assess this program would have been to send someone out there with a clipboard to go around and survey all the knowledge workers and all the farmers and say, did you do this then? And blah, blah, blah. And how was it? It would have been terrible. And even then, you have to deal with all the biases about people not reporting correctly because they're being asked about it and they're going to say that they did better than they really did. Leaving all that aside, they have this amazing data, amazing data from the cell phones of every knowledge worker and every farmer. They talked to the lat lawn, the time and all the information that they asked for. And so with this, they actually started just doing really basic visualizations of their data, like looking at the trajectory, excuse me, looking at the distance that each knowledge worker would travel or understanding how many searches each knowledge worker was doing. And by doing this, it was, I mean, I wouldn't say any of these were sexy visualizations. They weren't pushing the forefront of design, but they gave a viewpoint into this data that immediately caused the program runners to sit down and go, oh, these people in this set of knowledge workers in this district, they're not getting out as far as some of the others. Maybe we should give them bicycles. Maybe that would increase how far they get out. Or some people, in what ended up being a very basic plot, they showed that some people were doing a huge number of searches, way more searches than anyone else was doing. And they thought, whoa, we had no idea until we literally just made a histogram. We had no idea that that was happening. And then what was funny was they dug even further. And this is sort of a side note. So I should say they looked at this histogram and they said, ooh, we want to learn more. Who are those people? What are they doing? How do we make everybody like them? And as they dug deeper, they realized, oh, wait a second, these people are actually doing an inhuman number of searches. They're doing hundreds a minute. And so the next question then became, huh, well, is that because the cell phone's broken and they think it's not sending, but it actually is, so they're hitting the button? Or are they actually just sitting at home and never talking to a single farmer and just, actually just clicking the button and trying to get boost their status? So that may seem like an unsexy answer in that the visualization itself wasn't amazingly groundbreaking on visualization front. And it wasn't this one visualization known by the world that suddenly caused everyone to stop shooting each other or everyone got fed. But it was hugely instrumental. I mean, these guys just didn't even have those skills. And when they saw that, when they went from what was a sophisticated reporting database that they had, but that was mostly used for sort of reports, and saw that visualization, that got them to, again, ask more questions and change the program. And if they keep doing what they're doing, they've been doing great work. They're going to tangibly bring people out of poverty. I think that's the kind of stuff that I see happen.",
      "id": "ep_21_ut_142"
    },
    {
      "end": 3818090,
      "speaker": "Moritz Stefaner",
      "start": 3809902,
      "text": "It comes back to Jerry's article, and there is no silver bullet, but it's a process thing. I think it's really clear.",
      "id": "ep_21_ut_143"
    },
    {
      "end": 3902090,
      "speaker": "Jake Porway",
      "start": 3821830,
      "text": "Side note to that. Sorry, I'll stop rambling in a second. But I think we're in this marvelous time where it's almost critical for all of us who are doing any kind of scientific inquiry to have visualization skills. You know, if you think of the analogy of how we used to do science in the old days, the way I kind of see it personally is that the observable world was sort of right in front of me if I wanted, you know, if I'm Galileo sitting there thinking, well, why is it that, you know, this ball rolls this speed down a ramp? Like, I sort of observe the world occurring and then try to build models around it and collect data? Then he sat down and rolled balls down ramps. But we're in this new world of intangibles. There are things that we can't just observe. I can't observe bird migration patterns across Southeast Asia just from my desk. I can't observe the subtle things, like the way that people share information online. But we now have the data that our computers are observing that that's the beautiful thing about recording all of this. And we now need the tools to see, and we need the way to now observe from those interactions, those digital interactions, what the heck is happening? So that we can explore it further. And that's why I feel like visualization can not only change the world, it must change the world. It's the skill that we all need to be able to actually see what's going on beyond just what's in front of our own faces now, that's all.",
      "id": "ep_21_ut_144"
    },
    {
      "end": 3919810,
      "speaker": "Moritz Stefaner",
      "start": 3907730,
      "text": "If it's embedded in this bigger process of inquiry and discussion and everybody becoming a bit more scientific, probably. And, yeah, just learning how to work with data and hypotheses and assumptions and so on.",
      "id": "ep_21_ut_145"
    },
    {
      "end": 3921330,
      "speaker": "Jake Porway",
      "start": 3919850,
      "text": "Yeah, that's a good point.",
      "id": "ep_21_ut_146"
    },
    {
      "end": 3929470,
      "speaker": "Moritz Stefaner",
      "start": 3921370,
      "text": "Yeah. We have a couple of Twitter questions. Shall we answer at least a few of them? Because we had, like, really ten or so?",
      "id": "ep_21_ut_147"
    },
    {
      "end": 3930914,
      "speaker": "Enrico Bertini",
      "start": 3929850,
      "text": "Yeah, we have a few.",
      "id": "ep_21_ut_148"
    },
    {
      "end": 3953310,
      "speaker": "Moritz Stefaner",
      "start": 3930962,
      "text": "So one I found really good is from Yuri Engelhard. I found it good because I asked the same thing myself all the time. And he says, is it a good idea to openly refuse to work for companies involved in unethical practices? He says, for instance, child labor. Armstrong. But of course, any company of a sufficient size is probably evil. That's at least my theory.",
      "id": "ep_21_ut_149"
    },
    {
      "end": 3956190,
      "speaker": "Jake Porway",
      "start": 3954890,
      "text": "You heard it here first.",
      "id": "ep_21_ut_150"
    },
    {
      "end": 3968320,
      "speaker": "Moritz Stefaner",
      "start": 3957250,
      "text": "That's my hypothesis I'm putting out there. So how would you deal with that? Like, Kim, probably. You also know this question from your discussions internally. How do. How do you deal with that?",
      "id": "ep_21_ut_151"
    },
    {
      "end": 3970060,
      "speaker": "Kim Rees",
      "start": 3968440,
      "text": "What was the first part of the question?",
      "id": "ep_21_ut_152"
    },
    {
      "end": 3984480,
      "speaker": "Moritz Stefaner",
      "start": 3970520,
      "text": "If it's a good idea to work with companies that you feel might be unethical in some sense, or whether you draw the line, like, is pharma already bad, or is oil bad, or what's good? What's bad? I mean.",
      "id": "ep_21_ut_153"
    },
    {
      "end": 4100082,
      "speaker": "Kim Rees",
      "start": 3984600,
      "text": "Right, right. I mean, I think that's it's all a gut check in the end. It really is. It's like, how do I feel about this personally? You know, one of our large clients. I'm not going to name names. One of our large clients, you know, historically, I've not been a huge fan of. And when, you know, when we originally were approached by them, it was a huge discussion internally whether or not we would take the project on. And it wasn't until they gave us a project that was specifically something they were putting a huge amount of money behind. So for us, it was not a huge amount of money for us, but huge amount of money for the cause. And so we felt like, okay, we're gonna set aside our issues with this company because they are dedicating a huge amount of money for this medical research that we feel is really needed in the world. And so we would like to help them tell that story and show what's going on there. So that, I mean, it's all about personal preference and how, you know, if you feel like you're. Do you feel like you're helping them do those things that you feel are bad, or are you helping them into realizing that they're doing bad things and that, you know, can you help train them to be good people? You know, to us, there are a lot of people doing bad things and it's not just oil and pharma and, you know, gun makers and whatever. There are a lot of, you know, companies and organizations that they look good on the surface, and then when you dig a little deeper, they're like, okay, well, they're not actually doing as good as they say, or they're, you know, greenwashing a lot of things. They're trying to look better than they are, you know. So it's just a personal discussion you have to have with your soul, but.",
      "id": "ep_21_ut_154"
    },
    {
      "end": 4105797,
      "speaker": "Moritz Stefaner",
      "start": 4100106,
      "text": "You have no hard rules. In a sense, you decide on every case just by what you feel is right.",
      "id": "ep_21_ut_155"
    },
    {
      "end": 4107929,
      "speaker": "Kim Rees",
      "start": 4105953,
      "text": "Exactly. It's a case by case basis.",
      "id": "ep_21_ut_156"
    },
    {
      "end": 4115769,
      "speaker": "Moritz Stefaner",
      "start": 4109349,
      "text": "Jake, what do you think? Is that a good strategy to say for some industries I don't work or for some companies?",
      "id": "ep_21_ut_157"
    },
    {
      "end": 4133649,
      "speaker": "Jake Porway",
      "start": 4116549,
      "text": "Well, the only I can say from Datakind's point of view, for us, it's really just how much money they'll pay us. So if they're willing to pay a lot, then we don't really care. Just kidding. I hope my advice speaker's on. Please edit this part in. I'm kidding.",
      "id": "ep_21_ut_158"
    },
    {
      "end": 4135899,
      "speaker": "Enrico Bertini",
      "start": 4134559,
      "text": "We've cut it. There.",
      "id": "ep_21_ut_159"
    },
    {
      "end": 4141179,
      "speaker": "Moritz Stefaner",
      "start": 4136199,
      "text": "We have another scoop. The dark side of it, the evil swinging pore.",
      "id": "ep_21_ut_160"
    },
    {
      "end": 4143699,
      "speaker": "Enrico Bertini",
      "start": 4142599,
      "text": "I told you.",
      "id": "ep_21_ut_161"
    },
    {
      "end": 4254600,
      "speaker": "Jake Porway",
      "start": 4146159,
      "text": "I was so excited when you asked Kim. Cause I was hoping that I would finally learn the answer to this question in that we only have the most obvious of hardline rules, which are no extremist groups. And I guess you could argue, as Kim was saying, I think raised the interesting question, if you could somehow be the one to turn them around, maybe that would be the difference. But again, we also go by a case by case basis for this. And to us, I'll say, maybe the only other thing I can add to what Kim said was that we try and we'll see how successful we are to find groups that we feel are going to do justice to the data that aren't hiring us just to fulfill an agenda. Whether it's even as obviously terrible as, like, child trafficking, I think it was. The first example is child trafficking. It's a pretty easy one to say no to. But even if they're going to use it to twist it into their own agenda, like, if you're again, a human rights campaign, who wants to hire us to prove something about their point, instead of saying, let's explore the data, and we want to use data as part of our process so we do our jobs better and can do better things. Anyone who says, oh, yeah, we really want to show that XY governmenthood is corrupt. That's something that we need to, that we take seriously and tend to shy away from if we can't convince them out of. But God, I really wish there were a better answer. I would be curious, actually, to ask a question back to that. Have you guys seen examples? Or, Kim, maybe in your own experience, have you felt that you've actually sort of changed someone's mind or worked with one of these big companies so big that they're sufficiently evil that you sort of turned them away or got them to do something good with your work?",
      "id": "ep_21_ut_162"
    },
    {
      "end": 4317050,
      "speaker": "Kim Rees",
      "start": 4255340,
      "text": "I sincerely doubted. I mean, those large companies are machines in and of themselves. You have to be pretty integrated into their entire process to make any sort of change. I think even, you know, full teams and departments inside those organizations have trouble making change within the company. So I doubt that that's happened with anyone, certainly hasn't happened with us. But I think back to the original question. I think for us, we always try to err on the side of being safer than sorry, you know, you never want to end up doing something for someone that you regret doing and wish you hadn't done, you know? So for us, it's just like, hey, how does everyone feel about this? We have a big discussion of like, okay, this is questionable. Should we do it or not? And more often than not, we turn things down if we're even bringing up the question.",
      "id": "ep_21_ut_163"
    },
    {
      "end": 4324610,
      "speaker": "Jake Porway",
      "start": 4317910,
      "text": "That's a great call. Enrico or Moritz, have you ever run into that situation?",
      "id": "ep_21_ut_164"
    },
    {
      "end": 4387540,
      "speaker": "Moritz Stefaner",
      "start": 4325750,
      "text": "Yeah, sort of. I mean, I once did a job for a pharma company, and afterwards I thought it wasn't a bad job at all. It was really nice and everything was okay. But afterwards I thought, okay, somehow I don't like that type of industry. And then I started to think about what types of projects I want to do or not. And then I started turning down requests from specific types of industries just without even looking at the details. So that's sort of my experience with that. But it's very hard because, yeah, as you said, all of them are gray. It's just different shades of grey. And the other part is really, you can have super nice people inside, like really big organizations that turn out to be in some, maybe a bit evil, but you might have great people trying to change things there, and then you're exactly in that difficult spot. Like, who do you support? Yeah.",
      "id": "ep_21_ut_165"
    },
    {
      "end": 4395352,
      "speaker": "Enrico Bertini",
      "start": 4388600,
      "text": "You want to move on to another question? Sure. You want to read it more?",
      "id": "ep_21_ut_166"
    },
    {
      "end": 4409832,
      "speaker": "Moritz Stefaner",
      "start": 4395536,
      "text": "I can, sure. So, Scott, Scott Morris asked aligned left on Twitter. It's a good one too. What concerns are there about representing in visualization those who did not ask for your representation.",
      "id": "ep_21_ut_167"
    },
    {
      "end": 4413180,
      "speaker": "Enrico Bertini",
      "start": 4409936,
      "text": "I like this one. Yeah, that's tricky.",
      "id": "ep_21_ut_168"
    },
    {
      "end": 4438536,
      "speaker": "Moritz Stefaner",
      "start": 4414120,
      "text": "So, Jake, you also brought up that example of the map of the gun owners. I think that was a very, I think there was a really, I mean, for me, it was a bit shocking also to see this because, I mean, apparently the addresses of these gun owners were there and. But it's exactly that step of then putting them on a map that makes it much more tangible and actually a call to action of some sorts.",
      "id": "ep_21_ut_169"
    },
    {
      "end": 4441000,
      "speaker": "Jake Porway",
      "start": 4438648,
      "text": "You know, you're right, although it's just.",
      "id": "ep_21_ut_170"
    },
    {
      "end": 4449410,
      "speaker": "Moritz Stefaner",
      "start": 4441040,
      "text": "A little technical conversion and you could say, just put it on a map. And how do you feel about these issues?",
      "id": "ep_21_ut_171"
    },
    {
      "end": 4525814,
      "speaker": "Jake Porway",
      "start": 4450550,
      "text": "I mean, I personally feel like that's a huge concern in a lot of what we do, and I think it ties in with what Kim was saying earlier about, but just in the way that there's no such thing as raw data, there's no such thing as impersonal data. I mean, I guess you could really stretch it. But I just feel, especially in the sort of work that we do, data is highly personal. And there's even, just, like you said, just putting it on a map lets people into other people's lives and viewpoints and whole things that could have very serious ramifications. I actually have a lot of, I have a lot of issues with that visualization of the gun owners homes, even though I know it's easy to create because I think you're, let's see how to put this. You are, like you said, inviting some action or some conversation that you're not then taking part in. Beyond that, you're just sort of like, it feels to me like you're inciting the masses and then not taking responsibility for anything that happens after that, for better or for worse. And so that's just sort of my thought on it. I don't know. I'd like to hear other people's thought on that or that visualization. I have other related thoughts.",
      "id": "ep_21_ut_172"
    },
    {
      "end": 4698570,
      "speaker": "Kim Rees",
      "start": 4525972,
      "text": "Yeah, that is such a tricky area for me personally. I'm all about freeing the data, and I'm a huge sort of anarchist. Part of me wants to just put everything out there so we can all just know everything. And I know who my neighbor is and I know how to. They may seem all nice when they come over and chat. Little did I know they're stockpiling weapons or something, you know? And I mean, that issue comes up a lot with, I mean, when they started doing the sex offender lists in the US, that that has been a huge concern since then. I mean, there have been a lot of issues around that with people, you know, targeting those homes and really targeting those people who, you know, may be on those lists for completely different reasons than somebody's idea of what a sex offender is. You know, so there's, I mean, that is such a tricky area. And, you know, we ran into that issue as well with the gun visualization that, you know, the 2013 data we have has names, it has towns. You know, it's, it's there. It's collected, it's published in articles online. So, you know, to me, it's more about personalizing that and it's, you know, that is a victim of violent crime. So it's, you know, they're not here to defend themselves. Right, exactly. And so it's sort of like, I felt like we were sort of taking up their cause. But there was another one of the first projects I did before I realized I was doing data visualization. Washington, some friends of mine and I started a group that would go around and we gathered data about sexual assault and rape in Portland. And we made signs for everybody who was raped. And it said the date of when they were raped and the neighborhood. And so we'd go around and post the signs in the neighborhoods. And it was really interesting to see the breadth of responses. Most of the, the responses were very positive. People who were, you know, just sort of shocked that it happened in their neighborhood, as is always the case with a violent crime. And then there were a lot of women who had been sexually assaulted or raped who just came up to us or emailed us later or whatever and were like, wow, that was really powerful for me. Thank you for putting it out into the open because those things, those crimes generally get swept under the rug, and most of them aren't prosecuted. And the ones that are, you know, very rarely are, you know, that that person is very rarely incarcerated. So it has a very low rate of success. So.",
      "id": "ep_21_ut_173"
    },
    {
      "end": 4702622,
      "speaker": "Moritz Stefaner",
      "start": 4699390,
      "text": "And did you put those people at the places where that actually happened or.",
      "id": "ep_21_ut_174"
    },
    {
      "end": 4788416,
      "speaker": "Kim Rees",
      "start": 4702686,
      "text": "Roughly not in the same neighborhoods? Yeah, in the neighborhood. So it was still, we felt like it wasn't infringing on anyone's privacy. And in fact, we didn't have that specific, we didn't have, like, addresses or anything. We sometimes had cross streets or, or things like that, but we didn't want, we put them in public spaces, so they were, like, in parks or on street medians and that sort of thing. But then there were some people who were really freaked out by and sort of offended that we were bringing that up. And so that to me was also sort of a success because if that is so frightening to someone to see that reality, then they need to see it. And to me, that is sort of a hidden crime that is underreported for various reasons. And so, yeah, none of those people chose to be represented. They didn't ask us to do that. But out of our own personal experiences, we felt like it was powerful and it was good to bring those voices out into the public. So those are just specific instances. But, I mean, there. That's a huge gray area as well, of, you know, what I think. And it's, for me, it's about putting yourself in that. In that person's shoes, the people that you are representing without their permission. You know, how do I.",
      "id": "ep_21_ut_175"
    },
    {
      "end": 4796940,
      "speaker": "Moritz Stefaner",
      "start": 4788448,
      "text": "How would I think for a minute, like, how would. How would you feel? I think that's an excellent test. Like, if I was a data point in this visualization, like, how would I feel about.",
      "id": "ep_21_ut_176"
    },
    {
      "end": 4825830,
      "speaker": "Kim Rees",
      "start": 4798870,
      "text": "Yeah, and give people the benefit of the doubt, too. Like, you can't just say, I'm against gun owners and I'm gonna plot all their things on the map, and, oh, how would I feel if I was a gun owner? Well, you know, here's my opinion of them. You have to really envision a real person who is completely innocent and fine and just likes to hunt, you know, once a year or something, you know? So I think people have to be realistic about. About that person as well.",
      "id": "ep_21_ut_177"
    },
    {
      "end": 4868990,
      "speaker": "Moritz Stefaner",
      "start": 4825950,
      "text": "But one thing I got much more sensitive is about that this anonymized data is not so anonymous anymore, once you have enough metadata and once you start to connect different data sources. So recently there was a study that if you have only four points of spacetime coordinates, like, tracked by a cell phone, you can fairly confidently identify the person among millions because it's so special, the information we have and so specific that very few points are enough to actually identify somebody, although it's anonymized in quotes. And I think this is something to be careful about when you do work with people data. And as we said, all data is people data.",
      "id": "ep_21_ut_178"
    },
    {
      "end": 4987190,
      "speaker": "Jake Porway",
      "start": 4870690,
      "text": "It's actually a really great point about the four points on the cell phone, because I think, to me, what I think gets people feeling spooky about it is that it was something that was so innocuous on its own that allowed you to identify something very. What we felt was private. It somehow transcended this kind of amorphous boundary of what we wanted to share and what we didn't. And I should say, I'm a big, open data advocate, and I actually don't think that we should be hiding from these things. But there was an article recently about a guy who got an ad on Facebook that said, you know, are you having trouble coming out of the closet? Like, do you need help coming out of the closet? And he actually did. Was actually was struggling with how he was going to come out, but he, of course, this somehow struck in him the creepy chord. And that's usually what you'll see in the articles, is, oh, data was creepy again. But he started to explore, like, why it was, you know, why it was that Facebook actually idd him as that. And of course, Facebook's doing nothing nefarious. It's just a very simple similarity match. A lot of the people that are friends with people like your friends, and who, like the things that you like, also happen to have trouble coming out of the closet. But it was the article then started to talk about why it was that. That was why he felt this moment when we sort of transcend this boundary, we've set up in our heads of what's private to us. And they related it to road rage, actually. So that when you get into a car, you subconsciously perceive. You subconsciously associate the space around your car as your personal space, as if it's your physical space. And if someone mistreats that space, if they cross that boundary, you suddenly become inexplicably angry. And at least that's how they portray. Why would you be so mad? But it's because it's yours. And so I think it's sort of interesting to. I don't really have a. I don't know if I have a point here. Just interesting thinking about. As data becomes more and more open and this innocuous data just gets out there, and there will be connects on every door, so just by my gate, you'll know where I was.",
      "id": "ep_21_ut_179"
    },
    {
      "end": 5011140,
      "speaker": "Enrico Bertini",
      "start": 4987640,
      "text": "So, do you mean. Do you mean. Do you want to say that basically, data about you is not necessarily you, so you shouldn't feel like that. Your data, it's you, right? Or it's part of you. Or it's part of you. If somebody does something with your data, it's not something. Something with you. That's what you want to say, right? Correct.",
      "id": "ep_21_ut_180"
    },
    {
      "end": 5016700,
      "speaker": "Jake Porway",
      "start": 5011560,
      "text": "Well, something like that. I think probably I should just end this as an interesting story.",
      "id": "ep_21_ut_181"
    },
    {
      "end": 5043922,
      "speaker": "Enrico Bertini",
      "start": 5018250,
      "text": "No, but honestly. Honestly, when Moritz was saying, for instance, that. What was the study saying? That four pieces of data can actually point directly to you, I think. I mean, it's not gonna be better in the future. Probably it's gonna be worse. Right. So at some point we should maybe, I don't know. That's my take on it. Maybe at some point we should just stop worrying about it because there is no way to go back to where we were in Germany.",
      "id": "ep_21_ut_182"
    },
    {
      "end": 5060338,
      "speaker": "Moritz Stefaner",
      "start": 5043946,
      "text": "There's a whole movement called post privacy. And they are all for embracing, you know, getting. I mean, they overdo it a bit just for the fun of it, but they say, like, do away with all that privacy stuff, you know, why cling to that old concept?",
      "id": "ep_21_ut_183"
    },
    {
      "end": 5064550,
      "speaker": "Enrico Bertini",
      "start": 5060394,
      "text": "Yeah. Yeah. But I can see where this comes from. I mean, it's not totally silly.",
      "id": "ep_21_ut_184"
    },
    {
      "end": 5074242,
      "speaker": "Jake Porway",
      "start": 5065050,
      "text": "You know, the first time I heard someone say that, I was aghast. I said, why would he said that you should open up all your data? Because it's going to be anyway, and there's nothing private. But it's true.",
      "id": "ep_21_ut_185"
    },
    {
      "end": 5075470,
      "speaker": "Enrico Bertini",
      "start": 5074306,
      "text": "It's actually true.",
      "id": "ep_21_ut_186"
    },
    {
      "end": 5100262,
      "speaker": "Jake Porway",
      "start": 5075790,
      "text": "Yeah. But I come around to that idea that you're right, there's no, no putting the genie back in the bottle. And maybe the new step is for us to, as data storytellers, as it were, find ways to be the voice of good in this world. To say, you know, the appropriate ways of exposing, you know, drawing conclusions about people or, or the responsible ways of using this in this new future that we find ourselves in.",
      "id": "ep_21_ut_187"
    },
    {
      "end": 5127184,
      "speaker": "Enrico Bertini",
      "start": 5100406,
      "text": "Yeah. Guys, I think we should kind of think about stopping at some point. It's really sad that we have to stop, but I fear it's gonna take. We've been talking for around 1 hour and a half so far. It's probably more than any other episode, and I fear it's gonna be too long. Maybe we should make a part, part two. I don't know. Saving the world with this. Part two. What do you think?",
      "id": "ep_21_ut_188"
    },
    {
      "end": 5134948,
      "speaker": "Moritz Stefaner",
      "start": 5127232,
      "text": "Saving the world with a vengeance this time for real?",
      "id": "ep_21_ut_189"
    },
    {
      "end": 5135920,
      "speaker": "Kim Rees",
      "start": 5135124,
      "text": "Yeah.",
      "id": "ep_21_ut_190"
    },
    {
      "end": 5140356,
      "speaker": "Enrico Bertini",
      "start": 5136780,
      "text": "And free yourself, give your data away and post privacy.",
      "id": "ep_21_ut_191"
    },
    {
      "end": 5141020,
      "speaker": "Moritz Stefaner",
      "start": 5140428,
      "text": "Exactly.",
      "id": "ep_21_ut_192"
    },
    {
      "end": 5141760,
      "speaker": "Jake Porway",
      "start": 5141100,
      "text": "Yes.",
      "id": "ep_21_ut_193"
    },
    {
      "end": 5156600,
      "speaker": "Enrico Bertini",
      "start": 5142940,
      "text": "No, really. It's really, it's hurting myself that we have to stop, but I think we really have to stop. But it was a lot of fun, and. Yeah. I would actually keep talking with you guys for another couple of hours.",
      "id": "ep_21_ut_194"
    },
    {
      "end": 5158600,
      "speaker": "Kim Rees",
      "start": 5157460,
      "text": "It's been great.",
      "id": "ep_21_ut_195"
    },
    {
      "end": 5160292,
      "speaker": "Jake Porway",
      "start": 5159020,
      "text": "Yeah. Thank you guys so much for having.",
      "id": "ep_21_ut_196"
    },
    {
      "end": 5162266,
      "speaker": "Moritz Stefaner",
      "start": 5160316,
      "text": "Me when I was here.",
      "id": "ep_21_ut_197"
    },
    {
      "end": 5163218,
      "speaker": "Jake Porway",
      "start": 5162338,
      "text": "It was fun.",
      "id": "ep_21_ut_198"
    },
    {
      "end": 5168390,
      "speaker": "Enrico Bertini",
      "start": 5163394,
      "text": "Yeah, it's been great. It's been great. No, seriously, we should do it again sometime in the future.",
      "id": "ep_21_ut_199"
    },
    {
      "end": 5169710,
      "speaker": "Kim Rees",
      "start": 5168730,
      "text": "That'd be great.",
      "id": "ep_21_ut_200"
    },
    {
      "end": 5172590,
      "speaker": "Jake Porway",
      "start": 5170050,
      "text": "Yeah. Who wants to host? They'll do it in person.",
      "id": "ep_21_ut_201"
    },
    {
      "end": 5173562,
      "speaker": "Enrico Bertini",
      "start": 5172970,
      "text": "Yeah.",
      "id": "ep_21_ut_202"
    },
    {
      "end": 5174910,
      "speaker": "Kim Rees",
      "start": 5173666,
      "text": "Oh, that'd be fun.",
      "id": "ep_21_ut_203"
    },
    {
      "end": 5176874,
      "speaker": "Moritz Stefaner",
      "start": 5175370,
      "text": "We need to come to New York. Yeah.",
      "id": "ep_21_ut_204"
    },
    {
      "end": 5186546,
      "speaker": "Enrico Bertini",
      "start": 5176922,
      "text": "Well, two of us are here, so. And I think me and Jake, we are not too far either in New York. We are. You are in Brooklyn, right?",
      "id": "ep_21_ut_205"
    },
    {
      "end": 5189050,
      "speaker": "Jake Porway",
      "start": 5186658,
      "text": "Yeah, we're like a 15 minutes walk from one another.",
      "id": "ep_21_ut_206"
    },
    {
      "end": 5189946,
      "speaker": "Enrico Bertini",
      "start": 5189130,
      "text": "Yeah. It's crazy.",
      "id": "ep_21_ut_207"
    },
    {
      "end": 5190890,
      "speaker": "Jake Porway",
      "start": 5190018,
      "text": "So sad. Yeah.",
      "id": "ep_21_ut_208"
    },
    {
      "end": 5194730,
      "speaker": "Enrico Bertini",
      "start": 5190930,
      "text": "Oh, we should have actually done it this way. You should have come in my office and.",
      "id": "ep_21_ut_209"
    },
    {
      "end": 5200550,
      "speaker": "Jake Porway",
      "start": 5195670,
      "text": "Right. All right, next time. Now that I know this stupid spike is so bad here. Yeah, definitely.",
      "id": "ep_21_ut_210"
    },
    {
      "end": 5203570,
      "speaker": "Enrico Bertini",
      "start": 5200710,
      "text": "Yeah. Okay, well, thanks a lot.",
      "id": "ep_21_ut_211"
    },
    {
      "end": 5204718,
      "speaker": "Jake Porway",
      "start": 5204150,
      "text": "Thank you.",
      "id": "ep_21_ut_212"
    },
    {
      "end": 5205318,
      "speaker": "Kim Rees",
      "start": 5204774,
      "text": "Thank you, guys.",
      "id": "ep_21_ut_213"
    },
    {
      "end": 5205518,
      "speaker": "Jake Porway",
      "start": 5205374,
      "text": "Bye.",
      "id": "ep_21_ut_214"
    },
    {
      "end": 5205798,
      "speaker": "Enrico Bertini",
      "start": 5205534,
      "text": "Bye.",
      "id": "ep_21_ut_215"
    },
    {
      "end": 5208254,
      "speaker": "Moritz Stefaner",
      "start": 5205854,
      "text": "Thanks for the excellent conversation. It was really nice.",
      "id": "ep_21_ut_216"
    },
    {
      "end": 5209422,
      "speaker": "Enrico Bertini",
      "start": 5208382,
      "text": "Okay, bye.",
      "id": "ep_21_ut_217"
    }
  ],
  "confidence": 0.936235868612182,
  "audio_duration": 5219,
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_status_code": null,
  "webhook_auth": false,
  "webhook_auth_header_name": null,
  "speed_boost": false,
  "auto_highlights_result": null,
  "auto_highlights": false,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_audio_quality": null,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "content_safety": false,
  "iab_categories": true,
  "content_safety_labels": {
    "status": "unavailable",
    "results": [],
    "summary": {}
  },
  "language_detection": false,
  "language_detection_threshold": null,
  "language_confidence": null,
  "custom_spelling": null,
  "throttled": false,
  "auto_chapters": true,
  "summarization": false,
  "summary_type": null,
  "summary_model": null,
  "custom_topics": false,
  "topics": [],
  "speech_threshold": null,
  "speech_model": "best",
  "chapters": [
    {
      "summary": "Hi, everyone. There is some sun coming from the windows, but it's chilly. It's still very chilly, which I don't like. I like it. Data stories number 21.",
      "gist": "Winter Weather Report",
      "headline": "It's still very chilly outside but there is some sun coming from windows",
      "start": 9800,
      "end": 27960,
      "id": "ep_21_ch_0"
    },
    {
      "summary": "Moritz: Can visualization save the world? And we have Kim Rees from periscopic and Jake, poor way, from Datakind. End of the episode.",
      "gist": "Can visualization save the world?",
      "headline": "Moritz: Can visualization save the world? And about the topic",
      "start": 29300,
      "end": 97580,
      "id": "ep_21_ch_1"
    },
    {
      "summary": "Can visualization save the world? I've been thinking about that a lot since you guys posed the question for this podcast. I think that data visualization has helped, you know, for centuries and in making the world a better place. But I don't think there's a silver bullet.",
      "gist": "Can Data Visualization Save the World?",
      "headline": "Can visualization save the world? You know, that's. I've been thinking about that a lot since this podcast",
      "start": 99280,
      "end": 273300,
      "id": "ep_21_ch_2"
    },
    {
      "summary": "Periscopic is a socially conscious data visualization firm based in Portland, Oregon. Our tagline is do good with data, which means that we help organizations and companies to compel people to action. Ask me anything that can be answered in about 15 seconds.",
      "gist": "Do We Do Good With Data",
      "headline": "Kim: Periscopic is a socially conscious data visualization firm",
      "start": 274260,
      "end": 355562,
      "id": "ep_21_ch_3"
    },
    {
      "summary": "Jake Porway: I work at Datakind, where we try to team up pro bono data scientists and other data geeks with social causes. He says groups like the Red Cross or the United nations have all this data that they could use to further their missions.",
      "gist": "Data-Kind",
      "headline": "Datakind helps nonprofits use data to help fulfill their missions",
      "start": 355586,
      "end": 408118,
      "id": "ep_21_ch_4"
    },
    {
      "summary": "Do you also provide, let's say, shared workspace, or do you. also run workshops occasionally? We try to bring groups of people who have the time and energy to work on a data science project together with the social organization. Throughout the process we're there.",
      "gist": "In the Elevator With the Data Scientists",
      "headline": "Are you just the broker, or do you also provide shared workspace",
      "start": 408294,
      "end": 477014,
      "id": "ep_21_ch_5"
    },
    {
      "summary": "It's very difficult in this stage to hand someone off to a data problem. We spend a lot of time sitting with social organizations who come in and say, I've got data, now. Don't panic with data, good with data. visualization shouldn't be thought from the end product, but more the process that happens in between.",
      "gist": "The Process of Data Visualization",
      "headline": "Jake: Sometimes it's difficult to hand someone off to a data problem",
      "start": 477212,
      "end": 604600,
      "id": "ep_21_ch_6"
    },
    {
      "summary": "Data visualization projects comprise a lot of different processes and stages. It's more about data and exploring this data, putting this data in the format that you need. There's a huge process leading up to it, and then there's the magic bit.",
      "gist": "How to Make a Data Visualization",
      "headline": "Jake: I think using visualization should be a process of asking questions",
      "start": 604900,
      "end": 1259134,
      "id": "ep_21_ch_7"
    },
    {
      "summary": "Every time I give a talk and show it, people are shocked. So I think it's spurred a lot of conversation in, in terms of gun control and gun violence. It's also spurred a much more data visualization discussion. And it's been really exciting and really interesting.",
      "gist": "The numbers on domestic violence",
      "headline": "The study has spurred a lot of conversation about gun control and domestic violence",
      "start": 1259222,
      "end": 1311590,
      "id": "ep_21_ch_8"
    },
    {
      "summary": "Kim: I found it really interesting that your visualization also suggests that there would be another world, you know, where these people would live, should be moved towards that world. Kim: I'm also torn if everybody should consume global world news the way they are presented at the moment. There's a real danger there.",
      "gist": "The Imagination of a Better World",
      "headline": "Kim Blum created visualization that looks at where people would have died otherwise",
      "start": 1312770,
      "end": 1748124,
      "id": "ep_21_ch_9"
    },
    {
      "summary": "Do you think this one will change gun legislation? I would love to be that idealistic. That awareness alone doesn't really move anything. How do you get people to action?",
      "gist": "Will the Park shooting change gun legislation?",
      "headline": "Do you think this one will change gun legislation",
      "start": 1748172,
      "end": 1819210,
      "id": "ep_21_ch_10"
    },
    {
      "summary": "Using data and data visualization to raise awareness to a cause is absolutely critical. The biggest thing would be stronger partnerships with people who are actually addressing these causes.",
      "gist": "More Data Visualizations Needed",
      "headline": "More and more people are using data visualization to raise awareness about a cause",
      "start": 1820150,
      "end": 1968066,
      "id": "ep_21_ch_11"
    },
    {
      "summary": "You can use visualization as an explanatory tool to communicate an idea. But behind that there might be a lot of exploratory work that is done itself with some kind of visualization tools. So I think these old set of things are very much related one to another.",
      "gist": "Exploring the data in a visualization",
      "headline": "You can use visualization as an explanatory tool or as an exploratory tool",
      "start": 1968218,
      "end": 2050954,
      "id": "ep_21_ch_12"
    },
    {
      "summary": "Kim: We see much more of these kind of visualizations on the web. Jake: I would love to see more people talking about process. Kim: Everybody can learn how to visualize data, but it's nothing you can just acquire by clicking through a few PowerPoint slides.",
      "gist": "The Process of Data Visualizations",
      "headline": "Kim: I would love to see more people talking about process",
      "start": 2051002,
      "end": 2472410,
      "id": "ep_21_ch_13"
    },
    {
      "summary": "A lot of statistics in data science is really more about rhetoric in a lot of ways than about sort of fact and truth. There's this false conflation of data with truth. People have to be rigorous about citing sources and about being clear about their methods.",
      "gist": "Data Science: The Duty to Trust Sources",
      "headline": "How do you deal with responsibility around the fact that data can be visualized",
      "start": 2473190,
      "end": 3072790,
      "id": "ep_21_ch_14"
    },
    {
      "summary": "Kim: Project Boat Smart. Project boat smart. That makes more sense. Smart boating jacket. It's very controversial.",
      "gist": "Beach Blanket",
      "headline": "Project Boat Smart is a controversial boating jacket",
      "start": 3073090,
      "end": 3087530,
      "id": "ep_21_ch_15"
    },
    {
      "summary": "Jake Tapper: I adore the New York Times interactive on the jobs report. It shows the interpretation and visualization of the data that supported the republican view. And if you move to the blue side, it showed the interpretation that supports the democrats view. I think it makes you instantly aware that there are these two extremes.",
      "gist": "The New York Times' Jobs Report Interactive",
      "headline": "The New York Times created an interactive on the jobs report before the election",
      "start": 3088790,
      "end": 3185296,
      "id": "ep_21_ch_16"
    },
    {
      "summary": "Jake: Can visualization save the world? What are the biggest success stories that you've ever seen in data visualization? Kim: One thing that we're struggling with over time is to not preach to the choir. Jake: Are you aware of any studies on impact?",
      "gist": "Can Data Visualization Save the World?",
      "headline": "So going back to our initial question, can visualization save the world",
      "start": 3185488,
      "end": 3545938,
      "id": "ep_21_ch_17"
    },
    {
      "summary": "A community knowledge worker program in Uganda used cell phones to provide information to rural farmers. The project used basic visualizations of their data. If you do well, if you can improve that program, you may bring people out of poverty, aka change the world.",
      "gist": "What's The Value of Vivid Data?",
      "headline": "A project in Uganda used visualization to help rural farmers out of poverty",
      "start": 3546034,
      "end": 3818090,
      "id": "ep_21_ch_18"
    },
    {
      "summary": "It's almost critical for all of us who are doing any kind of scientific inquiry to have visualization skills. There are things that we can't just observe. And we now need the tools to see, and we need the way to now observe from those interactions. And that's why I feel like visualization can not only change the world.",
      "gist": "The power of visualization in science",
      "headline": "I think it's almost critical for scientists to have visualization skills",
      "start": 3821830,
      "end": 3921950,
      "id": "ep_21_ch_19"
    },
    {
      "summary": "Is it a good idea to openly refuse to work for companies involved in unethical practices? Any company of a sufficient size is probably evil. In a sense, you decide on every case just by what you feel is right.",
      "gist": "No More Work For Ethical Companies",
      "headline": "We have a couple of Twitter questions about working with unethical companies",
      "start": 3922850,
      "end": 4135295,
      "id": "ep_21_ch_20"
    },
    {
      "summary": "We only have the most obvious of hardline rules, which are no extremist groups. But again, we also go by a case by case basis for this. We try and we'll see how successful we are to find groups that we feel are going to do justice to the data.",
      "gist": "The Right to Prove Your Data",
      "headline": "Kim: We only have hardline rules regarding no extremist groups",
      "start": 4135327,
      "end": 4232290,
      "id": "ep_21_ch_21"
    },
    {
      "summary": "Big companies are machines in and of themselves. You have to be pretty integrated into their entire process to make any sort of change. For us, we always try to err on the side of being safer than sorry. More often than not, we turn things down if we're even bringing up the question.",
      "gist": "Have We Stopped Working For Big Companies?",
      "headline": "Kim: We turn down many requests from large companies because they're questionable",
      "start": 4233510,
      "end": 4387540,
      "id": "ep_21_ch_22"
    },
    {
      "summary": "Scott Morris asked aligned left on Twitter. What concerns are there about representing those who did not ask for your representation. I like this one. Yeah, that's tricky.",
      "gist": "What Concerns Are There About Representation in Visualization?",
      "headline": "Scott Morris asks a question about representation in visualization on Twitter",
      "start": 4388600,
      "end": 4413180,
      "id": "ep_21_ch_23"
    },
    {
      "summary": "Jake: I feel, especially in the work that we do, data is highly personal. And there's even, like you said, just putting it on a map lets people into other people's lives. It feels to me like you're inciting the masses and then not taking responsibility for anything that happens after that.",
      "gist": "The Map of Sex Assaultors",
      "headline": "Jake: Putting addresses of gun owners on a map invites action",
      "start": 4414120,
      "end": 4825830,
      "id": "ep_21_ch_24"
    },
    {
      "summary": "Recently there was a study that if you have only four points of spacetime coordinates, like, tracked by a cell phone, you can fairly confidently identify the person. This is something to be careful about when you do work with people data. Maybe at some point we should just stop worrying about it.",
      "gist": "The Creepy Future of Data",
      "headline": "Once you have enough metadata, anonymized data becomes not so anonymous",
      "start": 4825950,
      "end": 5112460,
      "id": "ep_21_ch_25"
    },
    {
      "summary": "We've been talking for around 1 hour and a half so far. Maybe we should make a part, part two. Who wants to host? They'll do it in person. We need to come to New York.",
      "gist": "A Chat About Saving The World",
      "headline": "We've been talking for around 1 hour and a half so far",
      "start": 5113080,
      "end": 5209422,
      "id": "ep_21_ch_26"
    }
  ],
  "disfluencies": false,
  "entity_detection": false,
  "sentiment_analysis": false,
  "sentiment_analysis_results": null,
  "entities": null,
  "speakers_expected": null,
  "summary": null,
  "custom_topics_results": null,
  "is_deleted": null,
  "episode_num": "21",
  "episode_metadata": {
    "speakers": [
      "Enrico Bertini",
      "Moritz Stefaner",
      "Kim Rees",
      "Jake Porway"
    ],
    "WPid": "90",
    "url": "https://datastori.es/podlove/file/142/s/feed/c/mp3/datastories-21.mp3",
    "episode_title": "Can visualization save the world? With Kim Rees and Jake Porway"
  }
}