{
  "id": "1042452b-87d4-4b49-8fd9-7d874fe2d7ac",
  "language_model": "assemblyai_default",
  "acoustic_model": "assemblyai_default",
  "language_code": "en_us",
  "status": "completed",
  "audio_url": "https://datastori.es/podlove/file/202/s/feed/c/mp3/Datastories-06.mp3",
  "utterances": [
    {
      "end": 20286,
      "speaker": "Enrico Bertini",
      "start": 13400,
      "text": "Hi, everyone. Enrico and Moritz here, data stories. I'm Moritz. Hello, how are you?",
      "id": "ep_6_ut_0"
    },
    {
      "end": 59704,
      "speaker": "Moritz Stefaner",
      "start": 20430,
      "text": "Good. I'm in Manchester for future everything festival. Just had a little talk yesterday. Have a piece in the exhibition here too. And it's a great festival. It's music conference workshops. Great. Yeah. And it's been running for 19 years and that's quite long for like a media art type festival and. Yeah. And it's organized by Drew Hammond, who I'm collaborating with over summer, and studio NAND on a big project for the Olympic games where we try to track the sort of the emotional response to the games online. So we are also working a bit.",
      "id": "ep_6_ut_1"
    },
    {
      "end": 63104,
      "speaker": "Enrico Bertini",
      "start": 60524,
      "text": "Wow. Good, good, good.",
      "id": "ep_6_ut_2"
    },
    {
      "end": 64624,
      "speaker": "Moritz Stefaner",
      "start": 63524,
      "text": "How are you doing?",
      "id": "ep_6_ut_3"
    },
    {
      "end": 83546,
      "speaker": "Enrico Bertini",
      "start": 65484,
      "text": "Great, great. I'm trying to relax a bit. I had a couple of months. Very, very intense. And you know, my new baby is coming soon, third boy, actually. And. Yeah, I'm trying to relax a bit and focus more on family.",
      "id": "ep_6_ut_4"
    },
    {
      "end": 84494,
      "speaker": "Moritz Stefaner",
      "start": 83700,
      "text": "Yeah. Cool.",
      "id": "ep_6_ut_5"
    },
    {
      "end": 90854,
      "speaker": "Enrico Bertini",
      "start": 84534,
      "text": "And I don't have any specific deadline coming soon, so I think it's a nice, nice time for relaxing a bit.",
      "id": "ep_6_ut_6"
    },
    {
      "end": 91358,
      "speaker": "Moritz Stefaner",
      "start": 90934,
      "text": "Yeah.",
      "id": "ep_6_ut_7"
    },
    {
      "end": 94278,
      "speaker": "Enrico Bertini",
      "start": 91446,
      "text": "And the weather is getting better. How is the weather there?",
      "id": "ep_6_ut_8"
    },
    {
      "end": 96234,
      "speaker": "Moritz Stefaner",
      "start": 94446,
      "text": "Yeah, it's very British.",
      "id": "ep_6_ut_9"
    },
    {
      "end": 97646,
      "speaker": "Enrico Bertini",
      "start": 96854,
      "text": "Very British.",
      "id": "ep_6_ut_10"
    },
    {
      "end": 98714,
      "speaker": "Moritz Stefaner",
      "start": 97710,
      "text": "Very British.",
      "id": "ep_6_ut_11"
    },
    {
      "end": 105514,
      "speaker": "Enrico Bertini",
      "start": 100534,
      "text": "So, yeah, we are once again alone, me and you, after a long time.",
      "id": "ep_6_ut_12"
    },
    {
      "end": 106694,
      "speaker": "Moritz Stefaner",
      "start": 106054,
      "text": "Yeah.",
      "id": "ep_6_ut_13"
    },
    {
      "end": 109594,
      "speaker": "Enrico Bertini",
      "start": 106814,
      "text": "With Andy feeling nostalgic.",
      "id": "ep_6_ut_14"
    },
    {
      "end": 114988,
      "speaker": "Moritz Stefaner",
      "start": 110774,
      "text": "Yeah, no, but it was great with Andy too. We should have him five times again. He's a great guy.",
      "id": "ep_6_ut_15"
    },
    {
      "end": 118252,
      "speaker": "Enrico Bertini",
      "start": 115036,
      "text": "Yeah. And we have more people coming soon.",
      "id": "ep_6_ut_16"
    },
    {
      "end": 123468,
      "speaker": "Moritz Stefaner",
      "start": 118428,
      "text": "Yes, absolutely. Yeah. Maybe even for next episode. We don't know yet. Exactly.",
      "id": "ep_6_ut_17"
    },
    {
      "end": 130612,
      "speaker": "Enrico Bertini",
      "start": 123596,
      "text": "Yeah. We shouldn't overpromise. I think last time we promised to have this episode on color.",
      "id": "ep_6_ut_18"
    },
    {
      "end": 133012,
      "speaker": "Moritz Stefaner",
      "start": 130668,
      "text": "On color, yeah, we won't have color today.",
      "id": "ep_6_ut_19"
    },
    {
      "end": 140224,
      "speaker": "Enrico Bertini",
      "start": 133068,
      "text": "I'm sorry, guys. We're going to talk about something really special. We are going to talk about food.",
      "id": "ep_6_ut_20"
    },
    {
      "end": 143634,
      "speaker": "Moritz Stefaner",
      "start": 140574,
      "text": "Yeah. Which is much better than color anyways.",
      "id": "ep_6_ut_21"
    },
    {
      "end": 159430,
      "speaker": "Enrico Bertini",
      "start": 143974,
      "text": "Yeah, sure. So you might wonder what is how food and visualization are related, but it looks like they are very related. And Moritz recently started a project on that. Right? No. You actually concluded a project on that?",
      "id": "ep_6_ut_22"
    },
    {
      "end": 239514,
      "speaker": "Moritz Stefaner",
      "start": 159582,
      "text": "Yeah. It's supposed to be done, Enrico. Yeah, it was a small commission from a German startup. They're called my muesli. And what they do is they offer, you can customize your muesli so you have an ingredient picker on their side. And you say, I want oat and almonds and raspberries and chocolate or something like this. And then they will mix that muesli and send it to you. And now they had their fifth year anniversary and so they said it would be interesting just to work a bit with the. The data of what was ordered. And initially we also thought about, like, who ordered it. Like, where did people come from? You know, where people who ordered papaya, you know, do they have an interesting distribution in Germany or not? Or how about cities versus the countryside and so on? Yeah, but, yeah, that went a bit too far. But what I looked at is, and that's fairly interesting also, is which ingredients were ordered together a lot, you know, so you have like 50, 60 ingredients or so. And of course, it's very interesting of what, you know, to find out what people combine and what they don't tend to combine. And so I made a few network visualizations around that.",
      "id": "ep_6_ut_23"
    },
    {
      "end": 252854,
      "speaker": "Enrico Bertini",
      "start": 240054,
      "text": "Yeah, I think what is really interesting about food visualization is that it's one of those cases where you have data where that relate, people can really very easily relate to, right?",
      "id": "ep_6_ut_24"
    },
    {
      "end": 254214,
      "speaker": "Moritz Stefaner",
      "start": 252894,
      "text": "Oh, absolutely, yeah. Yeah.",
      "id": "ep_6_ut_25"
    },
    {
      "end": 255278,
      "speaker": "Enrico Bertini",
      "start": 254294,
      "text": "And that's fantastic.",
      "id": "ep_6_ut_26"
    },
    {
      "end": 389328,
      "speaker": "Moritz Stefaner",
      "start": 255326,
      "text": "And you also had little icons, you know, for all the ingredients. So there was a little raspberry and a little strawberry and so on. And that helps a lot in just people getting a sense to immediately think about the data, you know, does it make sense? Would I have combined that the same way? You know, and so everybody has a good intuition of. Yeah, if the data makes sense or the data presentation makes sense because they have a strong grip on the. On the underlying. Yeah. Or their own opinion of what belongs together or not. Yeah, yeah. And it was a quite interesting project. So first I thought it's fairly straightforward and the insights won't be that great. You know, that was my expectation. But in fact, there were many little combinations I didn't really foresee. And so there was, in fact, a lot to learn about the data set. And it was also interesting because I produced a few different views. So the final solution was a radial view with curved lines, bend lines, and it's grouped by the sort of ingredient type. So nuts, fruits, cereals, and so on. And inside each group, I put the most popular into the center. So you have a fairly good categorization of the notes. So that's really helpful. And then I'm also drawing the lines depending on the two colors of the. So each group also has a color sort of assigned, and the lines are drawn with a gradient connecting these two colors, more or less. And the interesting thing is, this was the most popular with the client, and I think it's also the strongest one for the purpose they had in mind, because they wanted to have it in their catalog and maybe print a poster or something like this. And it's one that is immediately readable. And many people can relate to it. And the circles, you can bash them a lot, you know, and I'm a bit tired of them. But they are really also very space effective, you have to say that. So there was no other visualization where you could like, arrange these. I don't know how many were like 50, 60 different labels and they were all readable, you know?",
      "id": "ep_6_ut_27"
    },
    {
      "end": 390648,
      "speaker": "Enrico Bertini",
      "start": 389496,
      "text": "Yeah, yeah, sure, sure.",
      "id": "ep_6_ut_28"
    },
    {
      "end": 431300,
      "speaker": "Moritz Stefaner",
      "start": 390696,
      "text": "And that's, that can be a big factor. If you're really interested in the actual, like, labels, you know, and not just in the structure of the network, but the actual, let's say, content, then the radial visualization often has like a big, big advantage. Yeah, it's very space efficient. So anyways, what was interesting here is that it, although it works really well, I think some really strong links are totally neglected in this view because they're between neighbor neighboring nodes. And that's a huge, you know, the big problem is also if you put like lines on a map, you know, for trade or something like this, the long lines always attract the attention.",
      "id": "ep_6_ut_29"
    },
    {
      "end": 432172,
      "speaker": "Enrico Bertini",
      "start": 431492,
      "text": "Yeah, sure.",
      "id": "ep_6_ut_30"
    },
    {
      "end": 529466,
      "speaker": "Moritz Stefaner",
      "start": 432228,
      "text": "You know, because they just have more pixels available, you know, or they're more disruptive visually. Yeah, sure. And. But they might not be the most important connections at all. They're just the longest lines. And, you know, it can happen that a very unimportant line, it's just long because the two nodes are positioned that way. And so the strongest link in the network was exactly between raspberry and strawberries. And these were the most, two most popular fruit. And so they were next to each other and they have this very little line connecting them. When I saw that, I did a few other views, and the most successful one from the readability point of view, was to make a matrix, actually, like have your ingredients in rows and columns and then have a circle for each connection strength, sort of. And. Yeah, but that didn't look as tasty to the client and to me as well, I have to admit. It looks a bit more rotten. And of course, you cannot really. And at that point, I realized I should not have just worked with how often something is combined, but work much more on that probability level. So I did one variation of that matrix where I would highlight the connections that are, let's say, unexpectedly high given the individual popularities of the ingredients. And then I thought this is the direction I should have gone. Like, how strong, how does the appearance of one ingredient influence the probabilities that other ingredients appear? You know, like this? Conditional probabilities.",
      "id": "ep_6_ut_31"
    },
    {
      "end": 530254,
      "speaker": "Enrico Bertini",
      "start": 529570,
      "text": "Yeah.",
      "id": "ep_6_ut_32"
    },
    {
      "end": 544870,
      "speaker": "Moritz Stefaner",
      "start": 530634,
      "text": "And the problem is it's statistically, it's a bit advanced. So you always need a few sentences to explain that, you know, how it came about. And it's much easier to say, okay, a thick line means a lot of this has been combined a lot of times. Right?",
      "id": "ep_6_ut_33"
    },
    {
      "end": 545230,
      "speaker": "Enrico Bertini",
      "start": 544982,
      "text": "Yeah.",
      "id": "ep_6_ut_34"
    },
    {
      "end": 573064,
      "speaker": "Moritz Stefaner",
      "start": 545262,
      "text": "So that's easier to say. But I think from what you're interested in, this would have been the type of information you're interested in. So you're right in a way. I'm only halfway through with the project, but then the catalog had to be printed, and so what can you do? But I think it's still a successful piece. I mean, but, you know, in hindsight, or this could be for the second edition, this could be a way to investigate.",
      "id": "ep_6_ut_35"
    },
    {
      "end": 603306,
      "speaker": "Enrico Bertini",
      "start": 573484,
      "text": "Yeah. Before we proceed, I want to remind our listeners that, of course, whenever we discuss some visualizations in details, we try to put some links on the post. I'm sorry, if you are listening this on the, on a podcast, directly on your iPhone or whatever, any other device, and you don't have any images in front of you. Sorry. Maybe it's not that easy to understand, but we always try to describe everything enough in detail, so.",
      "id": "ep_6_ut_36"
    },
    {
      "end": 605858,
      "speaker": "Moritz Stefaner",
      "start": 603330,
      "text": "Yeah, but it looks.",
      "id": "ep_6_ut_37"
    },
    {
      "end": 628232,
      "speaker": "Enrico Bertini",
      "start": 605906,
      "text": "But the best way to consume it is to see the images first from the blog post. Yeah. What else, I think, discussing with you, I think that you. Is it possible that you've been influenced a little bit from Barabbasi's work while doing this muslim network? Can you briefly describe what's the work of Barabbasi? Maybe lots of people don't know it.",
      "id": "ep_6_ut_38"
    },
    {
      "end": 648888,
      "speaker": "Moritz Stefaner",
      "start": 628288,
      "text": "Yeah, I read the paper before. Indeed. Yeah. But that was half a year before. But I had it in the back of my mind and, yeah, it's a fantastic paper. So it's also about food ingredient analysis. So we should say Barabbasi is a really well known network researcher. Probably. He's the network guy, I would say.",
      "id": "ep_6_ut_39"
    },
    {
      "end": 649376,
      "speaker": "Enrico Bertini",
      "start": 649016,
      "text": "Yeah.",
      "id": "ep_6_ut_40"
    },
    {
      "end": 755562,
      "speaker": "Moritz Stefaner",
      "start": 649440,
      "text": "Yeah. So he wrote linked, which is a fantastic introduction to the whole world of networks and especially about scale free networks, which he sort of, I think, discovered. And so his lab, they did a study on basically on two things. So at the one hand, they looked at how different ingredients appear together in recipes. So that's a smart move. You know, you can parse a recipe for ingredient names. So they took basically a couple of cookbooks and look, you know, which ingredients were combined and then they were doing that across cultures. So they could see if, let's say, in African cuisine or in Asian cuisine, there are different flavor combinations. I mean, obviously. But which ones they are. Exactly. And then they also look there is in cooking. There is a sort of this food pairing hypothesis that ingredients that share chemical compounds, or that there are certain compounds that if an ingredient. If two ingredients share them. I'm sorry, have to be precise here, that they then go well together. So that there's a chemical, you know, simple chemical rule for if two ingredients go together well or not. So there's a whole theory behind food pairing. It's called pairing ingredients. And they wanted to investigate how well this chemical hypothesis more or less matches the empirical data from recipes. And it's a fantastic study. And what they found out is that the western cuisine seems to use that food pairing principle based on the chemistry. But, for instance, east Asian cuisine tends to avoid even.",
      "id": "ep_6_ut_41"
    },
    {
      "end": 757162,
      "speaker": "Enrico Bertini",
      "start": 755658,
      "text": "It's exactly the opposite. Yeah.",
      "id": "ep_6_ut_42"
    },
    {
      "end": 797454,
      "speaker": "Moritz Stefaner",
      "start": 757218,
      "text": "Yeah. So they have a totally different understanding of what goes well together on a plate. More or less, yeah. And they did a few really interesting graphics, and it's just very strong statistical analysis, too. So you're right. When I read the paper, I was like, oh, yeah, that's. I reread it, and that was when I. Yeah, that's. That's how you usually. You should have done it. But this is also a whole lab, and they're, like, superhuman. And I'm just a data visualization guy. Yeah. That's a fantastic paper. So it's totally worth, like, digging into it, although it's a bit technical.",
      "id": "ep_6_ut_43"
    },
    {
      "end": 850564,
      "speaker": "Enrico Bertini",
      "start": 798314,
      "text": "Yeah. And they have very nice graphics and especially this network with many different compound, many different ingredients, which are related according to the compounds they share. And one thing that I also read the paper, I think, yesterday or two days ago, and I was surprised by the fact that they didn't really discuss these images in detail. I mean, this graph is very complex. There are lots of. I don't know how many compounds are there, how many products are there, but I think it looks quite dense. But at the same time, you have the feeling that you could get a lot of information out of it. I see many big trends and at the same time, many big outliers at the same time. Right. But they don't go too deep into discussing. I thought that the discussion was a bit weak in this sense. I was surprised. What do you think?",
      "id": "ep_6_ut_44"
    },
    {
      "end": 861944,
      "speaker": "Moritz Stefaner",
      "start": 851424,
      "text": "Yeah, yeah, there's something to it. So they were just looking for this hypothesis. But I also get a sense the data they collected is worth much more, you know?",
      "id": "ep_6_ut_45"
    },
    {
      "end": 900974,
      "speaker": "Enrico Bertini",
      "start": 861984,
      "text": "Yeah. Do you know anything about what technique they used to create this graph? Because it looks like. Because there are sorts of islands in the graphs that are colored according to the category of food, like fruit, meats, herbs, vegetables and so on. And they seem to match pretty well. Right, so you have a graph where the position of the nodes, when two nodes, when a group of nodes is close together, they are mostly colored with the same category. Not all the time, but very often. Right. Yeah, I think there is a lot to explore there.",
      "id": "ep_6_ut_46"
    },
    {
      "end": 917264,
      "speaker": "Moritz Stefaner",
      "start": 901014,
      "text": "The clustering corresponds quite well to these categories. Yeah. At first I thought it was gaffy, but then now I see, I look at it again and the lines are drawn very. Some of them are curved, some are not. And so I almost believe it's a custom solution somehow.",
      "id": "ep_6_ut_47"
    },
    {
      "end": 928820,
      "speaker": "Enrico Bertini",
      "start": 918004,
      "text": "Yeah, yeah. I think they also use some kind of bundling or. I don't know, I see some. They don't have straight edges, only sometimes they have straight edges. It would be nice to understand.",
      "id": "ep_6_ut_48"
    },
    {
      "end": 929704,
      "speaker": "Moritz Stefaner",
      "start": 928972,
      "text": "Yeah.",
      "id": "ep_6_ut_49"
    },
    {
      "end": 952324,
      "speaker": "Enrico Bertini",
      "start": 930204,
      "text": "The paper doesn't provide any details about how they do it, how they did it. So I would be curious to know more. Yeah. Anyway, these are physicists doing visualization, which is nice. You couldn't bear it.",
      "id": "ep_6_ut_50"
    },
    {
      "end": 992674,
      "speaker": "Moritz Stefaner",
      "start": 955504,
      "text": "Maybe I'm allergic to network graphs. Yeah, no, no, but I think it's great work. I mean visually you could improve on all these graphs, but it's. Yeah, the charts and the graphics, they provide a lot of information now. Yeah, probably it would be best to hear a talk about it, you know, a 1 hour talk by Barbasi. Maybe that would be the best way to consume it. I also, I'm not sure if papers are really the best way to transport this type of information, you know. Yeah, yeah, but I mean that's a whole different story. But I mean. Yeah, probably a presentation, you know?",
      "id": "ep_6_ut_51"
    },
    {
      "end": 994314,
      "speaker": "Enrico Bertini",
      "start": 992794,
      "text": "Yeah, I agree, I agree.",
      "id": "ep_6_ut_52"
    },
    {
      "end": 1002014,
      "speaker": "Moritz Stefaner",
      "start": 994474,
      "text": "Or something interactive or you know, something. I don't know, it's. I think the paper is a concept that should go away.",
      "id": "ep_6_ut_53"
    },
    {
      "end": 1006186,
      "speaker": "Enrico Bertini",
      "start": 1002874,
      "text": "Yeah. And the paper is pretty short actually.",
      "id": "ep_6_ut_54"
    },
    {
      "end": 1007858,
      "speaker": "Moritz Stefaner",
      "start": 1006290,
      "text": "Yeah, yeah, yeah.",
      "id": "ep_6_ut_55"
    },
    {
      "end": 1024800,
      "speaker": "Enrico Bertini",
      "start": 1007906,
      "text": "There are not too many details but I wanted to ask you, I read in the paper, by reading the paper it looks like this data is available somewhere. Do you know anything about that? Because actually having people accessing this data and trying to come up with, with other visualizations would be fantastic. Do you have any information about that?",
      "id": "ep_6_ut_56"
    },
    {
      "end": 1030324,
      "speaker": "Moritz Stefaner",
      "start": 1024832,
      "text": "No, no, I have not tried. I overread that part. So we should drop them an email.",
      "id": "ep_6_ut_57"
    },
    {
      "end": 1034752,
      "speaker": "Enrico Bertini",
      "start": 1031264,
      "text": "Absolutely, absolutely. It would be really nice.",
      "id": "ep_6_ut_58"
    },
    {
      "end": 1050934,
      "speaker": "Moritz Stefaner",
      "start": 1034848,
      "text": "And it could be just a nice, also like a benchmark network visualization data set because again, everybody can relate to it and you can quickly inspect if the data seems to make sense or if the presentation seems to make sense and. Cool.",
      "id": "ep_6_ut_59"
    },
    {
      "end": 1061214,
      "speaker": "Enrico Bertini",
      "start": 1051014,
      "text": "I mean this whole idea of having a very large network where you have ingredients and at the same time chemical compounds. I think there is so much to explore there.",
      "id": "ep_6_ut_60"
    },
    {
      "end": 1065966,
      "speaker": "Moritz Stefaner",
      "start": 1061374,
      "text": "Yeah. And there's a whole science of cooking now, you know, and so, and they.",
      "id": "ep_6_ut_61"
    },
    {
      "end": 1079184,
      "speaker": "Enrico Bertini",
      "start": 1065990,
      "text": "Also have, I think as far as I understand, they also have a list of recipes. So you have these three elements. You have basically the whole hierarchy. You have recipes, ingredients and compounds, which I think is fantastic.",
      "id": "ep_6_ut_62"
    },
    {
      "end": 1095624,
      "speaker": "Moritz Stefaner",
      "start": 1079964,
      "text": "Yeah. The angle is very good also to look at this, like, how is it used versus what's the theory, prediction sort of coming from the compounds and so on. Yeah, it's quite nice. Yeah. Do we have any other good food visualization projects you're aware of?",
      "id": "ep_6_ut_63"
    },
    {
      "end": 1102022,
      "speaker": "Enrico Bertini",
      "start": 1098044,
      "text": "I think we saw together there was a website for food pairing, right?",
      "id": "ep_6_ut_64"
    },
    {
      "end": 1104066,
      "speaker": "Moritz Stefaner",
      "start": 1102148,
      "text": "Yeah, exactly.",
      "id": "ep_6_ut_65"
    },
    {
      "end": 1104974,
      "speaker": "Enrico Bertini",
      "start": 1104210,
      "text": "I think.",
      "id": "ep_6_ut_66"
    },
    {
      "end": 1111414,
      "speaker": "Moritz Stefaner",
      "start": 1106874,
      "text": "Nice public graph, which looks a bit like my relation browser.",
      "id": "ep_6_ut_67"
    },
    {
      "end": 1117682,
      "speaker": "Enrico Bertini",
      "start": 1112114,
      "text": "Yeah. How is it called? I think it's foodpairing.com or so something like that.",
      "id": "ep_6_ut_68"
    },
    {
      "end": 1121574,
      "speaker": "Moritz Stefaner",
      "start": 1117698,
      "text": "I think so, yeah. We will link it from the show notes.",
      "id": "ep_6_ut_69"
    },
    {
      "end": 1142482,
      "speaker": "Enrico Bertini",
      "start": 1122074,
      "text": "Yeah. But I think food visualization is not only limited to exploring the connection between nutrients, flavors, recipes and so on, but there are many other aspects. Like, for instance, there are lots of people logging their life, and of course, they are also logging what they eat, notably the work of Nicholas Feltron.",
      "id": "ep_6_ut_70"
    },
    {
      "end": 1143682,
      "speaker": "Moritz Stefaner",
      "start": 1142618,
      "text": "Yeah, sure.",
      "id": "ep_6_ut_71"
    },
    {
      "end": 1147334,
      "speaker": "Enrico Bertini",
      "start": 1143818,
      "text": "But I think this is also another trend in food visualization, right?",
      "id": "ep_6_ut_72"
    },
    {
      "end": 1181906,
      "speaker": "Moritz Stefaner",
      "start": 1147674,
      "text": "Oh, absolutely, yeah. And again, it's so interesting, like what you can learn, like on this very personal and small data level on, you know, and so if you visualize and collect these numbers. Yeah. So there was a nice project was called visualizing food 40 ways where a student pred something. No, Lauren Manning. And he collected some data on what he consumed, I think, over.",
      "id": "ep_6_ut_73"
    },
    {
      "end": 1183554,
      "speaker": "Enrico Bertini",
      "start": 1181970,
      "text": "I think it's a she.",
      "id": "ep_6_ut_74"
    },
    {
      "end": 1184354,
      "speaker": "Moritz Stefaner",
      "start": 1183714,
      "text": "Oh, is it?",
      "id": "ep_6_ut_75"
    },
    {
      "end": 1185964,
      "speaker": "Enrico Bertini",
      "start": 1184394,
      "text": "Yeah, I think so.",
      "id": "ep_6_ut_76"
    },
    {
      "end": 1226970,
      "speaker": "Moritz Stefaner",
      "start": 1186114,
      "text": "Yeah. Okay, we'll see. That person. Exactly. Visualized this food in 40 different. This food data in 40 different ways. And they're quite entertaining. And I used to use that data set also for teaching visualization because it shows like, how many ways you have of displaying the same type of data. And some of them are like, hardly readable, some are straightforward. Some use photography. Like, there's a really funny one with. How do you say. Yeah, french fries, you know, used as bar charts.",
      "id": "ep_6_ut_77"
    },
    {
      "end": 1230930,
      "speaker": "Enrico Bertini",
      "start": 1227042,
      "text": "Yeah, yeah, I saw it. A bar chart made out of french fries.",
      "id": "ep_6_ut_78"
    },
    {
      "end": 1238886,
      "speaker": "Moritz Stefaner",
      "start": 1231002,
      "text": "Exactly. Yeah. Yeah. So that's definitely a nice one.",
      "id": "ep_6_ut_79"
    },
    {
      "end": 1242406,
      "speaker": "Enrico Bertini",
      "start": 1239050,
      "text": "I would like to have a comment from Stephen Few about the bar chart.",
      "id": "ep_6_ut_80"
    },
    {
      "end": 1257198,
      "speaker": "Moritz Stefaner",
      "start": 1242470,
      "text": "Yeah, the french fry. Bar chart with french fries. It's a good question. Like, is that still the best way of displaying for. Even if it's a bit greasy. Yeah. It's a bar chart, but then it gets a french fry. Yeah. Yeah, it's tough.",
      "id": "ep_6_ut_81"
    },
    {
      "end": 1258034,
      "speaker": "Enrico Bertini",
      "start": 1257246,
      "text": "Why not?",
      "id": "ep_6_ut_82"
    },
    {
      "end": 1266194,
      "speaker": "Moritz Stefaner",
      "start": 1260374,
      "text": "And we had a nice post or a nice project also by. From our friends. From interactive things.",
      "id": "ep_6_ut_83"
    },
    {
      "end": 1267742,
      "speaker": "Enrico Bertini",
      "start": 1267294,
      "text": "Yeah.",
      "id": "ep_6_ut_84"
    },
    {
      "end": 1269782,
      "speaker": "Moritz Stefaner",
      "start": 1267798,
      "text": "And I think they were friends.",
      "id": "ep_6_ut_85"
    },
    {
      "end": 1270150,
      "speaker": "Enrico Bertini",
      "start": 1269878,
      "text": "Yeah.",
      "id": "ep_6_ut_86"
    },
    {
      "end": 1286354,
      "speaker": "Moritz Stefaner",
      "start": 1270182,
      "text": "How America spends food and drink spending, you know, by city. And they compared if people eat out a lot or if they buy at groceries and then cook at home, which is a nice angle, too.",
      "id": "ep_6_ut_87"
    },
    {
      "end": 1288454,
      "speaker": "Enrico Bertini",
      "start": 1287094,
      "text": "Yeah, sure, sure.",
      "id": "ep_6_ut_88"
    },
    {
      "end": 1292714,
      "speaker": "Moritz Stefaner",
      "start": 1288534,
      "text": "It's more. Yeah. More about food buying behavior in the end.",
      "id": "ep_6_ut_89"
    },
    {
      "end": 1322706,
      "speaker": "Enrico Bertini",
      "start": 1293254,
      "text": "Sure. Well, I think there is so much debate around food and health and nutrition in general that I'm surprised that we didn't see anything more. I'm surprised that we didn't see more visualizations about that. It's such an odd topic and there are so many data sets around there. I'm really surprised. I don't know what's the reason about that.",
      "id": "ep_6_ut_90"
    },
    {
      "end": 1354986,
      "speaker": "Moritz Stefaner",
      "start": 1322810,
      "text": "Yeah. I mean, maybe it just hasn't been picked up that well. But I think, as I said, there's a whole, like, cooking science movement. You know, there's, for instance, this book, modernist cuisine. I mean, it's a high end book. It costs like €400 or so, but they really look at exactly the science of cooking and they measure exactly of what happens at what temperature, if you have a duck in a pan or whatever. And I think we will see much more data analysis and data visualization also coming directly from the, from the top chefs and so on. So that should be interesting.",
      "id": "ep_6_ut_91"
    },
    {
      "end": 1368978,
      "speaker": "Enrico Bertini",
      "start": 1355050,
      "text": "Yeah, I think it's nice because you have these two angles. From the one end, you have these flavors and recipes angle to look at. And on the other hand, you have this nutrition and health that you can take care of.",
      "id": "ep_6_ut_92"
    },
    {
      "end": 1442754,
      "speaker": "Moritz Stefaner",
      "start": 1369066,
      "text": "Exactly. But the one thing you're forgetting is you can also use food to represent something. And this is what I'm really interested in. And together with Susanne Jaschko, she's a curator from Berlin, we're trying to place this data cooking workshop at conferences, but we don't succeed at the moment. But the idea is that you use food really as an expressive medium. And if you think about it, it's great because you have. So you can paint with food, so you have all the 2d things, you know, you can make sculptures, so you have all the 3d information, and then on top of that, you have flavor. You have, like, cooking times. You have, you have the whole semiotic aspects of food. You know, what a potato means in Ireland, you know, or, you know, all that is associated with food like caviar and lobster. And I don't know. Every food ingredient has a meaning in, in a way, and they are so cool. If you think about it, it would be the most expressive medium for data visualization overall. No, really, I'm serious. I challenge anyone to come up with a more expressive medium for data visualization.",
      "id": "ep_6_ut_93"
    },
    {
      "end": 1454646,
      "speaker": "Enrico Bertini",
      "start": 1444574,
      "text": "You could try to set up a show on YouTube. Oh yeah, recurring episodes. A new project about the idea was.",
      "id": "ep_6_ut_94"
    },
    {
      "end": 1467822,
      "speaker": "Moritz Stefaner",
      "start": 1454670,
      "text": "To have a two day workshop, like with a really good cook or, you know, a chef and the two of us, and maybe ten participants, and then take ideally a local dataset and cook it with local food, of course. And.",
      "id": "ep_6_ut_95"
    },
    {
      "end": 1487946,
      "speaker": "Enrico Bertini",
      "start": 1467958,
      "text": "Yeah, but I think anyway, this is a great topic for any novice who wants to start doing visualization. And we always get this question, where do we start from? Where do we find data? I think that's a clear example, fantastic example of an area where you can find a lot of data, not many.",
      "id": "ep_6_ut_96"
    },
    {
      "end": 1490146,
      "speaker": "Moritz Stefaner",
      "start": 1487970,
      "text": "People, small data, big data, whatever you want.",
      "id": "ep_6_ut_97"
    },
    {
      "end": 1628898,
      "speaker": "Enrico Bertini",
      "start": 1490250,
      "text": "Too much effort on visualizing foods or nutrients or flavors. I think that's a great direction. And personally I've always tried to, I've been chasing for, I think, one year or one year and a half. This data set that comes from the USDA national nutrient data, which is really, really, really nice. This is a database that comes from the USDA, which is the main agency in the US about dealing with food and health related to food. And you can find this dataset freely online. It's huge. I think it's, I don't remember how many entries, but it's really, really, really large and really high dimensional. I don't remember how many dimensions you have there, but it's really, really large. So let me see if I can find it in a moment. I have the link here. Yeah, I mean there is a nice query tool on the web, but you can also download directly the old data set. And then for every food you have something like the amount of water, energy, protein, lipid, carbohydrate and so on, high level measurements, and then you have very specific measurements like minerals, and for every mineral, the amount of mineral that you find there, and for every vitamin the same, you have something like ten or 15 vitamins or lipids and so on. It's really, really rich. And yeah, a few times during my research activity, I tried to use this data set for our own purposes and it's really fascinating what you can find there. Unfortunately, I never had time to come up with a visualization whose purpose was exactly to show the content of this database, but I think that's a very nice challenge. Because it's very large and very rich. And I think there is a lot to discover there because this database contains everything from raw foods, like, I don't know, apples or grapes or celery, up to what you find in McDonald.",
      "id": "ep_6_ut_98"
    },
    {
      "end": 1631386,
      "speaker": "Moritz Stefaner",
      "start": 1629026,
      "text": "Okay. Like fully processed and so on.",
      "id": "ep_6_ut_99"
    },
    {
      "end": 1655374,
      "speaker": "Enrico Bertini",
      "start": 1631570,
      "text": "Every kind of processed food in the US. So I think it would be really, really nice to explore this dataset and see because I'm sure that you can see it from many different angles. And of course, I don't think there is one visualization that can tell a whole story. You need a whole bunch of stories here, but I think it's a really, really nice example.",
      "id": "ep_6_ut_100"
    },
    {
      "end": 1663146,
      "speaker": "Moritz Stefaner",
      "start": 1657834,
      "text": "Yeah, I'll give it a. Definitely give it a look. Sounds good. Yeah, yeah.",
      "id": "ep_6_ut_101"
    },
    {
      "end": 1668562,
      "speaker": "Enrico Bertini",
      "start": 1663210,
      "text": "And it's multidimensional, which is normally pretty hard to handle.",
      "id": "ep_6_ut_102"
    },
    {
      "end": 1681214,
      "speaker": "Moritz Stefaner",
      "start": 1668658,
      "text": "Yeah. But that's one of your hobbies anyways, right? Yeah, it is interesting. It's interesting. You know what we forgot? The listener feedback.",
      "id": "ep_6_ut_103"
    },
    {
      "end": 1689236,
      "speaker": "Enrico Bertini",
      "start": 1682644,
      "text": "Yeah. Oh, sure, sure. Let me just say one last thing and then we can move on to the listeners feedback.",
      "id": "ep_6_ut_104"
    },
    {
      "end": 1689904,
      "speaker": "Moritz Stefaner",
      "start": 1689300,
      "text": "Yeah.",
      "id": "ep_6_ut_105"
    },
    {
      "end": 1754440,
      "speaker": "Enrico Bertini",
      "start": 1691804,
      "text": "Related to that, if you are interested in nutrition data and detailed measurements about food, there is another website that I really like that is called self nutrition data. And one thing I like there is that they have. So you will have to search a little bit into the website. It's not easy to access, but they have a number of tools where they use some sorts of icons which depict the space of how to say that it's really hard. So they have icons that are used as query tools to find specific foods in the database, because, again, they have a very large database and they have things like, I think it's called the caloric pyramid or something like that, where you have at every angle of the pyramid, they have, I think they have carbohydrates, proteins and lipids.",
      "id": "ep_6_ut_106"
    },
    {
      "end": 1755444,
      "speaker": "Moritz Stefaner",
      "start": 1754592,
      "text": "Oh, yes.",
      "id": "ep_6_ut_107"
    },
    {
      "end": 1764296,
      "speaker": "Enrico Bertini",
      "start": 1756304,
      "text": "So for every point in the, in the triangle, you have a specific percentage of these three components.",
      "id": "ep_6_ut_108"
    },
    {
      "end": 1765078,
      "speaker": "Moritz Stefaner",
      "start": 1764360,
      "text": "Exactly.",
      "id": "ep_6_ut_109"
    },
    {
      "end": 1808800,
      "speaker": "Enrico Bertini",
      "start": 1765216,
      "text": "And it's really, really nice. And by selecting one area in the triangle, you can focus on one specific set of foods. And they have something more complicated, like, I don't know, they have two axes. Another graphics where you have two axes where one axis is the nutrition level and the other axis is. How is it called? How fulfilling a food is? Okay, so probably you want to optimize your food and take everything that is on the top, right, which is very nutritious and very fulfilling. They have a whole bunch of graphics like that. And if you are curious about it, I suggest that you give it a look because it's really nice and very well crafted.",
      "id": "ep_6_ut_110"
    },
    {
      "end": 1809840,
      "speaker": "Moritz Stefaner",
      "start": 1808872,
      "text": "Sounds great.",
      "id": "ep_6_ut_111"
    },
    {
      "end": 1816176,
      "speaker": "Enrico Bertini",
      "start": 1810032,
      "text": "Yeah, it's great. Yeah. Do we want to move on to the feedback from the listeners?",
      "id": "ep_6_ut_112"
    },
    {
      "end": 1841210,
      "speaker": "Moritz Stefaner",
      "start": 1816240,
      "text": "Yeah, yeah, yeah, yeah. Like we have to catch up. I think we're getting so much good feedback and new ideas and so on. Yeah. So we got one email from Margarita, which was nice, and she pointed us to this whole idea of data sexuality. Like the dataset. It was a fun article. I'm not sure, you know, it's a bit exaggerated overall.",
      "id": "ep_6_ut_113"
    },
    {
      "end": 1848414,
      "speaker": "Enrico Bertini",
      "start": 1841362,
      "text": "Yeah. But I have to admit I loved the term. I mean, I couldn't resist retweeting it as soon as I saw it.",
      "id": "ep_6_ut_114"
    },
    {
      "end": 1852384,
      "speaker": "Moritz Stefaner",
      "start": 1849644,
      "text": "The bigger the data, the sexier it becomes.",
      "id": "ep_6_ut_115"
    },
    {
      "end": 1862784,
      "speaker": "Enrico Bertini",
      "start": 1853124,
      "text": "Yeah, but I mean, it's true that there is a very tight relationship between visualization and collecting data. Right.",
      "id": "ep_6_ut_116"
    },
    {
      "end": 1867252,
      "speaker": "Moritz Stefaner",
      "start": 1864164,
      "text": "Having this. Yeah, this relation with data.",
      "id": "ep_6_ut_117"
    },
    {
      "end": 1873540,
      "speaker": "Enrico Bertini",
      "start": 1867308,
      "text": "Of course, we have a sort of, I would even call sort of data fitticism.",
      "id": "ep_6_ut_118"
    },
    {
      "end": 1882538,
      "speaker": "Moritz Stefaner",
      "start": 1873652,
      "text": "Yeah. And it's not just in the data visualization community, but now at the moment, you know, talking about big data and data, data, data, data. And so.",
      "id": "ep_6_ut_119"
    },
    {
      "end": 1885066,
      "speaker": "Enrico Bertini",
      "start": 1882586,
      "text": "Yeah, I know. You are not a big fan of big data, right?",
      "id": "ep_6_ut_120"
    },
    {
      "end": 1916034,
      "speaker": "Moritz Stefaner",
      "start": 1885130,
      "text": "Yeah, no, yeah, I am. I think it's interesting, but, yeah, what is interesting, big data per se is of course interesting, but it's not. It's just the hype at the moment, and next year it will be something else and then we're again back to what it's good for and what is not good for. But at the moment it's like it gets so much attention that I think it's too much. But, yeah, okay, but maybe that's something for a different discussion.",
      "id": "ep_6_ut_121"
    },
    {
      "end": 1926206,
      "speaker": "Enrico Bertini",
      "start": 1916774,
      "text": "I mean, I am myself very much into big data, but I have to admit that it's hard to define what is big data. I mean, when is data big data?",
      "id": "ep_6_ut_122"
    },
    {
      "end": 1930154,
      "speaker": "Moritz Stefaner",
      "start": 1926230,
      "text": "Yeah, that's the first thing. I mean, yeah, it depends very much on the context.",
      "id": "ep_6_ut_123"
    },
    {
      "end": 1950450,
      "speaker": "Enrico Bertini",
      "start": 1930454,
      "text": "Same as high dimensional. What is. I always discuss what is high dimensional? Is it 510 hundred or thousands of dimensions? It's really hard to define. I think it's the same. When you say big data, it's not clear what is big. I think it depends pretty much on the context.",
      "id": "ep_6_ut_124"
    },
    {
      "end": 1961574,
      "speaker": "Moritz Stefaner",
      "start": 1950602,
      "text": "And also you could have a very verbose data set that says very little from an information theoretic point of view. Might not contain much information.",
      "id": "ep_6_ut_125"
    },
    {
      "end": 1962694,
      "speaker": "Enrico Bertini",
      "start": 1962294,
      "text": "Yeah.",
      "id": "ep_6_ut_126"
    },
    {
      "end": 1971074,
      "speaker": "Moritz Stefaner",
      "start": 1962734,
      "text": "And you could have a small data set that is so informative, you know, in its details and. And it's much more interesting.",
      "id": "ep_6_ut_127"
    },
    {
      "end": 1972934,
      "speaker": "Enrico Bertini",
      "start": 1971454,
      "text": "Yeah, yeah, sure, absolutely.",
      "id": "ep_6_ut_128"
    },
    {
      "end": 1977434,
      "speaker": "Moritz Stefaner",
      "start": 1972974,
      "text": "That's where the whole. I think the scene goes a bit wrong, but just prioritizing size.",
      "id": "ep_6_ut_129"
    },
    {
      "end": 1984070,
      "speaker": "Enrico Bertini",
      "start": 1977934,
      "text": "Yeah, yeah. By the way, do you feel a datasexual today?",
      "id": "ep_6_ut_130"
    },
    {
      "end": 1987554,
      "speaker": "Moritz Stefaner",
      "start": 1984182,
      "text": "No, sorry.",
      "id": "ep_6_ut_131"
    },
    {
      "end": 1990674,
      "speaker": "Enrico Bertini",
      "start": 1988294,
      "text": "Are you collecting anything about yourself?",
      "id": "ep_6_ut_132"
    },
    {
      "end": 1993616,
      "speaker": "Moritz Stefaner",
      "start": 1992944,
      "text": "Collecting.",
      "id": "ep_6_ut_133"
    },
    {
      "end": 1996324,
      "speaker": "Enrico Bertini",
      "start": 1993680,
      "text": "Are you collecting any data? Any data about yourself?",
      "id": "ep_6_ut_134"
    },
    {
      "end": 2003104,
      "speaker": "Moritz Stefaner",
      "start": 1997384,
      "text": "Yeah, I have. So I take a screenshot, one screenshot per hour, like automatically.",
      "id": "ep_6_ut_135"
    },
    {
      "end": 2003752,
      "speaker": "Enrico Bertini",
      "start": 2003264,
      "text": "Really?",
      "id": "ep_6_ut_136"
    },
    {
      "end": 2020102,
      "speaker": "Moritz Stefaner",
      "start": 2003848,
      "text": "Yeah. So I have my webcam on my computer. It takes a screenshot always to the full hour. And then occasionally I will map them into long, let's say calendar, so I can sort of replay my life, at least my digital life.",
      "id": "ep_6_ut_137"
    },
    {
      "end": 2021954,
      "speaker": "Enrico Bertini",
      "start": 2020278,
      "text": "You have a script for that?",
      "id": "ep_6_ut_138"
    },
    {
      "end": 2062412,
      "speaker": "Moritz Stefaner",
      "start": 2023574,
      "text": "Yeah, yeah, but it's very, let's say, custom made. But yeah, it's like a processing sketch that loads all the images and places them in a big one. And there's a great tool by Lev Manovich's lab, and they have a program where you can assemble really many pictures into one really big image. So I did that once with all the pictures I took, and it's like 17 meters long if you print it at 300 dpi or so. It's a ridiculously large file. I think it's 100,000 pixels wide or something. So are you planning maybe exhibit that maybe in ten years or something when.",
      "id": "ep_6_ut_139"
    },
    {
      "end": 2067076,
      "speaker": "Enrico Bertini",
      "start": 2062428,
      "text": "It's like, of course you are planning to do something with it, right, Morris?",
      "id": "ep_6_ut_140"
    },
    {
      "end": 2075104,
      "speaker": "Moritz Stefaner",
      "start": 2067180,
      "text": "It's more personal. Yeah, it's more personal at the moment, just for me as a sort of a diary, but I might use it at some point for some.",
      "id": "ep_6_ut_141"
    },
    {
      "end": 2092970,
      "speaker": "Enrico Bertini",
      "start": 2075554,
      "text": "Yeah, sure, sure. And this reminds me that this is another great source for data. Again, referring back to these questions that we always get, where do I find data? I think collecting your own data is a great, great source of interesting data, because then you relate very easily to.",
      "id": "ep_6_ut_142"
    },
    {
      "end": 2094906,
      "speaker": "Moritz Stefaner",
      "start": 2093042,
      "text": "Each other, and it's the best start. I think so too.",
      "id": "ep_6_ut_143"
    },
    {
      "end": 2097394,
      "speaker": "Enrico Bertini",
      "start": 2094930,
      "text": "It's the best start. Absolutely. Absolutely.",
      "id": "ep_6_ut_144"
    },
    {
      "end": 2127296,
      "speaker": "Moritz Stefaner",
      "start": 2097554,
      "text": "Yeah, yeah. You know, at C plus, at the C conference, there was also Stephanie Posavec. And she often really manually, when she makes a visualization about a book, she will manually annotate that book, you know, and then collect her annotations. And this is the databases. And I think you have a much more, much stronger relation to your work if you have actually, like, it's like, you know, it's like if you cook with ingredients here from your own garden, you know, basically it just tastes better.",
      "id": "ep_6_ut_145"
    },
    {
      "end": 2132364,
      "speaker": "Enrico Bertini",
      "start": 2127440,
      "text": "I mean, and I always say, if you cannot impress yourself, you can cannot impress other people.",
      "id": "ep_6_ut_146"
    },
    {
      "end": 2134884,
      "speaker": "Moritz Stefaner",
      "start": 2132944,
      "text": "You have to first impress yourself.",
      "id": "ep_6_ut_147"
    },
    {
      "end": 2151240,
      "speaker": "Enrico Bertini",
      "start": 2137464,
      "text": "And discovering things about yourself. I find it really fascinating. I mean, there is this, I'm sure you have seen this, how was it called? These visualizations from Stephen Wolfram, that was amazing, too.",
      "id": "ep_6_ut_148"
    },
    {
      "end": 2158124,
      "speaker": "Moritz Stefaner",
      "start": 2151312,
      "text": "Yeah, yeah, yeah. He was also, like, analyzing ten years of his life or so, all the key strokes he made and stuff like that.",
      "id": "ep_6_ut_149"
    },
    {
      "end": 2165134,
      "speaker": "Enrico Bertini",
      "start": 2158474,
      "text": "I was shocked when I saw that he's been collecting data since 1989 or so.",
      "id": "ep_6_ut_150"
    },
    {
      "end": 2171530,
      "speaker": "Moritz Stefaner",
      "start": 2166994,
      "text": "Yeah, yeah, yeah. He's a nerd. I mean, he's the master of our nerds, probably.",
      "id": "ep_6_ut_151"
    },
    {
      "end": 2179610,
      "speaker": "Enrico Bertini",
      "start": 2171722,
      "text": "Yeah, yeah. Okay. Do we want to move on to the next email we received and then we can wrap up?",
      "id": "ep_6_ut_152"
    },
    {
      "end": 2239794,
      "speaker": "Moritz Stefaner",
      "start": 2179642,
      "text": "Yeah. There was one more comment on the blog. I mean, it's a longer story probably, but it's from Sakshita from India, which was nice. And she was writing that. Yeah. First of all, it's great that people in India listen to a podcast. I think that's so fantastic. I mean, it just warms my heart somehow. And she was wondering about information design, data visualization, infographics. What exactly is the difference? Was also a bit worried that coming from a, let's say, more communication design background, if you move into programming and code, but you only do it, like, halfway, you know, or not properly, is that then a good idea at all? You know? So these were the thoughts sort of coming through from the blog post, and I think it's a valid question. I mean, I think our position is clear, right? I think we both agree everybody needs to learn how to code, right?",
      "id": "ep_6_ut_153"
    },
    {
      "end": 2241620,
      "speaker": "Enrico Bertini",
      "start": 2240204,
      "text": "Absolutely. Sure.",
      "id": "ep_6_ut_154"
    },
    {
      "end": 2242204,
      "speaker": "Moritz Stefaner",
      "start": 2241692,
      "text": "Yes.",
      "id": "ep_6_ut_155"
    },
    {
      "end": 2268464,
      "speaker": "Enrico Bertini",
      "start": 2242324,
      "text": "Now I know what you mean. Yeah. I think you have to learn. I mean, why do you want to limit yourself to such an extent? I mean, if you learn to code, as I said many times, you don't need to become a software engineer. You need to learn coding well enough to be able to build the things that you need. I mean, or at least to translate the ideas you have in mind into visualization, right?",
      "id": "ep_6_ut_156"
    },
    {
      "end": 2292648,
      "speaker": "Moritz Stefaner",
      "start": 2269704,
      "text": "Yeah. And I think it's so important just to think in rules and to think in, you know, in functions when you do data visualization. So. Because when you do it manually, you can move things around until they look good. Right. But if you look data visual, if you do data visualization, you want to have a very clear rule mapping properties to visual variables, right?",
      "id": "ep_6_ut_157"
    },
    {
      "end": 2293664,
      "speaker": "Enrico Bertini",
      "start": 2292696,
      "text": "Absolutely. Absolutely.",
      "id": "ep_6_ut_158"
    },
    {
      "end": 2321294,
      "speaker": "Moritz Stefaner",
      "start": 2293704,
      "text": "And if you. If you at least. If you have tried programming a few times, you get a sense of these functions and these rules, how to encode them, and what a good rule is, what a very stable rule is, and what a more difficult to implement one is. And so you have to be much more structured, I think, in your thinking, and I think that's the main point. So you don't have to program every day, but it's also like learning a new language, right? So once you learn.",
      "id": "ep_6_ut_159"
    },
    {
      "end": 2322246,
      "speaker": "Enrico Bertini",
      "start": 2321334,
      "text": "Absolutely.",
      "id": "ep_6_ut_160"
    },
    {
      "end": 2339364,
      "speaker": "Moritz Stefaner",
      "start": 2322430,
      "text": "Maybe Chinese or arab languages, so you get a whole sense of the. The thought world behind it, you know? And I think that's the same with programming. Yeah, sure, yeah. But there was a nice post by the coding horror guy, you know?",
      "id": "ep_6_ut_161"
    },
    {
      "end": 2340408,
      "speaker": "Enrico Bertini",
      "start": 2339744,
      "text": "Yeah.",
      "id": "ep_6_ut_162"
    },
    {
      "end": 2376358,
      "speaker": "Moritz Stefaner",
      "start": 2340536,
      "text": "And he's also. He's a bit Jeff Edward and he's a bit fed up with this, thinking that everybody should learn to code. And then even the mayor of New York says he wants to start to code. And he was ranting a bit about this, and he said, like, now, please, please don't everybody learn to code. This would be awful. So it's a fun. It's a fun blog post. And I think his arguments, there's something to it, but I think he misses the main point, is exactly this. The programming teaches you a certain way of thinking, and I think that's good. If everybody has that in their repertoire at least, you know.",
      "id": "ep_6_ut_163"
    },
    {
      "end": 2384170,
      "speaker": "Enrico Bertini",
      "start": 2376406,
      "text": "Yeah, yeah, sure, sure. I don't know. I didn't. I haven't read the blog post. I will, but it's a fun thing.",
      "id": "ep_6_ut_164"
    },
    {
      "end": 2386834,
      "speaker": "Moritz Stefaner",
      "start": 2384202,
      "text": "And a good discussion in the comments, so.",
      "id": "ep_6_ut_165"
    },
    {
      "end": 2393054,
      "speaker": "Enrico Bertini",
      "start": 2386994,
      "text": "Yeah. Okay, Moritz, do we want to wrap up here?",
      "id": "ep_6_ut_166"
    },
    {
      "end": 2406746,
      "speaker": "Moritz Stefaner",
      "start": 2393634,
      "text": "Yeah, I think so. Unfortunately, the connection is really bad, so we are breaking up a bit and. Yeah, so it's gonna be funny how it turns out in the recording, but I hope it sort of.",
      "id": "ep_6_ut_167"
    },
    {
      "end": 2409338,
      "speaker": "Enrico Bertini",
      "start": 2406810,
      "text": "I hope we will manage to assemble it in bearable.",
      "id": "ep_6_ut_168"
    },
    {
      "end": 2413812,
      "speaker": "Moritz Stefaner",
      "start": 2409466,
      "text": "Yeah, I think so, too. And otherwise, I just cut your parts out and just.",
      "id": "ep_6_ut_169"
    },
    {
      "end": 2431636,
      "speaker": "Enrico Bertini",
      "start": 2413988,
      "text": "Of course, yeah. I just want to say, I hope we will have another episode pretty soon. We were a bit late with this one. We don't want to disappoint you and. Yeah, let's try it.",
      "id": "ep_6_ut_170"
    },
    {
      "end": 2433104,
      "speaker": "Moritz Stefaner",
      "start": 2431660,
      "text": "With so much going on.",
      "id": "ep_6_ut_171"
    },
    {
      "end": 2435792,
      "speaker": "Enrico Bertini",
      "start": 2433884,
      "text": "Sorry, Moritz, I couldn't hear you.",
      "id": "ep_6_ut_172"
    },
    {
      "end": 2439000,
      "speaker": "Moritz Stefaner",
      "start": 2435948,
      "text": "But there's so much going on. We're busy people. That's the problem.",
      "id": "ep_6_ut_173"
    },
    {
      "end": 2439856,
      "speaker": "Enrico Bertini",
      "start": 2439112,
      "text": "Yeah, sure.",
      "id": "ep_6_ut_174"
    },
    {
      "end": 2443884,
      "speaker": "Moritz Stefaner",
      "start": 2439960,
      "text": "Yeah, yeah, sure. But we will try and be more regular.",
      "id": "ep_6_ut_175"
    },
    {
      "end": 2451064,
      "speaker": "Enrico Bertini",
      "start": 2444304,
      "text": "We will try. We will try. Okay, I think that's all for today. Thanks a lot.",
      "id": "ep_6_ut_176"
    },
    {
      "end": 2454056,
      "speaker": "Moritz Stefaner",
      "start": 2451144,
      "text": "Yeah, thanks. Was great. Talk soon.",
      "id": "ep_6_ut_177"
    },
    {
      "end": 2456080,
      "speaker": "Enrico Bertini",
      "start": 2454080,
      "text": "Have a good day. Okay, bye.",
      "id": "ep_6_ut_178"
    }
  ],
  "confidence": 0.915752897415813,
  "audio_duration": 2465,
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_status_code": null,
  "webhook_auth": false,
  "webhook_auth_header_name": null,
  "speed_boost": false,
  "auto_highlights_result": null,
  "auto_highlights": false,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_audio_quality": null,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "content_safety": false,
  "iab_categories": true,
  "content_safety_labels": {
    "status": "unavailable",
    "results": [],
    "summary": {}
  },
  "language_detection": false,
  "language_detection_threshold": null,
  "language_confidence": null,
  "custom_spelling": null,
  "throttled": false,
  "auto_chapters": true,
  "summarization": false,
  "summary_type": null,
  "summary_model": null,
  "custom_topics": false,
  "topics": [],
  "speech_threshold": null,
  "speech_model": "best",
  "chapters": [
    {
      "summary": "I'm in Manchester for future everything festival. I'm trying to relax a bit. My new baby is coming soon, third boy, actually. On color, yeah, we won't have color today. Maybe even for next episode.",
      "gist": "Color",
      "headline": "Moritz: I'm in Manchester for future everything festival",
      "start": 13400,
      "end": 134184,
      "id": "ep_6_ch_0"
    },
    {
      "summary": "Enrico: How food and visualization are related. Moritz recently concluded a project on that. The project involved working with data of what was ordered. The final solution was a radial view with curved lines, bend lines. It's one that is immediately readable.",
      "gist": "Food and Data Visualization",
      "headline": "Enrico recently completed a project on food visualization for a German startup",
      "start": 135004,
      "end": 544870,
      "id": "ep_6_ch_1"
    },
    {
      "summary": "The best way to consume it is to see the images first from the blog post. Maybe it's not that easy to understand, but we always try to describe everything enough in detail. But I think it's still a successful piece.",
      "gist": "Interviews with the Visualizations",
      "headline": "I think this is a successful piece. I'm only halfway through with the project",
      "start": 544982,
      "end": 613402,
      "id": "ep_6_ch_2"
    },
    {
      "summary": "Is it possible that you've been influenced a little bit from Barabbasi's work while doing this muslim network? Can you briefly describe what his work is? It's also about food ingredient analysis. But they don't really discuss these images in detail.",
      "gist": "Muhammad and Barabbasi's food pairing network",
      "headline": "Barabbasi's work is about food ingredient analysis",
      "start": 613458,
      "end": 966424,
      "id": "ep_6_ch_3"
    },
    {
      "summary": "I think the paper is a concept that should go away. Having people accessing this data and trying to come up with, with other visualizations would be fantastic. Absolutely, absolutely. It would be really nice. And it could be a benchmark network visualization data set.",
      "gist": "The Network Science Data set",
      "headline": "Having people accessing this data and trying to come up with other visualizations would be fantastic",
      "start": 966724,
      "end": 1090704,
      "id": "ep_6_ch_4"
    },
    {
      "summary": "Food visualization is not only limited to exploring the connection between nutrients, flavors, recipes and so on. There are also bar charts made out of french fries. Do we have any other good food visualization projects you're aware of?",
      "gist": "Food Data Visualization",
      "headline": "Do we have any other good food visualization projects you're aware of",
      "start": 1091484,
      "end": 1293994,
      "id": "ep_6_ch_5"
    },
    {
      "summary": "There is so much debate around food and health and nutrition in general that I'm surprised that we didn't see more visualizations about that. The idea is that you use food really as an expressive medium. I challenge anyone to come up with a more expressive medium for data visualization.",
      "gist": "Data visualization of food and health",
      "headline": "I'm surprised that we didn't see more visualizations about food nutrition",
      "start": 1294334,
      "end": 1684704,
      "id": "ep_6_ch_6"
    },
    {
      "summary": "If you are interested in nutrition data and detailed measurements about food, there is another website that I really like that is called self nutrition data. If you are curious about it, I suggest that you give it a look because it's really nice and very well crafted.",
      "gist": "Self-Nutrition Data",
      "headline": "There is another website that I really like that is called self nutrition data",
      "start": 1685084,
      "end": 1812672,
      "id": "ep_6_ch_7"
    },
    {
      "summary": "The bigger the data, the sexier it becomes. There is a very tight relationship between visualization and collecting data. It's hard to define what is big data. At the moment it's just the hype at the moment.",
      "gist": "Big Data and Data Sexuality",
      "headline": "There is a very tight relationship between visualization and collecting data",
      "start": 1812688,
      "end": 1979154,
      "id": "ep_6_ch_8"
    },
    {
      "summary": "Morris: I take a screenshot, one screenshot per hour, like automatically. And then occasionally I will map them into long, let's say calendar, so I can sort of replay my life. I think collecting your own data is a great, great source of interesting data.",
      "gist": "Collecting data from your own life",
      "headline": "Are you collecting anything about yourself? Collecting. Are you collecting any data",
      "start": 1979694,
      "end": 2174414,
      "id": "ep_6_ch_9"
    },
    {
      "summary": "We agree everybody needs to learn how to code, right? Absolutely. And I think it's so important just to think in rules when you do data visualization. The programming teaches you a certain way of thinking, and I think that's good.",
      "gist": "Learning to Code",
      "headline": "Everybody should learn to code, right? Absolutely. I think you have to learn. So you don't have to program every day",
      "start": 2174914,
      "end": 2387734,
      "id": "ep_6_ch_10"
    },
    {
      "summary": "Okay, Moritz, do we want to wrap up here? Unfortunately, the connection is really bad, so we are breaking up a bit. I just want to say, I hope we will have another episode pretty soon. With so much going on. But we will try and be more regular.",
      "gist": "TALKING TO MORITZ",
      "headline": "Unfortunately, the connection is really bad, so we are breaking up a bit",
      "start": 2390274,
      "end": 2456080,
      "id": "ep_6_ch_11"
    }
  ],
  "disfluencies": false,
  "entity_detection": false,
  "sentiment_analysis": false,
  "sentiment_analysis_results": null,
  "entities": null,
  "speakers_expected": null,
  "summary": null,
  "custom_topics_results": null,
  "episode_num": 6,
  "episode_metadata": {
    "speakers": [
      "Enrico Bertini",
      "Moritz Stefaner"
    ],
    "WPid": "105",
    "url": "https://datastori.es/podlove/file/202/s/feed/c/mp3/datastories-06.mp3",
    "episode_title": "On Food"
  }
}