{
  "id": "d4ee37e3-8d2b-4f00-8628-24087edf1397",
  "language_model": "assemblyai_default",
  "acoustic_model": "assemblyai_default",
  "language_code": "en_us",
  "status": "completed",
  "audio_url": "https://datastori.es/podlove/file/4136/s/feed/c/mp3/102-scott-mccloud.mp3",
  "utterances": [
    {
      "end": 10074,
      "speaker": "Scott McCloud",
      "start": 160,
      "text": "At the end of the day, you're not experiencing somebody else's story. It has to have relevance to you. It has to have something that speaks to your own needs, moment to moment, and your own desires.",
      "id": "ep_102_ut_0"
    },
    {
      "end": 32454,
      "speaker": "Moritz Stefaner",
      "start": 14534,
      "text": "Data stories is brought to you by click. Are you missing out on meaningful relationships hidden in your data? Unlock the old story with Qlik sense through personalized visualizations and dynamic dashboards, which you can download for free at click de data stories.",
      "id": "ep_102_ut_1"
    },
    {
      "end": 72776,
      "speaker": "C",
      "start": 51834,
      "text": "Hey, everyone, it's a new data stories today. It's only me. No, Enrico. He's stuck in a meeting or a conference I'll figure out later. But yeah, here I am, and I, I am recording with a very special guest we wanted to have on the show for a long time already, and I'm super happy that it finally worked out. Welcome to data stories. Scott McLeod. Hi, Scott.",
      "id": "ep_102_ut_2"
    },
    {
      "end": 74232,
      "speaker": "Scott McCloud",
      "start": 72880,
      "text": "Hey, Moritz, how are you?",
      "id": "ep_102_ut_3"
    },
    {
      "end": 76560,
      "speaker": "C",
      "start": 74328,
      "text": "Hey, I'm fantastic. How are you?",
      "id": "ep_102_ut_4"
    },
    {
      "end": 77392,
      "speaker": "Scott McCloud",
      "start": 76712,
      "text": "Quite well.",
      "id": "ep_102_ut_5"
    },
    {
      "end": 113454,
      "speaker": "C",
      "start": 77488,
      "text": "Very cool. Thanks for joining us. I'm a longtime fan of your work. I discovered your books probably ten years ago or something. I was super fascinated with an important work of yours that we will surely talk about called understanding comics comic book about how to make comics. It's almost as funny as making a podcast about data visualization, so kudos for that. But before we go into that, can you tell us a bit about yourself? Who are you? What are you interested in? What are you working on right now? Anything that helps our listeners understand what you're about.",
      "id": "ep_102_ut_6"
    },
    {
      "end": 192834,
      "speaker": "Scott McCloud",
      "start": 113574,
      "text": "Well, I seem to go through a series of obsessions in my life, but I cycled through about a dozen of them before I was 14 years old. And then I discovered comics, and that became my lifelong obsession. I decided very early on I wanted to make comics for a living, and I did a lot of fiction comics at the beginning, but then, as you mentioned, I did a book called Understanding Comics in 1993, which was my attempt to explain why I thought comics were a unique art form and how we processed the ideas implicit in all of those images and just made sense of what was going on on the page and between the panels especially. And I liked the idea that it was, was a unique medium rather than just a hybrid of words and pictures, which is what a lot of people had previously treated it as. It is that it is a hybrid, but I think at its core, it's how we create a kind of temporal map, and a lot of people know me for that, and other nonfiction books that are done in comics form, and then various other things like my experiments with webcomics, my doomed advocacy for micropayments in the early aughts and various other sidelines.",
      "id": "ep_102_ut_7"
    },
    {
      "end": 197494,
      "speaker": "C",
      "start": 192914,
      "text": "But that's still a hot topic, actually, micropayments. So maybe you were just ahead of the curve.",
      "id": "ep_102_ut_8"
    },
    {
      "end": 235824,
      "speaker": "Scott McCloud",
      "start": 198354,
      "text": "Well, maybe. I mean, some people are proposing walking around with shirts that say Scott McLeod was right, but I'm actually going to demure on that one. I think what I was advocating for was a little different than what we're getting with crowdfunding. And I'll. Although crowdfunding is exposing something that I was very interested in at the time, which was the power of the consumer dollar, when it's diluted only a little bit rather than a lot, because in the print world, of course, the author gets maybe $0.10 on the dollar if he or she is lucky, and that's not remotely true in the world of crowdfunding. So that's an interesting development.",
      "id": "ep_102_ut_9"
    },
    {
      "end": 262534,
      "speaker": "C",
      "start": 236964,
      "text": "That's true. Yeah. Let me come back to understanding comics. So you just said two very interesting things that I guess at the heart of the book. So you said the actual, like the comic, happens in the gaps between the panels, and I'd love to hear more about that. And the other thing that intrigues me as a data visualization expert is, of course, this notion of a temporal map. So maybe we can talk about these two notions. So what do you mean with the gaps?",
      "id": "ep_102_ut_10"
    },
    {
      "end": 347872,
      "speaker": "Scott McCloud",
      "start": 262834,
      "text": "Well, the idea is that, of course, we have to stitch together a sense of continuous time and narrative from fragments. And that's something that even when I was 33, working on the book, I saw that this had pretty wide applications for just the way that we process our sense of reality. I didn't know much about visual cognition in those days. I was using the term closure. I didn't even know that that came from the world of the Gestalt, the Berlin school. But that idea that we only ever experience the world in these tiny shards, these tiny fragments, and we have to patch it together in our minds, was something that was very exciting to me because I saw it on the page. I saw how we had this staccato rhythm of these little postage stamp like images, and they were still images, but we nevertheless had that illusion of movement as we played in between her, you know, as we managed to cement those gaps in between those blinks. And so that, for me, that was the essential quality of the art form. There were plenty of other things involved in the art form, the things that filled those panels, the art of drawing, the art of writing, all of those things, but they weren't the essential component. For me, the essential component was what happened in the mind between those images. Yeah.",
      "id": "ep_102_ut_11"
    },
    {
      "end": 374758,
      "speaker": "C",
      "start": 347888,
      "text": "And that's probably what sets comics and cartoons apart from other media, right? Is that other media are maybe more like if you have a full movie, be it even an animated movie, it fills these gaps immediately. Like these are like all the interpolation is happening, happening already, and there's different types of conclusions, or like, how do you say, like this sense making happening on a different level, but it's more filled out already, maybe.",
      "id": "ep_102_ut_12"
    },
    {
      "end": 425734,
      "speaker": "Scott McCloud",
      "start": 374886,
      "text": "Well, all art forms are trade in fragments. I mean, even film, you know, it no longer has that mechanical need to play in between or to fill in the gaps. You have the persistence of vision, but you still, of course, do quite a lot of stitching together, a lot of suture with things like scene changes or just the crop at the edge of the frame. You know, we still perceive a continuous world beyond that frame as we do just in our everyday life. When we're walking about, we only see what's in front of us, but we still have that sense of what's behind us. And as people who've studied vision will tell you, we have to infer the existence of what's around us in 3d space. Even though we're only seeing surfaces, we're only seeing edges and surfaces, and we have to somehow forever construct a sense of object permanence and that sort of thing.",
      "id": "ep_102_ut_13"
    },
    {
      "end": 486064,
      "speaker": "C",
      "start": 427274,
      "text": "Yeah, it's super fascinating. And I see so many parallels and analogies to data visualizations and maybe let's connect. I wanted to do that later, but let's dive right in. So one of the panels from your books I love to show in presentations is the one actually about frames and how different frames can evoke. Well, you can use them or see them as decoration for the image. Right. But the most powerful thing that a frame actually does is put somebody in a certain spot in the world and say you're now here and now look there. Like to point somebody really to a phenomenon or to give them, to provide them with a viewpoint. Right. And I think this is the most powerful thing data visualization can also. It's just what data visualization can do is to say, like, here's a phenomenon, here's a way to look at it. Now look. And I think this is something that, when I saw that in the comic book, I was super, I don't know, totally blown away with this observation.",
      "id": "ep_102_ut_14"
    },
    {
      "end": 614154,
      "speaker": "Scott McCloud",
      "start": 486404,
      "text": "Well, that visual rhetoric is, if you think of it as taking your hand and placing it upon the head of the viewer and turning that head, this is in one way or another, this is the form of visual rhetoric that any kind of visual explanation is going to take advantage of. And, of course, what I do when I'm working on nonfiction is it's very explicitly a form of visual rhetoric, although it's true of fiction as well. You are directing focus. You are, in one way or another, you're always editing the world. And in fact, it's a very violent and thorough form of editing, because in many respects, you have to edit out the vast majority of all visual stimuli to say, no, only think about this. Think about this right now. And we do this in a variety of of ways. If it's animation, then we're siloing each idea in time. In comics, we're siloing it in space as a marker for time. We're saying that as your eye moves to this little box, this is representing a moment in time. And so we're able to command focus that way. And then there are all these other ways that you can create a visual display that may have an all at once ness, but there's still that feature level tuning going on where either figure or ground or some other visual cue is allowing us to selectively separate out all of this visual stimuli and just see the one thing at a time. And then in interaction, we're able to do it more explicitly. We're able to say, yeah, hover your mouse over this, or select this option. And then you can see just that one trend line like Amanda Cox's the unemployment rate for people like you, where you can simply say, I just want to see this one thing now. So this is what we're doing. We are blinkering the world. We're saying everything else go away. Let me just see this one thing now.",
      "id": "ep_102_ut_15"
    },
    {
      "end": 665448,
      "speaker": "C",
      "start": 616014,
      "text": "Yeah. And it's a lot about guiding attention and framing things in a certain way, presenting things in a specific way. I think there's a lot of really huge parallels, and you would think there's maybe illustration is illustration and fiction is fiction, but as data visualization artists, we are designers. We do very different things. But I see a lot of parallels, actually, in how these things apply. I mean, in general, what do you think? Like, how does studying or reading a complex chart, maybe, or a sequence of charts or a big map or something, how does that relate to reading a comic or cartoon? Do the same principles apply, actually? Or is it different, do you think? Is it important if it's fiction or facts that we're talking about? Like, what's your feeling there?",
      "id": "ep_102_ut_16"
    },
    {
      "end": 758754,
      "speaker": "Scott McCloud",
      "start": 665616,
      "text": "I think when done well, there's more commonality. That is, I think that. That probably the best practices in all of these fields are those that draw from the same wellspring of basic human, really, animal needs. I think a lot of what works in terms of visual rhetoric, regardless of what discipline you're in, has a lot to do with how we're wired as animals, to be attracted to motion, to be attracted to things that seem to be alive, to our need to find things that are relevant to us. And that actually, I think, is where story comes in. I often see a lot of false starts in trying to apply the idea of story to data visualization. And I think partially that has to do with my own peculiar definition of story, and partially it has to do with the fact that that really, it has more to do with the user as protagonist. Because at the end of the day, you're not experiencing somebody else's story. It has to have relevance to you. It has to have something that speaks to your own needs moment to moment, and your own desires. That's when it tends to work. And so if you're alert to the things that speak to the part of your mind that's been there for millions of years, you're probably. You're probably heading in the right direction.",
      "id": "ep_102_ut_17"
    },
    {
      "end": 778414,
      "speaker": "C",
      "start": 759934,
      "text": "And that's an interesting point. So do you think any story, in order to be interesting, needs to have something to do with the audience? I mean, now that I say it, it sounds pretty obvious, but I think that's an interesting observation that we cannot leave the listener out of the loop there if we want to have successful storytelling.",
      "id": "ep_102_ut_18"
    },
    {
      "end": 797508,
      "speaker": "Scott McCloud",
      "start": 778494,
      "text": "Well, I should probably put my cards on the table. I have a weird definition of story. You know, give it to us. Okay. Almost. Almost anyone will. Will tell you that your characters must have some kind of desire, that you have to track what the conflict wants.",
      "id": "ep_102_ut_19"
    },
    {
      "end": 798340,
      "speaker": "C",
      "start": 797556,
      "text": "Probably it too.",
      "id": "ep_102_ut_20"
    },
    {
      "end": 888164,
      "speaker": "Scott McCloud",
      "start": 798452,
      "text": "Yeah. Well, in fact, I think you can actually shelve conflict because conflict is the consequence of desire. So desire really comes first in that respect. Kurt Vonnegut said every character must want something, even if it's only a glass of water. And I agree. However, I think that in many respects, thinking of a story as populated by characters that possess desires is actually less helpful than thinking of stories as the life cycle of a desire itself and the ways in which that desire expressed themselves through characters. This is a little like Dawkins selfish gene, the idea of genes expressing themselves through humans. We are the device by which a gene propagates itself. If you look at most stories, stories very rarely take you from the birth of a character to the death of that character. But stories very frequently take you from the gestation and birth of a desire on the part of more than one or more characters to the point at which that desire comes to rest, either fulfilled, denied, or transformed. And you can really go through stories in many, many different genres, and they tend to follow this pattern. So if that's the case, then I'm.",
      "id": "ep_102_ut_21"
    },
    {
      "end": 900300,
      "speaker": "C",
      "start": 888164,
      "text": "Going to digest that. That's such a crazy theory. It seems to work. I mean, like, yeah, let me get back to that later. But it seems to work right now. It's quite amazing. Yeah.",
      "id": "ep_102_ut_22"
    },
    {
      "end": 926934,
      "speaker": "Scott McCloud",
      "start": 900372,
      "text": "Well, also, it's really good. It's good for writer's block, too, because. Because often when a story falls apart, it's because you don't have a clear understanding of the desire. And where a story really is relevant to people is the way in which the desire is interrogated, where we think about what's the worth of the desire, what's the origin of the desire. And then when the story really works, of course, is when the audience shares in that desire.",
      "id": "ep_102_ut_23"
    },
    {
      "end": 931514,
      "speaker": "C",
      "start": 928914,
      "text": "And they become a vehicle for the desire, too.",
      "id": "ep_102_ut_24"
    },
    {
      "end": 938176,
      "speaker": "Scott McCloud",
      "start": 931674,
      "text": "Yeah. And they have to interrogate themselves, like, why do I want this? You know, that kind of thing.",
      "id": "ep_102_ut_25"
    },
    {
      "end": 942712,
      "speaker": "C",
      "start": 938240,
      "text": "Yeah, yeah. I have to think of inside out, the Pixar movie. Did you see that one?",
      "id": "ep_102_ut_26"
    },
    {
      "end": 945840,
      "speaker": "Scott McCloud",
      "start": 942848,
      "text": "I love inside out. Yeah, inside out is great.",
      "id": "ep_102_ut_27"
    },
    {
      "end": 949552,
      "speaker": "C",
      "start": 945992,
      "text": "And so, yeah, there's also this inversion of control, basically. Right?",
      "id": "ep_102_ut_28"
    },
    {
      "end": 967722,
      "speaker": "Scott McCloud",
      "start": 949608,
      "text": "Yeah, yeah. And that's. That's taking it apart. And, in fact, they really are making personalizing each of those desires also, you know, in inside out, they have five emotions, and those five emotions map perfectly to five of the six universal expressions that people like Paul Ekman talk about. It's very interesting.",
      "id": "ep_102_ut_29"
    },
    {
      "end": 969094,
      "speaker": "C",
      "start": 967818,
      "text": "It's all connected.",
      "id": "ep_102_ut_30"
    },
    {
      "end": 1012904,
      "speaker": "Scott McCloud",
      "start": 971234,
      "text": "But, you know, I listened to the episode, recent episode, where you and several people were talking about Hans Rosling, and storytelling comes up in connection with Hans. And it's true, there's that sense of story there. But I think that where that story really connects with. With the viewer is in the implicit desire of improving those standards of living and health worldwide. There's built in a desire to see that motion that we then see that it's a positive anomaly that's being detected by the data.",
      "id": "ep_102_ut_31"
    },
    {
      "end": 1023828,
      "speaker": "C",
      "start": 1013064,
      "text": "And it wouldn't work as well if it was about just physics or just sports data. Right. So you're saying the content of what he's talking about is part of that fascination with Hans.",
      "id": "ep_102_ut_32"
    },
    {
      "end": 1047454,
      "speaker": "Scott McCloud",
      "start": 1023916,
      "text": "Yeah. I think that our fascination with any data set is probably going to hinge first on anomalies, because it's true that we don't measure, we compare. And then the notion that this in some way is bringing us closer to some kind of meaningful goal on our own part, some desire that we have to better understand the world to a purpose.",
      "id": "ep_102_ut_33"
    },
    {
      "end": 1110150,
      "speaker": "C",
      "start": 1047574,
      "text": "That's interesting. Yeah. I mean, I have a sort of a very ambivalent relationship with the word storytelling, especially in a data context, because I think often it's just misused. And there was a time, maybe two or three years ago when everything was about storytelling and everything was a story. Branding was about storytelling, suddenly cooking was about storytelling, everything was about storytelling. It was like, it can't be true. I mean, that's something beyond storytelling. And maybe stories are also not for everything the best vehicle. Right. And stories have their own. Like, they bring their own logic and forces with them. Like you want a resolution and you're looking for it regardless of the facts. Like if you're caught up in a story, the story dominates what you do. Right, right. So I have a lot of problems with that, but at the same time, I find it so fascinating, and you're absolutely right, that if we really want to engage people and we really want their attention, you always need some sort of storytelling thing going on in some.",
      "id": "ep_102_ut_34"
    },
    {
      "end": 1163664,
      "speaker": "Scott McCloud",
      "start": 1110182,
      "text": "Way, some kind of desire. But I mean, but it can be the desire of the user themselves. And that's actually on that spectrum from the narrative world to the world of games. Because the thing that defines games is that the user is the author of their own experience. And I think that often it's closer to that, that it's the world of the user, it's the journey of the user that's more relevant. And, yeah, I think actually it is good to put aside this idea of story, but to not put aside the relevance to the human animal. What are we getting out of it? Why do we want to know this? How can it help us, or how can it help others that we may have an emotional or community connection to? These are things that any kind of primate understands on some level.",
      "id": "ep_102_ut_35"
    },
    {
      "end": 1185740,
      "speaker": "C",
      "start": 1164324,
      "text": "Yeah. And I think, I mean, a lot of the tension comes from that. Well, traditionally, data and measurements are associated with scientific activity. And the whole idea in science is to abstract away from your own peculiarities, your own emotional state, and work on that air quotes objective level.",
      "id": "ep_102_ut_36"
    },
    {
      "end": 1236504,
      "speaker": "Scott McCloud",
      "start": 1185932,
      "text": "But really it always comes around. It comes around like Haley's comment, because any subject sufficiently understood, regardless of how complex it is, eventually can be summed up in a form that does in the end have some emotional resonance that is not detached. We imagine it as being at these increasing levels of emotional altitude where it no longer has that. That sort of excitement. But that's not true at all. It's just that you find that those who understand even the most complex subjects, the best, can usually reduce them to something that's entirely relevant to our experience, entirely relevant to our emotional life. That's why people like Feynman were so valuable for us.",
      "id": "ep_102_ut_37"
    },
    {
      "end": 1253896,
      "speaker": "C",
      "start": 1237204,
      "text": "And. Yeah, and you're right. And they, again, touch people in a specific way. Right? They sort of, if you hear Feynman talk, it does something with you. It's like you're not that objective, rational being, just taking. In fact, yeah, it's a form of component there, right?",
      "id": "ep_102_ut_38"
    },
    {
      "end": 1337754,
      "speaker": "Scott McCloud",
      "start": 1254000,
      "text": "I mean, like, what is the. One of the basic purposes of cognition, especially visual cognition, is to find our place spatially in the world. And in many cases, this is, you know, it's a variation on that idea of. Of finding your place, to say you are here in a broader sense, not just in a sense of where you are in the Serengeti, but where you are in this sort of experiential universe. That's something that. That notion of new eyes is something that I think is going to be increasingly important because we're becoming increasingly aware of how blinkered our existence is, how many different metrics you can measure the human experience by to see what a tiny spectrum we can experience. It's very much like the visual spectrum, right? We all know that the electromagnetic spectrum allows for this tiny little sliver that we can actually perceive, and everything else is invisible to us. That same experience applies to a lot of other things, too. And a lot of visualization, I think, increasingly will be about trying to reveal where we stand in the landscape of time, where we stand in the landscape of space, where we stand in the landscape of scale, for example. Scale is a very hard thing to get across.",
      "id": "ep_102_ut_39"
    },
    {
      "end": 1355112,
      "speaker": "C",
      "start": 1338574,
      "text": "It sounds to me as if you could have a lot of fun with the recent developments in VR. Did you try some of the new virtual reality devices? Do you have thoughts about integrating maybe your knowledge about comics with that building type thing?",
      "id": "ep_102_ut_40"
    },
    {
      "end": 1482444,
      "speaker": "Scott McCloud",
      "start": 1355248,
      "text": "Oh, this definitely comes up. I spent a little time with tilt brush up at Google and talked to the tilt brush team about it. And one thing about VR is, of course, the basics have been there for a long time, and we've had a lot of false starts. We had a lot of 20 years ago, people were saying, oh, it's right around the corner. But I think we misunderstand. First, there were the technical problems of just and stuff like that, making sure that it didn't make people throw up. But then also, there was, I think, a misunderstanding of what VR was good for. You can discern depth and spatial arrangements in so many different ways. If you want to know where the couch and the chair and the lamp are, you can walk around them. You can judge it by occlusion, you can judge it by relative sizes. This is one of the reasons why people putting on 3d glasses in movies. They enjoy it. It's fun, but it doesn't dramatically change the movie going experience. And I think one of the reasons is because VR is not a spectator sport. It's not just about experiencing things passively, because the reason we have that parallax view, stereopsis has a very specific evolutionary purpose, and that is precise manipulation in space. So it's when you reach out your hand and do something in space where it matters exactly how far away from your eyes your hands are, that's when it gets exciting. And that's why I found playing with tilt brush to be a bit of a revelation. It's because being able to thread that needle, you know, with these lines in space, these painted lines, that felt like finally that missing puzzle piece was in, and my brain just was on fire with, yeah, this is why we have two eyes, you know, that, and chasing down prey and eating things in the environment. That's when I started to face forward in the cambrian period.",
      "id": "ep_102_ut_41"
    },
    {
      "end": 1527046,
      "speaker": "C",
      "start": 1484184,
      "text": "I think that's a very interesting point, and I'm still sort of waiting how this VR thing plays out. I also have a few data visualization ideas in, but as you say, it's not clear what the exact role of that medium is. And to me, that's also connected of, well, how does this sort of rich, nonlinear, exploratory storytelling actually? How is that even possible? Or is it even something people want? Right. Maybe the whole point of storytelling or enjoying a story is that you don't interact or that you give up control and just get on, like, get along for the ride. And maybe it's also sometimes too much to always have to do something. What's your take on that?",
      "id": "ep_102_ut_42"
    },
    {
      "end": 1587810,
      "speaker": "Scott McCloud",
      "start": 1527110,
      "text": "There are two things in there. I mean, we have to separate them out. One is the use of the tool as visual explanation, and that's separate from the notion of different paths. You know, branching paths is something that we have available to us in a variety of forms. But just going back to just the simple business of introducing a third dimension and stereopsis into visual explanations, that one is something, I think, that we're going to find very exciting when we're trying to simply explain structures, visual structures. I had to in the course of working on the book that I'm working on right now, I had to explain how the eye worked and even how the mind is constructed. And I got to tell you, there are a lot of terrible diagrams of the eye out there, and a lot of it is because that particular structure is really resistant to explanations in Flatland. It's very, very hard to do in flatland.",
      "id": "ep_102_ut_43"
    },
    {
      "end": 1592802,
      "speaker": "C",
      "start": 1587882,
      "text": "And the brain as well. You always just see a slice, and you're always confused about what is where.",
      "id": "ep_102_ut_44"
    },
    {
      "end": 1662080,
      "speaker": "Scott McCloud",
      "start": 1592938,
      "text": "The brain is nuts. It's horrible. But when you have full, even without goggling in, I just have an iPad app that shows the different parts of the brain, and they're in rotation, they're translucent, and you can rotate them, and it makes all the difference. And no amount of old fashioned line drawings was ever going to accomplish that for me. You have to be able to rotate that sucker in order to understand where things truly are. So that's going to be tremendously useful. I think, just in terms of explanation, the multipath stuff is something that I was dealing with early on when I was looking at potential virtual comics. And there again, I think you have to go back to the idea of who's in control. Is it the user or is it the author? And I think there's a lot of anxiety when that's ambivalent, when you have a sense that, yes, I can choose the first path, the second path, or the third path, but somebody has it all mapped out for me, and it's not really a true possibility, a limitless possibility. Space, it's a rigged game, you know, because the author could only make so many paths for me.",
      "id": "ep_102_ut_45"
    },
    {
      "end": 1666640,
      "speaker": "C",
      "start": 1662112,
      "text": "Yeah, that's like the interactive movie, like, where you just have binary choices, and at some point.",
      "id": "ep_102_ut_46"
    },
    {
      "end": 1667176,
      "speaker": "Scott McCloud",
      "start": 1666672,
      "text": "Exactly.",
      "id": "ep_102_ut_47"
    },
    {
      "end": 1669364,
      "speaker": "C",
      "start": 1667280,
      "text": "It's all the same. I win or lose.",
      "id": "ep_102_ut_48"
    },
    {
      "end": 1673360,
      "speaker": "Scott McCloud",
      "start": 1669824,
      "text": "Yeah. It's like a cutscene in a video game. It's just frustrating.",
      "id": "ep_102_ut_49"
    },
    {
      "end": 1675616,
      "speaker": "C",
      "start": 1673472,
      "text": "Yeah, everybody skips those, right?",
      "id": "ep_102_ut_50"
    },
    {
      "end": 1697470,
      "speaker": "Scott McCloud",
      "start": 1675640,
      "text": "So, yeah, yeah, I think that there's. There's a. There's a tendency towards simplicity. That is, we really want our art forms to eventually resolve themselves into something extremely simple. Either I'm in control or the author is. Either I lean forward or lean back. I think that we tend to be a little uncomfortable when it's sort of flickering in the middle.",
      "id": "ep_102_ut_51"
    },
    {
      "end": 1742022,
      "speaker": "C",
      "start": 1697582,
      "text": "That's very interesting. And, yeah, that has a lot to do with, again, how you frame the whole experience and how you set it up and what you encourage. So maybe just provide clarity on that. Straight away, the exact same thing suddenly works, which was maybe a bit confusing before. That's a great point. Yeah. What are some other things, like, from your perspective, what people working with data and data presentations could learn from comic artists and great visual storytellers like you? What do you think? What are the main things that we are still not getting that we could learn from visual communicators and just.",
      "id": "ep_102_ut_52"
    },
    {
      "end": 1919598,
      "speaker": "Scott McCloud",
      "start": 1742168,
      "text": "Well, you know, I think it goes both ways, because I think as comics artists, we have a lot to learn. Sure. Yeah. I have a lot to learn about visual explanation. So I'm looking to other forms to help me. I think most nonfiction explanatory comics are not that good, to be quite frank. I think that if there's one lesson that I think we all need to learn is that if I don't need to think it, I don't need to see it. And this applies to PowerPoint as well. This applies to any number of visual explanations, is that every visual decision generates meaning, what I think of as collateral meaning. So there are a lot of artifacts, visual artifacts and comics explanations that don't help to further the information. They distract from the information or in animation. I've seen some very good visual explanations in animation, but they'll be filled with a number of transitions where things are coming in from the side or expanding. And I look at those, and I think, you know what? When that little item comes in from the left and then some other item comes in from the right, the maker of that particular animated film, they were thinking that that was a nice way to jazz it up to make it look interesting. But our eye can't help but assign meaning to that. Something coming in from the left has a different meaning than something coming in from the right. Something that expands in scale. That can't just be a way of popping something into the frame. We are going to assign significance to it, at least subliminally. We're going to think that that matters, that we're being told something about that little nugget of data. So you have to be very, very careful that you're not generating a lot of other cues. I look at airline safety cards, for example. We'll often have a lot of excess visual information. And, you know, one of the consequences is that. And this is a good test, I think, for any kind of visualization, taken modularly, is when you're looking at one part of the display is your peripheral vision, your immediate peripheral, that little periphery around it. Is it also rendering to your mind successfully, or can you only really grok what you're looking at when it's right in the center? When it's right in the fovea because I think, very clearly rendered images, I think, tend to be better in the peripheral, so that you're looking at the whole thing and it's very clear, rather than you have to, like, dig through and. And it. And you can only open little, like a little. What is it? 7th day adventist calendar. You can only open, like, these little. These little windows one at a time. No, the whole thing should just sit and very serenely speak to you even when you're not looking at each and every part of it.",
      "id": "ep_102_ut_53"
    },
    {
      "end": 1954814,
      "speaker": "C",
      "start": 1919726,
      "text": "Interesting. Yeah. And one point you keep making and understanding comics is the right level of abstraction is so important. Right. And that if you, let's say, you over abstract and there's no more expression, no more character. But if you spell everything out, then it's odd, too, and it leaves nothing to the imagination and nothing really interesting happens anymore. If everything is readily spelled out, and this idea that sometimes just a suggestion is enough or, like, a minimal hint, and then the rest falls into place automatically, I think that's a great tip and a great observation.",
      "id": "ep_102_ut_54"
    },
    {
      "end": 1957954,
      "speaker": "Scott McCloud",
      "start": 1955354,
      "text": "You know, cartooning is the original compression algorithm.",
      "id": "ep_102_ut_55"
    },
    {
      "end": 1958574,
      "speaker": "C",
      "start": 1957994,
      "text": "Right?",
      "id": "ep_102_ut_56"
    },
    {
      "end": 1961306,
      "speaker": "Scott McCloud",
      "start": 1959994,
      "text": "I mean, if you think about black.",
      "id": "ep_102_ut_57"
    },
    {
      "end": 1968818,
      "speaker": "C",
      "start": 1961330,
      "text": "And white and, like, just the necessary essential features. Right. Yeah. It's like dimensionality reduction. Yeah, you're right.",
      "id": "ep_102_ut_58"
    },
    {
      "end": 1981604,
      "speaker": "Scott McCloud",
      "start": 1968866,
      "text": "That is, it's an extraordinary yield in terms of compression that you can pack things down to just a few simple lines. And what unpacks in the mind of the viewer is often tremendously rich. Yeah, it's true.",
      "id": "ep_102_ut_59"
    },
    {
      "end": 1994504,
      "speaker": "C",
      "start": 1982064,
      "text": "Interesting. Yeah. Great. We need to come to an end soon. Can you tell us a bit? So I hear you have a new book project you're working on. Can you tell us a bit about that?",
      "id": "ep_102_ut_60"
    },
    {
      "end": 2015298,
      "speaker": "Scott McCloud",
      "start": 1994584,
      "text": "A little bit, yeah, it's kind of in pieces on the floor, because I've. I'm still researching a lot of. I'm doing the layouts as I go, but every time I get to a new section, I have to read five books before I can draw the next four pages. Oh, my God. I arrived at visual cognition, and that's. Talk about a pandora's box.",
      "id": "ep_102_ut_61"
    },
    {
      "end": 2017746,
      "speaker": "C",
      "start": 2015466,
      "text": "Time for another PhD to get first.",
      "id": "ep_102_ut_62"
    },
    {
      "end": 2052694,
      "speaker": "Scott McCloud",
      "start": 2017930,
      "text": "Time to break out the David Marr. Oh, my God. But, yeah, it's just about seeing if I can just winnow down the fundamental principles of visual education and communication across disciplines. And it's. I've been describing it as a kind of elements of style for visual communication. Wow. But I have to look at everything, right? So I have to look at PowerPoint presentations and postas. Yeah. Infographics, fire safety signs, yes.",
      "id": "ep_102_ut_63"
    },
    {
      "end": 2054730,
      "speaker": "C",
      "start": 2053274,
      "text": "Street signs, anyways.",
      "id": "ep_102_ut_64"
    },
    {
      "end": 2068034,
      "speaker": "Scott McCloud",
      "start": 2054882,
      "text": "Absolutely. Wayfinding data visualization, of course. Yeah, it just goes on. But at the end, I'm hoping to research a very big book so I can write a very small book because I would like to.",
      "id": "ep_102_ut_65"
    },
    {
      "end": 2068970,
      "speaker": "C",
      "start": 2068074,
      "text": "Compression again.",
      "id": "ep_102_ut_66"
    },
    {
      "end": 2074770,
      "speaker": "Scott McCloud",
      "start": 2069082,
      "text": "Exactly. Yes, but that's a much harder kind of compression, but I'm working very hard on it.",
      "id": "ep_102_ut_67"
    },
    {
      "end": 2081296,
      "speaker": "C",
      "start": 2074882,
      "text": "And what format do you have in mind? Will it be a comic again, or is it like a mixed tank textbook with illustration? What's, what's your take?",
      "id": "ep_102_ut_68"
    },
    {
      "end": 2107754,
      "speaker": "Scott McCloud",
      "start": 2081360,
      "text": "No, it'll definitely be a comic. I, I still have tremendous faith that comics can be used to explain virtually anything. There will probably be an interactive component, but right now I'm just working on the static section. That is a static visual communication, and then we'll be on to motion and interactivity, and there may even be a little VR thingy at the end. We'll see.",
      "id": "ep_102_ut_69"
    },
    {
      "end": 2129874,
      "speaker": "C",
      "start": 2107794,
      "text": "Oh, that sounds amazing. Yeah, that's a wonderful, it sounds like a huge task, but I think it's such a logical extension of your current work and. Yeah, and I think a lot of people saw how general the principles you describe are, so I think it's a perfect extension to what you've been doing anyways. But it sounds like a lot of.",
      "id": "ep_102_ut_70"
    },
    {
      "end": 2180444,
      "speaker": "Scott McCloud",
      "start": 2129914,
      "text": "Work, really, I have to say. I mean, like, like discovering writers like Tufte and, you know, and Donald Norman and others. What I found was if you write about any subject at all with sufficient fascination and persistence, if you drill down far enough, what happens is just like drilling down on the surface of the earth, is eventually you're going to reach that molten core that in one way or another informs all those forms of expression. And that's what I found, too. It's just like, you just have to keep asking the questions, and then the questions that those answers provide, you have to keep following that thread, and eventually you have to arrive at something much more general, much more fundamental.",
      "id": "ep_102_ut_71"
    },
    {
      "end": 2195082,
      "speaker": "C",
      "start": 2181664,
      "text": "That's a wonderful maybe way to end this episode. To think about that. The medium itself is maybe not so important. Maybe if it's circles or squares, it's also not so important as long as we think about what drives humans and what humans are interested in, right?",
      "id": "ep_102_ut_72"
    },
    {
      "end": 2196002,
      "speaker": "Scott McCloud",
      "start": 2195178,
      "text": "Yes, indeed.",
      "id": "ep_102_ut_73"
    },
    {
      "end": 2203482,
      "speaker": "C",
      "start": 2196138,
      "text": "There we are. Wonderful. Thanks so much for coming on the show. This has been great. I'd love to have you back once, of course, once the book is out.",
      "id": "ep_102_ut_74"
    },
    {
      "end": 2205010,
      "speaker": "Scott McCloud",
      "start": 2203538,
      "text": "That'd be fun, I guess in like.",
      "id": "ep_102_ut_75"
    },
    {
      "end": 2214508,
      "speaker": "C",
      "start": 2205042,
      "text": "Two or three months. Yeah, no, I'm really looking forward to that. Take all the time you need. It sounds like an amazing work.",
      "id": "ep_102_ut_76"
    },
    {
      "end": 2215608,
      "speaker": "Scott McCloud",
      "start": 2214666,
      "text": "Thank you, Morris.",
      "id": "ep_102_ut_77"
    },
    {
      "end": 2216512,
      "speaker": "C",
      "start": 2215696,
      "text": "Thanks so much.",
      "id": "ep_102_ut_78"
    },
    {
      "end": 2217128,
      "speaker": "Scott McCloud",
      "start": 2216608,
      "text": "My pleasure.",
      "id": "ep_102_ut_79"
    },
    {
      "end": 2217656,
      "speaker": "C",
      "start": 2217176,
      "text": "Bye bye.",
      "id": "ep_102_ut_80"
    },
    {
      "end": 2218524,
      "speaker": "Scott McCloud",
      "start": 2217720,
      "text": "Bye bye.",
      "id": "ep_102_ut_81"
    },
    {
      "end": 2232768,
      "speaker": "Moritz Stefaner",
      "start": 2225184,
      "text": "Hey guys, thanks for listening to data stories again. Before you leave, here are a few ways you can support the show and get in touch with us.",
      "id": "ep_102_ut_82"
    },
    {
      "end": 2247450,
      "speaker": "C",
      "start": 2232856,
      "text": "First, we have a page on Patreon where you can contribute an amount of your choosing per episode. As you can imagine, we have some costs for running this show and we would love to make it a community driven project. You can find the page@patreon.com Datastories and.",
      "id": "ep_102_ut_83"
    },
    {
      "end": 2258094,
      "speaker": "Moritz Stefaner",
      "start": 2247482,
      "text": "If you can spend a couple of minutes rating us on iTunes, that would be extremely helpful for the show. Just search us in iTunes store or follow the link in our website.",
      "id": "ep_102_ut_84"
    },
    {
      "end": 2282212,
      "speaker": "C",
      "start": 2258474,
      "text": "And we also want to give you some information on the many ways you can get news directly from us. We are of course on twitter@twitter.com dot. But we also have a Facebook page@Facebook.com, datastoriespodcast and we also have a newsletter. So if you want to get news directly into your inbox, go to our homepage data stories and look for the link that you find in the footer.",
      "id": "ep_102_ut_85"
    },
    {
      "end": 2303846,
      "speaker": "Moritz Stefaner",
      "start": 2282348,
      "text": "And finally, you can also chat directly with us and other listeners using Slack again, you can find a button to sign up at the bottom of our our page. And we do love to get in touch with our listeners. So if you want to suggest a way to improve the show or know amazing people you want us to invite or projects you want us to talk about, let us know.",
      "id": "ep_102_ut_86"
    },
    {
      "end": 2307714,
      "speaker": "C",
      "start": 2303950,
      "text": "That's all for now. See you next time, and thanks for listening to data stories.",
      "id": "ep_102_ut_87"
    },
    {
      "end": 2329044,
      "speaker": "Moritz Stefaner",
      "start": 2311574,
      "text": "Data stories is brought to you by click. Are you missing out on meaningful relationships hidden in your data? Unlock the old story with Qlik sense through personalized visualizations and dynamic dashboards, which you can download for free at click de data stories.",
      "id": "ep_102_ut_88"
    }
  ],
  "confidence": 0.934848354971498,
  "audio_duration": 2329,
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_status_code": null,
  "webhook_auth": false,
  "webhook_auth_header_name": null,
  "speed_boost": false,
  "auto_highlights_result": null,
  "auto_highlights": false,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_audio_quality": null,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "content_safety": false,
  "iab_categories": true,
  "content_safety_labels": {
    "status": "unavailable",
    "results": [],
    "summary": {}
  },
  "language_detection": false,
  "language_detection_threshold": null,
  "language_confidence": null,
  "custom_spelling": null,
  "throttled": false,
  "auto_chapters": true,
  "summarization": false,
  "summary_type": null,
  "summary_model": null,
  "custom_topics": false,
  "topics": [],
  "speech_threshold": null,
  "speech_model": "best",
  "chapters": [
    {
      "summary": "Data stories is brought to you by click. Are you missing out on meaningful relationships hidden in your data? Unlock the old story with Qlik sense through personalized visualizations and dynamic dashboards. This week's guest is Scott McLeod, a longtime fan of his work.",
      "gist": "Data Stories",
      "headline": "Welcome to data stories, a new podcast about data visualization",
      "start": 160,
      "end": 102474,
      "id": "ep_102_ch_0"
    },
    {
      "summary": "Scott McLeod discovered comics when he was 14 years old. He wrote Understanding Comics in 1993 to explain why he thought comics were a unique art form. His advocacy for micropayments in the early aughts was different than what we're getting with crowdfunding.",
      "gist": "In the Elevator With Scott McLeod",
      "headline": "Scott McLeod says comics became his lifelong obsession",
      "start": 103254,
      "end": 238580,
      "id": "ep_102_ch_1"
    },
    {
      "summary": "The idea is that we have to stitch together a sense of continuous time and narrative from fragments. For me, the essential component was what happened in the mind between those images. That's probably what sets comics and cartoons apart from other media.",
      "gist": "Understanding Comics: The Absences and Splits",
      "headline": "You say the actual comic happens in the gaps between the panels",
      "start": 238652,
      "end": 437874,
      "id": "ep_102_ch_2"
    },
    {
      "summary": "The most powerful thing that a frame actually does is put somebody in a certain spot in the world. Data visualization is a form of visual rhetoric that any kind of visual explanation is going to take advantage of. The best practices in all of these fields are those that draw from the same wellspring of basic human needs.",
      "gist": "Data Visualization and Visual Literacy",
      "headline": "Data visualization is a form of visual rhetoric that commands focus",
      "start": 437954,
      "end": 705614,
      "id": "ep_102_ch_3"
    },
    {
      "summary": "I often see a lot of false starts in trying to apply the idea of story to data visualization. Do you think any story, in order to be interesting, needs to have something to do with the audience?",
      "gist": "In the Elevator With Data Visualization",
      "headline": "Storytelling in data visualization has to have relevance to the audience",
      "start": 706754,
      "end": 778414,
      "id": "ep_102_ch_4"
    },
    {
      "summary": "In many respects, thinking of a story as populated by characters that possess desires is actually less helpful than thinking of stories as the life cycle of a desire itself. Where a story really is relevant to people is the way in which the desire is interrogated.",
      "gist": "What is the Story of Stories?",
      "headline": "Kurt Vonnegut says every character must want something",
      "start": 778494,
      "end": 1236504,
      "id": "ep_102_ch_5"
    },
    {
      "summary": "One of the basic purposes of cognition is to find our place spatially in the world. A lot of visualization increasingly will be about trying to reveal where we stand in the landscape of time. Do you have thoughts about integrating maybe your knowledge about comics with that building type thing?",
      "gist": "Tilt Brush and the Future of VR",
      "headline": "One of the basic purposes of cognition is to find our place spatially",
      "start": 1237204,
      "end": 1715280,
      "id": "ep_102_ch_6"
    },
    {
      "summary": "Most nonfiction explanatory comics are not that good, to be quite frank. Every visual decision generates meaning, what I think of as collateral meaning. The right level of abstraction is so important. What are the main things that we are still not getting that we could learn from visual communicators?",
      "gist": "Philip Glass on Visual Explanations",
      "headline": "What are some things people working with data and data presentations could learn from comics",
      "start": 1715472,
      "end": 1988552,
      "id": "ep_102_ch_7"
    },
    {
      "summary": "Morris: I hear you have a new book project you're working on. Will it be a comic again, or is it like a mixed tank textbook with illustration? Morris: It's just about seeing if I can winnow down the fundamental principles of visual education and communication across disciplines.",
      "gist": " on Writing a Book About Visual Communication",
      "headline": "So I hear you have a new book project you're working on",
      "start": 1988648,
      "end": 2218524,
      "id": "ep_102_ch_8"
    },
    {
      "summary": "Here are a few ways you can support the show and get in touch with us. We have a page on Patreon where you can contribute an amount of your choosing per episode. If you can spend a couple of minutes rating us on iTunes, that would be extremely helpful for the show. And we do love to get in contact with our listeners.",
      "gist": "How to support data stories!",
      "headline": "Before you leave, here are a few ways you can support the show",
      "start": 2225184,
      "end": 2329044,
      "id": "ep_102_ch_9"
    }
  ],
  "disfluencies": false,
  "entity_detection": false,
  "sentiment_analysis": false,
  "sentiment_analysis_results": null,
  "entities": null,
  "speakers_expected": null,
  "summary": null,
  "custom_topics_results": null,
  "episode_num": 102,
  "episode_metadata": {
    "speakers": [
      "Scott McCloud",
      "Moritz Stefaner"
    ],
    "WPid": "978",
    "url": "https://datastori.es/podlove/file/4136/s/feed/c/mp3/102-scott-mccloud.mp3",
    "episode_title": "Understanding Comics and Visual Storytelling with Scott McCloud"
  }
}