{
  "id": "caebfa2e-a693-4b41-884c-72ac7dd7f5f9",
  "language_model": "assemblyai_default",
  "acoustic_model": "assemblyai_default",
  "language_code": "en_us",
  "status": "completed",
  "audio_url": "https://datastori.es/podlove/file/6892/s/feed/c/mp3/166-catching-up-with-amanda-makulec.mp3",
  "utterances": [
    {
      "end": 12490,
      "speaker": "Amanda Makulec",
      "start": 680,
      "text": "I think it's been such an interesting and curious couple of years of evolution of what this field looks like, in part because of how in the spotlight data visualization has been, and data visualization continues to be.",
      "id": "ep_166_ut_0"
    },
    {
      "end": 47130,
      "speaker": "Moritz Stefaner",
      "start": 31970,
      "text": "Hi, everyone. Welcome to a new episode of data stories. My name is Moritz Stefaner. I'm an independent designer of data visualizations, and in fact, I work as a self employed truth and beauty operator out of my office here in the countryside in the north of Germany.",
      "id": "ep_166_ut_1"
    },
    {
      "end": 52970,
      "speaker": "Enrico Bertini",
      "start": 47250,
      "text": "And I am Enrico Bertini, and I am a professor at Northeastern University in Boston.",
      "id": "ep_166_ut_2"
    },
    {
      "end": 66526,
      "speaker": "Moritz Stefaner",
      "start": 53050,
      "text": "Right. And on this podcast, we used to talk, and now talk again about data visualization, analysis, and generally the role data plays in our lives. And usually we do that together with a guest we invite on the show.",
      "id": "ep_166_ut_3"
    },
    {
      "end": 98946,
      "speaker": "Enrico Bertini",
      "start": 66678,
      "text": "Yes. But before that, a quick note. Our podcast is listener supported, so there's no ads. So if you enjoy the show, please consider supporting us with either recurringpayments on patreon.com Datastories. Or if you prefer, you can send us a one time donation on Paypal. Going to PayPal me Datastories. Or if you can contribute, that's totally fine. Just maybe write a note on Twitter or something. That's always helpful.",
      "id": "ep_166_ut_4"
    },
    {
      "end": 114350,
      "speaker": "Moritz Stefaner",
      "start": 99058,
      "text": "Yeah, and much appreciated, for sure. And, yeah, we're excited to be back. We've been gone for a year. I mean, we haven't been gone. We've been up to other things and finally managed to pick up this podcast again. So, yeah, it's been a while. Right?",
      "id": "ep_166_ut_5"
    },
    {
      "end": 122150,
      "speaker": "Enrico Bertini",
      "start": 114730,
      "text": "So exciting. I must confess I'm a little nervous. I didn't expect that. I hope I'm not too rusty.",
      "id": "ep_166_ut_6"
    },
    {
      "end": 126292,
      "speaker": "Moritz Stefaner",
      "start": 124050,
      "text": "Podcasting is like swimming, I hope.",
      "id": "ep_166_ut_7"
    },
    {
      "end": 130200,
      "speaker": "Enrico Bertini",
      "start": 126356,
      "text": "Right, exactly. And, yeah, biking as well.",
      "id": "ep_166_ut_8"
    },
    {
      "end": 135600,
      "speaker": "Moritz Stefaner",
      "start": 132260,
      "text": "Exactly. So what have you been up to in the meantime, Enrico?",
      "id": "ep_166_ut_9"
    },
    {
      "end": 137276,
      "speaker": "Enrico Bertini",
      "start": 136060,
      "text": "Nothing, right?",
      "id": "ep_166_ut_10"
    },
    {
      "end": 138892,
      "speaker": "Moritz Stefaner",
      "start": 137428,
      "text": "Yeah, just chilling, right.",
      "id": "ep_166_ut_11"
    },
    {
      "end": 200064,
      "speaker": "Enrico Bertini",
      "start": 138956,
      "text": "So, yes, just chilling a few things from my side. You may have noticed from the introduction, if you are a recurring listener of data stories, that I just said that I am a northeastern university in Boston, so I'm no longer in New York City. I moved to northeastern in Boston. When was that? Last January. So I have a new position. It's really exciting. And I guess I would be talking about things happening here in future episodes. There's a lot going on here. It's really, really exciting. A lot of data vis people in the area. It's unbelievable. It's not just northeastern. The whole Boston area is full of really, really interesting people. So that's great. In the meantime, I had the courage of starting a newsletter, and this newsletter is on substack. It's f I l W D, which is the handle I use on Twitter dot substack.com.",
      "id": "ep_166_ut_12"
    },
    {
      "end": 205120,
      "speaker": "Moritz Stefaner",
      "start": 200192,
      "text": "And that was your old blog as well, right? Like fellow, that's how it all works, right?",
      "id": "ep_166_ut_13"
    },
    {
      "end": 260960,
      "speaker": "Enrico Bertini",
      "start": 205200,
      "text": "Exactly. Exactly. So that's where I surprisingly, I guess, write about Dataviz and data in general. So if you're curious about what my thoughts are sometimes, stream of consciousness type of blogs. Yeah, take a look. And finally, I'm really excited because I will be starting next week a new course, and this course is on visualization for machine learning, which as you can imagine, is pretty interesting and trendy in a way. So just setting up the course, deciding what to teach, what not to teach, how to teach, it is a really interesting challenge and I plan to put some material out there and to talk more about what is happening in the course. So stay tuned. I will definitely provide more information about it.",
      "id": "ep_166_ut_14"
    },
    {
      "end": 261688,
      "speaker": "Moritz Stefaner",
      "start": 261040,
      "text": "Great.",
      "id": "ep_166_ut_15"
    },
    {
      "end": 263580,
      "speaker": "Enrico Bertini",
      "start": 261864,
      "text": "So how about you, Moritz?",
      "id": "ep_166_ut_16"
    },
    {
      "end": 327950,
      "speaker": "Moritz Stefaner",
      "start": 263880,
      "text": "How do you underselling yourself? You have not been lazy, I can hear that, right? No, me neither. What's going on? Yeah, still project work. I've been involved in a large project for World Health Organization, working on a data design system. Yeah. Thinking about how the charts for a new data portal can look like, what the language is, what the building blocks are, and got really excited about building these types of systems and also thinking more about internationalization, accessibility, text generation, and how to bring these worlds of design and code and automatic systems, but also human decisions. How can you formalize this and how can enable a lot of people to build great charts? So I think that's exciting. Also very challenging. But yeah, we're at a good spot now in the project. We have a first version of the guidelines, they're being implemented. And yeah, I hope I can at some point tell more about it. Maybe we can do a dedicated episode at some point.",
      "id": "ep_166_ut_17"
    },
    {
      "end": 335550,
      "speaker": "Enrico Bertini",
      "start": 328570,
      "text": "You've been working with many of these big organization, international organizations. You must be a pro by now.",
      "id": "ep_166_ut_18"
    },
    {
      "end": 383812,
      "speaker": "Moritz Stefaner",
      "start": 335910,
      "text": "Yeah, I mean, each of them is sort of different in its own way. There's a lot of stories to be told there as well. And yeah, the other big partner I'm working with is the German federal Foreign Office, and I work with them on climate related projects, looking at how climate change and international conflicts are related to each other, mostly for analysts, but also like really communicating the science there, doing case studies, storytelling. I've been thinking a lot about multi dimensional maps and how to bring a lot of different layers into maps in that context. And so, yeah, I also hopefully can share a bit there. And again, it's really thinking about enabling people to work in a meaningful way with data, and it's kind of exciting.",
      "id": "ep_166_ut_19"
    },
    {
      "end": 391052,
      "speaker": "Enrico Bertini",
      "start": 383956,
      "text": "And you also built a dashboard for kind of like, following Covid data for Germany, something like that.",
      "id": "ep_166_ut_20"
    },
    {
      "end": 391404,
      "speaker": "Moritz Stefaner",
      "start": 391116,
      "text": "Yeah.",
      "id": "ep_166_ut_21"
    },
    {
      "end": 393188,
      "speaker": "Enrico Bertini",
      "start": 391452,
      "text": "That seems like a really big and.",
      "id": "ep_166_ut_22"
    },
    {
      "end": 400060,
      "speaker": "Moritz Stefaner",
      "start": 393244,
      "text": "Important one and a half years ago. Yeah. The COVID vaccination dashboard. Yeah, that was another big thing. Yeah. From last year.",
      "id": "ep_166_ut_23"
    },
    {
      "end": 401032,
      "speaker": "Enrico Bertini",
      "start": 400680,
      "text": "Yeah.",
      "id": "ep_166_ut_24"
    },
    {
      "end": 407496,
      "speaker": "Moritz Stefaner",
      "start": 401056,
      "text": "So lots of public health and climate. That's my two things at the moment. The big topics, apparently.",
      "id": "ep_166_ut_25"
    },
    {
      "end": 410300,
      "speaker": "Enrico Bertini",
      "start": 407648,
      "text": "Right, right, exactly.",
      "id": "ep_166_ut_26"
    },
    {
      "end": 411448,
      "speaker": "Moritz Stefaner",
      "start": 411000,
      "text": "Yeah.",
      "id": "ep_166_ut_27"
    },
    {
      "end": 412120,
      "speaker": "Enrico Bertini",
      "start": 411504,
      "text": "Okay.",
      "id": "ep_166_ut_28"
    },
    {
      "end": 434228,
      "speaker": "Moritz Stefaner",
      "start": 412200,
      "text": "Anyway, so we mentioned, yeah, it's been a while and we've been out of the loop. Right. And so in order to catch up, we thought, oh, we need to invite somebody has, like, really good overview of all the things that are happening right now in Dataviz. And luckily we found somebody. So today, today we're joined by Amanda Makulec. Hi, Amanda.",
      "id": "ep_166_ut_29"
    },
    {
      "end": 435124,
      "speaker": "Enrico Bertini",
      "start": 434324,
      "text": "Hey, Amanda.",
      "id": "ep_166_ut_30"
    },
    {
      "end": 436460,
      "speaker": "Amanda Makulec",
      "start": 435212,
      "text": "Hi there. How are you?",
      "id": "ep_166_ut_31"
    },
    {
      "end": 437236,
      "speaker": "Enrico Bertini",
      "start": 436580,
      "text": "Very well.",
      "id": "ep_166_ut_32"
    },
    {
      "end": 453780,
      "speaker": "Moritz Stefaner",
      "start": 437308,
      "text": "Thanks for joining us, and as I said, I think you're the perfect person for the reboot and for getting us up to speed on what's going on in the database world right now. So can you tell us a bit about our listeners, mostly about yourself and what you're currently up to?",
      "id": "ep_166_ut_33"
    },
    {
      "end": 497416,
      "speaker": "Amanda Makulec",
      "start": 453860,
      "text": "Sure. And thank you so much for having me. I'm Amanda McCullough. I'm currently the executive director for the Global Data Visualization Society. For folks who don't know DVS, we are a global, nonprofit professional association for Dataviz practitioners and enthusiasts at any level and space in their career path. And so it's exciting to get to have a chance to chat with both of you. My background more formally and my work in data visualization is focused more in the public health space. I spent eight years working in global health and development before spending five years focused more on us federal projects and private sector projects, and now work independently, balancing my time between leading DVS and doing cool public health data visualization work, including teaching, training, and design work.",
      "id": "ep_166_ut_34"
    },
    {
      "end": 503536,
      "speaker": "Moritz Stefaner",
      "start": 497568,
      "text": "Yeah. Awesome. And we did have, like, an initial episode on the dvs, right, when it was founded, I think.",
      "id": "ep_166_ut_35"
    },
    {
      "end": 503840,
      "speaker": "Amanda Makulec",
      "start": 503608,
      "text": "Right.",
      "id": "ep_166_ut_36"
    },
    {
      "end": 523930,
      "speaker": "Moritz Stefaner",
      "start": 503880,
      "text": "Like three months afterwards. And so it's super exciting to catch up on how. Yeah. How that whole thing has developed and what you have planned there. So can you give us a little, like, overview of how, how has the membership developed? How are all the activities? Sort of hard to summarize because so much is going on in that society.",
      "id": "ep_166_ut_37"
    },
    {
      "end": 692264,
      "speaker": "Amanda Makulec",
      "start": 524010,
      "text": "Yeah, I mean, we're three and a half years old almost. I kind of gauge the age of DVS based on the age of my oldest child and my toddler. Since I got involved with DVS back when I was actually on maternity leave with my first kiddo. So that's how I typically remember how long we've been around for. But yeah, we've been around now for about three and a half years. I think that the organization has grown really quickly, a really exciting way, and in a way that's also a little bit intimidating and scary for those of us making programming plans. We have over 22,000 people who have registered with us in some membership capacity since we launched, which is really exciting. And over the course of the last three and a half years, we've actually successfully gone through some leadership transitions, which is really exciting because one of the things we've heard from other kind of community based organizations and projects is that to sustain and grow the kind of community organization and professional society we want to create as dds, we need to think about how we continue to bring in new leaders, new voices, and find ways to engage people from different spaces around the world. So we've been busy thinking about what that can look like and really focusing and centering around three key goals as an organization that we think resonate with our community in terms of what database pricked practitioners are looking for. So how do we nurture this cross functional, tool agnostic data visualization community and create space for people who are working in different tech stacks or on different topics to be able to connect with each other and learn from each other? Second, to celebrate the excellent work happening in the data visualization field. I know, Moritz, you and I have both done a lot of work on public health data visualization, and the last couple of years with the pandemic have been just a boon for what consuming health related data visualization looks like for the broader public, and understanding the complexities of what making those data visualizations can look like. And so we're excited to celebrate the great work happening in data visualization and then finally going ahead and thinking about how we advance our industry and think more about the fact that data visualization really has come into its own as a dedicated career path you can have, which, I mean, when I was doing my training in public health, I think I had half a course in my monitoring and evaluation course series talking about charts and graphs and data visualizations as a thing you did, but less focused on a lot of the graphic design principles and ux principles that are really important. And so as we think about those three goals around nurturing, celebrating, and advancing what data visualization looks like, a lot of the specific activities that I'm happy to dive into a little bit more, really relate back to trying to achieve some of those core goals.",
      "id": "ep_166_ut_38"
    },
    {
      "end": 722336,
      "speaker": "Enrico Bertini",
      "start": 692412,
      "text": "Yes, that's really. I mean, I think dvs really covers a gap that we used to have there. And my sense is that it's particularly useful for people who want to get started and are completely lost and they don't know where to go. Right, right. So you have. I think you have many activities within dvs that are designed specifically to help novices get started, is that correct?",
      "id": "ep_166_ut_39"
    },
    {
      "end": 839080,
      "speaker": "Amanda Makulec",
      "start": 722528,
      "text": "We do. We have a dedicated work stream around early career practitioners, and when we set up the organization, we actually included a role on our direct board of directors for an early career director to ensure that we had someone who was bringing the voice of an early career practitioner to our leadership team, because there's no one better to be able to advocate for and talk about the various different challenges facing early career practitioners now that are the somewhat different, perhaps, than when a lot of us got started and maybe fell into this work a bit by accident for a number of us who work in data visualization and have been there for a while. So as we think about the ways in which we support those early career practitioners, you'll see a lot of content in our digital journal Nightingale, as well as the print edition of that journal, which was a big undertaking for our publications team. But the digital and the print editions actually going out and having a lot of content related to learning data visualization, exploring the history of data visualization that may be practical for people who are early career practitioners. And we've worked a lot to create space through bimonthly events and through our mentorship program, where people can connect with other Dataviz practitioners and learn about their own career journeys and the ways in which their career paths have evolved, because there still isn't really some kind of clear roadmap. Right. There's no, like, CPA of data visualization where there's some kind of clear certification and credentialing process through which you become, you know, official data visualization practitioner. And I think that's exciting because it means we have a really diverse range of people who work in this industry and bring very different backgrounds and experiences. And the more that we kind of create those collisions between people who might not meet each other from different places in their career paths and different backgrounds, the more I think we create a really robust and thriving community of people who can level up and do even better work.",
      "id": "ep_166_ut_40"
    },
    {
      "end": 860990,
      "speaker": "Enrico Bertini",
      "start": 839450,
      "text": "Yeah. And I think that that's always, like, the positive and negative side of that. Right. I think on the one hand, it's great that what makes Dataviz so exciting is that people come from many different backgrounds. But at the same time, I think people, especially in industry, tends to have jobs that have very different kind of titles, right?",
      "id": "ep_166_ut_41"
    },
    {
      "end": 985018,
      "speaker": "Amanda Makulec",
      "start": 861770,
      "text": "So the titles are fascinating. So one of the things we've continued as an organization for something that predates a DVS, actually because Elijah Meeks had started it up, is the state of the industry survey that's done annually and actually is open in September for responses from anyone who works in data visualization can fill out the survey and share their experience as a Dataviz practitioner. And this will be the 6th year of that survey. And when we look at the data from that survey, you can see in some ways the kind of growth and evolution of the field. But we collect information like job titles, and we do some classifications of what kind of roles those different job titles fall into around being analysts versus developers versus engineers or designers. And the number of different job titles and role descriptions is just fascinating and can also be really intimidating if you're new in this field and trying to figure out what kind of jobs you might be qualified for or interested in applying for. So the state of the industry survey and the work that we've done around that space, and making some of the aggregate level data from that survey more, we hope helps people explore more about what this growing industry looks like, and I think is complemented by some of the other events and activities that we put together. Nightingale, our publication that I mentioned, where we've had over a thousand different authors at this point who have written with us in different capacities over the course of the last three years, and our outlier conference that we've hosted for two years running now, where we've brought together a nice mix of people who have really strong voices in the Dataviz community, sharing their knowledge and expertise, but also hearing from folks who people might not know about really interesting, cool projects that they're working on. And I've really appreciated the mindfulness that our leadership team and that our broader community has held us accountable around to make sure that we're not just creating an echo chamber of the same voices, but trying to raise awareness of the really interesting, cool things happening, especially in new regions and parts of the world that maybe have a newer scene for data visualization and tech.",
      "id": "ep_166_ut_42"
    },
    {
      "end": 1011836,
      "speaker": "Enrico Bertini",
      "start": 985174,
      "text": "I'm glad you're mentioning that one little thing that we've been trying to do in data stories almost every year is these data stories around the world, because there's definitely something that is happening in the countries that are not the usual countries, right. So I think it's really important to find more geographical diversity. Right? In a way, I think it's really, really important.",
      "id": "ep_166_ut_43"
    },
    {
      "end": 1174518,
      "speaker": "Amanda Makulec",
      "start": 1012018,
      "text": "It is. I think one thing I would add there that I think we're trying to work on and we're launching, and this is one of those funny, you know, unfortunate side effects of the pandemic stories where when we were about a year old, so February of 2020, we had just gotten to a place where we had designed a kind of structure for launching geographic chapters with the idea that we create space and say, you know, we have this great membership roster of thousands of people. Like what an opportunity to say, hey, you know, there's 100 of you all based in the same city or location, there's no existing Dataviz meetup group or anything else like that. How can we help you all connect more beyond the Slack channel for your location and then the pandemic hit, and so the idea of kind of fostering and enabling these in person events and collaborations kind of fell apart a bit for a little while. And so right now we're actually just rebooting and starting up some geographically affiliated groups through DVS where we've purposefully looked and said, where are their locations? Where there either is an existing smaller group that we can help support and grow, or where there's a collection of Dataviz society members who we could help connect to each other. And there may be a few local leaders who might be interested in creating more local events and opportunities to connect. Because I do think that as we look forward to what conferences and events look like, I think we'll continue to see a lot of emphasis on creating more decentralized opportunities for people to connect with folks locally, both from an accessibility perspective and a cost perspective, and also being mindful about things around, like the impacts for around climate, for travel, and other reasons why there can be some really great benefits to not doing the around the world jet setting that I think a lot of us used to do for conferences and was very normal in a pre Covid world. So I'm really excited to see some of these geographic chapters start up and then also some of the global interest groups that we're starting up. The first two focused on data visualization and health and on visualization for kids. So how to teach and work with kids to help them learn data visualization early on with those as the two starting out topical interest groups that we're launching with the idea that we'll continue to open the door for involved and engaged community members and leaders to say, hey, I'd love to bring together a group of people globally who think and talk and have these meetups and events around data visualization and the environment or data visualization and climate or any other topic that's of high interest. And so I'm excited to see more of these member led initiatives and opportunities that we can provide support to, but also create space, again, for new leaders to step up and mobilize people around topics that they're really excited about.",
      "id": "ep_166_ut_44"
    },
    {
      "end": 1215598,
      "speaker": "Moritz Stefaner",
      "start": 1174694,
      "text": "That's great. I mean, it's so much that's happening. But I'm really impressed. And I can remember at the beginning I was really a bit skeptical in terms of, oh yeah, you have a lot of momentum right now because you're just starting this thing. Right. But is it sustainable to even run a society like this? And I think it's amazing to see that you're now able to have a magazine, a conference, awards coming up, which we should also discuss and all these extra activities. Right. And so I'm curious, how, how does this work practically? Is it like just a few volunteers just having more time in the day than everybody else, or how do you manage to, to do all this?",
      "id": "ep_166_ut_45"
    },
    {
      "end": 1356106,
      "speaker": "Amanda Makulec",
      "start": 1215734,
      "text": "I mean, I left my full time job at the end of March and have spent a lot more time on DVS than I probably would have expected. So partially goodwill and enthusiasm. I think it's a really smart question to ask though, because I think a lot of community activities and community initiatives in the data space, but in tech more broadly, rely a lot on the generosity and time and volunteer labor of people who are passionate and excited about making these kind of things happen. And I think one of the challenges that you face is that there's a certain growth threshold you hit. You can only grow so big and do so much without some paid time and support. Running an organization at DVS's scale, just thinking about like our mailchimp costs on a monthly basis for hosting a distribution list of the size that we have are not massive, but they're not insignificant. And so as you start to look at what the budget looks like, that I think ends up being a space, you have to talk about kind of what is the long term scalability and sustainability of an organization like dvs look like, where there are so many things we could do and we have to focus on the things that have the greatest impact for our members and for the broader community, which is why we've launched things like options for paid membership tiers. We do always will always have a free option to be a free member. But people can opt into paying a low rate for an annual membership and get various benefits, and that helps to cover some of those costs. And we look a lot for partners, sponsors, others who are willing to help provide us with support, either through pro bono contributions and support, or through financial support. And that helps us pay some of the part time contractors and others who both run the organization on a day to day basis. People like our comms manager, our Nightingale editors, but also allow us to hopefully lead by example as a really scrappy nonprofit and pay, even if it's a small, small stipend, like pay each of our Nightingale contributors a small fee for their writing and their work. We pay an honorarium to each of our outlier speakers. And so as we think about the ways in which we want to model and lead by example, we try to create space for being able to pay our contributors for their time and labor, because that's really important to us from an inclusion perspective, because there are folks who need to have their time covered and compensated, and that's a fair request.",
      "id": "ep_166_ut_46"
    },
    {
      "end": 1369130,
      "speaker": "Moritz Stefaner",
      "start": 1356298,
      "text": "Yeah, I think I noticed that, like, maybe like a year in or something where I at least realized, oh, okay, this is more than a slack channel now. This society is run like a little foundation, you know, or like a little company almost.",
      "id": "ep_166_ut_47"
    },
    {
      "end": 1372546,
      "speaker": "Amanda Makulec",
      "start": 1369250,
      "text": "We're a 501 C three, and people.",
      "id": "ep_166_ut_48"
    },
    {
      "end": 1379058,
      "speaker": "Moritz Stefaner",
      "start": 1372578,
      "text": "Are getting paid and, you know, but I think it's needed because otherwise it's. You can only get so and so far. Right?",
      "id": "ep_166_ut_49"
    },
    {
      "end": 1430598,
      "speaker": "Amanda Makulec",
      "start": 1379194,
      "text": "Yeah, I mean, and that was my first job within DVS is I was the operations director for a year and a half, and so I was responsible for getting our articles of incorporation done, getting our 501 filing done with the IRS, getting our bank account set up, making sure that we built the infrastructure that could outlast any one team of people. And we've seen that with, there was a UK based information design organization that recently closed its doors and Washington was distributing its remaining funding, and they had had the same leadership team for more than a decade of people who were really kind of running the organization on their passion and enthusiasm, which is amazing. But at the end of the day, we want to be able to grow and scale the way other professional associations do globally and be able to serve people in that way. And that requires resources and planning.",
      "id": "ep_166_ut_50"
    },
    {
      "end": 1431134,
      "speaker": "Enrico Bertini",
      "start": 1430694,
      "text": "Yeah.",
      "id": "ep_166_ut_51"
    },
    {
      "end": 1443898,
      "speaker": "Amanda Makulec",
      "start": 1431222,
      "text": "So we're very grateful to everyone who supports us in those ways. I would be remit to not mention our gratitude towards everyone who supported us from the first day of the Patreon account all the way over to being paid members or being sponsors in different ways for our different events.",
      "id": "ep_166_ut_52"
    },
    {
      "end": 1480290,
      "speaker": "Enrico Bertini",
      "start": 1444034,
      "text": "Yeah. I have to say I share Moritz's sentiment that I'm really glad that this is working. And I think I was a little bit more hopeful than him at the beginning when we saw DVS happening. But I'm really surprised that it's been working so well. Just amazing. That's the thing. Right. And it's a great service. I think what you are doing and what the whole team is doing is really remarkable. I think we. Yeah, we have to thank you for that. It's really, really special.",
      "id": "ep_166_ut_53"
    },
    {
      "end": 1545018,
      "speaker": "Amanda Makulec",
      "start": 1481070,
      "text": "Well, and I think that a big part too, of what we do is to say where is it that we can add unique value in terms of the priorities and things we take on bringing people and groups together and where can we engage and work with, with incredible partners who are doing work around data visualization training, building other kind of mentorship communities. I mean, we've partnered with groups and have partnerships with the elevate learning community that Alli Torbin and will chase and Gabby and Duncan run because it's a great space for someone who wants more dedicated time to go ahead and focus on learning in that space. And we've partnered with other groups who are trainers in data visualization or who are people who have tools or tech stacks they share and use. And so we look for what are the things that we are uniquely positioned to do and support. And I think that, for example, the information is beautiful awards and trying to bring those back was one of those good examples of something we thought we were uniquely positioned to reach out to David and say, is there a way we can support bringing this back?",
      "id": "ep_166_ut_54"
    },
    {
      "end": 1558250,
      "speaker": "Moritz Stefaner",
      "start": 1545194,
      "text": "Right. They were gone originally, so. Yeah. So David McCandless started them together with Kantar with the, how do you call it? Like a consultancy agency or. I'm lacking the english word right now.",
      "id": "ep_166_ut_55"
    },
    {
      "end": 1563002,
      "speaker": "Amanda Makulec",
      "start": 1558290,
      "text": "Yeah, I think they're design. A broad design agency of some sort.",
      "id": "ep_166_ut_56"
    },
    {
      "end": 1575970,
      "speaker": "Moritz Stefaner",
      "start": 1563106,
      "text": "Yeah, yeah. But Cantor is like McKinsey or like Price Waterhouse, Coopers Canal on this type of business consulting level. And they've been sponsoring that award for eight years, nine years, something like this.",
      "id": "ep_166_ut_57"
    },
    {
      "end": 1578394,
      "speaker": "Amanda Makulec",
      "start": 1576010,
      "text": "Eight years. They weren't. They ran it for eight years. Yep.",
      "id": "ep_166_ut_58"
    },
    {
      "end": 1591740,
      "speaker": "Moritz Stefaner",
      "start": 1578482,
      "text": "Yeah. And then there was break and now dvs took over or in cooperation with the original team. Right. Yeah, it's rebooting it, which is exciting.",
      "id": "ep_166_ut_59"
    },
    {
      "end": 1600272,
      "speaker": "Amanda Makulec",
      "start": 1592480,
      "text": "Well, and aren't you the all time award winner, Moritz? Haven't you won more IIB awards than any other practitioner? Is that wrong?",
      "id": "ep_166_ut_60"
    },
    {
      "end": 1600944,
      "speaker": "Moritz Stefaner",
      "start": 1600416,
      "text": "Maybe.",
      "id": "ep_166_ut_61"
    },
    {
      "end": 1649912,
      "speaker": "Amanda Makulec",
      "start": 1601032,
      "text": "Maybe you hold some kind of like Michael Phelps type record. Information design. Yeah. No, the awards ran from 2012 to 2019. Funny enough, I actually got to attend the 2019 awards ceremony because I had been a shortlist judge. So I'm now very even more grateful that I had the opportunity to do that and see how the ceremony was run and everything else now that we've taken up that mantle ourselves. But, I mean, dvs started brainstorming around this question of how do we celebrate the incredible work happening in the data visualization field? What does that look like? What is the existing landscape of awards look like? Because IIB is not the only one. There was also, like, Malofiej for data journalism and other design awards, but this.",
      "id": "ep_166_ut_62"
    },
    {
      "end": 1656800,
      "speaker": "Moritz Stefaner",
      "start": 1649936,
      "text": "One is also cancelled, I think. So there's actual shortage right now.",
      "id": "ep_166_ut_63"
    },
    {
      "end": 1719580,
      "speaker": "Amanda Makulec",
      "start": 1656880,
      "text": "Yeah, they do seem to be disappearing. And seeing how much time and labor honestly goes in the back end of running an awards program, like, I can understand why it's a really big undertaking for folks, but when we looked last year and we would get these funny tweets every so often because someone would flag up and say, is IIB or IIB awards? Are they going to come back? I miss them. They're so great. I love the entry showcase. I love exploring the long list of the awards and seeing these great examples of data visualization. And then someone would tag us on Twitter or somewhere else and be like, hey, could dataviz society maybe help make that happen? Nudge, nudge, wink, wink. And so we did do some internal brainstorming around. Like, does it make sense to reach out to David and to try to partner with or bring back an existing program with so much history and I think so much pressure to do it right and do it a certain way to think about creating our own awards program, what would that look like? And we ended up reaching.",
      "id": "ep_166_ut_64"
    },
    {
      "end": 1722276,
      "speaker": "Moritz Stefaner",
      "start": 1719640,
      "text": "There was even debate, should there be awards?",
      "id": "ep_166_ut_65"
    },
    {
      "end": 1725052,
      "speaker": "Amanda Makulec",
      "start": 1722348,
      "text": "Which I think, yeah, there's a lot of debate about that.",
      "id": "ep_166_ut_66"
    },
    {
      "end": 1735268,
      "speaker": "Moritz Stefaner",
      "start": 1725156,
      "text": "Like, should we even, like, single out a few works and, you know, and put them on a, on a pedestal and ignore all the other work that's going like, well.",
      "id": "ep_166_ut_67"
    },
    {
      "end": 1823576,
      "speaker": "Amanda Makulec",
      "start": 1735284,
      "text": "And I think, I think didn't Jon Schwabish, I think, had an article that came out the same week we announced the official return of the awards saying, like, data visualization awards have had issues around the fact that we celebrate beauty at the expense sometimes of accuracy and analysis and other things like that. And so I think there are some very fair criticisms. But one of the things I will say that we loved about the award structure and are excited to maintain and move forward is, I think the information is beautiful awards don't just celebrate like the best in show gold, silver, bronze winners. By the nature of the structure of the program where the submissions are down, selected to this long list of amazing examples of different data visualizations, then to a shortlist, then to awarding the winners. You really celebrate and amplify the work of a much broader group of practitioners and people, and you build out this entry showcase over time that we're maintaining and updating and are adding to this year that I've heard from educators and others gets used often as a point of inspiration and getting ideas for students and practitioners. Practitioners. And so continuing to build out that repository of knowledge in my mind is so valuable and in some ways just feels more accessible than reading a lot of papers or other more academic content. It's a much more browsable space that gets people excited about what the world of Dataviz looks like.",
      "id": "ep_166_ut_68"
    },
    {
      "end": 1830712,
      "speaker": "Moritz Stefaner",
      "start": 1823728,
      "text": "Yeah. And I think that's absolutely true that this archive is even the bigger point almost than the individual winners, right?",
      "id": "ep_166_ut_69"
    },
    {
      "end": 1831016,
      "speaker": "Amanda Makulec",
      "start": 1830736,
      "text": "Yeah.",
      "id": "ep_166_ut_70"
    },
    {
      "end": 1860904,
      "speaker": "Moritz Stefaner",
      "start": 1831088,
      "text": "Because where else do we have, like over the years this huge archive of all kinds of data was work we have visual complexity.com is great for more network related stuff. They used to be infostatics.com, which was more on the data art side of things, but all of these are like blogs or archives run by individuals and don't have that sustainability again as something run by a society.",
      "id": "ep_166_ut_71"
    },
    {
      "end": 1942246,
      "speaker": "Amanda Makulec",
      "start": 1861092,
      "text": "Yeah. And we hope that there's a lot of enthusiasm and we've seen it so far from the community around having a very kind of community led opportunity to get more involved in the awards, we've expanded out the committee of people I know, Moritz, you've given some of your valuable time to this endeavor around how do we create additional transparency and criteria around how judging happens and how the different lists are determined. And so thinking about ways in which we can both celebrate the awards themselves, but also continue to build this central space that, but to your point on, like, you could go one place for data art or one place for network analysis or something else. To be able to browse and see the diversity of work that happens in this field I think is really exciting and one of the best things that comes out of this awards program each year. So we're really excited to think about kind of what evolving what that looks like is you'll see if someone chooses to submit. This year we have some additional fields that we've asked for information on, like the tech stacks that were used so that someone can actually potentially browse a more tagged repository of like what are some really interesting examples of, say, humanitarian related data visualizations that made the long list that were built in D3 or using D3 as one of the components. And so looking forward towards ways that we can continue to build this as an educational resource for folks.",
      "id": "ep_166_ut_72"
    },
    {
      "end": 1969712,
      "speaker": "Enrico Bertini",
      "start": 1942398,
      "text": "And Amanda, is the award going to be pretty much very similar or the same to how it used to be, or there are new components, new elements, how is it going to work? And especially maybe for people who are listening, who don't know more about the awards, I think they would be interested in listening, how to submit or how to participate somehow that would be useful to know.",
      "id": "ep_166_ut_73"
    },
    {
      "end": 2133506,
      "speaker": "Amanda Makulec",
      "start": 1969896,
      "text": "Yeah. So as we thought about and looked at what this year's awards program would be, we wanted to not, and we would have have partnered with IIB and looked to bring back this awards program if we wanted to entirely reinvent them. Right. So we kept some of the same. We've tried to think about how do we continue to evolve the program to kind of meet where we are as a data visualization community. So some of the most notable changes are some of the new categories. We've added a category for business analytics that probably celebrates more functional design and visualization versus, versus the aesthetically beautiful design and visualization. And we've updated some of the other categories to be a bit more concrete and specific. For example, maps, places and spaces is now places, spaces in the environment. Science, technology is now science, technology, and health. And because of the nature of what the last couple of years have looked like, we've decided that we wanted to introduce an annual category that was topical, so that, for example, every science, technology and health submission is not about Covid-19 we actually have a special category for Covid-19 related data visualizations. So we wanted to create space for that and to celebrate those kind of things. And so we've looked at revising some of the categories, revising and updating, not totally reinventing. We'll continue to have some of the same special awards around most beautiful, outstanding studio, impressive individual, rising star. But we've also added three new special awards that will open for nominations later in September around impactful community leader, recognizing the labor and time and work that goes into really nurturing the data visualization community in the industry at large. One for exemplary book to celebrate some of the amazing books that people write that don't clearly fit into a category as a visualization submission and a test of time category inspired by some of the work that happens at IEEE that says, you know, there are certain things that just have such longevity in how they influence how we design charts and graphs and visualizations. Let's recognize those things for their longevity. And so one of the curious questions we've had ourselves is how big will the submissions pool be this year? Because we want it to be inclusive to folks who built amazing things back in 2020 and 2021. So the timeline for what is eligible to be submitted is from September 1, 2019, when the last awards cycle closed through August 31 of 2022. So there's three years of a Runway. So I'm hoping what this means is people pick their best, the best of the past three years.",
      "id": "ep_166_ut_74"
    },
    {
      "end": 2135682,
      "speaker": "Moritz Stefaner",
      "start": 2133538,
      "text": "Not three times as much, but three times better.",
      "id": "ep_166_ut_75"
    },
    {
      "end": 2241630,
      "speaker": "Amanda Makulec",
      "start": 2135746,
      "text": "Not three times as much, though. It's a tough balance, right? Because we want to see some of the incredible work that's happened. So if folks are interested in submitting their work, submissions happen through the IIB Awards website, which we can certainly share links to where you can go ahead and submit your work. There are small fees that help with the overall costs of running the award program and the awards event and managing and maintaining the website and all of those components that go towards different sizes of studios or organizations. But members of the public and students who have non commissioned work can submit their work for free. There's no cost there. We've introduced a lower cost tier for those studios who are in low and middle income countries. And there's an option that if anyone finds any of the fees to be an impediment to submitting their work for consideration or inclusion, that they can message us about a fee waiver, which is similar to what we've done with our outlier conference and other events, with the goal that we don't want money to be the reason that we don't get to celebrate someone's great work. So people are able to submit and the submissions are open through September 18. So we're excited to see what comes in for those award submissions. And even if you're not yourself, someone who is going to submit work in these special category awards, when the nominations process opens for impactful community leader or exemplary book, those are open for others to nominate someone else and say, I'd like to nominate this book that I found really impactful for this reason. And we'll still have the community vote opportunity where people can vote on what their kind of favorite visualization of. I mean, it's hard to say it, but the past three years was from all of the amazing shortlistes that I'm sure that we'll have down selected when we hit October.",
      "id": "ep_166_ut_76"
    },
    {
      "end": 2262318,
      "speaker": "Enrico Bertini",
      "start": 2241790,
      "text": "And Amanda, I have to ask that. Do you ever plan to have something that is more research related? I have a suggestion, but so I think what if I had to pick, I would try to come up with an award for research work that has an impact for practitioners. What do you think about that?",
      "id": "ep_166_ut_77"
    },
    {
      "end": 2336040,
      "speaker": "Amanda Makulec",
      "start": 2262454,
      "text": "I think it's a really interesting idea. It's one, I think, that came up in some of our category brainstorms and I think is on the list of things explore for next year around this idea of kind of how do we celebrate things that really are great for translating research and academic ideas into practice? Like what does that look like, that research to practice funnel? And so I think that those kind of things are interesting. I think one of the challenges we've found as we started to brainstorm all the ways the categories could grow is what are the boundaries around what the information is beautiful awards are in terms of celebrating examples and actual tangible data visualizations versus all of the other pieces of our community and the work that we do. And so I don't know that we've fully kind of come around to what those boundaries necessarily are. We wanted to run the awards program without too many dramatic changes this year, of course, so we'll certainly be looking for feedback from folks on ideas on how we can continue to build on this as a central celebration of data visualization as a field that isn't just about beauty and aesthetics, but is about kind of the ways in which data visualization influences our lives these days and the impact it has on the broader society.",
      "id": "ep_166_ut_78"
    },
    {
      "end": 2376702,
      "speaker": "Enrico Bertini",
      "start": 2336340,
      "text": "Yes, I'm glad to hear that you've been discussing that. I guess. As you know, I really care a lot about building bridges between practitioners and academia, and I think the more we can do in that sense, the better it is for everyone, both for academics and for practitioners. And I have a sense that probably the awards are going to be transformed over time according to what you learned within DVS. So I'm really excited to see what will be the future developments of the awards. I'm sure that we're going to see some really, really interesting developments.",
      "id": "ep_166_ut_79"
    },
    {
      "end": 2410796,
      "speaker": "Amanda Makulec",
      "start": 2376806,
      "text": "I hope so. And I think it's been a really interesting learning experience getting in the weeds of the process of running the awards on the back end and all the other things this year. And I cannot overstate my gratitude towards David McCandless and his team members who have been so kind and generous with sharing their knowledge and expertise and ideas and being open to the idea that the awards can continue to evolve and we can celebrate the history that they've created while at the same time going ahead and seeing how they evolved to meet the needs of who we are as an industry today.",
      "id": "ep_166_ut_80"
    },
    {
      "end": 2436188,
      "speaker": "Enrico Bertini",
      "start": 2410948,
      "text": "Yeah, absolutely. So I was thinking maybe we can now talk a little bit about more broadly. I mean, I don't know if it's, if it's easy to do, it's probably very hard. Maybe we can talk about the data vis scene, what, what happened in, in the last few years. Right. We haven't been recording data stories for at least one year and something. Right. What happened?",
      "id": "ep_166_ut_81"
    },
    {
      "end": 2437556,
      "speaker": "Moritz Stefaner",
      "start": 2436284,
      "text": "Totally out of the loop.",
      "id": "ep_166_ut_82"
    },
    {
      "end": 2462980,
      "speaker": "Enrico Bertini",
      "start": 2437708,
      "text": "We are totally out of the loop. Right. And I guess from, from, from the DVS perspective, maybe you have a better sense of what has been happening during this, this long time. Is there anything big, or maybe some big shifts that happen in this long time? Anything that stands out? What's going on? What's going on?",
      "id": "ep_166_ut_83"
    },
    {
      "end": 2715686,
      "speaker": "Amanda Makulec",
      "start": 2464120,
      "text": "I think it's been such an interesting and curious couple of years of evolution of what this field looks like, in part because of how, I mean, in the spotlight, data visualization has been, and data visualization continues to be. You take a very narrow slicer example of the ways in which newsrooms are growing their data journalism teams in a time when other staff is shrinking inside of newsrooms or organizations because there's such a demand for more visual information and ways to engage with information in that way. And I think that as we think about what the field as a whole looks like, what we've seen, looking at the different career paths and the different opportunities, there is more intersection and opportunities for people to collaborate across different areas. More interest in bringing more, say, UX and agile software principles into data visualization development and dashboard design. More conceptualization of the data visualizations we build as being data experiences rather than just being charts or graphs or dashboards, and how we create those kind of immersive experiences with some people really pushing the envelope on what that looks like from a tech encoding perspective, from a creativity perspective, and what that might look like in the future. And so it's exciting to see the ways in which, I think our field has so much innovation happening around creativity and coding, but also how to create better experiences for folks who are using data in more functional, practical ways inside of running businesses or making public health decisions, for example. And so I think we've seen a push towards that framing of what data looks like as we talk about things like sonification and physicalization of data, that it's not just about the visual components, it's about the ways in which we experience information. That has always made me think recently, as I've reflected on this question in a couple other contexts around kind of three key things that have come up a lot in conversations as areas of growth and interest, and things we should probably understand and dig into more around accessible data visualization, design and accessibility, which we have a group within dvs that's been doing some incredible work under Frank Elavsky's leadership, bringing together resources around Dataviz accessibility, visualizing uncertainty in some of the work that's happening with Jessica Hullman and Matthew Kay's work out of Northwestern, but also with folks like Leah Picka out of California, looking at how we communicate uncertainty through a lens oftentimes of COVID and the pandemic, where data was very complex and uncertain, but that was not always well communicated in the very finite charts and graphs and dashboards people produced. And then thinking about data humanism and the ways in which we've talked a lot about how we visualize complex topics like death and loss and death at a certain scale with Covid-19 and other components like that. And going back to some of Giorgia Lupi's principles around data humanism and thinking about data as people, not just data as numbers. And we've seen that in the ways in which people are using more text and story components, like Alyssa Faure's 1 million deaths article in the Washington Post, where they had short snippets or sentences about people who had died from COVID that just ended abruptly in the same way that you think about a life ending abruptly. And so I think that there's been some really interesting reflections around how do we approach those kind of visual displays from a more empathetic and humanist perspective and a YDE less functional one. And it's almost in conflict with the how do we display uncertainty better and communicate more kind of concrete information more specifically. So those kind of three things are things I think I've seen a lot of conversations about, and I'm excited to continue to dive into around accessibility, uncertainty, visualization and data humanism, and what we come out of as an industry coming out of the pandemic and tackling other big, chewy, complex topics like climate.",
      "id": "ep_166_ut_84"
    },
    {
      "end": 2784432,
      "speaker": "Moritz Stefaner",
      "start": 2715798,
      "text": "Yeah, that seems to point all into a more holistic look at what's actually happening when people consume information, right. And all the different ways this can happen, and really thinking outside the boundaries of a single chart and if you should make the axis in a certain way or not. Right. And I was just reminded, I totally forgot that. But I gave a keynote at Eurovis that also pretty like it's an academic conference and I also try to bring this perspective of a designer who thinks a lot about what's happening between the lines and what is the tone of a visualization, what is the emotional like content of a visualization. And finally, something that also, I'm still not understanding properly, but where I think we need much more research is what the medium of data visualization is like, actually, and what it means to like, what makes that medium specific compared to other media, or also how we can relate it to other media, like text or illustrations and so on. Right. And I think this whole media theory of database is really in its infancy, probably well.",
      "id": "ep_166_ut_85"
    },
    {
      "end": 2980890,
      "speaker": "Amanda Makulec",
      "start": 2784456,
      "text": "And I think some of the work, too, around how we consume that information and how it gets misused and misrepresented, like Crystal Lee's work out of MIT, around the ways in which data visualization in charts and graphs were used to fuel anti mask sentiment. I know I've had some of my own challenges and issues with some of our own stories of loss personally around anti vaccine advocates misusing and misrepresenting information in different ways. And so I think there's a lot of ways in which we have to think about the fact that data visualization also isn't always used for improving understanding and sharing objective science, and instead can be used to misrepresent information and mislead people. And I think it's important that we recognize that as practitioners, but approach it from a place of empathy and understanding, that a lot of the people consuming those misleading graphics are not people who are mal intentioned and want to misunderstand information, but are just being misled by someone else who created those things. And so how do we hold those creators more accountable? And it's something I've talked a lot, a lot with misinformation researchers related to a lot of anti vaccine sentiment issues around. You have to meet people with a certain sense of empathy and understanding of what their level of. I mean, in some cases, data literacy or graphic essay might be in terms of understanding and interpreting charts and graphs, or how easily misled people can be by stories that, you know, you hear one or two stories or anecdotes that scare you about a negative outcome from a health intervention or something else. No amount of population data and no chart is going to knock that story out of your mind because of the ways in which stories just prompt this emotive response from humans. And so I think we have to be realistic about the fact that our data work has to also consider that stories are a way that we connect people to information. And I mean, it's well aligned, I think, to the title of your podcast here in terms of thinking about kind of data and storytelling together. And there are folks like Joss Fong who have done incredible work trying to weave together personal stories of people throughout the pandemic, and some of their own decision making and choices related to some of the polarization, especially in the US, across political lines, around decisions, around uptake of vaccines or behavior change in the pandemic context, and weaving together stories and hearing from people, both people who themselves were impacted by loss or by Covid, and from some of the researchers at places like the Kaiser Family foundation or Pew Research, who are the people collecting and curating and creating the data. And I think, I hope that one of the things that dvs does well and that podcasts like this and other spaces do is they help to shine a light on the fact that there are humans and people who are building these charts and graphs. And the more that you kind of understand who the creators are behind those charts and graphs, it's not just kind of an amorphous media outlet or something else like that. The more you can develop a sense of trust with a broader public around trusting the designers and creators. And I'm curious to see what that looks like as our industry evolves, too, and we have more people who are out there talking about their processes and how they approach this kind of work.",
      "id": "ep_166_ut_86"
    },
    {
      "end": 3003530,
      "speaker": "Moritz Stefaner",
      "start": 2981020,
      "text": "Yeah. Yeah, it totally resonates with me. It's one of my biggest professional frustrations, but also inspirations that it's not enough to just make. Take a data set and make a nice chart out of it. It's never enough. And in a way, it's also good because it challenges us to really think about what happens when people encounter it.",
      "id": "ep_166_ut_87"
    },
    {
      "end": 3014074,
      "speaker": "Amanda Makulec",
      "start": 3004350,
      "text": "And then, Enrico, didn't you have that wonderful article about looking beyond the scatter plot and thinking beyond precision driven visualizations? Am I accrediting the wrong paper to you?",
      "id": "ep_166_ut_88"
    },
    {
      "end": 3122636,
      "speaker": "Enrico Bertini",
      "start": 3014162,
      "text": "No, you are. Is the right one. And I was in fact, going to mention that this broad trend that you've been mentioning here, that is mostly going beyond a single chart. Right. It also describes very well how my intellectual journey within this space has been developing over time. Right. I can definitely see it within myself. The two things. One is the idea that the problem is so much larger than getting the single chart right, and the single chart for the data. It doesn't make any sense. I used to think that you have to find the right visual representation for the data. That's not the way it works. And, and also, in general, the idea that understanding how a piece of how a visualization and what is around it impacts the way a person processes this information. Right. It's never only the visuals. I was actually thinking the other day that these visuals are never like, isolated any other. There's always how to say that there's always something around a visualization, a cultural background, or there's always something around it, right. Even physically. Right. It can be text in a piece of paper, can be text in a presentation, can be a presenter on stage, can be so many other. Can be a movie, a video. Right. It's never like that. The single chart is. And it's never one single chart, by the way. So it's so much more complex in a way. It's frightening. But I think it's also really interesting.",
      "id": "ep_166_ut_89"
    },
    {
      "end": 3123316,
      "speaker": "Moritz Stefaner",
      "start": 3122668,
      "text": "It's infinite.",
      "id": "ep_166_ut_90"
    },
    {
      "end": 3124372,
      "speaker": "Enrico Bertini",
      "start": 3123388,
      "text": "Yeah, yeah.",
      "id": "ep_166_ut_91"
    },
    {
      "end": 3171416,
      "speaker": "Moritz Stefaner",
      "start": 3124396,
      "text": "I'm thinking a lot about the warming stripes. And we had Ed Hawkins on the show because we were fascinated by that visual. And I think a part of the fascination is, I think technically it's one of the charts where a student of yours, Enrico, would produce it, you might say, well, you know, the color encoding is maybe not the best for that type of position. And then it becomes this runaway success and it becomes like an icon or a symbol or a logo, and it develops this life of its own, right? And how these things happen is so fascinating and interesting and not well explained by data visualization theory, you know, and I think that's so fascinating. And that's where you see there still. We need to learn so much more still, right?",
      "id": "ep_166_ut_92"
    },
    {
      "end": 3216592,
      "speaker": "Amanda Makulec",
      "start": 3171488,
      "text": "Oh, it's such a curious example, though, because, Enrico, you point to every chart or graph usually being wrapped in some kind of context, in an article, in a paper, in a video. And then you point to the warming stripes that you see getting used almost as like aesthetic art as the background of the front of a paper. Right? And so it's curious because I think the other piece of that is that something I talk about a lot with researchers and public health folks is we can't rely on an assumption that someone's going to read the in depth footnotes on a graphic because of the fact that people will screenshot and pull a figure off of a paper by itself out of that context and post it on social media or other annotations on.",
      "id": "ep_166_ut_93"
    },
    {
      "end": 3218416,
      "speaker": "Moritz Stefaner",
      "start": 3216616,
      "text": "Top in MS paint, right?",
      "id": "ep_166_ut_94"
    },
    {
      "end": 3279660,
      "speaker": "Amanda Makulec",
      "start": 3218568,
      "text": "Yeah. And it's. Well, I think one of the complicating factors is just the ways in which things move through social media these days that mean that you don't always get the context. And so you have this curious space where we are doing so much more in terms of building these immersive, multi chart type articles or videos or other things like that. And at the same time, people are so much more apt to grab a screenshot of a single graphic or a single point within a larger, a larger product and share it without that context. And that makes it easy to fall into that space where you can be misled or misunderstood, understand what that data visualization is trying to lead you towards. And so I think it's where some of the principles around better text annotations on the charts themselves, clearer headlines and titles that are not so academic in nature. I think that the shift that direction is really powerful and helpful because it helps people interpret and understand what you mean to say in the chart itself and not relying on someone's own interpretation and understanding of it.",
      "id": "ep_166_ut_95"
    },
    {
      "end": 3287950,
      "speaker": "Moritz Stefaner",
      "start": 3280330,
      "text": "Wow. So it's 2022. We live in a post data, post vis, hopefully not post society post vis.",
      "id": "ep_166_ut_96"
    },
    {
      "end": 3291714,
      "speaker": "Amanda Makulec",
      "start": 3288450,
      "text": "What will we all be doing? We can't live in a post vis world.",
      "id": "ep_166_ut_97"
    },
    {
      "end": 3300498,
      "speaker": "Moritz Stefaner",
      "start": 3291842,
      "text": "Everything's post modern these days. Crazy, but it's great. So we have five new episode topics. Enrico, isn't that amazing?",
      "id": "ep_166_ut_98"
    },
    {
      "end": 3301130,
      "speaker": "Enrico Bertini",
      "start": 3300674,
      "text": "Right?",
      "id": "ep_166_ut_99"
    },
    {
      "end": 3301666,
      "speaker": "Amanda Makulec",
      "start": 3301210,
      "text": "Exactly.",
      "id": "ep_166_ut_100"
    },
    {
      "end": 3304666,
      "speaker": "Moritz Stefaner",
      "start": 3301698,
      "text": "Amanda, you laid out the rest of the year for us. That's great.",
      "id": "ep_166_ut_101"
    },
    {
      "end": 3313668,
      "speaker": "Amanda Makulec",
      "start": 3304698,
      "text": "There we go. Every single person I have mentioned I would say would make an excellent, an excellent guest for a data stories podcast episode.",
      "id": "ep_166_ut_102"
    },
    {
      "end": 3317320,
      "speaker": "Moritz Stefaner",
      "start": 3313764,
      "text": "Yeah. Here we go. Enrico, we're busy now.",
      "id": "ep_166_ut_103"
    },
    {
      "end": 3333728,
      "speaker": "Enrico Bertini",
      "start": 3317820,
      "text": "Yeah, we have so many. Yeah, I think we can probably wrap it up here. I guess we could go on forever now, but. Yeah, maybe that's part one. We should do a part two sometime.",
      "id": "ep_166_ut_104"
    },
    {
      "end": 3334656,
      "speaker": "Moritz Stefaner",
      "start": 3333884,
      "text": "That's true.",
      "id": "ep_166_ut_105"
    },
    {
      "end": 3337640,
      "speaker": "Enrico Bertini",
      "start": 3334768,
      "text": "To see. To see what happened in the meantime. Right.",
      "id": "ep_166_ut_106"
    },
    {
      "end": 3344624,
      "speaker": "Amanda Makulec",
      "start": 3337760,
      "text": "Well, have to come back and celebrate who the big winners are for the IIB awards. Exactly. The three year Runway.",
      "id": "ep_166_ut_107"
    },
    {
      "end": 3345500,
      "speaker": "Moritz Stefaner",
      "start": 3344752,
      "text": "Yeah.",
      "id": "ep_166_ut_108"
    },
    {
      "end": 3352608,
      "speaker": "Enrico Bertini",
      "start": 3345960,
      "text": "Is there gonna be a big party? I used to be. I remember the one I participated to was. It was amazing.",
      "id": "ep_166_ut_109"
    },
    {
      "end": 3422400,
      "speaker": "Amanda Makulec",
      "start": 3352704,
      "text": "We are, we're holding the awards ceremony this year in the states because of us being a us based organization. I'm sorry for those in Europe who have a little bit of a farther travel if they so chose to travel. But the awards ceremony itself will be November 30 here in Washington, DC. And to your point on how DVS runs as an organization, we have a critical mass of multiple board members, all based in the Washington DC area, who can help make sure that it all gets off the ground and happens. So we'll be celebrating and having that big celebration here in DC on November 30. Will also be, for the first time, doing a live stream from the awards ceremony so that folks who want to participate and join in or watch the recording later are welcome to do so. And hopefully it allows more people to join into that celebration this year than they have been able to in the past. So we're really excited about that. We're working on some ideas around some distributed watch parties for places where it's not the middle of the night, and going ahead and making sure that we find ways to engage folks and help everyone have the opportunity to celebrate the great work from the past three years.",
      "id": "ep_166_ut_110"
    },
    {
      "end": 3445828,
      "speaker": "Enrico Bertini",
      "start": 3422820,
      "text": "Well, Amanda, thanks so much. I'm so happy that you helped us kind of like go back to get a sense of what is happening in Dataviz. And also, thanks so much to you and the whole DVS team for what you do. I think this is really remarkable and it's a great service to the community.",
      "id": "ep_166_ut_111"
    },
    {
      "end": 3464988,
      "speaker": "Amanda Makulec",
      "start": 3445964,
      "text": "Thank you. Well, and we appreciate all the engagement from all of our community members, and we wouldn't be the organization we are without all the people who contribute to those slack conversations and fireside chats and everything else. So thank you to folks like you who helped to continue to keep a voice of data visualization alive and talking about interesting things.",
      "id": "ep_166_ut_112"
    },
    {
      "end": 3466892,
      "speaker": "Enrico Bertini",
      "start": 3465124,
      "text": "Okay, thanks so much, Amanda.",
      "id": "ep_166_ut_113"
    },
    {
      "end": 3496290,
      "speaker": "Moritz Stefaner",
      "start": 3466996,
      "text": "Thanks for joining us. See you soon. Hey folks, thanks for listening to data stories again. Before you leave, a few last notes. This show is crowdfunded and you can support us on patreon@patreon.com Datastories, where we publish monthly previews of upcoming episodes for our supporters. Or you can also send us a one time donation via PayPal at PayPal Dot me Datastories or as a free.",
      "id": "ep_166_ut_114"
    },
    {
      "end": 3523838,
      "speaker": "Enrico Bertini",
      "start": 3496330,
      "text": "Way to support the show. If you can spend a couple of minutes rating us on iTunes, that we be very helpful as well. And here's some information on the many ways you can get news directly from us. We are on Twitter, Facebook and Instagram, so follow us there for the latest updates. We have also a slack channel where you can chat with us directly. And to sign up, go to our home page at Datastory ES and there you'll find a button at the bottom of the page.",
      "id": "ep_166_ut_115"
    },
    {
      "end": 3531894,
      "speaker": "Moritz Stefaner",
      "start": 3523974,
      "text": "And there you can also subscribe to our email newsletter if you want to get news directly into your inbox and be notified whenever we publish a new episode.",
      "id": "ep_166_ut_116"
    },
    {
      "end": 3544518,
      "speaker": "Enrico Bertini",
      "start": 3531982,
      "text": "That's right, and we love to get in touch with our listeners. So let us know if you want to suggest a way to improve the show or know any amazing people you want us to invite or even have any project you want us to talk about.",
      "id": "ep_166_ut_117"
    },
    {
      "end": 3550414,
      "speaker": "Moritz Stefaner",
      "start": 3544654,
      "text": "Yeah, absolutely. Don't hesitate to get in touch. Just send us an email at mailatastory.",
      "id": "ep_166_ut_118"
    },
    {
      "end": 3555200,
      "speaker": "Enrico Bertini",
      "start": 3550542,
      "text": "Yes, that's all for now. Hear you next time. And thanks for listening to data stories, Facebook.",
      "id": "ep_166_ut_119"
    }
  ],
  "confidence": 0.937642057070258,
  "audio_duration": 3564,
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_status_code": null,
  "webhook_auth": false,
  "webhook_auth_header_name": null,
  "speed_boost": false,
  "auto_highlights_result": null,
  "auto_highlights": false,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_audio_quality": null,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "content_safety": false,
  "iab_categories": true,
  "content_safety_labels": {
    "status": "unavailable",
    "results": [],
    "summary": {}
  },
  "language_detection": false,
  "language_detection_threshold": null,
  "language_confidence": null,
  "custom_spelling": null,
  "throttled": false,
  "auto_chapters": true,
  "summarization": false,
  "summary_type": null,
  "summary_model": null,
  "custom_topics": false,
  "topics": [],
  "speech_threshold": null,
  "speech_model": "best",
  "chapters": [
    {
      "summary": "This is a new episode of data stories. We talk again about data visualization, analysis, and generally the role data plays in our lives. Our podcast is listener supported, so there's no ads. If you enjoy the show, please consider supporting us with recurring payments or a one time donation.",
      "gist": "Data Stories",
      "headline": "This podcast is listener supported, so there's no ads",
      "start": 680,
      "end": 132868,
      "id": "ep_166_ch_0"
    },
    {
      "summary": "Enrico: I moved to northeastern in Boston last January. In the meantime, I had the courage of starting a newsletter. I surprisingly, I guess, write about Dataviz and data in general. There's a lot going on here.",
      "gist": "A little about Dataviz and Boston",
      "headline": "Enrico moved to northeastern in Boston last January",
      "start": 132924,
      "end": 226956,
      "id": "ep_166_ch_1"
    },
    {
      "summary": "Moritz will be starting a new course next week on visualization for machine learning. Currently working on a large project for World Health Organization on a data design system. Also working with the German Foreign Office on climate related projects.",
      "gist": "Projects and the challenges",
      "headline": "Moritz will start a new course on visualization for machine learning next week",
      "start": 227068,
      "end": 412120,
      "id": "ep_166_ch_2"
    },
    {
      "summary": "Today we're joined by Amanda Makulec. She'll bring us up to speed on what's going on in the database world right now. Can you tell us a bit about our listeners? Sure.",
      "gist": "Dataviz: A Reboot",
      "headline": "Amanda Makulec joins us to talk about Dataviz news",
      "start": 412200,
      "end": 455852,
      "id": "ep_166_ch_3"
    },
    {
      "summary": "Amanda McCullough is the executive director of the Global Data Visualization Society. DVS is a global professional association for Dataviz practitioners and enthusiasts. Over 22,000 people have registered with the society since it launched three and a half years ago. The organization has three key goals: nurturing, celebrating, and advancing data visualization.",
      "gist": "The Global Data Visualization Society's future",
      "headline": "Amanda McCullough is the executive director for the Global Data Visualization Society",
      "start": 455956,
      "end": 860990,
      "id": "ep_166_ch_4"
    },
    {
      "summary": "State of the industry survey is open in September for responses from anyone who works in data visualization. Right now we're rebooting and starting up some geographically affiliated groups through DVS. I think we'll continue to see a lot of emphasis on creating more decentralized opportunities for people to connect locally.",
      "gist": "Dataviz Society: State of the Industry Survey",
      "headline": "State of the industry survey is open to anyone who works in data visualization",
      "start": 861770,
      "end": 1174518,
      "id": "ep_166_ch_5"
    },
    {
      "summary": "Is it sustainable to run a society like DVSS? You can only grow so big and do so much without some paid time and support. DVSS has launched options for paid membership tiers. We're grateful to everyone who supports us.",
      "gist": "How Do You Run a Nonprofit Society?",
      "headline": "Is it sustainable to run a society like this? And I think it's amazing",
      "start": 1174694,
      "end": 1591740,
      "id": "ep_166_ch_6"
    },
    {
      "summary": "The IIB data visualization awards ran from 2012 to 2019. Dataviz Society has revived the awards to celebrate the work of data visualization practitioners. There was debate over whether there should be awards. But the organization is excited to maintain and move forward.",
      "gist": "The IIB Data Visualization Awards",
      "headline": "The IIB data visualization awards ran from 2012 to 2019",
      "start": 1592480,
      "end": 2241630,
      "id": "ep_166_ch_7"
    },
    {
      "summary": "Do you ever plan to have something that is more research related? I think what if I had to pick, I would try to come up with an award for research work that has an impact for practitioners. The awards are going to be transformed over time according to what you learned within DVS.",
      "gist": "The Data Visualization Awards",
      "headline": "Amanda: Do you ever plan to have something that is more research related",
      "start": 2241790,
      "end": 2412268,
      "id": "ep_166_ch_8"
    },
    {
      "summary": "There is more intersection and opportunities for people to collaborate across different areas. More interest in bringing more, say, UX and agile software principles into data visualization development and dashboard design. More conceptualization of the data visualizations we build as being data experiences.",
      "gist": "WSJD Live: Data Visualization Field's Evolution",
      "headline": "Data visualization has been in the spotlight in recent years",
      "start": 2412404,
      "end": 2576040,
      "id": "ep_166_ch_9"
    },
    {
      "summary": "Three key things we should understand and dig into more around accessible data visualization, design and accessibility. How we communicate uncertainty through a lens oftentimes of COVID and the pandemic. And thinking about data as people, not just data as numbers. Those kind of three things are things I'm excited to dive into.",
      "gist": "Accessibility, Data visualization, and Data Humanism",
      "headline": "Three areas of interest in data visualization are accessibility, uncertainty and data humanism",
      "start": 2578290,
      "end": 2755170,
      "id": "ep_166_ch_10"
    },
    {
      "summary": "Enrico: Data visualization isn't always used for improving understanding and sharing objective science. Instead, it can be used to misrepresent information and mislead people. How do we hold those creators more accountable?",
      "gist": "How Data Visualization is Being Used to Misrepresent Science",
      "headline": "Enric: Data visualization can be used to misrepresent and mislead people",
      "start": 2755670,
      "end": 3123316,
      "id": "ep_166_ch_11"
    },
    {
      "summary": "Ed Hawkins: One of the complicating factors is just the ways in which things move through social media these days that mean that you don't always get the context. We can't live in a post vis world. Better text annotations on the charts themselves, clearer headlines and titles that are not so academic in nature.",
      "gist": "The 'Warming Stands'",
      "headline": "Ed Hawkins: The warming stripes are fascinating examples of data visualization success",
      "start": 3123388,
      "end": 3297098,
      "id": "ep_166_ch_12"
    },
    {
      "summary": "Every single person I have mentioned I would say would make an excellent, an excellent guest for a data stories podcast episode. I think we can probably wrap it up here. Maybe that's part one. We should do a part two sometime.",
      "gist": "Data Stories: Five New Topics for the Year",
      "headline": "So we have five new episode topics. Enrico, isn't that amazing",
      "start": 3297154,
      "end": 3337640,
      "id": "ep_166_ch_13"
    },
    {
      "summary": "The IIB awards ceremony will be November 30 in Washington, DC. Will also be, for the first time, doing a live stream from the awards ceremony. Working on some ideas around some distributed watch parties for places where it's not the middle of the night.",
      "gist": "The IIB Awards: The 3 Year Runway",
      "headline": "The IIB awards ceremony will be held November 30 in Washington, DC",
      "start": 3337760,
      "end": 3476162,
      "id": "ep_166_ch_14"
    },
    {
      "summary": "This show is crowdfunded and you can support us on patreon@patreon. com Datastories. We are on Twitter, Facebook and Instagram, so follow us there for the latest updates. Let us know if you want to suggest a way to improve the show.",
      "gist": "Thanks for listening to Datastory ES",
      "headline": "This show is crowdfunded and you can support us on patreon",
      "start": 3476346,
      "end": 3555200,
      "id": "ep_166_ch_15"
    }
  ],
  "disfluencies": false,
  "entity_detection": false,
  "sentiment_analysis": false,
  "sentiment_analysis_results": null,
  "entities": null,
  "speakers_expected": null,
  "summary": null,
  "custom_topics_results": null,
  "episode_num": 166,
  "episode_metadata": {
    "speakers": [
      "Amanda Makulec",
      "Moritz Stefaner",
      "Enrico Bertini"
    ],
    "WPid": "1648",
    "url": "https://datastori.es/podlove/file/6892/s/feed/c/mp3/166-catching-up-with-amanda-makulec.mp3",
    "episode_title": "Catching up with Amanda Makulec"
  }
}