{
  "id": "3da7864b-2cac-4a66-bf43-1821ff1d470c",
  "language_model": "assemblyai_default",
  "acoustic_model": "assemblyai_default",
  "language_code": "en_us",
  "status": "completed",
  "audio_url": "https://datastori.es/podlove/file/182/s/feed/c/mp3/Datastories-11.mp3",
  "utterances": [
    {
      "end": 21950,
      "speaker": "Enrico Bertini",
      "start": 17400,
      "text": "Hi, everyone. Data stories number eleven. Hi, Moritz, how are you?",
      "id": "ep_11_ut_0"
    },
    {
      "end": 25034,
      "speaker": "Moritz Stefaner",
      "start": 22062,
      "text": "Hi, Enrico. I'm doing great, thanks. How are you?",
      "id": "ep_11_ut_1"
    },
    {
      "end": 28174,
      "speaker": "Stephan Thiel",
      "start": 26434,
      "text": "Good, good, good.",
      "id": "ep_11_ut_2"
    },
    {
      "end": 30386,
      "speaker": "Moritz Stefaner",
      "start": 28754,
      "text": "You were not prepared for that question.",
      "id": "ep_11_ut_3"
    },
    {
      "end": 38018,
      "speaker": "Enrico Bertini",
      "start": 30450,
      "text": "No, no. There is still some sun outside and. Yeah, it's fine. It's fine.",
      "id": "ep_11_ut_4"
    },
    {
      "end": 40434,
      "speaker": "Moritz Stefaner",
      "start": 38066,
      "text": "Cool. You're still in Europe, which is.",
      "id": "ep_11_ut_5"
    },
    {
      "end": 42546,
      "speaker": "Enrico Bertini",
      "start": 40554,
      "text": "I'm still in Europe, which is good.",
      "id": "ep_11_ut_6"
    },
    {
      "end": 44082,
      "speaker": "Moritz Stefaner",
      "start": 42570,
      "text": "For Europe, but bad for you.",
      "id": "ep_11_ut_7"
    },
    {
      "end": 64840,
      "speaker": "Enrico Bertini",
      "start": 44138,
      "text": "Yeah. I don't know if these Americans really want me. Yeah. There is a delay in the visa process and I'm living in an empty apartment with my wife and three kids, one of whom is an infant. And it's a lot of fun, as you can imagine.",
      "id": "ep_11_ut_8"
    },
    {
      "end": 66632,
      "speaker": "Moritz Stefaner",
      "start": 65032,
      "text": "Finally enough room to play.",
      "id": "ep_11_ut_9"
    },
    {
      "end": 77944,
      "speaker": "Enrico Bertini",
      "start": 66768,
      "text": "Yeah, yeah. I took my inflatable bed from the basement and it's. Yeah, the kids really love it. How are you? How's it going?",
      "id": "ep_11_ut_10"
    },
    {
      "end": 85888,
      "speaker": "Moritz Stefaner",
      "start": 78024,
      "text": "I just came back from England from the cave. We set up the final sort of chapter of the Emoto project, which we will talk about today.",
      "id": "ep_11_ut_11"
    },
    {
      "end": 86536,
      "speaker": "Enrico Bertini",
      "start": 86016,
      "text": "Yeah.",
      "id": "ep_11_ut_12"
    },
    {
      "end": 108776,
      "speaker": "Moritz Stefaner",
      "start": 86640,
      "text": "And it was about visualizing the response to the games, London 2012, and just came back from setting up the installation part, sort of. We had an exhibit, physical exhibit and. Yeah, now I'm catching up. And next week. Oh, no, end of this week, going to Helsinki for the data cuisine workshop and open knowledge conference. So that should be fun too.",
      "id": "ep_11_ut_13"
    },
    {
      "end": 112528,
      "speaker": "Enrico Bertini",
      "start": 108920,
      "text": "So did you have any holidays or anything that resembled.",
      "id": "ep_11_ut_14"
    },
    {
      "end": 128994,
      "speaker": "Moritz Stefaner",
      "start": 112576,
      "text": "No, not really. I mean, this year was a bit unlucky with the holidays because of the Olympics, which were like right in summer, but I'll try and take a week off, end of October or something like that. I mean, I have lots of conferences now which are in a way also holidays.",
      "id": "ep_11_ut_15"
    },
    {
      "end": 154212,
      "speaker": "Enrico Bertini",
      "start": 129574,
      "text": "I am myself in this strange situation. I didn't have any real holidays because we were basically spending our holidays packing and selling stuff. We sold almost everything from our apartment. And then we discovered. Yeah, we had holidays on eBay. Yeah. Fortunately, Konstanz is quite nice. We have a lake that is quite close from our apartment, so we had some fun around.",
      "id": "ep_11_ut_16"
    },
    {
      "end": 155064,
      "speaker": "Moritz Stefaner",
      "start": 154268,
      "text": "That's something.",
      "id": "ep_11_ut_17"
    },
    {
      "end": 228324,
      "speaker": "Enrico Bertini",
      "start": 155764,
      "text": "Yeah. And what else? Yeah, I'm working on some this week stuff. This week is approaching quite soon and. Yeah, it's quite nice. We have. I'm organizing a workshop together with some people on visualization evaluation and it's quite. I think it's going to be quite cool. Fourth time that we organized that. And the workshop is called believe and I don't even remember anymore. What's the acronym for? It's more a legacy of the first one. It's quite convoluted kind of acronym. And. Yeah, I think it's going to be cool. And I'm also organizing a panel there on reproducibility in visualization research, which I think it's interesting for people, not only for academics, but also for people like you, Moritz, who, as I know, are interested in accessing not only papers, but also code and nice stuff from research. So I think it's an interesting topic to discuss there.",
      "id": "ep_11_ut_18"
    },
    {
      "end": 238224,
      "speaker": "Moritz Stefaner",
      "start": 228624,
      "text": "So the idea is that people publish not just the charts, but also the whole, everything. You need all the ingredients to reproduce. Yeah, visualization, I think that's a great idea.",
      "id": "ep_11_ut_19"
    },
    {
      "end": 289192,
      "speaker": "Enrico Bertini",
      "start": 238264,
      "text": "And there is actually a quite strong trend in computer science in general. Like, for example, in databases. At the SIGMOD conference, which is basically the leading conference in databases, they have this reproducibility initiative since two or three years, and they are quite advanced right now. So there are some niche niches where reproducibility already, it's already at a good stage. And some others, like visualization, where we are basically not too advanced. We are not even discussing too much about that yet. Anyway, the episode is not about that. We are going to talk about Emoto.",
      "id": "ep_11_ut_20"
    },
    {
      "end": 290256,
      "speaker": "Moritz Stefaner",
      "start": 289368,
      "text": "That's true.",
      "id": "ep_11_ut_21"
    },
    {
      "end": 296040,
      "speaker": "Enrico Bertini",
      "start": 290400,
      "text": "Which is. Yeah, maybe. Moritz, you want to introduce Emoto and our guest today?",
      "id": "ep_11_ut_22"
    },
    {
      "end": 301414,
      "speaker": "Moritz Stefaner",
      "start": 296112,
      "text": "Sure. Yeah. We have a special guest. Special guest, Stefan Thiel. Hi, Stefan.",
      "id": "ep_11_ut_23"
    },
    {
      "end": 301990,
      "speaker": "Enrico Bertini",
      "start": 301494,
      "text": "Hi, Stefan.",
      "id": "ep_11_ut_24"
    },
    {
      "end": 304414,
      "speaker": "Stephan Thiel",
      "start": 302022,
      "text": "Hi, everyone. Thanks for having me. Hi.",
      "id": "ep_11_ut_25"
    },
    {
      "end": 326054,
      "speaker": "Moritz Stefaner",
      "start": 304534,
      "text": "Pleasure as always. And Stefan was part of the design team. Some of you for Emoto, for the project, we'll talk about in a minute. He also did his bachelor's in Potsdam, so that's where we met. And I guess some of you might know him from the visualizing Shakespeare project, which was his degree project and where.",
      "id": "ep_11_ut_26"
    },
    {
      "end": 327454,
      "speaker": "Stephan Thiel",
      "start": 326134,
      "text": "Yeah, in 2010.",
      "id": "ep_11_ut_27"
    },
    {
      "end": 349774,
      "speaker": "Moritz Stefaner",
      "start": 327614,
      "text": "Yeah. And he did some really interesting text analysis on Shakespeare texts and made visualizations out of that. Big posters, interactives and. Yeah, that's correct. Yeah. And now he's part of studio NAND, the best computational design company in the world, as everybody knows, and was part of the.",
      "id": "ep_11_ut_28"
    },
    {
      "end": 353286,
      "speaker": "Stephan Thiel",
      "start": 349814,
      "text": "Probably not, but. Yeah, together with Jonas Law and Stefan Fiedler. And Stefan.",
      "id": "ep_11_ut_29"
    },
    {
      "end": 354926,
      "speaker": "Moritz Stefaner",
      "start": 353310,
      "text": "See, that's what I'm saying.",
      "id": "ep_11_ut_30"
    },
    {
      "end": 363164,
      "speaker": "Stephan Thiel",
      "start": 355070,
      "text": "You finally teamed up, and it's really exciting how it goes. Of course. Exciting time behind us with Emoto and stuff. Yeah.",
      "id": "ep_11_ut_31"
    },
    {
      "end": 366864,
      "speaker": "Enrico Bertini",
      "start": 363204,
      "text": "This is adding up to all the fees we get every time we have an episode.",
      "id": "ep_11_ut_32"
    },
    {
      "end": 392622,
      "speaker": "Moritz Stefaner",
      "start": 370044,
      "text": "So. Yeah, Emoto. Yeah, it's been a big thing for us. We've been working on that. I mean, it started like half last year in summer, like, to get the project going slowly and get some funds and so on. And since March, we knew we would be. We would get some funding and started working on it. So it's. It's been one of the big projects this year for all of us, I guess.",
      "id": "ep_11_ut_33"
    },
    {
      "end": 395662,
      "speaker": "Stephan Thiel",
      "start": 392798,
      "text": "Yeah. Really exciting one. And long term, definitely.",
      "id": "ep_11_ut_34"
    },
    {
      "end": 399234,
      "speaker": "Moritz Stefaner",
      "start": 395838,
      "text": "And lots of a multi headed hydra.",
      "id": "ep_11_ut_35"
    },
    {
      "end": 406606,
      "speaker": "Stephan Thiel",
      "start": 399774,
      "text": "Which was also the fun thing about it, to bring together so many components and so many pieces. But let's talk about them in detail.",
      "id": "ep_11_ut_36"
    },
    {
      "end": 410774,
      "speaker": "Enrico Bertini",
      "start": 406750,
      "text": "Yeah. From the outside, I must admit, it looks huge.",
      "id": "ep_11_ut_37"
    },
    {
      "end": 465902,
      "speaker": "Moritz Stefaner",
      "start": 410894,
      "text": "I mean, whenever you think you understood what it is, then there's an extra subpage somewhere. But let's try. Try and characterize what we did there. So the basic idea was. So there were the Olympic Games in London. We knew that before because they were sort of announced. And Drew Hammond, he's from Manchester, and he's running the future everything festival, and he's quite active, generally in digital media, organizing lots of different activities. And he had this idea, okay, we have the games. We need to do something, you know, to visualize the online response to the games, you know, not just the. Not just the tv feed where you see the athletes, and not just the live experience in the stadium, but what are all the people on the Internet, you know, saying as the events happen.",
      "id": "ep_11_ut_38"
    },
    {
      "end": 466518,
      "speaker": "Enrico Bertini",
      "start": 466038,
      "text": "Yeah.",
      "id": "ep_11_ut_39"
    },
    {
      "end": 487844,
      "speaker": "Moritz Stefaner",
      "start": 466606,
      "text": "So that was the starting point, really. And I think that the. At the beginning, the idea was really to capture the whole stadium atmosphere and the excitement of viewing, like, sports together. I think as the project progressed, we moved a bit away from that, towards a more analytical view and a more, say, more distant view, maybe, but I guess that was the starting point.",
      "id": "ep_11_ut_40"
    },
    {
      "end": 510186,
      "speaker": "Stephan Thiel",
      "start": 489624,
      "text": "So, basically, the initial commission was like, research for what might be interesting in terms of data. What kinds of data can you get from the Olympics and stuff like that. And also we tried to be really open about our focus there and played around with different scenarios. We were really open in the beginning, weren't we, Moritz?",
      "id": "ep_11_ut_41"
    },
    {
      "end": 520650,
      "speaker": "Moritz Stefaner",
      "start": 510250,
      "text": "Yeah. We also looked at processing tv streams, doing image analysis on tv images. Or we thought we could tune in all the radio stations of the world at once, you know?",
      "id": "ep_11_ut_42"
    },
    {
      "end": 529690,
      "speaker": "Stephan Thiel",
      "start": 520722,
      "text": "Yeah. Mix up and mash up all the tv streams and everything together, working with subtitles, or maybe sensors on location in the stadium and stuff like that.",
      "id": "ep_11_ut_43"
    },
    {
      "end": 533950,
      "speaker": "Enrico Bertini",
      "start": 529722,
      "text": "Okay, so you didn't start with the idea of analyzing Twitter feeds directly?",
      "id": "ep_11_ut_44"
    },
    {
      "end": 535422,
      "speaker": "Stephan Thiel",
      "start": 534062,
      "text": "No, not directly, no.",
      "id": "ep_11_ut_45"
    },
    {
      "end": 536006,
      "speaker": "Enrico Bertini",
      "start": 535478,
      "text": "Okay.",
      "id": "ep_11_ut_46"
    },
    {
      "end": 551422,
      "speaker": "Stephan Thiel",
      "start": 536110,
      "text": "We knew it would be there as an option, and it is really challenging and exciting to work with this data. And this is why we have headed in this direction, basically. But, yeah, we try to be really open and consider all other possibilities as well.",
      "id": "ep_11_ut_47"
    },
    {
      "end": 552742,
      "speaker": "Enrico Bertini",
      "start": 551518,
      "text": "Yeah. Okay, cool.",
      "id": "ep_11_ut_48"
    },
    {
      "end": 569664,
      "speaker": "Moritz Stefaner",
      "start": 552798,
      "text": "And, I mean, a big inspiration has, of course, always been, we feel fine. From Jonathan Harris. I mean, how could it not be? Right? But that was always us in the back of our minds. Okay, let's do. We feel fine. A bit cooler. Which is like a bad premise for any project.",
      "id": "ep_11_ut_49"
    },
    {
      "end": 583004,
      "speaker": "Enrico Bertini",
      "start": 571964,
      "text": "So who is behind the project? I mean, practically speaking, who's been working on the. On the project itself, coding, designing, prototyping, analyzing all this stuff?",
      "id": "ep_11_ut_50"
    },
    {
      "end": 616594,
      "speaker": "Moritz Stefaner",
      "start": 583084,
      "text": "Yeah, it's been a big team, so I can give you sort of the chronology a bit. So, as I said, drew had the original idea, Drew Hammond. So then he approached me if we would work together on sort of fleshing out that idea and developing a concept that would be able to be funded or be handed in for a funding application. And then I said, yeah, that sounds really great, but I'll need some help here. And so then I approached the guys from studio NAND to work already on that first concept, and so we did that together.",
      "id": "ep_11_ut_51"
    },
    {
      "end": 618718,
      "speaker": "Stephan Thiel",
      "start": 616894,
      "text": "And this started in August already.",
      "id": "ep_11_ut_52"
    },
    {
      "end": 665024,
      "speaker": "Moritz Stefaner",
      "start": 618806,
      "text": "That was last year, augury. Oh, man, that's crazy. Yeah, yeah, yeah. And then we handed that in for different cultural funding pots, so to speak. And we also tried to do the official route and place it on the official London 2012 website and talk to Lowcock, the organizing committee, and we did even a pitch there. But luckily, I must say, we did not succeed. I'm really happy that we didn't get the official commission because this one would have been very hard to produce. You know, like, support all the different browsers, do it in all, control all the contents at any time. You know, it would have been a very, let's say, very restricted project from the creative side.",
      "id": "ep_11_ut_53"
    },
    {
      "end": 668304,
      "speaker": "Enrico Bertini",
      "start": 665184,
      "text": "Yeah, sure, sure. Okay.",
      "id": "ep_11_ut_54"
    },
    {
      "end": 688318,
      "speaker": "Moritz Stefaner",
      "start": 668424,
      "text": "Yeah. And then in March, it became clear that our arts council funding would come through. And then we knew our summer was ruined. That was everybody's first thought, like, oh, my God, there goes my summer vacation. We were, of course, also happy.",
      "id": "ep_11_ut_55"
    },
    {
      "end": 693406,
      "speaker": "Enrico Bertini",
      "start": 688446,
      "text": "So, practically speaking, you and guys from NAND Studio have been working on the.",
      "id": "ep_11_ut_56"
    },
    {
      "end": 710134,
      "speaker": "Stephan Thiel",
      "start": 693430,
      "text": "Project in practice, in terms of design. In terms of design final concepts and stuff like this. Yeah, we have been developing this mainly in close collaboration with Drew. But, yeah, I mean, the design work and stuff like that is all Moritz and Studio 19.",
      "id": "ep_11_ut_57"
    },
    {
      "end": 711310,
      "speaker": "Enrico Bertini",
      "start": 710294,
      "text": "Fantastic.",
      "id": "ep_11_ut_58"
    },
    {
      "end": 729572,
      "speaker": "Moritz Stefaner",
      "start": 711462,
      "text": "And then we had, of course, we had a big organization team around it, people working on pr, people working on producers, using the exhibition, you know, all this extra work that you don't really think of in the beginning, but there's a lot of nitty gritty stuff to be taken care of.",
      "id": "ep_11_ut_59"
    },
    {
      "end": 730292,
      "speaker": "Enrico Bertini",
      "start": 729668,
      "text": "Okay.",
      "id": "ep_11_ut_60"
    },
    {
      "end": 745446,
      "speaker": "Moritz Stefaner",
      "start": 730388,
      "text": "And Gerrit Kaiser was our backend guy, so he took care of doing all the backend work for retrieving, analyzing and providing the tweets to the front end, which was quite a task, I have to say.",
      "id": "ep_11_ut_61"
    },
    {
      "end": 775974,
      "speaker": "Stephan Thiel",
      "start": 745580,
      "text": "Yeah. And we must also mention at this point that we have been supported by lexalytics for the data analysis, for the sentiment analysis, which is also we should, we should mention it as a team because they really gave a great support and helped really a lot with their software. They're providing it to us without any funds and stuff like that. So really lexolytics should be considered part of the team because their software component provides a sentiment analysis, which we found in the research is the best on the market. So.",
      "id": "ep_11_ut_62"
    },
    {
      "end": 778054,
      "speaker": "Enrico Bertini",
      "start": 776354,
      "text": "Okay, who was that?",
      "id": "ep_11_ut_63"
    },
    {
      "end": 796266,
      "speaker": "Stephan Thiel",
      "start": 778514,
      "text": "Lexalytics, it's a company based in the US. And they really did, this is what they do. They do sentiment analysis and provide a software package and also for entity retrieving and stuff like that. So they have a really comprehensive software package and we are using the sentiment analysis component from that.",
      "id": "ep_11_ut_64"
    },
    {
      "end": 824134,
      "speaker": "Enrico Bertini",
      "start": 796370,
      "text": "Okay, fantastic. Okay, so before we delve into the technicalities of the project, do you guys want to briefly describe what you have on the Emoto website in case people never saw it, or just to refresh their mind and, yeah, briefly mention what's the final outcome of the project. And of course mention the URL in case people want to go there.",
      "id": "ep_11_ut_65"
    },
    {
      "end": 942704,
      "speaker": "Stephan Thiel",
      "start": 826414,
      "text": "Yeah, I mean, what you finally see on the website www.emoto2012.org is a visualization which is mainly consisted of two, or which mainly consists of two components, which is one is the origami style figures that we see as one core. This is how we call them. We don't have a specific name for them, but they look like origamis and nice little origamis. And this is how we call them. And this is what we use to visualize topics in a real time manner, but also over time. So we have triangular shapes which are giving a feedback on the overall sentiment distribution for a specific topic around the Olympics. And the topic could be an athlete, a discipline, or even other social topics such as the traffic situation in London or the empty seats at some of the venues, which were a bit of a negatively discussed topic during the Olympics and stuff like that. So for each one of these topics we're having little composition of some colored triangles, and triangles in the top represent positive emotions and distribution of the sentiment levels that we have determined. And triangles on the bottom are the negative ones. So you can easily sort of like a thumbs up, thumbs down indicator, see how positively or negatively is a topic discussed at the moment. And then there is also a real time message stream which really focuses on seeing Twitter messages in real time, flying by. And this is supposed to be a compliment, like, next to watching tv, you know, we thought it might be interesting, or we had Moritz did one of the early prototypes there, and it was really. We knew. It's really so direct, so immediate. You see the responses just right as they happen. And we thought it would be nice to just have that as a compliment to watching tv, for instance, or something like that.",
      "id": "ep_11_ut_66"
    },
    {
      "end": 947924,
      "speaker": "Enrico Bertini",
      "start": 942824,
      "text": "Did you mention people sitting in front of their tv and their iPad on?",
      "id": "ep_11_ut_67"
    },
    {
      "end": 949844,
      "speaker": "Stephan Thiel",
      "start": 948344,
      "text": "Yeah, exactly.",
      "id": "ep_11_ut_68"
    },
    {
      "end": 952832,
      "speaker": "Moritz Stefaner",
      "start": 950584,
      "text": "Second screen is the word of the year, probably.",
      "id": "ep_11_ut_69"
    },
    {
      "end": 959920,
      "speaker": "Stephan Thiel",
      "start": 952888,
      "text": "Yeah, definitely. I mean, more. It's a way. Right? We imagine it to be like this and hope it will be like this in a way. Yeah, absolutely.",
      "id": "ep_11_ut_70"
    },
    {
      "end": 965896,
      "speaker": "Moritz Stefaner",
      "start": 959952,
      "text": "But I must say, I found it's very challenging to watch sports and read at the same time.",
      "id": "ep_11_ut_71"
    },
    {
      "end": 967000,
      "speaker": "Stephan Thiel",
      "start": 966080,
      "text": "Yeah, definitely.",
      "id": "ep_11_ut_72"
    },
    {
      "end": 979116,
      "speaker": "Moritz Stefaner",
      "start": 967072,
      "text": "So I think it works nicely for American football where you have breaks. No, but it's really difficult for sports that have continuous action going on. So I tried it a few times, and it. It's not so relaxing.",
      "id": "ep_11_ut_73"
    },
    {
      "end": 984332,
      "speaker": "Enrico Bertini",
      "start": 979220,
      "text": "I think it depends very much on how much you want to focus on the game. Right?",
      "id": "ep_11_ut_74"
    },
    {
      "end": 996148,
      "speaker": "Moritz Stefaner",
      "start": 984428,
      "text": "Yeah. And a lot of little design decisions, like how you work with attention and how you work with changes. And so there's. It's very interesting, but it's also challenging to do a good second screen application.",
      "id": "ep_11_ut_75"
    },
    {
      "end": 1030626,
      "speaker": "Stephan Thiel",
      "start": 996196,
      "text": "Probably one good thing to mention as an effect is we did some first studies around the Euro soccer Cup, and this was actually the first time that this kind of prototype of the stream was running with live data. And when the. When for one game, I think it was Germany against Poland or some other. I mean, it definitely was Poland, which scored the 10 to the first goal, and the excitement was immediately visible in the real time stream. And this was like a clear indicator. It's more like, bae, there's something happening. It's like a warning light, basically. And this is what we really liked about it.",
      "id": "ep_11_ut_76"
    },
    {
      "end": 1031098,
      "speaker": "Enrico Bertini",
      "start": 1030690,
      "text": "Okay.",
      "id": "ep_11_ut_77"
    },
    {
      "end": 1044680,
      "speaker": "Moritz Stefaner",
      "start": 1031146,
      "text": "It's sort of magic. I mean, I also had that with Usain Bolt, you know, when he ran the 100 meters in 963, it was in that very millisecond, the first tweet came, and I was like, wow, how did that happen?",
      "id": "ep_11_ut_78"
    },
    {
      "end": 1046604,
      "speaker": "Stephan Thiel",
      "start": 1044832,
      "text": "All news agencies are behind.",
      "id": "ep_11_ut_79"
    },
    {
      "end": 1054244,
      "speaker": "Moritz Stefaner",
      "start": 1047264,
      "text": "So the tweet had the same delay as the tv picture, you know, and it was like, wow. Yeah, it's sort of magic.",
      "id": "ep_11_ut_80"
    },
    {
      "end": 1062400,
      "speaker": "Stephan Thiel",
      "start": 1054904,
      "text": "News agencies take up to one or two minutes to put that on their website. So this was really what was exciting about it.",
      "id": "ep_11_ut_81"
    },
    {
      "end": 1063008,
      "speaker": "Moritz Stefaner",
      "start": 1062472,
      "text": "Yeah.",
      "id": "ep_11_ut_82"
    },
    {
      "end": 1092702,
      "speaker": "Enrico Bertini",
      "start": 1063136,
      "text": "So you actually touched upon something that I wanted to ask you later, but so I was wondering, by looking at your project, how did you actually test your system before going online? Because this looks like the kind of things that could really blow in your hands and the kind of thing that. And you would never have enough confidence without some kind of real data. Right.",
      "id": "ep_11_ut_83"
    },
    {
      "end": 1105160,
      "speaker": "Moritz Stefaner",
      "start": 1092838,
      "text": "Yeah, that was, it was a huge challenge. I mean, we did collect test data from the golf masters as well as the soccer Eurograph, which is not exactly.",
      "id": "ep_11_ut_84"
    },
    {
      "end": 1107708,
      "speaker": "Enrico Bertini",
      "start": 1105222,
      "text": "The same page, which has bolt running.",
      "id": "ep_11_ut_85"
    },
    {
      "end": 1160312,
      "speaker": "Moritz Stefaner",
      "start": 1107836,
      "text": "Exactly. And the other problem is, it's single event sports, you know, where one thing is happening at a time at the games. All kinds of things are happening at the same time, you know, so, yeah, so we did at least have some idea of, you know, what sports data looks like Twitter wise, but we had no idea what Olympics data looks like until the game started. And, yeah, the first few days we had to fix and tweak a lot of little things just because before, it was very difficult to have a realistic test setup. And I read the BBC, they actually wrote a full simulation of the games to be able to test their programs. So they had this sort of artificial games feed that they would generate so they could test their real time components.",
      "id": "ep_11_ut_86"
    },
    {
      "end": 1168676,
      "speaker": "Enrico Bertini",
      "start": 1160438,
      "text": "Okay. Okay, so basically, you had this kind of base jumping effect where you just threw yourself.",
      "id": "ep_11_ut_87"
    },
    {
      "end": 1193712,
      "speaker": "Moritz Stefaner",
      "start": 1168780,
      "text": "Yeah. You just have to jump and. Yeah. Make the best assumptions and roll with it. Yeah. But it was challenging, definitely. And that's a big issue with real time data that it's hard to test. And you have, in my experience, I mean, now, in hindsight, I. We should have written a full simulation that continuously runs so we always have something to test against.",
      "id": "ep_11_ut_88"
    },
    {
      "end": 1197764,
      "speaker": "Enrico Bertini",
      "start": 1193888,
      "text": "So you didn't try to create some simulated data out of it?",
      "id": "ep_11_ut_89"
    },
    {
      "end": 1212576,
      "speaker": "Moritz Stefaner",
      "start": 1198104,
      "text": "Oh, we did, yeah. So we had sort of this replay of this one soccer match, you know, being fed in over and over, or I think the golf masters, we used more in static analysis, but it wasn't that close to the real thing as it could have been.",
      "id": "ep_11_ut_90"
    },
    {
      "end": 1213368,
      "speaker": "Enrico Bertini",
      "start": 1212760,
      "text": "Okay.",
      "id": "ep_11_ut_91"
    },
    {
      "end": 1214016,
      "speaker": "Moritz Stefaner",
      "start": 1213456,
      "text": "Yeah, yeah.",
      "id": "ep_11_ut_92"
    },
    {
      "end": 1217684,
      "speaker": "Enrico Bertini",
      "start": 1214080,
      "text": "Good, good. Wow. Yeah. Look scary.",
      "id": "ep_11_ut_93"
    },
    {
      "end": 1221884,
      "speaker": "Stephan Thiel",
      "start": 1218304,
      "text": "And it was an adventure, definitely.",
      "id": "ep_11_ut_94"
    },
    {
      "end": 1236204,
      "speaker": "Moritz Stefaner",
      "start": 1223104,
      "text": "I mean, we are, in a sense, lucky that it was an art project and not like, for, like, top notch client. That would kill us when the site is offline for five minutes. No, but then it's really tough, too. So I have huge respect.",
      "id": "ep_11_ut_95"
    },
    {
      "end": 1272848,
      "speaker": "Enrico Bertini",
      "start": 1236624,
      "text": "Right. I mean, it's. It's quite normal that you get some. Once you go live, you will normally almost always have some little problems at normal. So I was curious about. I wanted to start. I would like to know something about the data processing and analytics you have behind before going into the visualization part. So how do you actually get this data from Twitter? I guess this is a small percentage of the old stream, right?",
      "id": "ep_11_ut_96"
    },
    {
      "end": 1274044,
      "speaker": "Stephan Thiel",
      "start": 1273016,
      "text": "Yes, yes.",
      "id": "ep_11_ut_97"
    },
    {
      "end": 1280244,
      "speaker": "Enrico Bertini",
      "start": 1274344,
      "text": "How do you access this data and what kind of processing you do on top of it? I was really curious to hear about that.",
      "id": "ep_11_ut_98"
    },
    {
      "end": 1308246,
      "speaker": "Stephan Thiel",
      "start": 1281624,
      "text": "Yeah, I mean, in the end, we've turned out to be using the public Twitter streaming API, which is only a 1% subset. And we were initially trying to get a higher percentage of the entire Twitter stream to have a more significant coverage in terms of statistics, and also for not so frequently discussed topics, to get more tweets from them, basically. So to have better, a better overview over the topics.",
      "id": "ep_11_ut_99"
    },
    {
      "end": 1311150,
      "speaker": "Enrico Bertini",
      "start": 1308350,
      "text": "So that's what they call the fire hose?",
      "id": "ep_11_ut_100"
    },
    {
      "end": 1315646,
      "speaker": "Stephan Thiel",
      "start": 1311302,
      "text": "No, that's not what they call the fire hose. No, that's what they call the garden hose, I guess.",
      "id": "ep_11_ut_101"
    },
    {
      "end": 1316434,
      "speaker": "Enrico Bertini",
      "start": 1315710,
      "text": "Okay.",
      "id": "ep_11_ut_102"
    },
    {
      "end": 1323022,
      "speaker": "Stephan Thiel",
      "start": 1316974,
      "text": "But it turns out in hindsight, this garden hose was really kind of enough.",
      "id": "ep_11_ut_103"
    },
    {
      "end": 1323414,
      "speaker": "Moritz Stefaner",
      "start": 1323118,
      "text": "Yeah.",
      "id": "ep_11_ut_104"
    },
    {
      "end": 1352500,
      "speaker": "Stephan Thiel",
      "start": 1323454,
      "text": "Okay. I mean, it's, of course it's more, you increase the resolution or density of the representation in the data, but I think the 1% is actually, for a project like this is actually kind of enough. And it was already providing lots of technical challenges because we have an entire infrastructure already for this 1% host running on Amazon cloud services. So we have collected more. It's twelve and a half million tweets.",
      "id": "ep_11_ut_105"
    },
    {
      "end": 1353228,
      "speaker": "Moritz Stefaner",
      "start": 1352572,
      "text": "Something like that.",
      "id": "ep_11_ut_106"
    },
    {
      "end": 1354772,
      "speaker": "Stephan Thiel",
      "start": 1353276,
      "text": "Yeah, something like that. Wow.",
      "id": "ep_11_ut_107"
    },
    {
      "end": 1363354,
      "speaker": "Moritz Stefaner",
      "start": 1354868,
      "text": "So these are all tweets that are clearly related to the games in English with a sentiment score. So they have some sort of emotional word in them.",
      "id": "ep_11_ut_108"
    },
    {
      "end": 1416108,
      "speaker": "Stephan Thiel",
      "start": 1363474,
      "text": "So, yeah. And what we are doing is we have several machines running on node js, and they receive the tweets. And between each machine, each machine is responsible for one specific part of the project. So one is ingesting the tweets from Twitter, the other one is pushing topics and data to clients which are connected to the front end. And in between there is stuff like archiving, storing away tweets, and also, of course, the sentiment analysis project. And we communicate with these machines, communicate over Redis, which is a high performance storing engine. Basically, each machine just gets the data in, pushes it into Redis, and the next machine is notified when something has been pushed to Redis and keeps processing the tweets and passing it on to the next one. So we have a sort of buffered, or a chain of computers.",
      "id": "ep_11_ut_109"
    },
    {
      "end": 1418308,
      "speaker": "Moritz Stefaner",
      "start": 1416236,
      "text": "The Internet is a series of tubes.",
      "id": "ep_11_ut_110"
    },
    {
      "end": 1419384,
      "speaker": "Stephan Thiel",
      "start": 1418436,
      "text": "Exactly.",
      "id": "ep_11_ut_111"
    },
    {
      "end": 1435682,
      "speaker": "Moritz Stefaner",
      "start": 1421634,
      "text": "It was really this sequence of pipes that worked out really well, because then each component can do sort of one thing properly and then pass on the result to the next component. It's really? With like. Yeah. Unix pipes or so. Yeah.",
      "id": "ep_11_ut_112"
    },
    {
      "end": 1445514,
      "speaker": "Enrico Bertini",
      "start": 1435778,
      "text": "Okay. So you actually filter out the messages making sure that you get only those that talk about the Olympics and have some sentiment.",
      "id": "ep_11_ut_113"
    },
    {
      "end": 1446026,
      "speaker": "Stephan Thiel",
      "start": 1445634,
      "text": "Yes.",
      "id": "ep_11_ut_114"
    },
    {
      "end": 1448324,
      "speaker": "Enrico Bertini",
      "start": 1446090,
      "text": "Maybe you have more parameters than that. I don't know.",
      "id": "ep_11_ut_115"
    },
    {
      "end": 1462036,
      "speaker": "Stephan Thiel",
      "start": 1448364,
      "text": "Yeah, I mean, we are doing an initial, very general query about the Olympics. So we asked Twitter for all the tweets regarding which mention London 2012 Olympics, and this is about it.",
      "id": "ep_11_ut_116"
    },
    {
      "end": 1465596,
      "speaker": "Moritz Stefaner",
      "start": 1462140,
      "text": "So you have official Twitter accounts? Yeah, yeah.",
      "id": "ep_11_ut_117"
    },
    {
      "end": 1468348,
      "speaker": "Stephan Thiel",
      "start": 1465620,
      "text": "And so, of course, then some specific Twitter accounts.",
      "id": "ep_11_ut_118"
    },
    {
      "end": 1468764,
      "speaker": "Moritz Stefaner",
      "start": 1468396,
      "text": "Exactly.",
      "id": "ep_11_ut_119"
    },
    {
      "end": 1510764,
      "speaker": "Stephan Thiel",
      "start": 1468804,
      "text": "And so we try to get the entire group of messages, or as many messages as possible, which could be related to the Olympics, and then we further process them. So first of all, we distribute them in separate channels where we just look for specific keywords which we try to match the topics against. So, for instance, for swimming, we try to, we have several keywords like disciplines like athletes and stuff like that. And this is how we distribute messages in different channels. And then we do the sentiment analysis and further reduce the amount there by just kicking out everything message which had a sentiment score of zero. So basically it was neutral.",
      "id": "ep_11_ut_120"
    },
    {
      "end": 1518048,
      "speaker": "Enrico Bertini",
      "start": 1512544,
      "text": "So sentiment score zero is no sentiment or neutral sentiment.",
      "id": "ep_11_ut_121"
    },
    {
      "end": 1544350,
      "speaker": "Moritz Stefaner",
      "start": 1518176,
      "text": "It can be both. It can be either no sentiment detected or. Yeah, it basically says no sentiment detected. Neither a positive or a negative word was found. So that sentiment analysis is based on looking for words that have a positive or negative connotation or tone, and then they have scores. And the software will also detect negation. So if you say not bad, it will realize that that's actually quite good.",
      "id": "ep_11_ut_122"
    },
    {
      "end": 1545126,
      "speaker": "Enrico Bertini",
      "start": 1544502,
      "text": "Okay.",
      "id": "ep_11_ut_123"
    },
    {
      "end": 1571486,
      "speaker": "Moritz Stefaner",
      "start": 1545230,
      "text": "And so, but if none of these words sort of that could have an emotional meaning, are in the tweet, then it won't show up in our system because we said we want to focus on the emotional, you know, response and like if people cheer or curse and get the extremes. So we were personally quite interested in the extremes, not so much in the very obvious neutral reporting that you get from any news source. Right, sure.",
      "id": "ep_11_ut_124"
    },
    {
      "end": 1578934,
      "speaker": "Enrico Bertini",
      "start": 1571670,
      "text": "And this part has been done using this software that you mentioned before, lexalytics. Okay, great.",
      "id": "ep_11_ut_125"
    },
    {
      "end": 1592934,
      "speaker": "Moritz Stefaner",
      "start": 1579014,
      "text": "Yeah, we should mention them every five minutes because they, like, we asked them like one day and like half day later they wrote, yeah, sure, you can use our software. It's fantastic. We're happy to support you now. It was really. And it saved our asses basically.",
      "id": "ep_11_ut_126"
    },
    {
      "end": 1598370,
      "speaker": "Enrico Bertini",
      "start": 1594034,
      "text": "Yeah. And I guess doing these things from scratch would be a nightmare.",
      "id": "ep_11_ut_127"
    },
    {
      "end": 1616810,
      "speaker": "Stephan Thiel",
      "start": 1598402,
      "text": "No way, no way, no way. You wouldn't at all reach the quality. So we did some studies with open source tools, but you wouldn't reach the quality that lexalytics provides. And this was key to the project. So if the sentiment analysis is not good, then yeah, yeah. What should we visualize then?",
      "id": "ep_11_ut_128"
    },
    {
      "end": 1632524,
      "speaker": "Enrico Bertini",
      "start": 1616962,
      "text": "But one thing I didn't understand from the project, do you have also some kind of topic detection algorithm there? Because you mentioned you have one of the visualizations is about topic. Right. I was wondering whether you automatically detect interesting topics there and how you do it.",
      "id": "ep_11_ut_129"
    },
    {
      "end": 1679598,
      "speaker": "Moritz Stefaner",
      "start": 1633664,
      "text": "No, it's supervised. So we have an expectation of what interesting topics were or could be, and then we look for indications of that topic, you know, and this is much easier and for something, for the games, also feasible because there is a limited set of things people are talking about. Right. And trying to detect yourself, what are the trending topics or the hot topics. So it might look very similar in the end result, but it's much more robust to say, okay, we are looking for disciplines, we're looking for the, let's say, top 50 most popular athletes, you know, and maybe some things that we during, as the games progress, realize are interesting topics. So we had a simple admin interface where we could easily make up new topics.",
      "id": "ep_11_ut_130"
    },
    {
      "end": 1679806,
      "speaker": "Stephan Thiel",
      "start": 1679646,
      "text": "Right.",
      "id": "ep_11_ut_131"
    },
    {
      "end": 1684094,
      "speaker": "Enrico Bertini",
      "start": 1679830,
      "text": "Oh, so you could manually actually add new topics as the.",
      "id": "ep_11_ut_132"
    },
    {
      "end": 1696334,
      "speaker": "Moritz Stefaner",
      "start": 1684254,
      "text": "Yeah, they had a label and a regular expression, and we could enter like a new topic and have a regular expression. And whenever that expression matches a tweet, it will be counted for that topic.",
      "id": "ep_11_ut_133"
    },
    {
      "end": 1697030,
      "speaker": "Enrico Bertini",
      "start": 1696414,
      "text": "Okay.",
      "id": "ep_11_ut_134"
    },
    {
      "end": 1698966,
      "speaker": "Moritz Stefaner",
      "start": 1697142,
      "text": "Yeah, that was quite nice. Yeah, yeah.",
      "id": "ep_11_ut_135"
    },
    {
      "end": 1735454,
      "speaker": "Stephan Thiel",
      "start": 1698990,
      "text": "Well, some data driven journalism style, which the entire project is a lot about as well, because Moritz has been done also, like really nice studies and explorations during the games, just putting data in Tableau and extracting the courses of specific topics and stuff like that. So this was a large part, I would say, also to explore a bit how data gathering and analysis and visualization can be used to just get an understanding of such an event in a different kind of way.",
      "id": "ep_11_ut_136"
    },
    {
      "end": 1753604,
      "speaker": "Moritz Stefaner",
      "start": 1735804,
      "text": "These different speeds are interesting, I think, because the web platform was very real time, like on the second, you know, and ever changing also. So, you know, it's always new. And then we had a slower pace in the, in the blog and in the sort of data journalistic parts where we would look every three or four days.",
      "id": "ep_11_ut_137"
    },
    {
      "end": 1754404,
      "speaker": "Enrico Bertini",
      "start": 1753724,
      "text": "Yeah, sure.",
      "id": "ep_11_ut_138"
    },
    {
      "end": 1763212,
      "speaker": "Moritz Stefaner",
      "start": 1754484,
      "text": "Okay. What were the bigger developments? What were people talking about? Can we make some analysis on that and maybe contribute a bit from the data side, you know?",
      "id": "ep_11_ut_139"
    },
    {
      "end": 1763900,
      "speaker": "Enrico Bertini",
      "start": 1763268,
      "text": "Yeah, yeah, yeah.",
      "id": "ep_11_ut_140"
    },
    {
      "end": 1775998,
      "speaker": "Moritz Stefaner",
      "start": 1763972,
      "text": "And then we had as the third part, the data sculpture, where we conserve all the tweets that we collected in one big 3d object. And so this is the slowest and.",
      "id": "ep_11_ut_141"
    },
    {
      "end": 1779238,
      "speaker": "Enrico Bertini",
      "start": 1776006,
      "text": "It's conceived to stay there forever.",
      "id": "ep_11_ut_142"
    },
    {
      "end": 1785494,
      "speaker": "Moritz Stefaner",
      "start": 1779366,
      "text": "Exactly. It has this preserved forever. Feeling. Exactly.",
      "id": "ep_11_ut_143"
    },
    {
      "end": 1788558,
      "speaker": "Enrico Bertini",
      "start": 1785574,
      "text": "Yeah. In a thousand years, they will find it somewhere.",
      "id": "ep_11_ut_144"
    },
    {
      "end": 1791662,
      "speaker": "Stephan Thiel",
      "start": 1788726,
      "text": "Yes. We always liked that idea of the.",
      "id": "ep_11_ut_145"
    },
    {
      "end": 1858814,
      "speaker": "Enrico Bertini",
      "start": 1791678,
      "text": "Rosetta stone in the art of London. Yeah, yeah. But I think that's a recovering topic. The idea, I think we've been discussing that during our last episode as well. The idea of really carefully thinking what's the best mix between what the machine can do and what the human can do. And, I don't know, this is another case when instead of pretending the machine to come up with interesting topic, you can use the machine just to have an overview of the game and then carefully, manually pick some topics and put them into the system. I think it's really fascinating. Again, once again, I think it's another example of interesting interactions between what the machine can do and what the human can do and how they can cooperate. I think that's really, really interesting here. Okay. Do we guys want to move? Do you guys want to move to visualization and talk about the design and the development of your visualizations?",
      "id": "ep_11_ut_146"
    },
    {
      "end": 1860114,
      "speaker": "Stephan Thiel",
      "start": 1858974,
      "text": "Sure. Yeah.",
      "id": "ep_11_ut_147"
    },
    {
      "end": 1897954,
      "speaker": "Enrico Bertini",
      "start": 1860614,
      "text": "So if I understand well, the main things I've seen on the website is this origami visualization, then the real time tweets, then you have in the blog what you call the centigraph, which I really like as a term, and the heat map. And of course, you have the data sculpture. I hope I didn't miss anything. So do you briefly want to talk about how you went about, I don't know, prototyping this stuff, designing this stuff, conceptualizing, actually, this stuff. I'm sure you went through a painful process, as usual.",
      "id": "ep_11_ut_148"
    },
    {
      "end": 1901726,
      "speaker": "Stephan Thiel",
      "start": 1901334,
      "text": "Yeah.",
      "id": "ep_11_ut_149"
    },
    {
      "end": 1907374,
      "speaker": "Enrico Bertini",
      "start": 1901750,
      "text": "I mean, how did you come up with these ideas? I'm really curious about the origami thing. Sure.",
      "id": "ep_11_ut_150"
    },
    {
      "end": 1911450,
      "speaker": "Moritz Stefaner",
      "start": 1909154,
      "text": "Stefan, you want to start? Yeah, yeah, I can.",
      "id": "ep_11_ut_151"
    },
    {
      "end": 2058854,
      "speaker": "Stephan Thiel",
      "start": 1911482,
      "text": "I mean, we initially. Excuse me. Of course, we initially started with, like, lots of explorations, you know, being inspired by different other projects that we find really interesting, which capture a lot of the dynamicism of the games, of sport events in general. So we did lots of experiments in the beginning really quickly, prototyping stuff with particles, for instance, and sports motion capturing recordings. So we initially thought, wouldn't it be nice if we focus on athletes and disciplines? Wouldn't it be nice to have figures which are built from particles representing a tweet of each, stuff like that, to have a really compelling, complex image, for instance, and also some dynamic animation and stuff like that? Then again, this looked really interesting. It's always interesting from an aesthetic perspective or from the visual impact, just. But I mean, then we also entered or started questioning these approaches again, in terms of, is it readable? Will people understand it? Is it meaningful? Is it actually useful as a sort of visualization? And this is how we then played a bit more around in parallel. We played more around with the data as well. And the initial key moment, Moritz, I think you would agree, was when we finally saw the, the first version of the sentigraph, it just points plotted on an x y axis. So you have the sentiment of a tweet on the y axis and the time basically on the axis. Pretty straightforward. But then we sat together and played around a bit and more extended little multiples of different topics and entities. And then we started seeing there is something hidden in there with just doing small multiples with this sentiment plots, basically. And then the topics and their discussions start to shape out from the data. And this is where we started to like, okay, how can we use this basic principle and have one indicator, one visual element which indicates the current state of the topic? And then we combine the two things, basically get that information across that we found there.",
      "id": "ep_11_ut_152"
    },
    {
      "end": 2096776,
      "speaker": "Moritz Stefaner",
      "start": 2059354,
      "text": "I mean, the other thing we realized, because in the beginning we had these particles forms, right. That would form like a cloud of something, you know? But then we realized, okay, the topics we're talking about, you know, there's such huge differences in tweet volume from, you know, between time points, but also across topics that whenever you do something where one tweet is represented by one particle, you're in trouble. You sort of adjust the number of particles so it looks better, or 99% of the time, you have too many or too few particles. And with particles, it's really important not to have too many or too few.",
      "id": "ep_11_ut_153"
    },
    {
      "end": 2097240,
      "speaker": "Enrico Bertini",
      "start": 2096920,
      "text": "Yeah.",
      "id": "ep_11_ut_154"
    },
    {
      "end": 2100000,
      "speaker": "Moritz Stefaner",
      "start": 2097272,
      "text": "And that's, it's a big conceptual issue for these types of things.",
      "id": "ep_11_ut_155"
    },
    {
      "end": 2100664,
      "speaker": "Enrico Bertini",
      "start": 2100072,
      "text": "Yeah, yeah, sure.",
      "id": "ep_11_ut_156"
    },
    {
      "end": 2112414,
      "speaker": "Moritz Stefaner",
      "start": 2100704,
      "text": "And we wanted to be sort of truthful to that, you know, that we wanted that each view of the visualization works regardless of how many tweets we have. Right.",
      "id": "ep_11_ut_157"
    },
    {
      "end": 2113010,
      "speaker": "Enrico Bertini",
      "start": 2112504,
      "text": "Yeah.",
      "id": "ep_11_ut_158"
    },
    {
      "end": 2124650,
      "speaker": "Moritz Stefaner",
      "start": 2113122,
      "text": "And so then we realized, okay, we need to do something. We need to move it up one level, zoom out one level, and work with aggregates a bit more and with coherent shapes, you know, that stand for a whole set of tweets or something like that.",
      "id": "ep_11_ut_159"
    },
    {
      "end": 2171714,
      "speaker": "Enrico Bertini",
      "start": 2124762,
      "text": "Yeah, that's really interesting to hear. I was curious to hear the story behind that because very honestly, the same, the first time I saw the visualizations on the website, I liked the design, but my first reaction was like, oh, I expected to have more data density here. There's not enough information. It's too aggregated. But at the same time, I fully understand what's the challenge here? And now that you mentioned the fact that, of course, in an event like that, you might have really high spikes of something and then very low volume and managing to have, I mean, having a visualization where you have single data points for every event or tweet or whatever is going to be a huge mess.",
      "id": "ep_11_ut_160"
    },
    {
      "end": 2202582,
      "speaker": "Moritz Stefaner",
      "start": 2171824,
      "text": "Right, exactly. And very hard to handle. And we wanted to make sure that every click is sort of interesting and has, you know, delivers enough information to be meaningful. And that's why, for instance, you cannot just look for enthusiastic tweets about a topic on day two, because it maybe it was only one or two, and then, you know, you're in that dead end of having filtered down your data too much and so forth. So that's why we kept it on this very general level, I guess.",
      "id": "ep_11_ut_161"
    },
    {
      "end": 2211474,
      "speaker": "Enrico Bertini",
      "start": 2202758,
      "text": "And how did you come up with the origami? And on a side note, I would like to have a comment from Stephen Few about Yorick.",
      "id": "ep_11_ut_162"
    },
    {
      "end": 2214902,
      "speaker": "Moritz Stefaner",
      "start": 2212414,
      "text": "I was skeptical, too. I was skeptical, too.",
      "id": "ep_11_ut_163"
    },
    {
      "end": 2216750,
      "speaker": "Enrico Bertini",
      "start": 2214958,
      "text": "Compared to a bar chart?",
      "id": "ep_11_ut_164"
    },
    {
      "end": 2289104,
      "speaker": "Moritz Stefaner",
      "start": 2216862,
      "text": "No. No. So I think Jonas can take credit for the origami principle, part of the studio NAND team. And I must say, he really, he convinced me there because in the beginning, I was skeptical. So I toyed a lot with different triangles of different sizes and tried to have sort of loose arrangements because I knew that it could work, that if you have independent triangles and they have different sizes, you know, that together could make a nice profile. But I never had a good way of arranging them. So in my prototypes, they were always, like, flying around fairly randomly, and he was always like, no, we need some structure here. We need some structure here. And then he came up with that folding principle, but only in illustrated. I was like, wow. But will that work for any combination of values? You know, what if they fold back into the center? Or what if they fold, you know, to the left side of the screen and don't go anywhere? And I was always like, oh, can we really do that? And then, yeah, a few weeks before we launched, it was clear, okay, now we need to decide. And he came up with a really compelling, like, proposal how to make the logo design integrate with the visualization, you know, and the colors. And I was like, okay, we have to do it.",
      "id": "ep_11_ut_165"
    },
    {
      "end": 2290148,
      "speaker": "Stephan Thiel",
      "start": 2289404,
      "text": "Let's do it.",
      "id": "ep_11_ut_166"
    },
    {
      "end": 2292864,
      "speaker": "Moritz Stefaner",
      "start": 2290196,
      "text": "And luckily, it worked out. But.",
      "id": "ep_11_ut_167"
    },
    {
      "end": 2314674,
      "speaker": "Stephan Thiel",
      "start": 2295004,
      "text": "It's a similar topic to that, wasn't it? Weren't there? Yeah, I mean, we had, like, we initially started with a two color scheme, which was really nice. I liked it, really in terms of, like, clarity. I mean, but then there was this at some point, we weren't sure anymore what should be positive colors and what should be negative colors.",
      "id": "ep_11_ut_168"
    },
    {
      "end": 2317354,
      "speaker": "Moritz Stefaner",
      "start": 2315374,
      "text": "Everybody had a different, I think we.",
      "id": "ep_11_ut_169"
    },
    {
      "end": 2328006,
      "speaker": "Stephan Thiel",
      "start": 2317734,
      "text": "Chose a color scale, a pinkish, reddish and bluish color scheme, blue for. I think initially blue was positive.",
      "id": "ep_11_ut_170"
    },
    {
      "end": 2328958,
      "speaker": "Moritz Stefaner",
      "start": 2328070,
      "text": "It wasn't positive.",
      "id": "ep_11_ut_171"
    },
    {
      "end": 2329606,
      "speaker": "Stephan Thiel",
      "start": 2329086,
      "text": "Negative.",
      "id": "ep_11_ut_172"
    },
    {
      "end": 2330422,
      "speaker": "Moritz Stefaner",
      "start": 2329710,
      "text": "Yeah.",
      "id": "ep_11_ut_173"
    },
    {
      "end": 2331118,
      "speaker": "Enrico Bertini",
      "start": 2330598,
      "text": "Okay.",
      "id": "ep_11_ut_174"
    },
    {
      "end": 2383670,
      "speaker": "Stephan Thiel",
      "start": 2331166,
      "text": "And then at some point, we thought, like, okay, let's switch it and make. Does it make more sense? And then we were totally confused, like, what is actually? What is actually, because we had also individual, like, individually different assumptions on what should be a positive and what should be a negative color. So we reached out to some friends and did a little private, short poll, I would say. And the result of that was that what most of the team was thinking, that the reddish, yellowish, vibrant colors should be considered positive versus the blue one. One's negative, was actually a good assumption, but still, it was a surprising amount of votes for also the blue color scales being positive colors. So, of course, it's highly subjective.",
      "id": "ep_11_ut_175"
    },
    {
      "end": 2385194,
      "speaker": "Enrico Bertini",
      "start": 2383782,
      "text": "That's really interesting.",
      "id": "ep_11_ut_176"
    },
    {
      "end": 2408364,
      "speaker": "Stephan Thiel",
      "start": 2385734,
      "text": "But at some point, we turned colorblind in the process, and we had to reach out to people and ask them and to be really sure, again, like, this is the real color that we've met. And also doing some more, greater research around different color schemes, making it a bit more, opening it up a little bit more. So it's also more interesting and allows more fine grained feedback.",
      "id": "ep_11_ut_177"
    },
    {
      "end": 2416564,
      "speaker": "Moritz Stefaner",
      "start": 2409344,
      "text": "Yeah, but it's really interesting because also we launched the project and, like, the second Twitter commentary is, wow, that's awesome. But I would revert the colors.",
      "id": "ep_11_ut_178"
    },
    {
      "end": 2420164,
      "speaker": "Stephan Thiel",
      "start": 2416944,
      "text": "Yeah, don't go there.",
      "id": "ep_11_ut_179"
    },
    {
      "end": 2430822,
      "speaker": "Moritz Stefaner",
      "start": 2420614,
      "text": "We have discussed it. Yeah, it's interesting. It would be interesting to hear if there's any research. So I didn't find any, but I didn't look that deeply.",
      "id": "ep_11_ut_180"
    },
    {
      "end": 2439838,
      "speaker": "Enrico Bertini",
      "start": 2430958,
      "text": "Did you think about crowdsourcing that? Like, I don't know, trying to have a little test on. We did it on small Mechanical Turk or anything.",
      "id": "ep_11_ut_181"
    },
    {
      "end": 2459184,
      "speaker": "Stephan Thiel",
      "start": 2439886,
      "text": "We did a small one, but then again, I mean, it would have been too much to do it, like, really valid in a valid way, you know, reaching the necessary amount of people and also making sure the, the population, as I would say, on mechanical Turk, for instance, is the right one and stuff like that.",
      "id": "ep_11_ut_182"
    },
    {
      "end": 2475924,
      "speaker": "Enrico Bertini",
      "start": 2459264,
      "text": "But I think I might be wrong. I think Collin Ware, in his book, briefly discusses the relationship between, or the semantic interpretation of colors. There should be something like that. Did you try to look into that?",
      "id": "ep_11_ut_183"
    },
    {
      "end": 2502860,
      "speaker": "Stephan Thiel",
      "start": 2476324,
      "text": "Yeah. Yunus has also looked at some of them. Yeah, there were lots of papers that we read about different types of colors and their emotional interpretation and stuff like that. And this is basically how we also came up with the color scheme. We just changed it slightly to not be so extreme, reduce the browns a little bit, which is the slightly positive ones, and not making the, I mean.",
      "id": "ep_11_ut_184"
    },
    {
      "end": 2514908,
      "speaker": "Moritz Stefaner",
      "start": 2502932,
      "text": "That was the challenge that we wanted to have a graduation within, you know, the positive and the negative. I think if it's just about pick a happy color and pick a sad color, I think that's easy. Yes, but it's hard.",
      "id": "ep_11_ut_185"
    },
    {
      "end": 2516652,
      "speaker": "Enrico Bertini",
      "start": 2514996,
      "text": "But if you want to find the colors.",
      "id": "ep_11_ut_186"
    },
    {
      "end": 2524372,
      "speaker": "Moritz Stefaner",
      "start": 2516788,
      "text": "Yeah, that has plus, that goes from plus six to minus six. That was our challenge, and that was, it was tougher than we thought.",
      "id": "ep_11_ut_187"
    },
    {
      "end": 2525184,
      "speaker": "Stephan Thiel",
      "start": 2524508,
      "text": "Really.",
      "id": "ep_11_ut_188"
    },
    {
      "end": 2533966,
      "speaker": "Enrico Bertini",
      "start": 2526444,
      "text": "Yeah. It's really interesting how much work can be behind just selecting some colors.",
      "id": "ep_11_ut_189"
    },
    {
      "end": 2535730,
      "speaker": "Stephan Thiel",
      "start": 2534140,
      "text": "Yeah, yeah, that's for sure.",
      "id": "ep_11_ut_190"
    },
    {
      "end": 2544234,
      "speaker": "Moritz Stefaner",
      "start": 2535802,
      "text": "But now we're happy with it, I think. I mean, also, in hindsight, I say I think we made the right call. But it was. Yeah, it changed a lot and was a lot of discussion.",
      "id": "ep_11_ut_191"
    },
    {
      "end": 2546586,
      "speaker": "Enrico Bertini",
      "start": 2544314,
      "text": "I have to say that for me, it was very natural.",
      "id": "ep_11_ut_192"
    },
    {
      "end": 2547338,
      "speaker": "Moritz Stefaner",
      "start": 2546690,
      "text": "Yeah, that's good.",
      "id": "ep_11_ut_193"
    },
    {
      "end": 2548894,
      "speaker": "Stephan Thiel",
      "start": 2547386,
      "text": "Yeah, that's good. Yeah.",
      "id": "ep_11_ut_194"
    },
    {
      "end": 2550106,
      "speaker": "Moritz Stefaner",
      "start": 2549314,
      "text": "Good to hear.",
      "id": "ep_11_ut_195"
    },
    {
      "end": 2583934,
      "speaker": "Enrico Bertini",
      "start": 2550210,
      "text": "Good. And what else, what about the real time tweets? How did you come up with the idea of having these moving small windows, and then when you click on them, you can fix some of them, it looks like. I'm sure you spend some time thinking about it, especially the interaction part, how to interact with this, and what's the main purpose of this visualization and how not to overwhelm people. I think that. I'm sure you've been discussing a lot on that, or maybe not.",
      "id": "ep_11_ut_196"
    },
    {
      "end": 2658392,
      "speaker": "Moritz Stefaner",
      "start": 2584914,
      "text": "It came a bit from my experiences with the revision visit project. And, I mean, it's a project where you can type in the search query, and then we'll show all the tweets from the last few days for that. But it will make a fixed arrangement or fairly fixed. I mean, it changes a bit over time, but it's fairly stable. And conceptually, we thought, because the website will play this real time role in the bigger context of the project, we wanted to have something that really reflects this constant flow of messages. Right. And emphasize that real time character. And so we came up fairly early with this idea that there's a constant stream of things flying by. That was our code name for that view, things flying by. And I played a bit with different ways to do that. And at one point I came up with that principle that big things are more important, which is fairly natural, but then they also flow more slowly. So we have, it's like an inverse parallax, where the things that are close move slowly but the things that are far away move fast, which is sort of strange.",
      "id": "ep_11_ut_197"
    },
    {
      "end": 2659232,
      "speaker": "Enrico Bertini",
      "start": 2658528,
      "text": "Makes sense.",
      "id": "ep_11_ut_198"
    },
    {
      "end": 2679652,
      "speaker": "Moritz Stefaner",
      "start": 2659328,
      "text": "No, it doesn't. But that's the fun part. I mean, it doesn't make sense if you. If you try to see it as a perspective thing, you know, like if you look out of the train window, it's the other way around. Yeah, but if you. If you see it as things floating on a river, it makes a whole lot of sense. Right. Or things like that. So.",
      "id": "ep_11_ut_199"
    },
    {
      "end": 2682708,
      "speaker": "Enrico Bertini",
      "start": 2679748,
      "text": "And the big ones are those that are retweeted the most?",
      "id": "ep_11_ut_200"
    },
    {
      "end": 2684324,
      "speaker": "Moritz Stefaner",
      "start": 2682756,
      "text": "Retweeted a lot. Exactly.",
      "id": "ep_11_ut_201"
    },
    {
      "end": 2731660,
      "speaker": "Stephan Thiel",
      "start": 2684444,
      "text": "Yeah. I mean, the stream constantly tries to dynamically choose the tweets which should be bigger and should be smaller, because then, because, again, we have that problem that we could have a high volume stream for a really high volume topic at the moment, but also there could be a stream which just has five tweets per minute or something. So the stream currently, like, always calculates some on the fly statistics about what is the actual set. I am showing the set of tweets, and then tries to prioritize on the tweets which were more retweeted, but also which come from authors with more followers and stuff like that. So it's a mixture of the audience of the tweet and the amount of retweets it has.",
      "id": "ep_11_ut_202"
    },
    {
      "end": 2732400,
      "speaker": "Enrico Bertini",
      "start": 2731802,
      "text": "Okay.",
      "id": "ep_11_ut_203"
    },
    {
      "end": 2746856,
      "speaker": "Moritz Stefaner",
      "start": 2732472,
      "text": "Okay. So again, yeah. It's through a really complicated logic to how to sample the tweets and to pick the ones to display to make sure each of the views on the site is interesting, you know, because we.",
      "id": "ep_11_ut_204"
    },
    {
      "end": 2782904,
      "speaker": "Stephan Thiel",
      "start": 2746880,
      "text": "Knew there was a sweet spot for the stream as well, you know? And this is why we can define or have defined a certain number of tweets for each size to be shown in an ideal case. And the stream basically tries to buffer that and to always keep that time. So we have been experimenting with different screen sizes and then just saying, like, okay, for a really large screen, we need to, or it's ideal to show five large tweets and 30 really small ones. And on a smaller screen, it's obviously lower numbers. And so we've experimented with that and tried to always keep that number.",
      "id": "ep_11_ut_205"
    },
    {
      "end": 2783904,
      "speaker": "Enrico Bertini",
      "start": 2783384,
      "text": "Okay.",
      "id": "ep_11_ut_206"
    },
    {
      "end": 2784840,
      "speaker": "Stephan Thiel",
      "start": 2783944,
      "text": "Or these numbers.",
      "id": "ep_11_ut_207"
    },
    {
      "end": 2791224,
      "speaker": "Enrico Bertini",
      "start": 2784952,
      "text": "So it's sort of, you have a sort of adaptive sampling rate according to how much stuff is coming in.",
      "id": "ep_11_ut_208"
    },
    {
      "end": 2794160,
      "speaker": "Moritz Stefaner",
      "start": 2791264,
      "text": "Yeah, you could say that, yeah. Or sort of a weighted sampling.",
      "id": "ep_11_ut_209"
    },
    {
      "end": 2794632,
      "speaker": "Enrico Bertini",
      "start": 2794272,
      "text": "Yeah.",
      "id": "ep_11_ut_210"
    },
    {
      "end": 2795208,
      "speaker": "Stephan Thiel",
      "start": 2794688,
      "text": "Yeah.",
      "id": "ep_11_ut_211"
    },
    {
      "end": 2796032,
      "speaker": "Enrico Bertini",
      "start": 2795336,
      "text": "Okay.",
      "id": "ep_11_ut_212"
    },
    {
      "end": 2807724,
      "speaker": "Moritz Stefaner",
      "start": 2796168,
      "text": "It's interesting because that's sort of in between data visualization and interface design. You know, in interface design, you will want to pick views that are, like, have a nice level of depth and detail.",
      "id": "ep_11_ut_213"
    },
    {
      "end": 2808424,
      "speaker": "Enrico Bertini",
      "start": 2808024,
      "text": "Yeah.",
      "id": "ep_11_ut_214"
    },
    {
      "end": 2822444,
      "speaker": "Moritz Stefaner",
      "start": 2808464,
      "text": "You know, and design that really well. And the visualization part, you want to represent what the underlying data stream actually is like. And here we are moving in between these two worlds, I guess.",
      "id": "ep_11_ut_215"
    },
    {
      "end": 2829444,
      "speaker": "Enrico Bertini",
      "start": 2823344,
      "text": "How did you expect people to use this view? Did you have an idea or.",
      "id": "ep_11_ut_216"
    },
    {
      "end": 2831760,
      "speaker": "Stephan Thiel",
      "start": 2830904,
      "text": "The stream view?",
      "id": "ep_11_ut_217"
    },
    {
      "end": 2833364,
      "speaker": "Enrico Bertini",
      "start": 2831832,
      "text": "Yeah, the stream view. Sorry.",
      "id": "ep_11_ut_218"
    },
    {
      "end": 2877814,
      "speaker": "Stephan Thiel",
      "start": 2833704,
      "text": "Yeah. As we said before, we initially hoped people would have it as a sort of second screen, just while doing other stuff. So the stream immediately reacts if there's something going on. And people get basically notified and then their attention changes from whatever they're doing to the visualization and they can start to get immersed into the visualization a bit more and read more tweets and play a lot more. So initially it was like, I wouldn't say ambient, but it's definitely like a second screen application we had in mind for this. And also, it just makes total sense to just really sit in front of. Of it and also read every tweet. It's really playful. And so it's both things.",
      "id": "ep_11_ut_219"
    },
    {
      "end": 2912826,
      "speaker": "Moritz Stefaner",
      "start": 2877974,
      "text": "You could open just briefly to see what are people talking about, about the games at the moment. And honestly, I think it was the best source for that. So also, with this prioritization of the more important tweets, I haven't seen that anywhere. The Guardian had a fairly simple, but quite similar second screen application, but I'm not sure how they selected it. Tweets there, that was a bit more intransparent. So I think just for looking like, okay, what's on at the games? Our application was really, really nice, you know, did you hear from the games.",
      "id": "ep_11_ut_220"
    },
    {
      "end": 2915794,
      "speaker": "Enrico Bertini",
      "start": 2912890,
      "text": "And having the visualization next to it?",
      "id": "ep_11_ut_221"
    },
    {
      "end": 2921922,
      "speaker": "Moritz Stefaner",
      "start": 2915874,
      "text": "Yeah, we had to fix the site. No, we did that a few times.",
      "id": "ep_11_ut_222"
    },
    {
      "end": 2936846,
      "speaker": "Stephan Thiel",
      "start": 2921978,
      "text": "But last time was the closing ceremony for the Paralympics on Sunday, which was really nice. And we just had a look at it and followed it a bit. Bit. And it was really like, yeah, it was really nice. It worked out really well, I think.",
      "id": "ep_11_ut_223"
    },
    {
      "end": 2977444,
      "speaker": "Enrico Bertini",
      "start": 2936950,
      "text": "Okay, so, and I also wanted to talk about the centigraph. Apart from the fact that I loved the term, I really like the visualization tool. And, yeah, I really like this kind of neat, clean and very informative design at the same time. Time, it's really, really nice. And I think this is more part of the analysis that you do statically on the data afterwards. Right. Once the main events have taken place. And. Yeah, I don't know. Do you want to comment how you came up with this one first?",
      "id": "ep_11_ut_224"
    },
    {
      "end": 3088374,
      "speaker": "Moritz Stefaner",
      "start": 2978384,
      "text": "Sure. I mean, it's been, again, like a long road towards these final products. Somehow a lot of different influences played a role. I mean, so it was clear we want to look into the data as the games progress and already look for patterns and also see how we can maybe improve the visualization as things unfold, and also for getting a grip on the data. Stefan mentioned before that in the beginning, we made these simple scatter plots, like time on the horizontal axis and sentiment on, on the vertical axis. That helped us a lot in understanding just the texture of the data, and we found them always very attractive from an aesthetic point of view. But what was hard, because it's little dot clouds, more or less, was hard to see the overall development of things. So at some point, we started to introduce curves that would represent the average sentiment at any given point in time. And in the vertical positions, it's like a fever curve, more or less. But also the line thickness would give you a hint of the number of tweets. And these are like, turned out to be really strong charts because it's like as if somebody would press the pen harder, you know, because of that tension, you know, so it has this really calligraphic look suddenly. And so we always liked that and we never knew how to integrate it really, you know, or what the place of that would be, except our own back end sort of analysis. But then we realized we could make, as the games went along, make some dedicated analysis of individual topics like Usain Bold or Team GB or the little scandals and so on, and see how they are reflected in these Twitter sentiment averages and volumes.",
      "id": "ep_11_ut_225"
    },
    {
      "end": 3096458,
      "speaker": "Stephan Thiel",
      "start": 3088714,
      "text": "And it was also a really important key component for the curation of the stories that we have presented in the installation.",
      "id": "ep_11_ut_226"
    },
    {
      "end": 3097374,
      "speaker": "Moritz Stefaner",
      "start": 3096546,
      "text": "That's true.",
      "id": "ep_11_ut_227"
    },
    {
      "end": 3128304,
      "speaker": "Stephan Thiel",
      "start": 3097674,
      "text": "We needed to be able to explore what we have in terms of data and then just get an interesting perspective onto some different stories and to basically select them for what would be the key moments, the key stories of the Olympics that we would like to present to the audience. Like, look, this is where it works the best, and this is what we've learned and stuff like that. So for this, it was really a good tool and was, I think the team still wants to see that as a proper software for other things as well.",
      "id": "ep_11_ut_228"
    },
    {
      "end": 3129164,
      "speaker": "Moritz Stefaner",
      "start": 3128344,
      "text": "Oh, yeah.",
      "id": "ep_11_ut_229"
    },
    {
      "end": 3146572,
      "speaker": "Stephan Thiel",
      "start": 3130444,
      "text": "There was the idea of websites being able to do that, you know, building interactive versions of this, of the centigraph and just getting in lots of data and seeing the graph for different data sets and stuff like that. Yeah, it's really a really nice piece. Definitely.",
      "id": "ep_11_ut_230"
    },
    {
      "end": 3168114,
      "speaker": "Moritz Stefaner",
      "start": 3146708,
      "text": "It was interesting also for the installation, so we had some ideas of what would make really strong stories. But if you want to have a good, let's say, data story, you know, you also have to see that the data is interesting as well. And for some topics, it worked out really well. And for others, we had a hunch like, oh, there might be a great story here, but the data didn't turn out to be that interesting.",
      "id": "ep_11_ut_231"
    },
    {
      "end": 3172546,
      "speaker": "Enrico Bertini",
      "start": 3168274,
      "text": "So again, you had to manually hunt for interesting stories there.",
      "id": "ep_11_ut_232"
    },
    {
      "end": 3244030,
      "speaker": "Moritz Stefaner",
      "start": 3172610,
      "text": "Exactly. Yeah. And there were people on our team who were looking like, what are the papers reporting about? What are the big things being discussed in traditional media? And then we would try and go back and find out out how well is that reflected in our data? I mean, it's skewed. It's a certain way of analyzing things. Not everything that will be discussed in traditional media or in the general, let's say, discussion of the games will be reflected in the same way in our data set. And that was interesting to see. So, for instance, NBC, they got a bit of a bad rap for their reporting. But the problem was that wasn't reflected that well in our data because the term NBC is used in so many different contexts. For instance, if you just retweet something that NBC has written, you know, you're immediately sort of adding to that topic, NBC. And, and there, it was really hard to separate, let's say, the, the tweets talking about NBC reporting per se, or just retweeting NBC content, you know, you know, and stuff like that. So some stories reflect it really nicely and others not at all. Yeah. Yeah.",
      "id": "ep_11_ut_233"
    },
    {
      "end": 3282414,
      "speaker": "Enrico Bertini",
      "start": 3244062,
      "text": "I really like it because it's very informative and you can, it's engaging and catchy at the same time. And you can, I mean, right now I am in front of me, the team Great Britain craze on Twitter. I would really like to dive into some of these stories and really learn more about, about these bubbles here or sudden negatives or stuff like that. It's really, really rich. I really like it. And I like the fact that you've been using the height and the width of the line at the same time. That's really nice. And it plays really, really well.",
      "id": "ep_11_ut_234"
    },
    {
      "end": 3284754,
      "speaker": "Moritz Stefaner",
      "start": 3282754,
      "text": "Gay for redundant encoding.",
      "id": "ep_11_ut_235"
    },
    {
      "end": 3287494,
      "speaker": "Enrico Bertini",
      "start": 3284914,
      "text": "Yeah, yeah, it's good. It's really good.",
      "id": "ep_11_ut_236"
    },
    {
      "end": 3295038,
      "speaker": "Moritz Stefaner",
      "start": 3287874,
      "text": "Shall we talk about the data sculpture? Because we've been talking so long already about the online. I think it's an important part as well.",
      "id": "ep_11_ut_237"
    },
    {
      "end": 3305114,
      "speaker": "Enrico Bertini",
      "start": 3295126,
      "text": "Yeah, well, the data sculpture is amazing. So yesterday we've been talking about that, me and you, Moritz, and. Yeah, please go ahead. It's really nice.",
      "id": "ep_11_ut_238"
    },
    {
      "end": 3402284,
      "speaker": "Stephan Thiel",
      "start": 3306894,
      "text": "Yeah. I mean, was also, again, a really big part of the project as well and was really interesting because you see lots of sculptures that try to visualize data in some way, and it's really appealing because it deals with materials. You can use materials to reflect different things and stuff like that, and also how to deal with the third dimension just to visualize some certain things. And so it was really interesting to dive into all these aspects with the data sculpture. And I think the form we've come up with is really interesting because it's not just aesthetically looking good in a three dimensional way, but it's also kind of readable and to such an extent that we think we have thought about this, like, also offering it to, for instance, blind people to experience the dataset by touching and stuff like that. So the data sculpture is one object for each day, which we have milled with a manufacturer in Germany. And so it's basically a heat map, a three dimensional heat map, with each plate having a shorter side on the time axis and then the sentiment on a horizontal scale. And so you have, per sentiment, you have different bands that move along on the time axis and go up and down according to the volume of tweets we have for that specific sentiment at that specific time.",
      "id": "ep_11_ut_239"
    },
    {
      "end": 3403940,
      "speaker": "Moritz Stefaner",
      "start": 3402364,
      "text": "Like a little roller coaster, basically.",
      "id": "ep_11_ut_240"
    },
    {
      "end": 3440834,
      "speaker": "Stephan Thiel",
      "start": 3403972,
      "text": "A little roller coaster. Exactly. So you have a little landscape. A roller coaster landscape. And on this object, we project different heat maps, as I would call them, for the individual stories. So you have the entire amount of tweets in the sculpture, represented in the sculpture, and then by projecting on top of the sculpture and just highlighting individual points per story, we sort of, like, you know, shape or highlight the individual important points for this specific story. So this is 16 pieces.",
      "id": "ep_11_ut_241"
    },
    {
      "end": 3443134,
      "speaker": "Moritz Stefaner",
      "start": 3441294,
      "text": "1717.",
      "id": "ep_11_ut_242"
    },
    {
      "end": 3463330,
      "speaker": "Stephan Thiel",
      "start": 3443214,
      "text": "Sorry? Yeah, exactly. 17 plates, 17 objects. And so it's a three meter long table, and people can click through the different stories and see the heat maps and also have a little turning wheel with which they can move through time. And then we select specific tweets to display so they can see, like, what is this? Why is this peaked there?",
      "id": "ep_11_ut_243"
    },
    {
      "end": 3487706,
      "speaker": "Moritz Stefaner",
      "start": 3463442,
      "text": "Yeah. And that's how strong compared to the graphs, you know, where you say, Enrico, you would immediately like to dig in. Yeah. And see why the tweet look, you know, or why that dip in the data came about. And in this installation, you can actually read the most important tweet for each story, for any time point, and then that, or each hour of the day. And that was. It's so much fun to flip through all these tweets.",
      "id": "ep_11_ut_244"
    },
    {
      "end": 3489924,
      "speaker": "Enrico Bertini",
      "start": 3487810,
      "text": "So where is the installation located?",
      "id": "ep_11_ut_245"
    },
    {
      "end": 3505604,
      "speaker": "Stephan Thiel",
      "start": 3491264,
      "text": "It was located in Preston, in UK at the closing exhibition of we play. So it's the closing exhibition of the cultural Olympiad in the northwest, in UK. So there was a big party going on in Preston last weekend.",
      "id": "ep_11_ut_246"
    },
    {
      "end": 3509364,
      "speaker": "Moritz Stefaner",
      "start": 3506064,
      "text": "And now, Enrico, it's a bit like you. It has no real home.",
      "id": "ep_11_ut_247"
    },
    {
      "end": 3515084,
      "speaker": "Enrico Bertini",
      "start": 3511504,
      "text": "You're going to have a new office soon, so if you want to send it.",
      "id": "ep_11_ut_248"
    },
    {
      "end": 3517204,
      "speaker": "Moritz Stefaner",
      "start": 3515504,
      "text": "You need something for your lobby?",
      "id": "ep_11_ut_249"
    },
    {
      "end": 3519866,
      "speaker": "Stephan Thiel",
      "start": 3519034,
      "text": "Yeah.",
      "id": "ep_11_ut_250"
    },
    {
      "end": 3526986,
      "speaker": "Moritz Stefaner",
      "start": 3520050,
      "text": "No, no. We're looking for a good place to exhibit it permanently because I think it's a nice legacy for the games.",
      "id": "ep_11_ut_251"
    },
    {
      "end": 3527946,
      "speaker": "Enrico Bertini",
      "start": 3527090,
      "text": "Absolutely.",
      "id": "ep_11_ut_252"
    },
    {
      "end": 3531282,
      "speaker": "Moritz Stefaner",
      "start": 3528050,
      "text": "It would be a pity if it would now sit in a box. I mean.",
      "id": "ep_11_ut_253"
    },
    {
      "end": 3531778,
      "speaker": "Stephan Thiel",
      "start": 3531418,
      "text": "Yeah.",
      "id": "ep_11_ut_254"
    },
    {
      "end": 3532194,
      "speaker": "Moritz Stefaner",
      "start": 3531826,
      "text": "Yeah.",
      "id": "ep_11_ut_255"
    },
    {
      "end": 3532746,
      "speaker": "Enrico Bertini",
      "start": 3532274,
      "text": "Wow.",
      "id": "ep_11_ut_256"
    },
    {
      "end": 3533854,
      "speaker": "Stephan Thiel",
      "start": 3532850,
      "text": "Totally agree.",
      "id": "ep_11_ut_257"
    },
    {
      "end": 3537054,
      "speaker": "Enrico Bertini",
      "start": 3534154,
      "text": "I could talk with some people at MoMA or.",
      "id": "ep_11_ut_258"
    },
    {
      "end": 3584480,
      "speaker": "Moritz Stefaner",
      "start": 3539194,
      "text": "Yeah. But I have to say, this 3d relief, you know, you might. It sounds. It might sound gimme tricky, but when you see that thing and this level of detail, you know, that you can put into a sculpture and then add this projection, I think it was. So I had the feeling, okay, we need to explore that more. You know, what is possible there because it's really interesting and it is worth the effort. You know, before, we were also not sure, is it worth going through all the effort, like, you know, preparing the 3d models and testing materials and calibrating the projection? You know, that's. There's a lot of technicalities there, but from the experience, I think it was worth the effort.",
      "id": "ep_11_ut_259"
    },
    {
      "end": 3590164,
      "speaker": "Enrico Bertini",
      "start": 3584512,
      "text": "So definitely, I was wondering, when you are in front of it, do you feel like touching it?",
      "id": "ep_11_ut_260"
    },
    {
      "end": 3591444,
      "speaker": "Moritz Stefaner",
      "start": 3590504,
      "text": "Totally.",
      "id": "ep_11_ut_261"
    },
    {
      "end": 3594624,
      "speaker": "Stephan Thiel",
      "start": 3593104,
      "text": "To be fully honest, yes.",
      "id": "ep_11_ut_262"
    },
    {
      "end": 3595456,
      "speaker": "Enrico Bertini",
      "start": 3594784,
      "text": "Okay.",
      "id": "ep_11_ut_263"
    },
    {
      "end": 3607634,
      "speaker": "Stephan Thiel",
      "start": 3595560,
      "text": "Would be good to explore that even further. It would be just lovely if we find a way to do that technically and then all these questions arise, like how do you deal with it on the interaction side, what to display and stuff like that.",
      "id": "ep_11_ut_264"
    },
    {
      "end": 3616594,
      "speaker": "Enrico Bertini",
      "start": 3608294,
      "text": "You guys have to find a way to keep on doing this project in a way or another. It's fantastic. I would love to see it, actually.",
      "id": "ep_11_ut_265"
    },
    {
      "end": 3621034,
      "speaker": "Stephan Thiel",
      "start": 3617094,
      "text": "It feels like the beginning, to be honest, not like the end.",
      "id": "ep_11_ut_266"
    },
    {
      "end": 3660356,
      "speaker": "Enrico Bertini",
      "start": 3625734,
      "text": "Okay, cool. And, yeah, so, talking about the future, how do you go beyond this project? I'm sure, I mean, you've been doing a lot of work, a lot of cool stuff, a lot of thinking around it. And I'm sure you want to. I mean, I want you. I'm sure you want to reuse this stuff or I'm sure that some of the ideas that you've been generating during the project can actually be the beginning of new projects. Right. So do you briefly want to discuss that? How do you go beyond this Emoto itself?",
      "id": "ep_11_ut_267"
    },
    {
      "end": 3681164,
      "speaker": "Moritz Stefaner",
      "start": 3660500,
      "text": "Yeah, I mean, there were a few directions. I mean, we have to say at the moment we are really tired and mostly working on documenting and sort of wrapping up that phase now because it's been a long thing. And like, let's say the two weeks before the games, they were, they were tough. You know, we had to get this thing working. And.",
      "id": "ep_11_ut_268"
    },
    {
      "end": 3683704,
      "speaker": "Enrico Bertini",
      "start": 3681904,
      "text": "How much coffee did you drink?",
      "id": "ep_11_ut_269"
    },
    {
      "end": 3684804,
      "speaker": "Moritz Stefaner",
      "start": 3683864,
      "text": "Oh, man.",
      "id": "ep_11_ut_270"
    },
    {
      "end": 3685964,
      "speaker": "Enrico Bertini",
      "start": 3685104,
      "text": "Liters.",
      "id": "ep_11_ut_271"
    },
    {
      "end": 3737150,
      "speaker": "Moritz Stefaner",
      "start": 3686984,
      "text": "Gallons. Yeah. No, but, but there were a few directions. I mean, obviously everybody's interested in sentiment analysis. I think it's, you know, real time, and sentiment analysis is one of the things of the year, I guess, you know, definitely. And so that's, on the one hand, something that's really interesting, but also an area where you have to think about what you're doing. Right. But I think we collected some really good experiences with what works in real time, what works, and analysis wise as well. And I think we'd like to do another project in this direction. I mean, unfortunately, the us elections are now coming so soon. Otherwise they would be perfect. They would be perfect. But I think. Or something sports related. Why not? I mean, it works quite well.",
      "id": "ep_11_ut_272"
    },
    {
      "end": 3740350,
      "speaker": "Stephan Thiel",
      "start": 3737262,
      "text": "It's applicable definitely to lots of topics and lots of situations.",
      "id": "ep_11_ut_273"
    },
    {
      "end": 3742544,
      "speaker": "Enrico Bertini",
      "start": 3740382,
      "text": "So the next World Cup. Cup.",
      "id": "ep_11_ut_274"
    },
    {
      "end": 3771034,
      "speaker": "Moritz Stefaner",
      "start": 3745644,
      "text": "What I'm personally not sure yet about is if this big extra effort that goes into building a solid real time system, you know, that is really, really real time, pays off. But I'm also not sure what is sort of in between. But I had the feeling that the analysis wise, these things you would do over a couple of days and would involve a bit more manual analysis were more interesting content wise.",
      "id": "ep_11_ut_275"
    },
    {
      "end": 3772950,
      "speaker": "Enrico Bertini",
      "start": 3772174,
      "text": "You mean that?",
      "id": "ep_11_ut_276"
    },
    {
      "end": 3797380,
      "speaker": "Moritz Stefaner",
      "start": 3773022,
      "text": "And I'm not sure yet how to. Yeah. What the sweet spot there is, but it's a lot of technical effort goes into building a really good real time system. And then visualization wise, it's always like, okay, you get the statistics for now, but what do they mean? You know, how do you refer back to that sort of more intermediate history and the long term history and stuff like that so that we didn't tackle that well, I guess. Yeah.",
      "id": "ep_11_ut_277"
    },
    {
      "end": 3803424,
      "speaker": "Enrico Bertini",
      "start": 3797412,
      "text": "And with real time, you always have this problem of overwhelming people. Right. Or underwhelming that.",
      "id": "ep_11_ut_278"
    },
    {
      "end": 3811904,
      "speaker": "Moritz Stefaner",
      "start": 3804684,
      "text": "No, exactly. So there's a big challenge there. It's not something that works out of the box at all. I mean, not at all.",
      "id": "ep_11_ut_279"
    },
    {
      "end": 3819344,
      "speaker": "Enrico Bertini",
      "start": 3812804,
      "text": "Yeah. And there is another thing I wanted to ask you. Are you planning to release this data openly or not?",
      "id": "ep_11_ut_280"
    },
    {
      "end": 3840396,
      "speaker": "Moritz Stefaner",
      "start": 3820204,
      "text": "I mean, we have a set of the tweets. We are also sharing it with a couple of scientists already that look into it now for long term things. I think if people address us, I guess we would be open to sharing it. Right, Stefan? I mean, we haven't really discussed the general case, but I mean, why not? It would be great if people do something with it.",
      "id": "ep_11_ut_281"
    },
    {
      "end": 3851250,
      "speaker": "Enrico Bertini",
      "start": 3840460,
      "text": "I mean, I'm sure from my side, from the academic point of view, I'm sure there would be so many people around here that would be interested in analyzing that.",
      "id": "ep_11_ut_282"
    },
    {
      "end": 3852946,
      "speaker": "Moritz Stefaner",
      "start": 3851362,
      "text": "Yeah, good point.",
      "id": "ep_11_ut_283"
    },
    {
      "end": 3856338,
      "speaker": "Enrico Bertini",
      "start": 3853010,
      "text": "I mean, I mean, it's a really odd topic in academia as well.",
      "id": "ep_11_ut_284"
    },
    {
      "end": 3863322,
      "speaker": "Moritz Stefaner",
      "start": 3856426,
      "text": "So we should mention, though, that we lost two nights of tweets. Yeah, that was one of the reflected.",
      "id": "ep_11_ut_285"
    },
    {
      "end": 3877586,
      "speaker": "Stephan Thiel",
      "start": 3863338,
      "text": "In the sculptures as well. We see it as a bit of honesty that there's some flat areas, little small flat areas in the sculptures. Two of them. So it was really nice there as well because it shows that it's all real world and not made up, but.",
      "id": "ep_11_ut_286"
    },
    {
      "end": 3880370,
      "speaker": "Enrico Bertini",
      "start": 3877610,
      "text": "This is how real data looks like came in.",
      "id": "ep_11_ut_287"
    },
    {
      "end": 3881690,
      "speaker": "Moritz Stefaner",
      "start": 3880562,
      "text": "Yeah, exactly.",
      "id": "ep_11_ut_288"
    },
    {
      "end": 3888294,
      "speaker": "Stephan Thiel",
      "start": 3881762,
      "text": "So, yeah, if you can live with that, then just write us an email at infoemoto 2012. Dot, dot.",
      "id": "ep_11_ut_289"
    },
    {
      "end": 3895098,
      "speaker": "Enrico Bertini",
      "start": 3888714,
      "text": "Fantastic. Okay. I think we can close it here, right? Unless you want to add anything, Moritz, Stefan.",
      "id": "ep_11_ut_290"
    },
    {
      "end": 3907554,
      "speaker": "Moritz Stefaner",
      "start": 3895226,
      "text": "I guess I do. No, we could go on for hours, probably, because there were so many things, you know, in this project. But, yeah, again, we don't want to over or underwhelm and we don't want to welcome anybody.",
      "id": "ep_11_ut_291"
    },
    {
      "end": 3932114,
      "speaker": "Enrico Bertini",
      "start": 3909534,
      "text": "Okay, well, thanks a lot for this fantastic project. It was a real pleasure to discuss this thing with you guys. It's amazing what you've done and, yeah, I'm curious to see what you will be doing next. Thanks, Stefan, for being a guest here and for being available with such a short notice.",
      "id": "ep_11_ut_292"
    },
    {
      "end": 3935302,
      "speaker": "Stephan Thiel",
      "start": 3932614,
      "text": "Yeah, thanks. It was lovely. Thanks for having me.",
      "id": "ep_11_ut_293"
    },
    {
      "end": 3939874,
      "speaker": "Enrico Bertini",
      "start": 3935398,
      "text": "Yeah, I hope I will have a chance to meet you somewhere around the world soon.",
      "id": "ep_11_ut_294"
    },
    {
      "end": 3942718,
      "speaker": "Stephan Thiel",
      "start": 3940254,
      "text": "Yes, hopefully that's New York. I love New York.",
      "id": "ep_11_ut_295"
    },
    {
      "end": 3944394,
      "speaker": "Enrico Bertini",
      "start": 3942806,
      "text": "Yeah, sure, sure.",
      "id": "ep_11_ut_296"
    },
    {
      "end": 3948114,
      "speaker": "Moritz Stefaner",
      "start": 3945014,
      "text": "We should work on that part. Yeah, definitely.",
      "id": "ep_11_ut_297"
    },
    {
      "end": 3949702,
      "speaker": "Enrico Bertini",
      "start": 3949254,
      "text": "Cool.",
      "id": "ep_11_ut_298"
    },
    {
      "end": 3953434,
      "speaker": "Moritz Stefaner",
      "start": 3949758,
      "text": "Yeah, it was great having you, Stefan. Fantastic. Yeah.",
      "id": "ep_11_ut_299"
    },
    {
      "end": 3954270,
      "speaker": "Stephan Thiel",
      "start": 3953734,
      "text": "Thank you.",
      "id": "ep_11_ut_300"
    },
    {
      "end": 3957678,
      "speaker": "Moritz Stefaner",
      "start": 3954302,
      "text": "Bye. Talk soon. And bye, everyone.",
      "id": "ep_11_ut_301"
    },
    {
      "end": 3959166,
      "speaker": "Enrico Bertini",
      "start": 3957806,
      "text": "Bye, everyone. Ciao. Ciao.",
      "id": "ep_11_ut_302"
    },
    {
      "end": 3959758,
      "speaker": "Moritz Stefaner",
      "start": 3959230,
      "text": "Bye, everyone.",
      "id": "ep_11_ut_303"
    },
    {
      "end": 3960884,
      "speaker": "Stephan Thiel",
      "start": 3959846,
      "text": "Ciao. Bye.",
      "id": "ep_11_ut_304"
    }
  ],
  "confidence": 0.918536077513565,
  "audio_duration": 3968,
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_status_code": null,
  "webhook_auth": false,
  "webhook_auth_header_name": null,
  "speed_boost": false,
  "auto_highlights_result": null,
  "auto_highlights": false,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_audio_quality": null,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "content_safety": false,
  "iab_categories": true,
  "content_safety_labels": {
    "status": "unavailable",
    "results": [],
    "summary": {}
  },
  "language_detection": false,
  "language_detection_threshold": null,
  "language_confidence": null,
  "custom_spelling": null,
  "throttled": false,
  "auto_chapters": true,
  "summarization": false,
  "summary_type": null,
  "summary_model": null,
  "custom_topics": false,
  "topics": [],
  "speech_threshold": null,
  "speech_model": "best",
  "chapters": [
    {
      "summary": "Hi, everyone. How are you? Good, good, good. There is still some sun outside and. Yeah, it's fine. Data stories number eleven.",
      "gist": "Democracy in the Dark",
      "headline": "How are you doing today, Moritz and Enrico",
      "start": 17400,
      "end": 38018,
      "id": "ep_11_ch_0"
    },
    {
      "summary": "There is a delay in the visa process and I'm living in an empty apartment with my wife and three kids, one of whom is an infant. We set up the final sort of chapter of the Emoto project, which we will talk about today. Next week I'll be going to Helsinki for the data cuisine workshop and open knowledge conference.",
      "gist": "Talking to the artists at the Olympics",
      "headline": "You're still in Europe, which is good. For Europe, but bad for you",
      "start": 38066,
      "end": 108776,
      "id": "ep_11_ch_1"
    },
    {
      "summary": "This week I'm organizing a workshop together with some people on visualization evaluation. I'm also organizing a panel on reproducibility in visualization research. There is actually a quite strong trend in computer science in general. But the episode is not about that. We are going to talk about Emoto.",
      "gist": "Immoto and reproducibility in visualization",
      "headline": "Moritz is organizing a workshop on reproducibility in visualization research",
      "start": 108920,
      "end": 296040,
      "id": "ep_11_ch_2"
    },
    {
      "summary": "We have a special guest. Stefan Thiel was part of the design team for Emoto. He did some really interesting text analysis on Shakespeare texts. Now he's part of studio NAND, the best computational design company in the world. It's been one of the big projects this year for all of us.",
      "gist": "A Special Guest",
      "headline": "We have a special guest, Stefan Thiel. Hi, Stefan. Thanks for having me",
      "start": 296112,
      "end": 404910,
      "id": "ep_11_ch_3"
    },
    {
      "summary": "Moritz: The basic idea was to visualize the online response to the London Olympics. At the beginning, the idea was really to capture the whole stadium atmosphere and the excitement of viewing. But as the project progressed, it moved towards a more analytical view.",
      "gist": "How To Visualize the Olympics",
      "headline": "The project was started to visualize online response to the London 2012 Olympic Games",
      "start": 404982,
      "end": 569664,
      "id": "ep_11_ch_4"
    },
    {
      "summary": "The project has been led by Drew Hammond and NAND Studio. It has been supported by Lexalytics for the data analysis, for the sentiment analysis. Luckily, the project did not get the official London 2012 commission.",
      "gist": "The London 2012 project",
      "headline": "So who is behind the project? I mean, practically speaking who's been working on it",
      "start": 571964,
      "end": 797882,
      "id": "ep_11_ch_5"
    },
    {
      "summary": "Dot Emoto 2012 is a visualization which is mainly consisted of two components. There is a real time message stream which focuses on seeing Twitter messages in real time, flying by. Second screen is the word of the year, probably.",
      "gist": "Emoto 2012",
      "headline": "Dot Emoto 2012 is a visualization tool used to visualize Olympic topics",
      "start": 797978,
      "end": 1062400,
      "id": "ep_11_ch_6"
    },
    {
      "summary": "How did you actually test your system before going online? You would never have enough confidence without some kind of real data. That's a big issue with real time data that it's hard to test.",
      "gist": "How to test your system during the Olympics",
      "headline": "How did you actually test your system before going online",
      "start": 1062472,
      "end": 1248084,
      "id": "ep_11_ch_7"
    },
    {
      "summary": "How do you actually get this data from Twitter? I guess this is a small percentage of the old stream, right? How do you access this data and what kind of processing you do on top of it?",
      "gist": "How To Filter Out Sentiment from Twitter Data",
      "headline": "How do you access this data from Twitter and what kind of processing you do",
      "start": 1248584,
      "end": 1615402,
      "id": "ep_11_ch_8"
    },
    {
      "summary": "One of the visualizations is about topic. Do you have also some kind of topic detection algorithm there? This was a large part of the project to explore how data gathering and analysis and visualization can be used in a different way.",
      "gist": "How Twitter covered the Olympics",
      "headline": "I was wondering whether you automatically detect interesting topics there or supervised algorithm",
      "start": 1615458,
      "end": 1843804,
      "id": "ep_11_ch_9"
    },
    {
      "summary": "The main things I've seen on the website is this origami visualization, then the real time tweets, then you have in the blog what you call the centigraph, and the heat map. Do you guys want to move to visualization and talk about the design and the development of your visualizations? Sure.",
      "gist": "In the Elevator With Twitter's Visualizations",
      "headline": "Okay. Do we guys want to move to visualization and talk about the design",
      "start": 1846424,
      "end": 1883030,
      "id": "ep_11_ch_10"
    },
    {
      "summary": "How did you come up with these ideas? I'm really curious about the origami thing. Stefan, you want to start? Yeah, yeah, I can. The initial key moment was when we finally saw the first version of the sentigraph. And then the topics and their discussions start to shape out from the data.",
      "gist": "How To Make a Beautiful Textured Figure",
      "headline": "So do you briefly want to talk about how you went about creating this visualization",
      "start": 1883182,
      "end": 2124650,
      "id": "ep_11_ch_11"
    },
    {
      "summary": "The first time I saw the visualizations on the website, I liked the design. But my first reaction was like, oh, I expected to have more data density here. It's too aggregated. We wanted to make sure that every click is sort of interesting.",
      "gist": "Facebook's social media visualizations during the election",
      "headline": "There's not enough data density in the visualization for an event like this",
      "start": 2124762,
      "end": 2202582,
      "id": "ep_11_ch_12"
    },
    {
      "summary": "Jonas: I think Jonas can take credit for the origami principle, part of the studio NAND team. How did you come up with the color scheme? At some point, we weren't sure anymore what should be positive and negative colors. Did you think about crowdsourcing that?",
      "gist": "How the Origami Logo was created",
      "headline": "Yun: How did you come up with the origami concept",
      "start": 2202758,
      "end": 2550858,
      "id": "ep_11_ch_13"
    },
    {
      "summary": "How did you come up with the idea of having these moving small windows, and then when you click on them, you can fix some of them, it looks like. What's the main purpose of this visualization and how not to overwhelm people?",
      "gist": "How Twitter's data visualization works",
      "headline": "How did you come up with the idea of having moving small windows",
      "start": 2551026,
      "end": 2936846,
      "id": "ep_11_ch_14"
    },
    {
      "summary": "The centigraph visualization tool is a neat, clean and very informative design. It was also a key component for the curation of the stories that we have presented in the installation. Not everything discussed in traditional media will be reflected in the data set.",
      "gist": "The Centigraph",
      "headline": "NBC developed a visualization tool to help analyze Twitter data during the Olympics",
      "start": 2936950,
      "end": 3287494,
      "id": "ep_11_ch_15"
    },
    {
      "summary": "Enrico: The data sculpture is one object for each day, which we have milled with a manufacturer in Germany. On this object, we project different heat maps, as I would call them, for the individual stories. We're looking for a good place to exhibit it permanently.",
      "gist": "The Data Sculpture",
      "headline": "Shall we talk about the data sculpture? Because we've been talking about the online",
      "start": 3287874,
      "end": 3627238,
      "id": "ep_11_ch_16"
    },
    {
      "summary": "How do you go beyond this project? I mean, obviously everybody's interested in sentiment analysis. Are you planning to release this data openly or not? It would be great if people do something with it.",
      "gist": "The Emoto Project",
      "headline": "How do you go beyond this Emoto project",
      "start": 3627326,
      "end": 3889770,
      "id": "ep_11_ch_17"
    },
    {
      "summary": "Okay. I think we can close it here, right? Unless you want to add anything, Moritz, Stefan. Thanks, Stefan, for being a guest here and for being available with such a short notice. Talk soon.",
      "gist": "A Taste of the Project",
      "headline": "I think we can close it here, right? Unless you want to add anything",
      "start": 3889882,
      "end": 3960884,
      "id": "ep_11_ch_18"
    }
  ],
  "disfluencies": false,
  "entity_detection": false,
  "sentiment_analysis": false,
  "sentiment_analysis_results": null,
  "entities": null,
  "speakers_expected": null,
  "summary": null,
  "custom_topics_results": null,
  "episode_num": 11,
  "episode_metadata": {
    "speakers": [
      "Enrico Bertini",
      "Moritz Stefaner",
      "Stephan Thiel"
    ],
    "WPid": "100",
    "url": "https://datastori.es/podlove/file/182/s/feed/c/mp3/datastories-11.mp3",
    "episode_title": "emoto (with Stephan Thiel from Studio NAND)"
  }
}