{
  "id": "b440576d-d299-4a1a-be91-33808a716fd7",
  "language_model": "assemblyai_default",
  "acoustic_model": "assemblyai_default",
  "language_code": "en_us",
  "status": "completed",
  "audio_url": "https://datastori.es/podlove/file/5656/s/feed/c/mp3/144-history-of-information-graphics-with-sandra-rendgen.mp3",
  "utterances": [
    {
      "end": 14210,
      "speaker": "Sandra Rendgen",
      "start": 160,
      "text": "There we come into a situation where there's data available and where some people wonder how they can work with this data and how they can find graphic representations to make it easier to use these data and to reason with them and make decisions with them.",
      "id": "ep_144_ut_0"
    },
    {
      "end": 47666,
      "speaker": "Moritz Stefaner",
      "start": 33330,
      "text": "Hi, everyone. Welcome to a new episode of Data stories. My name is Moritz Stefaner, and I'm an independent designer of data visualizations. And in fact, I work as a self employed truth and beauty operator out of my office here in the countryside in the north of Germany.",
      "id": "ep_144_ut_1"
    },
    {
      "end": 55510,
      "speaker": "Enrico Bertini",
      "start": 47778,
      "text": "And I am Enrico Bertini. I am a professor at NYU in New York City, where I do research and teach data visualization.",
      "id": "ep_144_ut_2"
    },
    {
      "end": 66982,
      "speaker": "Moritz Stefaner",
      "start": 55970,
      "text": "Right. And on this podcast, we talk about data visualization, but also data analysis and generally the role data plays in our lives. And usually we do that together with the guests we invite on the show.",
      "id": "ep_144_ut_3"
    },
    {
      "end": 88452,
      "speaker": "Enrico Bertini",
      "start": 67126,
      "text": "But before we start, a quick note. Our podcast is listed supported, so there are no ads. If you enjoy the show, please consider supporting us with recurring payments on patreon.com Datastories. Or you can also send us a one time donation on PayPal. Going to PayPal me Datastories.",
      "id": "ep_144_ut_4"
    },
    {
      "end": 141132,
      "speaker": "Moritz Stefaner",
      "start": 88606,
      "text": "That's right. It's always lovely when we receive a little donation or a new contribution, and if you can't, that's fine, too. But maybe then supporting us on social media, why not retweet one of our tweets or point out your favorite episodes? There's many ways you can help us keep the show running and growing. Anyways, let's get started. The topic today is one that we had on the list for a very long time. In fact, I think we never really covered it, although it's such a fascinating topic to talk about. We talk so much about the present and the future of data visualization, but we really never looked into the past, and there's this huge and rich history. We're really standing on the shoulders of giants, obviously. And today we have a guest who is very knowledgeable about the history of information graphics and data visualization, and I'm really glad she can join us today. Welcome, Sandra Rendgen.",
      "id": "ep_144_ut_5"
    },
    {
      "end": 141980,
      "speaker": "Enrico Bertini",
      "start": 141196,
      "text": "Welcome, Sandra.",
      "id": "ep_144_ut_6"
    },
    {
      "end": 142812,
      "speaker": "Sandra Rendgen",
      "start": 142060,
      "text": "Thank you.",
      "id": "ep_144_ut_7"
    },
    {
      "end": 148112,
      "speaker": "Moritz Stefaner",
      "start": 142956,
      "text": "Hi, Sandra. Great to have you here. Can you tell us a bit about your background and what you're currently doing?",
      "id": "ep_144_ut_8"
    },
    {
      "end": 254542,
      "speaker": "Sandra Rendgen",
      "start": 148276,
      "text": "Yes, I'm very happy to be joining today, and I'm an independent author and concept developer. I live in Berlin, and my academical background is in art history and cultural theory. But I specialized at some point in data visualization and information graphics, and I did that by writing two books about the contemporary work, trying to watch what's happening in the field. And those books came out a few years ago. Then, since I have this background as a historian, I really wanted to look into the history because I felt like there's a lack of knowledge, but also a very, there's a lot of people who really crave knowledge about it. Like, I see there's a lot of tweets and blog posts about interesting works. And so I felt like there's a need of lack of knowledge and a need for literature. And so I dived into the history for. Yeah, for the past few years, actually. And, yeah, I've written two books that are just coming out, or just have come out. One is specializing on one of the most important forefathers, like, everyone's heard the name before, and that is Charles d'Er Minar. And most people know his very famous Napoleon graphic, which is very important in the history, but he's done so much more. And all this work of his was buried in an archive in Paris. And so I felt like there's a real need to get that out and show it to the world. Like, how has his work evolved? How did he come up with doing this graphic? And the other work that I've been working on for the past years is a more broader overview of the history of information graphics. And that has just come out.",
      "id": "ep_144_ut_9"
    },
    {
      "end": 265600,
      "speaker": "Moritz Stefaner",
      "start": 254646,
      "text": "Yeah. And this one's called the history of information graphics in Taschenfelag. Right. Which is really a wonderful book. You've been an editor, and it features contributions from a few people, right?",
      "id": "ep_144_ut_10"
    },
    {
      "end": 346892,
      "speaker": "Sandra Rendgen",
      "start": 265750,
      "text": "Yes, exactly. Like, I have set up the concept with my editor, Attachen Julius Wiedemann. But we decided we needed some more contributions to that, and we invited four people who are really experts in the field and who have collected and written upon work for several years, or many years, in fact. And that's David Rumsey, who is well known as a collector of historical maps. That is Michael Friendley, who is a statistician and a psychologist from Canada. And he's written a lot about the history of data visualization, specifically like numerical thinking. And then we have Michel Stahl, who's a designer and professor here in Germany, and he's been collecting historical infographics for a very long time. He has an incredible collection of printed work. And then we also have Scott Klein in the book, who is a journalist in the United States, and he has collected a very specific strand of historical infographics, and that is infographics from newspapers, which is a very cool contribution because it's difficult to research and sort of ephemeral in that newspapers are not that well collected and preserved, and so he contributed a chapter on that.",
      "id": "ep_144_ut_11"
    },
    {
      "end": 378704,
      "speaker": "Moritz Stefaner",
      "start": 347076,
      "text": "Great. Yeah, and, I mean, both books are really gorgeous, so make sure to check them out when you see them in a bookstore or something. They're huge as well. I love these big format, coffee table type books, and these ones also have great commentary. So history of information, graphics, huge topic. Everything starts probably with the cave paintings, as usual. And there's a lot of early maps, but just to reduce the scope a bit, I think. What would you say, sandra? When should we start a quick overview of the whole history?",
      "id": "ep_144_ut_12"
    },
    {
      "end": 541400,
      "speaker": "Sandra Rendgen",
      "start": 378832,
      "text": "So, yeah, that's always difficult to say because we do have very early works. Right. We have the cave paintings. We have a very early metal shield that was excavated here in Germany that shows constellations of stars and things like that. We have very early, like, stone maps from Babylon. But it's very difficult where to exactly start. I mean, all these works apparently do encode information visually. I have decided to go a little. To go a little forward and start at the moment in time where we actually have a very full body of work that has come down to us. Right. And that is starting around the year 800 in Europe, in the European Middle Ages. And from that moment in time, we have a lot of works coming up, like a lot of parchment rolls, a lot of kodizes, and a lot of books that are still preserved. And that, like, before that, we do have works, but they are single works. And it's very difficult to, you know, just set up the connections. And from the middle Ages on, we can sort of observe a real culture, like a culture of texts, a culture of books. But the diagrams and maps do play a very important role in that. And that's where I started, and it's really nice to see that because there's so much in the archives. And I also have to say that just a practical aspect is that the digitization of archives in the last few years has played, like, a crucial role, because I couldn't have done this if not the archives had all digitized their content and put it online. So that makes it really all these treasures that are hidden there are now coming to light, and you can see them online, find them online. And so there's a whole wealth of stuff that's popping up and becoming visible now. And so, yes, that's sort of the first epoch that I came up with and that I started with. And there's a lot of theological stuff going on, a lot of, like, christian theology explaining christian faith. And there's very difficult theological, you know, debates and discussions, and those are often supported by very elaborate, large scale diagrams. But also there's a lot of astrological and astronomical stuff, like, you know, stars, constellations, and. And also an interesting topic that is very strange to me today, and that is calendar calculations for the date of Easter. And those produced a lot of intricate graphics as well.",
      "id": "ep_144_ut_13"
    },
    {
      "end": 556552,
      "speaker": "Moritz Stefaner",
      "start": 542700,
      "text": "Yeah. And looking at the examples you have there. So on your website, we'll link that there's an excerpt from the book with a few of the Middle Ages examples. It struck me that it's not really numbers based. Right. It's much more like conceptual structure.",
      "id": "ep_144_ut_14"
    },
    {
      "end": 659902,
      "speaker": "Sandra Rendgen",
      "start": 556616,
      "text": "Exactly, exactly. And that's super interesting, because what these diagrams do is they take an order that they perceive, like the authors. Right. They perceive some structure or they perceive some order in the universe, in the constellation of the stars, or in the structure of the concepts of christian faith, and they take this order and give it a visual structure. They put this order onto paper, and this is something that they don't see. It's not like something they actually observe in reality, but they, you know, it's an intellectual concept, and they give it a visual structure and put it on the page. And what is also really thrilling for us in this medieval work, something that I have a hard time to wrap my head around, it's a manuscript culture. Everything is hand painted. There's. Everything is unique. There's no copy, there's no other thing. If one thing gets lost, it's lost forever. And so what these, what medieval culture is about is like preserving knowledge because it's so precious. Right. It can get lost at any point in time. And so they keep copying things like it's copied again and again and again. So you have specific schemes that pop up again and again, but every time they copy it, they make a little amendment to it, or they customize it a little bit as to fit with other writings and stuff. And that's also really fascinating, that everything is unique, but then everything is a little different, and that's very hard to imagine. Today. We're so used to printed stuff and now to digital stuff, and that everything is just one hand painted thing that by chance has survived is really thrilling for me.",
      "id": "ep_144_ut_15"
    },
    {
      "end": 670942,
      "speaker": "Enrico Bertini",
      "start": 660086,
      "text": "Sandra, do we know anything about the actual craft of how these diagrams would actually be painted? I mean, what kind of material they would use?",
      "id": "ep_144_ut_16"
    },
    {
      "end": 725990,
      "speaker": "Sandra Rendgen",
      "start": 671086,
      "text": "Yes, absolutely. I have to say, I'm not an expert in the material and the material background of this, but, you know, one thing that is certain is that most the material they drew upon or painted upon was parchment. I mean, that is what the books were made of, parchment. We have a lot of parchment rolls as well. Like, some were hung on the wall, some rolls were like really large things, sometimes in several segments. But then you have rolls of like, there is 30 cm high and then something like 7 meters long or something like incredible wide formats. And then they would roll that as to transport it. We have, for instance, a road map that is rolled and then you put it in your backpack. And so they would, most of the times they would work on parchment, and then they would use ink and watercolors most of the time.",
      "id": "ep_144_ut_17"
    },
    {
      "end": 731994,
      "speaker": "Moritz Stefaner",
      "start": 726370,
      "text": "I just have to think of our episode with efferve lot alum, because some of these early works remind me of sketchnotes.",
      "id": "ep_144_ut_18"
    },
    {
      "end": 732866,
      "speaker": "Enrico Bertini",
      "start": 732122,
      "text": "Exactly.",
      "id": "ep_144_ut_19"
    },
    {
      "end": 741494,
      "speaker": "Moritz Stefaner",
      "start": 732978,
      "text": "With the tight integration of type, harvest and imagery and this whole, like, creating structure and preserve it on paper for.",
      "id": "ep_144_ut_20"
    },
    {
      "end": 742798,
      "speaker": "Sandra Rendgen",
      "start": 741662,
      "text": "Yes, exactly.",
      "id": "ep_144_ut_21"
    },
    {
      "end": 747078,
      "speaker": "Moritz Stefaner",
      "start": 742934,
      "text": "Like preserving knowledge. So I never saw that connection before, but now.",
      "id": "ep_144_ut_22"
    },
    {
      "end": 841856,
      "speaker": "Sandra Rendgen",
      "start": 747134,
      "text": "Yeah, but it's an interesting part. Yeah, yeah, very much so. And it's a very. I was thrilled to dive into this medieval universe because it's so far away from us or so remote for us both. The knowledge that is in there, preserved in there, but also the, the material stuff and the aesthetics, it looks so different from us. But also what is interesting if you look at this very old stuff for me is it makes clear that there's hardly anything like a universal infographic, if you know what I mean. You always need to know something about the context and you can read them and you can dive into it. If you learn to read the script, and if, if you learn to read, if you learn to understand Latin and all these things, you can read what's going on there and then you have to understand something about theology or about astronomy. And, you know, you can, but it's not like you can easily just look at it and check it. You really have to know something about it. And I think that's very important for us today because I feel like there's still something like this myth of, you know, if we only encode information well enough, then everybody will be able to read it. And to me that seems to be a myth that is a little bit naive, and I feel like studying these old things may help us in overcoming that a little bit, I should hope.",
      "id": "ep_144_ut_23"
    },
    {
      "end": 872676,
      "speaker": "Enrico Bertini",
      "start": 842008,
      "text": "Yeah. And I think maybe another interesting observation is that there are some type of structures, graphical structures, that keep recurring over the years. Right? So I think ultimately, if you look at, quote unquote, modern visualization, keep using the same metaphors and structures. Right? So I'm thinking about here in the preview that you have on your website. I can see circles with elements arranged around the circle, or I can see a tree.",
      "id": "ep_144_ut_24"
    },
    {
      "end": 873092,
      "speaker": "Sandra Rendgen",
      "start": 872828,
      "text": "Tree.",
      "id": "ep_144_ut_25"
    },
    {
      "end": 875252,
      "speaker": "Moritz Stefaner",
      "start": 873116,
      "text": "Trees are. Yeah, right.",
      "id": "ep_144_ut_26"
    },
    {
      "end": 891620,
      "speaker": "Enrico Bertini",
      "start": 875316,
      "text": "Trees are always there. Hierarchical structure, nested components. So it's really like we didn't really invent anything. And I think what is interesting is also, why do we. Why do we keep coming back to the structures? Right.",
      "id": "ep_144_ut_27"
    },
    {
      "end": 990796,
      "speaker": "Sandra Rendgen",
      "start": 892160,
      "text": "That's a very interesting question. But I think some things are pretty simple and straightforward and work so well and effectively that we just keep recurring or coming back to them. Such as you said, in a genealogy, you have circles and then lines that connect the circle somehow or in a network. But then also, on the other hand, the history of the tree is very important because the first, like the tree, sort of evolved from something else, the tree. In my medieval chapter, there are a few very intricate charts that show relations, like within families. It's a topic from roman law and both in roman law for questions of inheritance, but also in the christian church in the Middle Ages, it was very important to understand how is someone related to you? How many steps are between you and that person? Are you really related? Or are you far enough to get married, for instance? And there's a lot of charts like that. And most of them, the early ones, are geometric. And at some point they become a sort of tree like structure with a trunk below and then sort of a triangle on top. And then at some point, through the Middle Ages, this sort of takes on the idea of the tree. It becomes something floral, but it hasn't been a tree in the first place, if you know what I mean. So this metaphor then at some point becomes a dynamic of its own. And it's not like it's.",
      "id": "ep_144_ut_28"
    },
    {
      "end": 995196,
      "speaker": "Moritz Stefaner",
      "start": 990828,
      "text": "And in German, the word is stambaum. So it's refers to the actual tree again.",
      "id": "ep_144_ut_29"
    },
    {
      "end": 1027006,
      "speaker": "Sandra Rendgen",
      "start": 995268,
      "text": "Yeah, it does. Twice, because it's a trunk tree. It does. But it has evolved over centuries, you know, and it's not like it has always been the tree. And if you look, if you know that, and if you look at genealogies or stambomer or trees, you know, through the centuries, you can see how this metaphor not always really matches what is being shown and how it sometimes has, you know, weird problems. Like the tree is, you know, bottom up or, you know, it's all the.",
      "id": "ep_144_ut_30"
    },
    {
      "end": 1031238,
      "speaker": "Moritz Stefaner",
      "start": 1027038,
      "text": "Noble houses, like, marrying each other. Confusion.",
      "id": "ep_144_ut_31"
    },
    {
      "end": 1083120,
      "speaker": "Sandra Rendgen",
      "start": 1031334,
      "text": "Yeah, exactly. And not always will the structure of the family match your cousin, but also your uncle match the structure of the tree. And so that's also an interesting. So, yes, to come back to your question, Rico, some things are straightforward and work so well. And that goes specifically for taking a structure like a structure, a mental structure, so to say, and creating a visual order to represent that structure. And for that, most of the time, you just need simple graphical elements. Most of the time, simple graphical elements will work well for putting things on paper, placing it on paper so it makes the structure and then connecting them. But other things are more complicated, like the whole tree thing that I just tried to sketch.",
      "id": "ep_144_ut_32"
    },
    {
      "end": 1099280,
      "speaker": "Enrico Bertini",
      "start": 1084740,
      "text": "So you said. So in the middle ages, there is a proliferation of these diagrams, mostly for theological diagrams and astronomical diagrams. So what happens next? Where would you place the next milestone?",
      "id": "ep_144_ut_33"
    },
    {
      "end": 1284690,
      "speaker": "Sandra Rendgen",
      "start": 1099920,
      "text": "I mean, it's a very. There's something I need to say. In between is one thing that thrilled me during the work was how much there is. I mean, at first I was like, okay, are you gonna find enough material for a big book like that about the history? I wasn't sure, and then I started, and then I was, like, confident, okay, this is gonna make a big book. And then I researched some more, and it's like it's on end. Like, there's no. There's no. I could have done, done five books like that. There's so much work out there. It's thrilling because there's so much more to do and so much for us to discover that's really interesting. But if we take the grand, you know, the grand view upon the centuries behind us, the next really big thing is the development of scientific cartography. So we have the age of discovery beginning in the early 14 hundreds, up to 1500. And you all know that European powers sent out their seafarers to explore and conquer the world, basically. And the more they did that, the more it was important for politicians at home to have maps, because maps really were access to power. Maps were knowledge. And in the middle ages, they had hardly any scientific idea about what the world really looked like. And that changed very quickly and very profoundly from 1500 on. So the cartographers based in Europe would take information brought back from the logbooks and the seafarers and would try to include that into maps, and they would really proceed very well and very quickly in how to project the surface of the earth onto the flat screen. But also, what do the continents look like? Where is island x? And is California an island or nothing? Things like that. And that's a very important development. And for me, a very interesting and fascinating development, because there was so much work to be done, and it was done very profoundly and quickly. And then I would say around 17, 1750, we have such a high and elaborate culture of cartography in Europe and then later in the US, of course. And that's really fascinating. It's both scientifically very highly developed, but it's also in terms of graphical refinery. I mean, there's no wonder people are collecting historical maps. There's so much graphic refinement in them. That's also a fascinating aspect. And that takes place, takes around 250 years. And I mean, it's what we're still working with. Right. It's building. They've built a base of knowledge that we still build upon today.",
      "id": "ep_144_ut_34"
    },
    {
      "end": 1301846,
      "speaker": "Moritz Stefaner",
      "start": 1285030,
      "text": "Yeah, but that's really fascinating that these conceptual diagrams on the one hand, but then also cartography, are really at the basis of what we do. And the whole idea of displaying numbers or statistical data comes in much later. Right?",
      "id": "ep_144_ut_35"
    },
    {
      "end": 1302570,
      "speaker": "Sandra Rendgen",
      "start": 1301918,
      "text": "Yeah.",
      "id": "ep_144_ut_36"
    },
    {
      "end": 1308804,
      "speaker": "Moritz Stefaner",
      "start": 1303380,
      "text": "Can we point that when that came into the game like that, a data set is being actually shown?",
      "id": "ep_144_ut_37"
    },
    {
      "end": 1311720,
      "speaker": "Sandra Rendgen",
      "start": 1308852,
      "text": "Absolutely. I mean, it's hard to say. Like one.",
      "id": "ep_144_ut_38"
    },
    {
      "end": 1317548,
      "speaker": "Moritz Stefaner",
      "start": 1312020,
      "text": "There's a one day astronomical sun measurements are data as well, right?",
      "id": "ep_144_ut_39"
    },
    {
      "end": 1386150,
      "speaker": "Sandra Rendgen",
      "start": 1317724,
      "text": "Yeah, that's true. But the idea to, I think this whole thing started with counting births and deaths and, you know, other related demographic data and that, I mean, the early things start on a very local level, like in the parishes. You know, priests would count. You know, they're basically their people. And then they would collect tables and, you know, note down month of June. So many died, so many were born and stuff. So this is the very. And that we have, like from the 1650s, seventies on. And then this whole practice evolves until the late 17 hundreds. And so in the late 17 hundreds, we have a situation where there's are some politicians that think we need a more modern administration of political entities, of states, of kingdoms, basically. And they try to make use of this demographic data and also not just demographic data, but also economical data, like a power of how much trade did we have with this country or that country?",
      "id": "ep_144_ut_40"
    },
    {
      "end": 1389430,
      "speaker": "Moritz Stefaner",
      "start": 1387330,
      "text": "Is that the beginning of the smart city?",
      "id": "ep_144_ut_41"
    },
    {
      "end": 1526590,
      "speaker": "Sandra Rendgen",
      "start": 1392330,
      "text": "First it's the beginning of the observed city, I would say, or the observed community. And then so around 1800, we have a situation where there's data sets available, right? So playfair, for instance, he has published his seminal book, the Atlas of Political, the commercial and political atlas in 1786. And he's at the very forefront of this. There's several others. But so there we come into a situation where there's data available and where some people, interestingly enough, mostly people who are not, you know, very well established in, in the classic academic circles, but like, you know, outsiders, people who are busy with other things and they start to wonder how they can work with this data and how they can, you know, find graphic representations to make a. To make the ease of use, to make it easier to use these data and to reason with them and make decisions with them. And so. Yeah, playfair is there. There's a guy named Friedrich August Wilhelm Kromer in Germany, but there's several other figures as well. And then in the 1820s, that starts in France, where people are actually setting up the first statistical maps. And this is a whole new way of thinking and a way of, you know, to understand society and what's going on in society and with statistical numbers and to take these numbers as a tool, as something that helps you, you know, rule a community, for instance, or rule a state or better the economic situations that is only coming up around 1800, as I just sketched. And. And, you know, but it's only the beginning. We're always talking about, you know, decades long developments and through the early 18 hundreds, statistics are really establishing, are really established as a science also. They, at first, they had to fight for their. Yeah. For their reputation as a science, too.",
      "id": "ep_144_ut_42"
    },
    {
      "end": 1534082,
      "speaker": "Enrico Bertini",
      "start": 1527050,
      "text": "So graphical representations for statistics have been always there when. When statistics was invented, basically, sort of.",
      "id": "ep_144_ut_43"
    },
    {
      "end": 1616632,
      "speaker": "Sandra Rendgen",
      "start": 1534146,
      "text": "Yeah, the first. The first thing came up very early. And it's always. That's also interesting that it's specifical figures, right, that are trying to understand what can we do with this data, what can we do with that? And it's always self initiated work, like sort of self initiated research projects. For instance, Charles Mina is a very interesting proponent of that. Like, he didn't have to do this. Like, nobody would do this as a normal practice of his work. But when he was retired, he started to do these. Like, it was almost like his statistical maps were almost like research projects. So he was like, can I try to find something out about the relation between our classical river and channel navigation and the amount of transport that is being transported on the railway. Right. Can I compare this? Can I find out something about it by setting up this map? And so he did. He just. He just kept iterating that and kept coming up with new questions, new ideas. And so what is interesting to see, if you follow the whole work, is how he evolved a body of knowledge. Right. That people then used for new projects and other projects.",
      "id": "ep_144_ut_44"
    },
    {
      "end": 1639324,
      "speaker": "Enrico Bertini",
      "start": 1616736,
      "text": "Yeah. And I guess, correct me if I'm wrong, so from the technological standpoint at this point point in history, there's not a lot of progress in terms of tools to create these graphics, or am I wrong? I mean, I guess it's still using some, some drawing tools and paper or, or maybe I'm mistaken.",
      "id": "ep_144_ut_45"
    },
    {
      "end": 1753244,
      "speaker": "Sandra Rendgen",
      "start": 1639492,
      "text": "Yeah. Well, we are in an absolute, in an absolutely thrilling moment in time because, like, graphically seen, we may still be using some of the basic forms that have been developed, like, 200 years ago or 150 years ago. But first of all, we know so much more about them. I mean, these old things, there's some graphics that are really, that look totally mind blowing and fascinating, and they're popping up and have many colors and many items and many symbols on them. But then again, they don't work so well, right, because they're cluttered and overloaded. And so what all this history has helped build is a knowledge of what is best practice, what works, what doesn't work. And we also, we have very advanced, we have advanced a lot in perception research, for instance, and in visualization research and user research, like, what does work and what doesn't. And it's been important to build up this knowledge, but it's also like the whole visualization research that has happened over the past 20 years, I would say, has contributed a lot more of what we know. And now what is the challenge is that, and the interesting challenge is all these new tools and all these digital technologies, and that helps us to build, like, a lot more complex works. But we don't know how this works yet. You know, we're trying, and so it's not like we haven't done anything new. It's more like we're facing, you know, we're facing so many more opportunities now that we're trying to take this knowledge that we have from the past and the graphic, you know, symbols and the ideas and trying to make something new with that.",
      "id": "ep_144_ut_46"
    },
    {
      "end": 1794798,
      "speaker": "Moritz Stefaner",
      "start": 1753412,
      "text": "Yeah, but just as a general observation, like, if you have never looked into the 19th century's graph graphics, do it now, because there's so much inspiration you can draw from that and a lot of the things you can where you will think, oh, that's such a cool new D3 trick I've seen, or this totally mind blowing new style of display graphic. Probably somebody in the 19th century has done it already and has done it really well. It's so amazing. All kinds of statistical maps, tree maps, all kinds of crazy mixing illustrations with statistical data. There has been, it seems like such a, such a creative time of how people have worked with data.",
      "id": "ep_144_ut_47"
    },
    {
      "end": 1928800,
      "speaker": "Sandra Rendgen",
      "start": 1794894,
      "text": "Yes, a very rich time also. And a very experiment. Like, people experimented a lot, so a lot of that. And I tried to include that in the book. A lot of that was also weird or doesn't work or is just from our knowledge today. It's just, you wouldn't do that anymore. But still, it's very, as Moritz just said, it's very interesting because there's so much to discover. Right. And so many new approaches, basically. But what is also a very interesting point that I want to come back to, I mentioned it for the middle ages, but what we need to keep in mind is, I mean, we're all so used to working in the digital space. And just to keep in mind how all the works in the 19th century were graphic or hand painted things, but most of them graphics, they were printed. They were, they were happening on paper. They were, you know, they, they used a specific color. Many of them were hand painted. I just, I don't know how this worked. They printed 100 maps, and then every single one of them was hand painted. I don't even know how who did all this work. But, but also these printed maps, many of them are in a very large format, and then they have very intricate graphical details, and that's just so interesting to look at that also, because what these broadsheet maps do is we always talk about overview and details on demand, and they are masterful examples of that because you have the whole format, you can see a lot of space in that map, but then you go in and it has a very high resolution and it's finely, delicately printed. So that's very, I mean, I don't know if we can do something with that knowledge today because we're building digital tools, most of us, but it's still very interesting to have that in mind and to also to appreciate it, because we used to think, well, you know, old stuff, okay, didn't have the tools we have, but they did something with those tools that was really fascinating.",
      "id": "ep_144_ut_48"
    },
    {
      "end": 1948014,
      "speaker": "Enrico Bertini",
      "start": 1929670,
      "text": "So I would say, since you have all this knowledge about what has happened in the past in this space, what do you think are the most surprising or insightful graphical solution that you've seen out there? Is there anything that stands out or maybe even trends?",
      "id": "ep_144_ut_49"
    },
    {
      "end": 2056328,
      "speaker": "Sandra Rendgen",
      "start": 1948182,
      "text": "Oh, that's an interesting question. What I really like to think about is that there's things that are, you know, sort of in the, used in situations. You know, we always tend to think about data visualization as something that happens on a page or in a book or, you know, as. But I really like the works that are used, you know, in their hands. They take them, they take them somewhere, they put them up on the wall and then point there and use them as teaching aids or something. Or this one medieval map that I mentioned earlier, which is a very wide roll, and then you roll it together, and then you put the roll into your backpack and take it, and then the next road you take it out again. And so things that are actually. Or there's a very large scale atlas that was given to the king of England at some point in the 17th century. That's like the high point of what I described earlier with the scientific cartography. It's like huge, like a book of wall maps. I don't even really know how that works. These things are nice for me to keep in mind, because still today we're not thinking about books anymore, but today we're thinking, we're very much thinking about the classical digital things, web based tools, apps that at first look flat, but then maybe have filters or 3d things even. But what about data visualization or information visualization that is in our environment, that is in our rooms, that is in the air? I don't know, but things that we actually help us navigate the space or something.",
      "id": "ep_144_ut_50"
    },
    {
      "end": 2056840,
      "speaker": "Enrico Bertini",
      "start": 2056424,
      "text": "Yeah.",
      "id": "ep_144_ut_51"
    },
    {
      "end": 2077404,
      "speaker": "Moritz Stefaner",
      "start": 2056920,
      "text": "And seeing the physical dimension of these pieces is often very revealing because we always get it presented when we see digitally in the same size. But they can be huge or very tiny. So I sort of pictured also Charles Minare's map of the march against Moscow from Napoleon's troops as a huge piece, but I think it's actually not so big.",
      "id": "ep_144_ut_52"
    },
    {
      "end": 2139578,
      "speaker": "Sandra Rendgen",
      "start": 2077452,
      "text": "Oh, it is, it is. It's not crazy big, but it is biggish. Yeah, sort of. I don't have the exact measures now, but it's something like 70 cm or something, so you need to spread out your arms. But, yeah, that's something that I love about all these different pieces, all of them, all of them in the history of information, graphics, every single one is different. Also in terms of context of use. Why did they do that? Why did they create it and how was it used later on? And to take these things out of the digital realm and bring them back into our physical space. Also, we can't actually do this because the works themselves are in the archives, but just as a mental operation to understand and visualization, works of visualization, as something that we can hold in our hands and we can work with that, make us operate, you know, our daily.",
      "id": "ep_144_ut_53"
    },
    {
      "end": 2167508,
      "speaker": "Moritz Stefaner",
      "start": 2139634,
      "text": "Lives, and, I mean, we live in a much more standardized world by now, right? And so the whole industrialization of everything, like, for instance, like print has certain formats, right? Or our computer screens have certain formats, and in the pre industrial area, anything was just a convention. But I think we have now much stronger standards in terms of what seems even like a good idea or what is even available to work with.",
      "id": "ep_144_ut_54"
    },
    {
      "end": 2258280,
      "speaker": "Sandra Rendgen",
      "start": 2167564,
      "text": "Yeah, I mean, that's also the interesting situation, because the conventions of the digital realm are not yet set, I would say. So we can. We're all working. Yeah, we're all working on setting them, basically, and that's also so really interesting to see. But it's not like there haven't been any conventions in the past, but you can watch conventions change through the epochs. And as I said earlier, it's just so mind blowing and opening your horizon to go back and try to figure what were the conventions in the middle ages or in the early renaissance or something, and why were they like that? What were the tools, and what would people use the things for? And that, you know, I would just hope that trying to make this operation mentally will help readers to get a broader perspective on their daily work, on the work that we are doing now. Because everyone's always, as you said in the beginning, everyone's focused towards the future. We're thinking from now. Now is our starting point, and we're trying to look into the future. But going back also gives us ideas and also has really mind blowing things in style that may. Yeah, may give ideas and may open up the space for experimentation.",
      "id": "ep_144_ut_55"
    },
    {
      "end": 2281492,
      "speaker": "Enrico Bertini",
      "start": 2258900,
      "text": "Yeah. It just occurred to me that, as you were talking about the context of use, I know next to nothing about how these statistical graphics would actually be used. Say, pieces from Playfair and Minard. Were they shown somewhere? Were they hanging on a wall, or. I just don't know anything about that.",
      "id": "ep_144_ut_56"
    },
    {
      "end": 2343280,
      "speaker": "Sandra Rendgen",
      "start": 2281556,
      "text": "That's a super interesting question, and it's very important to think about that. I think Playfair was a very interesting figure. He was just a self employed, roaming nomad, sort of. He had a variety of jobs, but he was not in academia. But he was sort of ambitious, and he had this idea about graphic representation. So he would get together several books over a few decades, and so he would publish these books and just sort of hope that they sell, and I don't actually know how they sold and whether he made any money with them. And he did have, you know, he did a few talks in scientific circles. He traveled to Paris and presented at the Academy of Science. And so a few people knew about his work, and some small circles of scientists were aware of that. So Minar later also refers to him. So, you know, not a wide public, but a few people knew about his work in books. And in books. Okay, in books.",
      "id": "ep_144_ut_57"
    },
    {
      "end": 2349780,
      "speaker": "Enrico Bertini",
      "start": 2343620,
      "text": "I was not even aware that these pieces were collected in a book or in books.",
      "id": "ep_144_ut_58"
    },
    {
      "end": 2353960,
      "speaker": "Sandra Rendgen",
      "start": 2349900,
      "text": "In books. In several books. In books. And then Mina.",
      "id": "ep_144_ut_59"
    },
    {
      "end": 2355856,
      "speaker": "Enrico Bertini",
      "start": 2354000,
      "text": "So there are multiple copies then?",
      "id": "ep_144_ut_60"
    },
    {
      "end": 2360120,
      "speaker": "Sandra Rendgen",
      "start": 2356048,
      "text": "Multiple. Multiple books. And then off the books, multiple copies.",
      "id": "ep_144_ut_61"
    },
    {
      "end": 2361488,
      "speaker": "Enrico Bertini",
      "start": 2360240,
      "text": "Oh, okay. Yeah.",
      "id": "ep_144_ut_62"
    },
    {
      "end": 2436140,
      "speaker": "Sandra Rendgen",
      "start": 2361584,
      "text": "And then. But again, printed graphics, hand colored. I don't get it how it worked. I mean, I think it was child labor, basically. They had young girls sitting there doing that. Anyways, Minar. So Minar would do his work when he was retired, all self initiated. He had a network of like minded scientists and engineers in Paris because he had a long career. And he also had good connections to the department of Public Works in Paris. And so he would. He would print these large format maps as lithographs. And then again, they were. Most of them were hand painted. I don't know if he did that himself or whether he had, you know, a team of students, whoever, doing that. And then I don't know how many he printed. And also, I don't really know how he circulated them. It's still sort of a secret. I know that he had several sort of people that regularly obtained his maps in the department of public Works. And then he also sent it to colleagues and to friends. And so. But it was a sort of informal. I sort of self distribute my work.",
      "id": "ep_144_ut_63"
    },
    {
      "end": 2439572,
      "speaker": "Moritz Stefaner",
      "start": 2438340,
      "text": "Etsy style.",
      "id": "ep_144_ut_64"
    },
    {
      "end": 2482670,
      "speaker": "Sandra Rendgen",
      "start": 2439756,
      "text": "Yeah, sort of, sort of. I don't think he sold them, actually. I think he just. Maybe the department of public works paid for it, you know, a little bit. But. And so, yeah, these maps were flying around, and some of them were kept, well kept and well preserved. So just recently, if you like, two collections preserved from french engineers have a. Appeared on the market and were now sold, but most of them have just perished. There's just really few copies that have survived. But, I mean, I don't know, because it's large scale maps, but they weren't really as refined and chic that people would actually, you know, hung them on the wall, hang them on the wall.",
      "id": "ep_144_ut_65"
    },
    {
      "end": 2488262,
      "speaker": "Moritz Stefaner",
      "start": 2482710,
      "text": "So, yeah, so they were also not perceived as, let's say, artworks, but utilitarian.",
      "id": "ep_144_ut_66"
    },
    {
      "end": 2527900,
      "speaker": "Sandra Rendgen",
      "start": 2488326,
      "text": "Exactly. And that's a very, very, very important point also because, I mean, he also didn't, you know, he didn't do much to refine them or to decorate them. That was important to him. And that's why, which is also interesting. That's why they have this very clear modern style and aesthetics. Like, we tend to think, oh, this is cool. This is almost Bauhaus ish because it's so reduced and there's just, you know, just what you need in them. No extra decoration or something. But I think it's just because he was an engineer, he was a technical guy, so he would put in there what was necessary, like, you know, the map and the legend and the text, and that was it.",
      "id": "ep_144_ut_67"
    },
    {
      "end": 2535980,
      "speaker": "Moritz Stefaner",
      "start": 2528800,
      "text": "Super interesting. Yeah. Now I think now we're at the end of the 19th century, we should do something about the 20th century.",
      "id": "ep_144_ut_68"
    },
    {
      "end": 2537696,
      "speaker": "Sandra Rendgen",
      "start": 2536960,
      "text": "Yeah.",
      "id": "ep_144_ut_69"
    },
    {
      "end": 2542140,
      "speaker": "Moritz Stefaner",
      "start": 2537848,
      "text": "Things take a whole other turn, but, I mean, we won't cover that in this episode.",
      "id": "ep_144_ut_70"
    },
    {
      "end": 2558054,
      "speaker": "Sandra Rendgen",
      "start": 2543800,
      "text": "A lot going on. Interesting things, but. Yeah, but I think we've covered the very, very big things we need to know is covered cartography and statistical reasoning, because that's the bread and butter of what we work with today.",
      "id": "ep_144_ut_71"
    },
    {
      "end": 2611544,
      "speaker": "Moritz Stefaner",
      "start": 2558142,
      "text": "Yeah, yeah, yeah. And if you want to learn more, look into Sandra's books, Tufte's books, of course. We can put a few links there. Manje Lima has two great books specifically on circles and trees. Like, just looking at it from a formal side, like all these eternal structures before. And so it's definitely. Yeah. And again, it's something we can just infinitely draw inspiration from and really, really learn about how our whole field has developed. And I think that's great. Yeah. And, yeah, and actually, we have a last thing to talk about because sort of unrelated, somewhat coincidentally, Sandra is now also our producer for data stories. So you might hear from her more often or at least see her work, because she will help us with producing the show, which is great.",
      "id": "ep_144_ut_72"
    },
    {
      "end": 2626920,
      "speaker": "Sandra Rendgen",
      "start": 2611672,
      "text": "Yes. That is great news. Also for me, I was very happy that we came together in this because I've been a fan and a listener for a long time, and so it's great for me to contribute to the show and hope I can help make it run and make it grow.",
      "id": "ep_144_ut_73"
    },
    {
      "end": 2628460,
      "speaker": "Moritz Stefaner",
      "start": 2627040,
      "text": "Yeah, that's really cool.",
      "id": "ep_144_ut_74"
    },
    {
      "end": 2630552,
      "speaker": "Sandra Rendgen",
      "start": 2628960,
      "text": "Thanks for taking me on board.",
      "id": "ep_144_ut_75"
    },
    {
      "end": 2653828,
      "speaker": "Moritz Stefaner",
      "start": 2630696,
      "text": "Yeah, pleasure. And, yeah, Sandra is filling in for Destry, who did a fantastic job over the last few years. Some of you might know her, maybe from that 100th episode. And, yeah, she had now her first baby, and so she takes time for that. And so we're super happy, both for having had such great support, but also having Sandra now helping us, which is great.",
      "id": "ep_144_ut_76"
    },
    {
      "end": 2655412,
      "speaker": "Sandra Rendgen",
      "start": 2653884,
      "text": "Yes. Hi, dear listeners.",
      "id": "ep_144_ut_77"
    },
    {
      "end": 2678052,
      "speaker": "Moritz Stefaner",
      "start": 2655476,
      "text": "Yeah, yeah. So that's also an opportunity. We might sort of rethink some of our approaches. So if you listeners have a few ideas in terms of what you would like to hear more or different formats or different output channels, I don't know, just let us know, because right now we're sort of also reworking our process a bit, so it's a good time to send in suggestions. That's, I guess, what I'm saying.",
      "id": "ep_144_ut_78"
    },
    {
      "end": 2679764,
      "speaker": "Enrico Bertini",
      "start": 2678236,
      "text": "And it's summer as well.",
      "id": "ep_144_ut_79"
    },
    {
      "end": 2680724,
      "speaker": "Moritz Stefaner",
      "start": 2679892,
      "text": "Yeah, true.",
      "id": "ep_144_ut_80"
    },
    {
      "end": 2684668,
      "speaker": "Enrico Bertini",
      "start": 2680772,
      "text": "So we're open for any good time for thinking.",
      "id": "ep_144_ut_81"
    },
    {
      "end": 2693884,
      "speaker": "Moritz Stefaner",
      "start": 2684804,
      "text": "Exactly. Yeah. Yeah. Cool. Wonderful. That has been fascinating. It's a pleasure also to really browse through the books and.",
      "id": "ep_144_ut_82"
    },
    {
      "end": 2705336,
      "speaker": "Sandra Rendgen",
      "start": 2694012,
      "text": "Yeah, thanks so much for having me. It's like, it's a special situation for me because I feel like there's not been enough emphasis and knowledge on that. So. Yeah, thanks for that.",
      "id": "ep_144_ut_83"
    },
    {
      "end": 2714144,
      "speaker": "Moritz Stefaner",
      "start": 2705408,
      "text": "And we should cover it more. I think that's also true. Yeah. Yeah. But we made the first step looking back. That's something.",
      "id": "ep_144_ut_84"
    },
    {
      "end": 2716740,
      "speaker": "Sandra Rendgen",
      "start": 2714232,
      "text": "Exactly. You have to start somewhere.",
      "id": "ep_144_ut_85"
    },
    {
      "end": 2720680,
      "speaker": "Moritz Stefaner",
      "start": 2717040,
      "text": "Exactly. So thanks so much.",
      "id": "ep_144_ut_86"
    },
    {
      "end": 2721624,
      "speaker": "Enrico Bertini",
      "start": 2720800,
      "text": "Thanks so much.",
      "id": "ep_144_ut_87"
    },
    {
      "end": 2723752,
      "speaker": "Sandra Rendgen",
      "start": 2721712,
      "text": "Thank you. And we'll be in touch.",
      "id": "ep_144_ut_88"
    },
    {
      "end": 2724472,
      "speaker": "Enrico Bertini",
      "start": 2723776,
      "text": "We'll see you next time.",
      "id": "ep_144_ut_89"
    },
    {
      "end": 2726546,
      "speaker": "Moritz Stefaner",
      "start": 2724536,
      "text": "Yes, exactly. Bye bye.",
      "id": "ep_144_ut_90"
    },
    {
      "end": 2752896,
      "speaker": "Enrico Bertini",
      "start": 2726648,
      "text": "Bye. Bye bye. Hey, folks, thanks for listening to data stories again. Before you leave a few last notes, this show is now completely crowdfunded, so you can support us by going on Patreon. That's patreon.com Datastories. And if you can spend a couple of minutes rating us on iTunes, that would be extremely helpful for the show.",
      "id": "ep_144_ut_91"
    },
    {
      "end": 2778802,
      "speaker": "Moritz Stefaner",
      "start": 2753008,
      "text": "And here's also some information on the many ways you can get news directly from us. We are, of course, on twitter@twitter.com. Datastories. We have a Facebook page@Facebook.com. data stories, podcast all in one word. And we also have a Slack channel where you can chat with us directly. And to sign up, you can go to our homepage datastory eas, and there is a button at the bottom of the page.",
      "id": "ep_144_ut_92"
    },
    {
      "end": 2794658,
      "speaker": "Enrico Bertini",
      "start": 2778946,
      "text": "And we also have an email newsletter. So if you want to get news directly into your inbox and be notified whenever we publish an episode, you can go to our home page Datastories es and look for the link you find at the bottom in the footer.",
      "id": "ep_144_ut_93"
    },
    {
      "end": 2806804,
      "speaker": "Moritz Stefaner",
      "start": 2794754,
      "text": "So one last thing we want to tell you is that we love to get in touch with our listeners, especially if you want to suggest a way to improve the show or amazing people you want us to invite or even projects you want us to talk about.",
      "id": "ep_144_ut_94"
    },
    {
      "end": 2816020,
      "speaker": "Enrico Bertini",
      "start": 2806892,
      "text": "Yeah, absolutely. And don't hesitate to get in touch with us. It's always a great thing to hear from you. So see you next time, and thanks for listening to data stories.",
      "id": "ep_144_ut_95"
    }
  ],
  "confidence": 0.929577099837222,
  "audio_duration": 2825,
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_status_code": null,
  "webhook_auth": false,
  "webhook_auth_header_name": null,
  "speed_boost": false,
  "auto_highlights_result": null,
  "auto_highlights": false,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_audio_quality": null,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "content_safety": false,
  "iab_categories": true,
  "content_safety_labels": {
    "status": "unavailable",
    "results": [],
    "summary": {}
  },
  "language_detection": false,
  "language_detection_threshold": null,
  "language_confidence": null,
  "custom_spelling": null,
  "throttled": false,
  "auto_chapters": true,
  "summarization": false,
  "summary_type": null,
  "summary_model": null,
  "custom_topics": false,
  "topics": [],
  "speech_threshold": null,
  "speech_model": "best",
  "chapters": [
    {
      "summary": "This week on Data stories, Moritz Stefaner and Enrico Bertini talk about data visualization and data analysis. If you enjoy the show, please consider supporting us with recurring payments on patreon. com or sending us a one time donation on PayPal.",
      "gist": "Data Stories",
      "headline": "If you enjoy the show, please consider supporting us with recurring payments",
      "start": 160,
      "end": 105860,
      "id": "ep_144_ch_0"
    },
    {
      "summary": "Sandra Rendgen is an independent author and concept developer. She specializes in data visualization and information graphics. She has written two books that are just coming out, or just have come out. She invited four experts in the field to discuss the history of data visualization.",
      "gist": "The History of Data-Visualization",
      "headline": "Sandra Rendgen writes about the history of information graphics and data visualization",
      "start": 106360,
      "end": 361304,
      "id": "ep_144_ch_1"
    },
    {
      "summary": "The history of information, graphics, huge topic. Everything starts probably with the cave paintings. From the middle Ages on, we can observe a culture of texts and books. diagrams and maps do play a very important role in that. The digitization of archives in the last few years has played a crucial role.",
      "gist": "History of Information and Graphics",
      "headline": "So history of information, graphics, huge topic. But it's very difficult where to start",
      "start": 361492,
      "end": 593878,
      "id": "ep_144_ch_2"
    },
    {
      "summary": "In medieval culture, everything is hand painted. There's no copy, there's no other thing. If one thing gets lost, it's lost forever. What medieval culture is about is like preserving knowledge because it's so precious.",
      "gist": "The mystery of medieval manuscripts",
      "headline": "Everything is hand painted. Everything is unique. And what is also really thrilling for us in this medieval work is",
      "start": 594014,
      "end": 659902,
      "id": "ep_144_ch_3"
    },
    {
      "summary": "Most the material they drew upon or painted upon was parchment. Most of the times they would work on parchment, and then they would use ink and watercolors most of the time. There's hardly anything like a universal infographic. You always need to know something about the context.",
      "gist": "Drawing and Painting on parchment",
      "headline": "Sandra says most medieval diagrams were painted on parchment",
      "start": 660086,
      "end": 842780,
      "id": "ep_144_ch_4"
    },
    {
      "summary": "Modern visualization keeps using the same metaphors and structures. Why do we keep coming back to the structures? Some things are simple and straightforward and work so well. There's so much more to discover that's really interesting.",
      "gist": "The Structure of Modern Visualizations",
      "headline": "Modern visualization keeps using the same metaphors and structures over the years",
      "start": 843080,
      "end": 1140628,
      "id": "ep_144_ch_5"
    },
    {
      "summary": "The next big thing is the development of scientific cartography. Maps were knowledge in the middle ages. The whole idea of displaying numbers or statistical data comes in much later. It's building a base of knowledge we still build upon today.",
      "gist": "The development of political cartography",
      "headline": "The development of scientific cartography dates back to 1500 in Europe",
      "start": 1140764,
      "end": 1690674,
      "id": "ep_144_ch_6"
    },
    {
      "summary": "If you have never looked into the 19th century's graph graphics, do it now. There's so much inspiration you can draw from that. The challenge is all these new tools and all these digital technologies. There is so much to discover.",
      "gist": "The 20th century's graph graphics",
      "headline": "The whole visualization research that has happened over the past 20 years has contributed significantly",
      "start": 1690802,
      "end": 1823690,
      "id": "ep_144_ch_7"
    },
    {
      "summary": "All the works in the 19th century were graphic or hand painted things. Most of them graphics, they were printed. Many of them were hand painted. It's still very interesting to have that in mind and to appreciate it.",
      "gist": "Hand-painted maps in the 19th century",
      "headline": "All the 19th century graphics were printed, many of them hand painted",
      "start": 1824470,
      "end": 1928800,
      "id": "ep_144_ch_8"
    },
    {
      "summary": "What do you think is the most surprising or insightful graphical solution that you've seen out there? I really like the works that are used, you know, in their hands. Seeing the physical dimension of these pieces is often very revealing. The conventions of the digital realm are not yet set, so we're all working.",
      "gist": "The History of Data Visualization",
      "headline": "What do you think are the most surprising or insightful graphical solutions out there",
      "start": 1929670,
      "end": 2259396,
      "id": "ep_144_ch_9"
    },
    {
      "summary": "Playfair was a self employed, roaming nomad. Minar would do his work when he was retired. He would print these large format maps as lithographs. Most of them were hand painted. They were not perceived as artworks, but utilitarian. There's just really few copies that have survived.",
      "gist": "Survey of Maps by Philippe Playfair and Minard",
      "headline": "I know next to nothing about how statistical graphics would actually be used",
      "start": 2259468,
      "end": 2590756,
      "id": "ep_144_ch_10"
    },
    {
      "summary": "Sandra is now also our producer for data stories. So that's also an opportunity. We might sort of rethink some of our approaches. If you listeners have a few ideas in terms of what you would like to hear more, just let us know.",
      "gist": "Thanks for listening to Data Stories!",
      "headline": "Sandra is now our producer for data stories, which is great news",
      "start": 2590948,
      "end": 2727930,
      "id": "ep_144_ch_11"
    },
    {
      "summary": "This show is now completely crowdfunded, so you can support us by going on patreon. com Datastories. If you can spend a couple of minutes rating us on iTunes, that would be extremely helpful for the show. And don't hesitate to get in touch with us.",
      "gist": "How to Subscribe to Data Stories",
      "headline": "This show is now completely crowdfunded, so you can support us on Patreon",
      "start": 2732510,
      "end": 2816020,
      "id": "ep_144_ch_12"
    }
  ],
  "disfluencies": false,
  "entity_detection": false,
  "sentiment_analysis": false,
  "sentiment_analysis_results": null,
  "entities": null,
  "speakers_expected": null,
  "summary": null,
  "custom_topics_results": null,
  "episode_num": 144,
  "episode_metadata": {
    "speakers": [
      "Sandra Rendgen",
      "Moritz Stefaner",
      "Enrico Bertini"
    ],
    "WPid": "1335",
    "url": "https://datastori.es/podlove/file/5656/s/feed/c/mp3/144-history-of-information-graphics-with-sandra-rendgen.mp3",
    "episode_title": "History of Information Graphics with Sandra Rendgen"
  }
}