{
  "id": "b77f84a7-56c6-49a9-aba8-37e42f66e07b",
  "language_model": "assemblyai_default",
  "acoustic_model": "assemblyai_default",
  "language_code": "en_us",
  "status": "completed",
  "audio_url": "https://datastori.es/podlove/file/4031/s/feed/c/mp3/99-data-visualization-at-capital-one-with-kim-rees-and-Steph-hay.mp3",
  "utterances": [
    {
      "end": 4954,
      "speaker": "Kim Rees",
      "start": 120,
      "text": "I want to figure out why we as humans are so illogical about money.",
      "id": "ep_99_ut_0"
    },
    {
      "end": 28154,
      "speaker": "Moritz Stefaner",
      "start": 9614,
      "text": "Are you missing out on meaningful relationships hidden in your data? Unlock the whole story with Qlik sense through personalized visualizations and dynamic dashboards which you can download for free at Qlik Datastories. That's Qlik Datastories.",
      "id": "ep_99_ut_1"
    },
    {
      "end": 53982,
      "speaker": "Enrico Bertini",
      "start": 49734,
      "text": "Hey, everyone. Welcome to a new episode of data stories. Hey, Moritz.",
      "id": "ep_99_ut_2"
    },
    {
      "end": 54678,
      "speaker": "Steph Hay",
      "start": 54038,
      "text": "Hey, Enrico.",
      "id": "ep_99_ut_3"
    },
    {
      "end": 55630,
      "speaker": "Enrico Bertini",
      "start": 54726,
      "text": "What's going on?",
      "id": "ep_99_ut_4"
    },
    {
      "end": 57886,
      "speaker": "Steph Hay",
      "start": 55742,
      "text": "Lots of things. Lots of projects.",
      "id": "ep_99_ut_5"
    },
    {
      "end": 58606,
      "speaker": "Enrico Bertini",
      "start": 57950,
      "text": "Lots of things.",
      "id": "ep_99_ut_6"
    },
    {
      "end": 59054,
      "speaker": "Kim Rees",
      "start": 58670,
      "text": "Yeah.",
      "id": "ep_99_ut_7"
    },
    {
      "end": 68862,
      "speaker": "Steph Hay",
      "start": 59134,
      "text": "Lots of new projects. I hope I can report more. I'm trying to do something really applied for the German railway system. So this is what I'm really involved in right now.",
      "id": "ep_99_ut_8"
    },
    {
      "end": 71314,
      "speaker": "Enrico Bertini",
      "start": 68958,
      "text": "Wow. Sounds juicy.",
      "id": "ep_99_ut_9"
    },
    {
      "end": 73278,
      "speaker": "Steph Hay",
      "start": 71734,
      "text": "Super technical, but pretty cool.",
      "id": "ep_99_ut_10"
    },
    {
      "end": 75198,
      "speaker": "Enrico Bertini",
      "start": 73326,
      "text": "Yeah, very nice. Yeah.",
      "id": "ep_99_ut_11"
    },
    {
      "end": 79022,
      "speaker": "Steph Hay",
      "start": 75366,
      "text": "So we have episode 100 coming up. This is 99. It's amazing.",
      "id": "ep_99_ut_12"
    },
    {
      "end": 80070,
      "speaker": "Enrico Bertini",
      "start": 79078,
      "text": "That's 99.",
      "id": "ep_99_ut_13"
    },
    {
      "end": 82934,
      "speaker": "Steph Hay",
      "start": 80142,
      "text": "Would you have guessed? We make it that far? Maybe not.",
      "id": "ep_99_ut_14"
    },
    {
      "end": 91252,
      "speaker": "Enrico Bertini",
      "start": 83094,
      "text": "Yeah. I'm speechless. I don't know. Did we get here? What did we do? I don't know. I don't remember.",
      "id": "ep_99_ut_15"
    },
    {
      "end": 95304,
      "speaker": "Steph Hay",
      "start": 91348,
      "text": "I sort of blacked out the last 99. I can't really tell. You have to tell me.",
      "id": "ep_99_ut_16"
    },
    {
      "end": 105316,
      "speaker": "Enrico Bertini",
      "start": 95644,
      "text": "Yeah. Yeah, we stopped. Oh, my God. Yeah. We have to memorize all of them. All the titles. No, at least all the guests.",
      "id": "ep_99_ut_17"
    },
    {
      "end": 135160,
      "speaker": "Steph Hay",
      "start": 105380,
      "text": "Yeah. So we will go through all the episodes for sure. Right. And sort of try to collect some best offs. And dear listeners, if you have any favorite episodes, anecdotes to share any memorable moments. We made an audio voice box. So you can call us and leave us a message. And if it's a good message or a funny one, we might play it on the show or react in some form. So that would be super nice. So just call us the numbers in the show notes and leave us something.",
      "id": "ep_99_ut_18"
    },
    {
      "end": 177526,
      "speaker": "Enrico Bertini",
      "start": 135312,
      "text": "Yeah, we're looking forward to your messages. That's going to be fun. So. Okay, so today we have another very interesting episode. So you may have noticed that here in Datastore we started discussing lately a little bit more about the role of data visualization in industry and what kind of careers people can have. We had a few debates. We had an interesting discussion with Elijah. And so this episode is a little bit of a follow up on that episode and discussions. And we have two very interesting people. Directly from Capital one, we have Kim Rees. Hey, Kim.",
      "id": "ep_99_ut_19"
    },
    {
      "end": 178366,
      "speaker": "Kim Rees",
      "start": 177670,
      "text": "Hello.",
      "id": "ep_99_ut_20"
    },
    {
      "end": 181390,
      "speaker": "Enrico Bertini",
      "start": 178510,
      "text": "And Steph. Hey. Welcome on the show.",
      "id": "ep_99_ut_21"
    },
    {
      "end": 183222,
      "speaker": "E",
      "start": 181502,
      "text": "Hi there. Thanks for having us.",
      "id": "ep_99_ut_22"
    },
    {
      "end": 214212,
      "speaker": "Enrico Bertini",
      "start": 183358,
      "text": "So, Kim, I guess many of you already know Kim. Because she's very well known in the area of data visualization. She was previously a periscopic and now she's head of data visualization at Capital one. And Steph is her boss and she has a very interesting title. She's the head of content culture and AI design. Kim and Steph, can you briefly introduce yourself and tell us a little bit more about you, what you are doing and all the rest?",
      "id": "ep_99_ut_23"
    },
    {
      "end": 272204,
      "speaker": "Kim Rees",
      "start": 214388,
      "text": "Sure. Enrico, thank you for the intro. So this is Kim Reese. I'm going to go ahead and start. So I was just hired literally a month ago here as head of data visualization at Capital one. It's a brand new role. I have no idea what it is yet. If I claimed otherwise, I would be foolish. It's a new practice that we're building out under design and it's a really exciting space for the company. And so it's situated in design, which I think is unique to a lot of corporate structures. And so, yeah, so I'm building out a team that will be focusing on bringing data visualization to bear across the enterprise, which is, how big are we as a company? 45,000 ish. No small undertaking.",
      "id": "ep_99_ut_24"
    },
    {
      "end": 277440,
      "speaker": "Enrico Bertini",
      "start": 275184,
      "text": "Scary. Steph.",
      "id": "ep_99_ut_25"
    },
    {
      "end": 415844,
      "speaker": "E",
      "start": 277512,
      "text": "Yeah. I'm Steph Hay and I have the sheer pleasure of having Kim on the team now. It's been sort of a wild ride, actually. I joined about two and a half years ago when the design team was about 100 folks, and we've essentially quadrupled in size. I came out of five years working for myself as an independent content strategist, as a consultant, that is. And then I also was working on a couple startups. And so when I joined the company, it was fulfilling a lifelong dream of working for a bank. Just kidding. That didn't happen. It was a surprise, though, because this was a place that was moving away from some of you think, what are the stereotypes of what a bank might be? And embracing the technology and the data science roots that made capital one, which we can get into a little bit more, and also human centered design. And in my particular background, being a journalist, I found that being able to understand the story and having the facts necessary to tell the story and knowing who you're talking to, that all of that was really essential to being able to do great design. And fortunately, our former boss, who just recently left the company, he agreed. So he said, why don't you come start a content strategy practice here in design and find out what the language is that we should be using for talking about money with our customers? And so I did. And over the last couple years, that's grown to include a lot of cultural aspects of design and a lot of the AI work that we're doing. And about a year ago, I think now, I raised my hand and said, hey, man, it would be really great if we could visualize all the conversations that are happening across our team or the ways that customers really need to be able to see their finances, their health, but in ways that don't exist already. And this is a discipline, and this is not me, but this is somebody out there. And of course, everybody at the company here said, yeah, that sounds exactly like what we need. And so we started looking around what that might include and found Kim.",
      "id": "ep_99_ut_26"
    },
    {
      "end": 433064,
      "speaker": "Enrico Bertini",
      "start": 416004,
      "text": "That's great. So, yeah, I think a little bit of behind the scenes here. I think when Kim told us that she found a new job, she didn't tell us exactly what this was. She was like, you will never imagine what this would be. You can keep trying for days and months.",
      "id": "ep_99_ut_27"
    },
    {
      "end": 438060,
      "speaker": "Steph Hay",
      "start": 435444,
      "text": "We made many guesses. It didn't even come close.",
      "id": "ep_99_ut_28"
    },
    {
      "end": 440264,
      "speaker": "Kim Rees",
      "start": 438172,
      "text": "You never came close? Never came close.",
      "id": "ep_99_ut_29"
    },
    {
      "end": 457614,
      "speaker": "Enrico Bertini",
      "start": 440714,
      "text": "We had the wildest guesses, and we didn't even get an inch closer. So, Kim, can you tell us a little bit more about how this happened on your side and why is having this position exciting?",
      "id": "ep_99_ut_30"
    },
    {
      "end": 676214,
      "speaker": "Kim Rees",
      "start": 458154,
      "text": "Absolutely. So, as many listeners might know, they probably know me from my background in periscopic, where I co founded the company and worked for the last 13 years. And I love the work that we were doing. It's very mission driven, and we're doing really interesting projects with great clients. But the business side of it really caught up with me and became exhausting. And running a services based company is challenging to sustain, as many of you know, so. And I also was looking to. I was getting frustrated with having these short term projects, even if they were long term, even if they were eight months. It just felt like, I really never felt like I was doing justice to the subject matter. And I really recognized at the time that I wanted to deep dive into a particular space, and I really wasn't sure what that space was. And so I did a lot of searching around and found Capital one as part of that search. And also, like Steph, it was not my lifelong dream, lifelong dream to work in a bank, and was very surprised when I came here and started talking to people. And it was fascinating to me, the approach, and again, to go back to how it's oriented in the design department really struck me as how they viewed it as a discipline. And that's one of the major factors that drew me here, because I felt like, okay, it's a company that gets it. It understands. It's an actual discipline that needs to be applied to a problem space. It's not just a design that gets slapped on top of data science or analysis or what have you. It was really ingrained in their approach to the entire problem space. So that was really exciting to me. I mean, I can read you from my job description. The opening line is, this role makes data tangible for our company and customers, thereby empowering us all by transforming what's unknown into something that's known. And to me, that's really the crux of what data visualization is. It's uncovering. It's discovering what's in that data. It's not applying a visual to. To the data. It's uncovering what's inside the data to make the visual. You know, I always go back to this Michelangelo quote that every block of stone has a statue inside it. It's the sculptor's job to discover it. And that may seem grandiose, but that's exactly the way I view data visualization, is that you take this gob of data and you start chipping away at it until you discover the form of it, and then the form arises out the data. And so it was an approach that they. That capital one, now we. I keep saying they. I have to start saying, we can't wait. As a company, though, the approach was, and I think throughout design, and Steph can speak to this more, but throughout design as, as a whole and embracing lots of different disciplines from, you know, content strategy, visual design, UX design, AI design, all of it comes from that critical problem space like, problem solving aspect of design, which I appreciated.",
      "id": "ep_99_ut_31"
    },
    {
      "end": 735700,
      "speaker": "Steph Hay",
      "start": 677514,
      "text": "Design has a bit of tradition also in Capital one. I remember a few years ago, you made big waves with acquiring adaptive path, which was probably one of the best design information architecture companies at that time. And I think it was also many other companies followed in acquiring design agencies. But I think Capital one was very early in recognizing that an in house agency can be super valuable. So looking at data visualization, I mean, there's a million ways, or a billion ways probably, you can use it inside a bank or like a big digital financial company. Do you think it will mostly focus on the product side and let's say, communication side of things? Or will you also work a lot on internal projects? Will it be all across the board? Like, how is your. What do you think? How will your role play out? You said already you don't quite know, but what's your feeling?",
      "id": "ep_99_ut_32"
    },
    {
      "end": 798708,
      "speaker": "Kim Rees",
      "start": 735852,
      "text": "Right, right. Yeah, I'm still getting a sense of that still, you know, getting my, you know, drinking from the fire hose of what's needed in the company. And, you know, everybody's take on that. My sense that I'm getting is it's probably about two thirds internal, one third external. You know, I think that communication is a big part of what the company wants to do. You know, it's, from my job description, even focuses on the customer. It's a very customer focused company. You know, really from, you know, not just caring about the customer, but really wanting to change the way people interact with their money, which I think is such a beautiful area to affect lives. And. And it's really ingrained in the company. So I know that there will be a portion of Dataviz that comes to bear in that problem space. But internally, as with any large corporation, there's tons of work to be done inside to make work more efficient and help drive decisions.",
      "id": "ep_99_ut_33"
    },
    {
      "end": 1058068,
      "speaker": "E",
      "start": 798836,
      "text": "Yeah, there's certainly no shortage of opportunities for this kind of work or any sort of design discipline. But, you know, Kim already said it that, you know, really being able to discover, you know, to know what we don't know. There's an appetite here for that because the founder of our company is still our CEO. So in our roots, in our DNA, we have a couple things that make capital one and respecting these, these disciplines, pretty unique. One is that, you know, capital one grew out of our. Our specific approach to data, in being able to model credit risk in a way that we were able to offer products to folks who were otherwise shut out of the market at that time, because we looked at the data in a different light, to know something that other companies didn't know. And in doing so, we enabled millions of people to rebuild their credit and actually be able to live their lives doing the things that other folks might take for granted, like, you know, someday be able to buy a house. You know, that that's impossible to do without great credit, and it's impossible to build great credit without having somebody give you an opportunity to do that over time. And so, you know, our company is built in data science like our company stands on the shoulders of our data scientists. And a second part about that is, again, with our, you know, founder being our CEO. There's an entrepreneurial nature to the company. That means folks are curious, and they're actually. I mean, this is a big reason why I joined, is that when I came in a few years ago to give a talk on content first design, which is what I had been talking about on stages at the time, what I'd been practicing to validate a couple business ideas, what I found from that experience is that the folks I was talking to had energy in their eyes, you know, when you're talking to somebody and you think that this is like, oh, I'm gonna go give a talk to the design team at a corporate, in a corporate culture, and they're probably just, you know, an in house studio, and they're probably just executing on production requests. You know, I was 100% wrong. I came in and I met people who won't even go to the fidelity of design that they might have been practicing most of their careers, until they understand the why, until their curiosity is satisfied through the research that this company demands that we do, and not just because we're regulated, but because we want to launch unassailable products that really meet people's needs. You can't just do that by creating a bunch of stuff. You have to understand the motivations that people have, and especially in such a highly emotional area, like money, which is a taboo topic. It's this endless challenge for a designer mind, for lots of kinds of minds, scientists, a whole bunch of different disciplines. But I was struck when I came a couple years ago at how much that DNA of the company, the entrepreneurial nature of the company, the curiosity, the drive to understand motivations, was part of the work that the design team was doing. And then I realized I wanted to be a part of it enough that I was willing to walk away from my perfect life, where I had worked really hard to get to with a perfect schedule, and I didn't even own pants that weren't, like, elastic waist, you know, but there was people who were way smarter than me, and I wanted to be on that team. So. So that's sort of just like, some context about, you know, the opportunity here for data visualization is we should talk about. Because it's a Dataviz podcast, but it's not unique to Dataviz. Right. It's why a content strategist came. It's why we have user research and service designs, why adaptive path said famously in their launch post, there was an alignment of values here, and that's unique.",
      "id": "ep_99_ut_34"
    },
    {
      "end": 1085184,
      "speaker": "Steph Hay",
      "start": 1058116,
      "text": "Yeah, it's really interesting. So I'm really curious, Kim, so you're known as maybe others for very, like, crafty, bespoke, boutique style, you know, very, like, specific, specific work. And then there's how. I mean, how do you plan to scale that to 40,000 people? That's the one question I really have in mind.",
      "id": "ep_99_ut_35"
    },
    {
      "end": 1187328,
      "speaker": "Kim Rees",
      "start": 1087844,
      "text": "Right. Well, the way I think about it is that the audience for the bespoke work was always huge. Anyway, we might be designing it for a small firm or a company that is focused specifically on one area, and it's very well crafted to that space. But the audience for that, the people using the tool that we made or learning about the subject matter through the visualization we made, those audiences are huge. And so I see it in the same way in that the people using these data visualizations internally, they'll actually be probably smaller audiences. And that's one of the appealing things to me, is because you can get right into the problem better, because you're sitting side by side with people who are trying to solve the problem, right. And that's their career is trying to solve this problem or trying to. Or they have a workflow around some problem space that you would like to enhance and give them better tools to find those insights faster or surface, you know, surface certain things about the data faster for them that would, you know, give them, you know, lift on their workflow and what they're trying to achieve. So that, to me, is exciting because it's not just the, you know, one of the things with being a, a firm working on public facing works is you never know what happens when you send it out into the world. Right? You launch it, it goes out there.",
      "id": "ep_99_ut_36"
    },
    {
      "end": 1188560,
      "speaker": "Steph Hay",
      "start": 1187456,
      "text": "Get a few tweets.",
      "id": "ep_99_ut_37"
    },
    {
      "end": 1300944,
      "speaker": "Kim Rees",
      "start": 1188712,
      "text": "Yeah, you get some tweets and your friends all say what a great job you did. Hooray. And pat you on the back. Exactly. And then you're done. And that's really unfulfilling to me. I mean, I think it was fun for a while, but once that happens enough times, the fun of it wears off, and then you look for something more impactful and more meaningful. So that's where I'm at now. That's a really exciting space for me to be working with these teams of people where I can bring this discipline into their space and help them solve their own problems. So that's exciting. And I can't claim that any of these will be these handcrafted, wonderful little packages that I'm accustomed to building, but I think that they. But that's also not warranted. You know, I'm not. Again, I think that taking the approach of, you know, I think this is like, the perfect example that Elijah gave in his, when you talked to him was, you know, he said, you know, D3 is part of the problem that, you know, people sort of practitioners see, like, oh, we'll just slap on some D3 onto this, this thing and then we'll go. And I agree, that's a huge part of the problem, is practitioners. A lot of practitioners just see it as paint job when they need to see themselves as the architect of the building, not just the painter of the building. So I think that infusing that thought process here is going to be really exciting. And the paint job is much less interesting to me than the architecting. It might not have a beautiful paint job, but, hell, it's going to be one hell of a building.",
      "id": "ep_99_ut_38"
    },
    {
      "end": 1319700,
      "speaker": "Steph Hay",
      "start": 1303564,
      "text": "Yeah, I mean, I can totally see how there's lots of need, but I mean, I think the big challenge is you cannot clone yourself, like, just a thousand times and send out all these Kim's company unless you're working on that somehow.",
      "id": "ep_99_ut_39"
    },
    {
      "end": 1323248,
      "speaker": "Kim Rees",
      "start": 1319892,
      "text": "I am working on, yeah.",
      "id": "ep_99_ut_40"
    },
    {
      "end": 1352974,
      "speaker": "Steph Hay",
      "start": 1323376,
      "text": "So how do you, like, how do you scale the method? How do you scale? That's my main question, and one I'm not clear about myself, but it's a question I get when I talk to big industry. It's a question I often get. It's like, that's all very nice, what you're doing there, and that's all very amazing and bespoke and so crafty, but we need something that scales, and, like, both the tool needs to scale, but also the method to create the tool. And what's your feeling like, how can we get there?",
      "id": "ep_99_ut_41"
    },
    {
      "end": 1361626,
      "speaker": "E",
      "start": 1353754,
      "text": "I'll interject for a second and say that question of how does that scale is something that could apply to any discipline in design and does.",
      "id": "ep_99_ut_42"
    },
    {
      "end": 1362330,
      "speaker": "Steph Hay",
      "start": 1361730,
      "text": "Right.",
      "id": "ep_99_ut_43"
    },
    {
      "end": 1506624,
      "speaker": "E",
      "start": 1362482,
      "text": "The question is, what do you value? What are you trying to learn from this? If scale for scale sake, I wouldn't imagine that our head of data visualization needs to work on that, because we have, you know, there's ubiquitous tools today that enable us to achieve scale very quickly for the sake of scale. But that's not, you know, that's. And in some cases, that's absolutely what the team needs. So that's what they value, that's what they need for XYZ reason. But this is where if you. You're not trying to scale a giant. You know, I have a one data visualization person to designer to every single person who works at this company. Sorry, Kim. You're not gonna have a 40,000 person team over the next year, maybe. I don't think so anyway. But in that case, what are we creating as a criteria for the kinds of initiatives that we are uniquely positioned to work on? In which case, we have to get into values discussions, we have to get into goals discussions, we have to get into collaborative discussions where we're describing shared outcomes with our product and tech partners. As Kim said, we're positioned in design, and we are working as a strategic and thought partner and we ship with our product and tech teams. And so it's highly consultive and consultative in that respect. We have to be able to communicate with folks about what our shared outcomes are in order to be able to get to the paint color right. To be able to know what the product actually needs to be. And there's such a value on the practice here as the necessary and adaptable means to an end that enables us to be able to say, you know, let's put scale to the side for a second, which is the human nature part about this. We got to fix this yesterday for, you know, 60 million customers. What are we trying to achieve together? Let me bring my whole brain to this before I bring my hands to this. That is the nature of how capital one works. And so to be able to understand the best system for distributing the practice first is really what is going to unlock any ability to eventually scale.",
      "id": "ep_99_ut_44"
    },
    {
      "end": 1513902,
      "speaker": "Steph Hay",
      "start": 1507284,
      "text": "And if it's good enough, it will develop feat of itself, hopefully anyways, because then it just needs to happen anyways.",
      "id": "ep_99_ut_45"
    },
    {
      "end": 1563406,
      "speaker": "E",
      "start": 1514028,
      "text": "That's right. That gets back to the entrepreneurial piece about this, right? That's traction. That's the definition of traction. If you cannot come together with product and tech in making a shared vision come to life in some way, super low fidelity prototype through something that's been invested in already, then you're actually missing the practice part. You've got a product without any market, without any infrastructure, and that's not something that this company particularly values. It's not part of the sustainable business model. So the emphasis is really on finding that shared outcome together and creating roadmaps together and delivering on them and achieving them and measuring them together. And that's the only way that we can really make successful products together.",
      "id": "ep_99_ut_46"
    },
    {
      "end": 1672734,
      "speaker": "Enrico Bertini",
      "start": 1563550,
      "text": "So I'm wondering if this is also somewhat connected to the idea of. So when we talk about visualization, we can talk about a tool, focus on tools, or focus on the process or the service. I think what is interesting, I think my guess is that a visualization person within a company like capital one can probably have a lot of internal customers. And the value of this kind of person is mostly about being able to talk to these people and understand what their questions and problems are and then figure out how to find the right data and how to turn this data into visualizations that are insightful for them. And this whole process is actually pretty, pretty complex. And actually I see a strong visualization person, as a person, is not only able to turn data into pixels, but also being able to go through these all very complex and messy process and. Yeah. And find out how to help people. Right. I personally believe, I find it a little unfortunate that data science is often equated to building machine learning models. I think actually a real data science, I don't distinguish personally too much between a database person or a data scientist. My ideal person would be a person who is able, as I said, to talk to people who have a problem, figure out how to solve it with data. Right. I don't know if this reflects some of the work that you're going to do, capital one, but I think it's important to distinguish between also in terms of scalability. Right. What do we need to scale? Do we need to scale in terms of building a thousand different tools or having people that are able to go through this complex process.",
      "id": "ep_99_ut_47"
    },
    {
      "end": 1673278,
      "speaker": "E",
      "start": 1672854,
      "text": "Right.",
      "id": "ep_99_ut_48"
    },
    {
      "end": 1674934,
      "speaker": "Enrico Bertini",
      "start": 1673366,
      "text": "I mean, does it make sense what I'm saying?",
      "id": "ep_99_ut_49"
    },
    {
      "end": 1881784,
      "speaker": "E",
      "start": 1675014,
      "text": "Yeah. And everything you're talking about, it's why, it's why we were so psyched that Kim wanted to talk to us and then that we continued to have conversations. And she came in to meet the team, which I'll talk about in a second. And then we ultimately were able to have her be our head of data visualization, because that expertise that you were just describing is part of how she works. It's how she approaches the practice, her practice. And it is absolutely essential to be able to get at the why that makes for sustainable, truly valuable, meaningful kinds of experiences, whether they be internal or external. And so we needed to find somebody who really held that as the absolute precursor to being able to do great design work. And that's going to be, you know, that's going to be part of every single initiative that she and her team end up working on. And just to talk a little bit about sort of the moment that I knew, I was like, can we make her an offer today? What do we need to do here is because, you know, we'd had some conversations with her, and then every Thursday I was mentioning at the top of this call, the entire design team gets together. So there are a little bit more than 400 folks across ten locations on our design team at Capital one. And every Thursday we get together over lunch if you're on the east coast, or breakfast if you're on the west coast. And we spend some time together in what's called what's up Thursday. And what's up Thursday is a weekly design share out. We have guest speakers come in, folks, show some of the work that they're doing. We give general updates, and it's a signal for our entire design culture that once a week we want to get everybody together to stay in touch with the kind of work that different teams are doing across the company. And last fall we invited Kim to come be a presenter at what's up Thursday. And this was new. Nobody on the team knew that we were like, hmm, maybe we should create a data visualization practice that follows in the same sorts of footsteps that design thinking or service design with adaptive path or content strategy did. This was inviting Kim to give a talk, which, by the way, I was invited to give a talk three years ago, not at what's up Thursday. It turns out it's a very effective recruiting mechanism, by the way. Okay. But we sort of crossed our fingers and Kim came and gave a talk that I think actually is on slideshare right now and has like 800 billion views or something. Understandably, the talk really focused on uncovering what we don't know. And it wasn't about all of the things you can make. It was about uncovering what we don't know. And it just so happens that once you've uncovered that, you can make some things that help to illustrate that story and even from a few different angles. And money is so intensely personal, and you can slice and dice it in 16,000 different ways per person. And every person is different. Right.",
      "id": "ep_99_ut_50"
    },
    {
      "end": 1890924,
      "speaker": "Steph Hay",
      "start": 1882084,
      "text": "And it's intrinsically numeric like. No. Yeah. I mean, that's like the most number based thing we have.",
      "id": "ep_99_ut_51"
    },
    {
      "end": 1894634,
      "speaker": "Enrico Bertini",
      "start": 1891004,
      "text": "I think you can't go more quantitative than this.",
      "id": "ep_99_ut_52"
    },
    {
      "end": 1932822,
      "speaker": "E",
      "start": 1897294,
      "text": "We ended up, what's up Thursday? She got questions. And after what's up Thursday? I started getting emails from folks like, hey, how come we don't have data visualization? Like, how can we hire Kim? Can we automatically, after a 45 minutes talk with having access to the way that a practitioner who's so skilled as Kim is in this, this specialty, sort of open up her brain for everybody and make it about the practice and not about the paint. It was enlightening to the folks in the room, and it just became an instant hit. So another.",
      "id": "ep_99_ut_53"
    },
    {
      "end": 2023942,
      "speaker": "Kim Rees",
      "start": 1932878,
      "text": "Yeah, just to jump in there, too. I remember during my interview process, I interviewed with a VP and, you know, after we got through the, you know, hi. Hello. Chit chat, he had one question for me, which was, you know, what, something to the effect of, like, why are you so interested in data in this space of banking? And I said, I want to figure out why we as humans are so illogical about money. And he smiled and he said, all right, thanks, and walked out of the room and I was like, okay, can I just nail that or fail? Exactly, exactly, exactly. Turns out I nailed it. But it was so great for me that somebody had that level of insight about the space that they're thinking of it, too, from the top on down. Like, let's figure out these big questions, let's apply these multiple disciplines to these big questions that we still don't know. And it takes a lot of different disciplines to come to bear on that problem space, which I also want to add, going back to the scale question. I think part of the problem is that I think we sometimes get myopic about data visualization and think it's the one hammer to hit all the nails when it's off.",
      "id": "ep_99_ut_54"
    },
    {
      "end": 2024834,
      "speaker": "Enrico Bertini",
      "start": 2023958,
      "text": "And I agree.",
      "id": "ep_99_ut_55"
    },
    {
      "end": 2032074,
      "speaker": "Kim Rees",
      "start": 2025934,
      "text": "I hear that all the time. I hear, oh, Datavis could solve this or that. Once you get into it, you're like, meh.",
      "id": "ep_99_ut_56"
    },
    {
      "end": 2038134,
      "speaker": "Steph Hay",
      "start": 2032454,
      "text": "And there's lots of focus on how you Datavisor, but not what your data was and why your data was good.",
      "id": "ep_99_ut_57"
    },
    {
      "end": 2039318,
      "speaker": "Kim Rees",
      "start": 2038174,
      "text": "Right, exactly.",
      "id": "ep_99_ut_58"
    },
    {
      "end": 2043614,
      "speaker": "Steph Hay",
      "start": 2039366,
      "text": "And so we talk a lot about the how and maybe lose sight of the what and the why sometimes.",
      "id": "ep_99_ut_59"
    },
    {
      "end": 2101048,
      "speaker": "Kim Rees",
      "start": 2043694,
      "text": "Right, right. So I think there's a lot of that. You know, there are a lot of things that can be solved with data science, machine learning, with ux, with other things, you know, with just sitting down and thinking about your problem harder instead of running to somebody else to figure it out, you know, put the data vis on it and it'll solve all your problems, you know? So I think that's part of it, is that we see that, oh, there's a head of dataviz, now we have to apply it to the entire company. I don't really see it that way. I see it there are strategic places to inject it. There are places where the tools already suit the need. My team's not going to replace Tableau. There's a time and a place for Tableau, and it's perfectly fine. And Tableau scales wonderfully in that space. So I see it as there are multiple types of practices within the field that can address those areas.",
      "id": "ep_99_ut_60"
    },
    {
      "end": 2153598,
      "speaker": "Enrico Bertini",
      "start": 2101176,
      "text": "Yeah, and I think a somewhat related question, so maybe this is more for Steph. I think some people in industry say that one problem with visualization is that the value of visualization is very hard to quantify. That's maybe the reason why in some, in some industries, people who are hired as visualization experts are actually not taking leadership positions, because, as I said, it's very hard to quantify the value of this work. So I don't know how true this is, but I'm curious to hear what your perspective is there. Right. Because I think it's somewhat true that it's not that easy to put visualization in a box and figure out what is the actual, precise, quantifiable value that comes out of it. But this doesn't mean that it's not important.",
      "id": "ep_99_ut_61"
    },
    {
      "end": 2162894,
      "speaker": "Kim Rees",
      "start": 2153726,
      "text": "Right, exactly. I think Steph could speak to that as, you know, the bigger issue of design in general being you could lump all of that.",
      "id": "ep_99_ut_62"
    },
    {
      "end": 2164070,
      "speaker": "Enrico Bertini",
      "start": 2162934,
      "text": "Oh, yeah, absolutely.",
      "id": "ep_99_ut_63"
    },
    {
      "end": 2166702,
      "speaker": "Steph Hay",
      "start": 2164222,
      "text": "Your x design is basically in the same boat.",
      "id": "ep_99_ut_64"
    },
    {
      "end": 2167714,
      "speaker": "Enrico Bertini",
      "start": 2166798,
      "text": "Yeah, exactly.",
      "id": "ep_99_ut_65"
    },
    {
      "end": 2247464,
      "speaker": "Kim Rees",
      "start": 2170094,
      "text": "But I think that in this space of banking, there are obvious ways of quantifying, you know, the practice when you apply it to a space. Yeah, I can't speak to a tool that I just found out about a couple weeks ago here, but there is a, you know, there is a bottom line to a lot of this, a lot of this problem areas here where that we can quantify. So, you know, and I think that, you know, there are lots of companies who can do that. I think that we, you know, I don't know if it's just a matter of. We don't take the time to quantify it. We don't take the time to sit back and recognize, okay, what went into this solution and divvy up the accolades to various areas because it's oftentimes, almost always a group effort between the people who are, you know, using the tool, the people who came in at various design stages, the strategy, you know, who knows what all goes into these things. So sometimes it's hard to just pick apart. But I think there, you know, when you're actually using these things, there's. There's an obvious way of quantifying it overall.",
      "id": "ep_99_ut_66"
    },
    {
      "end": 2363744,
      "speaker": "E",
      "start": 2247544,
      "text": "This also gets back to the notion of collaboration and shared outcomes, sort as Kim was talking about. I mean, first of all, how do you describe value? What am I trying to achieve in this? And are you working with somebody in data visualization to arrive at an ideal solution and then receiving that solution? It actually helps you clarify something that makes your work more effective or makes the product better or whatever it might be. And if everybody says yes, then that question goes away. Right. Because it's obvious that it's been qualified even so heavily and then measured downstream in certain ways that, again, the entire team gets credit for the shared work that they've done. But I think it also, if I put on my content strategist hat for a second, what's the value of content strategy? I don't know. Do you want to work with me? I mean, if I gave you a number. $60. How is that helping? I get back to where we were at the be. Like, what is the why of you asking that question in the first place? Because once I understand your values and what you're trying to achieve, I could tell you whether or not I feel like my craft or the way I approach my craft is actually going to help you achieve your goals, or if there's somewhere else that you're going to achieve scale or achieve whatever for a cent, you know, or whatever it is, that's your actual value. So I think that question of, like, what's the quantified evidence or the ROI on this discipline is really almost a symptom of a longing to control risk or control the outcome before you've even uncovered what the real problem is that you could potentially solve together.",
      "id": "ep_99_ut_67"
    },
    {
      "end": 2367804,
      "speaker": "Enrico Bertini",
      "start": 2363904,
      "text": "So it looks like the bottom line is that you have to work for the right company.",
      "id": "ep_99_ut_68"
    },
    {
      "end": 2373232,
      "speaker": "Steph Hay",
      "start": 2370104,
      "text": "That always helps. That always helps.",
      "id": "ep_99_ut_69"
    },
    {
      "end": 2452334,
      "speaker": "E",
      "start": 2373328,
      "text": "That's why I'm here. Remember the part where I said I didn't have access pants that didn't have spandex in them? Like, that was a great life. Okay? But at the end of the day, too, I think for the practitioners, for any of us, no matter what our specialty is, what do we value? Who do we want to work with? What problems do we want to try to solve? Kim described hers. I'm endlessly fascinated about the way people talk about money and how certain words that we might use can trigger an emotional reaction in one person, and another person doesn't even blink an eye on it, and, like, there's something there. Holy cow. What was that? That was some human stuff right there. And being able to figure out if we can design systems that are nuanced, especially, you know, with access to, like, massive amounts of data. And, you know, AI, being able to serve up variable experiences still requires a designer understand why we're doing it in the first place and what the reaction is going to be on an experiential level. And that takes a particular kind of person to be thinking through those problem statements in a way that enables the systems and teams to be successful. So, yeah, it is about working for the right company, for sure. It's about working with the right team.",
      "id": "ep_99_ut_70"
    },
    {
      "end": 2481534,
      "speaker": "Enrico Bertini",
      "start": 2452714,
      "text": "Yeah, very good. So I think we have to wrap it up soon. Maybe. One last question I would like to ask is so many of our listeners are aspiring data visualization professionals. So do you have any suggestions for them? So say there is a person who is listening to this and really wants to become a database pro and work in a company like Capital one and having a great position. So what would you suggest? How do you get there?",
      "id": "ep_99_ut_71"
    },
    {
      "end": 2482834,
      "speaker": "E",
      "start": 2481694,
      "text": "Kim REESE.",
      "id": "ep_99_ut_72"
    },
    {
      "end": 2615674,
      "speaker": "Kim Rees",
      "start": 2487574,
      "text": "I have no idea. I mean, I can only speak in hindsight as to my ideas, as to why I think, you know, I was brought on here. I think Steph could speak to the larger picture of why they started looking and who they were looking for exactly. And who they talked to and that sort of thing. And what was effective, I think for me personally, it was to, are the things that I see as important in terms of getting recognized in the space and having the opportunities to choose from in the space are focusing on actual impact, not really going back to the paint, not just making beautifully painted buildings, but actually thinking about the building, thinking about why you did that the way you did, communicating it, not being afraid to get out and talk about it, whether that's speaking in public, writing a blog post, whatever it is, but really communicating because that's how you're able to drive your visibility. People are just craving information from us as practitioners of data visualization. Absolutely craving it. There's such a lack of insight around how we do what we do. I think we get in the habit as a, as an industry to focus on the end product. And here's this pretty thing I made. But we don't talk so much about how we got there, and oftentimes we don't even know how we got there. And it takes a lot of work to go back and figure out how you got there and then to talk about it and talk about why it's meaningful and to sort of demystify and unravel and unpack that end product. So I would say that's, I think people value that so much and they sit up and take notice of that when you share it back out to the community. So I think that that's at least one way of getting out there, more visibility, do the work and then share it.",
      "id": "ep_99_ut_73"
    },
    {
      "end": 2757734,
      "speaker": "E",
      "start": 2615754,
      "text": "Similar to what Kim's saying here. I think there's such value in making things, generally speaking, and so definitely not taking away from that the joy that comes from the creative process. You test yourself. You're learning new, new skills. You try out some new tool that just came out. You see whether or not works for you. You show people what you're making, like Kim talks about and adding that, you know, and that's like sort of step one. Step two is adding that layer of transparency into why you made the decisions that you did or why you made the choices about using this tool over that one or taking it from this angle over that one, that starts to enable me to understand who you are in the way that you think. And as a design team here at Capital one, we have a few values that we hold dear. Humble, compelled and daring. And this humility is absolutely required in order to listen. And if we get too proud of the things that we're doing, then we cut off what we absolutely need to be great designers, which is hearing what the need is. And if that's an internal customer or external customer, compelled is. You're compelled by your work, you're compelled by the opportunity. And daring is because we don't have incrementality, as, you know, as a norm. Here it is. What are we willing to push to make right for our customers? Like I said earlier, we are unassailable. We have the kinds of products and services and market and are continually evolving those to be unassailable for our customers. And that's how we have to show up for our work, too. And so sometimes I think that really requires people to suggest things that might seem unpopular or might seem like, you know, out there. Quite frankly, we would never go for that. But that's the daring part. And so somebody who can, you know, of course, is a great maker and a great thinker and believes in the kinds of values I just talked about. I'm sure that the kinds of values I just talked about are also not unique to capital one, but they are part of Capital one's design team culture. And if that all sounds good, then keep on and maybe stay tuned for Kim Rees posting job descriptions.",
      "id": "ep_99_ut_74"
    },
    {
      "end": 2761776,
      "speaker": "Kim Rees",
      "start": 2760354,
      "text": "Watch this space.",
      "id": "ep_99_ut_75"
    },
    {
      "end": 2763120,
      "speaker": "Steph Hay",
      "start": 2761920,
      "text": "Who knows?",
      "id": "ep_99_ut_76"
    },
    {
      "end": 2764364,
      "speaker": "Kim Rees",
      "start": 2763312,
      "text": "Exactly.",
      "id": "ep_99_ut_77"
    },
    {
      "end": 2778744,
      "speaker": "Steph Hay",
      "start": 2766504,
      "text": "So unfortunately, we'll have to wrap it up. But, yeah, we can only, I think, congratulate you both. It's an improbable match, but it's going to be a very good match. And so often these are the best.",
      "id": "ep_99_ut_78"
    },
    {
      "end": 2790732,
      "speaker": "E",
      "start": 2778904,
      "text": "Well, and congratulations on your almost hundredth episode. It feels good to be on the precipice here. With 99 greatness, we're ushering in a new era.",
      "id": "ep_99_ut_79"
    },
    {
      "end": 2792304,
      "speaker": "Kim Rees",
      "start": 2790828,
      "text": "That's right. That's right.",
      "id": "ep_99_ut_80"
    },
    {
      "end": 2797504,
      "speaker": "Steph Hay",
      "start": 2792604,
      "text": "Maybe we should get you on again for number 199 and see how it all played out.",
      "id": "ep_99_ut_81"
    },
    {
      "end": 2800596,
      "speaker": "Kim Rees",
      "start": 2799564,
      "text": "I'm down for it.",
      "id": "ep_99_ut_82"
    },
    {
      "end": 2817132,
      "speaker": "Steph Hay",
      "start": 2800660,
      "text": "Yeah. And Kim, I hope you also will have an opportunity to share some of the work you do. I think it's a very, like, yeah, it's such a great challenge and we are really curious, like, what's going on. And so, absolutely, this could be an inspiration to the whole industry, right?",
      "id": "ep_99_ut_83"
    },
    {
      "end": 2844064,
      "speaker": "Kim Rees",
      "start": 2817188,
      "text": "Absolutely. I know it's hard to do in a company and also highly regulated company like Capital one. Sure. But it's something that I'm very passionate about. I want to give back to the community because I think it's essential for the growth of data visualization and for the people within visualization to see how it's applied in different contexts. So I absolutely want to share back. Yeah, as soon as I can.",
      "id": "ep_99_ut_84"
    },
    {
      "end": 2845628,
      "speaker": "Steph Hay",
      "start": 2844764,
      "text": "Fantastic.",
      "id": "ep_99_ut_85"
    },
    {
      "end": 2846956,
      "speaker": "E",
      "start": 2845716,
      "text": "Give her a couple more weeks.",
      "id": "ep_99_ut_86"
    },
    {
      "end": 2848104,
      "speaker": "Enrico Bertini",
      "start": 2847060,
      "text": "Yeah, yeah, yeah.",
      "id": "ep_99_ut_87"
    },
    {
      "end": 2857644,
      "speaker": "Steph Hay",
      "start": 2849164,
      "text": "Get settled in first. Cool. Thanks so much for coming on. This was great. And yeah, we're curious to see what's next.",
      "id": "ep_99_ut_88"
    },
    {
      "end": 2858084,
      "speaker": "Kim Rees",
      "start": 2857724,
      "text": "Awesome.",
      "id": "ep_99_ut_89"
    },
    {
      "end": 2858716,
      "speaker": "Steph Hay",
      "start": 2858124,
      "text": "Thanks so much.",
      "id": "ep_99_ut_90"
    },
    {
      "end": 2859364,
      "speaker": "E",
      "start": 2858780,
      "text": "Thank you.",
      "id": "ep_99_ut_91"
    },
    {
      "end": 2859948,
      "speaker": "Kim Rees",
      "start": 2859444,
      "text": "Thank you.",
      "id": "ep_99_ut_92"
    },
    {
      "end": 2876600,
      "speaker": "Enrico Bertini",
      "start": 2859996,
      "text": "Thank you. Bye. Bye bye. Hey, guys, thanks for listening to data stories again. Before you leave, here are a few ways you can support the show and get in touch with us.",
      "id": "ep_99_ut_93"
    },
    {
      "end": 2891320,
      "speaker": "Moritz Stefaner",
      "start": 2876672,
      "text": "First, we have a page on Patreon where you can contribute an amount of your choosing per episode. As you can imagine, we have some costs for running the show and we would love to make it a community driven project. You can find the page@patreon.com Datastories and.",
      "id": "ep_99_ut_94"
    },
    {
      "end": 2901954,
      "speaker": "Enrico Bertini",
      "start": 2891352,
      "text": "If you can spend a couple of minutes rating us on iTunes, that would be extremely helpful for the show. Just search us in iTunes store or follow the link in our website.",
      "id": "ep_99_ut_95"
    },
    {
      "end": 2926062,
      "speaker": "Moritz Stefaner",
      "start": 2902294,
      "text": "And we also want to give you some information on the many ways you can get news directly from us. We're, of course, on twitter@twitter.com, Datastories. But we also have a Facebook page@Facebook.com, datastoriespodcast. And we also have a newsletter. So if you want to get news directly into your inbox, go to our homepage data stories and look for the link that you find in the footer.",
      "id": "ep_99_ut_96"
    },
    {
      "end": 2947662,
      "speaker": "Enrico Bertini",
      "start": 2926198,
      "text": "And finally, you can also chat directly with us and other listeners. Using Slack again, you can find a button to sign up at the bottom of our page. And we do love to get in touch with our listeners. So if you want to suggest a way to improve the show or know amazing people you want us to invite or projects you want us to talk about, let us know.",
      "id": "ep_99_ut_97"
    },
    {
      "end": 2948670,
      "speaker": "Steph Hay",
      "start": 2947758,
      "text": "That's all for now.",
      "id": "ep_99_ut_98"
    },
    {
      "end": 2975264,
      "speaker": "Moritz Stefaner",
      "start": 2948742,
      "text": "See you next time, and thanks for listening to data stories. Data stories is brought to you by click. Are you missing out on meaningful relationships hidden in your data? Unlock the whole story with Qlik sense through personalized visualizations and dynamic dashboards, which you can download for free at Qlik.de/datastories . That's Qlik.de/datastories.",
      "id": "ep_99_ut_99"
    }
  ],
  "confidence": 0.937963070785067,
  "audio_duration": 2975,
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_status_code": null,
  "webhook_auth": false,
  "webhook_auth_header_name": null,
  "speed_boost": false,
  "auto_highlights_result": null,
  "auto_highlights": false,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_audio_quality": null,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "content_safety": false,
  "iab_categories": true,
  "content_safety_labels": {
    "status": "unavailable",
    "results": [],
    "summary": {}
  },
  "language_detection": false,
  "language_detection_threshold": null,
  "language_confidence": null,
  "custom_spelling": null,
  "throttled": false,
  "auto_chapters": true,
  "summarization": false,
  "summary_type": null,
  "summary_model": null,
  "custom_topics": false,
  "topics": [],
  "speech_threshold": null,
  "speech_model": "best",
  "chapters": [
    {
      "summary": "This is a new episode of data stories. Are you missing out on meaningful relationships hidden in your data? Unlock the whole story with Qlik sense through personalized visualizations and dynamic dashboards.",
      "gist": "Data Stories",
      "headline": "Are you missing out on meaningful relationships hidden in your data",
      "start": 120,
      "end": 75198,
      "id": "ep_99_ch_0"
    },
    {
      "summary": "So we have episode 100 coming up. If you have any favorite episodes, anecdotes to share any memorable moments. We made an audio voice box. You can call us and leave us a message. If it's a good message or a funny one, we might play it on the show.",
      "gist": "Hello 99: A Day in the Life",
      "headline": "So we have episode 100 coming up. And dear listeners, if you have any favorite episodes, anecdotes",
      "start": 75366,
      "end": 140312,
      "id": "ep_99_ch_1"
    },
    {
      "summary": "This episode is a follow up to last week's discussion about the role of data visualization in industry. We have two very interesting people. Directly from Capital one, we have Kim Rees. And Steph. Welcome on the show.",
      "gist": "Another Interesting Episode on Data Visualization",
      "headline": "This episode focuses on the role of data visualization in industry",
      "start": 140408,
      "end": 183222,
      "id": "ep_99_ch_2"
    },
    {
      "summary": "Kim is head of data visualization at Capital one. Steph is the head of content culture and AI design. Can you briefly introduce yourself and tell us a little bit more about you, what you are doing?",
      "gist": "Introducing Capital One's Data Visualization Head",
      "headline": "Kim and Steph are the head of data visualization at Capital One",
      "start": 183358,
      "end": 216660,
      "id": "ep_99_ch_3"
    },
    {
      "summary": "Kim Reese is the head of data visualization at Capital one. The company is focusing on bringing data visualization to bear across the enterprise. Reese has no idea what her new role is yet.",
      "gist": "Meet Kim Reese, Head of Data visualization at Capital One",
      "headline": "Kim Reese is head of data visualization at Capital One",
      "start": 216812,
      "end": 447014,
      "id": "ep_99_ch_4"
    },
    {
      "summary": "Kim: I wanted to deep dive into a particular space. Capital one viewed data visualization as a discipline. Do you think it will mostly focus on the product side and let's say, communication side of things? Or will you also work a lot on internal projects?",
      "gist": "Reveal: The Search for Data Visualization Talent",
      "headline": "Capital One recently acquired data visualization company Kim. So, Kim, can you tell us a little bit about how this happened",
      "start": 447914,
      "end": 1059668,
      "id": "ep_99_ch_5"
    },
    {
      "summary": "Kim is known for her bespoke, boutique style work. How do you plan to scale that to 40,000 people? The audience for the bespoke work was always huge. The people using these data visualizations internally will probably be smaller audiences.",
      "gist": "Inventing the Data Visualizations",
      "headline": "Kim says the audience for bespoke work is always huge",
      "start": 1059796,
      "end": 1323248,
      "id": "ep_99_ch_6"
    },
    {
      "summary": "The question of how does that scale is something that could apply to any discipline in design. If you cannot come together with product and tech in making a shared vision come to life, you're missing the practice part. To be able to understand the best system for distributing the practice first is really what is going to unlock any ability to eventually scale.",
      "gist": "How Do You Scale the Data Visualization Practice?",
      "headline": "How do you scale the tool and the method to create the tool",
      "start": 1323376,
      "end": 1563406,
      "id": "ep_99_ch_7"
    },
    {
      "summary": "Capital One has a weekly design share out. Every Thursday, the entire design team gets together. They invited Kim to come be a presenter at what's up Thursday. Kim is the company's head of data visualization. She says it's essential to get at the why that makes for sustainable, meaningful experiences.",
      "gist": "How to recruit a data visualization person at Capital One",
      "headline": "Capital One is hiring a new head of data visualization",
      "start": 1563550,
      "end": 2101048,
      "id": "ep_99_ch_8"
    },
    {
      "summary": "Some people in industry say that the value of visualization is very hard to quantify. There are obvious ways of quantifying, you know, the practice when you apply it to a space. The bottom line is that you have to work for the right company.",
      "gist": "The Value of Data Visualization",
      "headline": "Some people say that the value of visualization is very hard to quantify",
      "start": 2101176,
      "end": 2457770,
      "id": "ep_99_ch_9"
    },
    {
      "summary": "Many of our listeners are aspiring data visualization professionals. Humble, compelled and daring is absolutely required in order to listen. And if all that sounds good, maybe stay tuned for Kim Rees on the next episode.",
      "gist": "How to Get Recognized as a Data Visualization Pro",
      "headline": "So many of our listeners are aspiring data visualization professionals",
      "start": 2457882,
      "end": 2862024,
      "id": "ep_99_ch_10"
    },
    {
      "summary": "Here are a few ways you can support the show and get in touch with us. We have a page on Patreon where you can contribute an amount of your choosing per episode. If you can spend a couple of minutes rating us on iTunes, that would be extremely helpful for the show. See you next time.",
      "gist": "How to support Data Stories! (",
      "headline": "Before you leave, here are a few ways you can support the show",
      "start": 2869024,
      "end": 2975264,
      "id": "ep_99_ch_11"
    }
  ],
  "disfluencies": false,
  "entity_detection": false,
  "sentiment_analysis": false,
  "sentiment_analysis_results": null,
  "entities": null,
  "speakers_expected": null,
  "summary": null,
  "custom_topics_results": null,
  "episode_num": 99,
  "episode_metadata": {
    "speakers": [
      "Kim Rees",
      "Moritz Stefaner",
      "Enrico Bertini",
      "Steph Hay"
    ],
    "WPid": "957",
    "url": "https://datastori.es/podlove/file/4031/s/feed/c/mp3/99-data-visualization-at-capital-one-with-kim-rees-and-steph-hay.mp3",
    "episode_title": "Data Visualization at Capital One with Kim Rees and Steph Hay"
  }
}