{
  "id": "ca44363a-85bd-4ffb-a20d-2e0f08aa2512",
  "language_model": "assemblyai_default",
  "acoustic_model": "assemblyai_default",
  "language_code": "en_us",
  "status": "completed",
  "audio_url": "https://datastori.es/podlove/file/2222/s/feed/c/mp3/tapestry-conference-review-with-Robert-kosara.mp3",
  "utterances": [
    {
      "end": 12714,
      "speaker": "Robert Kosara",
      "start": 200,
      "text": "The idea was to bring together people who are interested in data storytelling. So people from journalism, people from academia, designers, NGO's, people from government agencies and so on, and just have them talk to each other.",
      "id": "ep_71_ut_0"
    },
    {
      "end": 37394,
      "speaker": "Moritz Stefaner",
      "start": 14934,
      "text": "Datastories is brought to you by Qlik, who allows you to explore the hidden relationships within your data that lead to meaningful insights. Let your instincts lead the way to create personalized visualizations and dynamic dashboards with Qlik sense, which you can download for free at click de data stories. That's Qlik Datastories.",
      "id": "ep_71_ut_1"
    },
    {
      "end": 56662,
      "speaker": "Enrico Bertini",
      "start": 47774,
      "text": "Hey, guys, this is data stories special edition from Tapestry, the tapestry conference, and I'm here with Robert Kosara. Hey, Robert.",
      "id": "ep_71_ut_2"
    },
    {
      "end": 57638,
      "speaker": "Robert Kosara",
      "start": 56798,
      "text": "Hey, Enrico.",
      "id": "ep_71_ut_3"
    },
    {
      "end": 58422,
      "speaker": "Enrico Bertini",
      "start": 57726,
      "text": "How's it going?",
      "id": "ep_71_ut_4"
    },
    {
      "end": 59926,
      "speaker": "Robert Kosara",
      "start": 58518,
      "text": "I'm doing very well, thank you.",
      "id": "ep_71_ut_5"
    },
    {
      "end": 74594,
      "speaker": "Enrico Bertini",
      "start": 60030,
      "text": "So we are in a beautiful location. Yes, somewhere near Denver. It's called Hestes park. And we are in a historic hotel with lots of interesting artifacts.",
      "id": "ep_71_ut_6"
    },
    {
      "end": 101148,
      "speaker": "Robert Kosara",
      "start": 75814,
      "text": "Yeah, this is the Stanley Hotel. That was the inspiration for the book by Stephen King. That's the book the shining. And they do a lot of things here about how it's haunted and do the ghost tour and stuff like that, which is a bit much. But it's a very beautiful hotel, clearly a very historical place and very nice, beautiful mountains around it. Beautiful outside and amazing place here.",
      "id": "ep_71_ut_7"
    },
    {
      "end": 105572,
      "speaker": "Enrico Bertini",
      "start": 101236,
      "text": "So you guys always find very nice locations for Tapestry?",
      "id": "ep_71_ut_8"
    },
    {
      "end": 106704,
      "speaker": "Robert Kosara",
      "start": 105708,
      "text": "Yeah, we try.",
      "id": "ep_71_ut_9"
    },
    {
      "end": 131468,
      "speaker": "Enrico Bertini",
      "start": 107364,
      "text": "That's why I really wanted to come back. It's like an amazing event. And of course, it's not just the location. Amazing talks, people with very different kind of backgrounds. So, Robert, why don't you introduce tapestry for those listeners who don't know what tapestry is? Sure. You've been organizing it for a number of years already. So what is tapestry?",
      "id": "ep_71_ut_10"
    },
    {
      "end": 222866,
      "speaker": "Robert Kosara",
      "start": 131636,
      "text": "Right. So Tapestry is a conference about data storytelling. And this was the fourth year now, we did the first one four years ago in Nashville in a beautiful hotel there. That was the former Union station in Nashville. And the idea was to, to bring together people who are interested in data storytelling. So people from journalism, people from academia, designers, NGO's, people from government agencies and so on, and just have them talk to each other and also bring them together between the different fields, because a lot of people in different academic areas don't talk to even other academics, and they don't talk to the practitioners. And so we wanted to build that bridge, and that's worked out really well. And so there are three people organizing it. It's Ellie Fields and Ben Jones and me. And we're always looking for an interesting mix. So we usually look for an academic. So we have this format which is three keynotes. And we always look for one keynote being a journalist, one keynote being academic, and then the third one is kind of unusual. And so we always look for somebody who's kind of unexpected. And so we had people like Scott McCloud for the first one, and this year, Nick. So Sanis, it's a bit of a comic theme that we've had in the past, and this year, which I think worked out really well, and also. And a few other people who were just kind of not from the core area of editorialism or kind of the visualization area.",
      "id": "ep_71_ut_11"
    },
    {
      "end": 256154,
      "speaker": "Enrico Bertini",
      "start": 223050,
      "text": "Yeah. Yeah. I have to say that's what I really like of this conference. I came to the first one four years ago. Right. And I wanted to come back this year. I really wanted to treat myself. And, yeah, I think the format is working extremely well, especially because, as you said, there are people with very kind of diverse backgrounds. And I love it because it's very inspiring and, in a way, mind bending. Right. I love it. So let's talk about this edition of Tapestry. So what happened?",
      "id": "ep_71_ut_12"
    },
    {
      "end": 293476,
      "speaker": "Robert Kosara",
      "start": 256774,
      "text": "So, as before, the format was very similar to the previous years. We changed a few small things that we had more of the short story. So we have the keynotes, which are those hour long talks or like 45 minutes talks plus discussion. But then we had more short stories this year than in the past. We had six this year. We had four or five in the previous years. And then we also do these receptions. We have a reception the night before, which is a very good way of just breaking the ice and getting people to get to know each other a bit. And then on the day of the conference, they've already talked to each other. And then there's a lot more communication going on, which I think is really the key thing that's happening.",
      "id": "ep_71_ut_13"
    },
    {
      "end": 297176,
      "speaker": "Enrico Bertini",
      "start": 293540,
      "text": "Yeah. So shall we talk about the keynotes first?",
      "id": "ep_71_ut_14"
    },
    {
      "end": 369668,
      "speaker": "Robert Kosara",
      "start": 297280,
      "text": "Sure. Okay. So we had these three keynotes. There was our journalism keynote this year was Scott Klein of ProPublica. And so he's leading. He's the assistant managing editor. I think I may have gotten this title a little bit wrong, but he's a really interesting guy because he's building all these really interesting news apps at ProPublica with his team there. But he's also a history nerd, and he's really interested in the history of visual journalism, and in particular, data visual data journalism. And he gave this amazing talk about the history of how people were already doing data journalism before even the 19th century. Very early on, journalism was numbers. There were the shipping news and things like that. And, of course, election results and things like that. It was really fascinating to see all that. And he had some really good examples also from people like William Playfair, which is this kind of classic, who invented many of the bar charts and line charts that we use today. And he had this great quote where basically he said that tables, which are, of course, how they're used to show data, are quickly forgotten, but the showing a graphic means that you actually remember what you saw.",
      "id": "ep_71_ut_15"
    },
    {
      "end": 370196,
      "speaker": "Enrico Bertini",
      "start": 369756,
      "text": "Yeah.",
      "id": "ep_71_ut_16"
    },
    {
      "end": 410154,
      "speaker": "Robert Kosara",
      "start": 370300,
      "text": "Which is a really interesting way of showing it, of talking about it, because that's really what you want to do many times in journalism. And he also talked about how they used to have these descriptions of how to read the charts today. For the most part, those are graphical annotations, or they just assume that, you know, how to read, like, a line chart. But in 1849, or whatever this was, you couldn't assume that. And so they actually explained very precisely how one inch of vertical distance means this, and then one inch of this distance means this much time, and how the slope change means that. And so it was actually a pretty precise description of how to read a line chart in that particular case. Yeah, it was really fascinating to see that.",
      "id": "ep_71_ut_17"
    },
    {
      "end": 422412,
      "speaker": "Enrico Bertini",
      "start": 411134,
      "text": "Yeah. And I think he mentioned also that at the beginning, these charts were not very well received, or they received a lot of criticism because they were not sufficiently, quote unquote, scientific.",
      "id": "ep_71_ut_18"
    },
    {
      "end": 441284,
      "speaker": "Robert Kosara",
      "start": 422548,
      "text": "Right. Yeah. William Playfair got a lot of pushback from. So Playfair was this kind of singular existence there. He did all his work, but the people around him thought it was just nonsense. It was not really useful. But he was only rediscovered later on. I think that was really interesting.",
      "id": "ep_71_ut_19"
    },
    {
      "end": 469718,
      "speaker": "Enrico Bertini",
      "start": 441364,
      "text": "Yeah. This is what I like. One of the things that Scott said is that it is possible, in principle, that the same way William Playfairs was heavily criticized back then, and then now it's standard practice to use all the charts that he invented. It is possible that today there are people that are highly criticized, and they are developing new ways of communicating information that will be accepted in the future. So I found this very inspiring.",
      "id": "ep_71_ut_20"
    },
    {
      "end": 477092,
      "speaker": "Robert Kosara",
      "start": 469806,
      "text": "Yeah. It's an argument, of course, for pushing the envelope and really trying new things, especially in data journalism. I think that's really. That's really important.",
      "id": "ep_71_ut_21"
    },
    {
      "end": 494748,
      "speaker": "Enrico Bertini",
      "start": 477188,
      "text": "Yeah. And I think another thing I liked is that it was kind of like saying, we didn't invent data journalism. It's been there forever. Nate Silver didn't invent it. I didn't invent it. It's been there forever. That was a good message.",
      "id": "ep_71_ut_22"
    },
    {
      "end": 502828,
      "speaker": "Robert Kosara",
      "start": 494836,
      "text": "Yeah. Somebody apparently said that Nate Silver had invented it. I forget where the quote was coming from, but, yeah, that was. That was silly because, of course, it's been around for much longer than that.",
      "id": "ep_71_ut_23"
    },
    {
      "end": 506074,
      "speaker": "Enrico Bertini",
      "start": 502876,
      "text": "Yeah. So. Next one.",
      "id": "ep_71_ut_24"
    },
    {
      "end": 598464,
      "speaker": "Robert Kosara",
      "start": 506154,
      "text": "Right, next one. The second keynote was Jessica Hullman, who's a professor at University of Washington. And she gave two different talks. She talked about her work on making data relatable. So she finds ways of measuring things in terms of real objects. Like, she has this example of a given weight is this many microphones, for example, because she found that a certain handheld microphone has this weight. And so you can kind of relate to that if you've. If she ever held a microphone or other things like that, and also distances. And she also tries to make that personal. So if it knows that you live in New York or you live in Seattle, it's going to pick out different landmarks and different distances depending on where you are. So it can actually be stuff that you can relate to, because if you express these things in terms of distances in New York, that doesn't mean anything to me. It's going to mean something to you, but it's totally useless to me. The other part was about her work on story sequence. So how do you put facts and graphical representations into a sequence to make a story? And that was, she's done some really interesting work, and there's some ongoing work that I'm doing with her that she also touched on a little bit that I think is really interesting, and that hopefully will lead us to learn more about how sequence works and how we can perhaps even find ways to structure stories or to structure visualizations automatically into stories. But that's still a long way off, but at least that's kind of a goal.",
      "id": "ep_71_ut_25"
    },
    {
      "end": 674890,
      "speaker": "Enrico Bertini",
      "start": 598884,
      "text": "Yeah, I have to say, I find her work really fascinating at the intersection of cognitive psychology and computer science. And she's kind of like, in some cases, trying to, I don't know, make some cognitive. Kind of like studying humans in a way that you can then learn something and transfer and create a computational model that, in a way, captures some cognitive processes. Right. And I found this intersection extremely fascinating. And I also think that I'm really glad that you guys are working on narrative structure, because I think this is totally neglected. And so, for instance, I would love to teach in my course guidelines on how to put a certain number of charts together, but there's no guideline. Right. So, I mean, you have five charts, and you want to arrange them in one page to tell a story. How do you do that? So is there a right way of doing that? Are there mistakes that you should try to avoid. I'm pretty sure there are, but I don't know of any material out there that is some good guidance for that.",
      "id": "ep_71_ut_26"
    },
    {
      "end": 718536,
      "speaker": "Robert Kosara",
      "start": 674922,
      "text": "Well, there is this one paper that Jessica wrote a few years ago that talks about this a little bit, and it doesn't give you one right way, but it gives you an idea of what she calls transition cost. And that is actually a good way of thinking about that. And looking at what are the transitions that you look at that you have in a particular sequence, and then which ones are lower or higher cost, that at least gives you a guideline. There is. I don't think there is or will ever be one single perfect answer, but there certainly can be useful guidelines and that can be helpful. We could recommend saying, here are five ideas for sequences that, given the model, they look like good ideas. And then you would pick from those.",
      "id": "ep_71_ut_27"
    },
    {
      "end": 723992,
      "speaker": "Enrico Bertini",
      "start": 718600,
      "text": "Yeah. Yeah. Great. Let's talk about the third and last keynote.",
      "id": "ep_71_ut_28"
    },
    {
      "end": 810116,
      "speaker": "Robert Kosara",
      "start": 724048,
      "text": "The final one. Yes. That was really good. So Nik, Sonny's. I mean, they were all good. Nick did a great. So, Nick, Susan, it's kind of hard to describe what he actually is. So he's a postdoc now in University of Calgary, and he got his PhD last year. I think even just, it seems like so long ago, but at Columbia with a comic, and he turned this into a book that you can buy, which everybody should buy because it's really good. It's called unflattening. And it's a comic. It's an extremely well done comic that basically argues that we need to break out of our way of thinking and we need to explore more things, more ideas and broader ideas. And he gave this amazing, really inspiring talk, which was actually kind of short because he wanted to then do a drawing exercise. And I was unsure whether that would work, but it was really amazingly effective. So he asked people to draw a comic. So he talked a bit about the structure of a page, and then he said, well, now, draw a day. Pick a day, either like yesterday or some particular day you want to talk about, and then draw an abstract comic. So just draw shapes, don't draw things. And everybody got really quiet. Everybody was drawing. It was really amazing. And everyone was afraid. Yeah, but a lot less than I thought people would be like, everybody was drawing. It's not like people were saying, no, I can't draw. But they actually did.",
      "id": "ep_71_ut_29"
    },
    {
      "end": 823092,
      "speaker": "Enrico Bertini",
      "start": 810220,
      "text": "But I have to say, I actually did the exercise. And before starting, I was like, oh, no, my God, I'm terrible at drawing. Don't make me do that. But I mean, I loved it.",
      "id": "ep_71_ut_30"
    },
    {
      "end": 874530,
      "speaker": "Robert Kosara",
      "start": 823188,
      "text": "I absolutely loved it. And then he asked people to share that, and that's kind of scary, because now you just did your thing for yourself, and then now you have to share that. And people did that. He got really into it, and he had some trouble stopping them, saying, okay, enough. We gotta wrap up here. And that is what everybody, I think everybody really enjoyed that. I would have been a bit scared of doing that, because you never know if people are going to think you're forcing them to do something that they don't want to do. But everybody seemed to enjoy that. It was really great. So I think that was a great talk. And he has a lot of good ideas about how to think graphically or how to think with comics and how there's a dialogue between you and the page as you're drawing. And that makes a lot of sense to me, certainly, even though I I can't draw at all. But I think that that whole idea of thinking in images is just a really good one.",
      "id": "ep_71_ut_31"
    },
    {
      "end": 918914,
      "speaker": "Enrico Bertini",
      "start": 874682,
      "text": "Yeah. There are a couple of things that I really, really loved from his talk. I think there was one section where he was talking about the fact that with comics, you can have both at the same time. You can have sequence. Right. But also a part of the image that conveys a whole. Right. So this whole idea of being able. And it was kind of like thinking about also how the brain works, that we can be very analytical, but at the same time also holistic. Right. And that comics have a way, it's a art form that allows you to do both things at the same time. And this is something that I really, really love. They gave a couple of examples that were really, really, really good.",
      "id": "ep_71_ut_32"
    },
    {
      "end": 969304,
      "speaker": "Robert Kosara",
      "start": 921834,
      "text": "I wasn't sure if you wanted to talk about this more, but, yeah, he had some examples of how page layout works. So if people weren't all familiar with comics, there are some amazing examples of how there's kind of an over. If you look at the page at first, there's kind of an overall image you see, but then you look at the frames or whatever the parts are, and they can be scattered around. And it's not like they don't necessarily have to be in this grid layout, but it can be in very different ways. And then you can break out of the frames, and you can do things that go across the frames to make a larger image where the whole. Even though there are frames, taking the frames, like, kind of looking through them, there's a bigger picture. And so there are these levels of reading that can be really amazing. So there's a lot of richness in these comics that are just. That can be incredibly fascinating.",
      "id": "ep_71_ut_33"
    },
    {
      "end": 1037262,
      "speaker": "Enrico Bertini",
      "start": 969384,
      "text": "Yeah. And the second thing I wanted to mention that I really liked, I think he said something along the lines of. So actually he presented many of his own drawings and sketches that he does, he makes to create ideas for comics. Right. And he was kind of like talking about the fact that when you draw something, when you sketch ideas, you come up with new ideas just because now you can see it in front of you. And I think he said something that I found really interesting. Something along the lines of, I'm trying to recall the exact sentence, but it's something like when you draw an idea, a sketch of an idea, it's not a representation of the idea, it's the idea. And I found this really, really interesting. And he was giving examples of how, by drawing things, now he has a new idea. I don't know, it totally relates to some of my own experiences. Yeah, I found it fascinating.",
      "id": "ep_71_ut_34"
    },
    {
      "end": 1053262,
      "speaker": "Robert Kosara",
      "start": 1037358,
      "text": "Yeah, absolutely. He had to think about how his comics are smarter than he is, because in the process, he works through things and he gets new ideas and just kind of did the act of drawing and seeing what he's drawn just pushes him to have another idea and then kind of move further.",
      "id": "ep_71_ut_35"
    },
    {
      "end": 1053654,
      "speaker": "Enrico Bertini",
      "start": 1053358,
      "text": "Yeah.",
      "id": "ep_71_ut_36"
    },
    {
      "end": 1055622,
      "speaker": "Robert Kosara",
      "start": 1053694,
      "text": "And I think that that's a really interesting, interesting thought.",
      "id": "ep_71_ut_37"
    },
    {
      "end": 1061484,
      "speaker": "Enrico Bertini",
      "start": 1055678,
      "text": "Yeah. Yeah. I personally really, really enjoyed it. And that was. Yeah, it blew my mind.",
      "id": "ep_71_ut_38"
    },
    {
      "end": 1115038,
      "speaker": "D",
      "start": 1062784,
      "text": "Data stories is brought to you by Qlik, who allows you to explore the hidden relationships within your data that lead to meaningful insights. Let your instincts lead the way to create personalized visualizations and dynamic dashboards with Qlik sense, which you can download for free at www. Dot clic dot Datastories. So for all quantified self out there, a senior member of Qlik's demo team, Michael Anthony, has published a very nice report called 2015 my Life in Data, where it tracks live events in a beautiful dashboard made with Qlik, including miles run, coffees consumed, commuting, mileage, food, eden, and much, much more. It's really fascinating. You can find the report by following the link in our blog post. And I strongly suggest you to take a look to see what kind of visualization you can build with Qlik.",
      "id": "ep_71_ut_39"
    },
    {
      "end": 1116446,
      "speaker": "Enrico Bertini",
      "start": 1115166,
      "text": "And of course, if you are a.",
      "id": "ep_71_ut_40"
    },
    {
      "end": 1125510,
      "speaker": "D",
      "start": 1116470,
      "text": "Quantified self yourself, you may want to build similar dashboards with click. So I strongly suggest you to take a look. And now back to the show.",
      "id": "ep_71_ut_41"
    },
    {
      "end": 1129286,
      "speaker": "Enrico Bertini",
      "start": 1125702,
      "text": "Okay, shall we talk a little bit about the short talks as well?",
      "id": "ep_71_ut_42"
    },
    {
      "end": 1332256,
      "speaker": "Robert Kosara",
      "start": 1129390,
      "text": "So there are also, there are six. There were six short talks this year. Short stories as we call them. And I don't know, I think we want to talk about all of them because it's kind of a long list. I mean, we just pick out a few, you know, they were all really good. And I'm really happy with how the program came together. It's always kind of scary when you're like, okay, does this actually fit? Does this all make sense? But in the end, it really gelled. I'm really happy with how it worked out. So I'm just going to pick one. Yeah, sure. So one I really liked was Catherine Madden, who does sketchnoting. So she did that last year. She drew sketches of the talks as an attendee. And so we invited her this year to talk about what she does. And she also did it again this year. She did this amazing sketchnotes of the talks, and they're just beautiful, and they're a really interesting summary of what people talk about, about in this graphical form that I just find really, really fascinating. And she had some really interesting things to say about how you can use drawing as the verb. She focuses on the process to map your mind and add depth to your thinking. And I think that really resonated with a lot of people. It was a very interesting combination with what Sidney has talked about, because he also talked about how the drawing makes you think differently. And then another one. So, again, just looking through my notes here, Alan Smith of the Financial Times did a really good talk on what he calls the competent critic. So this was a very different topic. But what he was talking about is how he wants his colleagues in the Financial Times newsroom to look at graphics and to look at reports and then ask questions and say, well, so how can we make this better? And so he had this example of a UNESCO report, I think, that showed some data in very straightforward kind of graphs, bar charts and stuff like that. Then he started reworking them, and it was really fascinating because he had some really good questions to ask. There was one on gender equality or gender differences in access to education in different countries. And then he said, well, here's the raw data, which is what this part shows us. Now, what do we actually want to know? And so there was the difference from 50% or from the, from zero, because it was about whether girls or boys were more disadvantaged. And then he added a few more things, like there was a certain range of values. That's the goal for UNESCO, which are the ones that are inside or outside, and just really showing what the differences really mean as differences. In the end, it was a very straightforward transformation, but it turned a very boring and difficult to understand bar chart into something that clearly tells you something where you can easily point to the things that are really the ones that stand out, that are important. And I thought that whole approach is just a really good one. And I think just criticism in general. I mean, critical thinking is just a very useful and important concept, and I don't know, that's maybe. And then you give a talk and you had a really good introduction where you said that people might recognize your voice even though they haven't seen you. And so it will be kind of spooky because suddenly there is an actual person connected to that voice. And you talked about this interesting tool that you built on exploring reviews on Yelp, and then you have actual journalists working with that.",
      "id": "ep_71_ut_43"
    },
    {
      "end": 1353354,
      "speaker": "Enrico Bertini",
      "start": 1332360,
      "text": "Yeah, I think for me it's a personal big success story, knowing that there is at least one journalist out there that published a real article presenting data that he discovered through our tool. I think I find this thing extremely important.",
      "id": "ep_71_ut_44"
    },
    {
      "end": 1361454,
      "speaker": "Robert Kosara",
      "start": 1353474,
      "text": "Oh, yeah. No, it's really important for academic work to actually have a real world impact and connection. So this is really cool. I really like that.",
      "id": "ep_71_ut_45"
    },
    {
      "end": 1384084,
      "speaker": "Enrico Bertini",
      "start": 1362234,
      "text": "Yeah, I think that was, in the end, the main message of my talk. I mean, the real core thing. I was trying to use this example to say, hey, we need to work on real problems and we need to talk and work with these people. Right. If you just don't reach out and try to find a way to work with journalists or other type of domain experts.",
      "id": "ep_71_ut_46"
    },
    {
      "end": 1385480,
      "speaker": "Robert Kosara",
      "start": 1385104,
      "text": "Yeah.",
      "id": "ep_71_ut_47"
    },
    {
      "end": 1386680,
      "speaker": "Enrico Bertini",
      "start": 1385512,
      "text": "You will never succeed.",
      "id": "ep_71_ut_48"
    },
    {
      "end": 1404768,
      "speaker": "Robert Kosara",
      "start": 1386832,
      "text": "Yeah, no, I agree. And you perfectly embodied the idea. We're trying to make those connections, and I hope a lot more people who were in the audience will reach out to you. And I don't know how many people talk to you, but they would actually then also try using your review explorer and other tools that you're building.",
      "id": "ep_71_ut_49"
    },
    {
      "end": 1416390,
      "speaker": "Enrico Bertini",
      "start": 1404856,
      "text": "Yeah, I have to say, pretty spooky to have people coming to you and say, oh, I know your voice, but this happens to me and Moritz all the time. It's crazy.",
      "id": "ep_71_ut_50"
    },
    {
      "end": 1417594,
      "speaker": "Robert Kosara",
      "start": 1416422,
      "text": "Oh, yeah, I'm sure. Yeah.",
      "id": "ep_71_ut_51"
    },
    {
      "end": 1420150,
      "speaker": "Enrico Bertini",
      "start": 1418534,
      "text": "Okay. Anything else?",
      "id": "ep_71_ut_52"
    },
    {
      "end": 1492112,
      "speaker": "Robert Kosara",
      "start": 1420302,
      "text": "I'll just pick one more because that's another one. So again, it's difficult to pick them. But Eva Galatnis Rosenbaum had an interesting talk about how she calls this the plural of anecdote is not data, which is a common thing people say. But then she said, yeah, that's true, but what if you have data that you're not sure about, that you don't trust entirely, or that you don't know about? And so she had some really interesting ideas about using proxies or using other things, using anecdotes even, to corroborate your data and to see if you believe what the data tells you, especially when you look at things like polling results, where the polls can be all over the place, depending on who does them and what the population is that this happening from, and so on. And so to try and figure out which of those results are more reliable or which ones you believe more, or even forecasting a little bit into the future can be a way to just add a little bit of richness to the data. And so I thought that was a very good point, because the data is obviously what we want to focus on, but there are other things that can help us add to that. Yeah. So, yeah, it was a very good set of talks, if I may say so myself. I'm obviously involved in picking them. But, yeah, I think that it worked out pretty well.",
      "id": "ep_71_ut_53"
    },
    {
      "end": 1502494,
      "speaker": "Enrico Bertini",
      "start": 1492168,
      "text": "No, I totally agree. I mean, as I said at the beginning, that's a great, great event. And actually, thank you for organizing it. I'm sure it's quite a lot of work behind the curtains.",
      "id": "ep_71_ut_54"
    },
    {
      "end": 1503438,
      "speaker": "Robert Kosara",
      "start": 1502534,
      "text": "Oh, yeah, it is.",
      "id": "ep_71_ut_55"
    },
    {
      "end": 1525518,
      "speaker": "Enrico Bertini",
      "start": 1503566,
      "text": "But it's really, really valuable. And if you're listening to this and you want to get exposed to more people and more ideas about visualization, data visualization, storytelling, or anything related to that, I highly, highly recommend to come to tapestry. So maybe you can briefly describe how people can participate.",
      "id": "ep_71_ut_56"
    },
    {
      "end": 1633000,
      "speaker": "Robert Kosara",
      "start": 1525686,
      "text": "Yes. So we have a website, tapestry conference. It's one word, tapestryconference.com. and the way it works is that we ask you to submit an application. So we pick our attendees. It's called invite only, which means that you apply, and we then send you an invite. But what we were trying to do is we're trying to balance the people from different areas, so we want to have a reasonable representation from journalism, from academia, from nonprofits. And so we're trying to just not be. So Tableau software is organized in the conference, but we're trying to not be another little Tableau conference, but really be a very different place. And so we're trying to really focus on the people who are really doing storytelling or who are really interested in storytelling. So the website right now is still talking about this year's conference. It's kind of short date. The next one will be, hopefully, the website will be up in a few months, in June or July is usually the timeframe. And we'll tell people there's a web, there's also a Twitter account that you can follow Taperstreet Conf I think is what it's called, but it's linked from the website and we'll announce things there. And also, I'm certainly going to make announcements on Twitter and probably on my blog as well, so that people know about it. And then we tend to announce the keynotes first and then over time add the short stories. We also ask people now to apply for short stories. So if when you apply to attend, you can also say, I want to present, and then give us a short proposal for a short story. And then we pick from those. And that actually worked out really well this year. So we did this the first time this year, and we picked, I think, most of our short stories this year from the proposals. We picked only two separately, so that worked out really well.",
      "id": "ep_71_ut_57"
    },
    {
      "end": 1636976,
      "speaker": "Enrico Bertini",
      "start": 1633152,
      "text": "Okay. And you can also propose demos.",
      "id": "ep_71_ut_58"
    },
    {
      "end": 1670906,
      "speaker": "Robert Kosara",
      "start": 1637120,
      "text": "Yes. Oh, yeah, we forgot about the demo show. So in the afternoon we have a session of demos, and so people talk about different things and showing different things, and we also have posters. We only had a small number this year, and I'm going to try and make this a bit more formal and a bit more academic so we can maybe get more students to show their work. But so far the posts have been a bit neglected. But they're an important part of it, though, because they also spark conversations and show people's work, which I think is really what we're trying to do.",
      "id": "ep_71_ut_59"
    },
    {
      "end": 1674946,
      "speaker": "Enrico Bertini",
      "start": 1671050,
      "text": "So are the talks from this year recorded?",
      "id": "ep_71_ut_60"
    },
    {
      "end": 1711044,
      "speaker": "Robert Kosara",
      "start": 1675010,
      "text": "Yes. So all the talks are recorded also from the previous years. We redesigned our website recently, meaning a few months ago, but we lost the archive page. We're going to have to recreate that. But we have a YouTube channel where they are and we're going to put the archive page back. And I would say in about a month, probably sometime in April, we'll have the videos up for this year. And so all the talks will be up there and you can watch them. This was a live stream and we had a good number. I don't know the exact number, but we had several times the number of people in the room actually on the live stream. So that was pretty nice as well.",
      "id": "ep_71_ut_61"
    },
    {
      "end": 1723172,
      "speaker": "Enrico Bertini",
      "start": 1711204,
      "text": "That's great. Well, thanks a lot, Robert, for coming on the show again and to talk about this lovely event. I hope I'll be able to participate again in future years. Yeah, thanks a lot.",
      "id": "ep_71_ut_62"
    },
    {
      "end": 1723772,
      "speaker": "Robert Kosara",
      "start": 1723268,
      "text": "Thank you.",
      "id": "ep_71_ut_63"
    },
    {
      "end": 1724624,
      "speaker": "Enrico Bertini",
      "start": 1723828,
      "text": "Bye bye.",
      "id": "ep_71_ut_64"
    },
    {
      "end": 1808934,
      "speaker": "D",
      "start": 1727404,
      "text": "Hey, guys, thanks for listening to data stories again. Before you leave, we have a request if you can spend a couple of minutes rating us on iTunes. That would be extremely helpful for the show. I also want to give you some information on the many ways you can get news directly from us. We are, of course, on twitter@twitter.com. Datastories. We have a Facebook page@Facebook.com, datastoriespodcast and we now also have a newsletter. So if you want to get news directly into your inbox, go to our homepage datastory em and look for the link that you find on the right. One last thing I want to tell you is that we love to get in touch with our listeners, especially if you want to suggest way to improve the show. Amazing people you want us to invite or projects you want us to talk about. So do get in touch with us. That's all for now. See you next time. Thanks for listening to data stories data stories is brought to you by clicking click who allows you to explore the hidden relationships within your data that lead to meaningful insights. Let your instincts lead the way to create personalized visualizations and dynamic dashboards with Qlik sense, which you can download for free at www. Dot clic dot de Datastories.",
      "id": "ep_71_ut_65"
    }
  ],
  "confidence": 0.928584895013119,
  "audio_duration": 1809,
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_status_code": null,
  "webhook_auth": false,
  "webhook_auth_header_name": null,
  "speed_boost": false,
  "auto_highlights_result": null,
  "auto_highlights": false,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_audio_quality": null,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "content_safety": false,
  "iab_categories": true,
  "content_safety_labels": {
    "status": "unavailable",
    "results": [],
    "summary": {}
  },
  "language_detection": false,
  "language_detection_threshold": null,
  "language_confidence": null,
  "custom_spelling": null,
  "throttled": false,
  "auto_chapters": true,
  "summarization": false,
  "summary_type": null,
  "summary_model": null,
  "custom_topics": false,
  "topics": [],
  "speech_threshold": null,
  "speech_model": "best",
  "chapters": [
    {
      "summary": " Datastories is brought to you by Qlik, who allows you to explore the hidden relationships within your data that lead to meaningful insights. Let your instincts lead the way to create personalized visualizations and dynamic dashboards with Qlik sense.",
      "gist": "Qlik Data Stories: Stories in the Data",
      "headline": "The idea was to bring together people who are interested in data storytelling",
      "start": 200,
      "end": 37394,
      "id": "ep_71_ch_0"
    },
    {
      "summary": "This is data stories special edition from Tapestry, the tapestry conference. We are in a historic hotel with lots of interesting artifacts. The Stanley Hotel was the inspiration for the book by Stephen King. It's like an amazing event.",
      "gist": "TIP",
      "headline": "This is data stories special edition from Tapestry conference in Denver",
      "start": 47774,
      "end": 117704,
      "id": "ep_71_ch_1"
    },
    {
      "summary": "Tapestry is a conference about data storytelling. The first one was four years ago in Nashville. The format is working extremely well. There are people with very kind of diverse backgrounds. I love it because it's very inspiring and, in a way, mind bending.",
      "gist": "Tapping Through the Data: Data Storytelling Conference",
      "headline": "Tapestry is a conference about data storytelling",
      "start": 119044,
      "end": 251350,
      "id": "ep_71_ch_2"
    },
    {
      "summary": "The format was very similar to the previous years. We had more short stories this year than in the past. And then we also do these receptions the night before. There's a lot more communication going on, which I think is really the key thing that's happening.",
      "gist": "Tapestry 2018: The Conference",
      "headline": "Tapestry this year had more short stories than previous years",
      "start": 251462,
      "end": 297176,
      "id": "ep_71_ch_3"
    },
    {
      "summary": "Our journalism keynote this year was Scott Klein of ProPublica. He talked about the history of how people were already doing data journalism before the 19th century. It's an argument, of course, for pushing the envelope and really trying new things, especially in data journalism.",
      "gist": "Data Journalism: The History of Graphics",
      "headline": "Scott Klein of ProPublica gave a great talk on data journalism",
      "start": 297280,
      "end": 503464,
      "id": "ep_71_ch_4"
    },
    {
      "summary": "Jessica Hullman talks about her work on making data relatable. She finds ways of measuring things in terms of real objects. And she also tries to make that personal. So if it knows that you live in New York, it's going to pick out different landmarks and distances depending on where you are.",
      "gist": "Top Data Scientists at the Conference",
      "headline": "Jessica Hullman talks about making data relatable with two different talks",
      "start": 504194,
      "end": 557554,
      "id": "ep_71_ch_5"
    },
    {
      "summary": "The other part was about her work on story sequence. How do you put facts and graphical representations into a sequence to make a story? I find her work really fascinating at the intersection of cognitive psychology and computer science. There certainly can be useful guidelines.",
      "gist": "Cognitive Psychology and Story Sequence",
      "headline": "The other part was about her work on story sequence. How do you put facts and graphical representations into a sequence",
      "start": 559134,
      "end": 719644,
      "id": "ep_71_ch_6"
    },
    {
      "summary": "Nick, Susan: Let's talk about the third and last keynote. He asked people to draw a comic. Everybody was drawing. The whole idea of thinking in images is just a really good one.",
      "gist": "The Future of Comic Writing",
      "headline": "Nick gave a really inspiring talk about comics and how to think about them",
      "start": 720504,
      "end": 969304,
      "id": "ep_71_ch_7"
    },
    {
      "summary": "He presented many of his own drawings and sketches that he does, he makes to create ideas for comics. And he was giving examples of how, by drawing things, now he has a new idea. I personally really, really enjoyed it.",
      "gist": "Drawing Ideas in the Dark",
      "headline": "He talked about how when you sketch ideas, you come up with new ideas",
      "start": 969384,
      "end": 1061484,
      "id": "ep_71_ch_8"
    },
    {
      "summary": "A senior member of Qlik's demo team has published a report called 2015 my Life in Data. It tracks live events in a beautiful dashboard made with Qlik. If you are a Quantified self yourself, you may want to build similar dashboards with click.",
      "gist": "Quantified Self: 2015 My Life in Data",
      "headline": "Qlik lets you explore hidden relationships within your data that lead to meaningful insights",
      "start": 1062784,
      "end": 1123510,
      "id": "ep_71_ch_9"
    },
    {
      "summary": "There were six short talks this year. One I really liked was Catherine Madden, who does sketchnoting. She focuses on the process to map your mind and add depth to your thinking. I'm really happy with how the program came together.",
      "gist": "The Short Talks",
      "headline": "There were six short talks this year. I'm really happy with how the program came together",
      "start": 1123622,
      "end": 1208334,
      "id": "ep_71_ch_10"
    },
    {
      "summary": "Moritz: It's really important for academic work to have a real world impact and connection. You talked about this interesting tool that you built on exploring reviews on Yelp, and then you have actual journalists working with that. Moritz: I hope a lot more people who were in the audience will reach out to you.",
      "gist": "The Competent Critic",
      "headline": "Alan Smith of the Financial Times talked about critical thinking at conference",
      "start": 1209714,
      "end": 1419158,
      "id": "ep_71_ch_11"
    },
    {
      "summary": "Tapestry was a great, great event. Eva Galatnis Rosenbaum had some really interesting ideas about using proxies or using other things, using anecdotes even, to corroborate your data. If you want to get exposed to more ideas about visualization, data visualization, storytelling, or anything related to that, come to tapestry.",
      "gist": "TIP2012: Data & Storytelling",
      "headline": "Eva Galatnis Rosenbaum talked about using anecdotes to corroborate data",
      "start": 1419246,
      "end": 1521734,
      "id": "ep_71_ch_12"
    },
    {
      "summary": "Robert: We have a website, tapestry conference. com. We also ask people now to apply for short stories. And you can also propose demos. All the talks are recorded also from the previous years. The next one will be in June or July.",
      "gist": "How to attend the Tapestry Conference this year",
      "headline": "So maybe you can briefly describe how people can participate in this conference",
      "start": 1521854,
      "end": 1730348,
      "id": "ep_71_ch_13"
    },
    {
      "summary": "Data stories is brought to you by clicking click who allows you to explore the hidden relationships within your data. Let your instincts lead the way to create personalized visualizations with Qlik sense. We love to get in touch with our listeners, especially if you want to suggest way to improve the show.",
      "gist": "Data Stories",
      "headline": "Before you leave, we have a request if you can spend a couple of minutes rating us on iTunes",
      "start": 1730516,
      "end": 1808934,
      "id": "ep_71_ch_14"
    }
  ],
  "disfluencies": false,
  "entity_detection": false,
  "sentiment_analysis": false,
  "sentiment_analysis_results": null,
  "entities": null,
  "speakers_expected": null,
  "summary": null,
  "custom_topics_results": null,
  "episode_num": 71,
  "episode_metadata": {
    "speakers": [
      "Robert Kosara",
      "Moritz Stefaner",
      "Enrico Bertini"
    ],
    "WPid": "587",
    "url": "https://datastori.es/podlove/file/2222/s/feed/c/mp3/tapestry-conference-review-with-robert-kosara.mp3",
    "episode_title": "Tapestry Conference Review with Robert Kosara"
  }
}