{
  "id": "ffe97303-3dd3-406a-9b6e-7323c3586705",
  "language_model": "assemblyai_default",
  "acoustic_model": "assemblyai_default",
  "language_code": "en_us",
  "status": "completed",
  "audio_url": "https://datastori.es/podlove/file/396/s/feed/c/mp3/Datastories-36.mp3",
  "utterances": [
    {
      "end": 22888,
      "speaker": "Enrico Bertini",
      "start": 22360,
      "text": "Hi, everyone.",
      "id": "ep_36_ut_0"
    },
    {
      "end": 26900,
      "speaker": "Moritz Stefaner",
      "start": 22974,
      "text": "Data stories number 36. Hi, Moritz, how are you?",
      "id": "ep_36_ut_1"
    },
    {
      "end": 35840,
      "speaker": "Jer Thorp",
      "start": 26980,
      "text": "Hey, Enrico. Yeah, I caught her back. You got a bad cold? Yeah, I'm super slow today, and. I don't know, I need to go back bad soon.",
      "id": "ep_36_ut_2"
    },
    {
      "end": 38052,
      "speaker": "Moritz Stefaner",
      "start": 36460,
      "text": "Are you gingerized?",
      "id": "ep_36_ut_3"
    },
    {
      "end": 49748,
      "speaker": "Jer Thorp",
      "start": 38236,
      "text": "I'm probably gingerized, but it doesn't yet work. I'm hoping for tomorrow. Yeah, it's in the middle of summer and I have a cold. It's sort of a.",
      "id": "ep_36_ut_4"
    },
    {
      "end": 53502,
      "speaker": "Moritz Stefaner",
      "start": 49924,
      "text": "It's the German. German effect. Germany effect. Yeah.",
      "id": "ep_36_ut_5"
    },
    {
      "end": 58646,
      "speaker": "Jer Thorp",
      "start": 53526,
      "text": "I don't know. I've even been away from the kids, so I cannot blame them. So I don't know.",
      "id": "ep_36_ut_6"
    },
    {
      "end": 59422,
      "speaker": "Moritz Stefaner",
      "start": 58718,
      "text": "Okay.",
      "id": "ep_36_ut_7"
    },
    {
      "end": 64182,
      "speaker": "Jer Thorp",
      "start": 59566,
      "text": "It's been pretty cold, and I've been, like, traveling a bit, so who knows?",
      "id": "ep_36_ut_8"
    },
    {
      "end": 73766,
      "speaker": "Moritz Stefaner",
      "start": 64286,
      "text": "So here in New York is not too bad, actually. It's a little windy, but we have had quite a few nice days finally. It's so much better.",
      "id": "ep_36_ut_9"
    },
    {
      "end": 76210,
      "speaker": "Jer Thorp",
      "start": 73798,
      "text": "Are you preparing for the three weeks of summer?",
      "id": "ep_36_ut_10"
    },
    {
      "end": 81170,
      "speaker": "Moritz Stefaner",
      "start": 77110,
      "text": "Yeah. Come on.",
      "id": "ep_36_ut_11"
    },
    {
      "end": 84330,
      "speaker": "Jer Thorp",
      "start": 82190,
      "text": "What's up for you, Enrico? What are you doing?",
      "id": "ep_36_ut_12"
    },
    {
      "end": 94686,
      "speaker": "Moritz Stefaner",
      "start": 84790,
      "text": "I'm okay. The semester just ended a few days ago. I had a fantastic set of projects from my students. Hopefully I'm gonna show something on the web.",
      "id": "ep_36_ut_13"
    },
    {
      "end": 96486,
      "speaker": "Jer Thorp",
      "start": 94758,
      "text": "You should do some gallery.",
      "id": "ep_36_ut_14"
    },
    {
      "end": 109718,
      "speaker": "Moritz Stefaner",
      "start": 96678,
      "text": "Yeah, yeah, yeah, yeah. I'm a little. I'm very impressed, actually, compared. Especially compared to last year. I think I made a few changes that had a big impact. And one of these changes is I forced everyone to use D3.",
      "id": "ep_36_ut_15"
    },
    {
      "end": 110302,
      "speaker": "Jer Thorp",
      "start": 109814,
      "text": "Okay.",
      "id": "ep_36_ut_16"
    },
    {
      "end": 123150,
      "speaker": "Moritz Stefaner",
      "start": 110366,
      "text": "And I actually. To say that the result is amazing. So I don't know how much it depends on D3 itself, or maybe that just. I got lucky this year, and I got a lot of good students, but the difference is outstanding.",
      "id": "ep_36_ut_17"
    },
    {
      "end": 124790,
      "speaker": "Jer Thorp",
      "start": 123570,
      "text": "That's good to hear.",
      "id": "ep_36_ut_18"
    },
    {
      "end": 127346,
      "speaker": "Moritz Stefaner",
      "start": 125370,
      "text": "Yeah. What are you up to?",
      "id": "ep_36_ut_19"
    },
    {
      "end": 151270,
      "speaker": "Jer Thorp",
      "start": 127538,
      "text": "Yeah, I mean, we had a lot of work now with the May updates for the OECD side, so that's like three or four different sold out. Yeah, we're still in the process of rolling that out. And now it's more teaching, traveling, speaking, doing fun projects. I plan, but I can't, like, talk about running projects. Bit of in between.",
      "id": "ep_36_ut_20"
    },
    {
      "end": 218998,
      "speaker": "Moritz Stefaner",
      "start": 154530,
      "text": "So before we start with our special, special guest, very special, I just want to. A little bit of suspense. I just want to give a brief announcement about. So you guys should know at this point that there is the. This conference in Paris this year, that's this IEEE vis 2014 for the first time in Europe. And I've been asked to advertise the art program. I guess some of our listeners might be very much interested in that. That's gonna be. I don't think there is one specific day, but you can submit your art to this. I will send. We will post the URL in the. In our usual blog post. I think it's really interesting because it's an interesting attempt to have some art in the context of this mainly academic conference, and I think it's a nice initiative. So if you are curious about it, just make sure to click on the link and see what's about. Okay. Should we start?",
      "id": "ep_36_ut_21"
    },
    {
      "end": 220130,
      "speaker": "Jer Thorp",
      "start": 219134,
      "text": "Absolutely.",
      "id": "ep_36_ut_22"
    },
    {
      "end": 226340,
      "speaker": "Moritz Stefaner",
      "start": 220870,
      "text": "Okay. So our special guest today is Jared tortured. Hi, chair. How are you?",
      "id": "ep_36_ut_23"
    },
    {
      "end": 228568,
      "speaker": "Enrico Bertini",
      "start": 226880,
      "text": "Hey. I'm great, thank you.",
      "id": "ep_36_ut_24"
    },
    {
      "end": 242744,
      "speaker": "Moritz Stefaner",
      "start": 228664,
      "text": "Finally, we have a real guest that is able to talk about art. So I think we were speculating on the fact that we never had a guest who talked exclusively about art. So we are so happy to have you on the show.",
      "id": "ep_36_ut_25"
    },
    {
      "end": 248912,
      "speaker": "Jer Thorp",
      "start": 242792,
      "text": "Although Ben Shneiderman spent, like, half of his podcast talking about his tree map art. I think that was a good starting point.",
      "id": "ep_36_ut_26"
    },
    {
      "end": 270280,
      "speaker": "Moritz Stefaner",
      "start": 248976,
      "text": "Yeah. This doesn't mean that we didn't talk about art so far, but we did have a special guest who was on exclusively about art. Right. Or with such a strong bend towards art, which is really good. So, Jeremy, as usual, we ask our guests to introduce themselves. So do you want to spend a few words about who you are, what you do?",
      "id": "ep_36_ut_27"
    },
    {
      "end": 302710,
      "speaker": "Enrico Bertini",
      "start": 270860,
      "text": "Yeah, sure. So, I'm Jared Thorpe. I'm a co founder of a studio in New York City called the Office for Creative Research. I'm an adjunct professor at itpennae, which is a master's program at NYU in New York City. And I'm a data artist. I guess. I mean, I probably would turn that phrase around and say that I'm an artist who uses data or an artist who engages with data. But for maybe for the sake of generating some argument, I can say that I'm a data artist.",
      "id": "ep_36_ut_28"
    },
    {
      "end": 309950,
      "speaker": "Moritz Stefaner",
      "start": 303610,
      "text": "Good. So do you call yourself data artist or somebody else attached this label to you?",
      "id": "ep_36_ut_29"
    },
    {
      "end": 351260,
      "speaker": "Enrico Bertini",
      "start": 312850,
      "text": "It depends on who I'm talking to. I think I often lately use that phrase just to be kind of provocative, because I think if you tell somebody you're a data artist, very few people just go, oh, okay. Everybody has a reaction of some kind. They are on the spectrum of curious to angry, depending on who they are. And so that can be a really useful tool to get a response from people. It's something that people haven't really heard before. So it's a nice way to introduce yourself.",
      "id": "ep_36_ut_30"
    },
    {
      "end": 364530,
      "speaker": "Moritz Stefaner",
      "start": 351720,
      "text": "Yeah. This is something that really fascinates me to some extent, because there are so many people who are so much against these artistic kind of things, the data visualization purists, so to speak.",
      "id": "ep_36_ut_31"
    },
    {
      "end": 365166,
      "speaker": "Enrico Bertini",
      "start": 364720,
      "text": "Right.",
      "id": "ep_36_ut_32"
    },
    {
      "end": 375054,
      "speaker": "Moritz Stefaner",
      "start": 365238,
      "text": "And I find it really weird. So do you want to talk? Do you have your own definition of data art or art visualization art or whatever? I mean.",
      "id": "ep_36_ut_33"
    },
    {
      "end": 512980,
      "speaker": "Enrico Bertini",
      "start": 375182,
      "text": "Well, I mean, I think there's a, there's a couple of things that you just said there. I think that when I think about broadly data art, I don't really focus on visualization. I think that data art can be pretty visualization, which is, I think, the thing that first people think about when they think about data art, they're like, oh, those are visualizations that look really good, visualizations without. I think that's only a really small slice of the possibility spectrum. And I teach a class at ITP called data art, and there we really generally are saying about art and artists that engage with data in some way. So that could be through the generation of visualizations, but it could also be through the writing of algorithms, it could be through collection of data, it could be through performance of data, it could be through. There are many, many options there for an artist to connect with, not only the output of the data cycle, but also the input of it, the midpoints. It's a really, as I think most of the listeners probably are really aware of, there's a lot of different pieces of our human engagement with data. And I think that artists can get into those pieces in all kinds of different ways. And for some people, the interesting thing may very well be to make some kind of beautiful data art work that they could put up on their wall, like that piece behind Moritz. Or it could be, it could be something completely different. The contemporary art dialogue for the last hundred years has really not been about objects and has been more about practice and concepts and ideas and questions. There's so many answers to the question of what is data art? And I think that's one of the exciting things about teaching this new class, is that in many ways, it's pretty fresh territory. And so there are a lot of places where we can try and fail at new things.",
      "id": "ep_36_ut_34"
    },
    {
      "end": 523300,
      "speaker": "Moritz Stefaner",
      "start": 514920,
      "text": "That's really interesting. So how do you teach data art? Where do you start from? Is it more of an attitude or there are some specific rules that you can follow?",
      "id": "ep_36_ut_35"
    },
    {
      "end": 620948,
      "speaker": "Enrico Bertini",
      "start": 525120,
      "text": "Well, so I'll tell you how I teach data art, and then I don't know how you should do it. So my class was broken into four sort of mini semesters. And so we talk about first, data and aesthetic, and then second, text and archive, and then third place in space, and then fourth about ethics and responsibility and connection with humans. So in each one of those four semesters, we start with kind of a survey of what's been done in the aesthetic one, that's probably the easiest, because there's hundreds and hundreds of pieces that we can look at. And then as we get further through the course, it becomes harder. By the time we get to the end, it's like, oh, here's three projects that I can show you. And then it was really important for me to bring people into the classroom that are actually doing this stuff. So this term, I had Luc Dubois and Ben Rubin and, and Josh Begley and Heather, Dewey Hagberg and Barack Arakan all in to talk to the class. I think all of those people are artists who have a kind of day to practice. And so it was a good chance for the students, I think, to also ask some questions and for me to ask some questions, because I don't really know how to completely define this thing, and I don't think anybody really does. But it was a really great. I thought it was a really great term. I mean, I might get my teacher evaluations back and it might say otherwise, but I thought it was a pretty good term.",
      "id": "ep_36_ut_36"
    },
    {
      "end": 692480,
      "speaker": "Moritz Stefaner",
      "start": 621084,
      "text": "Yeah. I think it's really interesting the way you organize your own course, because it doesn't look too different to the way I organize my own course, even though I'm teaching to engineers, actually computer scientists. And the things you mentioned, they are very much. I have the same things in common. I try to, first of all, expose my students to a lot of examples, and this is something I learned after giving this course for a few times, because what I notice is that many, many people just need to understand the language first. Right. There is a huge visual literacy kind of gap there that you need to fill. Right. And the second thing, I also try to invite people, normally from companies or startup or even designers, to let them provide their own perspective on visualization. And that's really, really useful. And every time I do that, at the end of the course, the students are super excited. It's one of the part they like the most of the course. They always mention having guests during the course is one of the best things of this course. But it's surprising to probably, we have completely different kind of approaches and audience, but in the end, we are using very similar tools.",
      "id": "ep_36_ut_37"
    },
    {
      "end": 849020,
      "speaker": "Enrico Bertini",
      "start": 693550,
      "text": "Well, I think that in some ways, I always feel like bringing in a guest is kind of cheating because you're like, and here now for class, I'll let somebody else do the work that you're paying me for. But actually, you can try your best as a teacher to make sure that all the students kind of you link with them in some way, in the way that you're explaining things and in the way that you're trying to convey these concepts, but by bringing in other people, everybody else has a different way of explaining these things and a different way of talking about them. And for me, teaching is like you try to bait as many hooks as you can in hope that the students are going to bite one of them and get really excited about it. And that's what you want. The best projects come out of that not out of a requirement to do the project, but out of a necessity, like a spiritual necessity to do the project. And sometimes you can get that going yourself. But I find I bring these people in, and what often happened, I think, is that they'll say one sentence that will just really resonate with somebody, and then they'll do a whole project around that. And so the other part of this course was that, so for each of the four little mini semesters, the students built a project. And so it was a chance to sort of really, in a fairly short period, build four pretty substantial projects and across really different domains. And so I think for a lot of the students, the first one was relatively easy. Let's just do an aesthetic exploration of data. And then by the time we got to the end, how do you build a project that addresses issues around data and ethics? That's a very hard question. And so we sort of saw a combination of projects where people felt that really at ease and projects where people didn't feel at ease. And I think that's kind of the ideal. You don't want a course where everybody, where every assignment's easy, and you don't want a course where every assignment is so hard that you don't feel like you're, you're succeeding at all. And so with this method, I think it worked. So I'm going to release, I'm releasing a website, a gallery website of 17. There were 17 students. So each of the projects I had pick students, I had them pick one of their projects. And that's going to go up on a website, which I'll give you guys the link to when it's complete.",
      "id": "ep_36_ut_38"
    },
    {
      "end": 857800,
      "speaker": "Jer Thorp",
      "start": 849060,
      "text": "Yeah, that would be great. Can you give us a brief overview, like, just talk about two or three projects so we get a sense of the range thing people did.",
      "id": "ep_36_ut_39"
    },
    {
      "end": 967570,
      "speaker": "Enrico Bertini",
      "start": 859100,
      "text": "Oh, man. I mean, there was, there was almost 80 projects in total, you know, so, you know, because four times 17 students times four. Right. So. And that's actually not true because they did some group projects. So there's probably somewhere closer to 40 or 50. But, you know, in the. In the aesthetic portion of things, you know, people were doing. And there was. That was a really interesting one, because some of the. Some of them, I asked them to try to. To focus purely on this kind of, what is the natural form of the data without any kind of interpretation and without any labeling and so on and so on. And that was a pretty hard thing. It was an easy thing for students who'd never done data visualization, and a very hard thing for students who had done data visualization. They were like. Because everybody who had done data visualization was like, I must put a label on this, right? But the people who had never done that didn't. They didn't do that. So. And so there was a bunch of really creative projects that kind of ran the gamut from some things that were, I think, pure abstraction and some things that were not. And one of my students did a gigantic print of all of the stories in the New York times over 100 years involving each of the planets in the solar system. And it was this kind of physical representation of the solar system, as well as being this text representation of the stories that had been made about them, which I thought was really nice. And then as the course went on, I think maybe with a little bit of pushing, the project started to get a little more political and a little bit more experimental.",
      "id": "ep_36_ut_40"
    },
    {
      "end": 982800,
      "speaker": "Jer Thorp",
      "start": 967990,
      "text": "But you had them do really four projects each over the course of the semester. I think that's a great method, too. Sort of forces you to do. Yeah. Just quick, lean, lean projects and not, like, overthink everything, right?",
      "id": "ep_36_ut_41"
    },
    {
      "end": 1000610,
      "speaker": "Enrico Bertini",
      "start": 983900,
      "text": "Yeah, yeah. So they had three weeks, though, to do the projects, which is kind of a good period of time, you know, like, it's. It's enough to do something successful, but not enough to get really too wrapped up in it. So.",
      "id": "ep_36_ut_42"
    },
    {
      "end": 1003934,
      "speaker": "Moritz Stefaner",
      "start": 1002590,
      "text": "That was Nora's.",
      "id": "ep_36_ut_43"
    },
    {
      "end": 1009582,
      "speaker": "Enrico Bertini",
      "start": 1004022,
      "text": "Nora's waving. Sorry, I'm getting interrupted in the middle of my very serious interview.",
      "id": "ep_36_ut_44"
    },
    {
      "end": 1011770,
      "speaker": "Moritz Stefaner",
      "start": 1009606,
      "text": "I cannot see what happened, but that was nice.",
      "id": "ep_36_ut_45"
    },
    {
      "end": 1094844,
      "speaker": "Enrico Bertini",
      "start": 1013590,
      "text": "Somebody dissenter somebody. Yeah, that was my girlfriend Nora. So, you know, one of the. The other things that I do in the class, not to sort of stick on the class for too long, but I force them to have at least one of their projects be a conceptual project. And so here the idea is that if you didn't have the constraints that you have as far as money and availability of public space and materials and time, what might you do within this context? And I thought that was really important as well, so that students are sort of not only restricted to, like, oh, what can I do in three weeks? But they can say, okay, I have this idea. We're going to do a projection on the side of the Empire State Building. It's going to, they can get into those areas which are really important, I think, and it kind of opens up your brain to possibilities that maybe you didn't have before. And I think a lot of the projects kind of had a seed of something which hopefully the students will follow. It might not be something as big as the Empire State Building, but it might be a project that they turn into a thesis project next year or a bigger project after they graduated.",
      "id": "ep_36_ut_46"
    },
    {
      "end": 1109830,
      "speaker": "Jer Thorp",
      "start": 1094932,
      "text": "Cool. That sounds really good. You definitely have to document all this. It's something, it's often like right after the semester, if you don't do it straight away, you sort of, you don't manage, and then you think like, man, that was good stuff. I should have put it somewhere.",
      "id": "ep_36_ut_47"
    },
    {
      "end": 1132150,
      "speaker": "Enrico Bertini",
      "start": 1111010,
      "text": "Well, I mean, so we'll finish this discussion about the class here. But there's a GitHub repository for the class, which is an open repository, and that has all of the course note or the syllabus, and then as well as all the source code for each of the projects that the student is, there's a lot of kind of documentation sitting there, which is nice.",
      "id": "ep_36_ut_48"
    },
    {
      "end": 1138480,
      "speaker": "Jer Thorp",
      "start": 1132660,
      "text": "GitHub repository is the best way to document a class anyways. I think that's my theory, at least.",
      "id": "ep_36_ut_49"
    },
    {
      "end": 1164210,
      "speaker": "Enrico Bertini",
      "start": 1140420,
      "text": "It's sort of, I liked it and didn't like it. I didn't like it because it also became like, we'll also be teaching you how to use GitHub. And like, I feel like me teaching somebody how to use GitHub is very much the blind leading. I know, I know, like the four GitHub commands that you need to know, but as soon as it gets past that, I'm like, you know, upstream merge, I didn't even know what you're talking about anymore. So.",
      "id": "ep_36_ut_50"
    },
    {
      "end": 1191064,
      "speaker": "Moritz Stefaner",
      "start": 1164750,
      "text": "Yeah, which actually, let me ask you one last question about the course, because they're really curious about that. Sorry, but do you actually teach them how to use the various tools that you need to build these visualizations or any kind of data art? Because that's another bottleneck. I have another problem, because if you need to teach them the tools, then it takes much longer and it's much more involved usually. But if you don't do that, then you might actually have some other kind of problems. Right? So how do you solve this?",
      "id": "ep_36_ut_51"
    },
    {
      "end": 1270260,
      "speaker": "Enrico Bertini",
      "start": 1191112,
      "text": "Yeah, yeah. So I mean, the nice thing about ITP is that ITP is kind of foundationally built on processing. So the students have at least one term. And so the class is a mix of first and second year students, so they have at least one term and maybe a year and a term of processing experience. So we build on that. So I probably, you know, ended up doing three full days, three or maybe three and a half full days of teaching, where we would walk through projects from beginning to end. So one of the things that I try to do in my class as much as possible is to sort of, is to really show how we would make something. And so, starting with the data set, let's make this, and then let's make that and let's make that, and let's end up with our result. And it's taken a long time to maybe understand how to do that in the period of 3 hours. But, but I think that now I sort of understand how to do that. And there are some good examples. So we did, we do one XML example and we do one JSON example and we do one CSV example, and then we do some mapping stuff as well, and then some language analysis. So there's the course, because of the way the course exists, it's hard to teach everybody everything because we are covering so much territory. But at the same point, it is definitely a mix of a theoretical and a teaching class.",
      "id": "ep_36_ut_52"
    },
    {
      "end": 1281550,
      "speaker": "Jer Thorp",
      "start": 1270570,
      "text": "Okay, but that's smart to focus it on D3 as you did, Enrico, or processing as you did, because then, you know, the teams can help each other out and it's not like a wild mixture.",
      "id": "ep_36_ut_53"
    },
    {
      "end": 1379430,
      "speaker": "Enrico Bertini",
      "start": 1282530,
      "text": "Sure. Yeah. And it's not, you know, the tool, people get so obsessed with tools these days, but it's. And I like processing because I think it's a good teaching tool. But I don't care if anybody wants to make their project in D3 or if they want to make it anywhere else. I actually don't care at all. And I think at the end of the day, the class is more about how to ask good questions and how to come up with good ideas and concepts and how to understand the flow of making that project manifest itself. And not really about the syntax of processing or the syntax of leaflet js, because that stuff, come on, we can all find that on the Internet. There's a stack like the stack over. There is no stack overflow for good ideas. There is a stack overflow for every other programming question that's ever been answered, no matter how obscure it is. And so what I try to do is maybe not waste time on stuff that people could google and try to get to the bottom, the hard stuff, which is how do you. And that's what maybe to circle our wagons is. That's, to me, the interesting thing about data art. You know, I think good art asks questions, and how do you ask those good questions? And that's difficult. But at the same time, I was really impressed by a lot of the output of the students who I think did a really great job of looking at a data set or an area of data in a way that I never would have.",
      "id": "ep_36_ut_54"
    },
    {
      "end": 1381904,
      "speaker": "Jer Thorp",
      "start": 1381120,
      "text": "Cool.",
      "id": "ep_36_ut_55"
    },
    {
      "end": 1382872,
      "speaker": "Moritz Stefaner",
      "start": 1382072,
      "text": "Cool.",
      "id": "ep_36_ut_56"
    },
    {
      "end": 1398260,
      "speaker": "Jer Thorp",
      "start": 1383056,
      "text": "How does this relate to your practice at the studio? Is it like, what do you say? Are you being commissioned to do data art pieces? Or is it more a different type of practice, what you do in the studio? Or is it a mixture of things?",
      "id": "ep_36_ut_57"
    },
    {
      "end": 1813314,
      "speaker": "Enrico Bertini",
      "start": 1400280,
      "text": "So that's a good question. It's not a question that that question is a moving target. You know, we do different things depending on when you catch us. But primarily, I think if we could describe what we do in two halves where on one half of it we're doing this kind of data artwork. So we have commissions with museums and galleries. We're just in the midst of a residency at the Museum of Modern Art. We did pieces last year for the Denver Art Museum and the Vancouver Art Gallery. We're just finishing, just starting a brand new project, a big public art project in Boston. So that's kind of half of what we do, and then the other half of what we do is R and D work. So we're kind of an R and D group for hire. So we do work, a lot of work with Microsoft. We've worked in the past with intel and Samsung. And here people are coming to us with data questions that are hard to ask using traditional or hard to answer using traditional techniques. I think the reason why the company started, here's how the company started, is that Mark HANSEN and I were working at the New York Times, and together Mark and I had built a tool called Cascade, which was a Twitter visualization tool. And then right after Cascade, and actually concurrent with Cascade, Ben Rubin and Mark and I worked on a project called the Shakespeare Machine. And I think we realized that actually the way that we were approaching these projects and the way that we built them, on one side an R and D, very sophisticated visualization tool, and on the other side, a data sculpture for a theater in New York City was the same practice. We do the same things. And so for our artwork, we're building probabilistic models, we're designing algorithms, we're building databases, we're writing APIs, we're creating visualization tools, we're doing all of these quite sophisticated things, and then the result of that is an artwork. When we do. When we do the more research, R and D focused work, it's exactly the same thing. And I think we know it's kind of a test. OCR was and is an experiment of, can we take methods from science, statistics, computer programming and engineering? Can we combine them with approaches from the humanities? And when those two things come together, can we do interesting things? And I think that's something that I always have a bit of a problem with. When we talk about our work, I think somebody on Twitter asked this. They're like, how do you balance what you do against traditional analytics? Well, the fact is we do that stuff. We have a tremendous amount of rigor in our process, and we're probably doing the same things. If not, you know, maybe I'm being. Maybe I'm being presumptuous, but maybe more sophisticated than what most people are doing. But the end product is not. Is not that graph or chart. The end product is something on top of that, which is the kind of data art thing. You know this, because if we're just going to take that, we're not going to take that graph or chart and put it up in a wall in a gallery and be like, ta da. But the discovery still comes with a lot of these machines for discovery that we all know how to use. Visualization is a tool to help us understand systems better. And when I'm trying to build an artwork about a system, I want to understand it better. And so I'm visualizing, and we're running regression analysis, and doing k means clustering and doing all of these things, if we need to do them, to help us answer the question. And then once we have an answer to the question, we think, okay, what is the core? What is the core of this answer? And how do I tell that to people? And almost always the answer to that is not like my laptop screen. And it may not be that, it's not even like that. It's too technical. It's just that it doesn't capture the thing in what I feel like is a real way. When we're working with data, we're working with measurements of a real world system. Usually we do these levels of abstraction, which are really important. We abstract and we abstract and we abstract, and we get to a place where we can find some insight. But what I think happens with most sort of data science work is that you remain on that level of abstraction. And what we try to do I think, is try to roll that back into people's lives, roll it back into human experience to bring it back to the real world again, and not in a really literal way, but using physical objects and using. Lately we've been doing a lot of work with performers, bringing these things back viscerally into an engagement that touches them in some way. And that, to me, is really rewarding, and it's really exciting. And I also, I had this discussion with somebody the other day, because I get this question all the time. It's like the number one question, what is the difference between data art and data science? And if we take data science with a capital s, we can talk about, like, I have a hypothesis, I want to test that hypothesis, and I'm going to get, either I'm going to get a result that agrees with my hypothesis, or I'm going to get a result that disagrees with my hypothesis. It's this binary output. I think what art does is it sort of, it negotiates and engages with that ambiguity in the middle between yes and no. Right? There's a lot of ambiguity between yes and no. And so we're doing a similar thing. We have an idea or a question or a feeling or some sort of, I think idea is probably the right word, and we also make something to test that idea. But instead of getting a yes or a no, we get something else. We get kind of this. The public, anyways, gets a kind of experience that's unique to them. Yeah, yeah, exactly.",
      "id": "ep_36_ut_58"
    },
    {
      "end": 1905820,
      "speaker": "Moritz Stefaner",
      "start": 1813482,
      "text": "Yeah. Which, by the way, I think that's what visualization is good for. I mean, visualization is not really this kind of very neat scientific tool that can, can give you the ultimate answer to a given scientific question. Right. Yeah, that's crucial from my point of view. But there is another thing you said that really resonates with some of the things that I'm always advocating for. And this idea that regardless what kind of output you're going to generate, in the end, the process is what, it's really the core part of visualization. Right. But the problem is that, and actually the process itself could actually lead to something that is completely different. It could be something that you can call data science, something that you can call visual storytelling or something that you can call data art or whatever, but the processes looks very, very similar. And what really bugs me is the fact that people are not very easily exposed to these processes. So if you look around the way people are exposed to visualization or data art in general, there's very little exposure to the process itself, unless a person comes to your course, for instance. Right. I think that's an issue because people look at these beautiful pictures or whatever and they don't understand what's behind that. Right. So the final outcome could be one number, could be something that you expose at MoMA, could be something else. But the process is what makes this kind of output, and the process is really the thing that you need to learn in order to become, I don't know how to call it data visualization export or whatever you want to call it. Right.",
      "id": "ep_36_ut_59"
    },
    {
      "end": 1966780,
      "speaker": "Enrico Bertini",
      "start": 1907280,
      "text": "Yeah. And I love that. And if I want to applaud, but I don't want to applaud because my microphone will go, because it really is about the process. And that's something that I know that we have been bad at over the last year, that we've had OCR going mostly just because we've been running and stumbling and trying to get things together. But I think for me, in the past, I think one of the things that I have been very good at through my blog and through the talks that I give and so on, is actually talking about that process and telling people that every pretty thing that I'm showing you is balanced on top of a mountain of failure. And that that's okay, you know, and this idea of visual that, and I wrote an article about this for Harvard Business Review last year. But talking about the idea that visualization should not be thought of as a noun, you know?",
      "id": "ep_36_ut_60"
    },
    {
      "end": 1968928,
      "speaker": "Moritz Stefaner",
      "start": 1968200,
      "text": "Absolutely.",
      "id": "ep_36_ut_61"
    },
    {
      "end": 2051770,
      "speaker": "Enrico Bertini",
      "start": 1968984,
      "text": "Not to think about making a visualization, but instead to think about visualizing as the, as the verb. And I, and that I tell people who take my workshops and I tell people that are in my courses at ITP that you may not ever make a visualization. That will be the thing. But I can guarantee you that at least once after this class, you will visualize something to help you understand it. And that to me is it should be the core function of, of visualization, and it should be a cognitive tool, and often a cognitive tool. And this is maybe the most important difference, is that a cognitive tool for the person making the visualization and not always for the person seeing it. Absolutely. We're so into visualization being a thing for an audience, whereas, like, if you were to do, you know, a breakdown of all the visualizations we make in the studio, nine out of ten of them are for us. You know, probably more than that. You know, 19 out of 20 of them are for us. One out of 20 is something that will show, that will even resemble the final result.",
      "id": "ep_36_ut_62"
    },
    {
      "end": 2053870,
      "speaker": "Moritz Stefaner",
      "start": 2052150,
      "text": "Sure. Absolutely. Absolutely.",
      "id": "ep_36_ut_63"
    },
    {
      "end": 2094782,
      "speaker": "Jer Thorp",
      "start": 2053910,
      "text": "But do you show them, the client. Like, how much do you involve the client in, let's say you, an external R and D project? I mean, when you do a data art commission, that's funny anyways, because then you only, usually you hand over the end result more or less to be displayed. And the process, I mean, you can document that, but it's not part of the piece. How do you handle that in the R and D case? Like, is the whole process the thing you deliver sort of for the client? Or is it more like they give you a brief which is fairly open, you check back with them and at some point you have something that seems to be working and then this is what you give them. How does that work?",
      "id": "ep_36_ut_64"
    },
    {
      "end": 2311382,
      "speaker": "Enrico Bertini",
      "start": 2094846,
      "text": "Yeah, I mean, again, there's no standard answer for that because our clients are so different. And some of our projects are open ended R and D projects where they're like, we have this interesting idea and this interesting data set. Maybe they have a data set, maybe they don't. And can you just like almost come up with some concepts and ideas from this? But most of the time there's some definable results. But we try to keep our process as visible as possible. So usually when I'm meeting with the client to show them what we've done, either midway or the end of that process, there's a lot of, let me show you our initial explorations. Let me show you the next stage. Let me show you what we went from there. And I actually find what this process really exciting because almost always these people haven't seen any of this. They're like, ah, that's amazing. That's amazing. Oh my God. And even if these are people who have worked with this data really closely, the truth is that there's, and I hear this over and over again from people. They're like, they're so busy that they have no time to look at the data, they're busy collecting it, building infrastructure to hold enough of it so that it doesn't fall down, and then fundraising to keep the process going. And they actually, even though it's not a hard thing to visualize this stuff, and most of these people are extremely capable to do so, they just don't have the time. And so they see it for the first time and they're like, wow, that's like, so it's really rewarding for them, you know, for an art commission. And I should say that it's not a binary division of what we do. And I think that there are projects that kind of sit somewhere in the middle of those two things. And I think that anyways, the answer is still more or less the same. My projects that I like the most are projects that we're allowed to show, show that stuff as it's happening. So we have a process tumbler that's on our website where we post process images from what we're doing. And I'd love to do way more of that. And we've been starting to do open GitHub repos for projects that are projects that we're working on, for clients that aren't concerned about privacy. And then that, and that way we also get to know. We just get to let people in on it. I think it's important to let people in on it because it's also good for us. It's good for us because somebody can look at something and say, this reminds me of this. Or, hey, do you know, most often the reason why I like to get our work out there as much as we can is what happens is something really magical is that somebody, obviously, they always say this sentence, and it might be like their genders are reversed and the locations are reversed or whatever, but they'll be like, you should talk to my friend Alice, because Alice is an expert in malaria in Nigeria, and she'd love to talk to you. And then you get to talk to this person who completely changes the way you're looking at it, and that otherwise wouldn't be able to happen. The word research is in our name for a reason. And I think that one of the things that sets us apart is really, you know, we're really rigorous about the research that we do around a process and making sure we understand it deeply, and that human connection is so important for us.",
      "id": "ep_36_ut_65"
    },
    {
      "end": 2340110,
      "speaker": "Jer Thorp",
      "start": 2311406,
      "text": "Yeah, yeah. I mean, that's a general, I think, misconception many people have about art. That's somehow about just hanging around all day and then having a brilliant idea at 07:00 p.m. while having a glass of red wine. And actually, it's a little bit of hard. I mean, let me just put that here on record, because, no, it's absolutely true. All the good artists are extremely hard work. You need a lot of discipline.",
      "id": "ep_36_ut_66"
    },
    {
      "end": 2465410,
      "speaker": "Enrico Bertini",
      "start": 2341410,
      "text": "One of my friends in Canada is an artist named Brian Jungen. I don't know if you've seen his work, but he's maybe most famous for these pieces where he made these Haida masks out of Nike Air Jordanse, but he also makes these gigantic whale skeletons out of white plastic lawn chairs. And I remember being, he was probably the first artist of that caliber that I was ever exposed to really directly, in a personal level, and just understanding how good he was and what he did and how precise of a craftsman he was and how deep and rigorous his research was. And there's this. I think there's always this kind of thing where, like, you're like, oh, an artist would be an easy thing to be, you know, and, like, there's just no way I could ever do the work that Brian does, because he, you know, he's incredible. The ability to. His spatial sort of spatial design abilities are just unbelievable. And. And the precision in which all of its projects have to be designed and engineered, and that's also a piece that I've been exposed to a lot working with Ben Rubin, who's one of the co founders of OCR. When we do these projects that end up being these gigantic sculptures that hang from the ceiling of a gallery, there's a tremendous amount of architecture, engineering, and precision that has to happen in these things that I certainly never have to deal with when I'm working on our traditional data projects. There's no question that the rigor involved in a physical project is, like, way, way, way more than the rigor in any sort of non physical, software based project that I've ever worked on. If your software crashes, that's one thing, but if your 11,000 pound sculpture crashes from the ceiling, that's not a good.",
      "id": "ep_36_ut_67"
    },
    {
      "end": 2527406,
      "speaker": "Jer Thorp",
      "start": 2466590,
      "text": "It's crashed again. Oh, shoot. I it's tough. I mean, maybe that relates also a bit to the whole question around the art market. I mean, this discussion is a rabbit hole, but maybe we can, like, briefly touch on it. Do you think, like, besides direct commissions, let's say, from companies or cultural institutions, is there, like, a market for artworks? Like, it's a bit difficult to sell digital art? I think that's something that has been a theme over the last few years that is not as accepted in the traditional gallery world. And do you think that's, like, how do you think is this going to play out? Will there be, like, a high end gallery type world? Will be this the way data art goes, or is it more crowdfunded or collectives doing, you know, just trying to figure it out, how it works? What's your feeling? How will there be a market for art, for data art?",
      "id": "ep_36_ut_68"
    },
    {
      "end": 2771836,
      "speaker": "Enrico Bertini",
      "start": 2527518,
      "text": "Sure there will. Yes, there will. I will pronounce that yes, there will be a market for this type of art. I think there's something interesting to think about, which is this kind of division between data and this data art term falls apart a little bit. I think we could talk about software. We can talk about digital art. All of these things fall apart. Naming is kind of hard here because I think that when we talk about what I consider to be data art, we had Adam Harvey come and talk at OCR a couple of weeks ago. I don't know if you're familiar with Adam's work, but he sort of does this work that's on the boundary of fashion and technology, and he builds counter surveillance burqas, these kind of cv dazzle makeup that's meant to. Meant to interfere with computer vision. And I think that that's hard to classify in our traditional idea of what software art is, even though it's art that engages with software. You know, it's art about subverting a computer vision algorithm. And his work involves a lot of research into those algorithms and a lot of testing a b testing of these kind of ideas. So it's a very computational work, but it's not digital. Right. So I would place that underneath the umbrella of data art, but it kind of doesn't fit in our normal categories. And I think that actually, if we look at, like, a lot of the. We can look at the art world in general, the capital, a art world of artists that make objects. And those people are doing pretty well. And, you know, the gallery world is also doing pretty well. But for a long time, there's been a whole other set of artists who kind of don't make objects. And we could list tons of them who have participatory practices or they have performance based practices, or they have something that's, like, even weirder. And those artists have never been part of what we think of as, like, you know, the Christie's auction house kind of kind of thing. There's a whole nother piece of that, which usually involves residencies, kind of commissioned engagements with art museums and cultural centers, you know, those types of things. And so if we think about where data art is going to land, to me, the most interesting parts of data art are probably going to land in that second category, where there are things that aren't necessarily objects, but at the same point, the ones that are objects. I think we're already seeing some of those things. I was at a traveling show of the Smithsonian's print collection when I was in Ohio three months ago, and Luc Dubois pieces from his a more perfect union project, which are totally data art, are in that collection. They're in the permanent collection of the Smithsonian. So there's certainly things that are happening in that category for our work. We're definitely not. We don't make objects that a collector could own. That might be a mistake, but we kind of don't. And so our work is either very process based and involves us going into being a residency somewhere and installing a piece for a temporary time, or are there these larger, permanent installations in public space, which are inherently vastly more labor intensive and problematic and expensive for most individuals to say, hey, I want this gigantic data sculpture installed in my living room. If you're listening and you want a gigantic data sculpture while installed in your living room, let's talk. But I don't know that there are that many people who have that.",
      "id": "ep_36_ut_69"
    },
    {
      "end": 2772556,
      "speaker": "Jer Thorp",
      "start": 2771988,
      "text": "Yeah.",
      "id": "ep_36_ut_70"
    },
    {
      "end": 2796636,
      "speaker": "Moritz Stefaner",
      "start": 2772668,
      "text": "So one type of art that I haven't seen developed much that would be really nice to see more often is data performers. Right. I think the best example is an Rosling who is just the perfect data player. And I guess there is a very nice space there that some people should try to fill. Right. Because the whole idea of, I don't know, going on stage and doing something that is far more live.",
      "id": "ep_36_ut_71"
    },
    {
      "end": 2797600,
      "speaker": "Jer Thorp",
      "start": 2796708,
      "text": "Data performance.",
      "id": "ep_36_ut_72"
    },
    {
      "end": 2801116,
      "speaker": "Moritz Stefaner",
      "start": 2798180,
      "text": "Yeah, I like data performance is something that I haven't seen.",
      "id": "ep_36_ut_73"
    },
    {
      "end": 3106000,
      "speaker": "Enrico Bertini",
      "start": 2801228,
      "text": "I don't know if you're purposely lobbing this up like a softball for me to hit, but that's kind of exactly the work that we've been doing. So in our residency at Noma. So we've had the tremendous luck to be able to work with an experimental theater group in New York City over the last four or five years called the elevator repair service. And so part of our result of our residency at MOMA is a series of performances in which we've written these algorithmic scripts that provide the performers with these ways to perform the collections database. So 120,000 pieces. And so we staged our first performance that was kind of a test run at MoMA in January, and then in January of next year, we're going to run a series of performances in the main galleries of MOMA, again with elevated repair service, which will be exactly bad, will be a performance of this data. And I haven't enjoyed myself this much working with data for a really long time, as with engaging with performers. And there's a link to this performance up on my blog right now. There's one particular piece of the performance that has just been really been sitting with me, and I'll just take 1 minute to describe it and you can go look at the video, and then I'll talk about why I am so excited about it. We were actually sitting in this room that I'm in right now, which is the OCR kind of front room, and Mark Henson was doing some data exploration on his laptop. This is kind of how it happens. We have this data set, 120,000 lines and a big, gigantic dirty CSV file. And so we spent some days cleaning it, and then we finally had it ready. And Mark had Python running, and he was doing some natural language explorations and some basic counts and stuff, and I had processing going, and I was looking at the dimensions of the pieces and so on and so on. And Mark was like, listen to this. And what he had done, he wrote a quick python script that counted the first names of every artist in the collection and then ordered them by order of occurrence. So the most popular name is John, and the second most popular name is Robert. And then. And then he just started reading them. And as it turned out, the first 42 names are male surnames, and it's not until number 43 do you hear the first female surname, which is Maryland. And this reading, we were sitting there, Ben and I were sitting there, and it was really. There was this tension, right? We were, like, waiting for him to read a woman name, but it didn't come. And then finally, when it came, we were like, oh, my God, thank you. And we just expected the floodgates to open, but then there's, like, another ten names until you hear the next female's name. And so this is. We basically took that idea of verbatim into the performance. And so in the performance, there's a male actor who's reading all the males names in a. And then the two female actors are reading the female names, and he starts reading them really, really fast because there's so many of them. And I thought to myself, right after the performance happened, I don't think there's a better way to do that data set, right? Because a list, a word cloud, none of it brings that kind of attention to it, and none of it really engages with the politics of it in the same way that that did. And you can watch the video. I love it. I mean, it's like. And that, to me, was so exciting because it was a proof of concept of something, you know, that the data and performance is not just a kind of frivolous exercise, but can actually give us ways of engaging with these data sets that are more meaningful and more effective than our traditional means. And so we're, like, we're really excited. And in the spring of next year, and probably maybe the fall of this year, we'll be doing open rehearsals in the MoMA galleries as well. So while the museum is open. We'll be rehearsing in the galleries with actors and trying to understand how we can refine the algorithms that are generating the scripts to kind of work in different ways. And it's just been so amazing. And that's actually something that I challenge my students to as well. It's a hard one because I think by default, a lot of the ITP students aren't very performative. And I don't mean that in, like, they won't speak up in class, but they're like, they're not used to being on stage or maybe they're not performing artists. And so I think that's, I'd love to see more of it. Cause it's really, it's super effective, and it's a way that data can be brought out into public space. It's a way that, it's the other thing that I think the biggest, most important weapon there is that it's completely unexpected.",
      "id": "ep_36_ut_74"
    },
    {
      "end": 3113844,
      "speaker": "Moritz Stefaner",
      "start": 3107540,
      "text": "Yeah. Yeah. There is this whole concept of serendipity there. Right. Which is.",
      "id": "ep_36_ut_75"
    },
    {
      "end": 3134950,
      "speaker": "Enrico Bertini",
      "start": 3114012,
      "text": "Yeah, I just think if you ask people to close their eyes and say, what do you think data art is gonna look like? Pretty much no one's gonna say, oh, I bet it'll be a performance. You know, they're going to start with, like, you know, computer screens and charts and graphs, and eventually they might get to, like, sculpture, but they're probably going to take them a long time before they're going to be, like, thinking about performance.",
      "id": "ep_36_ut_76"
    },
    {
      "end": 3143750,
      "speaker": "Moritz Stefaner",
      "start": 3135730,
      "text": "No, but that's the thing. I think there are so many additional and new ways of doing data art that are somewhat unexplored, and that's a very good example.",
      "id": "ep_36_ut_77"
    },
    {
      "end": 3186450,
      "speaker": "Enrico Bertini",
      "start": 3144330,
      "text": "Yeah. And dance, I think, is really fruitful. I mean, this is, that's an area that has been explored in some small ways anyways. You know, I've seen, we've seen this sort of sorting algorithms as dance. And dance is somewhere where tech has become a part of dance for quite a long time. And because of the experimentality of dance, I think there's more willingness to collaborate with artists who are tech artists. Theater has sort of taken a little longer and sort of capital p. Performance art is also something that I don't think we've seen too much of yet.",
      "id": "ep_36_ut_78"
    },
    {
      "end": 3229540,
      "speaker": "Jer Thorp",
      "start": 3187550,
      "text": "Yeah. And what's interesting about that elevator repair service piece is also, instead of presenting a lot of data in a very small space, what you often try to achieve in data visualization, it's more like you stretch out a really simple data set, a really small one, but you give people a chance to meditate on that, you know, not just, like, consume it much slower than they would be able to. And that hopefully, like, enables you to go deep into that. Yeah, really meditate on it. And I think that opportunity to meditate on a theme, you give people, you know, an object to allow them to meditate on it.",
      "id": "ep_36_ut_79"
    },
    {
      "end": 3349800,
      "speaker": "Moritz Stefaner",
      "start": 3230320,
      "text": "Yeah, I think that's totally true. And I think it connects with some of the things that we discussed in the past on the show. The idea that every single data point can actually tell a very compelling story. I mean, this whole dance between trying to cram a million data points into one screen, but also trying to pick up one single point and tell a story about this single point. Right. I think that that's really interesting. And again, going back to Hans Rosling's work, I don't know if you. I think everyone knows his work about Gapminder, but there is another piece of work that he did in the past that is really fantastic, that I really loved. I don't know if you've ever seen it. I think it's. I don't remember the details, but I remember it's kind of like different shades of poverty. Right. So he has different images of. I think it's villages in Africa or some. Honestly, I don't remember the details. I think it's different kind of villages in Africa or other countries. And it's basically about the fact that we wealthy people in the west think about poverty as one single kind of poverty, right? But there are very different shapes and degrees of poverty. And by showing these different images, you can actually see how poverty can actually differ from different scales of poverty. Right? And I found this thing really, really engaging and revealing at the same time. And I think another thing that I think another connection I see here is that we live in a world where these artificial distinctions between artists or anything. I mean, Ansel Rosling is what is a statistician or political scientist. And there are people who come from computer science, people who are trained in design, in art, and we're all doing things that are very, very similar. Right. So you have an statistician or anything, and he's doing real performances on the show. Right. And then you have Jerry, who is an artist, but he's doing very technical stuff and dealing with statistics. Right. This is what you mentioned before. Right. So I think that these old artificial boundaries don't make any sense at all today.",
      "id": "ep_36_ut_80"
    },
    {
      "end": 3354030,
      "speaker": "Enrico Bertini",
      "start": 3350870,
      "text": "Yeah. I mean, I actually think Hans Rosling is a doctor. He's a medical.",
      "id": "ep_36_ut_81"
    },
    {
      "end": 3355454,
      "speaker": "Moritz Stefaner",
      "start": 3354110,
      "text": "Oh, he's a doctor, yes.",
      "id": "ep_36_ut_82"
    },
    {
      "end": 3557700,
      "speaker": "Enrico Bertini",
      "start": 3355622,
      "text": "Which is. Which is yeah, even better, right? Even better. Even better. And yeah, I agree with what you're saying 100%, but when I talk about this, I also want to make it clear that I have a huge amount of respect for people who are experts in their field, of course, you know, and I think that being good at working across fields is about understanding your ignorance, you know, and engaging, you know, both using. Using your ignorance for good, you know, to ask questions that maybe people wouldn't normally have asked, or to be able to frame things in ways that might be unusual, but also to be able to be. And I think I'm always just tremendously humbled by working with people who are really immersed in their single field. But I do really think that data, if we look at this data visualization, data science world, that maybe most people who are generally listening to this podcast come in, there's a lot of critical things we could say about the state of that world right now. And I think that collaboration with other fields is really important to shake us out of it. And I think the most fruitful of those collaborations maybe comes with the humanities. I've long been an advocate of having data people work really closely with journalists in my time with that New York Times. I think that journalists are so good at asking good questions, and I think data scientists, and I'm using a really broad brush here. And again, I have a huge amount of respect for people who are so much better at what they do than I am sometimes we're not very good at asking the right questions. And that runs us right back to something you said a couple of minutes ago, which is that you could take a data set and just keep on drilling into it, and just ask a question, ask questions about every row and every column, and you can really get into a data set in a way, which is which I think where statisticians have maybe never been that good at. And now, with these sort of technological aids that we have in this world of big data, we're even worse at it. We're so used to flying at 10,000ft that we don't really know what to do when we're on the ground. That's a weakness that I have and that I've really tried to get over, and it's something that I try to hammer into my students as much as possible, is to really interrogate your data sets. And I'm not brave enough to do it, but I think you could teach a 14 week class around one data set, and not even a big one.",
      "id": "ep_36_ut_83"
    },
    {
      "end": 3559428,
      "speaker": "Jer Thorp",
      "start": 3557820,
      "text": "Just where the data comes from. What?",
      "id": "ep_36_ut_84"
    },
    {
      "end": 3644290,
      "speaker": "Enrico Bertini",
      "start": 3559444,
      "text": "It doesn't show exactly, all these things. I think, actually, Kim Reese said this for the first time, but she was like, take your data set, slice one row out of it, and, like, spend an afternoon with that row. What are all of the things that you could list that you know or that you don't know about that row of data, and then only then go and put it back in the hole and come back to it, which, from our R and D work and also our artwork, that's something that we try to do as much as possible. And then the nice thing I think about a lot of these pieces that we work on is that each one of those rows is like a portal into another world of knowledge, especially when we're dealing with something like the MoMA collection. Each piece, each artist, each year. These are all things that open up this massive other set of data that we could have access to or set of questions. And it's really important to be able to get into your data and look at it on a personal level as well as on a kind of gigantic level. The distant reading and also close reading. How do those two things operate together?",
      "id": "ep_36_ut_85"
    },
    {
      "end": 3665270,
      "speaker": "Moritz Stefaner",
      "start": 3645630,
      "text": "Yeah, I think one thing that it's very easy to lose in this big data hype is the fact that data is just a signal of something real. Right. So we try. We ended up treating data as if data is something on its own. Right. But data is always a recording of something else that is more real. Right.",
      "id": "ep_36_ut_86"
    },
    {
      "end": 3666666,
      "speaker": "Enrico Bertini",
      "start": 3665810,
      "text": "Yeah.",
      "id": "ep_36_ut_87"
    },
    {
      "end": 3686112,
      "speaker": "Moritz Stefaner",
      "start": 3666858,
      "text": "And I think keeping in mind that data is just the recording of a signal of something else most of the time, I would actually say 100% of the time. I think it's really important just stopping for a moment and ask yourself, what. What's the real thing? Right. So this is a representation of a real thing, right?",
      "id": "ep_36_ut_88"
    },
    {
      "end": 3688420,
      "speaker": "Enrico Bertini",
      "start": 3686216,
      "text": "Yeah. I mean, I write.",
      "id": "ep_36_ut_89"
    },
    {
      "end": 3690664,
      "speaker": "Moritz Stefaner",
      "start": 3688840,
      "text": "Yes, sure. Go ahead. Sorry.",
      "id": "ep_36_ut_90"
    },
    {
      "end": 3696500,
      "speaker": "Enrico Bertini",
      "start": 3690752,
      "text": "I mean, I write. I write basically that, like, on the board at my first class. Right. Data is not the thing.",
      "id": "ep_36_ut_91"
    },
    {
      "end": 3697620,
      "speaker": "Moritz Stefaner",
      "start": 3696840,
      "text": "Yeah.",
      "id": "ep_36_ut_92"
    },
    {
      "end": 3705800,
      "speaker": "Enrico Bertini",
      "start": 3698440,
      "text": "Data is a measurement of the thing. And 90% of the really bad mistakes we make in engaging with data is by forgetting that.",
      "id": "ep_36_ut_93"
    },
    {
      "end": 3706206,
      "speaker": "Jer Thorp",
      "start": 3705840,
      "text": "Yeah.",
      "id": "ep_36_ut_94"
    },
    {
      "end": 3706950,
      "speaker": "Moritz Stefaner",
      "start": 3706288,
      "text": "Yeah.",
      "id": "ep_36_ut_95"
    },
    {
      "end": 3798496,
      "speaker": "Enrico Bertini",
      "start": 3708330,
      "text": "And that. That gap is really interesting. It's a really. You know, there's a. There's like, there's this separation between. Between the thing and its measurement, and then there's the separation between the measurement and its representation, and then there's the separation between the representation and its understanding. Right. So there's like these. These like, little pockets of air in between those things that insulate from the thing and our understanding of the thing. And sometimes I think as a data visualization person, you're trying to make those pockets appear tighter so that they don't, you know, you can more clearly hear the signal from part to part. But I think one of the great things about working in data art is that sometimes that's not the goal. Sometimes you actually want to build out those layers so people are more aware of them. Sometimes. Sometimes it becomes an almost. I think in the performance, the case of the performance, we're actually adding kind of another layer there. And in a weird way, you know, in the case of that names piece we were talking about, I think it actually kind of brought it back again. You know, you add enough space in between point a and point b that you kind of circle around and touch it again in a way that you weren't otherwise able to do, which to me, was a really interesting thing. You know, you have to think about, how do I. How do I become. How do I become more true to the data? And in this case, it was actually the way to become more true to the data was to get further away from it.",
      "id": "ep_36_ut_96"
    },
    {
      "end": 3799080,
      "speaker": "Moritz Stefaner",
      "start": 3798688,
      "text": "Yeah.",
      "id": "ep_36_ut_97"
    },
    {
      "end": 3817856,
      "speaker": "Enrico Bertini",
      "start": 3799120,
      "text": "Which it's hard. It's stuff that I'm, you know, that I'm really trying to think about. And I think it's funny that we still. We still believe we have this idea of a kind of true data, you know, a true data objectivity. Absolutely.",
      "id": "ep_36_ut_98"
    },
    {
      "end": 3819600,
      "speaker": "Moritz Stefaner",
      "start": 3817928,
      "text": "That's a huge topic.",
      "id": "ep_36_ut_99"
    },
    {
      "end": 3920550,
      "speaker": "Enrico Bertini",
      "start": 3819760,
      "text": "And, yeah, you could have, like, you know, let's talk about, like, you know, the error bar and confidence intervals and, you know, the fact that, like, we believe that we can look, that we can do this in some way, that this thing that I have on a piece of paper somewhere is gonna somehow be a real capital r representation of this thing is a falsity. And it's really comforting in kind of this kind of modernist way. It's like that we could somehow do that, but I just don't think we can in the vast majority of cases. And I guess maybe one of the reasons why I started with work that was more representational and sort of ended up in somewhere that was more abstract is that I actually think that it's kind of more true to the. To our systems, these systems and our relationships to them than it is to sort of lie to yourself about some exactitude that doesn't exist. Errol Morris is one of my favorite people, and he's done a lot of writing in his essays in the New York Times over the last few years about photographs and objectivity. And subjectivity. And this idea that every photograph, by default, is a lie, you know, I just, I love that and I use it when I'm talking to my students. You know, it's like every data visualization by default is a lie. And so if we can get around that, we can start to have a better conversation than start it, then if we sort of focus on how do we make the photo not a lie? Because we can't do that.",
      "id": "ep_36_ut_100"
    },
    {
      "end": 3922058,
      "speaker": "Moritz Stefaner",
      "start": 3921290,
      "text": "Absolutely.",
      "id": "ep_36_ut_101"
    },
    {
      "end": 3954290,
      "speaker": "Jer Thorp",
      "start": 3922114,
      "text": "Yeah, but you know, at the same time, it's only the blind trust into the device or the apparatus, you know, that's the problem. And if you overcome that and use it as a tool for yourself, like your own investigations and like for truth seeking, it's suddenly so powerful. And that's, I think, what we all fascinated with now we have these tools at our disposal, like everybody, you know, all the great science tools and the web and stuff and. But, yeah, but that I think, yeah, the last few years totally led to this data positive.",
      "id": "ep_36_ut_102"
    },
    {
      "end": 3979756,
      "speaker": "Enrico Bertini",
      "start": 3956980,
      "text": "I would get the word truth out of there entirely myself. You know, I would say. I would say that, you know, a data visualization is not. I like the idea, you know, data visualization is not a truth. It's an instrument towards truth. But I might replace the word truth with understanding. You know, a data visualization is not in itself an understanding, but it's an instrument towards an understanding.",
      "id": "ep_36_ut_103"
    },
    {
      "end": 3987996,
      "speaker": "Jer Thorp",
      "start": 3979788,
      "text": "Yeah, but then the process comes back and you use it to construct knowledge or to get better impressions of the world, as you say it, which is.",
      "id": "ep_36_ut_104"
    },
    {
      "end": 4001268,
      "speaker": "Moritz Stefaner",
      "start": 3988028,
      "text": "Actually true for the highest level of objectivity that we reach. That is science. Right. Science itself is not, it's not necessarily the truth. Right. It's just one way to look at some phenomenon or whatever.",
      "id": "ep_36_ut_105"
    },
    {
      "end": 4002028,
      "speaker": "Enrico Bertini",
      "start": 4001324,
      "text": "Right, right.",
      "id": "ep_36_ut_106"
    },
    {
      "end": 4016360,
      "speaker": "Moritz Stefaner",
      "start": 4002164,
      "text": "I mean, theories get, get created and then discarded or modified or whatever. Right. That's, that's science. Right. And that's the biggest, I think it's the highest level of objectivity that we humans achieved so far. Right.",
      "id": "ep_36_ut_107"
    },
    {
      "end": 4074730,
      "speaker": "Enrico Bertini",
      "start": 4017220,
      "text": "But yeah, I agree with you entirely. I just, I don't think that's the cultural understanding of science. And it certainly, I don't think it's the understanding of most scientists. I mean, I, maybe I won't say most, but a lot of scientists, you know, that do sort of feel like that it is about truth and. Yeah, I mean, it's the best scientists that you work with are really, really, really aware of the ambiguity and the uncertainty in all these things. And they're actually, I think the best ones really love it. They love that idea. Exactly. There's something that they can really embrace and I think that's something that at the highest level, great scientists and great artists have in common this kind of love of the unknowable.",
      "id": "ep_36_ut_108"
    },
    {
      "end": 4084542,
      "speaker": "Jer Thorp",
      "start": 4075670,
      "text": "Yeah, no, absolutely. And you're absolutely right. This idealized version of the scientist in this white lab coat and glasses and.",
      "id": "ep_36_ut_109"
    },
    {
      "end": 4087966,
      "speaker": "Moritz Stefaner",
      "start": 4084566,
      "text": "So, like, super similar to the idealized. Yeah.",
      "id": "ep_36_ut_110"
    },
    {
      "end": 4094300,
      "speaker": "Jer Thorp",
      "start": 4087998,
      "text": "That only exists outside the sciences, you know, exactly. As you know, the idealized view of the art is.",
      "id": "ep_36_ut_111"
    },
    {
      "end": 4098100,
      "speaker": "Moritz Stefaner",
      "start": 4096800,
      "text": "Yeah, exactly.",
      "id": "ep_36_ut_112"
    },
    {
      "end": 4132630,
      "speaker": "Enrico Bertini",
      "start": 4099520,
      "text": "That understanding around science is also something relatively new. Science took a long time to start looking at itself. When we start to think about philosophy of science, that is a relatively new thing. And when it started not too long ago, maybe over 50 years ago, it was a really contentious thing that science would start to look at itself or that, or that, or that, or that philosophers would look at science and somehow start.",
      "id": "ep_36_ut_113"
    },
    {
      "end": 4144558,
      "speaker": "Jer Thorp",
      "start": 4132750,
      "text": "Yeah, you had the beginning of good lands on that. You know, there might be things that true and that are not provable and I think that would. Quantum theory.",
      "id": "ep_36_ut_114"
    },
    {
      "end": 4146766,
      "speaker": "Enrico Bertini",
      "start": 4144614,
      "text": "And so I like where this is going.",
      "id": "ep_36_ut_115"
    },
    {
      "end": 4149770,
      "speaker": "Jer Thorp",
      "start": 4146798,
      "text": "Yeah, absolutely. So now we're entering part two.",
      "id": "ep_36_ut_116"
    },
    {
      "end": 4218868,
      "speaker": "Enrico Bertini",
      "start": 4151869,
      "text": "But actually, I mean, just to like ramble off into the. Into the distance for one more second is that, you know, that, that whole girdle, you know, the realization that there are things that are on, that are unprovable was, was a really, you know, was a. It moved the ground from underneath a great number of scientists and the ripples from that have continued to spread from mathematics to physics to biology and outward. And outward. And outward. In every field. People sort of have, you know, this idea that everything can be solvable has just been top toppled. And I sometimes feel like we're in the. I sometimes feel like we're in the last edges of that where this, like big data has arrived. And they're like, maybe this is it. Maybe we will be able to use it to do this thing, but eventually it'll just topple as well. And it's crazy to think that it took 110 years and that wave is still going.",
      "id": "ep_36_ut_117"
    },
    {
      "end": 4248080,
      "speaker": "Jer Thorp",
      "start": 4219044,
      "text": "I mean, these things take a while to sift in. I mean. Yeah, but I absolutely agree. I think this new synthesis of all these disciplines and what you mentioned before, the collaborations with the humanist journalists and within that, such an ecosystem, science can be super powerful. It's more the problem if you think that's the only method that counts. Yeah, great stuff, chair. I like that.",
      "id": "ep_36_ut_118"
    },
    {
      "end": 4251684,
      "speaker": "Enrico Bertini",
      "start": 4249900,
      "text": "Now let's get back to reality. Right?",
      "id": "ep_36_ut_119"
    },
    {
      "end": 4253720,
      "speaker": "Jer Thorp",
      "start": 4251732,
      "text": "Yeah, I think we need to wrap it up soon.",
      "id": "ep_36_ut_120"
    },
    {
      "end": 4256600,
      "speaker": "Enrico Bertini",
      "start": 4254060,
      "text": "Bar school philosophers here.",
      "id": "ep_36_ut_121"
    },
    {
      "end": 4265616,
      "speaker": "Jer Thorp",
      "start": 4256900,
      "text": "What are you looking forward to? Anything up? I mean, IO festival is coming up. You forgot to mention that's one of your, your other activities. Your co organizer of the IO festival, right?",
      "id": "ep_36_ut_122"
    },
    {
      "end": 4324226,
      "speaker": "Enrico Bertini",
      "start": 4265648,
      "text": "Yeah, yeah. Which is, I think, gonna be amazing this year, where we have a really amazing group of speakers. I mean, as always, I think, you know, we're really lucky that the people that we invite to this thing tend to say yes. And so we've kind of gone a little further afield than we normally, normally do this year. And I think it's gonna work. Who knows? We'll see what happens to. But, you know, the most exciting thing is that tomorrow morning I'm getting on a plane to go to LA. That's not the exciting part. And then after that, I'm going to Cocodri, Louisiana, where I'll get on a boat which will take me to a bigger boat called the RV Atlantis, which is the mothership for a submersible called Alvin, which is the deepest diving man, second deepest diving man, submersible in the world. Be getting in there and going to the bottom of the ocean. Yeah. Wow.",
      "id": "ep_36_ut_123"
    },
    {
      "end": 4326378,
      "speaker": "Jer Thorp",
      "start": 4324338,
      "text": "That's so crazy. How deep? How deep?",
      "id": "ep_36_ut_124"
    },
    {
      "end": 4344074,
      "speaker": "Enrico Bertini",
      "start": 4326434,
      "text": "Yeah, I'm not sure. It depends on which dive I go on. There's two depths of dives on this cruise. So the first set of dives is around 950 meters and the second one is around 2400 meters. So one of the two. Either way. Deep enough to be scared.",
      "id": "ep_36_ut_125"
    },
    {
      "end": 4345590,
      "speaker": "Moritz Stefaner",
      "start": 4344122,
      "text": "Yeah, absolutely.",
      "id": "ep_36_ut_126"
    },
    {
      "end": 4483376,
      "speaker": "Enrico Bertini",
      "start": 4346410,
      "text": "But actually, you know, really, really, really related to our conversation, because I had an email from Cindy Lee Vandover, who's the, she's the chief, the head scientist on this, on this cruise, and she wants to bring an artist in residence on board to help kind of bridge this gap between science and art. And she said something really, really amazing, which I'm totally going to paraphrase because I don't have my email open, but the depths, the deep ocean, as she calls it, it's like this really important ecosystem to the world, but we have no understanding of it. And thus far, our attempts at understanding have all been through the lens of science. And so what does it mean to try to add to that understanding through the arts? And so that's going to be kind of my gigantic role, is to try to try to think about some ways that we can capture that. And so Alvin collects video and still images and sensor data, about a terabyte of data per dive. And then over the length of the two week cruise, there's another about four terabytes of sensor data that are collected by the boat, as well as an unmanned submarine called sentry. It's a great challenge and exactly what I like, which is how do we take this gigantic set of data and make some sense of it? Alvin has been around for about 50 years. Almost exactly 50 years. So there's 50 years of history with the submersible. And so the things that I'm thinking about are, like, how do we tie those things together? How do I tie together my own personal human experience with going in a seven foot titanium sphere to the bottom of the ocean? And then how do I. But how do you also connect that to the humans on board, to the humans who've been in the submarine before, to the people who are maybe engaged with or not engaged with this type of subject? So it's pretty exciting. Wow. Yeah.",
      "id": "ep_36_ut_127"
    },
    {
      "end": 4494980,
      "speaker": "Jer Thorp",
      "start": 4483568,
      "text": "And so you go there and do you know if. Will you. Will it be more like, do you have a direction yet? Or are you, like, super open and just see how you synthesize all of that in the end?",
      "id": "ep_36_ut_128"
    },
    {
      "end": 4558042,
      "speaker": "Enrico Bertini",
      "start": 4495800,
      "text": "Yeah, you know, I try. I try not to get a direction on these things. I think if anything, that historically, I've been taught is that. Is that better? Ideas come a little bit later. I have an idea of what this is going to be like, and if I base my concept on that, then I'm kind of doing a disservice to the actual experience. So I'm not thinking about it very much. I've been doing a lot of research and doing some visualization to help me understand that research, and I'll be doing some visualization on board, but it's been actually really great. They invited me with relatively little notice, and so we kind of agreed that this year, his expedition would be a little bit of a get the feelers out and sort of understand what might be possible. And then hopefully next year, I'd be able to do something a little more granddaddy.",
      "id": "ep_36_ut_129"
    },
    {
      "end": 4560330,
      "speaker": "Jer Thorp",
      "start": 4558136,
      "text": "Cool. Sounds really good.",
      "id": "ep_36_ut_130"
    },
    {
      "end": 4588532,
      "speaker": "Enrico Bertini",
      "start": 4561990,
      "text": "Yeah, I'll be posting. I'll be posting. I'll be writing for the National Geographic Explorers blog next week while I'm on board. Yeah. You know, just posting some little sketches. And obviously, I'll try to tweet in Instagram when I can. Although apparently the Internet connection is not particularly great on the boat, especially on the. I'll be. I don't know if it'll be the world's deepest selfie, but I'm gonna try.",
      "id": "ep_36_ut_131"
    },
    {
      "end": 4590500,
      "speaker": "Jer Thorp",
      "start": 4588596,
      "text": "Yeah, you should. Yeah, I was just.",
      "id": "ep_36_ut_132"
    },
    {
      "end": 4592196,
      "speaker": "Enrico Bertini",
      "start": 4590540,
      "text": "If you want to add a location. Yeah.",
      "id": "ep_36_ut_133"
    },
    {
      "end": 4598052,
      "speaker": "Jer Thorp",
      "start": 4592228,
      "text": "Break some GPU records or something. Yeah. Point. Ever tweeted from?",
      "id": "ep_36_ut_134"
    },
    {
      "end": 4611920,
      "speaker": "Enrico Bertini",
      "start": 4598236,
      "text": "Yeah, I want you to add a little. A little location for Selfie City. Yeah. Bottom of the one photo. It'll just be one selfie. It'll just be me. Yeah. What do these selfies have in common? Well.",
      "id": "ep_36_ut_135"
    },
    {
      "end": 4620730,
      "speaker": "Jer Thorp",
      "start": 4613950,
      "text": "I like that. Cool. Great having you on. I think we need to wrap it up. Otherwise, people.",
      "id": "ep_36_ut_136"
    },
    {
      "end": 4624478,
      "speaker": "Enrico Bertini",
      "start": 4621230,
      "text": "Yeah. I think we could talk forever. We could talk forever.",
      "id": "ep_36_ut_137"
    },
    {
      "end": 4628330,
      "speaker": "Moritz Stefaner",
      "start": 4624574,
      "text": "Yeah. That was super interesting. Yeah.",
      "id": "ep_36_ut_138"
    },
    {
      "end": 4630238,
      "speaker": "Enrico Bertini",
      "start": 4629510,
      "text": "All right.",
      "id": "ep_36_ut_139"
    },
    {
      "end": 4630918,
      "speaker": "Jer Thorp",
      "start": 4630374,
      "text": "Thanks so much.",
      "id": "ep_36_ut_140"
    },
    {
      "end": 4632798,
      "speaker": "Moritz Stefaner",
      "start": 4630934,
      "text": "Okay. Thanks a lot, Jerry.",
      "id": "ep_36_ut_141"
    },
    {
      "end": 4633422,
      "speaker": "Jer Thorp",
      "start": 4632814,
      "text": "Great having you on.",
      "id": "ep_36_ut_142"
    },
    {
      "end": 4633966,
      "speaker": "Enrico Bertini",
      "start": 4633446,
      "text": "Bye bye.",
      "id": "ep_36_ut_143"
    },
    {
      "end": 4634318,
      "speaker": "Jer Thorp",
      "start": 4633998,
      "text": "Bye.",
      "id": "ep_36_ut_144"
    },
    {
      "end": 4635822,
      "speaker": "Moritz Stefaner",
      "start": 4634374,
      "text": "Great having you here. Bye.",
      "id": "ep_36_ut_145"
    },
    {
      "end": 4636446,
      "speaker": "Jer Thorp",
      "start": 4635886,
      "text": "Thanks. Bye.",
      "id": "ep_36_ut_146"
    }
  ],
  "confidence": 0.927392712175644,
  "audio_duration": 4643,
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_status_code": null,
  "webhook_auth": false,
  "webhook_auth_header_name": null,
  "speed_boost": false,
  "auto_highlights_result": null,
  "auto_highlights": false,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_audio_quality": null,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "content_safety": false,
  "iab_categories": true,
  "content_safety_labels": {
    "status": "unavailable",
    "results": [],
    "summary": {}
  },
  "language_detection": false,
  "language_detection_threshold": null,
  "language_confidence": null,
  "custom_spelling": null,
  "throttled": false,
  "auto_chapters": true,
  "summarization": false,
  "summary_type": null,
  "summary_model": null,
  "custom_topics": false,
  "topics": [],
  "speech_threshold": null,
  "speech_model": "best",
  "chapters": [
    {
      "summary": "Moritz: It's in the middle of summer and I have a cold. I forced everyone to use D3. To say that the result is amazing is amazing. Now it's more teaching, traveling, speaking, doing fun projects.",
      "gist": "German effect on d3",
      "headline": "Moritz: I have a cold and I'm preparing for summer",
      "start": 22360,
      "end": 151270,
      "id": "ep_36_ch_0"
    },
    {
      "summary": "There is a conference in Paris this year for the first time in Europe. I've been asked to advertise the art program. You can submit your art to this. We will post the URL in the. In our usual blog post.",
      "gist": "The Art Program at IEEE Visions 2014",
      "headline": "IEEE vis 2014 is taking place in Paris this year",
      "start": 154530,
      "end": 220130,
      "id": "ep_36_ch_1"
    },
    {
      "summary": "Our special guest today is Jared tortured. Finally, we have a real guest that is able to talk about art. We never had a guest who talked exclusively about art before. Or with such a strong bend towards art, which is really good.",
      "gist": "A Talk About Art With Jared tortured",
      "headline": "Finally, we have a real guest that is able to talk about art",
      "start": 220870,
      "end": 260080,
      "id": "ep_36_ch_2"
    },
    {
      "summary": "Jared Thorpe: I'm a co founder of a studio in New York City called the Office for Creative Research. He says he often calls himself a data artist just to be provocative. Thorpe says there are so many people against these artistic kind of things.",
      "gist": "In the Elevator With Data Artists",
      "headline": "Jeremy asks our guests to introduce themselves",
      "start": 261580,
      "end": 367414,
      "id": "ep_36_ch_3"
    },
    {
      "summary": "When I think about broadly data art, I don't really focus on visualization. I think that data art can be pretty visualization. There are many, many options there for an artist to connect with data.",
      "gist": "Does Data Art Be Art?",
      "headline": "Data art is art that engages with data in some way",
      "start": 367462,
      "end": 448350,
      "id": "ep_36_ch_4"
    },
    {
      "summary": "There's a lot of different pieces of our human engagement with data. Artists can get into those pieces in all kinds of different ways. In many ways, it's pretty fresh territory. There's so many answers to the question of what is data art?",
      "gist": "What is Data Art?",
      "headline": "Artists can get into data art in all kinds of different ways",
      "start": 449330,
      "end": 516048,
      "id": "ep_36_ch_5"
    },
    {
      "summary": "How do you teach data art? My class was broken into four sort of mini semesters. We talk about first, data and aesthetic, and then second, text and archive. And then fourth about ethics and responsibility and connection with humans. Teaching is like you try to bait as many hooks as you can.",
      "gist": "How do you teach data art?",
      "headline": "How do you teach data art? Where do you start from",
      "start": 516104,
      "end": 849996,
      "id": "ep_36_ch_6"
    },
    {
      "summary": "There was almost 80 projects in total. Students had three weeks to do the projects. At least one of the projects had to be a conceptual project. The course was taught using GitHub.",
      "gist": "The Data Visualization Class",
      "headline": "There were almost 80 projects in total during the course of the semester",
      "start": 850108,
      "end": 1164210,
      "id": "ep_36_ch_7"
    },
    {
      "summary": "Enrico: Do you actually teach them how to use the various tools that you need to build these visualizations or any kind of data art? He says the class is more about how to ask good questions and how to come up with good ideas and concepts. Are you being commissioned to do data art pieces?",
      "gist": "How does the Data Art course relate to your practice?",
      "headline": "Do you teach students how to use data tools for data art",
      "start": 1164750,
      "end": 1705130,
      "id": "ep_36_ch_8"
    },
    {
      "summary": "What is the difference between data art and data science? I think what art does is it negotiates and engages with that ambiguity in the middle between yes and no. The public, anyways, gets a kind of experience that's unique to them.",
      "gist": "What is the Difference Between Data Art and Data Science?",
      "headline": "What is the difference between data art and data science?",
      "start": 1705830,
      "end": 1831106,
      "id": "ep_36_ch_9"
    },
    {
      "summary": "In the end, the process is what, it's really the core part of visualization. And what really bugs me is the fact that people are not very easily exposed to these processes. How do you handle that in the R and D case?",
      "gist": "The Process of Data Visualization",
      "headline": "The process is the core part of visualization, right? Absolutely. And this idea that regardless what kind of output you generate",
      "start": 1831138,
      "end": 2340110,
      "id": "ep_36_ch_10"
    },
    {
      "summary": "One of my friends in Canada is an artist named Brian Jungen. His spatial sort of spatial design abilities are just unbelievable. And the precision in which all of its projects have to be designed and engineered. The rigor involved in a physical project is more than the rigor in any non physical, software based project.",
      "gist": "OCR and Brian Jungen",
      "headline": "One of my friends in Canada is an artist named Brian Jungen",
      "start": 2341410,
      "end": 2480520,
      "id": "ep_36_ch_11"
    },
    {
      "summary": "Do you think there will be a market for digital art? Will there be a high end gallery type world? Will be this the way data art goes, or is it more crowdfunded or collectives? What's your feeling?",
      "gist": "Will There Be a Market for Data Art?",
      "headline": "Do you think, like, besides direct commissions, there's a market for digital art",
      "start": 2480940,
      "end": 2535250,
      "id": "ep_36_ch_12"
    },
    {
      "summary": "The most interesting parts of data art are probably going to land in that second category. There are things that aren't necessarily objects, but at the same point, the ones that are objects. One type of art that I haven't seen developed much is data performers.",
      "gist": "What is Data Art?",
      "headline": "Naming what constitutes data art is kind of hard to define",
      "start": 2535590,
      "end": 2878800,
      "id": "ep_36_ch_13"
    },
    {
      "summary": "In the performance, a male actor reads all the males names in a. collection, and two female actors are reading the female names. It's a proof of concept that the data and performance can give us ways of engaging with data sets. In the spring of next year, the team will be doing open rehearsals in the MoMA galleries.",
      "gist": "The Data and Performance at MoMA",
      "headline": "There's one particular piece of the performance that has really been sitting with me",
      "start": 2879830,
      "end": 3305900,
      "id": "ep_36_ch_14"
    },
    {
      "summary": "We live in a world where these artificial distinctions between artists or anything. I think that these old artificial boundaries don't make any sense at all today. Being good at working across fields is about understanding your ignorance. And the most fruitful of those collaborations maybe comes with the humanities.",
      "gist": "The Need for Collaboration in the Humanities",
      "headline": "Being good at working across fields is about understanding your ignorance, you know",
      "start": 3306400,
      "end": 3484560,
      "id": "ep_36_ch_15"
    },
    {
      "summary": "Data is just a signal of something real. 90% of the really bad mistakes we make in engaging with data is by forgetting that. Sometimes you actually want to build out those layers so that people are more aware of the performance.",
      "gist": "In the Elevator With Data",
      "headline": "One thing that's easy to lose in big data hype is the fact that data",
      "start": 3485180,
      "end": 3990956,
      "id": "ep_36_ch_16"
    },
    {
      "summary": "That is science. Science itself is not, it's not necessarily the truth. It's just one way to look at some phenomenon or whatever. Great scientists and great artists have in common this kind of love of the unknowable. That understanding around science is also something relatively new.",
      "gist": "Philosophy of Science",
      "headline": "That is science. Right. Science itself is not, it's not necessarily the truth",
      "start": 3990988,
      "end": 4251684,
      "id": "ep_36_ch_17"
    },
    {
      "summary": "Tomorrow morning I'm getting on a plane to go to LA. And then after that, I'm going to Cocodri, Louisiana, where I'll get on a boat which is the mothership for a submersible called Alvin. Scientist wants to bring an artist in residence on board to help bridge the gap between science and art.",
      "gist": "Going to the Deep: Artist in Residence",
      "headline": "Your IO festival is coming up. What are you looking forward to",
      "start": 4251732,
      "end": 4616566,
      "id": "ep_36_ch_18"
    },
    {
      "summary": "Great having you on. I think we need to wrap it up. Otherwise, people. We could talk forever. That was super interesting. Thanks so much.",
      "gist": "Jerry on His Experience",
      "headline": "Great having you on. Great having you here. Thanks. I think we need to wrap it up. Otherwise, people. Yeah. Okay.",
      "start": 4616758,
      "end": 4636446,
      "id": "ep_36_ch_19"
    }
  ],
  "disfluencies": false,
  "entity_detection": false,
  "sentiment_analysis": false,
  "sentiment_analysis_results": null,
  "entities": null,
  "speakers_expected": null,
  "summary": null,
  "custom_topics_results": null,
  "is_deleted": null,
  "episode_num": "36",
  "episode_metadata": {
    "speakers": [
      "Enrico Bertini",
      "Moritz Stefaner",
      "Jer Thorp"
    ],
    "WPid": "184",
    "url": "https://datastori.es/podlove/file/396/s/feed/c/mp3/datastories-36.mp3",
    "episode_title": "Data Art w/ Jer Thorp"
  }
}