{
  "id": "53872b8e-4adb-4c28-8980-a7a2b0b2dcf8",
  "language_model": "assemblyai_default",
  "acoustic_model": "assemblyai_default",
  "language_code": "en_us",
  "status": "completed",
  "audio_url": "https://datastori.es/podlove/file/1696/s/feed/c/mp3/ds-65.mp3",
  "utterances": [
    {
      "end": 16750,
      "speaker": "Robert Kosara",
      "start": 240,
      "text": "I have to say that it's all about storytelling. And I think we've seen some really interesting news pieces. And there was also more interesting work in academia. I'm not going to call this the year of storytelling, but I think people are making progress and it's becoming a real topic.",
      "id": "ep_65_ut_0"
    },
    {
      "end": 28594,
      "speaker": "Andy Kirk",
      "start": 16862,
      "text": "There's a lot of examples of satellite imagery and drone footage as well. And I guess on the same issue of is it a gimmick or is it not? Is it lasting? From my perspective, I've seen a lot of mentions of the word virtual reality.",
      "id": "ep_65_ut_1"
    },
    {
      "end": 53154,
      "speaker": "Moritz Stefaner",
      "start": 30734,
      "text": "Data stories is brought to you by Qlik, who allows you to explore the hidden relationships within your data that lead to meaningful insights. Let your instincts lead the way to create personalized visualizations and dynamic dashboards with Qlik sense, which you can download for free at Qlik deries. That's q l I K. Deatastories.",
      "id": "ep_65_ut_2"
    },
    {
      "end": 69284,
      "speaker": "Enrico Bertini",
      "start": 63924,
      "text": "Hey, everyone. Data stories number 65. Hey, Moritz. How's it going?",
      "id": "ep_65_ut_3"
    },
    {
      "end": 70972,
      "speaker": "Moritz Stefaner",
      "start": 69364,
      "text": "Good. How are you, Enrico?",
      "id": "ep_65_ut_4"
    },
    {
      "end": 75468,
      "speaker": "Enrico Bertini",
      "start": 71148,
      "text": "I'm good, I'm good. We are at the end of the year. Finally, we made it.",
      "id": "ep_65_ut_5"
    },
    {
      "end": 76724,
      "speaker": "Moritz Stefaner",
      "start": 75556,
      "text": "Another year. Crazy.",
      "id": "ep_65_ut_6"
    },
    {
      "end": 97084,
      "speaker": "Enrico Bertini",
      "start": 76764,
      "text": "Another year. Crazy, crazy, crazy, crazy. So this episode is actually about what happened in 2015. It's our classic now year review. And we have two classic guests. Of course. We have Andy Kirk from visualizing data.",
      "id": "ep_65_ut_7"
    },
    {
      "end": 98316,
      "speaker": "Andy Kirk",
      "start": 97164,
      "text": "Good afternoon. Good evening.",
      "id": "ep_65_ut_8"
    },
    {
      "end": 99292,
      "speaker": "Enrico Bertini",
      "start": 98380,
      "text": "How are you, Andy?",
      "id": "ep_65_ut_9"
    },
    {
      "end": 100364,
      "speaker": "Andy Kirk",
      "start": 99388,
      "text": "I'm good, thank you.",
      "id": "ep_65_ut_10"
    },
    {
      "end": 105196,
      "speaker": "Enrico Bertini",
      "start": 100484,
      "text": "And we have, of course, Robert Kosara from Tableau Software. Hey, Robert.",
      "id": "ep_65_ut_11"
    },
    {
      "end": 107144,
      "speaker": "Robert Kosara",
      "start": 105220,
      "text": "Hi. Good morning. It's really early here.",
      "id": "ep_65_ut_12"
    },
    {
      "end": 109504,
      "speaker": "Enrico Bertini",
      "start": 108444,
      "text": "How's it going?",
      "id": "ep_65_ut_13"
    },
    {
      "end": 111772,
      "speaker": "Robert Kosara",
      "start": 110284,
      "text": "Great, thank you. How are you doing?",
      "id": "ep_65_ut_14"
    },
    {
      "end": 113124,
      "speaker": "Enrico Bertini",
      "start": 111868,
      "text": "I'm good, I'm good, I'm good.",
      "id": "ep_65_ut_15"
    },
    {
      "end": 113984,
      "speaker": "Robert Kosara",
      "start": 113164,
      "text": "Very good.",
      "id": "ep_65_ut_16"
    },
    {
      "end": 139712,
      "speaker": "Enrico Bertini",
      "start": 114744,
      "text": "So, as usual, we want to go through what happened, the main highlights of 2015. And I guess we want to start by talking a little bit about data stories. So it looks like 2015 has been our most prolific year ever, with a total of 22 episodes, including this one. So, Moritz, nice one. Not bad.",
      "id": "ep_65_ut_17"
    },
    {
      "end": 161382,
      "speaker": "Moritz Stefaner",
      "start": 139808,
      "text": "We're now in the quantity business. Very good. No, it's been great. We really good. We finally have a good rhythm, I think. And that's also because we have some great help from destry, who is also now listening and helping us with the chaptering, and Florian, who is doing the audio production. So it's really great to have some help. And I think it shows a bit.",
      "id": "ep_65_ut_18"
    },
    {
      "end": 172396,
      "speaker": "Enrico Bertini",
      "start": 161438,
      "text": "Yeah, thanks, Destry and Florian, it's a lot of help from your side. And of course, we also want to thank our sponsors, who've been supporting us throughout the whole year. Thanks.",
      "id": "ep_65_ut_19"
    },
    {
      "end": 173260,
      "speaker": "Robert Kosara",
      "start": 172500,
      "text": "Yeah.",
      "id": "ep_65_ut_20"
    },
    {
      "end": 180384,
      "speaker": "Enrico Bertini",
      "start": 173452,
      "text": "And what else? We have to thank our guests, of course. We had 22 guests or maybe even more. Did we have.",
      "id": "ep_65_ut_21"
    },
    {
      "end": 181812,
      "speaker": "Moritz Stefaner",
      "start": 180764,
      "text": "Actually. Yeah.",
      "id": "ep_65_ut_22"
    },
    {
      "end": 182460,
      "speaker": "Enrico Bertini",
      "start": 181948,
      "text": "Who knows?",
      "id": "ep_65_ut_23"
    },
    {
      "end": 194204,
      "speaker": "Moritz Stefaner",
      "start": 182492,
      "text": "We need to count. That's great. Guests this year. We also want to thank visualized for hosting a meetup that was really good. So we had the chance to meet a few people face to face, a few listeners, and it was great fun.",
      "id": "ep_65_ut_24"
    },
    {
      "end": 200596,
      "speaker": "Enrico Bertini",
      "start": 194364,
      "text": "Yeah. And what else? Of course, we have to thank our listeners. So thanks for listening to us.",
      "id": "ep_65_ut_25"
    },
    {
      "end": 201124,
      "speaker": "Moritz Stefaner",
      "start": 200660,
      "text": "That's you.",
      "id": "ep_65_ut_26"
    },
    {
      "end": 209730,
      "speaker": "Enrico Bertini",
      "start": 201164,
      "text": "And that's you. So. And Moritz, you wanted to mention the top episodes of the year.",
      "id": "ep_65_ut_27"
    },
    {
      "end": 252852,
      "speaker": "Moritz Stefaner",
      "start": 209842,
      "text": "Yeah, if you're interested. So the most downloaded episodes this year were, number one, Amanda Cox on her work with the New York Times and working with R. And it's been. Yeah, Amanda is just fantastic. If you haven't listened to this one, definitely download it. On place two, we have science communication with Jen Christensen, she's art director at Scientific American. Was a fantastic episode as well. And the third one was on visualizing human development with Max Rose. So he runs our world in data grade site about world statistics. So these are three really, really good episodes. And these were the most popular ones this year.",
      "id": "ep_65_ut_28"
    },
    {
      "end": 270664,
      "speaker": "Enrico Bertini",
      "start": 252988,
      "text": "Yeah. So if you didn't listen to them or you are new to our podcast, that's a very good place to start. Okay, so, guys, we have a long list. We want to start with the major trends of 2015. Andy, you want to start?",
      "id": "ep_65_ut_29"
    },
    {
      "end": 346604,
      "speaker": "Andy Kirk",
      "start": 271724,
      "text": "Well, the first one that I've got on my list today is discuss the emergence this year, in particular of catagram techniques, hexagon bin maps, grid maps. There's a lot of different terms applied to them, but certainly around, from my perspective in the UK, certainly around the time of May, when the UK elections were taking place, there was just an explosion of coverage. So a lot of the media over here in particular, we're starting to use this kind of constituency map of the UK, broken down to squares, or hexagons, as an alternative way to show the composition of the political voting system in the UK. And it just seems to be a very popular approach. I think the most standout example was the BBC did a huge outdoor, almost jigsaw puzzle based on these hexagons forming the different seats in the elections. And that was a live, updated thing that they were doing throughout the course of the evening. So, I mean, over your side of the pond as well, there's been plenty of discussions around what is the correct composition of the states of the US, how do you fit in Hawaii and Alaska and where neighboring states should be, but it seems to be the year where this has really kind of hit the airways quite consistently nice.",
      "id": "ep_65_ut_30"
    },
    {
      "end": 351752,
      "speaker": "Enrico Bertini",
      "start": 346984,
      "text": "Robert, what's your major trend of 2015?",
      "id": "ep_65_ut_31"
    },
    {
      "end": 403440,
      "speaker": "Robert Kosara",
      "start": 351928,
      "text": "Well, I have to say that it's all about storytelling, and I think we've seen some really interesting news pieces. Like I think that was this year, that was the hottest year on record by Bloomberg. They did a really good job there. There were actually several around global warming that were really good, that were actual stories. And there was also more interesting work in academia that was looking at that. So there were a number of papers at the Viz conference and at Eurovis and at CHI's that all looked at different aspects, different techniques that people use for that, trying to find out how memorable visualizations are and so on. And I think that there was some really good work this year in this area. So I'm not going to call this the year of storytelling, but I think people are making progress and it's becoming a real topic that people are really working on in all areas.",
      "id": "ep_65_ut_32"
    },
    {
      "end": 411328,
      "speaker": "Moritz Stefaner",
      "start": 403552,
      "text": "Yeah. And people definitely go beyond simple steppers or long scrolling sites by now. So I think that's a good thing.",
      "id": "ep_65_ut_33"
    },
    {
      "end": 423150,
      "speaker": "Andy Kirk",
      "start": 411456,
      "text": "And I think it's also many. It's a wider base of media organizations. It's not just the classic two or three, it's a dozen or so that you can think are very prominent in this space right now. So it's definitely a trend.",
      "id": "ep_65_ut_34"
    },
    {
      "end": 442504,
      "speaker": "Moritz Stefaner",
      "start": 423222,
      "text": "Maybe that's generally true that data journalism has improved quite a bit, especially in this sort of mid zone, like, not the really big players. I think they keep delivering really high quality. But I can say in Germany we have seen a lot of really, really good work, also from a couple of previously unknown places. So that's really nice to say. Enrico, how about you?",
      "id": "ep_65_ut_35"
    },
    {
      "end": 483544,
      "speaker": "Enrico Bertini",
      "start": 442884,
      "text": "Well, I have at least a couple of trends to mention. The first one, I think we have seen a lot of visualization applied to machine learning or using machine learning for visualization, also some image processing. So a lot of kind of computational approaches or using visualization to better understand these approaches. So I remember, I think there was, what, a deep dream from the Google team on visualizing what a neural network sees. It was pretty spooky. So if you haven't seen it, it's like having images full of eyes and, yeah, disgusting stuff. But there are some serious developments.",
      "id": "ep_65_ut_36"
    },
    {
      "end": 487084,
      "speaker": "Moritz Stefaner",
      "start": 483584,
      "text": "In hindsight, it was a pretty bizarre period of our lives.",
      "id": "ep_65_ut_37"
    },
    {
      "end": 489724,
      "speaker": "Andy Kirk",
      "start": 488504,
      "text": "Was it a dream?",
      "id": "ep_65_ut_38"
    },
    {
      "end": 492376,
      "speaker": "Enrico Bertini",
      "start": 490264,
      "text": "Yeah, exactly. But I think maybe there was some.",
      "id": "ep_65_ut_39"
    },
    {
      "end": 494124,
      "speaker": "Moritz Stefaner",
      "start": 492400,
      "text": "Lsd in the water.",
      "id": "ep_65_ut_40"
    },
    {
      "end": 512002,
      "speaker": "Enrico Bertini",
      "start": 494944,
      "text": "So yeah, neural networks are full of lsd and. Yeah, so I think that's definitely one of the most interesting trends. And I would love to see more visualization, people collaborating with machine learning people to do things even better. Right.",
      "id": "ep_65_ut_41"
    },
    {
      "end": 519370,
      "speaker": "Moritz Stefaner",
      "start": 512098,
      "text": "Machine learning and AI have been huge this year. I want to know how it plays out next year, if it's more like a hype or if it's something specific.",
      "id": "ep_65_ut_42"
    },
    {
      "end": 522426,
      "speaker": "Enrico Bertini",
      "start": 519402,
      "text": "I don't think so. Yeah, I think it's going to stay.",
      "id": "ep_65_ut_43"
    },
    {
      "end": 524054,
      "speaker": "Moritz Stefaner",
      "start": 522610,
      "text": "You drank the kool aid.",
      "id": "ep_65_ut_44"
    },
    {
      "end": 525534,
      "speaker": "Enrico Bertini",
      "start": 524594,
      "text": "I did.",
      "id": "ep_65_ut_45"
    },
    {
      "end": 536194,
      "speaker": "Moritz Stefaner",
      "start": 525834,
      "text": "You mentioned image processing. I think that was very interesting, that a lot of work referred to images, like combining photography or taking lots of photos. I'm not.",
      "id": "ep_65_ut_46"
    },
    {
      "end": 539118,
      "speaker": "Enrico Bertini",
      "start": 536574,
      "text": "That's your work. I'm a bit guilty in this area.",
      "id": "ep_65_ut_47"
    },
    {
      "end": 557310,
      "speaker": "Moritz Stefaner",
      "start": 539166,
      "text": "Too, but also working with videos, or taking images as material, or synthesizing images, like this whole relation of photography and videography and data visualization has become very interesting, and I'm looking forward to next year. I know there's a book coming out.",
      "id": "ep_65_ut_48"
    },
    {
      "end": 575900,
      "speaker": "Andy Kirk",
      "start": 557342,
      "text": "On that, lot of examples of satellite imagery and drone footage as well, which I've seen a lot been used. And I guess on the same issue of is it a gimmick or is it not? Is it lasting? From my perspective, I've seen a lot of mentions of the word virtual reality.",
      "id": "ep_65_ut_49"
    },
    {
      "end": 576500,
      "speaker": "Robert Kosara",
      "start": 576052,
      "text": "Oh, yeah.",
      "id": "ep_65_ut_50"
    },
    {
      "end": 600298,
      "speaker": "Andy Kirk",
      "start": 576532,
      "text": "Over the last six months. And I know that in the States, you guys had access to the cardboard viewer that the New York Times sent out. I think, was it to a million households or something like that? But I've not actually explored it other than within the desktop browser. But what do you guys think about the nature of that? Is it something here for long term, or is it just a passing gimmick?",
      "id": "ep_65_ut_51"
    },
    {
      "end": 671824,
      "speaker": "Enrico Bertini",
      "start": 600466,
      "text": "I think we have to see. It's definitely an initial trend that we are seeing there. Experimentation, I think. Yeah, it needs a lot of experimentation. I guess. From the academic side, there has been a very long history of criticism of 3d representations. Right. And I'm pretty sure it's somewhat unjustified under certain conditions, and it's an area that needs to be explored a little more. I think that once VR viewers are much more affordable as they are now, people will start exploring much more. So this year, I've been visiting NASA in. When was that? In April. And I've been expecting. They showed me a VR system where you can actually see abstract data, infovis data, kind of like 3d scatter plot of some sort. I don't think they are effective at all, but I have to say I think there is definitely space for experimentation. Right. And yeah, I'm curious to see what is gonna happen in 2016.",
      "id": "ep_65_ut_52"
    },
    {
      "end": 691658,
      "speaker": "Moritz Stefaner",
      "start": 672124,
      "text": "I put my money on augmented reality. Nobody talks about it right now, but it's been huge, like five years ago, and it makes much more sense, honestly, because VR by definition captures all of your attention and all of your visual space. And I think with mobile devices, augmented reality image makes much more sense. But, yeah, we'll see.",
      "id": "ep_65_ut_53"
    },
    {
      "end": 725026,
      "speaker": "Robert Kosara",
      "start": 691786,
      "text": "Well, it was done in these very kind of low impact ways. Like Yelp had this thing where you could hold up your phone and it would show you the locations of the restaurants that you were looking for, like overlaid on a map and things like that. So I agree with that. Yeah. I'm not clear on where we are is going. There's obviously games and then what the New York Times has done is these kind of immersive experiences to show you, to kind of give you a sense of a place, 360 video and so on. Right. But for data visualization, I'm not sure if this is going to go anywhere, but, yeah, we'll see. We'll keep watching that for sure.",
      "id": "ep_65_ut_54"
    },
    {
      "end": 734394,
      "speaker": "Enrico Bertini",
      "start": 725170,
      "text": "Yeah, I agree. And from my side, I think another trend is that we have seen a lot of new data related podcasts. So that's an interesting trend.",
      "id": "ep_65_ut_55"
    },
    {
      "end": 736654,
      "speaker": "Robert Kosara",
      "start": 734734,
      "text": "Competition rivals.",
      "id": "ep_65_ut_56"
    },
    {
      "end": 754514,
      "speaker": "Enrico Bertini",
      "start": 736814,
      "text": "Yeah, well, I think it's breathing down our necks. There are quite a few ones, and some of them are really successful. So that's great. I think the more the better. Yeah. And Andy, you wanted to mention something about mobile based mobile devices.",
      "id": "ep_65_ut_57"
    },
    {
      "end": 827238,
      "speaker": "Andy Kirk",
      "start": 755094,
      "text": "I guess it's a sense that there's still certain tension between whether in visualization itself, there is mobile first or desktop first and mobile second. I mean, certainly for a lot of the news organizations, I sense that they're rationalizing that because of the traffic coming from mobile, that's kind of where their perhaps first priority is. But clearly, the limitations of space of a smartphone screen, for example, means that there's a certain lack of, you know, scope for some of these bigger projects. And I was really struck by a comment, this is actually more than a year ago from Scott Klein of ProPublica, who talked about their strategy being actually desktop first. I'm kind of paraphrasing here, but desktop first. And then the compromise for mobile was simplify or smallify. And I thought that's quite a nice little rule of thumb to get a sense of how they find a way to fit things on that smaller, smaller screen. So it's more of a, it's kind of a, once again, it's kind of a watch this space. But it'd be interesting to see where, if there's a fork in the road that news organizations take and others take or don't have that kind of tension with the need to tap into where visitors are arriving from.",
      "id": "ep_65_ut_58"
    },
    {
      "end": 847330,
      "speaker": "Moritz Stefaner",
      "start": 827406,
      "text": "Yeah. But from my view, it has become much more normal to start mobile first or to be fully responsive. At least I think that's something that's. This year. Yeah, it has entered normalcy, for sure. Yeah. Yeah. Moving on. What were the big issues and debates this year? What do you recall?",
      "id": "ep_65_ut_59"
    },
    {
      "end": 848674,
      "speaker": "Enrico Bertini",
      "start": 847442,
      "text": "We had a few ones.",
      "id": "ep_65_ut_60"
    },
    {
      "end": 853774,
      "speaker": "Moritz Stefaner",
      "start": 848794,
      "text": "We had a few ones. Of course, the visualization community is not shy of opinions, as we all know.",
      "id": "ep_65_ut_61"
    },
    {
      "end": 855934,
      "speaker": "Andy Kirk",
      "start": 854154,
      "text": "Not shy of the same opinions.",
      "id": "ep_65_ut_62"
    },
    {
      "end": 870694,
      "speaker": "Moritz Stefaner",
      "start": 857034,
      "text": "I remember one early this year about visualization ethics. It touched on, can we make beautiful visualizations of horrible events? In short, what's your take on this one?",
      "id": "ep_65_ut_63"
    },
    {
      "end": 976474,
      "speaker": "Andy Kirk",
      "start": 871424,
      "text": "So I didn't like this article. I didn't like the kind of discussion around this article. So this was about a piece of work done by. I think it was actually a British graphic designer, a student, actually. Yeah. Visualizing some of the issues around Hiroshima. And I recall there were a few people on Twitter who said, you know, this is a really not just disrespectful way to show it, but, you know, a really kind of misjudged and ill judged way of showing death and people. And it was an article written in fastcore design, which kind of. Which felt very one sided because it kind of fell behind some prominent names who had said that this wasn't a particularly good piece of work. And actually, it was more than not a good piece of work. And actually, it was a wrong approach. But the designer himself wasn't necessarily offer the chance to kind of respond and to kind of take part in a discussion. It was very one sided. And I think in a broader sense, and I was actually reflecting this, looking at my teaching material, slide deck. And there's so much of my set of examples that involve projects about death. It's quite a morose slide deck, actually. But it's a very difficult matter because obviously, so many of the subjects on which we have data and that are being reported now, whether it's terrorism related deaths or gun crimes, have to visualize the victims and the people. And whether that's a pixel per person or whether it's a person per person, it's a very difficult match. And I don't think it's really easy for us to judge a piece of work in the wild without knowing the context and the motives behind that single piece of work.",
      "id": "ep_65_ut_64"
    },
    {
      "end": 1019966,
      "speaker": "Moritz Stefaner",
      "start": 977774,
      "text": "I think it turned out as a bit of a witch hunt, but that also meant, I think, that for many people, it was like a burning issue in some way. And yeah, this guy was just pretty unfortunate to be at the wrong spot at the wrong time and. Yeah, but is it worthwhile? It's one of the big tensions. Like how do you talk about these bad issues with statistics, which is horrible already, and then with data visualization and design? That's, there is a big tension there. There was a great article, I think, by Hannah Fairfield. I'll have to find the reference on how you can maybe tackle that problem and a few strategies to go beyond just counting dead bodies, basically, and presenting like averages of discounted.",
      "id": "ep_65_ut_65"
    },
    {
      "end": 1023774,
      "speaker": "Andy Kirk",
      "start": 1020030,
      "text": "There's a great article as well by Sarah Sloeben of the Wall Street Journal.",
      "id": "ep_65_ut_66"
    },
    {
      "end": 1024574,
      "speaker": "Moritz Stefaner",
      "start": 1023854,
      "text": "That was it.",
      "id": "ep_65_ut_67"
    },
    {
      "end": 1032542,
      "speaker": "Andy Kirk",
      "start": 1024654,
      "text": "That's right. Yes, that's the one. Visualization is people. I think it was title or something, we'll have to find out for the post, but yeah, and I think that.",
      "id": "ep_65_ut_68"
    },
    {
      "end": 1084774,
      "speaker": "Moritz Stefaner",
      "start": 1032598,
      "text": "Touches on another debate we had, and one from early this year. And it's about the tone and the whole style of criticism and data visualization, as we all know. So it can be sometimes the community is nice, but sometimes they are like stormy weather sometimes. And Fernandez Viegas and Martin Wattenberg wrote a really nice and very considerate article on how we can maybe take better care of our criticism culture and our design and redesign culture and data visualization. And they put it up on medium. It was written for the Malofiej proceedings, I think, or the conference proceedings, more or less, but they put it up on the web, and I think it's a great article and would be great if we all read it every two weeks and just stick to the recommendations.",
      "id": "ep_65_ut_69"
    },
    {
      "end": 1091254,
      "speaker": "Enrico Bertini",
      "start": 1087714,
      "text": "Yeah, there have been quite a few ones.",
      "id": "ep_65_ut_70"
    },
    {
      "end": 1148844,
      "speaker": "Andy Kirk",
      "start": 1092474,
      "text": "I mean, I think on the same note, I mean, obviously we have to acknowledge the presence of the Stephen Few article when he took exception to the invitation by Alberto Cairo to David McCandless to speak. I think it was the University of Miami. And actually, it's not so much the contents of the debate, but what was very interesting was just the sheer amount of comments that were triggered by this. And I guess it kind of, for me, it snapped me out of the complacency that suggested that these discussions were in the past. Now it's clearly not. They were just kind of in the shadows, and all it needs is one little spark and things come back to the surface. But we still exist in a field that has that separation between the purist, dogmatic rule makers and followers and those that see a more flexible and pragmatic approach. And I think the bottom line is that everyone's right, but in different circumstances.",
      "id": "ep_65_ut_71"
    },
    {
      "end": 1157444,
      "speaker": "Enrico Bertini",
      "start": 1150624,
      "text": "Come on, Andy, everybody's a winner. Let's shake our hands.",
      "id": "ep_65_ut_72"
    },
    {
      "end": 1184064,
      "speaker": "Moritz Stefaner",
      "start": 1158744,
      "text": "No, but I think it's interesting because in this, this debate as well as the ethics one, I think it shows that there is a couple of people really frustrated with. That's my reading at least, that some people are just frustrated that people get attention for doing data with wrong or doing it the wrong way and they get all the fame and we are doing it right and nobody cares about us. So there seems to be some tension there still.",
      "id": "ep_65_ut_73"
    },
    {
      "end": 1193258,
      "speaker": "Enrico Bertini",
      "start": 1184184,
      "text": "You know, I see that as a flu from time to time there you have a few spikes. People get very. Yeah, I don't know. There are lots of people.",
      "id": "ep_65_ut_74"
    },
    {
      "end": 1198754,
      "speaker": "Moritz Stefaner",
      "start": 1193266,
      "text": "I just got into a Twitter file yesterday on data art. I should know better. I should know better, but I can't.",
      "id": "ep_65_ut_75"
    },
    {
      "end": 1199330,
      "speaker": "Enrico Bertini",
      "start": 1198874,
      "text": "I don't know.",
      "id": "ep_65_ut_76"
    },
    {
      "end": 1201834,
      "speaker": "Moritz Stefaner",
      "start": 1199362,
      "text": "Somebody's wrong on the Internet. Somebody's wrong on the Internet.",
      "id": "ep_65_ut_77"
    },
    {
      "end": 1205250,
      "speaker": "Enrico Bertini",
      "start": 1201874,
      "text": "Is it useful? I'm not sure. I'm not sure. Let's do work. It's much more.",
      "id": "ep_65_ut_78"
    },
    {
      "end": 1206298,
      "speaker": "Moritz Stefaner",
      "start": 1205282,
      "text": "Can we move on?",
      "id": "ep_65_ut_79"
    },
    {
      "end": 1207618,
      "speaker": "Enrico Bertini",
      "start": 1206466,
      "text": "Let's move on.",
      "id": "ep_65_ut_80"
    },
    {
      "end": 1345480,
      "speaker": "Robert Kosara",
      "start": 1207786,
      "text": "So speaking of Steven Feuden, I guess the other one that just came up about a week ago, maybe two weeks ago, is Stephen Fus criticism of data visualization research in general and a particular paper by Michelle Borkin and others on memorability. And that has sparked quite a discussion, too, though it's in kind of a hidden place because this was in Steven's newsletter that he sends out. And so it's not on his blog. And there is a separate forum, which I didn't even know about, that people have been posting in, and that's gotten some responses from people like Jeff Heer and Charle, Danielle Fiquette and others. And what happens is that Steve was criticizing this paper and he's going into some depth on that. And I'm not going to go through all the points here because it's way too long. But he also really attacks Michelle very directly and saying, well, she doesn't know the scientific process and she doesn't know how to do this kind of research. He calls visualization in general a pseudoscience. And so the problem with that is that he's also kind of right because it's not a hard science, of course, and there are some issues with that particular paper, but he's just going way overboard and he's just criticizing a lot of things there. And the discussion is trying to stay on track, but it's also hard because people then get very technical and it turns into this little, did I say this or did I say that? And what do you mean with this? So it gets kind of tedious, but I guess it's useful as a criticism, but it's also important to be reasonable and not try and just kind of insist on you being right and just kind of keep pounding on the same points. So I think it's, in the end, in a year it's going to be fine. But right now it's a bit of a difficult debate and somewhat annoying debate because it's coming from a place of disdain and a bit of a lack of respect for the work that was done there.",
      "id": "ep_65_ut_81"
    },
    {
      "end": 1372624,
      "speaker": "Moritz Stefaner",
      "start": 1345672,
      "text": "I think some reality check is fine. And, I mean, there is a danger, I think, in a successful field that you might just think everything's great, we are doing the right thing here. We're being successful is great, but I think at the same time, it's such a heterogeneous field. I'm still. I'm a bit confused that people can't accept that, that, well, this field is made up out of ten different subfields, you know, and there's all kinds of styles and schools and let's call it, let's all get along, let's have a good time.",
      "id": "ep_65_ut_82"
    },
    {
      "end": 1376224,
      "speaker": "Enrico Bertini",
      "start": 1374444,
      "text": "Let's get a beer all together.",
      "id": "ep_65_ut_83"
    },
    {
      "end": 1377864,
      "speaker": "Moritz Stefaner",
      "start": 1376644,
      "text": "Is it so hard?",
      "id": "ep_65_ut_84"
    },
    {
      "end": 1379372,
      "speaker": "Enrico Bertini",
      "start": 1378404,
      "text": "Whatever.",
      "id": "ep_65_ut_85"
    },
    {
      "end": 1380596,
      "speaker": "Moritz Stefaner",
      "start": 1379548,
      "text": "Can we move on?",
      "id": "ep_65_ut_86"
    },
    {
      "end": 1383302,
      "speaker": "Enrico Bertini",
      "start": 1380700,
      "text": "Yeah. Yeah, yeah, yeah, yeah.",
      "id": "ep_65_ut_87"
    },
    {
      "end": 1386094,
      "speaker": "Moritz Stefaner",
      "start": 1383398,
      "text": "Best project of the year award, officially.",
      "id": "ep_65_ut_88"
    },
    {
      "end": 1386806,
      "speaker": "Enrico Bertini",
      "start": 1386134,
      "text": "Yeah, yeah.",
      "id": "ep_65_ut_89"
    },
    {
      "end": 1387982,
      "speaker": "Moritz Stefaner",
      "start": 1386870,
      "text": "What were your favorites?",
      "id": "ep_65_ut_90"
    },
    {
      "end": 1500284,
      "speaker": "Andy Kirk",
      "start": 1388078,
      "text": "Well, I'll just kick off this. I think most. This first one will speak on behalf of all of us, really. Dear data, I know you had Georgia and Stephanie on episode two episodes back, but. Yeah, I mean, I won't go over the details, but 52 weeks data postcards, primary data on unique subjects related to each other's lives. And it was, you know, just a really terrific kind of artisan project that was universally popular. And we all look forward to the book next year about the project. Just two or three from me, I think very quickly there was a fantastic piece by Bloomberg looking at the pace of social change, and it just kind of plotted the evolution of the kind of legislation and legalization of different social issues like gay marriage and interracial marriage and all these kind of things. And it just was a very simple design, but showed the kind of cumulative story of states legalizing these things year by year. And you could just see the essence of storytelling in the single chart. So that was a great one. Another one for me, which I only kind of spotted last week, but 100 years of tax brackets by Vox.com comma, which was terrific. A visual display of all the different complicated and less so tax bracket thresholds in the US over 100 years. The real essence of visualization in my mind. You can see the data. And I guess if I was going to flip a coin, the other one I would pick would be work. I think it was largely by Gregor, and I might be doing a disservice to others involved, but draw how family income affects children's college chances. So this was a chance, a chance for you to kind of participate. Draw a line chart as you see the distribution going, and it kind of gave you the actual answer, and it built up a map of how everyone's guesses had built up over time. So that was a really terrific way to not just interact, but participate it.",
      "id": "ep_65_ut_91"
    },
    {
      "end": 1573324,
      "speaker": "Enrico Bertini",
      "start": 1501744,
      "text": "Great. So I have a couple of projects from my side very quickly. I already mentioned neural network stuff. There were a couple of projects. One is called inceptionism, going deeper into neural networks, and the other one, very similar, understanding neural networks through deep visualization. So, I mean, it's basically what I just mentioned at the beginning, using visualization to see what a neural network sees. And another one that I would quickly want to mention is the one that we is another one from Bloomberg called what's really warm in the world, which actually we featured in our podcast on data stories. So if you haven't listened to this episode, I suggest you to go there and listen to what they have done and why and how. So it's mostly a visualization of showing predictions on what's warming the world based on a number of models generated by international groups of climate scientists. So I found that those one, that one, very well done, very well crafted, very simple, actually, but impactful.",
      "id": "ep_65_ut_92"
    },
    {
      "end": 1667830,
      "speaker": "Moritz Stefaner",
      "start": 1573444,
      "text": "Yeah, yeah, great stuff, really. I mean, for me, it were more the new format. So I'm now always looking for new types of contents, new types of narrative structures. What I really liked was network effects by Jonathan Harris and Greg Hochmut. They compiled a really big collection of videos and images and data around people's activities around the world. So basically, it's a lot of verbs, like what people do all the time and all the variations of how they do it and how long they have been doing it, according to Google book search and so on. And the site is a very intense bombardment of information. Yeah, exactly. And so that's good. I also like the Seagull Skytrails project. And there were a couple of these projects playing with long exposure overlaying, as I said, like playing with video. This one is a really nice one, shows the flight paths of birds with different video tricks and so on. And the last one I just ran across today, it's brilliant. And I wonder why nobody has thought of that before, but it's a visualization by the New York Times about the interest rates. Like, super boring topic, but they built a Rube Goldberg machine, like a real physical setup where you start at one point, something falls over, hits the next thing, ball rolls down and so on, to explain how complex this, like changing the interest rate, what avalanche of effects that puts into play. And I think that was so. That's just brilliant.",
      "id": "ep_65_ut_93"
    },
    {
      "end": 1669434,
      "speaker": "Andy Kirk",
      "start": 1667942,
      "text": "It should have been a bar chart.",
      "id": "ep_65_ut_94"
    },
    {
      "end": 1670590,
      "speaker": "Enrico Bertini",
      "start": 1670214,
      "text": "Yeah.",
      "id": "ep_65_ut_95"
    },
    {
      "end": 1682950,
      "speaker": "Moritz Stefaner",
      "start": 1670622,
      "text": "It's like, man, I can't read any data yet. Boring. No, it's just so good. And these things, they, they stay in mind and they really give people new ways of thinking, and I love that about that. Yeah.",
      "id": "ep_65_ut_96"
    },
    {
      "end": 1699358,
      "speaker": "Enrico Bertini",
      "start": 1683102,
      "text": "Nice. So Robert, you want to mention some research? Academic developments happened in 2015. I know we mentioned some of them during our episodes, our this conference episode, but I'm pretty sure you want to mention some others as well.",
      "id": "ep_65_ut_97"
    },
    {
      "end": 1924618,
      "speaker": "Robert Kosara",
      "start": 1699526,
      "text": "Yes, for sure. So there are a number really interesting papers that were published this year. So the, to start off, of course, course, some of my own papers. So we had this paper at the ChI conference on the isotype, which is this technique that was developed in the 1920s that uses little icons that stack up to become bars. And we did some work on that and showed how it works pretty well, actually. And you would think that it's all chart chunk, but it really isn't. It actually works pretty well for memory, and it doesn't get in the way. There's another paper that's coming out that's not technically out yet, but it's already pre published, that is on the technique called the Connected Scatterplot, which is basically just scatterplot that you connect the points in when there's time between them. And that is also really interesting because it gives you a way to tie annotations to that and tell a little bit of a story about data through that. And then the last one, and then I'm going to talk about other people. But my student Bruce Kao had a paper at Euroviz that was about bar chart embellishments, which are very common in infographics where people make charts that are basically bars but that have little things on them, like, for example, flags or kind of shapes like trees and so on. And we looked at what the impact was of those, and of course, we mostly found that they are bad for proper reading and precise reading of the data. But we also found that some of them can actually help, like when there is a horizontal bar or kind of end thing at the top that actually makes it easier to read the precise numbers so it can be. It's not just that everything's bad that you do to a bar chart. And then Enrico had, and one of Enrico's students and I guess a few other people had a very interesting paper at CHI's on deceiving visualization and how to things that you would expect to be deceiving, like when your baseline isn't zero for a bar chart or when you do things to area charts and so on, how those are really being read the wrong way. And I thought this was really interesting because it put some science behind what people talk about, which is, oh yeah, of course you can deceive visualization and of course it's wrong to have a bar chart that doesn't start at zero, but now we have actual science that actually shows that. So I think this was really good. This was really interesting. And I already mentioned Michelle Borkins paper at this. There were a few other papers that were a bit more in that area that kind of looked into things that are related to what you could call storytelling. So techniques that are a bit more oriented at presentation, but a particular one, that one working and others on memorability was really interesting because it really delved very deep into this question of what makes visualization memorable. And looked at eye tracking data and other things to figure out what do people actually remember. And what they found is that people actually remember a lot of text around the visualization. So they remember the captions, they remember the title, they remember the text descriptions before they actually remember the data, which is interesting because text gets ignored most of the time. So that was interesting to see that they really found that. And there are a few others, but I can't think of a particular one to point out right now. But there were a few papers that were quite interesting around that. So I think there was some really good work in the academic community. And there's more stuff coming next year, some of the stuff that I'm doing and I know other people are working on. So I'm seeing this as being a real thing now that's happening in visualization and in academia.",
      "id": "ep_65_ut_98"
    },
    {
      "end": 1948926,
      "speaker": "Enrico Bertini",
      "start": 1924786,
      "text": "Yeah, I'm pretty sure, Robert, that we will see even more next year. That's clearly a big trend going on. Andy, how about the literacy stuff? Last year we've been mentioning a little bit what was going on in literacy. I didn't do more research in this area myself, but I know that you are doing something. So what is going on there?",
      "id": "ep_65_ut_99"
    },
    {
      "end": 2042124,
      "speaker": "Andy Kirk",
      "start": 1949110,
      "text": "Yeah, so this was something that was being run most of this year, but all of last year, a project called seeing data. And in a nutshell, we've been looking at the, the perspective of readers, consumers, users, however you want to label those people and what kind of human factors, you know, this is proper pseudoscience stuff. What kind of factors really kind of help and aid or hinder the process of everyday people, which is once again a horrible term. But everyday people are not visualization experts, shall we say, from getting the most out of visualizations. And what kind of factors can they express in their remarks about the experiences that they went through? What things did they like, what things did they learn, what things they cause them problems. And so, you know, we have been looking at the more kind of qualitative side of things, looking at the issues of things like subject matter, time and pressure that you're faced with to engage with something, confidence and familiarity with chart types, emotions, all these kind of things. So there is, you know, there's a lot to it that we've started sharing a few posts on my website. We've done two of the three high level write ups of some of the kind of key things that we found, but it's actually started the conversation rather than ended it by any stretch of the imagination. Just gives us a sense of what kind of things we might look to do in a second round of research going forward with hopefully what will be a larger study and much more diverse set of visualizations. And indeed people.",
      "id": "ep_65_ut_100"
    },
    {
      "end": 2064340,
      "speaker": "Enrico Bertini",
      "start": 2042484,
      "text": "Yeah. So actually this reminded me that there was a paper at Viz this year on how people learn to read visualizations. I think this was from, I think I remember, it's at least ID Lam and Jisoo Yee and probably other people. I'm sorry, I don't remember their name. Robert, do you remember there? Who else?",
      "id": "ep_65_ut_101"
    },
    {
      "end": 2065932,
      "speaker": "Robert Kosara",
      "start": 2064372,
      "text": "I don't remember the names, but I remember the paper.",
      "id": "ep_65_ut_102"
    },
    {
      "end": 2066244,
      "speaker": "Andy Kirk",
      "start": 2065988,
      "text": "Yeah.",
      "id": "ep_65_ut_103"
    },
    {
      "end": 2076916,
      "speaker": "Robert Kosara",
      "start": 2066284,
      "text": "They were looking at how people get started and how they also, they had a great name for this confusion phase. I forget what it's called, but they had a great term there.",
      "id": "ep_65_ut_104"
    },
    {
      "end": 2078384,
      "speaker": "Moritz Stefaner",
      "start": 2076980,
      "text": "So much for memorability.",
      "id": "ep_65_ut_105"
    },
    {
      "end": 2125776,
      "speaker": "Robert Kosara",
      "start": 2082004,
      "text": "But they were looking at how people struggle sometimes with these things because you're looking at something, you know, certain chart types, but there was this whole discussion about scatter plots and how they can they be used in the New New York Times and so on. And so they have to think about how people, they look at something that they're interested in and then they try to figure out what it even is telling them. And then if it's doable for them, they go through this kind of struggle phase to then figure it out. But they can also just be throw up their hands and say, okay, this is too hard for me. I don't understand what this does, but they did some interesting, it's very qualitative, but it's very interesting work on the kind of the phases that you go through and what you can do to help people. I don't remember all the authors either or the title right now, but it's.",
      "id": "ep_65_ut_106"
    },
    {
      "end": 2127984,
      "speaker": "Andy Kirk",
      "start": 2125800,
      "text": "A really interesting paper and that's what we've arrived at.",
      "id": "ep_65_ut_107"
    },
    {
      "end": 2134976,
      "speaker": "Moritz Stefaner",
      "start": 2128024,
      "text": "I mean, literacy is a huge topic and I think we will do, we can promise that to do a dedicated episode on that in the next year. Can we do that?",
      "id": "ep_65_ut_108"
    },
    {
      "end": 2136048,
      "speaker": "Andy Kirk",
      "start": 2135040,
      "text": "We can do that.",
      "id": "ep_65_ut_109"
    },
    {
      "end": 2137264,
      "speaker": "Enrico Bertini",
      "start": 2136216,
      "text": "We can do that.",
      "id": "ep_65_ut_110"
    },
    {
      "end": 2146936,
      "speaker": "Moritz Stefaner",
      "start": 2137384,
      "text": "I think it's worth it. Yeah, for sure. Enrico, any trends like from your end, like what stuck out this year as important trends in academia?",
      "id": "ep_65_ut_111"
    },
    {
      "end": 2233890,
      "speaker": "Enrico Bertini",
      "start": 2147120,
      "text": "In academia, I think. I mean, of course what Robert just said, I think it's true. And what I noticed that this is that I've seen even more of this visualization done in the wild. So I think traditionally is more the analytical part that has been done more in the wild. But I've seen a few papers that are more on the presentation side of things and done in the wild. So what I mean is talking to people, trying to understand what are their practices, what are their problems, issues, and then building research on top of that. And I think that's an amazing trend. I think we need both. We need people going in the wild and understanding what practitioners are doing, what are their needs, as well as more theoretical stuff. So I think we need a good balance. So I guess that's a really good trend. And at this, I have seen a few papers on personal visualization or related topics and I think that's going to be big because with all these new devices, of course we will see more visualization in these tiny, small devices. Right? And I use a lot of applications on my phone and my, I have a new Apple Watch and there are so many crappy visualizations there and it's like terrible, right? All this quantified self kind of stuff. I'm sorry, guys, most of the existing visualizations are terrible and they kind of.",
      "id": "ep_65_ut_112"
    },
    {
      "end": 2238210,
      "speaker": "Moritz Stefaner",
      "start": 2233922,
      "text": "Mentioned that as a big trend for this year. I totally agree. I mean, personal data for sure.",
      "id": "ep_65_ut_113"
    },
    {
      "end": 2245594,
      "speaker": "Enrico Bertini",
      "start": 2238322,
      "text": "Yeah, exactly. Yeah. I think these are my two main things.",
      "id": "ep_65_ut_114"
    },
    {
      "end": 2246494,
      "speaker": "Moritz Stefaner",
      "start": 2245674,
      "text": "Interesting.",
      "id": "ep_65_ut_115"
    },
    {
      "end": 2376004,
      "speaker": "Enrico Bertini",
      "start": 2247594,
      "text": "So this is a good time to take a little break to talk about our sponsor. Qlik Data Stories is brought to you by click, who allows you to explore the hidden relationships within your data that lead to meaningful insights. Let your instincts lead the way to create personalized visualizations and dynamic dashboards with Qlik sense, which you can download for free at www. Dot click dot de stories. That's Qlik dot de stories. I just want to quickly suggest you a nice read from the Qlik blog written by Qlik design specialist Marais Grigo McMahon, which is called people are smart data literacy and broad audiences. If you've been listening to data stories for a while, you know that this is a topic that we really like to talk about. In fact, we do have an episode coming up soon on this topic. So in the post, Marie explains what data literacy is and how we can design visualizations that stretch people's literacy without necessarily shying them away. And he takes a notable example from the BBC's 2015 UK general elections, in which a familiar map has been turned into a less familiar one by using what is called hexagonal binning. I don't know if you are familiar with that, but it's basically turning each area into an hexagon of the same size so that the number of seats won is much, much easier to perceive overall, and I really like his comment. He says this is not a basic data visualization, yet it was used for a mass audience with very diverse levels of data literacy. The important thing here is that it was meaningful, fit the context, and extended a concept that was already well known. So this is a really, really good point. So I strongly suggest you to give it a read. If you are interested in this topic, you will find a link in our blog post. So thanks again to Qlik for sponsoring us. You can find out more on click at www dot clic dot Datastories. And now back to the show.",
      "id": "ep_65_ut_116"
    },
    {
      "end": 2380494,
      "speaker": "Moritz Stefaner",
      "start": 2376784,
      "text": "So shall we move on to so industry gossip?",
      "id": "ep_65_ut_117"
    },
    {
      "end": 2381762,
      "speaker": "Enrico Bertini",
      "start": 2380954,
      "text": "Let's do that.",
      "id": "ep_65_ut_118"
    },
    {
      "end": 2399034,
      "speaker": "Moritz Stefaner",
      "start": 2381818,
      "text": "Totally from your end. Most notable like people were companies, institutions. Like what has changed? Did the expectations from last year get fulfilled? Andy, do you have any tabloid news for us?",
      "id": "ep_65_ut_119"
    },
    {
      "end": 2474184,
      "speaker": "Andy Kirk",
      "start": 2399114,
      "text": "Yeah, well, just flicking through the back pages. I think the standout movement in the field was the departure of Mike Bostock from the New York Times as well as Shan Carter. But obviously the focus of Mike next, I think is what's under most interest, what happens to d, three js and maybe other things around that. So that was a significant milestone, certainly in the UK. The appointment of Alan Smith OBE. I should give him his full title, who left the Office for National Statistics Visualization center and joined the Financial Times. So he's never worked in journalism before. So this is a completely new appointment, a new role and position for him, but certainly once again, from my perspective, in the UK, the Financial Times has really started to produce some really good stuff over these last twelve months and the appointment of Alan will only substantiate that further. I think they're, you know, two or three of the main things for me. I think just from a celebration point of view, I think this has been the year of Gregor Eiche. I think he's done some remarkable stuff for the upshot team Europe. Yeah, absolutely.",
      "id": "ep_65_ut_120"
    },
    {
      "end": 2477824,
      "speaker": "Enrico Bertini",
      "start": 2474884,
      "text": "We should get Gregor on the show again sometime.",
      "id": "ep_65_ut_121"
    },
    {
      "end": 2480276,
      "speaker": "Moritz Stefaner",
      "start": 2478924,
      "text": "He had a fantastic year.",
      "id": "ep_65_ut_122"
    },
    {
      "end": 2482144,
      "speaker": "Andy Kirk",
      "start": 2480340,
      "text": "Absolutely, yeah, absolutely.",
      "id": "ep_65_ut_123"
    },
    {
      "end": 2482852,
      "speaker": "Robert Kosara",
      "start": 2482564,
      "text": "Yeah.",
      "id": "ep_65_ut_124"
    },
    {
      "end": 2514610,
      "speaker": "Moritz Stefaner",
      "start": 2482868,
      "text": "And talking about Team Europe, I was quite impressed with what's going on in the UK. So despite Andy being there, you can't drag everything down. So no, there's lots of really nice, good studios from London. Like there's after the flood, there's signal noise. There's also techie, which I didn't know before, but I saw their work at the Big Bang data exhibition in London, where we also exhibited. They do really interesting stuff. So I think that's interesting. There seems to be a good ecosystem of smaller but very ambitious companies right now in London.",
      "id": "ep_65_ut_125"
    },
    {
      "end": 2518354,
      "speaker": "Andy Kirk",
      "start": 2514732,
      "text": "Yeah, I think. I think it's certainly catching up now. Yeah.",
      "id": "ep_65_ut_126"
    },
    {
      "end": 2537270,
      "speaker": "Moritz Stefaner",
      "start": 2519494,
      "text": "And yeah, domestic data streamers had a fantastic year. We had them on the show as well like half a year ago or so, and they continued to do amazing stuff. I loved it and so much of it. They did like 50 projects or something this year and everything. Very inventive, very fun, very warm and human. I just love their work.",
      "id": "ep_65_ut_127"
    },
    {
      "end": 2538542,
      "speaker": "Enrico Bertini",
      "start": 2537302,
      "text": "So I agree with you.",
      "id": "ep_65_ut_128"
    },
    {
      "end": 2539870,
      "speaker": "Moritz Stefaner",
      "start": 2538598,
      "text": "Big shout out to domestic.",
      "id": "ep_65_ut_129"
    },
    {
      "end": 2608226,
      "speaker": "Enrico Bertini",
      "start": 2539942,
      "text": "Absolutely, absolutely. Yeah. And we had a few new books. Right. So the highlight for me was Tamara Munzner's book, which I use in class and have been using earlier with the preprints. I'm really glad we have this book out, and Tamara has been working for many years on this book and it's very solid and I think it's been a great, great new book for me. And using it in class, it really made a big change for me. I think it's a real textbook for visualization courses, especially those that are more cs oriented, even though I have to say that the book doesn't include any overly technical stuff. So it's good for everyone. But I think the way it's organized is it reflects the way visualization people in academia mostly see visualization. So I think it's a great development there. What else, Andy? Robert, are there other books over there that have been published, notable books?",
      "id": "ep_65_ut_130"
    },
    {
      "end": 2677610,
      "speaker": "Robert Kosara",
      "start": 2608370,
      "text": "Well, there are actually two on storytelling and presenting data, which is interesting. There's Stephanie Evergreen, which was this book presenting data, effectively communicating your findings for maximum impact, and then Cole Nussbaum or Netflix on storytelling with data. That's the actual title of her book. And I don't know Stephanie's book at all, really. I've only lived through it, but it looks certainly interesting. She's got lots of good ideas about how to make things simpler and clearer and how to show your data well. But I know Cole's book a bit better because I actually reviewed that and it's a good introduction into how to turn your charts. So it's mostly fairly simple charts, but how to get those to really be the maximum impact, how do you reduce? She reacts to reduce a lot of things, reduce the colors, reduce the labels, reduce and reduce the scales and things like that, and only show the things that you really care about. And I think that's very important. So it's a very minimal, minimalist, perhaps approach. But I think it works really well because it really gets your attention to.",
      "id": "ep_65_ut_131"
    },
    {
      "end": 2678754,
      "speaker": "Andy Kirk",
      "start": 2677682,
      "text": "It's very accessible. Yeah.",
      "id": "ep_65_ut_132"
    },
    {
      "end": 2680386,
      "speaker": "Robert Kosara",
      "start": 2678794,
      "text": "Oh, and it is very accessible. It's a great book, actually.",
      "id": "ep_65_ut_133"
    },
    {
      "end": 2708052,
      "speaker": "Andy Kirk",
      "start": 2680410,
      "text": "It's very well written. Stephanie and Cole are both practitioners who work in the space of doing workshops and training courses for normal organizations. So it's a book that's not for or not intended for experts. It's about getting people up to that next level of their work in nonprofits, in smaller organizations, and large organizations as well. But, yeah, it's a nice addition to the bookshelf.",
      "id": "ep_65_ut_134"
    },
    {
      "end": 2726182,
      "speaker": "Enrico Bertini",
      "start": 2708148,
      "text": "So one specific topic that I would like to know more, and I don't know if it's, it's included in these books, is more the narrative side of visualization and what are the existing techniques there? So do you guys, if there is anything like that in these two books or maybe other books that I don't.",
      "id": "ep_65_ut_135"
    },
    {
      "end": 2727950,
      "speaker": "Robert Kosara",
      "start": 2726198,
      "text": "Know, not that I'm aware of, but.",
      "id": "ep_65_ut_136"
    },
    {
      "end": 2745994,
      "speaker": "Enrico Bertini",
      "start": 2728022,
      "text": "I find that this area of visualization is not very well developed right now, and it would be really nice to have someone presenting. I think we have to go beyond data encoding. That's, of course, very important, but there are many, many other components there. So just curious, so do these two books include this part?",
      "id": "ep_65_ut_137"
    },
    {
      "end": 2767404,
      "speaker": "Robert Kosara",
      "start": 2746154,
      "text": "Not in any kind of direct way. They're mostly about how to make the point that you want to make stand out. But there is actual narration I haven't seen in any book and really haven't seen covered very well anywhere. There's a lot of work on narration in general, but not with data that I've seen.",
      "id": "ep_65_ut_138"
    },
    {
      "end": 2770804,
      "speaker": "Moritz Stefaner",
      "start": 2768584,
      "text": "So, Robert, do you have any plans next year.",
      "id": "ep_65_ut_139"
    },
    {
      "end": 2773912,
      "speaker": "Robert Kosara",
      "start": 2771424,
      "text": "Not next year, but, you know, you.",
      "id": "ep_65_ut_140"
    },
    {
      "end": 2778184,
      "speaker": "Enrico Bertini",
      "start": 2773928,
      "text": "Should do it, Robert. I would buy it.",
      "id": "ep_65_ut_141"
    },
    {
      "end": 2784992,
      "speaker": "Moritz Stefaner",
      "start": 2778224,
      "text": "I mean, speaking of which, I think the year in books has been slow. I mean, honestly, I mean, Tamara's book is amazing, but I sort of knew that before.",
      "id": "ep_65_ut_142"
    },
    {
      "end": 2788320,
      "speaker": "Robert Kosara",
      "start": 2785168,
      "text": "Huge effort, though. I mean, she's been working on this for like eight years, so.",
      "id": "ep_65_ut_143"
    },
    {
      "end": 2804270,
      "speaker": "Moritz Stefaner",
      "start": 2788392,
      "text": "Yeah. Yeah, so that's. And it. I mean, she delivers for sure. I mean, that's like the book now. And so that's. That's cool. But the rest is. I think it was a bit slow, but I think we can actually expect big things for 2016. So. Yeah, I hear a certain Mister Kirk is writing on something.",
      "id": "ep_65_ut_144"
    },
    {
      "end": 2859086,
      "speaker": "Andy Kirk",
      "start": 2804422,
      "text": "Yes, this is a book that's been dominating my year and kind of killing me to a certain degree this year, but due out in May. It's a sage published book. And it's about looking at visualization as a process, which is why doing all my training and teaching and writing, really. But once again, it's pitched at non experts. Hopefully it will be accessible to intermediate and experts as well, but certainly aiming to give people a sense of the practical way forward, to apply visualization to people's workflows with hopefully a real sense of all the different options that exist, charts, color options, interactive features, and then the mental capacity for them to judge what's the right choice in any given situation. So, yeah, I'm looking forward to that. Coming out next May. Cool.",
      "id": "ep_65_ut_145"
    },
    {
      "end": 2860434,
      "speaker": "Moritz Stefaner",
      "start": 2859150,
      "text": "So it's the missing man.",
      "id": "ep_65_ut_146"
    },
    {
      "end": 2861446,
      "speaker": "Andy Kirk",
      "start": 2860734,
      "text": "Yes.",
      "id": "ep_65_ut_147"
    },
    {
      "end": 2862334,
      "speaker": "Moritz Stefaner",
      "start": 2861590,
      "text": "Very good.",
      "id": "ep_65_ut_148"
    },
    {
      "end": 2863894,
      "speaker": "Andy Kirk",
      "start": 2862414,
      "text": "It's the final piece in the Dukes.",
      "id": "ep_65_ut_149"
    },
    {
      "end": 2878514,
      "speaker": "Moritz Stefaner",
      "start": 2864014,
      "text": "I like that. Yeah. Then Alberto Cairo just tweeted he's almost finished with his follow up to the functional art. It's now called the truthful art. We'll see if there will be a third part, the mildly interesting art or.",
      "id": "ep_65_ut_150"
    },
    {
      "end": 2896272,
      "speaker": "Robert Kosara",
      "start": 2878974,
      "text": "Well, actually, there will be a third. You didn't see that? He already said that. His PhD. He's gonna be working on his PhD starting, I think, sometime next year. And he already said that there's gonna be a book. And he even had a title, but I forget what the title was. But, yeah, expect more books from Alberto. He's not gonna stop.",
      "id": "ep_65_ut_151"
    },
    {
      "end": 2897480,
      "speaker": "Enrico Bertini",
      "start": 2896448,
      "text": "He's not gonna stop.",
      "id": "ep_65_ut_152"
    },
    {
      "end": 2909954,
      "speaker": "Moritz Stefaner",
      "start": 2897552,
      "text": "He's a machine team of robots. And there will also be a dear data book, so that's great, too. I think it's so made for being a really nice book, and I really looking forward for that.",
      "id": "ep_65_ut_153"
    },
    {
      "end": 2926942,
      "speaker": "Robert Kosara",
      "start": 2910454,
      "text": "Yeah, it'll be interesting to see that. And then I guess we're kind of be outing a few people who we know are writing books that aren't ready yet. But I know hockey camos is working on a book that should be interesting. We don't know when that's, I don't know when it's coming out. And if, you know, pressure now, I.",
      "id": "ep_65_ut_154"
    },
    {
      "end": 2949962,
      "speaker": "Andy Kirk",
      "start": 2926958,
      "text": "Don't think it's far off. And it's specifically about excel, I think. So it'll have a big, that makes sense. It'll have a big audience amongst kind of business users, I think. I think. And Jon Schwabish is doing one, I think. Yeah, that makes sense about presentation. I think it's, I can't remember the exact outline of his book, but I think it's more about the kind of presentation of information visualization, but also through presentations themselves.",
      "id": "ep_65_ut_155"
    },
    {
      "end": 2950922,
      "speaker": "Moritz Stefaner",
      "start": 2950098,
      "text": "Like PowerPoint.",
      "id": "ep_65_ut_156"
    },
    {
      "end": 2951602,
      "speaker": "Andy Kirk",
      "start": 2951018,
      "text": "Yeah.",
      "id": "ep_65_ut_157"
    },
    {
      "end": 2952454,
      "speaker": "Robert Kosara",
      "start": 2951738,
      "text": "Yes.",
      "id": "ep_65_ut_158"
    },
    {
      "end": 2954490,
      "speaker": "Moritz Stefaner",
      "start": 2953354,
      "text": "That's much needed too.",
      "id": "ep_65_ut_159"
    },
    {
      "end": 2955346,
      "speaker": "Andy Kirk",
      "start": 2954562,
      "text": "Yeah, absolutely.",
      "id": "ep_65_ut_160"
    },
    {
      "end": 2956134,
      "speaker": "Moritz Stefaner",
      "start": 2955450,
      "text": "Yeah.",
      "id": "ep_65_ut_161"
    },
    {
      "end": 2962946,
      "speaker": "Enrico Bertini",
      "start": 2956834,
      "text": "So what happened in 2015 in terms of blogs and related stuff?",
      "id": "ep_65_ut_162"
    },
    {
      "end": 2963314,
      "speaker": "Andy Kirk",
      "start": 2963050,
      "text": "Right.",
      "id": "ep_65_ut_163"
    },
    {
      "end": 2964814,
      "speaker": "Moritz Stefaner",
      "start": 2963354,
      "text": "Enough about old media.",
      "id": "ep_65_ut_164"
    },
    {
      "end": 2972564,
      "speaker": "Enrico Bertini",
      "start": 2965314,
      "text": "Let's talk about the, this old medium. There are these two guys that are still blogging around.",
      "id": "ep_65_ut_165"
    },
    {
      "end": 2977324,
      "speaker": "Moritz Stefaner",
      "start": 2975464,
      "text": "That's all. 2005.",
      "id": "ep_65_ut_166"
    },
    {
      "end": 2980360,
      "speaker": "Andy Kirk",
      "start": 2978944,
      "text": "Yeah. Newsletters is the future.",
      "id": "ep_65_ut_167"
    },
    {
      "end": 2995852,
      "speaker": "Enrico Bertini",
      "start": 2980432,
      "text": "No, but seriously, I mean, passenger pigeons. It's great to see that you guys keep doing this and it's an amazing service, but it's also interesting to see that nobody else is doing it right. And as far as I know, it's.",
      "id": "ep_65_ut_168"
    },
    {
      "end": 2997464,
      "speaker": "Moritz Stefaner",
      "start": 2995868,
      "text": "A lot of work, obviously.",
      "id": "ep_65_ut_169"
    },
    {
      "end": 3000956,
      "speaker": "Enrico Bertini",
      "start": 2998764,
      "text": "So what is going on, Robert?",
      "id": "ep_65_ut_170"
    },
    {
      "end": 3009884,
      "speaker": "Robert Kosara",
      "start": 3001020,
      "text": "Well, so Andy just won a major award. He just won the information is beautiful award for the best website, I believe is the category.",
      "id": "ep_65_ut_171"
    },
    {
      "end": 3010596,
      "speaker": "Andy Kirk",
      "start": 3010004,
      "text": "That's correct.",
      "id": "ep_65_ut_172"
    },
    {
      "end": 3011572,
      "speaker": "Enrico Bertini",
      "start": 3010660,
      "text": "Congratulations.",
      "id": "ep_65_ut_173"
    },
    {
      "end": 3012344,
      "speaker": "Robert Kosara",
      "start": 3011628,
      "text": "Congrats.",
      "id": "ep_65_ut_174"
    },
    {
      "end": 3013180,
      "speaker": "Andy Kirk",
      "start": 3012724,
      "text": "Thank you.",
      "id": "ep_65_ut_175"
    },
    {
      "end": 3044302,
      "speaker": "Robert Kosara",
      "start": 3013212,
      "text": "Thank you. So that's great. Also this year, visual complexity, which has been around, well, it's now ten years and it's gone or it's, well, it's still there, but he has been stopped doing it. So there are a thousand projects on the site and it's the ten year anniversary and I think at this point the whole thing will be frozen a bit like info statics, which is also frozen now, even though it looks on purpose. But that's an interesting development to do that. We had a number of.",
      "id": "ep_65_ut_176"
    },
    {
      "end": 3046034,
      "speaker": "Moritz Stefaner",
      "start": 3044358,
      "text": "But that's a huge achievement.",
      "id": "ep_65_ut_177"
    },
    {
      "end": 3153114,
      "speaker": "Robert Kosara",
      "start": 3046414,
      "text": "Oh, for sure. Yes, absolutely. No. And I think this idea of having an archive is certainly useful. The problem is in five years it will be incredibly out of date. So hopefully he'll be picking it back up or, I don't know, somebody else will fill in. But yeah, it's certainly a big effort and I can understand why people decide to just kind of put a capstone on it and say, okay, that's it. And then this year there were a number of Reddit, Ama's ask me anything. There was Alberto Tamara Munzner. I did one. There was Nate Silver, Hadley Wickham. So a few more notable people than me, David McCandless, said one, Nathan Yamag Bostock. There was also the Andy and Andy one. That was Andy Kirk and Andy Codgreeve doing a very interesting thing there and a number of things. I think it's good because this shows that blogs are not that there is interest. People ask questions, people want to know things about process. They want to know what do you guys think of this and of that? And so there is a lot of conversation to be had, but the channels are changing and so that's good and bad. I mean, I like blogs. I like the way they work, and I hope we're going to have them for a while longer. But obviously there are other things going on, especially on Twitter and in other places that are taking over some of the, some of that work. And then of course, eager eyes is still around. So I slowed down a bit over the summer, but I've been writing again and I certainly want to keep this thing going. It's been nine years now, so I'm going to be ten. Eager eyes will be ten years old next October, so you can already put it in the notes for next year's show.",
      "id": "ep_65_ut_178"
    },
    {
      "end": 3159246,
      "speaker": "Moritz Stefaner",
      "start": 3156214,
      "text": "Flowing data is still around, too prolific as ever.",
      "id": "ep_65_ut_179"
    },
    {
      "end": 3161386,
      "speaker": "Robert Kosara",
      "start": 3159350,
      "text": "Oh, of course, yes. Very active. Yeah.",
      "id": "ep_65_ut_180"
    },
    {
      "end": 3200992,
      "speaker": "Enrico Bertini",
      "start": 3161450,
      "text": "Full speed. Yeah. Yeah. But it's interesting, it looks like the market of blogs stabilized around really few ones. And I'm really curious, what's your opinion? What do you think is happening? Is it more that there's no space for more blogs or people are just switching to other media or. I think, for instance, I found really interesting the idea that some people are posting visualization stuff on medium. So rather than opening a whole new blog, you have something interesting to say. You post it on medium and people can see it and read it. Right. So what is going on? What is your opinion on that?",
      "id": "ep_65_ut_181"
    },
    {
      "end": 3271370,
      "speaker": "Andy Kirk",
      "start": 3201048,
      "text": "Well, I mean, certainly from my perspective, you know, my blog is my shop window in effect. And so it's a very different situation for me than it would be for, say, an academic who doesn't necessarily need to post articles on their blog to kind of maintain their presence in the field. But obviously Twitter over the last four or five years has been such a dominant place where we've been, although it's not the best place for conversations, it is the place where things are being conversed about, which is why I think it's interesting that the popularity of those Reddit Ama's I think gives you the impression that people are looking for those places to have that kind of conversation, which Twitter just isn't good at. So from my perspective, I think I will still keep blogging because it's as much for me, it's as much about me writing to shape my own convictions about what I believe in and don't believe in. But I guess for other people and you know, Andrew with infesthetics, probably a case in point, perhaps, you know, the academic world is such a busy world for him that maybe doesn't have the time or capacity or ultimately the need to do it.",
      "id": "ep_65_ut_182"
    },
    {
      "end": 3300512,
      "speaker": "Enrico Bertini",
      "start": 3271442,
      "text": "Yeah. Even though I have to say that. Sorry, Robert, I would love to see more blogs or related stuff published by academics like myself. By the way, I really like talking to myself, but there is not a lot of information about what happens in research and how to connect research to practitioners. I think this is still a big gap, Robert.",
      "id": "ep_65_ut_183"
    },
    {
      "end": 3382220,
      "speaker": "Robert Kosara",
      "start": 3300528,
      "text": "Yeah, totally. And I think so. I just wanted to comment on what Andy just said about Twitter. I think what happens is that medium becomes a bit of an extension of Twitter. And because it's also really well done, it just looks good. It's pleasant to use, which isn't the case with all the blogging platforms, even though they're getting way better. WordPress is really good now, and Tumblr and a few others. And maybe some people just don't care that much about trying to set up an identity for themselves. So then you just put it on medium. Or perhaps they expect more of the people who might be following them to already be there on medium and see their things. For me, it's hard to see what's going on because medium is such a huge place that it's really hard to know. So who should I be following? And sometimes just write one thing once and then never again. So that doesn't really lead to a conversation or to a longer thing. But I also hope that there's going to be more of that coming. And some people, there's a new thing, a new blog log here and there, but they all tend to just kind of fade after a very short time, which is too bad. But I've been bemoaning this for a while. I don't think it's going to change. Let's just go with it. But I hope that at least a few that are around that are active will stay active. Like Andy's and flowing data and others.",
      "id": "ep_65_ut_184"
    },
    {
      "end": 3400598,
      "speaker": "Enrico Bertini",
      "start": 3382332,
      "text": "Yeah, and I already mentioned podcasts at the beginning. I think that's a big trend. I just want to quickly mention, of course, there is the policy fees podcast from Jon Schwabish. I guess that's new. That was created in 2015 or maybe a little earlier. So I just wanted to.",
      "id": "ep_65_ut_185"
    },
    {
      "end": 3414062,
      "speaker": "Robert Kosara",
      "start": 3400606,
      "text": "I think it's a bit over a year old now, but it certainly became much more prominent and I think he really figured out what he wanted to do this year. And it's really interesting. It's a really good podcast. So policyviz is a good one to follow.",
      "id": "ep_65_ut_186"
    },
    {
      "end": 3438110,
      "speaker": "Enrico Bertini",
      "start": 3414238,
      "text": "Yeah, and I personally really like data skeptic. In the area of the new data related podcasts, there are a few new ones out there. Most of them are heavily based on machine learning. I think data skeptic has a good balance and also much more accessible than the others. It's a really, really good one. I really, really like it. And what else?",
      "id": "ep_65_ut_187"
    },
    {
      "end": 3472222,
      "speaker": "Andy Kirk",
      "start": 3438222,
      "text": "Yeah, just a shout out for the Tableau wannabe podcast hosted by Matt Francis and Emily Kunz. Naturally, this is a Tableau focused podcast, although they do discuss broader issues. But I think it reflects, as Robert will be very clearly apparent, there's a huge community around Tableau. There's a huge community of people who are sharing ideas and talking about Tableau and best practices. It's such a lively set of people who contribute some really interesting stuff out there. So this is a nice podcast that Matt and Emily do quite frequently, actually.",
      "id": "ep_65_ut_188"
    },
    {
      "end": 3492894,
      "speaker": "Moritz Stefaner",
      "start": 3472278,
      "text": "Yeah. So it's been a great year for podcasting, for sure. And let's hope it continues. Moving on. So talking about software, libraries, tools, how is the landscape changed? What's your perception? Robert? You do work for a tools company. Maybe you have some insight.",
      "id": "ep_65_ut_189"
    },
    {
      "end": 3863174,
      "speaker": "Robert Kosara",
      "start": 3492934,
      "text": "Yes, of course. Now the company guy gets to talk about tools. So there are a number of things that need to be mentioned, for sure. Course there is a new Tableau product out there which is called visible. That's spelled in an interesting way. It's V I c or zable. The idea is that, and it's an iPad program. So the idea is that how do you do visualization on an iPad and do it well. So there are a number of visualization tools for iPad, but they're horrible mostly, and some of them just basically import things that you can create somewhere on the desktop. But visible was really built as a research project, actually. First to see how would you do a touch interaction at all and then started super simple and then eventually turn into a little product. And it's actually free. You can just get it on the App store and start playing with it, import your data, play with it, and just figure out how to do a touch interaction in it. And it's a really neat new way of doing things. So speaking of new things, speaking of things that are no longer around, there is many eyes, which has been folded into Watson analytics. So many eyes was, I think, a really important project for how we think about data visualization and how people started to really get into Dataviz in general. So many eyes started in early 2006, I believe. And at that time, it was really hard for people to create good visualizations, and they gave people tools on the web. This was all written in Java and then later in flash, and it made it possible for people to just get the data in there and do things, some of which were kind of obvious, like bar charts and line charts, and some of which were really unusual. So they did some really good work around text visualization, where you could create networks of characters in a book and so on, based on certain structures in the sentences. And so now what the new. So earlier this year, I think in, in maybe may or so or June, IBM announced that they were going to end the support from many eyes, as many eyes. And now what you can do is you can get a free user for a version of Watson, which is the analytics system that IBM has, which is a huge system that does all kinds of things. And we'll see how well it works for actual data analysis, kind of more casual users, because what many eyes did, well, I think, was it made it really easy. That was a very simple startup. And I haven't actually used watts myself. I've seen a few talks, but I haven't actually used it to say what it does. But I'm just a bit sad that this community around many eyes is going away. And the research that they did was really, really good. It was a lot about not just visualization itself, but also how do people collaborate and so on. So that was really interesting. And of course, Martin Wattenberg and Fernando Villegas, who were the main people behind it, they've long left now at Google. And so the whole thing was still, was already kind of an empty shelf for several years. But yeah, so this is kind of sad end of this project, which I think was really remarkable and was really important. However, there are also good news, so don't want to be too much of a downer here. There are some really interesting news developments. Of course, there's D3 is just getting ever more popular and ever better. So Mike Basler keeps working on it, which is great. There's also the work that Jeff Heer is doing with his students and with Trifacta on the thing that's called Vega and Vega lite. And there's another thing that's Vega, something that are basically ways of specifying the visualizations, a bit like in D3, but less as code and more in a declarative style, and then doing things on that that make them super efficient and even include things like interaction and so on. And then there's also a new player here that is called Brunel, which came out of IBM. And that actually was supposed to be the future of many eyes, but they've now just made it a separate thing and release it as open source. And Brunel is based on the grammar of graphics, which is this book by Lee Wilkinson that describes a way of thinking about how visualization can be specified in a general kind of language and does more. I haven't actually tried it myself, I just saw it. It was released maybe a month ago, so I haven't had time to actually look into it yet. But it's a different way of doing things than VEga or D3. It would be interesting to look at what, what that's like. And then there are a number of tools that people are building that are research sheet tools. There's Voyager, which is also coming out of this cloud around Jeff Heer and his students. So they're building a lot of really interesting things. Voyager is a tool that's sitting on top of Vega and that's trying to give you better ways of exploring your data by giving you individual views and then kind of guiding you through those based on what things you would be interested in and the feedback you're getting of it. And then of course, a big problem with data visualization is that you need to get your data into your visualization tool to start with. And that can be really tricky. And so there's this term that's called data wrangling, and trifactor, which is Jeff Harris and other people's startup that does that kind of thing. They released a free version of their data wrangling. Sweet. I guess that is called Trifacta Wrangler, I think trifecta data Wrangler. And it's free. It has some limitations, but for most regular people's uses, it has plenty of space to do work in. And it lets you do all the things that Trifacta does with cleaning up your data and reshaping it and so on. So it's really cool to be able to get your data into a shape that you need for your visualization tool or your, your visualization program. So there are a lot of really interesting new things that are happening in that space, so that's really cool to see.",
      "id": "ep_65_ut_190"
    },
    {
      "end": 3931234,
      "speaker": "Moritz Stefaner",
      "start": 3863794,
      "text": "Yeah. And all these last four prints were from Jeff Heer's close environment. That's quite an output. And, yeah, Trifacta could be really interesting. It might fill the gap that Google refine has left in terms of simple tools for cleaning up messy data, which is always needed. You said D3 is going strong. It's true. But I think this year it turned really out that reactjs is the go to web development framework, and it's kind of interesting because it does not play that well with D3, and that gave a lot of people a lot of headaches. And I think the declarative languages you mentioned could actually be a way out of that because they fit much with this markup style that reactjs brings with it and the virtual doms and so on. So that could be interesting. Looking forward, just a final remark. I think it's been a great year for cartography, and with Mapsan cartoons and Mapbox, there's three really strong companies in the mapping space now, and they just operate on such a high level and continue to innovate really well. And I think that's super exciting.",
      "id": "ep_65_ut_191"
    },
    {
      "end": 3959080,
      "speaker": "Enrico Bertini",
      "start": 3931314,
      "text": "Yeah, great. So shall we also briefly talk about what events happened and maybe even specific talks that you guys enjoyed? Of course, there are some of the recurring events, like we already said, talked about Tripoli vis IO, visualized, and so on. So, Robert, you want to start? What are the major highlights there?",
      "id": "ep_65_ut_192"
    },
    {
      "end": 4043636,
      "speaker": "Robert Kosara",
      "start": 3959232,
      "text": "Sure. So I really like Openviz. So this was the third time, I think, this year or this year, and it's a really good conference that is based around open technologies like JavaScript, like D3, and it brings together people doing very technical stuff, so they have these things like looking like, I think last year there was one on react versus angular and so on. But there's also, they have people there like me, talking about storytelling and about all kinds of topics, and it's a really good mix of different people doing different things. It's a really great conference. It's going to be, I think, in April or so in Boston again, and it's just a really good one to go to. And then, of course, I'm biased here because I am one of the organizers, but the tapestry conference is also going to be in its fourth year next year, and it's a newish type of conference around storytelling in particular, and we have some really interesting speakers, speakers there, and we're trying to really focus it very much on the storytelling. So we are very picky about who we get as speakers and also even on the people who we invite to speak or to attend. I mean, so we're trying to really make it a very cohesive group of people, and it's working out very well so far. So everybody seems to be really enjoying it. And so that's another good one, I think. And then, of course, there are lots of other things around.",
      "id": "ep_65_ut_193"
    },
    {
      "end": 4051856,
      "speaker": "Enrico Bertini",
      "start": 4043770,
      "text": "Yeah. So last year you had a really good lineup, I remember. And who's coming next? What are the main speakers for 2016?",
      "id": "ep_65_ut_194"
    },
    {
      "end": 4083168,
      "speaker": "Robert Kosara",
      "start": 4051920,
      "text": "Yeah. So for 2016, we have Scott Klein of ProPublica. We have Nick Susanis, who wrote this great book called Unflattening, which is a comic about how to think in terms that are going beyond our usual understanding of comics, and Jessica Hullman to talk about communication and very good storytelling. So this should be really good. And we still have slots open for short stories. If you want to give a talk, you can apply and we might pick your talk.",
      "id": "ep_65_ut_195"
    },
    {
      "end": 4092552,
      "speaker": "Moritz Stefaner",
      "start": 4083256,
      "text": "So, sounds good. I really enjoyed visualize this year. So that was in New York. It was good. Again, that was fun.",
      "id": "ep_65_ut_196"
    },
    {
      "end": 4093240,
      "speaker": "Robert Kosara",
      "start": 4092688,
      "text": "That was fun.",
      "id": "ep_65_ut_197"
    },
    {
      "end": 4118364,
      "speaker": "Moritz Stefaner",
      "start": 4093272,
      "text": "And they have a great format with very short talks, lots of people, very dense packed and super organized. And, yeah, it's a great conference. And then I also enjoyed resonate in Serbia and art a bit in Katowice, in Poland. So I love Eastern Europe anyways. And I think really good things are happening there. And that's one of the things for me. For next year, I want to go to a bit more unusual places, like not just New York and London all the time.",
      "id": "ep_65_ut_198"
    },
    {
      "end": 4123084,
      "speaker": "Robert Kosara",
      "start": 4119184,
      "text": "Have you been to that conference in Romania on storytelling?",
      "id": "ep_65_ut_199"
    },
    {
      "end": 4124529,
      "speaker": "Moritz Stefaner",
      "start": 4123393,
      "text": "No, unfortunately not.",
      "id": "ep_65_ut_200"
    },
    {
      "end": 4126065,
      "speaker": "Robert Kosara",
      "start": 4124561,
      "text": "But tempted to go next?",
      "id": "ep_65_ut_201"
    },
    {
      "end": 4132545,
      "speaker": "Moritz Stefaner",
      "start": 4126129,
      "text": "Yeah, there was also something in Budapest, and there's really interesting things going on in this part of the world and.",
      "id": "ep_65_ut_202"
    },
    {
      "end": 4136481,
      "speaker": "Enrico Bertini",
      "start": 4132649,
      "text": "Yeah, nice. Andy, anything from your side?",
      "id": "ep_65_ut_203"
    },
    {
      "end": 4186354,
      "speaker": "Andy Kirk",
      "start": 4136577,
      "text": "Yeah, well, this year I had a self imposed ban on attending conferences due to workload, specifically the book. But from afar at least, the talk that I. So a video of that light in particular was from Lena Groger from the, from ProPublica. She did a great talk about these loops and repeated devices and gifs and animation as a way to kind of explain things. I thought it was just really super weird and such a deep and broad set of examples and examples that really, really captured the essence of what she was talking about. So I always love Lena's talk. She does some really interesting, very specific themes, but they're always really interesting talks. So, yeah, that was my single kind of contribution to this section.",
      "id": "ep_65_ut_204"
    },
    {
      "end": 4204028,
      "speaker": "Moritz Stefaner",
      "start": 4187294,
      "text": "So the tv version of the contrast, the armchair viewer. So I think that's been, it only remains the outlook, of course. Can you make some wildly unfounded predictions about the future that everybody will have forgotten in a year? Anyway?",
      "id": "ep_65_ut_205"
    },
    {
      "end": 4207360,
      "speaker": "Andy Kirk",
      "start": 4204046,
      "text": "Anyways, hopefully the demise of the podcast.",
      "id": "ep_65_ut_206"
    },
    {
      "end": 4220472,
      "speaker": "Moritz Stefaner",
      "start": 4207392,
      "text": "Last year, we were like 50 50. It's like some of our predictions were quite accurate, others not so much. But yeah, we'll leave it to you to figure that out. But do you have any hunches? Like what's going to be big storytelling?",
      "id": "ep_65_ut_207"
    },
    {
      "end": 4221192,
      "speaker": "Robert Kosara",
      "start": 4220528,
      "text": "It's going to be big.",
      "id": "ep_65_ut_208"
    },
    {
      "end": 4223484,
      "speaker": "Enrico Bertini",
      "start": 4221248,
      "text": "Of course. It's huge, man.",
      "id": "ep_65_ut_209"
    },
    {
      "end": 4277594,
      "speaker": "Robert Kosara",
      "start": 4224144,
      "text": "It already is. And more stuff coming up, and I mean, I'm biased and I'm working on this kind of stuff, so hopefully there will be more of this stuff coming out that I'm doing and that I'm working with people on, and then I'm sure there will be more, actually. In fact, there's a darksthool seminar on storytelling in February, which is important because that shows that this is becoming a topic that people actually have meetings on that are completely separate from the regular conferences. So it's becoming its own thing. And I have a piece coming up in this viewpoint in the CGNA Journal in January, February that talks about this and hopefully more as well. We have some stuff under review right now, so it's a very easy prediction at this point because it's really happening. But I think that we will see more in that area. And obviously also from the journalism side.",
      "id": "ep_65_ut_210"
    },
    {
      "end": 4329890,
      "speaker": "Andy Kirk",
      "start": 4278134,
      "text": "I think from my perspective, it's perhaps less about a theme, but more about the opportunities that next year brings, which is we tend to see this kind of four year cycle around the presidential campaign elections in the US, where there's some, obviously there's a lot of preparation time. Everyone knows when it's going to happen. And so it's always fascinating to see what kind of new approaches the big players and the media take in terms of coverage and new ways to look at the polling and the projected outcome of these things. And also, if you remember last time, there was a lot of work around simulating the swing states and where you think the outcomes may be. So the elections there, the Olympic Games, I think is in Rio next year. There's obviously, hopefully there'll be some more good stuff around there. So I think it's more about continuing the trend as we're going along, but hopefully we'll see some real standout projects in those situations.",
      "id": "ep_65_ut_211"
    },
    {
      "end": 4332134,
      "speaker": "Moritz Stefaner",
      "start": 4330002,
      "text": "It's going to be a busy summer for some people.",
      "id": "ep_65_ut_212"
    },
    {
      "end": 4333522,
      "speaker": "Andy Kirk",
      "start": 4332594,
      "text": "Absolutely. Yeah.",
      "id": "ep_65_ut_213"
    },
    {
      "end": 4371752,
      "speaker": "Moritz Stefaner",
      "start": 4333578,
      "text": "Oh my God. Yeah. Personally, I think we will see. I mean, that has been the big trend this year partly as well, like more analog representations, more playing with photos, playing with unusual tricks, playing with spatial situations. Like, I think more installation works, more situated stuff, locative stuff, just moving away a bit from the desktop, screen based things. I think that's going to be big because everybody's waiting for that and everybody's so it's being received so well when anything interesting in that area happens. So I think there will be much more, and I'm personally much looking forward to that. Enrico, how about you? What do you think?",
      "id": "ep_65_ut_214"
    },
    {
      "end": 4420264,
      "speaker": "Enrico Bertini",
      "start": 4371848,
      "text": "Yeah, I already mentioned some of these things. I guess machine learning is very big, so I can imagine this doing a lot of stuff. We should. So if you're listening to this, do more base for machine learning because that's going to be big. And yeah, I'm really curious to see what is going to happen in the VR space, as we said, I mean, this in 3d visuals or virtual reality base doesn't seem to be easy or even effective, but I guess people will experiment with that. This might actually be a big trend in 2016, and I wish that there will be even more collaboration between researchers and practitioners. This is already happening. I think we already made a lot of progress, but there is more to do.",
      "id": "ep_65_ut_215"
    },
    {
      "end": 4423504,
      "speaker": "Moritz Stefaner",
      "start": 4421084,
      "text": "I get along okay with you by now?",
      "id": "ep_65_ut_216"
    },
    {
      "end": 4427504,
      "speaker": "Andy Kirk",
      "start": 4425724,
      "text": "65 episodes later.",
      "id": "ep_65_ut_217"
    },
    {
      "end": 4445264,
      "speaker": "Enrico Bertini",
      "start": 4431204,
      "text": "Yeah. So that's it. So I wish that we are going to have another long series of great episodes as well, maybe even more than last year. I think we are on a good trajectory.",
      "id": "ep_65_ut_218"
    },
    {
      "end": 4463736,
      "speaker": "Moritz Stefaner",
      "start": 4445964,
      "text": "I would say so, too. And it sounds like a great year. So we'll see. We can maybe do a little reality check next year and see how much of that came true. Meanwhile, enjoy the last few days of 2015. I guess everybody's busy wrapping up and have great holidays.",
      "id": "ep_65_ut_219"
    },
    {
      "end": 4464632,
      "speaker": "Enrico Bertini",
      "start": 4463880,
      "text": "Thank you very much.",
      "id": "ep_65_ut_220"
    },
    {
      "end": 4466804,
      "speaker": "Moritz Stefaner",
      "start": 4464688,
      "text": "And a great start into 2016.",
      "id": "ep_65_ut_221"
    },
    {
      "end": 4467712,
      "speaker": "Andy Kirk",
      "start": 4467144,
      "text": "Yeah.",
      "id": "ep_65_ut_222"
    },
    {
      "end": 4469824,
      "speaker": "Enrico Bertini",
      "start": 4467808,
      "text": "Thanks for coming on the show and the end.",
      "id": "ep_65_ut_223"
    },
    {
      "end": 4471664,
      "speaker": "Andy Kirk",
      "start": 4469864,
      "text": "Thank you guys for having me. Always a pleasure.",
      "id": "ep_65_ut_224"
    },
    {
      "end": 4473472,
      "speaker": "Enrico Bertini",
      "start": 4471704,
      "text": "It's always fun to have you here.",
      "id": "ep_65_ut_225"
    },
    {
      "end": 4474360,
      "speaker": "Moritz Stefaner",
      "start": 4473488,
      "text": "It was great.",
      "id": "ep_65_ut_226"
    },
    {
      "end": 4477680,
      "speaker": "Enrico Bertini",
      "start": 4474552,
      "text": "You didn't fight much this time. That's, that's pity.",
      "id": "ep_65_ut_227"
    },
    {
      "end": 4479256,
      "speaker": "Robert Kosara",
      "start": 4477872,
      "text": "Oh, we're fighting next year.",
      "id": "ep_65_ut_228"
    },
    {
      "end": 4480964,
      "speaker": "Enrico Bertini",
      "start": 4479320,
      "text": "Oh, yeah, we're fighting next year.",
      "id": "ep_65_ut_229"
    },
    {
      "end": 4483564,
      "speaker": "Andy Kirk",
      "start": 4481944,
      "text": "Let's find those tensions.",
      "id": "ep_65_ut_230"
    },
    {
      "end": 4488434,
      "speaker": "Enrico Bertini",
      "start": 4485904,
      "text": "Okay, guys, thank you. You, bye bye.",
      "id": "ep_65_ut_231"
    },
    {
      "end": 4488874,
      "speaker": "Moritz Stefaner",
      "start": 4488474,
      "text": "Talk soon.",
      "id": "ep_65_ut_232"
    },
    {
      "end": 4580394,
      "speaker": "Enrico Bertini",
      "start": 4488914,
      "text": "Bye bye. Hey, guys, thanks for listening to data stories again. Before you leave, we have a request if you can spend a couple of minutes rating us on iTunes, that would be extremely helpful for the show. I also want to give you some information on the many ways you can get news directly from us. We are, of course, on twitter@twitter.com. Datastories. We have a Facebook page@Facebook.com, data stories podcast. And we now also have a newsletter. So if you want to get news directly into your inbox, go to our homepage datastory es and look for the link that you find on the right. One last thing I want to tell you is that we love to get in touch with our listeners, especially if you want to suggest way to improve the show, amazing people you want us to invite or projects you want us to talk about. So do get in touch with us. That's all for now. See you next time. Thanks for listening to data stories data stories is brought to you by Qlik, who allows you to explore data relationships within your data that lead to meaningful insights. Let your instincts lead the way to create personalized visualizations and dynamic dashboards with Qlik sense, which you can download for free at Qlik deep data stories. That's Qlik dear.",
      "id": "ep_65_ut_233"
    }
  ],
  "confidence": 0.918168680453734,
  "audio_duration": 4580,
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_status_code": null,
  "webhook_auth": false,
  "webhook_auth_header_name": null,
  "speed_boost": false,
  "auto_highlights_result": null,
  "auto_highlights": false,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_audio_quality": null,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "content_safety": false,
  "iab_categories": true,
  "content_safety_labels": {
    "status": "unavailable",
    "results": [],
    "summary": {}
  },
  "language_detection": false,
  "language_detection_threshold": null,
  "language_confidence": null,
  "custom_spelling": null,
  "throttled": false,
  "auto_chapters": true,
  "summarization": false,
  "summary_type": null,
  "summary_model": null,
  "custom_topics": false,
  "topics": [],
  "speech_threshold": null,
  "speech_model": "best",
  "chapters": [
    {
      "summary": "I have to say that it's all about storytelling. I'm not going to call this the year of storytelling, but people are making progress. From my perspective, I've seen a lot of mentions of the word virtual reality. Is it a gimmick or is it not? Is it lasting?",
      "gist": "2016: The Year of Data Stories",
      "headline": "I think people are making progress on virtual reality. And I think we've seen some really interesting news pieces",
      "start": 240,
      "end": 53154,
      "id": "ep_65_ch_0"
    },
    {
      "summary": "This episode is actually about what happened in 2015. It's our classic now year review. We have Andy Kirk from visualizing data and Robert Kosara from Tableau Software. Finally, we made it. Another year. Crazy.",
      "gist": "2016: A Year in the Life",
      "headline": "This episode is about what happened in 2015",
      "start": 63924,
      "end": 113984,
      "id": "ep_65_ch_1"
    },
    {
      "summary": "2015 has been our most prolific year ever, with a total of 22 episodes, including this one. We finally have a good rhythm, I think. Of course, we have to thank our listeners.",
      "gist": "2016",
      "headline": "2015 has been our most prolific year ever with 22 episodes produced",
      "start": 114744,
      "end": 202984,
      "id": "ep_65_ch_2"
    },
    {
      "summary": "The most downloaded episodes this year were, number one, Amanda Cox on her work with the New York Times. The third one was on visualizing human development with Max Rose. And these were the most popular ones this year.",
      "gist": "Top 3 Podcast Episodes of the Year",
      "headline": "The most downloaded episodes this year were, number one, Amanda Cox",
      "start": 204714,
      "end": 260504,
      "id": "ep_65_ch_3"
    },
    {
      "summary": "Andy, discuss the emergence of catagram techniques, hexagon bin maps, grid maps. Robert, what's your major trend of 2015? It's all about storytelling, and we've seen some interesting news pieces.",
      "gist": "Major Trends in Data Journalism in 2015",
      "headline": "Andy and Robert discuss the major trends of 2015",
      "start": 261924,
      "end": 440676,
      "id": "ep_65_ch_4"
    },
    {
      "summary": "A lot of visualization applied to machine learning or using machine learning for visualization. I would love to see more visualization, people collaborating with machine learning people to do things even better. Machine learning and AI have been huge this year. I want to know how it plays out next year.",
      "gist": "Top 3 trends in machine learning and visualization",
      "headline": "A lot of visualization applied to machine learning or using machine learning for visualization",
      "start": 440860,
      "end": 525534,
      "id": "ep_65_ch_5"
    },
    {
      "summary": "You mentioned image processing. A lot of work referred to images, like combining photography or taking lots of photos. Too, but also working with videos, or taking images as material, or synthesizing images. The relation of photography and videography and data visualization has become very interesting.",
      "gist": "Photography and Data Processing",
      "headline": "You mentioned image processing. I think that was very interesting",
      "start": 525834,
      "end": 565904,
      "id": "ep_65_ch_6"
    },
    {
      "summary": "Virtual reality needs a lot of experimentation. Once VR viewers are much more affordable, people will start exploring much more. I put my money on augmented reality. But for data visualization, I'm not sure if this is going to go anywhere.",
      "gist": "Vineland: Is It a gimmick or Real?",
      "headline": "Is virtual reality something that will last or is it just a gimmick",
      "start": 566284,
      "end": 749526,
      "id": "ep_65_ch_7"
    },
    {
      "summary": "There's a sense that there's still certain tension between whether in visualization itself, there is mobile first or desktop first and mobile second. But from my view, it has become much more normal to start mobile first and to be fully responsive.",
      "gist": "Is Mobile First or Desktop First for News?",
      "headline": "There's still a tension between desktop first and mobile second in visualization",
      "start": 749590,
      "end": 842706,
      "id": "ep_65_ch_8"
    },
    {
      "summary": "What were the big issues and debates this year? What do you recall? We had a few ones. Of course, the visualization community is not shy of opinions. Can we make beautiful visualizations of horrible events? That's one of the big tensions.",
      "gist": "2017's biggest issues in data visualization",
      "headline": "David McCandlish: What were the big data visualization debates this year",
      "start": 842810,
      "end": 1207618,
      "id": "ep_65_ch_9"
    },
    {
      "summary": "Stephen Fus criticism of data visualization research in general and a particular paper by Michelle Borkin and others on memorability. The discussion is trying to stay on track, but it's also hard because people get very technical. I think some reality check is fine.",
      "gist": "The Data Visualization Debate",
      "headline": "Stephen Fus criticism of data visualization research has sparked heated debate",
      "start": 1207786,
      "end": 1386806,
      "id": "ep_65_ch_10"
    },
    {
      "summary": " 52 weeks data postcards, primary data on unique subjects related to each other's lives. A visual display of all the different complicated and less so tax bracket thresholds in the US over 100 years. The real essence of visualization in my mind.",
      "gist": "What Were Your Favorite Visualizations?",
      "headline": "What were your favorites visualization projects from last week",
      "start": 1386870,
      "end": 1500284,
      "id": "ep_65_ch_11"
    },
    {
      "summary": "The latest episode of Data Science features visualization projects. What I really liked was network effects by Jonathan Harris and Greg Hochmut. I also like the Seagull Skytrails project. These projects really give people new ways of thinking, and I love that.",
      "gist": "Top 5 projects using data visualization",
      "headline": "There were some great visualization projects that I ran across recently",
      "start": 1501744,
      "end": 1683750,
      "id": "ep_65_ch_12"
    },
    {
      "summary": "There are a number of really interesting papers that were published this year. One paper looked into what makes visualization memorable. There's more stuff coming next year, some of the stuff that I'm doing and other people are working on.",
      "gist": "A look at the year in visualization",
      "headline": "There were a number of interesting academic papers published this year on visualization",
      "start": 1683902,
      "end": 1931870,
      "id": "ep_65_ch_13"
    },
    {
      "summary": "Andy looks at how people learn to read visualizations. What kind of factors really help and aid or hinder the process of everyday people. We will do a dedicated episode on literacy in the next year.",
      "gist": "How to Read data visualizations",
      "headline": "Andy, how about the literacy stuff? Last year we've been mentioning a little bit",
      "start": 1932042,
      "end": 2139256,
      "id": "ep_65_ch_14"
    },
    {
      "summary": "Enrico: What stuck out this year as important trends in academia? In academia, I think. I've seen even more of this visualization done in the wild. With all these new devices, of course we will see more visualization in these tiny, small devices.",
      "gist": "Top 10 trends in academia for 2017",
      "headline": "Robert: I've seen more visualization done in the wild this year",
      "start": 2139400,
      "end": 2245594,
      "id": "ep_65_ch_15"
    },
    {
      "summary": "Qlik Data Stories is brought to you by click, who allows you to explore the hidden relationships within your data that lead to meaningful insights. Marie explains what data literacy is and how we can design visualizations that stretch people's literacy without necessarily shying them away. Thanks again to Qlik for sponsoring us.",
      "gist": "Qlik Data Stories",
      "headline": "Qlik Data Stories helps you explore hidden relationships within your data",
      "start": 2245674,
      "end": 2374216,
      "id": "ep_65_ch_16"
    },
    {
      "summary": "This has been the year of Gregor Eiche for Team Europe. The appointment of Alan Smith OBE to the Financial Times was a significant milestone. Domestic data streamers had a fantastic year. There seems to be a good ecosystem of smaller but very ambitious companies in London.",
      "gist": "A Year in the Life of Data Science",
      "headline": "Most notable changes in visualization this year were companies, institutions",
      "start": 2374320,
      "end": 2600654,
      "id": "ep_65_ch_17"
    },
    {
      "summary": "There are two books on storytelling and presenting data, which is interesting. Stephanie Evergreen and Cole Nussbaum are both practitioners who work in the space of doing workshops and training courses for normal organizations. It's a nice addition to the bookshelf.",
      "gist": "Other books on storytelling and presenting data",
      "headline": "There are two books on storytelling and presenting data that have been published",
      "start": 2601914,
      "end": 2708052,
      "id": "ep_65_ch_18"
    },
    {
      "summary": "One specific topic that I would like to know more is more the narrative side of visualization. I find that this area of visualization is not very well developed right now. It would be really nice to have someone presenting. Not next year, but, you know, you should do it.",
      "gist": "The Narrative Side of Data Visualization",
      "headline": "One specific topic that I would like to know more about is narrative visualization",
      "start": 2708148,
      "end": 2778184,
      "id": "ep_65_ch_19"
    },
    {
      "summary": "The year in books has been slow, but I think we can actually expect big things for 2016. Tamara Kirk's book is due out in May. Alberto Cairo just tweeted he's almost finished with his follow up to the functional art. Hockey camos is working on a book that should be interesting.",
      "gist": "2015's books in publication",
      "headline": "I think the year in books has been slow. I think it was a bit slow",
      "start": 2778224,
      "end": 2956134,
      "id": "ep_65_ch_20"
    },
    {
      "summary": "So what happened in 2015 in terms of blogs and related stuff? Enough about old media. Let's talk about the, this old medium. There are these two guys that are still blogging around. Newsletters is the future. No, but seriously, I mean, passenger pigeons.",
      "gist": "Bloglines: The Old Media",
      "headline": "So what happened in 2015 in terms of blogs and related stuff? Right. Enough about old media. Let's talk about the, this old medium",
      "start": 2956834,
      "end": 2997464,
      "id": "ep_65_ch_21"
    },
    {
      "summary": "Andy Kirk just won the information is beautiful award for the best website. Eager eyes will be ten years old next October. Flowing data is still around, too prolific as ever. But the channels are changing and so that's good and bad.",
      "gist": "Andy Kirk Wins a Webby",
      "headline": "Robert Kaplan: I think this idea of having an archive is certainly useful",
      "start": 2998764,
      "end": 3163434,
      "id": "ep_65_ch_22"
    },
    {
      "summary": "It looks like the market of blogs stabilized around really few ones. What do you think is happening? Is it more that there's no space for more blogs or people are just switching to other media. I would love to see more blogs published by academics like myself.",
      "gist": "A few blogs are disappearing",
      "headline": "It looks like the market of blogs stabilized around really few ones",
      "start": 3163514,
      "end": 3382220,
      "id": "ep_65_ch_23"
    },
    {
      "summary": "Robert: It's been a great year for podcasting, for sure. In the area of the new data related podcasts, there are a few new ones out there. Tableau wannabe podcast hosted by Matt Francis and Emily Kunz. Let's hope it continues.",
      "gist": "2017: The Year in Data Podcasts",
      "headline": "In the area of new data related podcasts, there are a few new ones",
      "start": 3382332,
      "end": 3476954,
      "id": "ep_65_ch_24"
    },
    {
      "summary": "Robert: Now the company guy gets to talk about tools. How is the landscape changed? What's your perception? Robert? You do work for a tools company. Maybe you have some insight.",
      "gist": "Libraries and Tools in the 21st Century",
      "headline": "Robert: How has the landscape changed when talking about software and tools",
      "start": 3479694,
      "end": 3501290,
      "id": "ep_65_ch_25"
    },
    {
      "summary": " visible. was really built as a research project, actually. First to see how would you do a touch interaction at all. Started super simple and then eventually turned into a little product. It's actually free.",
      "gist": "Using Tableau 2 for iPad",
      "headline": "visible is a new visualization tool for iPad that's free",
      "start": 3501462,
      "end": 3552704,
      "id": "ep_65_ch_26"
    },
    {
      "summary": "There is many eyes, which has been folded into Watson analytics. So many eyes was, I think, a really important project for how we think about data visualization. But there are also good news developments.",
      "gist": "Many Eyes: The Future of Data Visualization",
      "headline": "Many eyes was a really important project for how we think about data visualization",
      "start": 3553644,
      "end": 3933054,
      "id": "ep_65_ch_27"
    },
    {
      "summary": "Robert: I really like Openviz. It's a really good conference based around open technologies like JavaScript. The tapestry conference is also going to be in its fourth year next year. For next year, I want to go to more unusual places, like not just New York and London.",
      "gist": "TIP: The Story Conference",
      "headline": "Robert: What were some of the highlights of this year's OpenViz conference",
      "start": 3934154,
      "end": 4216424,
      "id": "ep_65_ch_28"
    },
    {
      "summary": "What's going to be big storytelling in 2016? Of course. It's huge, man. It already is. And more stuff coming up. From my perspective, it's perhaps less about a theme, but more about the opportunities that next year brings.",
      "gist": "2016",
      "headline": "What do you think will be big storytelling trends in 2016",
      "start": 4216464,
      "end": 4489774,
      "id": "ep_65_ch_29"
    },
    {
      "summary": "Data stories is brought to you by Qlik, who allows you to explore data relationships within your data that lead to meaningful insights. We love to get in touch with our listeners, especially if you want to suggest way to improve the show. See you next time.",
      "gist": "Deep Data Stories: Podcast Review",
      "headline": "Before you leave, we have a request if you can rating data stories on iTunes",
      "start": 4493154,
      "end": 4580394,
      "id": "ep_65_ch_30"
    }
  ],
  "disfluencies": false,
  "entity_detection": false,
  "sentiment_analysis": false,
  "sentiment_analysis_results": null,
  "entities": null,
  "speakers_expected": null,
  "summary": null,
  "custom_topics_results": null,
  "episode_num": 65,
  "episode_metadata": {
    "speakers": [
      "Robert Kosara",
      "Andy Kirk",
      "Moritz Stefaner",
      "Enrico Bertini"
    ],
    "WPid": "476",
    "url": "https://datastori.es/podlove/file/1696/s/feed/c/mp3/ds-65.mp3",
    "episode_title": "What Happened in Vis in 2015? Year Review with Andy Kirk and Robert Kosara"
  }
}