{
  "id": "9c97a94b-c616-40a8-984b-cbce24ecc1a8",
  "language_model": "assemblyai_default",
  "acoustic_model": "assemblyai_default",
  "language_code": "en_us",
  "status": "completed",
  "audio_url": "https://datastori.es/podlove/file/6612/s/feed/c/mp3/157-spatial-thinking-with-barbara-tversky.mp3",
  "utterances": [
    {
      "end": 3810,
      "speaker": "Barbara Tversky",
      "start": 160,
      "text": "We've not just designed the world, we've diagrammed it.",
      "id": "ep_157_ut_0"
    },
    {
      "end": 34610,
      "speaker": "Enrico Bertini",
      "start": 23390,
      "text": "Hi, everyone. Welcome to a new episode of Data stories. My name is Enrico Bertini, and I am a professor at New York University in New York City, where that I teach and do research in data visualization.",
      "id": "ep_157_ut_1"
    },
    {
      "end": 53590,
      "speaker": "Moritz Stefaner",
      "start": 34770,
      "text": "Right. And I'm Moritz Stefaner. I'm an independent designer of data visualizations. In fact, I work as a self employed truth in beauty operator, normally out of my office in the countryside in the north of Germany. But right now I'm in the Bay Area helping a few tech companies with their data visualization needs. But I'll be back soon. No worries.",
      "id": "ep_157_ut_2"
    },
    {
      "end": 66398,
      "speaker": "Enrico Bertini",
      "start": 54050,
      "text": "Sounds great. Yes. And on this podcast, we talk about data visualization, analysis, and more generally the role data plays in our lives. And usually we do that together with a guest we invite on the show.",
      "id": "ep_157_ut_3"
    },
    {
      "end": 88006,
      "speaker": "Moritz Stefaner",
      "start": 66494,
      "text": "That's right, and we have a fabulous guest coming up. But just before we start, a quick note. Our podcast is listener supported. There are no ads. But that also means if you do enjoy the show, you could consider supporting us. You can either do that with recurring payments on patreon.com Datastories or just send us a one time donation on Paypal me Datastories.",
      "id": "ep_157_ut_4"
    },
    {
      "end": 128852,
      "speaker": "Enrico Bertini",
      "start": 88118,
      "text": "Okay, so let's get started. I am very excited as well. So today with us, we have one of my favorite researchers in the world. We have Barbara Tversky. Barbara is a professor of psychology at Stanford University and also a professor of psychology and education at the Teachers college at Columbia University. She's a leading cognitive psychologist, and she's done a lot of research on spatial cognition and cognitive psychology in general. And of course, as you may imagine, is highly related to, to data visualization and information design. So welcome on the show, Barbara.",
      "id": "ep_157_ut_5"
    },
    {
      "end": 131520,
      "speaker": "Barbara Tversky",
      "start": 128996,
      "text": "Thank you. I'm honored to be here.",
      "id": "ep_157_ut_6"
    },
    {
      "end": 141920,
      "speaker": "Enrico Bertini",
      "start": 132060,
      "text": "So we always ask our guests to introduce themselves at the beginning. Can you tell us a little bit about yourself? What is your background and main interests?",
      "id": "ep_157_ut_7"
    },
    {
      "end": 252250,
      "speaker": "Barbara Tversky",
      "start": 142420,
      "text": "Thank you. As you said, I'm a cognitive psychologist. I'm a bit of a contrarian. And when I entered graduate school, the view was that thinking happened in language. Language was the basis, and I started thinking that spatial cognition takes up half the cortex. It evolved before language. Animals can do very intelligent things without language. They can even tell the difference between 80 and 85 things without counting. That wasn't known then. Babies do intelligent things without language. So it seemed to me that spatial cognition had its own logic, different from language and preceding language, and that that needed to be explored. So I sort of went about it first here and there and then I realized that I was on a path that made sense and first looked at how we brought the mind into the world, or the world into the mind, the spaces that we inhabit of our body, around the body of exploration, and how they are distorted by our perception and action. And then I got interested in the spaces we create in the world, not just for physical well being, but really for cognitive well being. And those things are around us everywhere, the notes we take in classes and certainly the visualizations that both of you create so beautifully. So. And then the design of the world. So that occupied me step by step through a long career.",
      "id": "ep_157_ut_8"
    },
    {
      "end": 279188,
      "speaker": "Enrico Bertini",
      "start": 253430,
      "text": "Yes. And I think this is the main basis of your new book. It's called mind in motion, and it's a fascinating journey around these topics that you just mentioned, and I guess, many years of research. And I'm wondering if you can give us a very short summary of what the core argument of the book is.",
      "id": "ep_157_ut_9"
    },
    {
      "end": 447910,
      "speaker": "Barbara Tversky",
      "start": 279284,
      "text": "So the core argument is that spatial thinking is the foundation of all thought. It's not the entire edifice, but it's the foundation. And the evidence comes from brain work. I'll say a bit about that. It comes from language, and it comes from gesture and visualizations, which use space and marks in space in meaningful ways and are a much more direct way of communicating than language. So if I gesture something's up, or say something's up, you know right away what it means, whereas the words differ in every language. So back to the brainwork. The brain work was really cinched by the Nobel Prize, I think, in 2014, which looked at rat and found single cells that respond to places where rats are as they explore. And next door, one synapse away were grid cells that mapped these places on a map by proximity. And the subsequent work on human beings established that the place cells represent ideas or people or events in time, and then they get mapped on a temporal or conceptual or social species on the same grid cells. So the same brain structures that subserve cognition also subserve conceptual thought. So that seemed to cinch the case and that the work on humans is very new. It's the last four or five years, so it's taken time. The work on language think about how we talk about ideas. We talk about ideas as if they were objects. We raise them, we kick them around, we put them forth, we tear them apart. And I don't think these are metaphors. I think we have no other way of talking about ideas except as if they were objects. The talk gets into gestures. So when we raise ideas, we make a gesture of raising when we tear them apart, it's a gesture. And, again, those gestures communicate very directly, and we have nice evidence for that. So do others. That gestures help your own thinking and help the thinking of others.",
      "id": "ep_157_ut_10"
    },
    {
      "end": 484080,
      "speaker": "Enrico Bertini",
      "start": 448330,
      "text": "Yeah. It's amazing how, going through the pages of your book, I kept thinking, oh, my God, even this one thing is all about space, right? You provide so many examples, and in the end, it feels pretty much like everything we do with our brain has some connections with space. And, of course, then you have a large section on your book where you talk about how this translates into the way we think, with visual representation and diagrams and all the rest. So that's really fascinating.",
      "id": "ep_157_ut_11"
    },
    {
      "end": 532270,
      "speaker": "Barbara Tversky",
      "start": 484420,
      "text": "Thank you. I mean, you even think we all have to move in space in order to survive and interact with things in space. Even plants that are rooted to the ground need to move toward the sun or away from wind, so that they need to be active and acting in space, even plants. So it feels in that way that spatial cognition had to be important to life from the get go, and that life, that evolution, builds new structures on old. So the fact that abstract thought is based in spatial thoughts that can be quite concrete, makes perfect sense.",
      "id": "ep_157_ut_12"
    },
    {
      "end": 592790,
      "speaker": "Enrico Bertini",
      "start": 532610,
      "text": "Yes. I think another thing I really like about your book is that throughout the book, as you provide, as you describe, research on spatial reasoning and many examples about the way space plays a major role in the way we think, you also lay out, little by little, a number of laws of cognition. I think, in total, you have nine laws of cognition, and you keep in talking about them in different examples throughout the book. And I'm wondering if we can. If you can describe some of these laws. I guess we don't have enough time to go through all of them, but these are so useful, it makes you think about how things really work, and many of them are about trade offs, which I think is really important in visualization design. Can we talk about some of them? I think maybe we can start from there are no benefits without cost.",
      "id": "ep_157_ut_13"
    },
    {
      "end": 718434,
      "speaker": "Barbara Tversky",
      "start": 593210,
      "text": "Sure. Thank you. Yeah, I really brought them there partly to show that what's happening in spatial cognition is far more general than just spatial cognition. So no benefits without costs and trade offs. And I think it's really hard for people to think in terms of trade offs. Categories are more useful, and we tend toward categories. The polarization in the world now is bringing a continuum into polarized categories, and they're very efficient. They summarize a lot of knowledge. They allow us to respond very quickly. So babies come into the world not knowing what are chairs and tables and carrots people and trees and bicycles. They don't have these categories, but they need to form them very quickly so that they can act in the world and respond to those things. We need to know right away, is that edible or not edible? Is it threatening or not threatening? So that we form those categories very quickly. They make cognition efficient. They allow us to act quickly in the world, but they have a cost. We can make errors. We can think that a toy pistol is a pistol or that even something that isn't gun like is a gun. So we can miscategorize. That's the cost of the benefit of categorizing. And I think people sometimes lose sight even of that, that they say we stereotype and categorize as if doing that we're bad, but we can't function without it. Yes, we make mistakes sometimes and have to find ways to prevent some of them, to recover from some of them and so forth, but we can't help but do it.",
      "id": "ep_157_ut_14"
    },
    {
      "end": 729302,
      "speaker": "Moritz Stefaner",
      "start": 718522,
      "text": "Yeah. So no model is perfect. Of course. The map cannot be as large as the territories. Is that also what you're saying there? Respect to cognition?",
      "id": "ep_157_ut_15"
    },
    {
      "end": 745130,
      "speaker": "Barbara Tversky",
      "start": 729406,
      "text": "Yeah, I mean, I think people want firm guidelines. Do x, do y. But any of those firm guidelines are going to have a cost, and we have to pay attention to both the benefits and the costs.",
      "id": "ep_157_ut_16"
    },
    {
      "end": 767860,
      "speaker": "Enrico Bertini",
      "start": 745670,
      "text": "Do you think this is also related to, say, heuristics? Right. The fact that we can very quickly make decisions with heuristics. But, of course, as we know, sometimes they're wrong. Right? So, again, I guess there's a trade off there. We are either fast but wrong or slow. And then it takes a long time.",
      "id": "ep_157_ut_17"
    },
    {
      "end": 904162,
      "speaker": "Barbara Tversky",
      "start": 768320,
      "text": "Right. And being slow doesn't guarantee that we'll be correct either. Some problems are just too hard to solve. We don't have enough information where our imaginations are limited. But sure, the quick categorization certainly maps onto what Kahneman and others have called system one. Right. And the slower way of thinking on system two. System two is also going to be spatial in many cases, that we arrange our thoughts in hierarchies, sometimes in categories, in orders and so forth. So even system two will have a spatial basis in many cases for how we organize our thinking and how we organize our problem solving and our creativity. So, I guess one here, I want to make a slight jump in contrast, learning and creativity. So, learning, we need to learn certain things, like how to solve algebra problems or how to count, how to multiply, how to make sense of certain things. And we overlearn those. And they require having a strong association from a to b or a to b, to c and so forth. But in order to be creative, we have to unlearn some of those things. And so there's even a tension there of what benefits learning and makes us more agile in the world. And solving certain problems works against innovation and creative thinking, where you have to violate that ABC order and come up with other orders. So I guess you don't just look at the cognitive, at what's happening in the mind, but also what's the goal of the task. And in some cases, we want to get rid of those fast associations and think completely differently.",
      "id": "ep_157_ut_18"
    },
    {
      "end": 929420,
      "speaker": "Enrico Bertini",
      "start": 904306,
      "text": "And I think this is also related to another law that you lay out in your book. That's the third one. It's called feeling comes first before recognition, which I think it also has interesting parallel with the way people actually perceive visual information. Can you briefly describe what this law is about?",
      "id": "ep_157_ut_19"
    },
    {
      "end": 1088052,
      "speaker": "Barbara Tversky",
      "start": 929800,
      "text": "So this is work of Robert Zajonc, who's unfortunately no longer with us. He did recognition memory for meaningless shapes. So he showed meaningless shapes over and over again. And he had to say was, did you see that one before or not? So that's memory. But he also assessed feelings, whether people liked them or not. And it turned out that the more frequently you would see this shape, the more you liked it. So that's perhaps a lesson in social attachments as well. Seeing someone frequently can engender affection. But what happened in sciences studies was that people, the liking increased before the recognition memory. So people somehow the affect system sensed that this was a familiar object, but the memory recognition system didn't realize that that particular meaningless shape had been seen before. So people were quicker on the affect, building up affect and building up a memory, and they were independent, which again, I think is interesting, and it's reflected again in a phenomenon that I didn't research, but others had prosopagnosia. So there are people who can't recognize faces. They know it's a face, but they don't know whose face it is. And this can be extremely embarrassing. You meet people on many occasions, don't recognize them, and they may be insulted. So now that it's known that that's something that the brain does, I think it's socially easier. People compensate by picking up voices or picking up clothing. But prosopagnosia can be a problem nevertheless. It does not. Prosopagnosia, not recognizing individual faces, doesn't interfere with recognizing the emotion on the face. So again, these systems are partly different, and adding to the mysteries of the brain that you can, again, somehow recognizing a face. Recognizing a nonsense object is independent of recognizing an emotion that's associated with the face or the object. Yeah.",
      "id": "ep_157_ut_20"
    },
    {
      "end": 1149780,
      "speaker": "Enrico Bertini",
      "start": 1088076,
      "text": "This makes me think about, what do you think is the role of feelings and emotion, more specifically in data visualization? I think there are people who've been discussing about the role of emotion in visualization and also, and also about how pleasing something is. This makes me think about, I think there was also a book published by Don Norman a few years back, discussing the idea that pleasing things are not just pleasing, which is important, of course, but they may also help people perform better in general. Right. So there is also a crossover to, say usability or functionality. So there's not necessarily a dichotomy between something that looks or feels good and something that helps you do things better or. Right.",
      "id": "ep_157_ut_21"
    },
    {
      "end": 1301544,
      "speaker": "Barbara Tversky",
      "start": 1150520,
      "text": "Yeah, no, I think it's an important point. I mean, too much emotion can be distracting. You want the feelings to engage people to learn more or see more, especially with a visualization. You don't want to leave them just in a state of bliss or a state of fear. You want to engage them. And certainly those things can engage. They're a kind of social glue. I remember going to a conference once where someone, a product designer, was showing a coffee dispenser that was dressed like a butler and bowed slightly when it gave the coffee. And it was right, it was amusing, it warmed you to it, it made you in collusion with it. So it established a social bond very quickly. And sure, visualizations can do that too. And I mean, in some ways, if you look at human beings, perhaps most abstractly, I'm not sure that's the right word, but approach avoidance is a big thing throughout evolution. Should I get closer to something? Should I move away? And that's emotion, or that's the essence of emotion. There are many different emotions, but are there ones that bring you closer or want you to go closer and one that want you to go away? So humor and aesthetic appeal can bring us closer, make us part of, feel good. About the brand or about the visualization? Certainly what making a visualization aesthetically pleasing, using food, fruits and vegetables, for example, to display quantitative information, what that can do too is make it memorable. And you look at all these graphs and line charts and bar graphs that come out of excel programs or some other program, they all look alike. And by the time you've added some humor or some aesthetic value that's individual to a visualization, you've made it distinctive. And again, you want it to be in the service of the information, not just decorative or clever, but something that is inherent in some way.",
      "id": "ep_157_ut_22"
    },
    {
      "end": 1359792,
      "speaker": "Moritz Stefaner",
      "start": 1301632,
      "text": "Yeah. And what I found really interesting here is that the. Well, first of all, some people, maybe in the past, thought, oh, the mind is like a computer, or eyes are like cameras, right? And they work very objectively, whereas simple. And I think the last few decades have shown this is not quite the case. And as you just said, the tone and the whole non explicit and nonverbal dimensions of communication are so important also in how we then perceive the message. And if I read the middle of your book, right, you're even saying it can even override the whole content of what's happening, or we cannot maybe even conclusively separate actions and perceptions and tone and content, because it all becomes part of this blended experience. And our prior knowledge or our feelings might even override what we see or not see in a given situation. Is that right?",
      "id": "ep_157_ut_23"
    },
    {
      "end": 1460378,
      "speaker": "Barbara Tversky",
      "start": 1359936,
      "text": "Jerry Bruner and Molly Powder, years ago, did a lovely experiment where they showed people photographs, and one group saw the photographs in full focus and had to identify what was in the photograph. The other groups saw them out of focus, and they gradually came into focus. But as they were, they were. Some of them were very unusual photographs. The one that I remember best is an odd view of a fire hydrant. So people looking at the outer focus fire hydrant would generate hypotheses of what it might be. And then when it was in full focus, couldn't see what it was. So despite the fact that it was in full focus and they could see it, it was right in front of their eyes. The prior hypotheses prevented them from seeing what they were seeing. So this is an example of confirmation bias, but it's such a concrete example. You're looking at it and you still can't see it. And I think, as far as the looking goes, that's true of many scenes in the world. Visualizations that seeing it isn't, understanding that it takes more effort and more work to understand or even identify what it is you're seeing. And it's something that I think lay people may not, even professionals don't understand. When you and I are looking at the same thing, we're not seeing the same thing necessarily.",
      "id": "ep_157_ut_24"
    },
    {
      "end": 1515760,
      "speaker": "Enrico Bertini",
      "start": 1460514,
      "text": "This reminds me, I think there's a paper that has been published last year that tries to investigate exactly this kind of problem with data visualization. I think it's called the curse of knowledge in the. In visual data communication, and it's beautiful. It actually investigates exactly the law that you described here. They show the same graph to different people, and people see completely different things, and it can be manipulated, of course, according to what aspects of the graph are accentuated or highlighted. I think we have this weird notion that there's a neutral way we can extract information from visual representations, but nothing can be further from the truth, right?",
      "id": "ep_157_ut_25"
    },
    {
      "end": 1551088,
      "speaker": "Barbara Tversky",
      "start": 1517780,
      "text": "I mean, an example. No one can see the COVID of my book now, but the COVID of my book has something that looks like a network. It turns out to be a man running. And there are people that look at the COVID and see the network or constellation, don't see the man. And there are people that see the man and don't see the constellation. And they, again, they're looking at the same thing but getting very different interpretations of it.",
      "id": "ep_157_ut_26"
    },
    {
      "end": 1570828,
      "speaker": "Moritz Stefaner",
      "start": 1551144,
      "text": "That also hints at that we just, again, don't see things as they are, whatever that means, but more, always look for what is it? What could I recognize in this? Or how could I categorize that, as you hinted at at the beginning, and that we can't help it? It's just what we do, right?",
      "id": "ep_157_ut_27"
    },
    {
      "end": 1625500,
      "speaker": "Barbara Tversky",
      "start": 1570884,
      "text": "I mean, Lee Ross, who's a brilliant social psychologist, calls it naive realism, that we assume that everybody else is understanding the world the way we are. I have a cousin, and before an election many, many years ago, he said to me, I don't see how anyone can see the facts and vote for anyone but x. And my thought was, I don't see how anyone can see the facts and vote for anyone but y. So that assumption that we're all reading the facts the same way, is also incorrect. And another example of how cognition mirrors perception, that the same phenomenon that's happening in our perception of space and perception of things in space is happening in our abstract thinking.",
      "id": "ep_157_ut_28"
    },
    {
      "end": 1676070,
      "speaker": "Moritz Stefaner",
      "start": 1626040,
      "text": "And just to so we can close that arc, because the book has this beautiful arc, you start off with all these fundamental laws of cognition, all the things we've learned, and then towards the end, yeah, sharpen really this thought about how spatial thinking is on the foundation of everything. And then, to me, the sort of surprising and really cool twist that, well, on the one hand, we think spatially, and a lot of our internal processes have spatial dimensions to them, but that we also bring that back into the world and sort of flip this whole relationship between the mind and. And the world. And maybe you could tell us a bit more about how thought flows back into the world and what that can tell us, maybe, about cognition and data visualization.",
      "id": "ep_157_ut_29"
    },
    {
      "end": 1855850,
      "speaker": "Barbara Tversky",
      "start": 1676810,
      "text": "Yeah, sure. The world that we inhabit is so different from the world that our cave dwelling and nomadic ancestors inhabited, where most of what was around them was designed by nature. There were small things that human beings did, but most of the world was by nature designed. If you fly now over the world, there are very few places that haven't been cultivated in some way by people. And nowhere is that more obvious than in our homes and in our cities. So we organize our bookshelves by orders, we organize them by topics, so they're categorized. Our kitchens have plates on one shelf and bowls on another. And they're organized by size and shape, so that we've got categories and subcategories, namely hierarchies in our homes, in our kitchens, in our bathrooms and our bookshelves, certainly in our grocery stores. The vegetables are one, the food or another. Again, different categories in some categories. Our homes also have another way of organizing things, not categorical, but seams. So they bring together a number of different objects that are used for the same purpose. So in the bathroom we'll have everything for cleaning from different categories, the kitchen, everything for cooking, but again, from different categories. So those ideas about themes go into our broader cognition as well. When we're working on a project, we bring together everything that we need that's relevant to that project, or we're making a decision, what home to buy, what stock to invest in, which way to go, when we're on the streets. And again, we're bringing together all the information that seems relevant to solve that problem. So, themes, categories, hierarchies, we have one to one correspondences in our table settings. Everyone gets a plate and a knife and a fork and an action and a glass. And you can see that in facades of buildings. Every apartment has a certain number of windows, maybe a balcony associated with it. We have rows and columns in our buildings. So there is. We have recursion and repetition again in facades of buildings. Palladio was certainly acutely aware of that. Symmetries, repetitions. So there's a great deal of abstract knowledge that we've put into the world. And those, they don't intentionally communicate, but they certainly communicate to us what's going on there.",
      "id": "ep_157_ut_30"
    },
    {
      "end": 1894628,
      "speaker": "Moritz Stefaner",
      "start": 1855930,
      "text": "Yeah, this is what I find so mind blowing is that when you have, let's say, you have a well organized kitchen, right, or a well organized workshop, the thing becomes a map of itself in a way that we, let's say, in one drawer you put all the cutlery, and then you subdivide the cutlery into other things, and then you have eight knives and twelve forks, and they sort of represent themselves on that mental map or that physical map you have created. And basically, as you organize things so you can find them more easily or work with them in a good way. You're also creating a diagram of that thought process, maybe. Does that make sense?",
      "id": "ep_157_ut_31"
    },
    {
      "end": 1944966,
      "speaker": "Barbara Tversky",
      "start": 1894724,
      "text": "Yeah. No, absolutely. And if I'm looking at the world, I know it was designed, or it's a good anch that it was designed by a human being and for a reason. And then I can try to figure out the reason why was it designed this way? What is it telling me? And then those, and those patterns are good gestalts, so they catch the eye. They're not random, they're organized. So they catch the eye and provoke our thinking. And then the next step really, is that those patterns, rows and columns, we turn into visualizations. So the periodic table train schedules are rows and columns, very much like the rows and columns on buildings.",
      "id": "ep_157_ut_32"
    },
    {
      "end": 1951610,
      "speaker": "Moritz Stefaner",
      "start": 1945118,
      "text": "So is thinking and data visualization mostly about tidying up? Would you say it has a little to do with that?",
      "id": "ep_157_ut_33"
    },
    {
      "end": 2081540,
      "speaker": "Barbara Tversky",
      "start": 1952270,
      "text": "Yeah. I mean, I think, sure, you know better than I. But yes. Were putting things into cubbyholes or piles, as in bar graphs? Yes. Organizing numbers and smoothing them out in some way. And then if you go one step further, we've not just designed the world, we've diagrammed it. So if you look at an overview of an airport, there are paths for the trucks, paths for the airplanes, paths, people where they can go, where they can be. The suitcases and the meal trucks all go in different places. So it's a diagram governing people's movements and machines, movement in space. And the same thing happens in the streets where bicycles and go buses. If you can turn this way or not turn that way. So we've diagrammed the world as well as designed it. And I bring those thoughts together in a term. It's not a very pretty word, because Latin, a term sounds very pretty. It's called spraction, which is a contraction of space, action and abstraction. So the idea is that actions in space create abstractions like the one to one correspondence and categories and hierarchies. And those actions are actions of our body that create these spaces and they turn into gestures, thought. So there's a sort of cycle of creating abstractions with actions, and the actions get truncated into gestures and the structures that we've created. The rows and columns and one to one correspondences and categories get turned into visualizations that convey information deliberately. So it's a kind of cycle that you can enter at any point.",
      "id": "ep_157_ut_34"
    },
    {
      "end": 2162050,
      "speaker": "Moritz Stefaner",
      "start": 2081960,
      "text": "So one thing that keeps on coming up when we try to transfer that to design, like information design or interface design. So on the one hand, I totally agree, and it totally matches. Also, my experience is that if we design something in a way that resembles the natural world, that people have a much better grasp on it. If the metaphor you choose for presenting information, maybe, let's say growth, something grows, that it becomes bigger or it goes up, that's something. Okay, that totally makes sense if you grew up on planet Earth and have observed the physical world. On the other hand, we're dealing with things that are sometimes very abstract and high dimensional and very complicated, or they don't even have a good correspondence in the physical world, right? Like all the things happening online, or like the super complex systems we have built. So would you say we should always still try and find a physical metaphor because our thinking is intrinsically so physical and spatial that anything else just will never be so successful? Or are there some things where a high degree of abstraction and leaving the physical world can even help with perception or cognition?",
      "id": "ep_157_ut_35"
    },
    {
      "end": 2347990,
      "speaker": "Barbara Tversky",
      "start": 2162550,
      "text": "So just the way you lay out a diagram is meaningful. You just said it that good things go up because you need health and wealth and resources, basically to fight gravity. So a bar graph might be abstract, but the numbers go up and the quantities go up and so forth. So that's a very abstract way of bringing in the concrete, special world. I think networks do it as well. Our minds go from thought to thought along relations, the way our feet go from place to place along spatial paths, and people abstract maps, or I environments, to essentially networks. And then those networks can represent very abstract thoughts. So there's a modicum of space in any visualization now. It might not get back to trees and growing, but certainly our concepts of up and down and connections between ideas or connections between computer networks or social networks have a spatial quality that I think people quickly abstract, more of a metaphor, is going to be connected to the content. And there's always the worry that some metaphors may interfere because they don't go all the way, and people can make inferences that aren't right. So I worked with a colleague in chemistry, or several colleagues in chemistry, and they love animations that show chemical bonding or something. And I look at their animations, and in fact, this is a story for them. So it's hydrogen and oxygen. There are red balls and white balls, and they're going to bond in the visualization. If you're looking at the right place at the right time, you might miss it otherwise. But when he asks people afterward, what are they seeing? They say things like, I saw the red balls pushing the white balls to join. So there's no pushing of those molecules. They're moving randomly. But our human visual system can't help but see causal connections, and that's going to interfere with thinking about chemical bonding as random. And the movement is being in any. That upward movement may not be different from downward at that scale. So there's some. And that's a metaphor the students put. But it was frequent enough that it worried the designers. So that, again, how human beings interpreted what's going on we need to be aware of so that the interpretations don't interfere with the concept.",
      "id": "ep_157_ut_36"
    },
    {
      "end": 2364110,
      "speaker": "Moritz Stefaner",
      "start": 2349210,
      "text": "And again, just understanding how people talk about these things, or having them here explain what they think they have seen, can reveal all these things. And I think we should do that much more. Just have people tell us what they are seeing and the things we produce there.",
      "id": "ep_157_ut_37"
    },
    {
      "end": 2435620,
      "speaker": "Barbara Tversky",
      "start": 2365330,
      "text": "I couldn't agree more. We ran one study comparing displays that were attached to displays that were line graphs, and it gave. People asked people just to make inferences, and they loved it. They loved making inferences. But when we had line graphs, they couldn't. It was over time. They couldn't help but seeing things as processes that occurred over time. The tables gave them much more freedom to think about other things. Things like, why are people in the same place? It was people in different places at different times. Is there something about the place, not the time? So those two ways of visualizing produced very different kinds of inferences, and which one you want to buy. So they bias people toward making certain kinds of inferences and not others. And as a designer, you probably want to be aware of that and design something so that people will make the inferences that you have in mind, or give them the freedom to make many.",
      "id": "ep_157_ut_38"
    },
    {
      "end": 2451626,
      "speaker": "Moritz Stefaner",
      "start": 2436080,
      "text": "One thing I was also thinking about, if all of our thinking is spatial and, like, rooted so much in the physical world, shouldn't we build much more like sculptures or like spatial information displays or instead installations or Hughes virtual reality?",
      "id": "ep_157_ut_39"
    },
    {
      "end": 2563300,
      "speaker": "Barbara Tversky",
      "start": 2451818,
      "text": "So, I mean, there are always questions about that. What do you want people to learn? And what's the bay or infer? And what's the best way to display it? And it's going to be different things, I should say. It's very hard for people to think in three dimensions. It seems surprising because we negotiate a three dimensional world. But architects design their plans and their elevations on different pieces of paper. Because their plans are two dimensional, the elevations are two dimensional. And thinking right away in three is extremely hard. Product designers say the same thing, that they need to do a two dimensional cut of things, that thinking in depth is hard. So people can get trained to think in depth, but it's usually, the training is usually specific to a particular kind of visualization, so it won't transfer to another kind of two dimensional or three dimensional display. So that's something that, you know, computer scientists often create these wonderful environments that people can't really comprehend in an abstract way. If I'm moving through it and avoiding objects, that's one thing, but if I'm using it to understand a multidimensional world, it might be extremely difficult. So. Right, I mean, we have to take account of what, of what human beings can do with the information, especially because visualizations are usually representing something using spatial, using space and elements in it represents something far more abstract.",
      "id": "ep_157_ut_40"
    },
    {
      "end": 2688334,
      "speaker": "Enrico Bertini",
      "start": 2565080,
      "text": "So, Barbara, talking about the metaphors and the use of metaphors in data visualization, and there's this specific study and paper that you, you mentioned, and I think you described in your book as well, where you, you simply show a very simple line chart and the equivalent with exactly the same information with two bars. And as you just described, people have a completely different way of interpreting these visual representations, even if they depict exactly the same information. And I have to say that the first time I saw, saw your study, it had a big influence in me, because I come from the school of data visualization thought or theory that the best way to look at data visualization is under the lens of accuracy. And I think many of us have been greatly influenced by the work of Cleveland and McGill on the graphical perspective perception and the idea that there are some visual channels that enable us to extract information from visual representation more accurately. But then, when I saw your study, I was like, well, there's so much more than that, and it's so much more complicated, and it does resonate with practical problems that I end up having all the time. Right. That we, as visualization designers may have, may try to make choices under the lens of accuracy. But accuracy, while it is important, is not the beginning and it's not the end of data visualization. And we can't really make a lot of decisions if we only look at visualization design under this lens. So I was curious to hear, what do you think about it?",
      "id": "ep_157_ut_41"
    },
    {
      "end": 2902416,
      "speaker": "Barbara Tversky",
      "start": 2688382,
      "text": "I mean, you're summarizing my thoughts. Yeah. We're rarely looking at a table just to find out what size stockings I should buy, given my height and weight. And there. A table is probably better than any visualization because it's going to give me the exact number that I need and a bar graph. It's going to be harder to find the exact number and a line graph, two. So again, then you have to look at what am I using these data for? What kinds of inferences am I making? Or is your perceiver, observer or user? However you think of the person consuming the data, what do you want them to think? And what's the best way of displaying it? And our work on bar graphs and line graphs, this was work with a former student. Jeff Sachs, showed that plotting the same data as lines led people to think of the data as trends, because a line connects two points, in our case. So it's showing a relationship. It's saying a and b share an underlying variable. They just differ in the quantitative, authoritative representation of that variable. But there is a trend, a relationship between a and b, whereas bars are boxes, and they say there are a bunch of a's and a bunch of b's, and they're separate. We put them into different stacks so that that encourages discrete comparisons. And we found that the data, the way the data were displayed, overrode the underlying variable, so that even discontinuous categorical variables, when plotted as a line, were seen as a continuous variable. And that seemed interesting, that the visual form of the display was stronger than our understanding of the underlying variables. And we did this in the context of a whole series of studies where we were looking at people interpreting something visual and then giving them something verbal that was comparable and asking them to create a visual. So if we gave people trends and asked them to visualize it, they gave us line graphs. And if we gave people discrete comparisons and asked them to create a visualization, they gave us bars. So that was a kind of translation test, that we got the bars and lines translated quite well into trends and discrete comparisons. Whether we started with language or started with the visualization, we've done that with a number of different graphic, common graphic symbols. They really aren't devices. They aren't really symbols. And altogether, that research seems to suggest that these marks, lines and bars, arrows are another one, that they have meanings that are quite direct and reach people quite directly, again, faster than words and more directly than words.",
      "id": "ep_157_ut_42"
    },
    {
      "end": 2977320,
      "speaker": "Enrico Bertini",
      "start": 2902528,
      "text": "Yes, and I have a question related, another follow up question related to that. One thing I'm always wondering is there is a somewhat small set of graphs that are extremely widespread and popular, right. When I teach data visualization in class, I tend to talk. I tend to describe them as fundamental graphs because they are, you can see them pretty much everywhere. I'm talking about things like bar graphs, line charts, tables, all the most basic things. One question I have, how much of a. Do you think is an accident of history that we came up with these specific formats? Or maybe there's something deeper, say, in a parallel world, humanity would create the same kind of graphs. That's a curiosity that I've always had. Is it in our brain or how much of it is in our brain and the way in our brain is structured and how much of it is an accident of history?",
      "id": "ep_157_ut_43"
    },
    {
      "end": 2986900,
      "speaker": "Barbara Tversky",
      "start": 2977740,
      "text": "Yeah, I mean, we can't do those experiments. And when. And so much of it is western.",
      "id": "ep_157_ut_44"
    },
    {
      "end": 2988308,
      "speaker": "Enrico Bertini",
      "start": 2987060,
      "text": "Oh, yeah, yeah.",
      "id": "ep_157_ut_45"
    },
    {
      "end": 3235586,
      "speaker": "Barbara Tversky",
      "start": 2988404,
      "text": "Certain kinds of visualizations go way back. So if you cave drawings and petroglyphs all over the world, some seemingly by pre humans, you can find map like things that go back, and often they're showing two perspectives at once, an overview of the paths, a frontal view of the landmarks. So those go way back and appear in many places, so that's space. You get rudimentary numbers and tallies, one line for each object, whether it's sheep or people, whatever, it's counting. So time and again, those seem to be widespread across many cultures. You get events so stampedes and you find, in petroglyphs and in cave drawings, stampedes of animals. And Trajan's column, you find deeds of war and so forth. So those representing events seem to be pretty universal and representing time more abstract. So we have space abstractly in maps, and you can even find style maps that go back to antiquity, but also calendars representing time, not just as an event, like a stampede, but also time more abstractly. And people, objects, bows and arrows, you find all over the world, and stick figures, animals. So those seem to be things that people needed to represent long before they had written language and went to great efforts to represent. And there are still the things that appear in newspapers and books these days, people, objects and space, time and number still appears, and there are dedicated places in the brain for many of these, not all to recognize them. So it's another way that our brains mirror the world and the world mirrors our brains. As for going back to your original question, are these basic, fundamental graphs something that grow out of the brain or out of our human experience? And I can't help but say, yes, bar graphs represent piles. You know, we stack up our money and the pile gets higher when we stack it up, so it makes a higher bar graph. All over Europe, there are mostly, in Italy, there are towers that people build that are really high and so no function. They just showed that the local duke could build something that would be very tall, so he must be powerful, and they're falling down, some of them these days, so. Right. So I think at least bars feel very much like they're an expression, a direct expression of the mind. They also categorize things. So I put different things in different stacks, and that's something that we do in our kitchens, in our homes, and so forth. We categorize them. Bar graphs seem very intuitive to me and very natural line graphs are connecting the bars. So if I have a whole stack of bars, then the line will connect them over time or over space and summarize them in that way so they feel like they're one step a little removed from the directness of the bar graph, but still direct in that way.",
      "id": "ep_157_ut_46"
    },
    {
      "end": 3245880,
      "speaker": "Enrico Bertini",
      "start": 3235778,
      "text": "I think we could go on forever describing. Yeah. All the metaphors that hardbind every single graph out there. It's fascinating.",
      "id": "ep_157_ut_47"
    },
    {
      "end": 3279366,
      "speaker": "Barbara Tversky",
      "start": 3246300,
      "text": "Yeah. And tables. So tables, again, look like our bureaus, where we put our socks and underwear. Yeah. Like a shelf boxes for the different things. So there are a nice way of organizing our things and organizing our mind. And again, it's the way that we put our mind into the world. We put it into the world in gestures, facial expressions, and certainly in the spaces we design.",
      "id": "ep_157_ut_48"
    },
    {
      "end": 3298250,
      "speaker": "Moritz Stefaner",
      "start": 3279558,
      "text": "Yeah. No, that's such a powerful thought. And for me, that really connects so many dots in terms of why certain things work and others don't. And also, and I have much more ways to get inspired by just taking a good walk and find a good data visualization ideas in the city or in nature.",
      "id": "ep_157_ut_49"
    },
    {
      "end": 3301774,
      "speaker": "Enrico Bertini",
      "start": 3301350,
      "text": "Yeah.",
      "id": "ep_157_ut_50"
    },
    {
      "end": 3315358,
      "speaker": "Moritz Stefaner",
      "start": 3301822,
      "text": "So I think we'll have to wrap it up. We're already over our usual time, but for such a good conversation, we're happy to extend the programming. I think we should come to an end now. Thanks so much, Barbara, for joining us. Fascinating.",
      "id": "ep_157_ut_51"
    },
    {
      "end": 3323280,
      "speaker": "Barbara Tversky",
      "start": 3315454,
      "text": "Thank you. It's always a pleasure, and I hope our palace cross soon. Enrico, you're in New York.",
      "id": "ep_157_ut_52"
    },
    {
      "end": 3326996,
      "speaker": "Enrico Bertini",
      "start": 3323580,
      "text": "Yeah. I would love to get together. I would love it.",
      "id": "ep_157_ut_53"
    },
    {
      "end": 3328276,
      "speaker": "Barbara Tversky",
      "start": 3327108,
      "text": "I need to. Yeah.",
      "id": "ep_157_ut_54"
    },
    {
      "end": 3347142,
      "speaker": "Moritz Stefaner",
      "start": 3328348,
      "text": "That would be great. Yeah. And for our listeners, check out the book bind in motion. It's really a great summary of much more than we discussed today. We just barely scratched the surface, really, of all the great findings and interesting thoughts that are in there and. Yeah. Thanks so much for joining us, Barbara.",
      "id": "ep_157_ut_55"
    },
    {
      "end": 3347766,
      "speaker": "Barbara Tversky",
      "start": 3347246,
      "text": "Thank you.",
      "id": "ep_157_ut_56"
    },
    {
      "end": 3348398,
      "speaker": "Enrico Bertini",
      "start": 3347798,
      "text": "Thank you.",
      "id": "ep_157_ut_57"
    },
    {
      "end": 3350130,
      "speaker": "Barbara Tversky",
      "start": 3348494,
      "text": "Take care. Bye bye. Bye bye.",
      "id": "ep_157_ut_58"
    },
    {
      "end": 3377836,
      "speaker": "Moritz Stefaner",
      "start": 3354750,
      "text": "Hey, folks, thanks for listening to data stories again. Before you leave, a few last notes. This show is crowdfunded and you can support us on patreon@patreon.com, Datastories, where we publish monthly previews of upcoming episodes for our supporters. Or you can also send us a one time donation via PayPal at PayPal Me Datastories or as a free way.",
      "id": "ep_157_ut_59"
    },
    {
      "end": 3404444,
      "speaker": "Enrico Bertini",
      "start": 3377868,
      "text": "To support the show. If you can spend a couple of minutes rating us on iTunes, that would be very helpful as well. And here's some information on the many ways you can get news directly from us. We are on Twitter, Facebook and Instagram, so follow us there for the latest updates. We have also a slack channel where you can chat with us directly. And to sign up, go to our homepage at Datastory ES and there you'll find a button at the bottom of.",
      "id": "ep_157_ut_60"
    },
    {
      "end": 3413264,
      "speaker": "Moritz Stefaner",
      "start": 3404452,
      "text": "The page and there you can also subscribe to our email newsletter if you want to get news directly into your inbox and be notified whenever we publish a new episode.",
      "id": "ep_157_ut_61"
    },
    {
      "end": 3425888,
      "speaker": "Enrico Bertini",
      "start": 3413352,
      "text": "That's right, and we love to get in touch with our listeners. So let us know if you want to suggest a way to improve the show or know any amazing people you want us to invite or even have any project you want us to talk about.",
      "id": "ep_157_ut_62"
    },
    {
      "end": 3432674,
      "speaker": "Moritz Stefaner",
      "start": 3426024,
      "text": "Yeah, absolutely. Don't hesitate to get in touch. Just send us an email at mailatastory esdeme.",
      "id": "ep_157_ut_63"
    },
    {
      "end": 3436350,
      "speaker": "Enrico Bertini",
      "start": 3432752,
      "text": "That's all for now. Hear you next time, and thanks for listening to data stories.",
      "id": "ep_157_ut_64"
    }
  ],
  "confidence": 0.925750892043229,
  "audio_duration": 3445,
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_status_code": null,
  "webhook_auth": false,
  "webhook_auth_header_name": null,
  "speed_boost": false,
  "auto_highlights_result": null,
  "auto_highlights": false,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_audio_quality": null,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "content_safety": false,
  "iab_categories": true,
  "content_safety_labels": {
    "status": "unavailable",
    "results": [],
    "summary": {}
  },
  "language_detection": false,
  "language_detection_threshold": null,
  "language_confidence": null,
  "custom_spelling": null,
  "throttled": false,
  "auto_chapters": true,
  "summarization": false,
  "summary_type": null,
  "summary_model": null,
  "custom_topics": false,
  "topics": [],
  "speech_threshold": null,
  "speech_model": "best",
  "chapters": [
    {
      "summary": "This is a new episode of Data stories. We talk about data visualization, analysis, and more generally the role data plays in our lives. Our podcast is listener supported. If you do enjoy the show, you could consider supporting us.",
      "gist": "Data Stories",
      "headline": "This podcast features interviews with experts in data visualization and analysis",
      "start": 160,
      "end": 88006,
      "id": "ep_157_ch_0"
    },
    {
      "summary": "Barbara Tversky is a professor of psychology at Stanford University. She's done a lot of research on spatial cognition and cognitive psychology in general. Her research is highly related to, to data visualization and information design.",
      "gist": "Cognitive psychologist Barbara Tversky on Data Visualization",
      "headline": "Barbara Tversky is a leading cognitive psychologist",
      "start": 88118,
      "end": 131520,
      "id": "ep_157_ch_1"
    },
    {
      "summary": "Amitai Etzioni is a cognitive psychologist. He believes spatial cognition evolved before language. He is interested in the spaces we create in the world for cognitive well being. His new book is called mind in motion.",
      "gist": "Cognitive Psychology, Part 1",
      "headline": "Your new book explores how spatial cognition evolved before language",
      "start": 132060,
      "end": 272240,
      "id": "ep_157_ch_2"
    },
    {
      "summary": "The core argument is that spatial thinking is the foundation of all thought. It comes from language, and it comes from gesture and visualizations, which use space and marks in space in meaningful ways. It feels like everything we do with our brain has some connections with space.",
      "gist": "The Foundation of All Thought",
      "headline": "The core argument is that spatial thinking is the foundation of all thought",
      "start": 272660,
      "end": 533226,
      "id": "ep_157_ch_3"
    },
    {
      "summary": "In your book, you lay out a number of laws of cognition. Many of them are about trade offs, which I think is really important in visualization design. What's happening in spatial cognition is far more general than just spatial cognition.",
      "gist": "9 Laws of Cognitive Processes",
      "headline": "You lay out nine laws of cognition in your book about spatial cognition",
      "start": 533338,
      "end": 820410,
      "id": "ep_157_ch_4"
    },
    {
      "summary": "Solving certain problems works against innovation and creative thinking. In order to be creative, we have to unlearn some of those things. There's even a tension there of what benefits learning and makes us more agile in the world.",
      "gist": "In contrast, learning and creativity",
      "headline": "Solving certain problems works against innovation and creative thinking",
      "start": 820950,
      "end": 904162,
      "id": "ep_157_ch_5"
    },
    {
      "summary": "Law called feeling comes first before recognition. It also has interesting parallel with the way people actually perceive visual information. Seeing someone frequently can engender affection. Prosopagnosia, not recognizing individual faces, doesn't interfere with recognizing the emotion on the face.",
      "gist": "Law 3, Feeling comes first before recognition",
      "headline": "It's called feeling comes first before recognition, which has interesting parallels",
      "start": 904306,
      "end": 1088052,
      "id": "ep_157_ch_6"
    },
    {
      "summary": "What do you think is the role of feelings and emotion in data visualization? Too much emotion can be distracting. You want the feelings to engage people to learn more or see more. Making a visualization aesthetically pleasing can make it memorable.",
      "gist": "The role of feelings and emotion in data visualization",
      "headline": "What do you think is the role of feelings and emotion in data visualization",
      "start": 1088076,
      "end": 1625500,
      "id": "ep_157_ch_7"
    },
    {
      "summary": "A lot of our internal processes have spatial dimensions to them, but that we also bring that back into the world. We organize our bookshelves by orders, we organize them by topics, so they're categorized. Ideas about themes go into our broader cognition as well.",
      "gist": "Cognition and the World",
      "headline": "A lot of our internal processes have spatial dimensions to them",
      "start": 1626040,
      "end": 1855850,
      "id": "ep_157_ch_8"
    },
    {
      "summary": "As you organize things, you're also creating a diagram of that thought process. And then the next step really, is that those patterns, rows and columns, we turn into visualizations. If we design something in a way that resembles the natural world, people have a much better grasp on it.",
      "gist": "Intro to Data Visualization",
      "headline": "Data visualization is about tidying up and organizing information",
      "start": 1855930,
      "end": 2435620,
      "id": "ep_157_ch_9"
    },
    {
      "summary": "It's very hard for people to think in three dimensions. Shouldn't we build much more like sculptures or like spatial information displays or instead installations or virtual reality?",
      "gist": "Should Architectural Thinking Be Spatial?",
      "headline": "It's very hard for people to think in three dimensions",
      "start": 2436080,
      "end": 2563300,
      "id": "ep_157_ch_10"
    },
    {
      "summary": "Barbara: People have a completely different way of interpreting visual representations. She says the best way to look at data visualization is under the lens of accuracy. But accuracy is not the beginning and it's not the end of data visualization, she says.",
      "gist": "Data Visualization: Metaphors and the Truth of Data",
      "headline": "People have completely different ways of interpreting visual representations, even if they depict same information",
      "start": 2565080,
      "end": 2902416,
      "id": "ep_157_ch_11"
    },
    {
      "summary": "There is a set of graphs that are extremely widespread and popular. Do you think it is an accident of history that we came up with these specific formats? Or maybe there's something deeper, say, in a parallel world, humanity would create the same kind of graphs.",
      "gist": "How do graphs come to us?",
      "headline": "There is a small set of graphs that are extremely widespread and popular",
      "start": 2902528,
      "end": 3127190,
      "id": "ep_157_ch_12"
    },
    {
      "summary": "Barbara: Are these basic, fundamental graphs something that grow out of the brain or out of our human experience? Enrico: Bar graphs feel very much like they're an expression, a direct expression of the mind. There are more ways to get inspired by good data visualization ideas in the city or in nature.",
      "gist": "Bar graphs and data visualization",
      "headline": "Bar graphs represent piles. They also categorize things. So I put different things in different stacks",
      "start": 3128010,
      "end": 3357526,
      "id": "ep_157_ch_13"
    },
    {
      "summary": "This show is crowdfunded and you can support us on patreon@patreon. com. We are on Twitter, Facebook and Instagram, so follow us there for the latest updates. Let us know if you want to suggest a way to improve the show.",
      "gist": "Thanks for listening to Datastory ES",
      "headline": "This show is crowdfunded and you can support us on patreon",
      "start": 3357718,
      "end": 3436350,
      "id": "ep_157_ch_14"
    }
  ],
  "disfluencies": false,
  "entity_detection": false,
  "sentiment_analysis": false,
  "sentiment_analysis_results": null,
  "entities": null,
  "speakers_expected": null,
  "summary": null,
  "custom_topics_results": null,
  "episode_num": 157,
  "episode_metadata": {
    "speakers": [
      "Barbara Tversky",
      "Enrico Bertini",
      "Moritz Stefaner"
    ],
    "WPid": "1578",
    "url": "https://datastori.es/podlove/file/6612/s/feed/c/mp3/157-spatial-thinking-with-barbara-tversky.mp3",
    "episode_title": "Spatial Thinking with Barbara Tversky"
  }
}