{
  "id": "4869cbd5-92fe-4659-b94a-f7c5d04a7b2a",
  "language_model": "assemblyai_default",
  "acoustic_model": "assemblyai_default",
  "language_code": "en_us",
  "status": "completed",
  "audio_url": "https://datastori.es/podlove/file/3300/s/feed/c/mp3/87-vizkidz-books-on-data-visualization-for-kids.mp3",
  "utterances": [
    {
      "end": 4354,
      "speaker": "Liv Buli",
      "start": 160,
      "text": "We wanted to build these characters. Who reminded you of a dataviz in some way?",
      "id": "ep_87_ut_0"
    },
    {
      "end": 53620,
      "speaker": "Moritz Stefaner",
      "start": 8614,
      "text": "Data stories is brought to you by Qlik, who allows you to explore the hidden relationships within your data that lead to meaningful insights. Let your instincts lead the way to create personalized visualizations and dynamic dashboards with Qlik sense, which you can download for free at Qlik Datastories. That's Qlik Datastories. Hey, everyone. It's a new data stories. Hi, Enrico. How are you doing?",
      "id": "ep_87_ut_1"
    },
    {
      "end": 56076,
      "speaker": "Enrico Bertini",
      "start": 53732,
      "text": "Hey, I'm doing great. How about you?",
      "id": "ep_87_ut_2"
    },
    {
      "end": 63744,
      "speaker": "Moritz Stefaner",
      "start": 56180,
      "text": "Very good. Very good. Yeah. Can't complain. Trying to wrap up the year, but it has many heads I still have to chop off.",
      "id": "ep_87_ut_3"
    },
    {
      "end": 70178,
      "speaker": "Enrico Bertini",
      "start": 65794,
      "text": "Don't tell me, don't tell me. Looking forward to Christmas?",
      "id": "ep_87_ut_4"
    },
    {
      "end": 76802,
      "speaker": "Moritz Stefaner",
      "start": 70346,
      "text": "Absolutely. And our famous year review episode. This year we have something very special planned, which we can't reveal yet, but we have.",
      "id": "ep_87_ut_5"
    },
    {
      "end": 78546,
      "speaker": "Enrico Bertini",
      "start": 76858,
      "text": "Don't spoil it. Don't spoil it.",
      "id": "ep_87_ut_6"
    },
    {
      "end": 80330,
      "speaker": "Moritz Stefaner",
      "start": 78570,
      "text": "We have new plans. Yeah, yeah. Stay tuned.",
      "id": "ep_87_ut_7"
    },
    {
      "end": 81642,
      "speaker": "Enrico Bertini",
      "start": 80362,
      "text": "It's going to be a new thing.",
      "id": "ep_87_ut_8"
    },
    {
      "end": 99064,
      "speaker": "Moritz Stefaner",
      "start": 81778,
      "text": "Yeah. Yeah. So. But this time we have a special episode with two guests and it's about the VizKids book. It's a book for kids about data visualization. And we have the two authors on the show, Leaf book and Abby Ricarte. Hi, Liv. Hi, Abby.",
      "id": "ep_87_ut_9"
    },
    {
      "end": 99792,
      "speaker": "Liv Buli",
      "start": 99144,
      "text": "Hi.",
      "id": "ep_87_ut_10"
    },
    {
      "end": 101368,
      "speaker": "Enrico Bertini",
      "start": 99968,
      "text": "Hey. Welcome on the show.",
      "id": "ep_87_ut_11"
    },
    {
      "end": 102604,
      "speaker": "Moritz Stefaner",
      "start": 101416,
      "text": "Julie in sync.",
      "id": "ep_87_ut_12"
    },
    {
      "end": 104992,
      "speaker": "Liv Buli",
      "start": 103984,
      "text": "We practice this.",
      "id": "ep_87_ut_13"
    },
    {
      "end": 111644,
      "speaker": "Moritz Stefaner",
      "start": 105048,
      "text": "Yeah, that's the 10th take, actually, already, but William Miles for a good sink. Hi.",
      "id": "ep_87_ut_14"
    },
    {
      "end": 113080,
      "speaker": "Enrico Bertini",
      "start": 112664,
      "text": "Yeah.",
      "id": "ep_87_ut_15"
    },
    {
      "end": 118712,
      "speaker": "Moritz Stefaner",
      "start": 113112,
      "text": "Great to have you on. Can you tell us a bit about yourself and the project?",
      "id": "ep_87_ut_16"
    },
    {
      "end": 161474,
      "speaker": "Abigail Ricarte",
      "start": 118848,
      "text": "For sure. I'm Abby Ricarte. I'm currently a product designer and I've been a designer now for about seven years. I started out my career in accessories design and then transitioned into more product design, app development and web design, graphic design. But I didn't really consider myself as an illustrator. And I've been illustrating on and off for the last few years and I was really yearning for a big project to hone my illustration skills. And then I met leave and we talked about this project and leave. You could introduce yourselves.",
      "id": "ep_87_ut_17"
    },
    {
      "end": 260860,
      "speaker": "Liv Buli",
      "start": 161854,
      "text": "So my name is Liv Booley. I'm a data journalist. I've been working in this field for about five years now. And a couple of years ago I started thinking about this crazy idea of doing the nerdiest thing ever, which would be creating a series of children's books that would explain the basic concepts of data visualization and analysis to children. Mainly because I've been working predominantly in music as a data journalist and it being a very creative field, there are a lot of obstacles in terms of explaining the basics of how to interpret data, and I thought it'd be cool to kind of give kids a head start. And I've worked with Abby for a few years, and I'm super impressed by her as a designer. I've seen some of her illustration work, and since she, like me, is very familiar with this world, I reached out to see whether or not she'd be willing to work with me on this project and bring these characters to life and create the most hipster, Brooklyn, dorky Dataviz Children's book project on the planet. And she said yes. And so that was after a bottle of wine, too. And that was earlier. That was about, I guess, January this year. And then since then, we've been kind of working on the concepts and the books and the characters and who they are. And then we launched a Kickstarter campaign a month ago to raise funds for the book. For the first book, we set our goals pretty high, asking to raise $15,000. And yesterday, we closed our Kickstarter campaign, and we raised almost 16,000. So we were successful.",
      "id": "ep_87_ut_18"
    },
    {
      "end": 263092,
      "speaker": "Enrico Bertini",
      "start": 261012,
      "text": "Congratulations. That's amazing.",
      "id": "ep_87_ut_19"
    },
    {
      "end": 264184,
      "speaker": "Liv Buli",
      "start": 263148,
      "text": "You're very happy.",
      "id": "ep_87_ut_20"
    },
    {
      "end": 265700,
      "speaker": "Enrico Bertini",
      "start": 264844,
      "text": "Congrats.",
      "id": "ep_87_ut_21"
    },
    {
      "end": 267220,
      "speaker": "Liv Buli",
      "start": 265812,
      "text": "So we're not the only nerds.",
      "id": "ep_87_ut_22"
    },
    {
      "end": 288214,
      "speaker": "Enrico Bertini",
      "start": 267372,
      "text": "Yeah. No, I have to say, that's such a lovely project. When I saw it the first time, I was like, first of all, I have to buy the book. I have to back up this project. And, yeah, I have three kids myself, so I'm really looking forward to receiving the book home and see what their reaction would be. That's great.",
      "id": "ep_87_ut_23"
    },
    {
      "end": 291374,
      "speaker": "Abigail Ricarte",
      "start": 289194,
      "text": "Leave actually has a baby on the way.",
      "id": "ep_87_ut_24"
    },
    {
      "end": 295730,
      "speaker": "Liv Buli",
      "start": 292714,
      "text": "She'll have her first copy before she even can read.",
      "id": "ep_87_ut_25"
    },
    {
      "end": 317764,
      "speaker": "Enrico Bertini",
      "start": 295842,
      "text": "Yeah, that's perfect. So can you tell us a little bit more about the process itself? So how did you start the project? How did you create the characters and drawings? Of course. So a little bit of details, technical details about how you've been creating the book.",
      "id": "ep_87_ut_26"
    },
    {
      "end": 429554,
      "speaker": "Liv Buli",
      "start": 318864,
      "text": "So I can explain a bit about kind of the concepts and the thinking behind it, and then I think Abby would be best to explain how we're sure. So the idea was, you know, kids are probably one of the toughest audiences that exist because they are really sharp and really smart, but at the same time, you can't throw too much at them. So you have to find this great balance between introducing concepts that can be pretty challenging for people in their twenties and thirties and forties to understand to kids, but not do it in such a simp, in a way that's too simple for them because they'll call you on it. So it started with kind of nailing down what are each of the key concepts that we want to explain about the different visualizations that we want to explain. So for a pie chart, for instance, we thought of all of the different things that we could focus on and realize that something as simple as a pie chart should equal one whole or 100% is just that fundamental. Basic concept is something many people don't have a grasp of. And so that was something that we wanted to focus on. So we built the story and come up with the idea around what happens in the first book in order to explain that basic concept. And we thought of these for each of the different characters. So for Laini line, she explains. She's a line graph, and she kind of shows trends over time, but also explains that correlation does not equal causation. And so each of the stories kind of have to have that basic concept. One simple thing we want to attack, but then also create a fun story around it so that it's interesting for kids to read and something that they remember and think of and that the concept then becomes ingrained in them. And then I think Abby is probably best to explain the characters and touching.",
      "id": "ep_87_ut_27"
    },
    {
      "end": 557734,
      "speaker": "Abigail Ricarte",
      "start": 429594,
      "text": "On creating these fun stories. We also wanted to create these fun, lovable characters, characters that even adults could love. So when we were talking about Penelope pie, we really pushed ourselves to figure out what her personality would be. Where would she go? What is the scene that her story takes place? So we netted out at a pizza place, and because we wanted each character to evoke some sort of innocence and simple shapes and geometry, really focused on the triangle and having that be representative of a slice. And so her dress is a polka dotted dress that reminds you of a pepperoni slice. And we might be guilty of just being hungry while we were making these characters, but I think when Liv mentioned that she was shy and timid, but she was very curious, I immediately thought of placing glasses on. And I think each character has some sort of nod to fashion and has an accessory that is ownable. So Penelope has glasses. Barnaby bar chart has this cool backpack that looks like a bar chart. Birdie boxplot. Birdie Boxplot has funky sneakers. And Laine line. She's wacky. And honestly, I developed Lainey and how she looks based off of Liv and every meeting I had with Liv. And we were talking about Lainey and Lyne. Liv would say things like, she's wacky, she's little. Imagine her arms flailing out. Imagine she's an inflatable tube man. So we really had fun creating these characters, and we've added a bit of ourselves to each character. So leave is kind of lady in line, I think.",
      "id": "ep_87_ut_28"
    },
    {
      "end": 559490,
      "speaker": "Liv Buli",
      "start": 558234,
      "text": "Are you insinuating I'm wearing?",
      "id": "ep_87_ut_29"
    },
    {
      "end": 576804,
      "speaker": "Abigail Ricarte",
      "start": 559522,
      "text": "No offense. Penelope certainly has bits of me in there. So a lot of sketches were done together in coffee shops, and then we evolved them online in illustrator and in Photoshop.",
      "id": "ep_87_ut_30"
    },
    {
      "end": 613822,
      "speaker": "Liv Buli",
      "start": 577544,
      "text": "I think what was really important to us with the characters was there was a route we could go where we basically did a copy of a Dataviz and then slapped some eyes on them. And that was the character more. So we wanted to build these characters. Who reminded you of a Dataviz in some way? So for Laini, it's her hair pulled up that reminds you of a line graph. For Barnaby, it's his backpack. He's not just a bar chart with eyes on it. And that was important to us, that these are realistic characters that kids can kind of relate to, but that somehow remind them of these basic dataviz.",
      "id": "ep_87_ut_31"
    },
    {
      "end": 626954,
      "speaker": "Abigail Ricarte",
      "start": 613998,
      "text": "Early sketches of Barnaby bar chart were hilarious, where it looked like gumby, a big bar. So we opted for adding a bar chart backpack instead.",
      "id": "ep_87_ut_32"
    },
    {
      "end": 658338,
      "speaker": "Moritz Stefaner",
      "start": 628094,
      "text": "Yeah, but it's lovely to think about also, what's the character of these trike types? It's not something you think about unless you have to. Like in your case, when you want to tell a story with them and make them relatable. But, yeah, but then they all do evoke certain things, like, as you say, the crazy lines and, you know, and the blocky bar chart. This all does something to us, and we have associations with it. Right. So I think it's super interesting that you reemphasize that and say, like, yeah, maybe that is the character then, of that chart type. Right? Yeah.",
      "id": "ep_87_ut_33"
    },
    {
      "end": 701744,
      "speaker": "Liv Buli",
      "start": 658426,
      "text": "For Barnaby, for instance, it was pretty clear we needed to make him a bit of a braggart because it seems like a bar chart is such a basic, fundamental visualization, but is often kind of overlooked or not considered to be the coolest, snazziest data visualization. But for categorical comparisons, that is just the best way to go. It's keeping it simple. And then we realized that Barnaby would obviously be a little bit kind of, that would spur something in him, that he wants everyone to know that he's super cool, even though they may sometimes take him for granted. And that totally turns him into a braggart. So we tried to think about what would make their characters act a certain way or be a certain way, and it's been really fun.",
      "id": "ep_87_ut_34"
    },
    {
      "end": 720210,
      "speaker": "Moritz Stefaner",
      "start": 702284,
      "text": "It sounds like you had a lot of refinement and conversations in fleshing these characters out. And so I understand you did all of that basically in your spare time, right? Like after work together over this year, and then launch the Kickstarter to have the chance to get these books produced right.",
      "id": "ep_87_ut_35"
    },
    {
      "end": 789168,
      "speaker": "Liv Buli",
      "start": 720362,
      "text": "Honestly, the Kickstarter has been almost as much work, if not more than the actual creative work of putting this together, because there's so many things that you have to fully understand before you launch into a project like this. Everything from the business aspect and taxes and accounting and understanding, even just reward tiers, how that all calculates depending on how many people back, what reward, how much do you need to order of everything. So it took us a significant amount of time to work out all of those details before we were ready to go with the actual Kickstarter campaign itself. And, you know, I've been familiar with Kickstarter and other platforms, crowdfunding platforms, for a long time, and have always thought it was kind of just a push of a button, like, hey, I have an idea, do you want to fund it? And I think we both kind of came across learning that there's a lot more work that goes into launching a Kickstarter campaign, especially if you're trying to make it successful. Everything from planning the social media and pr strategy to emailing everybody we know a million times over, people we don't know a million times over and driving everybody crazy until they support us.",
      "id": "ep_87_ut_36"
    },
    {
      "end": 811474,
      "speaker": "Abigail Ricarte",
      "start": 789216,
      "text": "Yeah. The second part to that is this was a project that we am extremely passionate about and how do we convince the world to donate and give us money? It's very challenging and it's great. It's great that we could tap into our friends and family who were very supportive, but also strangers who rallied behind this idea as well.",
      "id": "ep_87_ut_37"
    },
    {
      "end": 824538,
      "speaker": "Enrico Bertini",
      "start": 811554,
      "text": "Yeah, I can imagine. It's probably so much work. And in addition to that, you also don't know until the end whether your project is going to be funded or not. So this must, must be a lot of anxiety attached to it.",
      "id": "ep_87_ut_38"
    },
    {
      "end": 832994,
      "speaker": "Liv Buli",
      "start": 824626,
      "text": "It is very nerve wracking. We did not know until the last day that we were going to fund it. Once we did, I needed a very long nap.",
      "id": "ep_87_ut_39"
    },
    {
      "end": 955636,
      "speaker": "Moritz Stefaner",
      "start": 838414,
      "text": "This is a good time to take a little break and talk about our sponsor this week. Click who allows you to explore the hidden relationships within your data that lead to meaningful insights. Let your instincts lead the way to create personalized visualizations and dynamic dashboards with Qlik sense, which you can download for free at Qlik deries. That's Qlik derivatives stories. So today we are hearing about data visualization books for kids. I read on the clickblog that even their vice president set out one day to find out if six year olds can become users of their bi software. So he brought Qlik sense to one of his daughter's classrooms and showed the student how it's. Well, it's actually very hard to count, for instance, all the eye colors and favorite ice cream flavors students might have when it's presented in a spreadsheet, but that it's very easy to see what the most popular ones, for instance, are when you lay that out visually. So he showed them pie charts, but then even proceeded to discuss tree maps and filters and dashboards and all these really advanced features. But the kids apparently really loved it. And yeah, so they learned that, for instance, 51 of the 67 students have brown eyes, and only five of them had mint as their favorite ice cream flavor. So these are all things you can learn by visiting the clickblog. You should really check out the article. It's super nice. The link is in the show notes. And of course, do try out Qlik sense for free at Qlik Deris. That's q l I K Datastories. Thanks again and back to the show. Do you have any tips for people who want to try something similar? Like, did you do something that turned out to be totally wasted work in that regard? What are the things people should look out for when they want to have, like a creative project on Kickstarter?",
      "id": "ep_87_ut_40"
    },
    {
      "end": 1039183,
      "speaker": "Liv Buli",
      "start": 955700,
      "text": "I think two things. One is, and something Abby was really great at, was identifying your audience and then reaching out to people individually. So, for instance, you guys and people within this space that work with data analytics and visualization that are interested in this, emailing them and getting them as excited, just getting the project in their hands, because that's an audience that's ready and waiting that we know would be interested in this, but they might not. You know, if you're just tweeting about it, they're not going to know about it. So reaching out directly to people to get them engaged in the project. And then one thing to look out for is as soon as you launch a Kickstarter campaign, you will get millions of emails from various PR companies promising to do this, that or the other with your project. And especially when it comes to like, Lulz in fundraising and you start to get nervous, you know, today we didn't hit our goal that we wanted to hit, so, oh my gosh, it becomes very tempting to maybe pay somebody to do pr for you. And that was something that we were really steadfast about. We wanted to do this ourselves. And I just, you know, for anyone who's running a campaign, just know that you're going to get all these emails and it can be tempting, but that, you know, if you're, you're probably going to get more out of doing that. Outreach yourself and being consistent and making sure that you know who your audience is and reaching out to them.",
      "id": "ep_87_ut_41"
    },
    {
      "end": 1039947,
      "speaker": "Enrico Bertini",
      "start": 1039563,
      "text": "Wow.",
      "id": "ep_87_ut_42"
    },
    {
      "end": 1073426,
      "speaker": "Moritz Stefaner",
      "start": 1039995,
      "text": "Yeah, it does sound like a whole second drop, basically in addition to the drawing itself. Yeah, we just got a listener question, so from Ollie Meyer from our Slack channel and he asks, here's a tough one for the authors. So the main character is a pie chart. Do you figure in the well known skepticism over pie charts in the wizard design community? So they are sort of controversial, right? So it's a. A bold choice to have a controversial main character maybe, for sure. Did you discuss that at all?",
      "id": "ep_87_ut_43"
    },
    {
      "end": 1120374,
      "speaker": "Liv Buli",
      "start": 1073610,
      "text": "Yeah, no, I mean, I actually, it was funny, I was reading through some documentation I had written a while back about what data visualizations to include and not include in the articles that we write at Pandora and next big sound. And one of the things I'd written was do not use pie charts. They are designer's worst nightmare. But at the same time, similarly to the bar chart, there are these fundamental data visualizations that they are valuable. You have to just be using them in the right way, or at least that's how I understand it. And if you are showing parts of a whole and you are accurate about how you use your pie chart, there are use cases for it. Don't make it 3d.",
      "id": "ep_87_ut_44"
    },
    {
      "end": 1123974,
      "speaker": "Enrico Bertini",
      "start": 1123034,
      "text": "Category.",
      "id": "ep_87_ut_45"
    },
    {
      "end": 1169298,
      "speaker": "Liv Buli",
      "start": 1126584,
      "text": "You don't need to snazz it up too much. In the case of Fox News, a pie chart does not equal 187%. So I think that while yeah, they are definitely controversial in terms of being these basic chart types that some people shy away from or maybe don't think of as the most exciting way to visualize data, sometimes simpler is smarter. And if they're being used right and explained properly and kids get them, then I definitely think that there's plenty of value to a pie chart or a bar chart or. Well, I think no one disputes the value of a line graph.",
      "id": "ep_87_ut_46"
    },
    {
      "end": 1178402,
      "speaker": "Moritz Stefaner",
      "start": 1169386,
      "text": "And I mean, all the interesting characters have some positive sides and some more dubious negative sides, right? So I think it just makes a more interesting character. I'm fully on your side here.",
      "id": "ep_87_ut_47"
    },
    {
      "end": 1184614,
      "speaker": "Liv Buli",
      "start": 1178458,
      "text": "Just wait until we get to the plot twist here. Penelope pie tries to make herself bigger than she is.",
      "id": "ep_87_ut_48"
    },
    {
      "end": 1192838,
      "speaker": "Enrico Bertini",
      "start": 1185294,
      "text": "So did you show it to kids already? Did you try to kind of like test it with some kids and see what the reaction is there?",
      "id": "ep_87_ut_49"
    },
    {
      "end": 1200758,
      "speaker": "Liv Buli",
      "start": 1192926,
      "text": "We did. Last weekend, we had our first book reading user testing, which was interesting.",
      "id": "ep_87_ut_50"
    },
    {
      "end": 1209518,
      "speaker": "Abigail Ricarte",
      "start": 1200846,
      "text": "Interesting, yeah, I think we were playing to. Or reading to a crowd that was maybe too young. They were two and three years old.",
      "id": "ep_87_ut_51"
    },
    {
      "end": 1211934,
      "speaker": "Moritz Stefaner",
      "start": 1209566,
      "text": "Oh, okay. Yeah, that's very ambitious.",
      "id": "ep_87_ut_52"
    },
    {
      "end": 1213634,
      "speaker": "Enrico Bertini",
      "start": 1212094,
      "text": "Yeah, that's very ambitious.",
      "id": "ep_87_ut_53"
    },
    {
      "end": 1216424,
      "speaker": "Abigail Ricarte",
      "start": 1214684,
      "text": "Crawling away from the book.",
      "id": "ep_87_ut_54"
    },
    {
      "end": 1267378,
      "speaker": "Liv Buli",
      "start": 1217124,
      "text": "But, no, at the same time, we did get a bunch of feedback from that, which really helped us kind of think a little bit about how to tweak and refine the book. Simple things like, we had designed it based on spreads because we've been thinking about doing everything in hardcover, and we weren't thinking so much about how to design it for an ebook. We were reading it to the kids on ebook. So we then realized, hey, there are pages here where we're referring to the next page and you can't see it. And the kids are looking at us like, okay, you're talking about Barnaby bar chart. Where is he? And then in addition to that, there were things that they reacted to that they were excited about, like the types of toppings on pizza and things that get them engaged and questions you can ask that, like, we realized we have a lot more opportunity to pepper that in and make sure that the book is interactive and that kids are engaged throughout.",
      "id": "ep_87_ut_55"
    },
    {
      "end": 1269866,
      "speaker": "Moritz Stefaner",
      "start": 1267426,
      "text": "It could make a nice iPad app, for sure.",
      "id": "ep_87_ut_56"
    },
    {
      "end": 1271054,
      "speaker": "Liv Buli",
      "start": 1269970,
      "text": "We're not done yet.",
      "id": "ep_87_ut_57"
    },
    {
      "end": 1285480,
      "speaker": "Enrico Bertini",
      "start": 1271594,
      "text": "Nice. So, what's next? So, I guess, first of all, one thing I would like to know is what? So, the campaign ended, but if people listening to the show want to buy the book, how can they do that?",
      "id": "ep_87_ut_58"
    },
    {
      "end": 1333542,
      "speaker": "Liv Buli",
      "start": 1285592,
      "text": "So we have. We're ordering up the books and shipping out to everyone who picked that as their reward on Kickstarter. But then also, in some exciting news, this week, Abby and I signed a book deal with an independent publisher in St. Louis that's called Storybook Genius Publishing. And in January, we will be doing a reissue with them of the first book. The deal is actually for the full series, all four books that we have planned. So over the next couple of months and years, you'll be able to. We'll be developing the books in full and publishing them one by one, and they'll be available in your regular retailers. Barnes and Noble, Amazon, everywhere. You can get a book today. And then Abby and I are going to start the book tour. Life.",
      "id": "ep_87_ut_59"
    },
    {
      "end": 1341654,
      "speaker": "Enrico Bertini",
      "start": 1333678,
      "text": "Yeah. That's what I was about to ask, being a little selfish. If you organize anything in New York, please let me. Let me know. I want to come and see.",
      "id": "ep_87_ut_60"
    },
    {
      "end": 1343042,
      "speaker": "Liv Buli",
      "start": 1341994,
      "text": "Can I bring my kids?",
      "id": "ep_87_ut_61"
    },
    {
      "end": 1344290,
      "speaker": "Enrico Bertini",
      "start": 1343098,
      "text": "They're a little noisy.",
      "id": "ep_87_ut_62"
    },
    {
      "end": 1380840,
      "speaker": "Liv Buli",
      "start": 1344402,
      "text": "But of course, I was also a little noisy and wacky. But yeah, that's the same approach that we took to the Kickstarter campaign, is what we're going to use to continue to promote the books. Like walking around and going into bookstores and saying, hey, can we do a reading for you? And learning from the kids what they like and what they don't like and convincing parents that just because they maybe don't fully understand data visualization, probably be okay if their kids. And so we will definitely be on the road knocking on doors and we will make sure to let you know when there is a book reading near you.",
      "id": "ep_87_ut_63"
    },
    {
      "end": 1389904,
      "speaker": "Enrico Bertini",
      "start": 1381032,
      "text": "Well, thanks so much. That's such a lovely project. I'm so much looking forward to receiving the book. Moritz, is there anything else you want to ask?",
      "id": "ep_87_ut_64"
    },
    {
      "end": 1394964,
      "speaker": "Moritz Stefaner",
      "start": 1390024,
      "text": "No, just to second that, it's amazing. And I really want to have a copy for my kids.",
      "id": "ep_87_ut_65"
    },
    {
      "end": 1398756,
      "speaker": "Liv Buli",
      "start": 1397344,
      "text": "They'll be in the mail soon enough.",
      "id": "ep_87_ut_66"
    },
    {
      "end": 1399544,
      "speaker": "Moritz Stefaner",
      "start": 1398880,
      "text": "Nice.",
      "id": "ep_87_ut_67"
    },
    {
      "end": 1400612,
      "speaker": "Enrico Bertini",
      "start": 1399924,
      "text": "Okay.",
      "id": "ep_87_ut_68"
    },
    {
      "end": 1411436,
      "speaker": "Moritz Stefaner",
      "start": 1400708,
      "text": "Thanks so much. We'll tweet it out when, when, also when the books with the publishers are out. And yeah, can't wait to see the follow ups. Thanks so much.",
      "id": "ep_87_ut_69"
    },
    {
      "end": 1411892,
      "speaker": "Enrico Bertini",
      "start": 1411460,
      "text": "Thank you.",
      "id": "ep_87_ut_70"
    },
    {
      "end": 1412956,
      "speaker": "Liv Buli",
      "start": 1411948,
      "text": "Thanks for having us, guys.",
      "id": "ep_87_ut_71"
    },
    {
      "end": 1413704,
      "speaker": "Enrico Bertini",
      "start": 1413020,
      "text": "Bye.",
      "id": "ep_87_ut_72"
    },
    {
      "end": 1429250,
      "speaker": "E",
      "start": 1421924,
      "text": "Hey guys, thanks for listening to data stories again. Before you leave, we have a request if you can spend a couple of minutes rating us on iTunes.",
      "id": "ep_87_ut_73"
    },
    {
      "end": 1431610,
      "speaker": "Enrico Bertini",
      "start": 1429282,
      "text": "That would be extremely helpful for the show.",
      "id": "ep_87_ut_74"
    },
    {
      "end": 1462392,
      "speaker": "Moritz Stefaner",
      "start": 1431722,
      "text": "And here's also some information on the many ways you can get news directly from us. We're, of course, on twitter@twitter.com. Datastories. We have a Facebook page@Facebook.com, datastoriespodcast all in one word. And we also have an email newsletter. So if you want to get news directly into your inbox and be notified whenever we publish an episode, you can go to our homepage, datastory es and look for the link that you find on the bottom in the footer.",
      "id": "ep_87_ut_75"
    },
    {
      "end": 1474472,
      "speaker": "E",
      "start": 1462488,
      "text": "So one last thing that we want to tell you is that we love to get in touch with our listeners, especially if you want to suggest a way to improve the show or amazing people you want us to invite or even projects you want us to talk about.",
      "id": "ep_87_ut_76"
    },
    {
      "end": 1483844,
      "speaker": "Moritz Stefaner",
      "start": 1474568,
      "text": "Yeah, absolutely. So don't hesitate to get in touch with us us. It's always a great thing for us. And that's all for now. See you next time. And thanks for listening to data stories.",
      "id": "ep_87_ut_77"
    },
    {
      "end": 1512724,
      "speaker": "E",
      "start": 1487384,
      "text": "Data stories is brought to you by Qlik, who allows you to explore the hidden relationships within your data that lead to meaningful insights. Let your instincts lead the way to create personalized visualizations and dynamic dashboards with Qlik sense, which you can download for free at Qlik deep data stories. That's Qlik, dear.",
      "id": "ep_87_ut_78"
    }
  ],
  "confidence": 0.931766212487893,
  "audio_duration": 1512,
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_status_code": null,
  "webhook_auth": false,
  "webhook_auth_header_name": null,
  "speed_boost": false,
  "auto_highlights_result": null,
  "auto_highlights": false,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_audio_quality": null,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "content_safety": false,
  "iab_categories": true,
  "content_safety_labels": {
    "status": "unavailable",
    "results": [],
    "summary": {}
  },
  "language_detection": false,
  "language_detection_threshold": null,
  "language_confidence": null,
  "custom_spelling": null,
  "throttled": false,
  "auto_chapters": true,
  "summarization": false,
  "summary_type": null,
  "summary_model": null,
  "custom_topics": false,
  "topics": [],
  "speech_threshold": null,
  "speech_model": "best",
  "chapters": [
    {
      "summary": "A series of children's books will explain the basic concepts of data visualization to children. The project raised almost 16,000 dollars on Kickstarter. This is a special episode with two guests, Leaf book and Abby Ricarte.",
      "gist": "The Data Stories Children's Book",
      "headline": "Data stories is a new data stories book for kids about data visualization",
      "start": 160,
      "end": 298214,
      "id": "ep_87_ch_0"
    },
    {
      "summary": "The idea was to find a balance between introducing concepts that can be challenging for people in their twenties and thirties and forties to understand to kids. Each of the stories kind of have to have that basic concept. And then I think Abby is probably best to explain the characters and touching.",
      "gist": "How To Write a Kids' Book",
      "headline": "How did you start the project and how did you create the characters",
      "start": 298954,
      "end": 431754,
      "id": "ep_87_ch_1"
    },
    {
      "summary": "We wanted to create these fun, lovable characters, characters that even adults could love. Each character has some sort of nod to fashion and has an accessory that is ownable. These are realistic characters that kids can kind of relate to, but that somehow remind them of basic data visualization.",
      "gist": "The Dataviz Characters",
      "headline": "We wanted to create fun, lovable characters that even adults could love",
      "start": 431834,
      "end": 701744,
      "id": "ep_87_ch_2"
    },
    {
      "summary": "The Kickstarter has been almost as much work, if not more than the actual creative work of putting this together. Everything from planning the social media and pr strategy to emailing everybody we know a million times over. You don't know until the end whether your project is going to be funded or not.",
      "gist": "How To Write a Book With a Kickstarter",
      "headline": "You launched a Kickstarter campaign to get these books produced right",
      "start": 702284,
      "end": 832994,
      "id": "ep_87_ch_3"
    },
    {
      "summary": "Today we are hearing about data visualization books for kids. Let your instincts lead the way to create personalized visualizations and dynamic dashboards with Qlik sense. Try out Qlik sense for free at Qlik Deris.",
      "gist": "Data visualization books for kids",
      "headline": "Let your instincts lead the way to create personalized visualizations with Qlik sense",
      "start": 838414,
      "end": 938714,
      "id": "ep_87_ch_4"
    },
    {
      "summary": "Lulz: What are the things people should look out for when they want to have a creative project on Kickstarter? One is identifying your audience and then reaching out to people individually. Another is to be consistent and making sure that you know who your audience is.",
      "gist": "How to Kickstart a Creative Project on Kickstarter",
      "headline": "What are the things people should look out for when launching a Kickstarter project",
      "start": 941894,
      "end": 1045059,
      "id": "ep_87_ch_5"
    },
    {
      "summary": "Do you figure in the well known skepticism over pie charts in the wizard design community? They are designer's worst nightmare. But at the same time, there are these fundamental data visualizations that are valuable. Sometimes simpler is smarter.",
      "gist": "Piece Charts: The Controversial Data Visualizations",
      "headline": "Do you figure in skepticism over pie charts in the wizard design community",
      "start": 1045131,
      "end": 1180894,
      "id": "ep_87_ch_6"
    },
    {
      "summary": "Last weekend, we had our first book reading user testing, which was interesting. It could make a nice iPad app, for sure. We're not done yet.",
      "gist": "Barnaby the Book for Kids",
      "headline": "Last weekend, we had our first book reading user testing, which was interesting",
      "start": 1181594,
      "end": 1272170,
      "id": "ep_87_ch_7"
    },
    {
      "summary": "This week, Abby and I signed a book deal with an independent publisher in St. Louis. The deal is actually for the full series, all four books that we have planned. We'll be on the road knocking on doors to promote the books. If you organize anything in New York, please let me know.",
      "gist": "Data Stories: What's Next?",
      "headline": "Moritz and Abby have signed a book deal with an independent publisher",
      "start": 1272282,
      "end": 1424734,
      "id": "ep_87_ch_8"
    },
    {
      "summary": "Before you leave, we have a request if you can spend a couple of minutes rating us on iTunes. Here's also some information on the many ways you can get news directly from us. We love to get in touch with our listeners and suggest ways to improve the show.",
      "gist": "Data Stories",
      "headline": "Before you leave, we have a request if you can spend a couple of minutes rating us on iTunes",
      "start": 1424884,
      "end": 1512724,
      "id": "ep_87_ch_9"
    }
  ],
  "disfluencies": false,
  "entity_detection": false,
  "sentiment_analysis": false,
  "sentiment_analysis_results": null,
  "entities": null,
  "speakers_expected": null,
  "summary": null,
  "custom_topics_results": null,
  "episode_num": 87,
  "episode_metadata": {
    "speakers": [
      "Liv Buli",
      "Moritz Stefaner",
      "Enrico Bertini",
      "Abigail Ricarte"
    ],
    "WPid": "810",
    "url": "https://datastori.es/podlove/file/3300/s/feed/c/mp3/87-vizkidz-books-on-data-visualization-for-kids.mp3",
    "episode_title": "VizKidz: Books on Data Visualization for Kids"
  }
}