{
  "id": "4647139f-80d7-42c5-a0bb-4b84ff6ed6f5",
  "language_model": "assemblyai_default",
  "acoustic_model": "assemblyai_default",
  "language_code": "en_us",
  "status": "completed",
  "audio_url": "https://datastori.es/podlove/file/218/s/feed/c/mp3/Datastories-02.mp3",
  "utterances": [
    {
      "end": 13248,
      "speaker": "Moritz Stefaner",
      "start": 12360,
      "text": "There we go.",
      "id": "ep_2_ut_0"
    },
    {
      "end": 19758,
      "speaker": "Enrico Bertini",
      "start": 13438,
      "text": "Hi, everyone, this is Errico from data stories and I'm together again with Moritz. Hi, Moritz.",
      "id": "ep_2_ut_1"
    },
    {
      "end": 21930,
      "speaker": "Moritz Stefaner",
      "start": 19894,
      "text": "Hi, everyone. Moritz here.",
      "id": "ep_2_ut_2"
    },
    {
      "end": 25676,
      "speaker": "Enrico Bertini",
      "start": 22990,
      "text": "Wow, we made it to the second episode.",
      "id": "ep_2_ut_3"
    },
    {
      "end": 28640,
      "speaker": "Moritz Stefaner",
      "start": 25838,
      "text": "Yeah, and it's been two weeks already. I can't believe it.",
      "id": "ep_2_ut_4"
    },
    {
      "end": 34820,
      "speaker": "Enrico Bertini",
      "start": 28800,
      "text": "Times run super, super fast. It's crazy. What are you up to?",
      "id": "ep_2_ut_5"
    },
    {
      "end": 66350,
      "speaker": "Moritz Stefaner",
      "start": 35320,
      "text": "Yeah, still working on my projects, so I don't have so many news this week. I looked a bit more into interactive polls, which is quite interesting. So how to visualize, you know, when you ask people a question like, what is your position on this topic or that, and how do you maybe present the results and give them the chance to utter their voices in the same framework? New York Times did some nice work on that and we're trying to build something similar. So I've been doing some research on that, but no concrete outcomes yet.",
      "id": "ep_2_ut_6"
    },
    {
      "end": 67798,
      "speaker": "Enrico Bertini",
      "start": 66510,
      "text": "Yeah, yeah, sure.",
      "id": "ep_2_ut_7"
    },
    {
      "end": 69010,
      "speaker": "Moritz Stefaner",
      "start": 67894,
      "text": "How's it for you?",
      "id": "ep_2_ut_8"
    },
    {
      "end": 89002,
      "speaker": "Enrico Bertini",
      "start": 69670,
      "text": "Busy, busy week. We have several deadlines coming soon. We had notifications for Euroviz. Lots of people crying here in the lab, but still we get a quite reasonable acceptance rate. I think we got how many? Three or four papers out of.",
      "id": "ep_2_ut_9"
    },
    {
      "end": 90882,
      "speaker": "Moritz Stefaner",
      "start": 89106,
      "text": "Come on, that's good.",
      "id": "ep_2_ut_10"
    },
    {
      "end": 99218,
      "speaker": "Enrico Bertini",
      "start": 91066,
      "text": "Yeah. Well, this is conditionally accepted. You never know. But it's fine. It's fine. Yeah.",
      "id": "ep_2_ut_11"
    },
    {
      "end": 100790,
      "speaker": "Moritz Stefaner",
      "start": 99394,
      "text": "Do you have a paper too?",
      "id": "ep_2_ut_12"
    },
    {
      "end": 115062,
      "speaker": "Enrico Bertini",
      "start": 101090,
      "text": "Yeah, I have one reject and one accept, but it's conditional and pretty much borderline. And yeah, I hope we will manage to have a finally accepted paper. I hope so.",
      "id": "ep_2_ut_13"
    },
    {
      "end": 115814,
      "speaker": "Moritz Stefaner",
      "start": 115106,
      "text": "Okay.",
      "id": "ep_2_ut_14"
    },
    {
      "end": 118070,
      "speaker": "Enrico Bertini",
      "start": 115982,
      "text": "Usually it's the case, but you never know.",
      "id": "ep_2_ut_15"
    },
    {
      "end": 118846,
      "speaker": "Moritz Stefaner",
      "start": 118190,
      "text": "Yeah. Yeah.",
      "id": "ep_2_ut_16"
    },
    {
      "end": 123130,
      "speaker": "Enrico Bertini",
      "start": 118918,
      "text": "Okay, well, we got a lot of feedback.",
      "id": "ep_2_ut_17"
    },
    {
      "end": 128422,
      "speaker": "Moritz Stefaner",
      "start": 123670,
      "text": "Absolutely. And I mean, overall it was really good feedback, I would say.",
      "id": "ep_2_ut_18"
    },
    {
      "end": 129158,
      "speaker": "Enrico Bertini",
      "start": 128606,
      "text": "Yeah.",
      "id": "ep_2_ut_19"
    },
    {
      "end": 129958,
      "speaker": "Moritz Stefaner",
      "start": 129254,
      "text": "Right? Yeah.",
      "id": "ep_2_ut_20"
    },
    {
      "end": 131130,
      "speaker": "Enrico Bertini",
      "start": 130014,
      "text": "Should we say that?",
      "id": "ep_2_ut_21"
    },
    {
      "end": 132926,
      "speaker": "Moritz Stefaner",
      "start": 131470,
      "text": "I think we can say that.",
      "id": "ep_2_ut_22"
    },
    {
      "end": 142952,
      "speaker": "Enrico Bertini",
      "start": 133078,
      "text": "Yeah. Can we say that we don't suck? I'm a little bit. I'm a little bit disappointed. Nobody really said that we suck.",
      "id": "ep_2_ut_23"
    },
    {
      "end": 145160,
      "speaker": "Moritz Stefaner",
      "start": 143126,
      "text": "Yeah, people are scared of us, you know.",
      "id": "ep_2_ut_24"
    },
    {
      "end": 148920,
      "speaker": "Enrico Bertini",
      "start": 145860,
      "text": "I don't know. Too positive.",
      "id": "ep_2_ut_25"
    },
    {
      "end": 154124,
      "speaker": "Moritz Stefaner",
      "start": 151300,
      "text": "Yeah, that's true. It's a bit suspicious.",
      "id": "ep_2_ut_26"
    },
    {
      "end": 155720,
      "speaker": "Enrico Bertini",
      "start": 154252,
      "text": "It's a bit suspicious.",
      "id": "ep_2_ut_27"
    },
    {
      "end": 162364,
      "speaker": "Moritz Stefaner",
      "start": 156060,
      "text": "Jen was the only one, Jen from data telling who like, spoke up and said, seriously, guys, we need to stop sucking.",
      "id": "ep_2_ut_28"
    },
    {
      "end": 183784,
      "speaker": "Enrico Bertini",
      "start": 162452,
      "text": "Yeah. That was fantastic. That's my favorite comment. I have two favorite comments, actually. The first one is from Jen and the second one is from Ben, who said, you're welcome, Jens. I'll send you some suggestions this weekend. You both have such exotic euro voices. I think we should. We should.",
      "id": "ep_2_ut_29"
    },
    {
      "end": 185120,
      "speaker": "Moritz Stefaner",
      "start": 183832,
      "text": "I don't know what he means.",
      "id": "ep_2_ut_30"
    },
    {
      "end": 187200,
      "speaker": "Enrico Bertini",
      "start": 185240,
      "text": "I don't know. What does he mean? Do you know what he means?",
      "id": "ep_2_ut_31"
    },
    {
      "end": 188080,
      "speaker": "Moritz Stefaner",
      "start": 187280,
      "text": "I don't get it.",
      "id": "ep_2_ut_32"
    },
    {
      "end": 203560,
      "speaker": "Enrico Bertini",
      "start": 188160,
      "text": "I can make it even more exotic if you want. I mean, seriously, it's fantastic. We should write it somewhere in the blog, right? Like a disclaimer. Exotic hero voices here.",
      "id": "ep_2_ut_33"
    },
    {
      "end": 209160,
      "speaker": "Moritz Stefaner",
      "start": 204180,
      "text": "Rated R. Rated R for exotic hero voices.",
      "id": "ep_2_ut_34"
    },
    {
      "end": 236650,
      "speaker": "Enrico Bertini",
      "start": 210380,
      "text": "Yeah. But, yeah. What else? I think the most important kind of and recurring feedback we got was that many people feel they would need some visuals together with the podcast. Right. Which I can understand, and we've been discussing it before, standing the podcast several times. But of course, the problem is that, technically speaking, it's a nightmare.",
      "id": "ep_2_ut_35"
    },
    {
      "end": 273072,
      "speaker": "Moritz Stefaner",
      "start": 237670,
      "text": "Yeah, absolutely. And I mean, I don't know if these people really get the concept of a podcast. Really? Because the concept of a podcast is that it's an audio show, people. Yeah, stop whining. No, what we will try is. Yeah, yeah, stop whining. No, what we will try is to add some screenshots to the blog post and make clearer, as today, for instance, we actually have show notes on the blog and you can click all the links. And basically the best way to follow the show would be to have our page open while, you know, while you listen to it and click all the links.",
      "id": "ep_2_ut_36"
    },
    {
      "end": 273992,
      "speaker": "Enrico Bertini",
      "start": 273136,
      "text": "Yeah, absolutely.",
      "id": "ep_2_ut_37"
    },
    {
      "end": 298700,
      "speaker": "Moritz Stefaner",
      "start": 274056,
      "text": "So we didn't really make that too clear, but like really making a screencast, a video recording, it's, it's crazy. Crazy much work and very hard to concentrate. Also, if you record a video and, or a screen, grab and talk over it, I've tried that so many times to make that work, and it's really hard to do that over two minutes only and do that over 45. I don't see that happening anytime soon.",
      "id": "ep_2_ut_38"
    },
    {
      "end": 321484,
      "speaker": "Enrico Bertini",
      "start": 299240,
      "text": "Yeah. And it's already complicated enough. I don't know if people understand how much technicalities there are behind that, but please understand that we are trying to do our best and to make it as professional as possible. And doing a screencast or anything similar would be really complicated. Maybe we will do it in the future. But now it's really, I mean, that's the best we can do so far.",
      "id": "ep_2_ut_39"
    },
    {
      "end": 343060,
      "speaker": "Moritz Stefaner",
      "start": 321612,
      "text": "Next step is a tv show without sucking too much. No. And talking about professional, you might have noticed we have a title music now, and I really like it. That gives it that radio feel. And big thanks to Dave Schroeder@pilotwipe.com. because he made that for us.",
      "id": "ep_2_ut_40"
    },
    {
      "end": 344148,
      "speaker": "Enrico Bertini",
      "start": 343100,
      "text": "It is cool.",
      "id": "ep_2_ut_41"
    },
    {
      "end": 345684,
      "speaker": "Moritz Stefaner",
      "start": 344324,
      "text": "So thanks, Dave.",
      "id": "ep_2_ut_42"
    },
    {
      "end": 350740,
      "speaker": "Enrico Bertini",
      "start": 345772,
      "text": "Thanks, Dave. Yeah. So let's go to the meat.",
      "id": "ep_2_ut_43"
    },
    {
      "end": 352888,
      "speaker": "Moritz Stefaner",
      "start": 351920,
      "text": "We have some meat.",
      "id": "ep_2_ut_44"
    },
    {
      "end": 425764,
      "speaker": "Enrico Bertini",
      "start": 352984,
      "text": "We have some meat. I hope so. We promised we wanted to discuss contests, awards, challenges and stuff like that, which seems to pop up like mushrooms. Right. And so maybe I can start saying something about it, because last week or, or two weeks ago, when was it? I started this whole discussion with a blog post related to the visualizing.org marathon. And, yeah, I said I was a little bit surprised by who was the final winner of the grand prize, this Eq Librium, which, I mean, the concept was really nice, but I was a little bit surprised that from the point of view of visualization design, the final price was given to a visualization where there was. I think my major concern was that they were using the main metaphor was a 3d visualization with a cube. And as you may know, three d.",
      "id": "ep_2_ut_45"
    },
    {
      "end": 428240,
      "speaker": "Moritz Stefaner",
      "start": 425812,
      "text": "At that point, you stopped looking. Right.",
      "id": "ep_2_ut_46"
    },
    {
      "end": 482992,
      "speaker": "Enrico Bertini",
      "start": 430180,
      "text": "It's like cubes and mean. I would be very honest. Yeah, that's the case. I mean, at the beginning, my reaction was very bad. Then, as usual, I mean, through blogging, I learned that I have to think a little bit more before reacting. So I went back. So I started with a Twitter post, I got some criticism, and then I went back to the entry and trying to read all the explanations, which normally is a bad sign for visualization. Right. If you have to read the explanation, it's already a bad sign. I read through the old documentation. I must say that these guys did a wonderful job in terms of, I mean, they really explain in depth how it works, why they had this idea, what's the metaphor? But in the end, I'm still not convinced. But I don't want to discuss the.",
      "id": "ep_2_ut_47"
    },
    {
      "end": 492922,
      "speaker": "Moritz Stefaner",
      "start": 483016,
      "text": "End result is not that strong anyway. There is a bit more to it than you might think at first sight when you see a lot of blocks. Yeah, that's true, too.",
      "id": "ep_2_ut_48"
    },
    {
      "end": 558942,
      "speaker": "Enrico Bertini",
      "start": 492986,
      "text": "Yeah, I think that's not the point. I think the point here is discussing about the relative value and advantages and disadvantages of contest award challenges. We have any flavor of awards and challenges and contests here. Right. And I think, I mean, I really like what, I mean, what these people@visualizing.org are doing is really, it's really nice. They are promoting visualization everywhere, and they have been organizing this wonderful set of challenges all around the world. I mean, it's really great. They're really doing a wonderful job in trying to evangelize the visualization around the world. But I don't know. I think that it's the mix of having students who normally are not, I mean, cannot be as proficient as professionals and at the same time, giving awards to them maybe doesn't really work too well, because my concern is that people then go back to the, to the web page to see who received the awards and then they say, oh, that's the best. Right? Yeah. I don't know.",
      "id": "ep_2_ut_49"
    },
    {
      "end": 630610,
      "speaker": "Moritz Stefaner",
      "start": 559126,
      "text": "But I mean, there's so many types of contests, not just in the visualization scene. And the question is, what types of. Yeah. What does an award, what is it given for? Right. And I mean, it's clear that visualization is not like a 100 meters race where you just measure who is fastest or, you know, best in some absolute sense. It's more like the Oscars where it's always the wrong ones winning, you know. No. Or it's at least, you know, there's a jury involved and the criteria often a bit fuzzy. And so in the end, it's often a compromise also what comes out and so on. So I've been on a few juries and it is difficult to get like five totally different people, you know, to at least agree on a set of standards to judge after. So you could say that might be the competition's fault for not making the criteria clear also. But I can sort of sympathize with that. The contest, not just about the winner, but it's more like having a contest at all and getting a certain discussion going, have some results to show off. And so.",
      "id": "ep_2_ut_50"
    },
    {
      "end": 678500,
      "speaker": "Enrico Bertini",
      "start": 631020,
      "text": "Yeah, yeah. But I think there are many ways of organizing contests and challenges. I mean, we have many different flavors, right? We have stuff like, yeah, visualizing marathons where the participants are students. They are, they receive a dataset and they have to produce results in 24 hours. Then we have other kind of contests where anybody can participate from all over the world. They don't have to be there for 24 hours. They have much more time. Or we have awards that are given to people who don't participate to the award. They just. I mean, they are just awarded because they are some. Some people think they are the best, right. There is a jury and they decided these are the best.",
      "id": "ep_2_ut_51"
    },
    {
      "end": 689660,
      "speaker": "Moritz Stefaner",
      "start": 679080,
      "text": "But I think we don't have enough of these. So we have mainly. We have just mainly these. There's a theme or a dataset and now you have a week and the winner gets a PlayStation.",
      "id": "ep_2_ut_52"
    },
    {
      "end": 692334,
      "speaker": "Enrico Bertini",
      "start": 691910,
      "text": "Yeah.",
      "id": "ep_2_ut_53"
    },
    {
      "end": 729762,
      "speaker": "Moritz Stefaner",
      "start": 692382,
      "text": "You know what I was shocked about was to see that the NSF challenge, the National Science foundation in America, it's big. You know, it's big. And I was like, wow, they have a visualization contest. That's so cool. I will hand something in. And then I looked at the categories and they had posters, they have games, they have videos. And I was like, yeah, that's really cool. Lots of categories, but there's nothing for interaction. No exploratory data analysis, no interactive data visualization. You cannot hand that in. There is no place for that. I was really shocked.",
      "id": "ep_2_ut_54"
    },
    {
      "end": 731470,
      "speaker": "Enrico Bertini",
      "start": 729866,
      "text": "We should organize a protest.",
      "id": "ep_2_ut_55"
    },
    {
      "end": 735870,
      "speaker": "Moritz Stefaner",
      "start": 731930,
      "text": "I did. I mean, it was just me, but I sent like three or four emails.",
      "id": "ep_2_ut_56"
    },
    {
      "end": 737866,
      "speaker": "Enrico Bertini",
      "start": 736370,
      "text": "And did you get an answer?",
      "id": "ep_2_ut_57"
    },
    {
      "end": 752004,
      "speaker": "Moritz Stefaner",
      "start": 738018,
      "text": "Yeah, that they said, that's a pity that I cannot hand in anything because it looks really nice what I'm doing there. And so I was like, yeah, great, maybe see you next year. But somehow I doubt it. I don't know.",
      "id": "ep_2_ut_58"
    },
    {
      "end": 792168,
      "speaker": "Enrico Bertini",
      "start": 752092,
      "text": "Yeah. I must say that on the academic side, there is a long tradition of contests as well, and not only in visualization. I mean, you can find contests everywhere. There are famous contests. There is a very famous contest in the area of data mining, I think it's called the KDD cup, and it's really impressive what people do there. But in that case, it's really, I mean, it's somewhat easier because the quality criteria is pretty straightforward. I mean, you can turn, you can boil it down to a few numbers. Right? I mean, it's, if it's faster and more effective and they have a clear way to measure it, then you win.",
      "id": "ep_2_ut_59"
    },
    {
      "end": 794664,
      "speaker": "Moritz Stefaner",
      "start": 792344,
      "text": "Yeah, that's more like the 100 meters race.",
      "id": "ep_2_ut_60"
    },
    {
      "end": 799252,
      "speaker": "Enrico Bertini",
      "start": 794712,
      "text": "Yeah, that's a lot easier, right? I mean, you don't even need any judges there.",
      "id": "ep_2_ut_61"
    },
    {
      "end": 804076,
      "speaker": "Moritz Stefaner",
      "start": 799396,
      "text": "No, you can just have, you can automatize it.",
      "id": "ep_2_ut_62"
    },
    {
      "end": 813580,
      "speaker": "Enrico Bertini",
      "start": 804148,
      "text": "I think that's the problem with visualization, that you cannot really make it automatic. I mean, maybe it's not the problem. That's, that's nice. I like it that it's. You cannot really judge it that way.",
      "id": "ep_2_ut_63"
    },
    {
      "end": 836736,
      "speaker": "Moritz Stefaner",
      "start": 813740,
      "text": "Exactly. I mean, you still have best, best song of the year, best album of the year, best movie of the year. You have all these, you know, awards and top lists, too. You have the Grammys, you have the Oscars. So it's not impossible. It's not impossible, but, yeah. Anyways, how about the vast challenge? Have you ever contributed there or did it ever take part?",
      "id": "ep_2_ut_64"
    },
    {
      "end": 903890,
      "speaker": "Enrico Bertini",
      "start": 836888,
      "text": "Yeah, I did last year. And before the vast challenge, there was actually another challenge a few years ago that was dismissed, which was called, I think, the infoviest challenge or something like that. And there is also a vis challenge for cybies and. But the vast challenge seems to be the most successful and promising. I know some of the people who are behind the challenge, like Catherine Pleasant, for instance, and George Greenstein, they spent a lot, a very long time trying to make it a success and make it a serious thing. And it's really, really nice. I mean, what I really liked there that people might not know is that this challenge works in a way that they prepare some real world data with synthetic insights inside. Okay. So I don't remember exactly how they do that. I know it takes a long time.",
      "id": "ep_2_ut_65"
    },
    {
      "end": 911930,
      "speaker": "Moritz Stefaner",
      "start": 904910,
      "text": "But they sort of hide some easter eggs. Sort of. Could you say that? So they. Yeah, it's something surprising to find.",
      "id": "ep_2_ut_66"
    },
    {
      "end": 916658,
      "speaker": "Enrico Bertini",
      "start": 912550,
      "text": "So I think what is really nice there is that one treasure hunt.",
      "id": "ep_2_ut_67"
    },
    {
      "end": 917402,
      "speaker": "Moritz Stefaner",
      "start": 916714,
      "text": "I like that. Yeah.",
      "id": "ep_2_ut_68"
    },
    {
      "end": 1017910,
      "speaker": "Enrico Bertini",
      "start": 917426,
      "text": "I mean, in one way you could either come up with a completely synthetic data set, but then it would look fake. Right, exactly. So I think the way they do it, they start from real data and then they change it in a way to hide interesting information to discover there. So it's very much targeted to discovery. Okay. So in a way you can say that in this way you can have this kind of evaluation that is similar to the KDD cap, where you count the number of insights that have been found by, by a team, and then you judge according to the number of discovered insights. But that's not the way they do it. And I think it's really nice. I mean, of course they count the insights, but another great thing they do is they involve expert domain experts in the process. So the people who judge the entries are not only computer scientists or visualization experts, but also domain experts. So, for instance, last year there was one of the challenges was on security and about flu outbreak in a city, and some of the judges were people who are expert in this field. I think some, I think, I'm not sure, but maybe some virologist or biologist or people like that. And I think that's really, really nice. And I would like to see more of that in any other kind of contest, like end users or domain experts judging the quality of the end product. I think that's the problem. As long as visualization people will judge the result, it will be very limited, in my opinion.",
      "id": "ep_2_ut_69"
    },
    {
      "end": 1082880,
      "speaker": "Moritz Stefaner",
      "start": 1018890,
      "text": "But what I found interesting there is that the data set is given and the task is to make the most out of this data set or generate the most insights from that data set. And I think that's something that highlights, again, maybe the difference between the academic approach and the, maybe the more designy or journalistic approach, because there often it would be exactly the task to find also an interesting data set or to combine two data sets in an interesting novel way, and this focus on the data sets that this one is given. I think that's often an assumption in academia. Like this is, oh, this is nothing we can do about this is out of our hands. But we can work on how, how once you have the data set, how to visualize it and how to structure it and so on. Yeah, I always followed the vast challenge because exactly as you say, it's very well founded and the results are also very deep. So you can really see that some people spent weeks with that dataset. It's really interesting.",
      "id": "ep_2_ut_70"
    },
    {
      "end": 1112720,
      "speaker": "Enrico Bertini",
      "start": 1083000,
      "text": "Yeah. And I want to encourage people to participate there as well because it's really nice. And what is really interesting is that you can participate either by using existing tools. So, for instance, it's perfectly fine. It's perfectly fine to take Tableau, explore the data and submit something that comes out of Tableau only exclusively. Okay. As well as creating your own tool from scratch. It's fine. Both cases.",
      "id": "ep_2_ut_71"
    },
    {
      "end": 1131712,
      "speaker": "Moritz Stefaner",
      "start": 1112800,
      "text": "And often scientists use it to show off their tools. But then it's also nice because you can compare these tools with one data set, because often people, you know, they show their new network visualization with a network you haven't seen before. No chance to understand if it's really good or not. But if people use the same data sets, you get a sense of what is better, what is not so good.",
      "id": "ep_2_ut_72"
    },
    {
      "end": 1174690,
      "speaker": "Enrico Bertini",
      "start": 1131816,
      "text": "Yeah, yeah. And then what is really nice. I mean, I think that's another interesting point, is that the selected winners, let's say they are invited to the this week conference and they have some dedicated space for them. They have, I think they have a sort of. Yeah, they have a half day workshop at the beginning where they can meet all together and discuss the results and confront each other. And, and then they have an open session in the, I think normally in the afternoon where they present the results to the, to the audience, to the old audience of the conference. So it's really, really nice. I mean, it's.",
      "id": "ep_2_ut_73"
    },
    {
      "end": 1176470,
      "speaker": "Moritz Stefaner",
      "start": 1174870,
      "text": "Damn, I should take part.",
      "id": "ep_2_ut_74"
    },
    {
      "end": 1226450,
      "speaker": "Enrico Bertini",
      "start": 1176970,
      "text": "Absolutely, absolutely. I mean, this is a little bit off topic, but what I always think is that you guys, people like you, Moritz, who are creating excellent visualizations and are working on the design side of visualization. It's really painful for me to go to this week conference and see so many bright people, but not so many bright people coming from your area, designers or consultants or. Yeah, all those people who are very active on the web, they have nice projects, they have lots of exposure, but just don't mix up too much with this academic environment. And I think this is bad for both parties, I think.",
      "id": "ep_2_ut_75"
    },
    {
      "end": 1253522,
      "speaker": "Moritz Stefaner",
      "start": 1228710,
      "text": "Yeah, that's the eternal issue in the database scene, I think. But you're right, the challenge is there could be a place where you actually meet and you can nicely contrast the approaches and maybe see that there's something to both of them and so on. So yeah, maybe. I think once the challenge is out, maybe we spread the word a bit and maybe a few more external people, let's say from the research community, they would participate. Maybe that's a start.",
      "id": "ep_2_ut_76"
    },
    {
      "end": 1267930,
      "speaker": "Enrico Bertini",
      "start": 1253626,
      "text": "Absolutely, absolutely. I think, yeah, maybe we could try to invite George Greenstein. He's a very cheerful person and yeah, it would be really fantastic to have him on the podcast and I think he would be happy to participate.",
      "id": "ep_2_ut_77"
    },
    {
      "end": 1276318,
      "speaker": "Moritz Stefaner",
      "start": 1271350,
      "text": "And any other contests you found interesting or what types of contests we have?",
      "id": "ep_2_ut_78"
    },
    {
      "end": 1283010,
      "speaker": "Enrico Bertini",
      "start": 1276374,
      "text": "I just wanted to briefly comment. Information is beautiful. Awards, because we got the results yesterday. What's your impression?",
      "id": "ep_2_ut_79"
    },
    {
      "end": 1320230,
      "speaker": "Moritz Stefaner",
      "start": 1285510,
      "text": "I think it was really a lot of good submissions in my view. So I was really surprised because the dataset was fairly large and for me it's always like, wow, when do people find the time to do so much work for free? And just for a contest where you win a few hundred dollars, possibly, but many people seem to take that chance. And I found some entries really interesting. So what was your impression?",
      "id": "ep_2_ut_80"
    },
    {
      "end": 1348550,
      "speaker": "Enrico Bertini",
      "start": 1321850,
      "text": "I gave a quick look and yeah, I was also surprised by how many entries they received and I'm not too surprised by the results, but I mean, I received already too many bad comments on my last blog post and want people to kill me.",
      "id": "ep_2_ut_81"
    },
    {
      "end": 1351890,
      "speaker": "Moritz Stefaner",
      "start": 1349990,
      "text": "What was the bar chart one?",
      "id": "ep_2_ut_82"
    },
    {
      "end": 1385420,
      "speaker": "Enrico Bertini",
      "start": 1352430,
      "text": "Oh, the bar chart one was the best comment I was. It still hurts, it still hurts. It still hurts. It's like that was Jakob Jockman, he said, for crying out loud. Some people believe that you and other visualization, people with a statistics background, which by the way, I don't have, I have a computer science background, only accept bar graphs as validity and that every chart that is not one goes against a divine dogma.",
      "id": "ep_2_ut_83"
    },
    {
      "end": 1393920,
      "speaker": "Moritz Stefaner",
      "start": 1388200,
      "text": "I mean, yeah, so you are just even few of data visualizations, right?",
      "id": "ep_2_ut_84"
    },
    {
      "end": 1400020,
      "speaker": "Enrico Bertini",
      "start": 1394040,
      "text": "That hurts. That hurts. But yeah, something must have gone wrong along the way. I mean.",
      "id": "ep_2_ut_85"
    },
    {
      "end": 1418592,
      "speaker": "Moritz Stefaner",
      "start": 1400880,
      "text": "Yeah, yeah, but there you see how, you know, how much, how much fight has been going on already, that if you are being put into that box, you know, you see already how the frontiers are being built up, right? The lines in the sand, they are being drawn. You're either against us.",
      "id": "ep_2_ut_86"
    },
    {
      "end": 1426368,
      "speaker": "Enrico Bertini",
      "start": 1418656,
      "text": "Forest and I got some pretty strong ones from Andrew as well. We had a long discussion.",
      "id": "ep_2_ut_87"
    },
    {
      "end": 1447480,
      "speaker": "Moritz Stefaner",
      "start": 1426504,
      "text": "Yeah, yeah, I think he has more the student's perspective and this perspective that any, you know, any contest or any activity where people come together and practice information visualization is good because it just advances the field by practice. And so I can relate to that too in some ways.",
      "id": "ep_2_ut_88"
    },
    {
      "end": 1497774,
      "speaker": "Enrico Bertini",
      "start": 1447640,
      "text": "Yeah. But let me say, I think there is a way to make bar graphs pretty not necessarily, if you use bar graphs, it has to be ugly, right? They are extremely powerful, but I'm not that kind of person. I like many other kinds of visualizations. Yeah, okay, this hurts, but let me say something positive. I mean, for a. There is one entry in information is beautiful awards that I really like. And if you go on the. So there are many, many. I still didn't understand how it works, but I think they gave different kind of awards. And one of these list is called design. I think it's the design shortlist or something like that.",
      "id": "ep_2_ut_89"
    },
    {
      "end": 1498878,
      "speaker": "Moritz Stefaner",
      "start": 1497822,
      "text": "Yeah, there's design.",
      "id": "ep_2_ut_90"
    },
    {
      "end": 1499750,
      "speaker": "Enrico Bertini",
      "start": 1499014,
      "text": "They have design.",
      "id": "ep_2_ut_91"
    },
    {
      "end": 1502086,
      "speaker": "Moritz Stefaner",
      "start": 1499830,
      "text": "Napkin and interactive.",
      "id": "ep_2_ut_92"
    },
    {
      "end": 1505318,
      "speaker": "Enrico Bertini",
      "start": 1502198,
      "text": "Yeah, I haven't seen napkin, but I think it's a very good idea.",
      "id": "ep_2_ut_93"
    },
    {
      "end": 1521634,
      "speaker": "Moritz Stefaner",
      "start": 1505414,
      "text": "Anyway, I guess just sketches and design is static information, graphics and interactive is like full application. I think that's really strong about this award, that it makes this distinction. And I think especially the napkin thing, it draws people in who wouldn't have a chance to submit to other contests.",
      "id": "ep_2_ut_94"
    },
    {
      "end": 1552638,
      "speaker": "Enrico Bertini",
      "start": 1521682,
      "text": "I think it's a great idea. Great idea. So there is one entry that is called Spotlight of profitability, which, by the way, I'll try to link on our blog so people can see it before we will discuss it. And that one, it's very good. I like it a lot. So I don't know how to describe it and I don't know. Moritz, do you have a way to describe it? Because it's really hard.",
      "id": "ep_2_ut_95"
    },
    {
      "end": 1615422,
      "speaker": "Moritz Stefaner",
      "start": 1552774,
      "text": "Yeah, it's difficult. But basically there's, for each movie, there's two axes. One is the rotten Tomato score, which is like, you could say, the critics account, running from one, from zero to 100. And on the right hand side, you have the profitability, you have the budget they spend for making the movie, and you have the amount of money the movie generated, and a very profitable movie, you know, you generate much more than you spend, of course. And now they connect these three points. The critics account on the left hand side, budget spend on the right hand side, and the revenues on the right hand side, they connect that to a triangle. And this is something you shouldn't do, probably, because, you know, it's like, yeah, let's make a triangle. So that's sort of also the fun part of this visualization, but together it creates this really unique shape for each movie. It's a triangle that has a certain area and a certain, let's say, rotation. And you can read these two values pretty well.",
      "id": "ep_2_ut_96"
    },
    {
      "end": 1649576,
      "speaker": "Enrico Bertini",
      "start": 1615606,
      "text": "Yeah. So let me suggest something. So if you are listening to the podcast right now, my suggestion is to stop here, go on our webpage and try to find the link, we will put it on top so you can see the image spotlight on profitability before we continue discussing it. It makes sense. So no complaints allowed from this point on. Yeah, I really like it. I mean, it's. Of course, it's a strong case of small multiples as well.",
      "id": "ep_2_ut_97"
    },
    {
      "end": 1658456,
      "speaker": "Moritz Stefaner",
      "start": 1649688,
      "text": "Yeah. So you have lots of movies. Lots of little movies and little glyphs for the movies, little graphic symbols. And you can compare them pretty well.",
      "id": "ep_2_ut_98"
    },
    {
      "end": 1674130,
      "speaker": "Enrico Bertini",
      "start": 1658568,
      "text": "Yeah. And, you know, I'm. I must confess that I have a deep love for glyphs. I don't know. Every time I see a glyph, they are so informative. When they are used in a proper way, they are so informative.",
      "id": "ep_2_ut_99"
    },
    {
      "end": 1679526,
      "speaker": "Moritz Stefaner",
      "start": 1675630,
      "text": "It's really the types of graphics where you can sit down and study them, right?",
      "id": "ep_2_ut_100"
    },
    {
      "end": 1679814,
      "speaker": "Enrico Bertini",
      "start": 1679558,
      "text": "Yeah.",
      "id": "ep_2_ut_101"
    },
    {
      "end": 1696550,
      "speaker": "Moritz Stefaner",
      "start": 1679862,
      "text": "So you sit down and you try to find, okay, what jumps to my eye first. And what's this pattern? And what's going on over here? There's nothing over here. Why is nothing over here? You know, so these are really like a map. You can study these graphics. Yeah, for a long time.",
      "id": "ep_2_ut_102"
    },
    {
      "end": 1728782,
      "speaker": "Enrico Bertini",
      "start": 1696630,
      "text": "I think that's the real. That's the real reason why I like it so much, because it makes me want to see more, to investigate more. I want to see, I can see some broad patterns now. I want to see the details. And now I want to compare one glyph to another and discover new things. It's. It's nice. And there is this big, I mean, this big outlier from Avatar, which is on the bottom in the center. It's really nice. You can see it. It's very evident. And then you can see all these huge profits.",
      "id": "ep_2_ut_103"
    },
    {
      "end": 1729214,
      "speaker": "Moritz Stefaner",
      "start": 1728846,
      "text": "Right?",
      "id": "ep_2_ut_104"
    },
    {
      "end": 1736918,
      "speaker": "Enrico Bertini",
      "start": 1729302,
      "text": "Huge profits, yes, huge profits. And then you can see all this documentary which have very narrow profits, and.",
      "id": "ep_2_ut_105"
    },
    {
      "end": 1746010,
      "speaker": "Moritz Stefaner",
      "start": 1736934,
      "text": "It's getting worse over the years. So left to right, you see also the trend over the years. It's bad and it's getting worse. So that's the story for documentaries.",
      "id": "ep_2_ut_106"
    },
    {
      "end": 1747790,
      "speaker": "Enrico Bertini",
      "start": 1746130,
      "text": "Yeah. Yeah.",
      "id": "ep_2_ut_107"
    },
    {
      "end": 1753370,
      "speaker": "Moritz Stefaner",
      "start": 1748130,
      "text": "One thing, animation movies, I underestimated these. You can see that immediately.",
      "id": "ep_2_ut_108"
    },
    {
      "end": 1779940,
      "speaker": "Enrico Bertini",
      "start": 1753490,
      "text": "Yeah. What I cannot see is if I. Let me see, I cannot find any slope in the other direction, which would be nice to see, like, rated with a low score, rotten tomato score and a high profit. Probably. There exists this kind of movies, but they are nothing because in each glyph, the top three have been selected profitable. It would be nice to have the opposite, right?",
      "id": "ep_2_ut_109"
    },
    {
      "end": 1780356,
      "speaker": "Moritz Stefaner",
      "start": 1780060,
      "text": "Yeah.",
      "id": "ep_2_ut_110"
    },
    {
      "end": 1783988,
      "speaker": "Enrico Bertini",
      "start": 1780388,
      "text": "So the lowest score and the profit, that would be really nice.",
      "id": "ep_2_ut_111"
    },
    {
      "end": 1803078,
      "speaker": "Moritz Stefaner",
      "start": 1784044,
      "text": "There's, of course, an obvious question for the scale of these two. You know, whenever you align two scales. You have to be really careful of how you align them with each other. And I think there's a problem here because I think the, the budget should have been made logarithmic again. I mean, it's not even indicated if it is or not.",
      "id": "ep_2_ut_112"
    },
    {
      "end": 1803758,
      "speaker": "Enrico Bertini",
      "start": 1803214,
      "text": "Yeah.",
      "id": "ep_2_ut_113"
    },
    {
      "end": 1838540,
      "speaker": "Moritz Stefaner",
      "start": 1803854,
      "text": "And I think the axis should be centered around the median value. So you can really see, you know, not so you can really see that a horizontal line means average or median on both sides. And whenever the slope changes, that it's relative to how the rest of the data looks. So this would be something probably I would criticize, but that's really, like, it's already so beyond of what you would normally criticize. So it's a really strong graphic. No, it's an excellent piece, so I hope it wins. Go spotlight.",
      "id": "ep_2_ut_114"
    },
    {
      "end": 1842940,
      "speaker": "Enrico Bertini",
      "start": 1840560,
      "text": "Yeah. Is there a way to vote?",
      "id": "ep_2_ut_115"
    },
    {
      "end": 1850316,
      "speaker": "Moritz Stefaner",
      "start": 1843680,
      "text": "I don't think so. I mean, you cannot have, like, arbitrary people from the Internet decide what's good. Right.",
      "id": "ep_2_ut_116"
    },
    {
      "end": 1851400,
      "speaker": "Enrico Bertini",
      "start": 1850488,
      "text": "Why not?",
      "id": "ep_2_ut_117"
    },
    {
      "end": 1862040,
      "speaker": "Moritz Stefaner",
      "start": 1852940,
      "text": "Because that would be the end of the world. No, I think there's a jury or something. There's a jury. Of course.",
      "id": "ep_2_ut_118"
    },
    {
      "end": 1863840,
      "speaker": "Enrico Bertini",
      "start": 1862420,
      "text": "It's too democratic.",
      "id": "ep_2_ut_119"
    },
    {
      "end": 1873028,
      "speaker": "Moritz Stefaner",
      "start": 1864540,
      "text": "Yeah. And otherwise you have, like, everybody mobilizing his funny Facebook friends to vote for him, and things get out of hand if we don't want that.",
      "id": "ep_2_ut_120"
    },
    {
      "end": 1887930,
      "speaker": "Enrico Bertini",
      "start": 1873204,
      "text": "Yeah. No, yeah. I think it's interesting that if you compare the interactive short Louis shortlist with the, with the design shortlist, I mean, I'm surprised, but I tend to like more the design shortlist.",
      "id": "ep_2_ut_121"
    },
    {
      "end": 1889090,
      "speaker": "Moritz Stefaner",
      "start": 1888010,
      "text": "That's a shocker.",
      "id": "ep_2_ut_122"
    },
    {
      "end": 1894474,
      "speaker": "Enrico Bertini",
      "start": 1889250,
      "text": "That's a shock for me. I don't know. Yeah.",
      "id": "ep_2_ut_123"
    },
    {
      "end": 1915420,
      "speaker": "Moritz Stefaner",
      "start": 1894602,
      "text": "Interesting. Yeah, yeah. I haven't looked at all entries in detail. It's really a lot of them. So, yeah, just by. Okay, this one looks nice. This one, too. So probably we should take our time and click through all of them in Printlab. It's nice that you have this chance to compare all these visualizations of the same data set. So, yeah. A lot to learn there.",
      "id": "ep_2_ut_124"
    },
    {
      "end": 1924860,
      "speaker": "Enrico Bertini",
      "start": 1916280,
      "text": "Yeah. So I think, yeah. Do you have, do you want to say anything else about this contest? I don't know. Words?",
      "id": "ep_2_ut_125"
    },
    {
      "end": 1967240,
      "speaker": "Moritz Stefaner",
      "start": 1926040,
      "text": "I think it's, I mean, pros and cons, I think, I mean, last time we were a bit critical about the contest, and last year, Washington, definitely too many contests. And for a while, it looked like that everybody and their dog would make a data visualization contest just to hop on the train. Right. But I think now, this year, to me, it seems that the few contests that are still around or, you know, now that the big wave has passed, then I'm fine with having lots of contests because it's very, it's very nice for people to get started and it's entertaining for us to see the entries. So nothing bad about that.",
      "id": "ep_2_ut_126"
    },
    {
      "end": 1971980,
      "speaker": "Enrico Bertini",
      "start": 1968340,
      "text": "Are you scared that you're going to have too many competitors on the market?",
      "id": "ep_2_ut_127"
    },
    {
      "end": 1980280,
      "speaker": "Moritz Stefaner",
      "start": 1972140,
      "text": "Oh, yeah, there's so many people coming up, so I have to run a bit faster. But as long as they waste their time on contests, I'm.",
      "id": "ep_2_ut_128"
    },
    {
      "end": 1983724,
      "speaker": "Enrico Bertini",
      "start": 1982860,
      "text": "Good point.",
      "id": "ep_2_ut_129"
    },
    {
      "end": 1985200,
      "speaker": "Moritz Stefaner",
      "start": 1983852,
      "text": "Let's keep them going.",
      "id": "ep_2_ut_130"
    },
    {
      "end": 1989370,
      "speaker": "Enrico Bertini",
      "start": 1987130,
      "text": "Let's create more contests.",
      "id": "ep_2_ut_131"
    },
    {
      "end": 2059998,
      "speaker": "Moritz Stefaner",
      "start": 1989490,
      "text": "Exactly. Just to distract people. Yeah. One thing, I'm a bit fed up. I mean, I was a bit frustrated with some contests because they asked for a lot and then give you like $300 or so, you know, or you're invited to some arbitrary place or so. So then I often think, okay, this doesn't really value the work that goes into something like this. And what I see much more, and this might be a consequence of that, is that I get requests for proposals where people say, we have a potential job. Would you like to, you know, where you could work as a contractor? But listen, can you make like two or three data visualizations for us first so we can figure out if you're the right person? Oh, really? Yeah, yeah. So I had this request where people, they wanted to have ten to 20 ideas based on their data sets and one fully executed graphic with zero pay. And they sent that out to ten people or so and then they would say, yeah, this one looks nice, we might consider working with him. And I'm like, wow, this is just, this is just.",
      "id": "ep_2_ut_132"
    },
    {
      "end": 2068806,
      "speaker": "Enrico Bertini",
      "start": 2060054,
      "text": "But I think this should be balanced with what's at stake there. I mean, are you talking about very.",
      "id": "ep_2_ut_133"
    },
    {
      "end": 2071694,
      "speaker": "Moritz Stefaner",
      "start": 2068878,
      "text": "It's a long term contract and probably a big budget.",
      "id": "ep_2_ut_134"
    },
    {
      "end": 2072810,
      "speaker": "Enrico Bertini",
      "start": 2071782,
      "text": "Yeah, big budget.",
      "id": "ep_2_ut_135"
    },
    {
      "end": 2080450,
      "speaker": "Moritz Stefaner",
      "start": 2073190,
      "text": "But still, you could figure that out. Who's the right one to work with just by looking at the portfolios or maybe doing a little job with them.",
      "id": "ep_2_ut_136"
    },
    {
      "end": 2080842,
      "speaker": "Enrico Bertini",
      "start": 2080530,
      "text": "Yeah.",
      "id": "ep_2_ut_137"
    },
    {
      "end": 2111216,
      "speaker": "Moritz Stefaner",
      "start": 2080906,
      "text": "Like one graphic and then you figure out. But you pay them for the effort. Yeah, if I deliver ten or 20 ideas, that's consulting. That's what I do, you know, that's what I do for a living, not in my spare time. I'm sorry. Yeah. And so there might be a problem there with, you know, if we have too many, like for free or for fun competitions that people think it's something you do in the afternoon, like when you have a bored, you make a little visualization. But I mean, of course it's hard work.",
      "id": "ep_2_ut_138"
    },
    {
      "end": 2114420,
      "speaker": "Enrico Bertini",
      "start": 2111368,
      "text": "Moritz, I managed to let you go into a rant.",
      "id": "ep_2_ut_139"
    },
    {
      "end": 2118216,
      "speaker": "Moritz Stefaner",
      "start": 2116240,
      "text": "Probably you even tracked me into it.",
      "id": "ep_2_ut_140"
    },
    {
      "end": 2123940,
      "speaker": "Enrico Bertini",
      "start": 2118328,
      "text": "Yes, of course. I've been thinking about it for the last two weeks.",
      "id": "ep_2_ut_141"
    },
    {
      "end": 2127160,
      "speaker": "Moritz Stefaner",
      "start": 2125320,
      "text": "Very good. Mission accomplished.",
      "id": "ep_2_ut_142"
    },
    {
      "end": 2127856,
      "speaker": "Enrico Bertini",
      "start": 2127240,
      "text": "Accomplished.",
      "id": "ep_2_ut_143"
    },
    {
      "end": 2128620,
      "speaker": "Moritz Stefaner",
      "start": 2127888,
      "text": "Check.",
      "id": "ep_2_ut_144"
    },
    {
      "end": 2131616,
      "speaker": "Enrico Bertini",
      "start": 2131000,
      "text": "Okay.",
      "id": "ep_2_ut_145"
    },
    {
      "end": 2133620,
      "speaker": "Moritz Stefaner",
      "start": 2131688,
      "text": "I'll get you next time, buddy.",
      "id": "ep_2_ut_146"
    },
    {
      "end": 2134044,
      "speaker": "Enrico Bertini",
      "start": 2133720,
      "text": "Yeah.",
      "id": "ep_2_ut_147"
    },
    {
      "end": 2134920,
      "speaker": "Moritz Stefaner",
      "start": 2134092,
      "text": "Be ready.",
      "id": "ep_2_ut_148"
    },
    {
      "end": 2144300,
      "speaker": "Enrico Bertini",
      "start": 2136900,
      "text": "Prepare well. Okay. I think it's enough for today. We've been talking for around 1 hour.",
      "id": "ep_2_ut_149"
    },
    {
      "end": 2145300,
      "speaker": "Moritz Stefaner",
      "start": 2144460,
      "text": "No way.",
      "id": "ep_2_ut_150"
    },
    {
      "end": 2146428,
      "speaker": "Enrico Bertini",
      "start": 2145420,
      "text": "No way. Yeah.",
      "id": "ep_2_ut_151"
    },
    {
      "end": 2149724,
      "speaker": "Moritz Stefaner",
      "start": 2146484,
      "text": "Damn it. Yeah. No, it's 36 minutes.",
      "id": "ep_2_ut_152"
    },
    {
      "end": 2150644,
      "speaker": "Enrico Bertini",
      "start": 2149892,
      "text": "Oh, okay.",
      "id": "ep_2_ut_153"
    },
    {
      "end": 2164610,
      "speaker": "Moritz Stefaner",
      "start": 2150692,
      "text": "Yeah. The first 20 minutes we weren't recording, so that's fine. But it's still. Yeah, you're right. I think we're good here. We will try and document it well on the blog post. Go to the website. I mean, now it's too late again.",
      "id": "ep_2_ut_154"
    },
    {
      "end": 2165910,
      "speaker": "Enrico Bertini",
      "start": 2164690,
      "text": "So now it's too late.",
      "id": "ep_2_ut_155"
    },
    {
      "end": 2174510,
      "speaker": "Moritz Stefaner",
      "start": 2169890,
      "text": "Just send us comments. What do we do next time? Do we have an idea yet? Not really.",
      "id": "ep_2_ut_156"
    },
    {
      "end": 2181850,
      "speaker": "Enrico Bertini",
      "start": 2175610,
      "text": "So what we can say is that we of course made a list out of the suggestions you guys sent to us.",
      "id": "ep_2_ut_157"
    },
    {
      "end": 2182954,
      "speaker": "Moritz Stefaner",
      "start": 2181970,
      "text": "Lots of good stuff.",
      "id": "ep_2_ut_158"
    },
    {
      "end": 2208812,
      "speaker": "Enrico Bertini",
      "start": 2183042,
      "text": "Lots of good stuff. Thanks a lot. And there are some technical things and some more, I don't know, deep thinking kind of things. And I think a lot of people also want to know more about how to learn infovis, how to teach infovys, what kind of courses and material are out there. This could be nice. I don't know.",
      "id": "ep_2_ut_159"
    },
    {
      "end": 2230262,
      "speaker": "Moritz Stefaner",
      "start": 2208956,
      "text": "Yeah. So we could think along these lines because you're right, this was really a recurring comment to help people to get started or discover like the really interesting tools and some practical tips maybe. So. Yeah. We might look into also into books on the topic or present some tools, papers, findings. Yeah.",
      "id": "ep_2_ut_160"
    },
    {
      "end": 2245406,
      "speaker": "Enrico Bertini",
      "start": 2230366,
      "text": "Please send us more comments and let us know what you want to hear from these two crazy guys and these exotic eurovoices. We should make a t shirt. Yeah.",
      "id": "ep_2_ut_161"
    },
    {
      "end": 2252478,
      "speaker": "Moritz Stefaner",
      "start": 2245478,
      "text": "Probably makes me very self conscious now that I have to think about my euro voice too much.",
      "id": "ep_2_ut_162"
    },
    {
      "end": 2261638,
      "speaker": "Enrico Bertini",
      "start": 2252534,
      "text": "Can you make it more German? I can make it more Italian. Let me try. Yeah, of course. No. Oh, I cannot make it.",
      "id": "ep_2_ut_163"
    },
    {
      "end": 2265566,
      "speaker": "Moritz Stefaner",
      "start": 2261814,
      "text": "Next time we practice our euro voices.",
      "id": "ep_2_ut_164"
    },
    {
      "end": 2266430,
      "speaker": "Enrico Bertini",
      "start": 2265638,
      "text": "Yeah, yeah, next time.",
      "id": "ep_2_ut_165"
    },
    {
      "end": 2268850,
      "speaker": "Moritz Stefaner",
      "start": 2266470,
      "text": "Next time I'll go with a bulgarian accent maybe.",
      "id": "ep_2_ut_166"
    },
    {
      "end": 2269786,
      "speaker": "Enrico Bertini",
      "start": 2268970,
      "text": "Okay.",
      "id": "ep_2_ut_167"
    },
    {
      "end": 2271986,
      "speaker": "Moritz Stefaner",
      "start": 2269938,
      "text": "I hear that's very fancy these days.",
      "id": "ep_2_ut_168"
    },
    {
      "end": 2284954,
      "speaker": "Enrico Bertini",
      "start": 2272098,
      "text": "Yeah. Another thing I want to say is that we are also planning for having some guests. And if you have more suggestions about who you would like to have here.",
      "id": "ep_2_ut_169"
    },
    {
      "end": 2288538,
      "speaker": "Moritz Stefaner",
      "start": 2285002,
      "text": "As guests, you can also suggest yourself. That's fine.",
      "id": "ep_2_ut_170"
    },
    {
      "end": 2293658,
      "speaker": "Enrico Bertini",
      "start": 2288594,
      "text": "You can suggest yourself. Some people did it already. It's really nice.",
      "id": "ep_2_ut_171"
    },
    {
      "end": 2294346,
      "speaker": "Moritz Stefaner",
      "start": 2293794,
      "text": "Yeah.",
      "id": "ep_2_ut_172"
    },
    {
      "end": 2299070,
      "speaker": "Enrico Bertini",
      "start": 2294458,
      "text": "And yeah. What's the biggest name we can invite? Moritz.",
      "id": "ep_2_ut_173"
    },
    {
      "end": 2300530,
      "speaker": "Moritz Stefaner",
      "start": 2299730,
      "text": "Big names.",
      "id": "ep_2_ut_174"
    },
    {
      "end": 2303390,
      "speaker": "Enrico Bertini",
      "start": 2300610,
      "text": "Yeah. If you can choose one.",
      "id": "ep_2_ut_175"
    },
    {
      "end": 2307650,
      "speaker": "Moritz Stefaner",
      "start": 2304530,
      "text": "One I would really like to have. And he's still alive and everything.",
      "id": "ep_2_ut_176"
    },
    {
      "end": 2308790,
      "speaker": "Enrico Bertini",
      "start": 2307770,
      "text": "Yeah, of course.",
      "id": "ep_2_ut_177"
    },
    {
      "end": 2317306,
      "speaker": "Moritz Stefaner",
      "start": 2311850,
      "text": "That's a good question. I'll think about that for next time. And we should just write them an email, right?",
      "id": "ep_2_ut_178"
    },
    {
      "end": 2318346,
      "speaker": "Enrico Bertini",
      "start": 2317498,
      "text": "Yeah, let's.",
      "id": "ep_2_ut_179"
    },
    {
      "end": 2320590,
      "speaker": "Moritz Stefaner",
      "start": 2318378,
      "text": "Because I mean, you can't lose.",
      "id": "ep_2_ut_180"
    },
    {
      "end": 2325020,
      "speaker": "Enrico Bertini",
      "start": 2321900,
      "text": "Is it you who are followed by Edward Tufte?",
      "id": "ep_2_ut_181"
    },
    {
      "end": 2328200,
      "speaker": "Moritz Stefaner",
      "start": 2325140,
      "text": "Tufte follows me on Twitter, so that's a good start.",
      "id": "ep_2_ut_182"
    },
    {
      "end": 2330160,
      "speaker": "Enrico Bertini",
      "start": 2329300,
      "text": "You see.",
      "id": "ep_2_ut_183"
    },
    {
      "end": 2335780,
      "speaker": "Moritz Stefaner",
      "start": 2333100,
      "text": "So maybe he is too low hanging fruit. Maybe we should.",
      "id": "ep_2_ut_184"
    },
    {
      "end": 2337324,
      "speaker": "Enrico Bertini",
      "start": 2335820,
      "text": "Yeah, maybe it's too easy.",
      "id": "ep_2_ut_185"
    },
    {
      "end": 2339468,
      "speaker": "Moritz Stefaner",
      "start": 2337372,
      "text": "Barack Obama or. Yeah, I agree.",
      "id": "ep_2_ut_186"
    },
    {
      "end": 2354994,
      "speaker": "Enrico Bertini",
      "start": 2339604,
      "text": "Let's see. But again, if you have any suggestions, please let us know you can dream big and let us know who is the biggest name you would like to invite here. Data stories. I think it's enough. Moritz.",
      "id": "ep_2_ut_187"
    },
    {
      "end": 2356722,
      "speaker": "Moritz Stefaner",
      "start": 2355042,
      "text": "I think we're there. Absolutely.",
      "id": "ep_2_ut_188"
    },
    {
      "end": 2358282,
      "speaker": "Enrico Bertini",
      "start": 2356866,
      "text": "It was fun as usual.",
      "id": "ep_2_ut_189"
    },
    {
      "end": 2359074,
      "speaker": "Moritz Stefaner",
      "start": 2358426,
      "text": "Yep.",
      "id": "ep_2_ut_190"
    },
    {
      "end": 2362910,
      "speaker": "Enrico Bertini",
      "start": 2359202,
      "text": "I hope people will listen to it for the whole time.",
      "id": "ep_2_ut_191"
    },
    {
      "end": 2364034,
      "speaker": "Moritz Stefaner",
      "start": 2363410,
      "text": "Who knows?",
      "id": "ep_2_ut_192"
    },
    {
      "end": 2370834,
      "speaker": "Enrico Bertini",
      "start": 2364082,
      "text": "And I hope they will give a look to the visuals before listening and. Yeah, that's all.",
      "id": "ep_2_ut_193"
    },
    {
      "end": 2373138,
      "speaker": "Moritz Stefaner",
      "start": 2371002,
      "text": "See you soon or see you soon. Actually.",
      "id": "ep_2_ut_194"
    },
    {
      "end": 2373954,
      "speaker": "Enrico Bertini",
      "start": 2373234,
      "text": "Hear you soon.",
      "id": "ep_2_ut_195"
    },
    {
      "end": 2375418,
      "speaker": "Moritz Stefaner",
      "start": 2374042,
      "text": "Okay, bye bye.",
      "id": "ep_2_ut_196"
    },
    {
      "end": 2377102,
      "speaker": "Enrico Bertini",
      "start": 2375474,
      "text": "Have fun. Bye.",
      "id": "ep_2_ut_197"
    }
  ],
  "confidence": 0.925143494466146,
  "audio_duration": 2384,
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_status_code": null,
  "webhook_auth": false,
  "webhook_auth_header_name": null,
  "speed_boost": false,
  "auto_highlights_result": null,
  "auto_highlights": false,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_audio_quality": null,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "content_safety": false,
  "iab_categories": true,
  "content_safety_labels": {
    "status": "unavailable",
    "results": [],
    "summary": {}
  },
  "language_detection": false,
  "language_confidence_threshold": null,
  "language_confidence": null,
  "custom_spelling": null,
  "throttled": false,
  "auto_chapters": true,
  "summarization": false,
  "summary_type": null,
  "summary_model": null,
  "custom_topics": false,
  "topics": [],
  "speech_threshold": null,
  "speech_model": "best",
  "chapters": [
    {
      "summary": "Moritz: Busy, busy week. Lots of notifications for Euroviz. Three or four papers out of. three or four accepted. Overall it was really good feedback, I would say. Jen was the only one who said, seriously, guys, we need to stop sucking.",
      "gist": "Data Stories",
      "headline": "Errico and Moritz discuss interactive polls in second episode",
      "start": 12360,
      "end": 212520,
      "id": "ep_2_ch_0"
    },
    {
      "summary": "Many people feel they would need some visuals together with the podcast. Doing a screencast or anything similar would be really complicated. We are trying to do our best and to make it as professional as possible. Next step is a tv show without sucking too much.",
      "gist": "Podcast",
      "headline": "Many people feel they need some visuals together with the podcast",
      "start": 212980,
      "end": 347120,
      "id": "ep_2_ch_1"
    },
    {
      "summary": "We promised we wanted to discuss contests, awards, challenges and stuff like that. There's so many types of contests, not just in the visualization scene. We discuss the relative value and advantages and disadvantages of contest award challenges.",
      "gist": "Contests and Awards in visualization",
      "headline": "We promised we wanted to discuss contests, awards, challenges and stuff",
      "start": 348640,
      "end": 760164,
      "id": "ep_2_ch_2"
    },
    {
      "summary": "I mean, you can find contests everywhere. There is a very famous contest in the area of data mining. It's somewhat easier because the quality criteria is pretty straightforward. But the problem with visualization is that you cannot really make it automatic.",
      "gist": "How to Judge a Data Mining Contest",
      "headline": "You can find contests everywhere that measure quality of data mining",
      "start": 760252,
      "end": 830248,
      "id": "ep_2_ch_3"
    },
    {
      "summary": "The vast challenge works in a way that they prepare some real world data with synthetic insights inside. They involve expert domain experts in the process. I would like to see more of that in any other kind of contest, like end users or domain experts judging the quality of the end product.",
      "gist": "The Vast Challenge",
      "headline": "The vast challenge uses real world data with synthetic insights inside",
      "start": 830324,
      "end": 1267930,
      "id": "ep_2_ch_4"
    },
    {
      "summary": "We got the results of the Information is beautiful Awards yesterday. What was your impression? I think it was really a lot of good submissions in my view. Any contest or any activity where people come together and practice information visualization is good.",
      "gist": "The Information Visualization Contest",
      "headline": "Moritz: I was surprised by how many data visualization contests were submitted",
      "start": 1271350,
      "end": 1649576,
      "id": "ep_2_ch_5"
    },
    {
      "summary": "Every time I see a glyph, they are so informative. It's really the types of graphics where you can sit down and study them. What I cannot see is if I. cannot find any slope in the other direction. It would be nice to have the opposite. Is there a way to vote?",
      "gist": "Film Ratings in a Unicode Glyph",
      "headline": "You have lots of movies and little glyphs for the movies",
      "start": 1649688,
      "end": 1873980,
      "id": "ep_2_ch_6"
    },
    {
      "summary": "No, yeah. I think it's interesting that if you compare the interactive short Louis shortlist with the, with the design shortlist. That's a shocker. So probably we should take our time and click through all of them in Printlab.",
      "gist": "The Interactive Shortlist vs the Design Shortlist",
      "headline": "If you compare the interactive shortlist with the, with the design shortlist",
      "start": 1874140,
      "end": 1919560,
      "id": "ep_2_ch_7"
    },
    {
      "summary": "Moritz: As long as they waste their time on contests, I'm. fine with having lots of contests. Let's create more contests. Just to distract people. Moritz: I get requests for proposals where people say, we have a potential job. Would you like to work as a contractor?",
      "gist": "Data Visualization Contest",
      "headline": "Last year, Washington had too many data visualization contests",
      "start": 1919600,
      "end": 2138000,
      "id": "ep_2_ch_8"
    },
    {
      "summary": "Next time we practice our euro voices. Next time I'll go with a bulgarian accent maybe. Please send us more comments and let us know what you want to hear from these two crazy guys and these exotic eurovoices.",
      "gist": "A talk on infovis",
      "headline": "What do we do next time? Do we have an idea yet",
      "start": 2139420,
      "end": 2272386,
      "id": "ep_2_ch_9"
    },
    {
      "summary": "Another thing I want to say is that we are also planning for having some guests. If you have more suggestions about who you would like to have here. As guests, you can also suggest yourself. What's the biggest name we can invite? Moritz.",
      "gist": "The BIGGEST Name to Invite to the CD",
      "headline": "Another thing I want to say is that we are also planning for some guests",
      "start": 2272418,
      "end": 2377102,
      "id": "ep_2_ch_10"
    }
  ],
  "disfluencies": false,
  "entity_detection": false,
  "sentiment_analysis": false,
  "sentiment_analysis_results": null,
  "entities": null,
  "speakers_expected": null,
  "summary": null,
  "custom_topics_results": null,
  "is_deleted": null,
  "multichannel": false,
  "audio_channels": null,
  "episode_num": "2",
  "episode_metadata": {
    "speakers": [
      "Moritz Stefaner",
      "Enrico Bertini"
    ],
    "WPid": "109",
    "url": "https://datastori.es/podlove/file/218/s/feed/c/mp3/datastories-02.mp3",
    "episode_title": "Visualization Contests, Marathons, Challenges, Awards, Etc."
  }
}