{
  "id": "19210f15-1b4c-4bd1-a651-5ed3c2af6aec",
  "language_model": "assemblyai_default",
  "acoustic_model": "assemblyai_default",
  "language_code": "en_us",
  "status": "completed",
  "audio_url": "https://datastori.es/podlove/file/684/s/feed/c/mp3/Datastories-52.mp3",
  "utterances": [
    {
      "end": 19650,
      "speaker": "Moritz Stefaner",
      "start": 520,
      "text": "Data stories is supported by Tableau software, helping people see and understand their data. Get answers from interactive dashboards wherever you go. For your free trial, visit Tableau software@Tableau.com. Datastories. That's Tableau.com Datastories.",
      "id": "ep_52_ut_0"
    },
    {
      "end": 34364,
      "speaker": "Enrico Bertini",
      "start": 29660,
      "text": "Hi, everyone. Data stories number 52. Hi, Moritz. How's it going?",
      "id": "ep_52_ut_1"
    },
    {
      "end": 36876,
      "speaker": "Moritz Stefaner",
      "start": 34452,
      "text": "Hey, Enrico. Good, good, good.",
      "id": "ep_52_ut_2"
    },
    {
      "end": 39380,
      "speaker": "Enrico Bertini",
      "start": 37028,
      "text": "Sunny, sunny, sunny. Germany.",
      "id": "ep_52_ut_3"
    },
    {
      "end": 42532,
      "speaker": "Moritz Stefaner",
      "start": 39540,
      "text": "It's dark here already. It's 07:00 p.m. man.",
      "id": "ep_52_ut_4"
    },
    {
      "end": 44636,
      "speaker": "Enrico Bertini",
      "start": 42676,
      "text": "Oh, yeah, but it's been.",
      "id": "ep_52_ut_5"
    },
    {
      "end": 45292,
      "speaker": "Moritz Stefaner",
      "start": 44668,
      "text": "No, it's been a day.",
      "id": "ep_52_ut_6"
    },
    {
      "end": 46508,
      "speaker": "Enrico Bertini",
      "start": 45316,
      "text": "So. Clear sky.",
      "id": "ep_52_ut_7"
    },
    {
      "end": 47812,
      "speaker": "Moritz Stefaner",
      "start": 46684,
      "text": "Beautiful day. Clear sky.",
      "id": "ep_52_ut_8"
    },
    {
      "end": 50284,
      "speaker": "Enrico Bertini",
      "start": 47836,
      "text": "You can see the stars. Milky Way.",
      "id": "ep_52_ut_9"
    },
    {
      "end": 60958,
      "speaker": "Moritz Stefaner",
      "start": 50372,
      "text": "Yeah, let me see. Hard to tell at the moment. I'll check later. I'll let you know later. No, but it's been a beautiful day. I'm just a bit tired. It's been a long week, but things are good.",
      "id": "ep_52_ut_10"
    },
    {
      "end": 61622,
      "speaker": "Enrico Bertini",
      "start": 61134,
      "text": "Yeah.",
      "id": "ep_52_ut_11"
    },
    {
      "end": 62966,
      "speaker": "Moritz Stefaner",
      "start": 61686,
      "text": "How are things for you?",
      "id": "ep_52_ut_12"
    },
    {
      "end": 72270,
      "speaker": "Enrico Bertini",
      "start": 63158,
      "text": "Great. Yeah. Lots of work as usual. But spring seems to be here and such a big relief. Man, it's been crazy so far.",
      "id": "ep_52_ut_13"
    },
    {
      "end": 73958,
      "speaker": "Moritz Stefaner",
      "start": 72350,
      "text": "Been a tough winter in New York, huh?",
      "id": "ep_52_ut_14"
    },
    {
      "end": 81046,
      "speaker": "Enrico Bertini",
      "start": 74054,
      "text": "Yeah, it's been terrible. At least for an Italian. It's been pretty nasty here.",
      "id": "ep_52_ut_15"
    },
    {
      "end": 85636,
      "speaker": "Moritz Stefaner",
      "start": 81078,
      "text": "It's just been boring. Always around, plus minus zero. Yeah, that's kind of.",
      "id": "ep_52_ut_16"
    },
    {
      "end": 89616,
      "speaker": "Enrico Bertini",
      "start": 85718,
      "text": "Yeah. And I'm talking from my new standing desk. I'm so excited.",
      "id": "ep_52_ut_17"
    },
    {
      "end": 90376,
      "speaker": "Moritz Stefaner",
      "start": 89688,
      "text": "It's cool.",
      "id": "ep_52_ut_18"
    },
    {
      "end": 94420,
      "speaker": "Enrico Bertini",
      "start": 90488,
      "text": "You can hear the motor. Is it moving? Yeah, it's moving.",
      "id": "ep_52_ut_19"
    },
    {
      "end": 101060,
      "speaker": "Moritz Stefaner",
      "start": 96440,
      "text": "So are you traveling through the building with a segway?",
      "id": "ep_52_ut_20"
    },
    {
      "end": 103976,
      "speaker": "Enrico Bertini",
      "start": 103000,
      "text": "That will be nice.",
      "id": "ep_52_ut_21"
    },
    {
      "end": 105380,
      "speaker": "Moritz Stefaner",
      "start": 104088,
      "text": "That's the next level.",
      "id": "ep_52_ut_22"
    },
    {
      "end": 107888,
      "speaker": "Enrico Bertini",
      "start": 105720,
      "text": "Yeah, yeah, yeah.",
      "id": "ep_52_ut_23"
    },
    {
      "end": 110064,
      "speaker": "Moritz Stefaner",
      "start": 108024,
      "text": "Treadmill is obviously the next step.",
      "id": "ep_52_ut_24"
    },
    {
      "end": 113530,
      "speaker": "Enrico Bertini",
      "start": 110112,
      "text": "That's the next step. Yeah, yeah. I'm already behind.",
      "id": "ep_52_ut_25"
    },
    {
      "end": 124534,
      "speaker": "Moritz Stefaner",
      "start": 115110,
      "text": "No, but standing is good. I have a standing desk, too, and I should use it more often, but sometimes I remember to get up and do a call and standing instead of sitting. It's good.",
      "id": "ep_52_ut_26"
    },
    {
      "end": 134462,
      "speaker": "Enrico Bertini",
      "start": 124582,
      "text": "Yeah, yeah, yeah. Okay. So we have another big guest today. We are very happy to have Jen Christensen from Scientific American. Hi, Jen.",
      "id": "ep_52_ut_27"
    },
    {
      "end": 135078,
      "speaker": "Jen Christiansen",
      "start": 134606,
      "text": "Hi.",
      "id": "ep_52_ut_28"
    },
    {
      "end": 135902,
      "speaker": "Enrico Bertini",
      "start": 135174,
      "text": "How are you?",
      "id": "ep_52_ut_29"
    },
    {
      "end": 137844,
      "speaker": "Jen Christiansen",
      "start": 136006,
      "text": "I'm good, I'm good. How are you?",
      "id": "ep_52_ut_30"
    },
    {
      "end": 172000,
      "speaker": "Enrico Bertini",
      "start": 138022,
      "text": "Great. As I just said, we're doing really well here. So Jen is our director of information graphics at Scientific American, and we had her in our list for a very long time. So we are very happy to have you here, Jen. And we want to talk about what happens at Scientific American and, of course, how it works. I mean, how do you create visualization for science? That's really, really interesting. So, Jen, can you briefly introduce yourself? Maybe you can tell us what's your background, what you're doing? What's your role of Scientific American?",
      "id": "ep_52_ut_31"
    },
    {
      "end": 272700,
      "speaker": "Jen Christiansen",
      "start": 172420,
      "text": "Sure, sure. First of all, thanks for having me. It's a real treat to be here. But yes, I actually came out of a scientific illustration background. So just to give you a quick story, I studied geology and studio art in undergraduate college and then didn't want to choose one field at the exclusion of the other, and found a science illustration program at the University of California, Santa Cruz. So did a one year natural science illustration program, which then led into an internship at Scientific American back in around 96, I believe, where I started to learn about publishing apprenticeship style there for about eight weeks, and then it actually turned into a job. So I learned more and more about publishing in the magazine world. So I was an assistant art director at Scientific American for a few years, and then left to go work at National Geographic magazine, where I was assistant art director there for a few years, and then moved over to the design department, where I learned a little bit more about magazine production and design, again, a little bit apprenticeship style, kind of going up the learning curve. And then I freelanced for a bit and eventually returned to Scientific American, where I been back for probably a good eight years or so, most recently as the art director of information graphics when they kind of reorganized the art department about five years ago and sort of made that a category of its own.",
      "id": "ep_52_ut_32"
    },
    {
      "end": 275804,
      "speaker": "Enrico Bertini",
      "start": 272860,
      "text": "Interesting. So how long have you been at Scientific American now?",
      "id": "ep_52_ut_33"
    },
    {
      "end": 299196,
      "speaker": "Jen Christiansen",
      "start": 275932,
      "text": "Oh, gosh. Off and on for. Well, I worked there for about two years and then I left. But they were one of my primary freelance clients when I was freelancing, but most recently full time for about eight years, but so probably ten years as a staff person and then a good four years additionally as a freelancer.",
      "id": "ep_52_ut_34"
    },
    {
      "end": 313214,
      "speaker": "Enrico Bertini",
      "start": 299348,
      "text": "So I think. So I think a natural question that I want to ask you is what has changed during these years? Because I think so much has happened in this field. So I guess you have experienced quite a few changes during these years, right?",
      "id": "ep_52_ut_35"
    },
    {
      "end": 339170,
      "speaker": "Jen Christiansen",
      "start": 313262,
      "text": "Right. Well, I was so lucky to enter the field at a time where desktop publishing was established. Yet we were still getting most of our artwork through the mail, as pieces, as paintings, and even some of the data visualization was being done by hand. We were starting to get SyQuest discs. Do you remember those?",
      "id": "ep_52_ut_36"
    },
    {
      "end": 341806,
      "speaker": "Enrico Bertini",
      "start": 339510,
      "text": "What is that? What is that?",
      "id": "ep_52_ut_37"
    },
    {
      "end": 353422,
      "speaker": "Jen Christiansen",
      "start": 341838,
      "text": "It was after the floppy disk, but it was larger than a floppy, but before the cd. So we used to get a SyQuest. I think that was probably just the brand name for it.",
      "id": "ep_52_ut_38"
    },
    {
      "end": 354890,
      "speaker": "Moritz Stefaner",
      "start": 353486,
      "text": "Is it like zip drives?",
      "id": "ep_52_ut_39"
    },
    {
      "end": 359926,
      "speaker": "Jen Christiansen",
      "start": 355190,
      "text": "Yes. Yes. Oh, it's larger than that, though. They were a little bit larger, I believe.",
      "id": "ep_52_ut_40"
    },
    {
      "end": 364530,
      "speaker": "Moritz Stefaner",
      "start": 360038,
      "text": "Yeah, it's a thick disc. Yeah, I remember.",
      "id": "ep_52_ut_41"
    },
    {
      "end": 463590,
      "speaker": "Jen Christiansen",
      "start": 365230,
      "text": "Right. So we'd get artist deliveries either as paintings or as on these drives that would be return it then afterwards, because they were expensive. So it was really neat to sort of be at that transition point, getting to use the best of digital and learning on the job, because so many people were at that point, how to use the tools. And it's sort of like, I feel like it's a bit like the transition we're going through now with the way people consume the media. In the mid nineties, it was the way we were creating the magazine was shifting to the digital world, but not exclusively. I mean, even today we still get the occasional painting, but now it's the way people are consuming the material is kind of in that same groundswell change. It's also interesting. I remember when we were doing graphs and data visualizations based on scientific papers back in the mid nineties and early two thousands, if you were lucky, you had maybe a jpeg of what they had output, and we were literally sometimes tracing bar charts in illustrator to style them for our purposes. So I don't say it proudly, but I used to trace graphs sometimes and style them with our magazines, fonts and that sort of thing, because that's pretty much how you had to do it, in an efficient and quick manner manner.",
      "id": "ep_52_ut_42"
    },
    {
      "end": 470018,
      "speaker": "Moritz Stefaner",
      "start": 463970,
      "text": "Because you had like an original graphic that you wanted to restart, but it was only available as an image.",
      "id": "ep_52_ut_43"
    },
    {
      "end": 508494,
      "speaker": "Jen Christiansen",
      "start": 470074,
      "text": "Right, right. And because we were working with peer reviewed material, you didn't want to redo the graphic necessarily in some cases. But now I feel like because you can exchange the information in so many different kinds of ways, it really opens up the options for how to present it. At the time, if you had two weeks to or less than that to produce a graphic and you just had an image of it, trying to get your hands on the raw data would just take so much time, it wouldn't really be worth it. So you just kind of work with what you have and style it for your own purposes.",
      "id": "ep_52_ut_44"
    },
    {
      "end": 519810,
      "speaker": "Moritz Stefaner",
      "start": 508542,
      "text": "Yeah. And what do you also say the style has changed? Like, have there been, like, are things becoming more data heavy now also in the illustrations or the visualizations you publish?",
      "id": "ep_52_ut_45"
    },
    {
      "end": 590610,
      "speaker": "Jen Christiansen",
      "start": 520230,
      "text": "Oh, definitely, yeah, yeah. Although when I look back at the scientific American archive in the fifties and sixties, there were some pretty data intensive pieces then, but they were directly based on what was coming out of the research scientist's lab. Now, when I was started at the magazine in the late nineties, we were doing a little bit more kind of simple bar charts, line graphs, that sort of thing. But now the expectation is so high for people to see kind of new and interesting formats and forms and are just more literate in reading graphics. So there's definitely a call for more of that. In fact, about five years ago, when we redesigned the magazine, we introduced a graphic science page, which is exclusively data visualization. It's not pinned to a larger article. And so it was kind of one of the ways we could create a channel that just produced that kind of work because people are so fascinated by it now.",
      "id": "ep_52_ut_46"
    },
    {
      "end": 599886,
      "speaker": "Enrico Bertini",
      "start": 591950,
      "text": "And you have a page, I think you sent me a page where you have lots of graphics coming from past editions. That's pretty cool.",
      "id": "ep_52_ut_47"
    },
    {
      "end": 682982,
      "speaker": "Jen Christiansen",
      "start": 600038,
      "text": "Oh, yeah. Everyone smile in presentations, and I sometimes turn those into blog posts. There's, I pull some samples from the past, and it's kind of fun to take a look with just the trends over time. In the 1920s, there were kind of these illustrated scaled objects as data visualizations. And people think of that as like, the. Right, yes. And it's nothing new. They were just done in graphite and beautiful illustrations. But that to really kind of austere and completely data driven, no extraneous marks, kind of in the fifties. And then when I was there later, when the web started kind of kicking in in the late nineties and early two thousands, the magazine sort of responded with, in the print magazine with three dimensional charts and drop shadows gradient, because, you know, you're competing with so many different avenues and outlets that there was a sense you needed to engage people, and that was kind of a new way to activate a page and engage people. But I think now we've kind of scaled back again and kind of gotten rid of things that distort the data but still have to work at engaging people.",
      "id": "ep_52_ut_48"
    },
    {
      "end": 704574,
      "speaker": "Enrico Bertini",
      "start": 683086,
      "text": "I think at the same point, once some technologies have been introduced, people felt free to use a lot of super colorful stuff as well. I think there is an interesting, I mean, an interesting pattern there that as technology changes, people have more freedom to do things in a certain way, and it's not necessarily better.",
      "id": "ep_52_ut_49"
    },
    {
      "end": 706090,
      "speaker": "Jen Christiansen",
      "start": 704662,
      "text": "Right, right.",
      "id": "ep_52_ut_50"
    },
    {
      "end": 738544,
      "speaker": "Enrico Bertini",
      "start": 707830,
      "text": "And at the same time, I have to say that there are so many, so many interesting, complex charts that come from the past that are really, really neat and clean, but also very sophisticated. I mean, if you look at examples coming even from the books of Tufte or if you look into Bertin as well, I mean, it's interesting to see how people have been inventing very complex but useful charts many, many years back, even before technology, the technology that we have today arrived. Right?",
      "id": "ep_52_ut_51"
    },
    {
      "end": 740140,
      "speaker": "Jen Christiansen",
      "start": 738672,
      "text": "Absolutely. Yeah.",
      "id": "ep_52_ut_52"
    },
    {
      "end": 749340,
      "speaker": "Enrico Bertini",
      "start": 741440,
      "text": "So can you tell us a little bit about how do you guys work at Scientific American. What is the process?",
      "id": "ep_52_ut_53"
    },
    {
      "end": 835008,
      "speaker": "Jen Christiansen",
      "start": 749800,
      "text": "Let's see. Well, we have about, I think about 13 text editors now that have beats. So they're subject matter specialists. So we have somebody who's usually working on the physics articles, someone on, let's see, medical and health, someone on evolution, et cetera. Our art department is divided into jobs that have media specialties. So I work on all of the information graphics. I sometimes tell people, anything with a label on it is something that I work on. The more kind of editorial and conceptual pieces are directed by another art director, who also then designs the page layout and that sort of thing. So I work within these kind of graphics frames. And so every month we have about seven feature articles in the print magazine. So we'll meet, we'll read the preliminary manuscripts. I should also mention that most of our authors, or a lot of our authors, are research scientists. So we have a person that's representing the work that they're doing and the work of their field. So we sort of have a direct line to the expert. And then when we are working with journalists, there are also people that are very well versed in the particular topic that they're writing about.",
      "id": "ep_52_ut_54"
    },
    {
      "end": 840232,
      "speaker": "Enrico Bertini",
      "start": 835104,
      "text": "So this means that some of your authors are the scientists talking about their own work?",
      "id": "ep_52_ut_55"
    },
    {
      "end": 850424,
      "speaker": "Jen Christiansen",
      "start": 840336,
      "text": "Absolutely. Okay. Yeah, yeah. So they're talking about their own work within the context of the field, but we're generally highlighting a lot of their findings as well.",
      "id": "ep_52_ut_56"
    },
    {
      "end": 851144,
      "speaker": "Enrico Bertini",
      "start": 850512,
      "text": "Sure.",
      "id": "ep_52_ut_57"
    },
    {
      "end": 942000,
      "speaker": "Jen Christiansen",
      "start": 851312,
      "text": "So we'll get a preliminary manuscript from these scientist authors and our journalist authors, and then meet with the text editor and sort of read through this unedited manuscript through the lens of what visuals would be helpful for this article. And I generally think about, when I'm trying to figure out if the article even needs an information graphic, I generally think about it through sort of four different lenses. One of them is, can an image tell the story more efficiently, effectively, or completely than words? So something like a Feynman diagram, where at a glance you can see particles coming in and colliding. And what particles result that might be more efficient to do in an image than in words? Another lens is, does the narrative involve kind of complex and intertwining relationships? So would an image map sort of help the reader, reader track those connections? So something like a photosynthesis diagram that you may probably have all seen it in our high school biology textbooks, where there's a lot of things kind of interacting with each other, and it's not terribly, it's not completely linear, but when you can kind of see them all at play, it's a little bit easier to track what's going on rather than reading a description of it. One of the.",
      "id": "ep_52_ut_58"
    },
    {
      "end": 944576,
      "speaker": "Enrico Bertini",
      "start": 942080,
      "text": "Because text is necessarily sequential. Right.",
      "id": "ep_52_ut_59"
    },
    {
      "end": 964608,
      "speaker": "Jen Christiansen",
      "start": 944688,
      "text": "And sometimes. Right, right. And also sometimes as you get partway through that explanation, you might need to be reminded at what triggered it or, you know, what is the input again. And you don't necessarily want to track back up in the text, but with an image, you can kind of flip back and forth between inputs and outputs and how they work together.",
      "id": "ep_52_ut_60"
    },
    {
      "end": 968184,
      "speaker": "Moritz Stefaner",
      "start": 964704,
      "text": "So the image becomes sort of the high level roadmap, more or less for.",
      "id": "ep_52_ut_61"
    },
    {
      "end": 968976,
      "speaker": "Jen Christiansen",
      "start": 968272,
      "text": "Exactly.",
      "id": "ep_52_ut_62"
    },
    {
      "end": 969840,
      "speaker": "Enrico Bertini",
      "start": 969088,
      "text": "It's an index.",
      "id": "ep_52_ut_63"
    },
    {
      "end": 1191900,
      "speaker": "Jen Christiansen",
      "start": 969920,
      "text": "Yeah, yeah. Sort of a visual cliff notes. And sometimes. Yeah. And then let's see. A third thing is, would the reader benefit from seeing and exploring the trends and patterns of the complete data set? So this is where it overlaps a lot with many of what your guests talk about in that, you know, in the text, they might highlight a number or two, or in a pull quote, they might highlight a few statistics, but that doesn't tell the whole story. So sometimes you really need to show the more kind of complex patterns behind those sort of figures that they pull out and highlight in the text, but could use some more context. And then I guess the fourth one would be, would a direct and immediate visual comparison be helpful? Sort of a before and after. So you can see a change very easily without even digesting it too much. For instance, what does this organ look like without cancer? And what does it look like with cancer? Or how does that impact the blood vessels and that sort of thing? So I'm generally looking, reading through a manuscript, just kind of wondering if anything that they're explaining in words lends itself to being presented for one of those reasons. And then we kind of stack all of these articles together and start to play around with, well, how many graphics do we have in the issue? Are there any big show pieces? Are we missing an opportunity for a data visualization where we can go find some information that the author maybe has left out and sort of broadened and provide a little bit more context for their particular story? Yeah. So that's sort of like the initial brainstorming and sort of start to start to create, like, thumbnail plan for the whole issue. And that's usually about eight weeks out from when we actually then ship things to the printer. So for the next few weeks, we're kind of just really starting to go back and forth with the author to see if what we think makes sense, makes sense from their point of view as well. Do we have the information in which to actually do that. Does a dataset exist? That sounds like it may exist, but we haven't seen it yet. Is it in a form that we can use it? That sort of thing? And then usually between six and four weeks out, we're starting to hire artists and data visualizers to sort of actually start developing concept sketches based on the reference material I assemble. And then we go through kind of a concept sketch tight, sketch final artwork sort of phase where we're sort of routing things internally so all of the editorial team can make sure that we're all kind of on the same page, and then sending it out to scientists to make sure we're ahead representing their information correctly. And then ultimately a fact check once things have kind of finalized and then off to the printer. And then we're sometimes, then we need, well, more than sometimes. We're then reworking things for the iPad and occasionally reworking it for the web as well. Yeah.",
      "id": "ep_52_ut_64"
    },
    {
      "end": 1212700,
      "speaker": "Moritz Stefaner",
      "start": 1193320,
      "text": "Sorry. How linear is this process? So it sounds very, like, straightforward now that you say it. But how often do you have to go back and sort of redo one of the steps from before? Or does sometimes maybe a great graphic change the article? Or, you know, like, how is it as streamlined as you say now? Or are they often surprises as well?",
      "id": "ep_52_ut_65"
    },
    {
      "end": 1260200,
      "speaker": "Jen Christiansen",
      "start": 1212740,
      "text": "There's often surprises, yeah. Yeah. Often you'll make the assumption that, oh, there must be some data. There's data that supports this in a form that we can use, and we'll make a great graphic. I can picture it in my mind's eye. And then you discover that, well, actually, that comes from several different papers. They might need to retool the text to help make that clear. It doesn't really lend itself to being able to be pooled together and displayed in one graphic, and yet displaying it in many different, in lots of different chunks doesn't make sense for the reader. And so there's definitely surprises along the way.",
      "id": "ep_52_ut_66"
    },
    {
      "end": 1281824,
      "speaker": "Moritz Stefaner",
      "start": 1260740,
      "text": "Is it often that the scientists also would correct and say, like, yeah, you can't really put it that way or that's oversimplified. I mean, I know when I work with scientists, that's often the concern they have is that they feel they should add, like, five different asterisks with disclaimers. You know, why it's not really. But more specifically.",
      "id": "ep_52_ut_67"
    },
    {
      "end": 1282192,
      "speaker": "Jen Christiansen",
      "start": 1281872,
      "text": "Yeah.",
      "id": "ep_52_ut_68"
    },
    {
      "end": 1287256,
      "speaker": "Moritz Stefaner",
      "start": 1282256,
      "text": "And just this sort of fear of that people might over generalize your findings.",
      "id": "ep_52_ut_69"
    },
    {
      "end": 1314244,
      "speaker": "Jen Christiansen",
      "start": 1287408,
      "text": "Absolutely. Yeah. A lot of folks are worried that we're oversimplifying in our effort, just to clarify. But once we say, well, we actually, we can't use the jargon even though, and I think we need to strip jargon out as far as labels go and visual jargon, because a lot of these scientists are used to certain icons that mean something very specific to them.",
      "id": "ep_52_ut_70"
    },
    {
      "end": 1318188,
      "speaker": "Moritz Stefaner",
      "start": 1314292,
      "text": "Or plot types also that. Right, just neuroscientists do.",
      "id": "ep_52_ut_71"
    },
    {
      "end": 1385790,
      "speaker": "Jen Christiansen",
      "start": 1318364,
      "text": "Exactly. So once we explain that we can't use that word or we can't use that icon, because even though it means something very specific, the audience isn't going to know what, you know, that specific meaning, but that we're not trying to oversimplify, we're just trying to clarify. And can they help us do that? Sometimes that means we're adding footnotes to data visualizations, other times it means the intro caption sort of rounds out a little bit more to kind of indicate that, that there's some caveats at play. But generally, when a scientist understands that we're creating a visualization for a larger audience, our readers tend to be science savvy, but they're not specialists necessarily. We're thinking of doing what. If a biologist wants to read an article on quantum physics, can we help make it clear enough for them? Yeah, yeah, but that's true.",
      "id": "ep_52_ut_72"
    },
    {
      "end": 1395878,
      "speaker": "Moritz Stefaner",
      "start": 1385830,
      "text": "It's so scientific American has a certain style already, and you can sort of, people know that probably as well, like scientists, so they sort of know the level at which you will treat something, right?",
      "id": "ep_52_ut_73"
    },
    {
      "end": 1398410,
      "speaker": "Jen Christiansen",
      "start": 1396014,
      "text": "I think so, yeah, yeah, yeah.",
      "id": "ep_52_ut_74"
    },
    {
      "end": 1402350,
      "speaker": "Moritz Stefaner",
      "start": 1398710,
      "text": "Sorry Enrico, we cut. Keep cutting you off.",
      "id": "ep_52_ut_75"
    },
    {
      "end": 1407502,
      "speaker": "Enrico Bertini",
      "start": 1402470,
      "text": "Yes. I don't know what is happening. Keep going, keep going.",
      "id": "ep_52_ut_76"
    },
    {
      "end": 1408810,
      "speaker": "Moritz Stefaner",
      "start": 1407566,
      "text": "No, you go ahead.",
      "id": "ep_52_ut_77"
    },
    {
      "end": 1467940,
      "speaker": "Enrico Bertini",
      "start": 1409870,
      "text": "I don't remember. Of course, I'm sure it was good. No, I wanted to ask you, I guess sometimes the scientists already come to you with some of the existing charts that they have, I don't know, in their papers or just out of their analysis. Yes, and I mean, in my experience, I've been working a little bit on the visual presentation side of things with scientists. And what is really interesting, at least from my experience, is that there are many scientists out there who have a very hard time thinking what is the, I mean, drawing a very strong line between visualization or charts or representation for analysis, and then using changing these charts in a way that they are much more easier to understand when they are used for presentation. Right. I'm wondering if you notice exactly the same thing in your case, because I noticed this thing many, many times.",
      "id": "ep_52_ut_78"
    },
    {
      "end": 1608670,
      "speaker": "Jen Christiansen",
      "start": 1468530,
      "text": "Often the scientists will send us visual material with their preliminary manuscript at our request. So they'll send in what they think might be useful for us or to use as an illustration or data visualization with their article, they'll often send in PowerPoint presentations so things where they're already kind of communicating it to an audience, but it tends to be an audience of their peers. So there's still a lot of jargon and that sort of thing involved. What I find more useful is I generally then go and do searches for their research papers that are connected to the topic that we're writing about and see what visualizations they have done during their analysis stage or to communicate in their scientific papers, because that's when you see kind of a more kind of a naked look at the data in some ways, a little bit. That's where I'll see a visualization that looks like there's a really interesting punchline or data set involved, but could really benefit from a makeover. And that's the sort of thing like Moritz a few years back now did a data visualization for us on bees, and that wasn't connected to a larger article, but it was going through some research for a different piece on bees and came across this really neat punchline and this clearly very rich data set, but with a huge opportunity to present it in a different way because it was really difficult to interpret in the way it was visualized in the original paper, at least for a broader audience, it probably was useful for communicating within their lab and with other folks in their field. But it's kind of fun to run across these pieces that you're sort of like just itching to get my hands on that data set. So we can sort of try some different things with this because there's a really interesting punchline and I can kind of see some interesting patterns here. But let's see if we can blow that out and really make, make it obvious.",
      "id": "ep_52_ut_79"
    },
    {
      "end": 1614146,
      "speaker": "Enrico Bertini",
      "start": 1609330,
      "text": "So do they ever discover something new once you redesign their visualizations?",
      "id": "ep_52_ut_80"
    },
    {
      "end": 1615874,
      "speaker": "Jen Christiansen",
      "start": 1614338,
      "text": "That's an interesting question.",
      "id": "ep_52_ut_81"
    },
    {
      "end": 1616910,
      "speaker": "Enrico Bertini",
      "start": 1616002,
      "text": "I don't know.",
      "id": "ep_52_ut_82"
    },
    {
      "end": 1645340,
      "speaker": "Jen Christiansen",
      "start": 1618490,
      "text": "I haven't really run into that with a data visualization, although some have been very excited about the results. There's one that's coming out, gosh, I think it's in April, so I don't think I can talk about it too specifically yet. But it's always fun when the scientist comes back to you and says, oh, you did it in a way that's better than our original. Can I use that for my presentations? Can I?",
      "id": "ep_52_ut_83"
    },
    {
      "end": 1648424,
      "speaker": "Moritz Stefaner",
      "start": 1647160,
      "text": "Then, you know it works.",
      "id": "ep_52_ut_84"
    },
    {
      "end": 1692480,
      "speaker": "Jen Christiansen",
      "start": 1648512,
      "text": "Yeah, that's really rewarding. It happens a little bit more often, or it has happened more often with illustrations. So if we're doing like a dinosaur reconstruction or a scene and you ask them, oh, by the way, you know, are we depicting the, you know, the tail correctly here? They're like, well, that's a good question. We really don't know what that looks like, so, or, or, gosh, we haven't thought about that piece. Not necessarily with a dinosaur reconstruction, but when we're trying to put everything in context, gosh, we haven't thought about that piece of it. We're going to have to think on that some more and maybe that'll help guide research in the future.",
      "id": "ep_52_ut_85"
    },
    {
      "end": 1761470,
      "speaker": "Moritz Stefaner",
      "start": 1693020,
      "text": "So that's a great time to briefly talk about our sponsor. Data stories is supported by Tableau software, helping people see and understand their data. Tableau lets people connect to any kind of data and visualize it on the fly. Databases, spreadsheets and even big data sources are easily combined into interactive visualizations, reports and dashboards. As you know, I use it quite a bit as well for exploring datasets, especially early in the project when you want to get an overview and communicating already the key insights, maybe gaps in the data or the big patterns together with your clients and experimenting visually. And it's a great tool. I'm much looking forward to the new version. So Tableau nine is in beta already. There's big improvements coming along, both in respect to performance, new features, mobile support and so on. So I'm really looking forward to that. But what is your data trying to tell you for your free trial, visit Tableau software@Tableau.com Datastories that's Tableau.com Datastories. And now back to the show.",
      "id": "ep_52_ut_86"
    },
    {
      "end": 1797516,
      "speaker": "Enrico Bertini",
      "start": 1761970,
      "text": "So in terms of I'm curious to hear how much you know about the visual literacy of your readers and whether you are, of course, you are taking this into consideration when you design a new graphics, I guess, right? But so how does, I think these are two questions at the same time. One is how much you know about how easy it is for your average reader to read a chart. And second, how does this influence your design?",
      "id": "ep_52_ut_87"
    },
    {
      "end": 1876282,
      "speaker": "Jen Christiansen",
      "start": 1797668,
      "text": "Sure, that's a good question, too. We get a lot of feedback from readers in terms of letters and emails and that sort of thing. So we generally know if something did not work at all or if something worked really well. But the middle zone is much harder to figure out, and I know that online we're working towards being able to analyze that more through analytics and things, but we just don't have enough data on that collected yet, particularly since a lot of the information graphics are behind a paywall online. I mean, we're doing more and more for the web and hopefully that'll become easier and easier for people to, for more people to access. But right now we don't have a whole lot of data, so it's a little hard to say for sure, even when it comes to things like interactives. Like, we know how many people have gone to visit a particular page. But, you know, for instance, Ian Willem Tulp did a flavor network interactive for us based on the research of. Oh, I want to get his name right here. Sebastian Anart. And goodness, Sebastian.",
      "id": "ep_52_ut_88"
    },
    {
      "end": 1878330,
      "speaker": "Moritz Stefaner",
      "start": 1876306,
      "text": "Wasn't it Laszlo Barabashi as well?",
      "id": "ep_52_ut_89"
    },
    {
      "end": 1893522,
      "speaker": "Jen Christiansen",
      "start": 1878490,
      "text": "It was by yy young Yul an. Sebastian Anart and James Bagro. Yes. And Albert Babarasi did a study in 2011 on flavor compounds and how they.",
      "id": "ep_52_ut_90"
    },
    {
      "end": 1897146,
      "speaker": "Moritz Stefaner",
      "start": 1893586,
      "text": "Great study, great visualizations for Jan. Really nice.",
      "id": "ep_52_ut_91"
    },
    {
      "end": 1956060,
      "speaker": "Jen Christiansen",
      "start": 1897258,
      "text": "So that was a redo of one of their visualizations in an interactive form. And Jan Wilhelm kind of brought a different look at the whole thing, and it was quite popular based on how many people saw it online and pick up from other venues and that sort of thing. But when I compare the click through numbers and things on that to some of our other interactives, it's a little hard to tell if it's because of the topic. I mean, food, everybody can relate to that. And there's things like labels that are like beer and cheese on here, so people will spend time with it. So if I had more than one version of this, then maybe we could start to compare. But it's kind of hard to tell if it's the topic that's leading the interest, the timing or the interactive itself in terms of really getting a lot out of that data.",
      "id": "ep_52_ut_92"
    },
    {
      "end": 1967096,
      "speaker": "Enrico Bertini",
      "start": 1956480,
      "text": "There might actually be also some sort of coolness factor there because people like this kind of interesting networks with bubbles and. I don't know.",
      "id": "ep_52_ut_93"
    },
    {
      "end": 1967824,
      "speaker": "Jen Christiansen",
      "start": 1967248,
      "text": "Right.",
      "id": "ep_52_ut_94"
    },
    {
      "end": 1970190,
      "speaker": "Enrico Bertini",
      "start": 1967952,
      "text": "It's attractive. It's very attractive.",
      "id": "ep_52_ut_95"
    },
    {
      "end": 1979150,
      "speaker": "Jen Christiansen",
      "start": 1970320,
      "text": "And to the credit of the scientists that did the original study, their piece was quite popular a few years ago as well. So. Yeah, so there's something that resonates. It's a great study anyway.",
      "id": "ep_52_ut_96"
    },
    {
      "end": 1999148,
      "speaker": "Moritz Stefaner",
      "start": 1981170,
      "text": "Yeah, but that's exactly like this. It's also mixed up, as you say, like the content, the way it's promoted. All kinds of highly nonlinear things can happen there. And in the end you just get the aggregate effect. It's like, oh, lots of traffic, but it's hard to isolate the factors and.",
      "id": "ep_52_ut_97"
    },
    {
      "end": 2005332,
      "speaker": "Jen Christiansen",
      "start": 1999164,
      "text": "We haven't produced enough of them to really kind of be able to sort that out.",
      "id": "ep_52_ut_98"
    },
    {
      "end": 2017532,
      "speaker": "Enrico Bertini",
      "start": 2005436,
      "text": "Yeah, but do you ever come to the point of, I don't know, during the design, you think about a certain solution and then you discard it because you think even if it's effective, it's too complex for your readers.",
      "id": "ep_52_ut_99"
    },
    {
      "end": 2045344,
      "speaker": "Jen Christiansen",
      "start": 2017676,
      "text": "Yes. Although you also have some interesting readers, and our readers online and in print are a little bit different. And so some folks who read our magazine really delight in things that completely like our mind benders and require a lot of thought and intellect and time. So we want to honor those readers. I mean, these are sort of maybe like a crossword. You know, it's something they really want.",
      "id": "ep_52_ut_100"
    },
    {
      "end": 2047208,
      "speaker": "Moritz Stefaner",
      "start": 2045392,
      "text": "To dive in, need to figure this out.",
      "id": "ep_52_ut_101"
    },
    {
      "end": 2076912,
      "speaker": "Jen Christiansen",
      "start": 2047304,
      "text": "Yeah. And they don't want you to edit things out. They want it to be as complex as it really is interesting. So you do want to honor that on some level. So the trick then becomes, as with lots of folks, is, do you leave that richness in but make some things pop so that a more casual reader can also get something out of it, where you're leaving the richness in there for somebody who really knows a little more about the topic and really just wants to get. Get their hands dirty.",
      "id": "ep_52_ut_102"
    },
    {
      "end": 2136490,
      "speaker": "Enrico Bertini",
      "start": 2077056,
      "text": "Yeah. You know, there is a personal trait in psychology that is called need for cognition. I don't know if you've ever heard of that. There is actually a standard scale to measure that. We've been using it for. For a couple of studies. And it's really interesting because it looks like there are. You can actually measure on a broad spectrum, there are people who are interested in. They have this natural tendency to being in need of explanations, so they are not satisfied with facts. They want to really understand how things work. Right. And at the other end of the spectrum, there are people who just get everything as. As it is. Right. As a black box. No need to look inside. And I don't know. I find this very interesting and fascinating, and there is a lot of research on whether this can be changed or nothing. So I guess scientific American has a lot of. Probably you have a highly skewed kind of population of readers.",
      "id": "ep_52_ut_103"
    },
    {
      "end": 2159026,
      "speaker": "Moritz Stefaner",
      "start": 2137510,
      "text": "Yeah. I mean, how do you do it? Would you try and make the graphic, deliver something for everybody, like, have simple, high level insights but also some depth to it? Or do you sometimes just say, yeah, well, this one is. That's for the puzzlers, and the other one is more for the at a glance people. Do you take this into account or a bit?",
      "id": "ep_52_ut_104"
    },
    {
      "end": 2189400,
      "speaker": "Jen Christiansen",
      "start": 2159058,
      "text": "I mean, we always strive to make sure that a casual reader can get something out of it as well. So the decision then becomes how much richness to leave behind it. How far do we want people to puzzle to get to the nth degree out of it? But the goal is, yes, for a cold reader at the office or outside, can they understand the main points of it? Definitely.",
      "id": "ep_52_ut_105"
    },
    {
      "end": 2219400,
      "speaker": "Moritz Stefaner",
      "start": 2190820,
      "text": "And you mentioned before that digital is sort of becoming more important, obviously, iPad version, mobile interactives. How are things for a scientific American? Do you see it transitions fully to being a digital magazine, or do you think the print product will, or the static document will always be the primary product and these things are more satellite activities. What's your current take on that?",
      "id": "ep_52_ut_106"
    },
    {
      "end": 2237880,
      "speaker": "Jen Christiansen",
      "start": 2219480,
      "text": "Well, that's a good question. We definitely need to move forward and do more on the web, and we're kind of upward and onward there. But I should also mention that Scientific American is the oldest continuously printed magazine in the United States.",
      "id": "ep_52_ut_107"
    },
    {
      "end": 2239888,
      "speaker": "Moritz Stefaner",
      "start": 2238000,
      "text": "Wow, look at that.",
      "id": "ep_52_ut_108"
    },
    {
      "end": 2268320,
      "speaker": "Jen Christiansen",
      "start": 2240064,
      "text": "I don't think anybody wants to be on staff when and if they ever decide to stop printing the magazine. Legacy, you can't get back. So there's definitely this legacy and this, there's something about that print version. So I seriously doubt that will go away, but that doesn't mean we can't, we shouldn't be putting more energy and time and thought into what's available online as well.",
      "id": "ep_52_ut_109"
    },
    {
      "end": 2277380,
      "speaker": "Moritz Stefaner",
      "start": 2269620,
      "text": "And what do you, I mean, currently you say you do sometimes extension of the print graphic as interactive, right?",
      "id": "ep_52_ut_110"
    },
    {
      "end": 2278392,
      "speaker": "Jen Christiansen",
      "start": 2277720,
      "text": "Right.",
      "id": "ep_52_ut_111"
    },
    {
      "end": 2283740,
      "speaker": "Moritz Stefaner",
      "start": 2278536,
      "text": "Would you also sometimes do something just interactive or do it the other way around or.",
      "id": "ep_52_ut_112"
    },
    {
      "end": 2344210,
      "speaker": "Jen Christiansen",
      "start": 2284920,
      "text": "Yeah. Now, just because of trying to make the best use of resources, if a lot of our interactives spin out of print projects. But I think in the future, you know, print, web, it's going to be less of a distinction. It's just a matter of are we doing static? Are we doing interactive? They'll probably, you know, whatever, whatever projects make sense to put our time and energy into. If two pieces make sense out of that, print and interactive, great. It's just kind of allocating resources, you know, time, staff, money, that sort of thing. And does it make sense in some cases? You know, not everything makes sense as an interactive, so it's not worth putting the money into that. And other times, maybe we want to just explore an interactive and not do a print piece. So that's kind of all evolving now.",
      "id": "ep_52_ut_113"
    },
    {
      "end": 2373230,
      "speaker": "Moritz Stefaner",
      "start": 2346070,
      "text": "Yeah. We had Scott Klein on the show as well recently, and I thought it was very fascinating to discuss with him as well on how an app can be also a journalistic product, sort of, although it's something that is not finished at any point and is maybe more a provision of a dataset or something. I was just wondering if there's something like this in the science world, if Scientific American could also be a host for scientific data in some form that is continuously updated or something like this.",
      "id": "ep_52_ut_114"
    },
    {
      "end": 2400880,
      "speaker": "Jen Christiansen",
      "start": 2373810,
      "text": "Right. Well, we kind of have experimented with different things as part of offshoots of the whole brand, and I'm sure we'll continue to do that. There was an exoplanet app a few years back that has some neat tools that allow a reader to kind of change the parameters of where the planet is in connection to the sun and that's its host star and that sort of thing. So I'm sure we'll experiment with that some more in the future as well.",
      "id": "ep_52_ut_115"
    },
    {
      "end": 2417808,
      "speaker": "Enrico Bertini",
      "start": 2400960,
      "text": "Yeah, yeah. And I also wanted to ask you about, of course, I mean, being a magazine, you, other than having to create informative and correct charts, you also want to make sure that they are engaging, that people feel attracted, I guess.",
      "id": "ep_52_ut_116"
    },
    {
      "end": 2418820,
      "speaker": "Jen Christiansen",
      "start": 2417864,
      "text": "Right, right.",
      "id": "ep_52_ut_117"
    },
    {
      "end": 2423090,
      "speaker": "Enrico Bertini",
      "start": 2419560,
      "text": "I. So I'm sure this plays a role in the whole process.",
      "id": "ep_52_ut_118"
    },
    {
      "end": 2606080,
      "speaker": "Jen Christiansen",
      "start": 2423430,
      "text": "Yeah, definitely. And actually, a couple years ago I gave a talk at a communicating complexity conference in Alghero. And that was kind of the whole crux of the talk was how do you engage people in a graphic that is portraying some pretty, either complex or abstract content? A lot of our quantum articles and that sort of thing make something relatable so that people can feel like they want to jump into the graphic and give it some time. Most of my examples on that are actually illustrative, but I was talking with Santiago Ortiz. Ortiz, yes. And he was wondering about how does that relate to some of the data visualizations? And it was funny because as I was thinking about it, like the flavor network that yavin alum Tulp did for us, and there was a gender gap interactive that periscopic did for us recently. And those aren't kind of, they don't have a veneer or we didn't really add in illustrative details or anything to help engage the reader. And part because I think the topics are so intuitive and inclusive. You know, food, everyone can relate to that. You know, you see a few labels that are a few different food items. Okay, you get it. You can start to jump in and you're okay with maybe really kind of learning about a new graphic form and trying to understand that because the subject matter behind it is so intuitive and familiar with a gender gap graphic. Okay. People understand the concept of, you know, PhDs and they're looking at countries and male and female, and these are all topics that are familiar. So it's things like when you get down to just using like species names for labels and things where you might need a few other cues, like with the b graphic that Moritz did for us. We included some small bee illustrations to help somebody who's just flipping through the magazine, look at that page and say, oh, this is about bees, and just that half a second. And then, okay, I can get this, and then dive in and really want to spend some more time with it. We did a similar thing with a graphic science on. On the genome of different primates. So what really makes a chimp different than a human? Martin Krasinsk. I always get his name wrong. Martin Krasinski. There we go. Did this great series of Hilbert curves for us.",
      "id": "ep_52_ut_119"
    },
    {
      "end": 2609944,
      "speaker": "Enrico Bertini",
      "start": 2606120,
      "text": "Oh, I saw that one. I love it. Yeah, I love the Hilbert curves.",
      "id": "ep_52_ut_120"
    },
    {
      "end": 2643600,
      "speaker": "Jen Christiansen",
      "start": 2610072,
      "text": "Yeah, well, it's an abstract form. A lot of people aren't terribly familiar with them. So again, there we thought, well, let's just add some spot illustrations of a chimp, a human, and a few others just to help give that half a second. For somebody to say, some of this is very unfamiliar to me, but those things are familiar. Let me now try to jump in. And I think maybe with the food and the gender graphic, those words were very familiar. So that was enough to get somebody to jump in, perhaps.",
      "id": "ep_52_ut_121"
    },
    {
      "end": 2655850,
      "speaker": "Enrico Bertini",
      "start": 2645270,
      "text": "So do you think interaction plays a role there? Do you think that people will actually be more engaged on interactive pieces or maybe even less engaged they may actually be scared of?",
      "id": "ep_52_ut_122"
    },
    {
      "end": 2705646,
      "speaker": "Jen Christiansen",
      "start": 2656790,
      "text": "That's a good question. I think, you know, I haven't done enough of them to really kind of get a sense of how long people are really spending with these. But clearly that food one hit a nerve. And I think it's because you could relate to almost every single category in there directly, like, you have eaten these foods. It's not even just something that you're aware of. And it was kind of a tool that you could use and experiment with. So I think that does help. But we generally do need to kind of set it up with a, here's what kind of our punchline is, or here are a few things that we found interesting about this, but feel free to jump in and explore and find more patterns.",
      "id": "ep_52_ut_123"
    },
    {
      "end": 2726610,
      "speaker": "Enrico Bertini",
      "start": 2705718,
      "text": "Okay. And so I wanted to change topic a little bit. And, I mean, our listeners are very often curious about how do you become visualization designer? So I'm wondering if you can give some tips to people that want to become graphic designers, maybe doing something similar to what you do or people in your team do?",
      "id": "ep_52_ut_124"
    },
    {
      "end": 2746974,
      "speaker": "Jen Christiansen",
      "start": 2727310,
      "text": "Sure. It's interesting because I actually, you know, I do some data visualization, and I am probably considered also a graphic designer, but I'm more of an art director, so I'm generally trying to find other artists to work with. So I can tell you a little bit about what I look for when I look at.",
      "id": "ep_52_ut_125"
    },
    {
      "end": 2748582,
      "speaker": "Enrico Bertini",
      "start": 2746982,
      "text": "What do you look for? Yeah, perfect.",
      "id": "ep_52_ut_126"
    },
    {
      "end": 2839970,
      "speaker": "Jen Christiansen",
      "start": 2748646,
      "text": "Yeah, I love that because we do have a, of this print product that's a big part of who we are and the web side, I look for data visualizers who can kind of translate what might be done on the web into a form that makes sense in print as well, and really craft things like label position and all of that. Because I think a lot of folks who are doing mostly web data visualizations that are designed for the web, there's different parameters, there's different things that you have to consider, whereas in print, just kind of the exact position of labels, the kind of resolution you're dealing with, being able to provide a file that can be editable for color and that sort of thing. So I look for a certain level of craft and color choice and just sort of this sense of being able to work within the page in kind of a beautiful way. So I don't think I'm articulating this very well, but someone who can produce web interactives but also be able to, to then pull that out and restyle it in a way that makes sense in print.",
      "id": "ep_52_ut_127"
    },
    {
      "end": 2843150,
      "speaker": "Enrico Bertini",
      "start": 2840090,
      "text": "So if I want to be discovered by you, what should I do?",
      "id": "ep_52_ut_128"
    },
    {
      "end": 2845042,
      "speaker": "Jen Christiansen",
      "start": 2844410,
      "text": "Send me an email.",
      "id": "ep_52_ut_129"
    },
    {
      "end": 2848030,
      "speaker": "Moritz Stefaner",
      "start": 2845066,
      "text": "It's already happening. It's already happening.",
      "id": "ep_52_ut_130"
    },
    {
      "end": 2900812,
      "speaker": "Jen Christiansen",
      "start": 2848570,
      "text": "Actually, I get emails from artists and I look at every one of them and I file portfolio URL's. But generally I also look for folks who are very comfortable with scientific topics. That's pretty key because in some cases, I'll be putting them in direct contact with a research scientist, and I want to know that they can communicate effectively with the scientists. And also in some cases, if the data set itself is highly specialized, like genome data, I'll go with somebody like Martin who is very familiar with how that data is stored and what it means and all of that.",
      "id": "ep_52_ut_131"
    },
    {
      "end": 2906604,
      "speaker": "Enrico Bertini",
      "start": 2900956,
      "text": "So it's not just the craft, but also being able to relate to other people in a certain way.",
      "id": "ep_52_ut_132"
    },
    {
      "end": 2909316,
      "speaker": "Jen Christiansen",
      "start": 2906652,
      "text": "Right, right. No. And a comfort level.",
      "id": "ep_52_ut_133"
    },
    {
      "end": 2912532,
      "speaker": "Enrico Bertini",
      "start": 2909388,
      "text": "I totally understand that. I mean, it's very, very important.",
      "id": "ep_52_ut_134"
    },
    {
      "end": 2913948,
      "speaker": "Jen Christiansen",
      "start": 2912716,
      "text": "Yeah, yeah, yeah.",
      "id": "ep_52_ut_135"
    },
    {
      "end": 2935160,
      "speaker": "Moritz Stefaner",
      "start": 2913964,
      "text": "But there you see all these things that need to come together. Right. It's like the understanding the science, talking to the people, like getting the gist out of the scientists as well, doing interactive print, maybe text as well. And so all in four weeks, right? Yeah. So it's a fairly narrow profile, right?",
      "id": "ep_52_ut_136"
    },
    {
      "end": 2945162,
      "speaker": "Enrico Bertini",
      "start": 2935700,
      "text": "Well, it depends. So most of the people who work with you are graphic designers. What kind of backgrounds do they have?",
      "id": "ep_52_ut_137"
    },
    {
      "end": 3001640,
      "speaker": "Jen Christiansen",
      "start": 2945196,
      "text": "Have, oh, let's see. Gosh, I think a lot of the data visualizers I'm working with now do have a science background, interestingly enough. Like, I don't know, physics, astronomy, astronomy, genetics. I think those two fields in particular, there's, you know, once you know, a certain set of definitions and abbreviations, it can help quite a lot of, and just folks who can then also read the primary research. That's hugely helpful. But then also I work with a lot of illustrators as well, and those tend to be folks who do have a specialty in the sciences at some level, whether they've just been, they do a lot of scientific illustration or if they actually have a formal background in it.",
      "id": "ep_52_ut_138"
    },
    {
      "end": 3008740,
      "speaker": "Moritz Stefaner",
      "start": 3003360,
      "text": "More often scientists who somehow discovered their artistic side, or is it more often artists who discovered their.",
      "id": "ep_52_ut_139"
    },
    {
      "end": 3017424,
      "speaker": "Jen Christiansen",
      "start": 3010320,
      "text": "Good question. I'll have to ask. I'll have to conduct a survey.",
      "id": "ep_52_ut_140"
    },
    {
      "end": 3026216,
      "speaker": "Moritz Stefaner",
      "start": 3017512,
      "text": "Yeah, that would be interesting. I mean, the order of events is often not so important, but it's sort of interesting because you can imprint both ways.",
      "id": "ep_52_ut_141"
    },
    {
      "end": 3043028,
      "speaker": "Enrico Bertini",
      "start": 3026248,
      "text": "It's true that great scientists are characterized by, they know very well how to communicate their science. Right. If you look at, I don't know, Feynman. Yeah, fine, man. Yeah, exactly.",
      "id": "ep_52_ut_142"
    },
    {
      "end": 3048788,
      "speaker": "Moritz Stefaner",
      "start": 3043164,
      "text": "But not all of them, right? All great scientists are great at communications. I don't think so. I think.",
      "id": "ep_52_ut_143"
    },
    {
      "end": 3053164,
      "speaker": "Enrico Bertini",
      "start": 3048884,
      "text": "No, no, I don't think so too. But, yeah, yeah, some of them are.",
      "id": "ep_52_ut_144"
    },
    {
      "end": 3057394,
      "speaker": "Moritz Stefaner",
      "start": 3053212,
      "text": "But it's always the greatest thing if it comes together. So. Yeah. Yeah, absolutely.",
      "id": "ep_52_ut_145"
    },
    {
      "end": 3087838,
      "speaker": "Jen Christiansen",
      "start": 3057572,
      "text": "One of the, one of my favorite things I received in an email once was from a scientist who studies gamma rays and lightning, and he drew us a diagram with pen and ink and either colored pencils or crayons, I'm not quite sure. This beautiful cartoon specifically for us, and it was just stunning and perfect. We had somebody else redraw it in a different style, but all of the content was there. It was pretty amazing.",
      "id": "ep_52_ut_146"
    },
    {
      "end": 3088810,
      "speaker": "Moritz Stefaner",
      "start": 3088014,
      "text": "Cool.",
      "id": "ep_52_ut_147"
    },
    {
      "end": 3093926,
      "speaker": "Enrico Bertini",
      "start": 3090270,
      "text": "And I guess by now, you know, a lot of science for a very.",
      "id": "ep_52_ut_148"
    },
    {
      "end": 3102690,
      "speaker": "Jen Christiansen",
      "start": 3093958,
      "text": "Short period of time, stuff as much in my head as I can for four to eight weeks, and then it's on to the next, the next topic.",
      "id": "ep_52_ut_149"
    },
    {
      "end": 3138200,
      "speaker": "Enrico Bertini",
      "start": 3103030,
      "text": "Yeah. So I think I want to talk about a little bit about these trends. And I, I don't know. I'm curious to hear your opinion about what is happening in the field, what has happened recently since you've been working in this area for a few years now. So not only what has changed in these last few years, but also what you think is going to happen in the future. I know it's very hard to talk about the future, but just I'm curious to hear about what you think are the main trends out there.",
      "id": "ep_52_ut_150"
    },
    {
      "end": 3145080,
      "speaker": "Jen Christiansen",
      "start": 3138700,
      "text": "Well, I'm excited to see what happens as scientists become more and more savvy with data visualization.",
      "id": "ep_52_ut_151"
    },
    {
      "end": 3146024,
      "speaker": "Enrico Bertini",
      "start": 3145400,
      "text": "Oh, yeah.",
      "id": "ep_52_ut_152"
    },
    {
      "end": 3307040,
      "speaker": "Jen Christiansen",
      "start": 3146112,
      "text": "In a broader sense, I feel like a lot of scientists have a very good handle on data visualization within a certain canon for their particular field. So there's this been, you know, and I'm presuming some of this, but it seems like there are a set of tools that is, you know, that are very well used in a particular field, and people have been using them for a long time. So you see the same kinds of visualizations coming out in their journal articles. I'm really excited to see as more and more of these tools and just coding, so doing some custom work, how that will kind of make visualizations from the analysis and communication state really change. And one thing that actually got me thinking about this, too, is recently and seems like an aside, but I promise it'll come back around. Recently I talked with, well, I was kind of obsessed with the stacked plot chart on the COVID of Joy Division's Unknown Pleasures album as a pulsar visualization, and I really wanted to know the origin of it in terms of who created it and why. So I eventually tracked down Hal Kraft, who is the, he created it as a scientist for the purpose of analysis. That chart was to help him answer some questions. It wasn't to communicate that science more broadly. It was a tool to help him look for patterns, and yet it has captured the imagination of people who don't even know what it shows. So I'm kind of fascinated by these visualizations that were tools for analysis with no intent for it being a broadly, like a way to communicate their findings. So they haven't even really kind of analyzed the findings yet. This is part of their process. I'm really fascinated by pieces like that that then serve to communicate in such kind of An Elegant and efficient way. So I'm wondering if we're going to get more and more of that sort of thing, because that piece actually HAL KRaft, he developed, he programmed that out. Like that was something that he needed to sit there, he said, with Fortran, and wrote it, wrote the program to create that. And so as more and more scientists might be dealing with writing programs for visualizations that are a little bit more customized and not just using existing templates and that sort of thing, I think it'll be really interesting to see how many of those kind of transcend and then become great tools for communication as well.",
      "id": "ep_52_ut_153"
    },
    {
      "end": 3340340,
      "speaker": "Moritz Stefaner",
      "start": 3308340,
      "text": "And I can also see lots more scientists picking up D3 and processing. These are the two things especially like PhD students, they tend to discover somehow on the web. And then you're absolutely right when they use that to develop their own exploratory tools, we have suddenly much richer landscape. Right. Because I mean, right now it is really in each field, as you said, always dominated by Matlab or the tool of choice in a certain field and also limits the vocabulary by a great deal.",
      "id": "ep_52_ut_154"
    },
    {
      "end": 3360700,
      "speaker": "Jen Christiansen",
      "start": 3341000,
      "text": "And as folks are developing custom visualizations for analysis, it might not be too many more steps out from that that they then kind of modify it for communication so they have a little more control over it. Then I think it'll be really interesting to see what's coming out of the journal articles moving forward.",
      "id": "ep_52_ut_155"
    },
    {
      "end": 3387770,
      "speaker": "Moritz Stefaner",
      "start": 3362360,
      "text": "Yeah. And at the same time, many teams also realize if they want to get to the COVID of magazine x, you know, with their research, which obviously everybody wants. Yeah. They will need a striking image that is unique and is a good icon for what they do. You know, it doesn't need to tell all this the big story necessarily, but just also sometimes just be a good representation of this bigger activity they have. Right.",
      "id": "ep_52_ut_156"
    },
    {
      "end": 3427558,
      "speaker": "Enrico Bertini",
      "start": 3388350,
      "text": "Yeah. And I think that's a huge trend in science in general. I think, I mean I'm not that old, but I guess scientists now face crazy competition. Right. And if you don't exist somewhere, I mean, if you don't have some degree of exposure, you, you basically don't exist. So having some sort of communication strategies, I think is getting more and more important for scientists of any, any kind of. And, yeah, I mean this is demonstrated by the fact that there are lots of scientists who have blogs out there, for instance, and really do deeply care about their communication.",
      "id": "ep_52_ut_157"
    },
    {
      "end": 3428774,
      "speaker": "Jen Christiansen",
      "start": 3427694,
      "text": "Right. Yeah.",
      "id": "ep_52_ut_158"
    },
    {
      "end": 3436102,
      "speaker": "Moritz Stefaner",
      "start": 3428902,
      "text": "But let's say inside the universities, is it often still more the, how many journal articles do you have? Like, isn't that.",
      "id": "ep_52_ut_159"
    },
    {
      "end": 3455218,
      "speaker": "Enrico Bertini",
      "start": 3436126,
      "text": "I think it's changing. I think it's changing because, I mean, it's changing because everyone has a lot of papers now, right. So I think it's getting harder and harder to have some really differentiating factors. Right.",
      "id": "ep_52_ut_160"
    },
    {
      "end": 3455990,
      "speaker": "Moritz Stefaner",
      "start": 3455314,
      "text": "Yeah.",
      "id": "ep_52_ut_161"
    },
    {
      "end": 3470778,
      "speaker": "Enrico Bertini",
      "start": 3456850,
      "text": "So in the advent of Internet, you, I mean if you have some, at least some degree of interest in having an impact on real, I don't know, real world problems and people, then you do need exposure, right?",
      "id": "ep_52_ut_162"
    },
    {
      "end": 3471590,
      "speaker": "Jen Christiansen",
      "start": 3470874,
      "text": "Yeah.",
      "id": "ep_52_ut_163"
    },
    {
      "end": 3475530,
      "speaker": "Moritz Stefaner",
      "start": 3472510,
      "text": "So there will be a job for Jen also in the future, you think?",
      "id": "ep_52_ut_164"
    },
    {
      "end": 3499540,
      "speaker": "Enrico Bertini",
      "start": 3476190,
      "text": "Yeah, I mean, I would totally hire a person like this to come in the department and help professors we actually do have a person like this, not exactly like Jen, but we are. We do have people in the department, for instance, who are experts in communication and try to just put out there the stuff that we do in the lab. Yeah, I think that's crucial.",
      "id": "ep_52_ut_165"
    },
    {
      "end": 3509696,
      "speaker": "Moritz Stefaner",
      "start": 3499840,
      "text": "Yeah. But maybe that's really a good tip for design students, you know, who think about, okay, you know, what are the fields where I could get active? I think many of them don't have science, you know, on the radar.",
      "id": "ep_52_ut_166"
    },
    {
      "end": 3516456,
      "speaker": "Enrico Bertini",
      "start": 3509728,
      "text": "No, I think science is a huge opportunity. Yeah, absolutely. And it's fun. Right. You can learn a lot.",
      "id": "ep_52_ut_167"
    },
    {
      "end": 3517928,
      "speaker": "Moritz Stefaner",
      "start": 3516528,
      "text": "Yeah, most of the time.",
      "id": "ep_52_ut_168"
    },
    {
      "end": 3523550,
      "speaker": "Enrico Bertini",
      "start": 3518104,
      "text": "Most of the time. Well, you have to deal, to deal with scientists. It's just not always easy. Easy.",
      "id": "ep_52_ut_169"
    },
    {
      "end": 3530410,
      "speaker": "Moritz Stefaner",
      "start": 3525530,
      "text": "No. But I think it's a super underestimated opportunity. Yeah, absolutely.",
      "id": "ep_52_ut_170"
    },
    {
      "end": 3531178,
      "speaker": "Enrico Bertini",
      "start": 3530490,
      "text": "Absolutely.",
      "id": "ep_52_ut_171"
    },
    {
      "end": 3535306,
      "speaker": "Jen Christiansen",
      "start": 3531274,
      "text": "I think universities should pair up design departments and science departments for.",
      "id": "ep_52_ut_172"
    },
    {
      "end": 3535850,
      "speaker": "Moritz Stefaner",
      "start": 3535378,
      "text": "Right.",
      "id": "ep_52_ut_173"
    },
    {
      "end": 3537114,
      "speaker": "Enrico Bertini",
      "start": 3535970,
      "text": "Yeah, totally.",
      "id": "ep_52_ut_174"
    },
    {
      "end": 3565680,
      "speaker": "Jen Christiansen",
      "start": 3537202,
      "text": "Creating posters for conferences and things. It's amazing how many. I mean, I think it's come a long way since. Since I was going to science conferences in undergraduate work. But just when I think back on how long the lines of text were and how just some basic design principles, even beyond visualization, even more basic than that, just basic design principles, could be.",
      "id": "ep_52_ut_175"
    },
    {
      "end": 3577824,
      "speaker": "Enrico Bertini",
      "start": 3566060,
      "text": "Yeah, I think every undergraduate course should, in computer science or any other sciences, should have some degree, at least one course on how to do, how to design things properly. Right.",
      "id": "ep_52_ut_176"
    },
    {
      "end": 3579816,
      "speaker": "Moritz Stefaner",
      "start": 3577952,
      "text": "Yeah. See, and the same way we learn.",
      "id": "ep_52_ut_177"
    },
    {
      "end": 3580864,
      "speaker": "Enrico Bertini",
      "start": 3579848,
      "text": "Kids how to write.",
      "id": "ep_52_ut_178"
    },
    {
      "end": 3583460,
      "speaker": "Moritz Stefaner",
      "start": 3580952,
      "text": "So we could totally have an exchange program.",
      "id": "ep_52_ut_179"
    },
    {
      "end": 3586380,
      "speaker": "Jen Christiansen",
      "start": 3585120,
      "text": "Take it on the road.",
      "id": "ep_52_ut_180"
    },
    {
      "end": 3588584,
      "speaker": "Enrico Bertini",
      "start": 3586760,
      "text": "Exactly, yeah.",
      "id": "ep_52_ut_181"
    },
    {
      "end": 3589104,
      "speaker": "Moritz Stefaner",
      "start": 3588752,
      "text": "Nice.",
      "id": "ep_52_ut_182"
    },
    {
      "end": 3612058,
      "speaker": "Enrico Bertini",
      "start": 3589152,
      "text": "I think, I mean, in my experience, the hardest part is understanding the language because with some scientists, there's so much jargon there that it takes just a very long time just to penetrate this wall of crazy words that they keep using over and over again. And I guess generally, I guess you are faced with this problem all the time.",
      "id": "ep_52_ut_183"
    },
    {
      "end": 3635520,
      "speaker": "Jen Christiansen",
      "start": 3612114,
      "text": "Right, right. And generally, what I'll start with, if we're redoing a graphic that's pretty straight, straight up, very similar to what they did originally. I'll just change all the words on the axes and that sort of thing so that they're forced to react to my oversimplification. But we can't go all the way back to the jargon word. So then we start to kind of converge in on something that people understand that still.",
      "id": "ep_52_ut_184"
    },
    {
      "end": 3646428,
      "speaker": "Enrico Bertini",
      "start": 3637340,
      "text": "Man, I worked with quite a few scientists, but biologists are. I mean, it's really, really hard. I find it really, really hard. They use so many technical words.",
      "id": "ep_52_ut_185"
    },
    {
      "end": 3650340,
      "speaker": "Jen Christiansen",
      "start": 3646524,
      "text": "I don't know, they probably think the same about designers, though, you know, letting.",
      "id": "ep_52_ut_186"
    },
    {
      "end": 3652244,
      "speaker": "Enrico Bertini",
      "start": 3650500,
      "text": "So I don't know. Come on.",
      "id": "ep_52_ut_187"
    },
    {
      "end": 3653444,
      "speaker": "Jen Christiansen",
      "start": 3652292,
      "text": "We have jargon, too.",
      "id": "ep_52_ut_188"
    },
    {
      "end": 3664234,
      "speaker": "Enrico Bertini",
      "start": 3653572,
      "text": "I don't know. I find biology very heavily loaded with jargon compared to other sciences. I don't know. Maybe it's my own bias. Yeah.",
      "id": "ep_52_ut_189"
    },
    {
      "end": 3668322,
      "speaker": "Moritz Stefaner",
      "start": 3664282,
      "text": "I think both sides need to approach each other.",
      "id": "ep_52_ut_190"
    },
    {
      "end": 3683354,
      "speaker": "Enrico Bertini",
      "start": 3668426,
      "text": "Yeah. Okay. I think. Yeah. I mean, it's almost 1 hour that we. No, more than 1 hour that we've been talking. I don't know. Moritz, you want to ask something else?",
      "id": "ep_52_ut_191"
    },
    {
      "end": 3713690,
      "speaker": "Moritz Stefaner",
      "start": 3683442,
      "text": "No, I think we covered it all. I mean, it's a fascinating topic. I'm very interested in science communication because I, I think it's such a hard thing to do, and so it's great to discuss at least a bit, and maybe we can come back to that more often, get more, maybe real hard scientists on the show once or so, what their perspective is. I think it's a great topic, and as I said, probably a good career opportunity for many designers they are not aware of.",
      "id": "ep_52_ut_192"
    },
    {
      "end": 3715078,
      "speaker": "Enrico Bertini",
      "start": 3714470,
      "text": "Absolutely.",
      "id": "ep_52_ut_193"
    },
    {
      "end": 3719260,
      "speaker": "Jen Christiansen",
      "start": 3715134,
      "text": "You don't have to choose between science and art. You can bind them.",
      "id": "ep_52_ut_194"
    },
    {
      "end": 3725952,
      "speaker": "Moritz Stefaner",
      "start": 3721480,
      "text": "Superpowers. Yeah. Cool. Thanks so much, Jen. It was great having you.",
      "id": "ep_52_ut_195"
    },
    {
      "end": 3727144,
      "speaker": "Jen Christiansen",
      "start": 3726016,
      "text": "Great. Thank you.",
      "id": "ep_52_ut_196"
    },
    {
      "end": 3730712,
      "speaker": "Enrico Bertini",
      "start": 3727312,
      "text": "Thanks, Jen. That was awesome. Bye.",
      "id": "ep_52_ut_197"
    },
    {
      "end": 3731416,
      "speaker": "Jen Christiansen",
      "start": 3730816,
      "text": "Bye.",
      "id": "ep_52_ut_198"
    },
    {
      "end": 3756100,
      "speaker": "Enrico Bertini",
      "start": 3731568,
      "text": "Bye. Data stories is supported by Tableau software, helping people see and understand their data. Get answers from interactive dashboards. Wherever you go for your free trial, visit Tableau software@Tableau.com. Datastories this is Tableau.com Slash Datastories.",
      "id": "ep_52_ut_199"
    }
  ],
  "confidence": 0.929314479089851,
  "audio_duration": 3756,
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_status_code": null,
  "webhook_auth": false,
  "webhook_auth_header_name": null,
  "speed_boost": false,
  "auto_highlights_result": null,
  "auto_highlights": false,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_audio_quality": null,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "content_safety": false,
  "iab_categories": true,
  "content_safety_labels": {
    "status": "unavailable",
    "results": [],
    "summary": {}
  },
  "language_detection": false,
  "language_detection_threshold": null,
  "language_confidence": null,
  "custom_spelling": null,
  "throttled": false,
  "auto_chapters": true,
  "summarization": false,
  "summary_type": null,
  "summary_model": null,
  "custom_topics": false,
  "topics": [],
  "speech_threshold": null,
  "speech_model": "best",
  "chapters": [
    {
      "summary": "Data stories is supported by Tableau software, helping people see and understand their data. Get answers from interactive dashboards wherever you go. For a free trial, visit Tableau. Datastories.",
      "gist": " Tableau.com Datastories",
      "headline": "Data stories is supported by Tableau software that helps people see and understand data",
      "start": 520,
      "end": 19650,
      "id": "ep_52_ch_0"
    },
    {
      "summary": "Enrico: I'm talking from my new standing desk. Spring seems to be here and such a big relief. Been a tough winter in New York, huh?",
      "gist": "Weekly Data Stories",
      "headline": "Enrico: It's been a beautiful day in Germany",
      "start": 29660,
      "end": 125970,
      "id": "ep_52_ch_1"
    },
    {
      "summary": "Jen Christensen is the director of information graphics at Scientific American. We want to talk about what happens at the company and how it works. How do you create visualization for science? That's really, really interesting.",
      "gist": "In the Elevator With Jen Christensen",
      "headline": "Jen Christensen is director of information graphics at Scientific American",
      "start": 126630,
      "end": 163788,
      "id": "ep_52_ch_2"
    },
    {
      "summary": "Jen Stengel came out of a scientific illustration background. Has been at Scientific American off and on for about eight years. Most recently as the art director of information graphics.",
      "gist": "Meet the Art Director at Scientific American",
      "headline": "Jen came out of a scientific illustration background at Scientific American",
      "start": 163944,
      "end": 300092,
      "id": "ep_52_ch_3"
    },
    {
      "summary": "In the mid nineties, the way we were creating the magazine was shifting to the digital world. Even some of the data visualization was being done by hand. Now the way people are consuming the material is kind of in that same groundswell change.",
      "gist": "The graphic design field's evolution",
      "headline": "You entered the field at a time where desktop publishing was established",
      "start": 300156,
      "end": 509102,
      "id": "ep_52_ch_4"
    },
    {
      "summary": "Are things becoming more data heavy now also in the illustrations or the visualizations you publish? There's definitely a call for more of that. As technology changes, people have more freedom to do things in a certain way, and it's not necessarily better.",
      "gist": "Have we Gone Too Data-heavy in Science?",
      "headline": "Are things becoming more data heavy now also in the illustrations you publish",
      "start": 509246,
      "end": 740140,
      "id": "ep_52_ch_5"
    },
    {
      "summary": "Scientific American's art department is divided into jobs that have media specialties. I work on all of the information graphics. I generally think about it through four different lenses. Can an image tell the story more efficiently, effectively, or completely than words?",
      "gist": "How do we put graphics in Scientific American?",
      "headline": "So can you tell us a little bit about how do you guys work at Scientific American",
      "start": 741440,
      "end": 1194104,
      "id": "ep_52_ch_6"
    },
    {
      "summary": "Enrico: How often do you have to go back and sort of redo one of the steps from before? Or does sometimes maybe a great graphic change the article? Or are they often surprises as well?",
      "gist": "How to Write a Science Story in a Graphic",
      "headline": "How linear is this process? Are there surprises along the way",
      "start": 1194272,
      "end": 1416120,
      "id": "ep_52_ch_7"
    },
    {
      "summary": " often the scientists will send us visual material with their preliminary manuscript at our request. Do they ever discover something new once you redesign their visualizations? That's an interesting question. There's one coming out in April.",
      "gist": "Do Data Visualizations Make Science More Fun?",
      "headline": "Sometimes scientists will send us visual material with their preliminary manuscript",
      "start": 1416940,
      "end": 1692480,
      "id": "ep_52_ch_8"
    },
    {
      "summary": "Tableau lets people connect to any kind of data and visualize it on the fly. Databases, spreadsheets and even big data sources are easily combined into interactive visualizations, reports and dashboards. Tableau nine is in beta already. Big improvements coming along.",
      "gist": "Tableau Software",
      "headline": "Tableau lets people connect to data and visualize it on the fly",
      "start": 1693020,
      "end": 1759938,
      "id": "ep_52_ch_9"
    },
    {
      "summary": "How much do you know about how easy it is for your average reader to read a chart? How does this influence your design? Right now we don't have a whole lot of data, so it's a little hard to say for sure.",
      "gist": "How Much Does Your Reader Know About Visual Literacy?",
      "headline": "How much do you know about visual literacy of your readers",
      "start": 1760034,
      "end": 2189400,
      "id": "ep_52_ch_10"
    },
    {
      "summary": "Scientific American is the oldest continuously printed magazine in the United States. Do you see it transitions fully to being a digital magazine, or do you think the print product will always be the primary product. We definitely need to move forward and do more on the web.",
      "gist": "Scientific American: Toward a Digital Future",
      "headline": "Do you see Scientific American transitioning fully to being a digital magazine",
      "start": 2190820,
      "end": 2268320,
      "id": "ep_52_ch_11"
    },
    {
      "summary": "In the future, you know, print, web, it's going to be less of a distinction. Not everything makes sense as an interactive, so it's not worth putting the money into that. Other times, maybe we want to just explore an interactive and not do a print piece.",
      "gist": "Do Scientific American Have a Print-Interactive Future?",
      "headline": "Currently you say you do sometimes extension of the print graphic as interactive",
      "start": 2269620,
      "end": 2402560,
      "id": "ep_52_ch_12"
    },
    {
      "summary": "How do you engage people in a graphic that is portraying some pretty, either complex or abstract content? A lot of our quantum articles and that sort of thing make something relatable so that people can feel like they want to jump into the graphic and give it some time. Do you think that people will actually be more engaged on interactive pieces?",
      "gist": "Interactivity in Science Magazine",
      "headline": "How do you engage people in graphic that is portraying complex or abstract content",
      "start": 2402600,
      "end": 2705646,
      "id": "ep_52_ch_13"
    },
    {
      "summary": "John: I'm wondering if you can give some tips to people that want to become graphic designers. I look for data visualizers who can translate what might be done on the web into a form that makes sense in print as well. Also look for folks who are comfortable with scientific topics.",
      "gist": "What Do You Look For In a Data Visualization Designer?",
      "headline": "I'm wondering if you can give some tips on becoming a visualization designer",
      "start": 2705718,
      "end": 2937120,
      "id": "ep_52_ch_14"
    },
    {
      "summary": "A lot of the data visualizers I'm working with now do have a science background. But then also I work with a lot of illustrators as well. More often scientists who somehow discovered their artistic side, or is it more often artists who discovered their.",
      "gist": "Are Graphic Designers Better at Communication than Scientists?",
      "headline": "Most of the people who work with you are graphic designers",
      "start": 2940700,
      "end": 3103822,
      "id": "ep_52_ch_15"
    },
    {
      "summary": "I'm excited to see what happens as scientists become more and more savvy with data visualization. I think it'll be really interesting to see how many of those kind of transcend and then become great tools for communication as well. Having some sort of communication strategies is getting more important for scientists.",
      "gist": "The future of data visualization",
      "headline": "I'm excited to see what happens as scientists become more savvy with data visualization",
      "start": 3103966,
      "end": 3589104,
      "id": "ep_52_ch_16"
    },
    {
      "summary": "Jen: I find biology very heavily loaded with jargon compared to other sciences. Moritz: Both sides need to approach each other. You don't have to choose between science and art. You can bind them.",
      "gist": "Understanding the language of science",
      "headline": "Jen: The hardest part is understanding the language with some scientists",
      "start": 3589152,
      "end": 3756100,
      "id": "ep_52_ch_17"
    }
  ],
  "disfluencies": false,
  "entity_detection": false,
  "sentiment_analysis": false,
  "sentiment_analysis_results": null,
  "entities": null,
  "speakers_expected": null,
  "summary": null,
  "custom_topics_results": null,
  "is_deleted": null,
  "episode_num": "52",
  "episode_metadata": {
    "speakers": [
      "Moritz Stefaner",
      "Enrico Bertini",
      "Jen Christiansen"
    ],
    "WPid": "288",
    "url": "https://datastori.es/podlove/file/684/s/feed/c/mp3/datastories-52.mp3",
    "episode_title": "Science Communication at SciAm w/ Jen Christiansen"
  }
}