{
  "id": "a9222422-dec8-4b40-9d3a-a52b620016a9",
  "language_model": "assemblyai_default",
  "acoustic_model": "assemblyai_default",
  "language_code": "en_us",
  "status": "completed",
  "audio_url": "https://datastori.es/podlove/file/1072/s/feed/c/mp3/Datastories-58.mp3",
  "utterances": [
    {
      "end": 12154,
      "speaker": "Dani Llugany Pearson",
      "start": 400,
      "text": "I believe we are bored from being eight to 10 hours every day in front of the screen. So when we go out from the screen, the real life happens and things get more and more interesting.",
      "id": "ep_58_ut_0"
    },
    {
      "end": 36624,
      "speaker": "Enrico Bertini",
      "start": 14414,
      "text": "Data stories is brought to you by Qlik, who allows you to explore the hidden relationships within data that lead to insights that ignite good ideas. Let your instincts lead the way to create personalized visualizations and dynamic dashboards with Qlik sense, which you can download for free at www.Qlik.com/Datastories.",
      "id": "ep_58_ut_1"
    },
    {
      "end": 50784,
      "speaker": "Moritz Stefaner",
      "start": 46444,
      "text": "Hey, everyone, Datastories is 58. Hi, Enrico. How are you doing?",
      "id": "ep_58_ut_2"
    },
    {
      "end": 52324,
      "speaker": "Enrico Bertini",
      "start": 51084,
      "text": "I'm doing good.",
      "id": "ep_58_ut_3"
    },
    {
      "end": 53540,
      "speaker": "Moritz Stefaner",
      "start": 52444,
      "text": "Good. Very good. Very good.",
      "id": "ep_58_ut_4"
    },
    {
      "end": 54076,
      "speaker": "Dani Llugany Pearson",
      "start": 53572,
      "text": "Good.",
      "id": "ep_58_ut_5"
    },
    {
      "end": 54948,
      "speaker": "Enrico Bertini",
      "start": 54220,
      "text": "Yes.",
      "id": "ep_58_ut_6"
    },
    {
      "end": 57108,
      "speaker": "Moritz Stefaner",
      "start": 55116,
      "text": "Still busy with science and stuff.",
      "id": "ep_58_ut_7"
    },
    {
      "end": 61636,
      "speaker": "Enrico Bertini",
      "start": 57236,
      "text": "Yeah, summertime, quiet and busy. It's a strange mix.",
      "id": "ep_58_ut_8"
    },
    {
      "end": 62612,
      "speaker": "Dani Llugany Pearson",
      "start": 61820,
      "text": "Yeah, yeah, yeah.",
      "id": "ep_58_ut_9"
    },
    {
      "end": 67362,
      "speaker": "Moritz Stefaner",
      "start": 62668,
      "text": "I also have five weeks in front of me, like finishing stuff up and then I'll take some time off.",
      "id": "ep_58_ut_10"
    },
    {
      "end": 71734,
      "speaker": "Enrico Bertini",
      "start": 67418,
      "text": "Yeah. I'm so much forward. Yeah, yeah, yeah. We need some rest. Come on.",
      "id": "ep_58_ut_11"
    },
    {
      "end": 88570,
      "speaker": "Moritz Stefaner",
      "start": 72354,
      "text": "It seems like. But I have a cool, like, fall coming up. I'm really excited about the fall conferences, exhibitions, projects coming out finally. You know, I'm working on a lot of stuff that's not being published. That drives me mad. But the fall is gonna be like big.",
      "id": "ep_58_ut_12"
    },
    {
      "end": 100094,
      "speaker": "Enrico Bertini",
      "start": 88722,
      "text": "It's exactly the same feeling for me. On the one hand, I'm looking forward to going on vacation, but fall is going to be exciting. So I'm looking forward to it. I just need a little bit of a break in between.",
      "id": "ep_58_ut_13"
    },
    {
      "end": 103658,
      "speaker": "Moritz Stefaner",
      "start": 101754,
      "text": "Very good. It's gonna come. No worries.",
      "id": "ep_58_ut_14"
    },
    {
      "end": 105134,
      "speaker": "Enrico Bertini",
      "start": 103786,
      "text": "Yeah, I'm sure.",
      "id": "ep_58_ut_15"
    },
    {
      "end": 118802,
      "speaker": "Moritz Stefaner",
      "start": 106314,
      "text": "So today we have a new exciting episode. I'm really excited about this one because it's totally different from what we usually have. And it's with Dani Llugany Pearson. Hi, Dani.",
      "id": "ep_58_ut_16"
    },
    {
      "end": 120354,
      "speaker": "Dani Llugany Pearson",
      "start": 118938,
      "text": "Hello. How are you doing, guys?",
      "id": "ep_58_ut_17"
    },
    {
      "end": 122376,
      "speaker": "Moritz Stefaner",
      "start": 120474,
      "text": "Great, great. How are you?",
      "id": "ep_58_ut_18"
    },
    {
      "end": 130684,
      "speaker": "Dani Llugany Pearson",
      "start": 122530,
      "text": "Good, good. Actually, you're talking about the weather and the vacation. And here in Barcelona we have this crazy heat that it's being crazy.",
      "id": "ep_58_ut_19"
    },
    {
      "end": 133024,
      "speaker": "Moritz Stefaner",
      "start": 130724,
      "text": "Yeah, same in Germany. It's mad.",
      "id": "ep_58_ut_20"
    },
    {
      "end": 147812,
      "speaker": "Dani Llugany Pearson",
      "start": 133684,
      "text": "Yeah. I don't know, but I'm also wanting vacation. But as you, we are already like nonstop and having projects during the vacation. So it's going to be a bit difficult, I believe this year.",
      "id": "ep_58_ut_21"
    },
    {
      "end": 209716,
      "speaker": "Moritz Stefaner",
      "start": 147948,
      "text": "Yeah, somehow it's going to work out. So maybe briefly for introduction. Dani and I met last year and was crazy hot as well. And it was in Barcelona as well. And Danny and his colleagues took part in the data cuisine workshop we did as part of the big bang data exhibition at CCCB. Great exhibition. It's now traveling to Buenos Aires. Just heard it has been opened there. And the workshop was also in collaboration with Sonar+D. And we had great data cuisinists on board for this one. And, yeah, Dani was one of them. And so I got in touch, I learned a bit about their work. I think it's very exciting work, very unique. And this is how we got to know each other. And now, finally, we have him on the show to tell us a bit about what they are doing at domestic data streamers. So maybe the first question is, what is domestic data streamers? Danny, can you tell us a bit?",
      "id": "ep_58_ut_22"
    },
    {
      "end": 210164,
      "speaker": "Dani Llugany Pearson",
      "start": 209740,
      "text": "Yeah.",
      "id": "ep_58_ut_23"
    },
    {
      "end": 212282,
      "speaker": "Enrico Bertini",
      "start": 210284,
      "text": "And where does the name come from?",
      "id": "ep_58_ut_24"
    },
    {
      "end": 235354,
      "speaker": "Dani Llugany Pearson",
      "start": 212388,
      "text": "Yeah, the story of her name is really obvious. It's domestic because we tend to work with everyday objects, everyday languages, data, because we work with data and streamers, because at the beginning, when we didn't really know how we were going to work, we started thinking on doing things in real time and actually working with.",
      "id": "ep_58_ut_25"
    },
    {
      "end": 238014,
      "speaker": "Enrico Bertini",
      "start": 237654,
      "text": "The.",
      "id": "ep_58_ut_26"
    },
    {
      "end": 265792,
      "speaker": "Dani Llugany Pearson",
      "start": 238054,
      "text": "Website and all the screening that could be online. And, well, I'm going to tell you a bit about domestic data streamers. We're a studio based here in Barcelona, and basically we design and develop new systems that work on capturing and visualizing data in new ways. So somehow what we say is that we like to develop new languages or new data languages.",
      "id": "ep_58_ut_27"
    },
    {
      "end": 274294,
      "speaker": "Moritz Stefaner",
      "start": 265848,
      "text": "And how does that look like? Can you give us a few examples? What are some of the projects you've done in the past? How is that different from a normal chart, maybe?",
      "id": "ep_58_ut_28"
    },
    {
      "end": 452724,
      "speaker": "Dani Llugany Pearson",
      "start": 274874,
      "text": "Yeah, basically we tend to go away from charts because, well, we are in nowadays. It's kind of strange how the communication world is evolving. Actually, there is a lot and a lot and a lot of people working on data visualization. But normally people tend to work on a digital environment. And nowadays we are seeing how the ingredients of a pepperoni pizza are being visualized the same way, with the same graph, with the same pourpoint graph as the last deaths in the Iraq war. So when we saw this kind of reality, we were a bit preoccupied because we thought that it wasn't the way to make information valuable for people at the end. So now I'm going to tell you, like, the last project that we did that was in Mundaneum, which is a museum in Mons, which is the European capital for culture, this year in Brussels. And basically what we did is we had this idea where we didn't know what, or we still don't know when we are referring to, like, the concept of what are, like, the zettabytes or what are the megabytes, like all these numbers that refer to data storage. People don't really understand them, people don't really care about them because they cannot refer it to a real volume. So what we did is we got three k points in a lifetime, which was from all the information created from the down of civilization to 2003. That has been five exabytes. And we translated all that information into a grain of sand. And then we got all the information created from 2003 to 20 1415, which is the present. And it has been 4.4 zettabytes, which is more than 1000 times more than the information created all down since the down of civilization, which is crazy. That was represented in a square of 20 cm. But what's more crazy, it's what's going to happen. And that's what we wanted to really represent, that our near future is going to be crazy in terms of data storage. And that was represented, for example, the information that was created from the 2014 to 2020. We created a square made of sand that contained about 100 kilos and was 2 meters long, which is crazy in comparison with the grain of sand. With a unique grain of sand.",
      "id": "ep_58_ut_29"
    },
    {
      "end": 462660,
      "speaker": "Moritz Stefaner",
      "start": 453744,
      "text": "And you actually put this sand in an exhibition room. Right. So it's not just an image of sand or some illustration, but you actually put a physical option.",
      "id": "ep_58_ut_30"
    },
    {
      "end": 488946,
      "speaker": "Dani Llugany Pearson",
      "start": 462692,
      "text": "Exactly right. Basically what we try to do is we go away from what's a digital visualization. We try to make things physical so people can feel them, can look at them, can hear them, can touch them. Because we believe that we are not making no more infographics, but info experiences.",
      "id": "ep_58_ut_31"
    },
    {
      "end": 520542,
      "speaker": "Moritz Stefaner",
      "start": 489010,
      "text": "Right? Yeah. I think that unifies all your projects is that they have some spatial or some object characters with them, at least the ones we see on your website. So in many ways, data sculptures or data spaces, you could say. And what I also find really interesting is that many of them are participatory, so that often the objects only appear because people contribute something or they add something to the sculpture, right, exactly.",
      "id": "ep_58_ut_32"
    },
    {
      "end": 555896,
      "speaker": "Dani Llugany Pearson",
      "start": 520638,
      "text": "Maybe because nowadays data has been created to make an impact on people. And now within our installations, our aim at the end is to make or create an impact on the visualization because of the information of people. So the participation of people creates an impact into the visualization. And that what generates is a transcendence on people, because people can compare themselves to others information, and so they feel they become part of something.",
      "id": "ep_58_ut_33"
    },
    {
      "end": 585378,
      "speaker": "Moritz Stefaner",
      "start": 555960,
      "text": "Yeah, I think that's really, really fascinating. So one project I really liked was the data strings project, which is basically a parallel coordinates plot. So you have different columns with different data people could enter about themselves. Basically, I think their job and their. The age, their height, like personal data and everybody could take one string and connect all the dots that would apply to them. Right. And so the.",
      "id": "ep_58_ut_34"
    },
    {
      "end": 586370,
      "speaker": "Dani Llugany Pearson",
      "start": 585506,
      "text": "Exactly, yeah.",
      "id": "ep_58_ut_35"
    },
    {
      "end": 601778,
      "speaker": "Moritz Stefaner",
      "start": 586442,
      "text": "The actual graphic only emerges because a lot of people contribute and. Yeah. So it's clear how you became part of that. And everybody donates sort of their data point. And this leads to this really nice survey graphic overall.",
      "id": "ep_58_ut_36"
    },
    {
      "end": 665776,
      "speaker": "Dani Llugany Pearson",
      "start": 601826,
      "text": "Yeah, yeah. This project was nice, or it's nice. We've been doing it more than once, actually. That project was for the international art Fair in Barcelona. And it was one of our first projects. What we did is we wanted to know if people, as it was in an art environment, we wanted to create kind of a silly question, and we asked people what they prefer, rather a spoon or a fork. And then we crossed this information with the socio demographic profile of the people that were participating. So at the end, the answers given by the people started to create a graphic or an image that was totally random and actually was generated by the differences on the profiles of different people. But what was nice about this project is that we could see the profiles at the end. We could make like a flow map of the profile of the people that attended to this art fair.",
      "id": "ep_58_ut_37"
    },
    {
      "end": 670368,
      "speaker": "Moritz Stefaner",
      "start": 665880,
      "text": "Right. And the color of the thread was spoon or fork. Right, so.",
      "id": "ep_58_ut_38"
    },
    {
      "end": 671720,
      "speaker": "Dani Llugany Pearson",
      "start": 670456,
      "text": "Exactly, exactly.",
      "id": "ep_58_ut_39"
    },
    {
      "end": 676484,
      "speaker": "Moritz Stefaner",
      "start": 671752,
      "text": "Depending on the color of the thread. And then make this path through this data space.",
      "id": "ep_58_ut_40"
    },
    {
      "end": 681392,
      "speaker": "Dani Llugany Pearson",
      "start": 676784,
      "text": "Exactly. Then by knitting the information, people created this artwork.",
      "id": "ep_58_ut_41"
    },
    {
      "end": 700294,
      "speaker": "Moritz Stefaner",
      "start": 681488,
      "text": "Yeah, I think that's really nice. One thing I was wondering about, like, all these projects that. That you put out there, like sand and wood and balloons even, and strings, how do you deal with, like, don't people like, destroy it sometimes? Or what happens if, like ten kids come by and have some fun with your art?",
      "id": "ep_58_ut_42"
    },
    {
      "end": 730444,
      "speaker": "Dani Llugany Pearson",
      "start": 701194,
      "text": "Well, we are prepared. Normally we have some guns and we are totally prepared for kids. Not really. We've never had any problem until now. Because normally the environment where we create this kind of installations are quite controlled and there is people taking care about the installation. So until now, we didn't have any issue with people.",
      "id": "ep_58_ut_43"
    },
    {
      "end": 737336,
      "speaker": "Moritz Stefaner",
      "start": 730904,
      "text": "So it's usually part of exhibitions or you have some personnel around that guide experience.",
      "id": "ep_58_ut_44"
    },
    {
      "end": 739364,
      "speaker": "Dani Llugany Pearson",
      "start": 737440,
      "text": "Exactly, exactly, yeah, makes sense.",
      "id": "ep_58_ut_45"
    },
    {
      "end": 754984,
      "speaker": "Enrico Bertini",
      "start": 740044,
      "text": "So can you describe how people react and interact with these things? So, for instance, in this project, how does it happen? People come in and I guess you need to explain to them what it is and what they are allowed to do. Right.",
      "id": "ep_58_ut_46"
    },
    {
      "end": 813474,
      "speaker": "Dani Llugany Pearson",
      "start": 755484,
      "text": "Normally it's really intuitive. People just understand really easily how and what they have to do, because normally the interactions are really, really easy. What's nice about this kind of interactions is that you tend to generate synergies with people. That you wouldn't actually talk to because they approach you and they just think after they participate, just they talk to you, they explain you what they are thinking about the installations. And there are some discussions come out from these installations, which. This is really nice because at the end, like, placing the information somewhere in a public space, for example, allows people to generate discussion. And this is something that we are not as much as normally see it.",
      "id": "ep_58_ut_47"
    },
    {
      "end": 827976,
      "speaker": "Enrico Bertini",
      "start": 813554,
      "text": "How does it work? So people interact with this thing for a while. So, for instance, in data string strings, every time you have a new person interacting, it's adding an element to the piece. Right? So is there?",
      "id": "ep_58_ut_48"
    },
    {
      "end": 828504,
      "speaker": "Dani Llugany Pearson",
      "start": 828080,
      "text": "Yes.",
      "id": "ep_58_ut_49"
    },
    {
      "end": 837044,
      "speaker": "Enrico Bertini",
      "start": 828584,
      "text": "So do you have a predetermined period of time? You decide that people can interact with it, and then you stop it. And how does it work?",
      "id": "ep_58_ut_50"
    },
    {
      "end": 880976,
      "speaker": "Dani Llugany Pearson",
      "start": 837984,
      "text": "It depends mostly of the installation. In this case, in the data strings that we made in this place, we had two days, 8 hours per day, and we had, like, more than one or 2000 interactions, which was a lot. It was kind of. It was kind of a nonstop. It was quite crazy. And we did the same installation in Qatar, in Doha. And actually, the installation was meant to be there for two weeks, but the third day, there was so many interactions of the people because it was placed, like, in a venue in the street that in the third date, we had to cut off all the strings and restart it again.",
      "id": "ep_58_ut_51"
    },
    {
      "end": 882744,
      "speaker": "Enrico Bertini",
      "start": 881150,
      "text": "This is what I was wondering.",
      "id": "ep_58_ut_52"
    },
    {
      "end": 934914,
      "speaker": "Dani Llugany Pearson",
      "start": 883604,
      "text": "Yeah, yeah, yeah, yeah, yeah. And we were, like, really kind of worried because we didn't know the people there. We thought, okay, maybe they don't interact. They don't understand what we are trying to say with this installation. But no, it went really well in that case. What we did with that installation is that we were trying to know about education and technology inside education. And this kind of questions that in the beginning, in the first installation, were more related to more personal details and to this spoon and fork thing, transformed themselves into a kind of a survey that could allow us to draw the profile and to ask and answer some of the questions related to technology and education.",
      "id": "ep_58_ut_53"
    },
    {
      "end": 952224,
      "speaker": "Moritz Stefaner",
      "start": 935484,
      "text": "I mean, generally, what do you think? What's the main. What makes working with these sculptures or these spaces? What's the quality that comes in as compared to working in digital media or in paper? Why do you do these sculptures and these spaces?",
      "id": "ep_58_ut_54"
    },
    {
      "end": 1031690,
      "speaker": "Dani Llugany Pearson",
      "start": 954164,
      "text": "I believe there is a personal thing from all the people in the group that we didn't want to just stay in something digital. But also, we've realized that when there is, like, more senses involved in an interaction, in kind of communication, it kind of transcends more we are in an era where 90% of all the information in the world has been created during the. Until 2013, and now it's like 96% about all this information that has been created, and it's all digital born. So what we are trying is to create new ways and establish new paths so that information still transcends on people. And we believe that when people can touch things, can see them, can hear them, the implication of it, it's much bigger, because at the end, people are kind of used to see graphs in a digital environment, and what we are trying is to place them in somewhere that they are not used to and creating something different.",
      "id": "ep_58_ut_55"
    },
    {
      "end": 1062997,
      "speaker": "Moritz Stefaner",
      "start": 1031762,
      "text": "Yeah, I think this is also where the data cuisine, also, the observations made there match this quite well, that I think we can interact with all these huge datasets online and digitally. And I think that that's super exciting to me as well. I love to do that. But in these more sculptural or more experiential projects, often you have very simple data sets. You know, it's like small, just a couple of numbers. Often, yeah. But you experience them in a much different way. Like, much more.",
      "id": "ep_58_ut_56"
    },
    {
      "end": 1081726,
      "speaker": "Dani Llugany Pearson",
      "start": 1063045,
      "text": "Well, for example, it's not the same. Knowing that. I don't know that you. That half of the Spanish people have sex on the first date than eating like a crab. A crab. That actually explains that.",
      "id": "ep_58_ut_57"
    },
    {
      "end": 1081934,
      "speaker": "Moritz Stefaner",
      "start": 1081750,
      "text": "No.",
      "id": "ep_58_ut_58"
    },
    {
      "end": 1087638,
      "speaker": "Dani Llugany Pearson",
      "start": 1081974,
      "text": "And somehow. So it's more transcendent to, like, eat that data.",
      "id": "ep_58_ut_59"
    },
    {
      "end": 1103640,
      "speaker": "Moritz Stefaner",
      "start": 1087806,
      "text": "Yeah, yeah. And the second thing is really the conversation also, like, if you walk around and you see this interesting data sculpture, and you think like, oh, that's strange, and then you start to talk about the thing. Right. And if you're online, you might just look at it and. I don't know.",
      "id": "ep_58_ut_60"
    },
    {
      "end": 1106256,
      "speaker": "Dani Llugany Pearson",
      "start": 1103672,
      "text": "Yeah, just pass by. Yeah, you just pass by.",
      "id": "ep_58_ut_61"
    },
    {
      "end": 1144904,
      "speaker": "Moritz Stefaner",
      "start": 1106320,
      "text": "Yeah. That's very interesting. Really? Yeah, it's fascinating. And I really like about your work that there is a very coherent theme to it. Like, you really. Or at least from what we see on the website, you know, it seems very coherent in a sense, that it's always public installations, they're always with objects. But each of the projects adds one new facet to this general idea, that there's, like a data sculpture out there that represents some data in object form. Right. Is this something you. Was it clear straight away that you want to focus exactly on this thing, or how did this happen?",
      "id": "ep_58_ut_62"
    },
    {
      "end": 1255090,
      "speaker": "Dani Llugany Pearson",
      "start": 1145284,
      "text": "No, no, no. It came up really in a really organic way. We didn't actually, when we started, we started in. In the streets creating kind of a public art installation, more related into graffiti, because they asked us to create, kind of to paint a wall in a square in Barcelona. That actually, there is a lot happening in terms of social people, things, events, the places. There are hotels, like, there also are schools, there is a disco, nightclubs. We had this idea of making something that could involve the people in that square. And actually, there, we created our first installation where we were asking people to place their information in the wall. And after a few installations where we started working with data that actually were really, really easy datasets, we started realizing that we had a path to follow in terms of discovering or creating new ways to develop and understand this information and trying to generate messages that could actually transcend on people by understanding really well, which was the reason, the methodology, to generate this message. So, actually, we like to say that we are kind of a laboratory in terms of generating this data and actually visualizing it, right?",
      "id": "ep_58_ut_63"
    },
    {
      "end": 1277174,
      "speaker": "Moritz Stefaner",
      "start": 1255122,
      "text": "And it seems like you found something really interesting, and now you're, like, just through making new projects, actually discovering what that actually is. Because I think nobody's so focused on these public data sculptures. And I think that's kind of exciting that you find something where you say, oh, that's kind of interesting. And then with each new project, you explore what it actually is. It's a nice way of working.",
      "id": "ep_58_ut_64"
    },
    {
      "end": 1323248,
      "speaker": "Dani Llugany Pearson",
      "start": 1277214,
      "text": "It's crazy, because somehow, every day we are doing something different, and that is really, really exciting because we really don't know where we're going, and that's a good thing. And also, each project, as we try to focus on that project and to design it in terms of innovation, where we focus and create specifically, and we design specifically for that kind of dataset, or what's the reason that we're working for. We don't know what kind of materials we're going to use. We don't know how we're going to design it. We don't know how people are going to interact. We don't even know how we are going to create that interaction. So every project is a whole new thing, and that makes us learn a lot.",
      "id": "ep_58_ut_65"
    },
    {
      "end": 1332636,
      "speaker": "Moritz Stefaner",
      "start": 1323366,
      "text": "So how do you approach new projects? Do you have a few ideas in the back of your mind? Maybe like, I'd like to do something with glass at some point, or.",
      "id": "ep_58_ut_66"
    },
    {
      "end": 1334596,
      "speaker": "Dani Llugany Pearson",
      "start": 1332820,
      "text": "Yeah, for sure, for sure.",
      "id": "ep_58_ut_67"
    },
    {
      "end": 1340300,
      "speaker": "Moritz Stefaner",
      "start": 1334660,
      "text": "Or is it more like, you take the challenge and then you start from scratch? Do you prototype?",
      "id": "ep_58_ut_68"
    },
    {
      "end": 1390330,
      "speaker": "Dani Llugany Pearson",
      "start": 1340412,
      "text": "How do you do it for sure? We've been, like, one and a half years working on that. It's been, at the beginning, it was more like, okay, we would like to work with glass or we would like to work with wood. Or in terms of what we've been doing and what we are doing now, it's changed a bit because now we try to focus and understand really well. Really well, which is the brief. And actually, the brief brings us to a solution that we aren't thinking on. Okay. We're going to use glass. It's more depending on which is the solution that we have to give that we think in one path or another.",
      "id": "ep_58_ut_69"
    },
    {
      "end": 1442964,
      "speaker": "Enrico Bertini",
      "start": 1390442,
      "text": "So, Danny, I'm wondering if. I mean, when I go to your website, I see so many interesting projects, and I guess some of our listeners probably don't know the interesting span of different projects that you guys have. So I'm wondering if you can quickly describe some of them, because they're really beautiful. And I also like the way you present them on your website. Most of them are presented together with some video and really showing how it looks like in reality. So I'm just wondering. I think it would be useful for our listeners to get a sense of what's the span of your projects that you have. Like, I don't know. The read by tweet is really cool. We talked about data strengths.",
      "id": "ep_58_ut_70"
    },
    {
      "end": 1600934,
      "speaker": "Dani Llugany Pearson",
      "start": 1443904,
      "text": "Yeah. Let me explain you the lifeline, one that for us is really meaningful. It's been like, for long the biggest data installation that we've done. And also, I think that we will do for a long time something that it's more than 100 meters long and 160 meters long. It's quite crazy what we did. There is. We had one question where we wanted to know. We wanted to make a relation between one's real age and the age when people would like to die. We had this question in mind and we thought, okay, how can we create an installation that talks about this? Not only that, but how can we talk about this in a way that it has sense and doesn't hurt people and people want to actually interact with that, because it's like a really tricky question. Somehow. If I go in the street and ask someone about when they want to die, they will tell me that I'm quite crazy. Before. Yeah, but what's this installation? Basically, it's made up with balloons. Because we tried to relate, like, what we were talking about, it was about life and death to something like, could be ephemeral as a balloon. And what we did is we placed a grid on the floor that had on the zeta axis, once real age, and on the y axis, one's desired age to die. So whether there was a crossing on that information, for example, if there was someone that was 27 and wanted to die at 81. What we did is we changed the white balloon because all the installation started in white balloons that were filled up with helium, so they were in the air. What we did is change it that coordinate to a black balloon representing death. So because of the interaction of people, what started to happen is that all the white balloons tended to transform themselves into black balloons containing all the information about the life and death, about the people that were actually responding to that question and whether there was like a coincidence on one coordinate. The balloons started to raise up like a normal graph. So at the end you could see, like, all the information, placed it.",
      "id": "ep_58_ut_71"
    },
    {
      "end": 1604402,
      "speaker": "Enrico Bertini",
      "start": 1604114,
      "text": "In.",
      "id": "ep_58_ut_72"
    },
    {
      "end": 1606374,
      "speaker": "Dani Llugany Pearson",
      "start": 1604418,
      "text": "That big museum space.",
      "id": "ep_58_ut_73"
    },
    {
      "end": 1637604,
      "speaker": "Enrico Bertini",
      "start": 1606714,
      "text": "Yeah, it's really impressive. If you're listening to this, I suggest you, if you can, to just stop for a moment, go to. So your URL is what domesticstreamers.com and look into lifeline, the project called Lifeline. And there is a nice movie and lots of pictures. It's a beautiful landscape ranged in a grid with white balloons and black balloons. But the black balloons are normally higher, taller than the white ones, right?",
      "id": "ep_58_ut_74"
    },
    {
      "end": 1659834,
      "speaker": "Dani Llugany Pearson",
      "start": 1637724,
      "text": "Yeah, because, as I said, the black balloons were placed. Once people answered to these two questions, they were asking their real age and the age when they wanted to die. And that coordinate, that point was replacing the white balloon into a black balloon.",
      "id": "ep_58_ut_75"
    },
    {
      "end": 1662546,
      "speaker": "Enrico Bertini",
      "start": 1659914,
      "text": "So the white ones are people who didn't answer.",
      "id": "ep_58_ut_76"
    },
    {
      "end": 1667454,
      "speaker": "Dani Llugany Pearson",
      "start": 1662690,
      "text": "No. The white balloons are like the coordinates where there wasn't an answer.",
      "id": "ep_58_ut_77"
    },
    {
      "end": 1671506,
      "speaker": "Moritz Stefaner",
      "start": 1669154,
      "text": "So nobody wants to die with like ten years.",
      "id": "ep_58_ut_78"
    },
    {
      "end": 1679054,
      "speaker": "Dani Llugany Pearson",
      "start": 1671610,
      "text": "Exactly. Exactly. So it's quite exactly. It's nice. It's nice. So it's nice numbers there.",
      "id": "ep_58_ut_79"
    },
    {
      "end": 1689210,
      "speaker": "Enrico Bertini",
      "start": 1679434,
      "text": "So how did it work? Did you ask people to pick a balloon and then you, I don't know, attached the balloon?",
      "id": "ep_58_ut_80"
    },
    {
      "end": 1720334,
      "speaker": "Dani Llugany Pearson",
      "start": 1689362,
      "text": "Actually, this installation was placed on the design museum in Barcelona, which is a place where there is a lot of people passing by. And what we did is we started to ask to all the people that were around about this information, and they just, we gave them, like, the black balloons, and they changed the black balloons for the white balloons. So they just were passing by all the installation passing by between the different balloons and somehow they were like walking on data.",
      "id": "ep_58_ut_81"
    },
    {
      "end": 1732698,
      "speaker": "Enrico Bertini",
      "start": 1721194,
      "text": "It's beautiful. Can you describe maybe another one? Just what? Again, I just want to make sure that we have a few examples because they're really beautiful and interesting. You pick one.",
      "id": "ep_58_ut_82"
    },
    {
      "end": 1812054,
      "speaker": "Dani Llugany Pearson",
      "start": 1732826,
      "text": "Yeah. Let's go to something that it's a bit more happier. We had one question. We had one question that was, does the golden age really exist? Like, people have happy age to live? That was our question, we wanted to see if there was any coincidences, like, if people around thirties are happier than people around forties. And what we did is we made kind of the same graph that we used for the light string with a cartesian graph. And we had once real age and the age where they believe they would be happier. So basically, we were asking the same. But in this case, we weren't using balloons, we were using trunks, pieces of wood, different trunks that actually, we use that because what we try to do normally is to use materials that are related in kind of a universal language. And we've always been, as human beings, talking about life, and life rings that you can see when you cut a tree.",
      "id": "ep_58_ut_83"
    },
    {
      "end": 1812630,
      "speaker": "Enrico Bertini",
      "start": 1812214,
      "text": "Sure.",
      "id": "ep_58_ut_84"
    },
    {
      "end": 1837526,
      "speaker": "Dani Llugany Pearson",
      "start": 1812702,
      "text": "So basically, we were using that material and that kind of slices representing each person and each interaction. So, basically, because of the interactions of people, you started to see, like, kind of a forest that started to grow up because of the information. And actually, it was no more than a bar graph, but translated into something physical.",
      "id": "ep_58_ut_85"
    },
    {
      "end": 1842158,
      "speaker": "Moritz Stefaner",
      "start": 1837710,
      "text": "And would everybody put their own piece of wood in the chart or did you do that?",
      "id": "ep_58_ut_86"
    },
    {
      "end": 1845416,
      "speaker": "Dani Llugany Pearson",
      "start": 1842206,
      "text": "Exactly. Exactly. No, no, no. Everyone could do that.",
      "id": "ep_58_ut_87"
    },
    {
      "end": 1859192,
      "speaker": "Enrico Bertini",
      "start": 1845520,
      "text": "Yeah. This is what I really like of this project, this participatory aspect that people actually contribute into generating their own data point. That's really beautiful.",
      "id": "ep_58_ut_88"
    },
    {
      "end": 1918000,
      "speaker": "Dani Llugany Pearson",
      "start": 1859288,
      "text": "Yeah, that's for us, it's one of the nicest things. When you see the faces of the people interaction or when you see, like, in this installation, what happened is we had a queue of people willing to give us their real age, which is crazy. Like, people that normally don't give their age because it's something that. It's kind of rude in some places. Here in Barcelona, it's not really normal to say, hello, I'm 64 and I'm proud of it. And there we were having queues of people to just interact because they were feeling that they were participating and becoming part of something somehow. And just. I would like to add something. Guys, the people that you're hearing, if you are still not 40, you're gonna have, like, the nicest part in your life. In the forties, that's what we got about that installation, were the answers from.",
      "id": "ep_58_ut_89"
    },
    {
      "end": 1920444,
      "speaker": "Moritz Stefaner",
      "start": 1918032,
      "text": "People who were older or younger than 40.",
      "id": "ep_58_ut_90"
    },
    {
      "end": 1932566,
      "speaker": "Dani Llugany Pearson",
      "start": 1921224,
      "text": "No, no, no. They were older than 40. They were saying, like, oh, my forties were, like, amazing. More than the thirties and more. And more than when they were, like, really, really young.",
      "id": "ep_58_ut_91"
    },
    {
      "end": 1935274,
      "speaker": "Enrico Bertini",
      "start": 1932710,
      "text": "That's great news. I hope it's true.",
      "id": "ep_58_ut_92"
    },
    {
      "end": 1949114,
      "speaker": "Dani Llugany Pearson",
      "start": 1937174,
      "text": "Yeah. Because actually, I was thinking, okay, the good thing has already passed it by. But, no, I still have got plenty of years until the forties get to me.",
      "id": "ep_58_ut_93"
    },
    {
      "end": 1961894,
      "speaker": "Moritz Stefaner",
      "start": 1951214,
      "text": "Yeah, nice. Yeah, all these things. That's really nice. So you learn a lot about people and what they think, and suddenly it's about much more than just the pure numbers. Right. So exactly.",
      "id": "ep_58_ut_94"
    },
    {
      "end": 1970482,
      "speaker": "Dani Llugany Pearson",
      "start": 1963874,
      "text": "At the end, it's not about the numbers, it's about the stories that come from those numbers. Yeah.",
      "id": "ep_58_ut_95"
    },
    {
      "end": 1975474,
      "speaker": "Moritz Stefaner",
      "start": 1970498,
      "text": "And of course it's also practically immediately like that because it's about the people themselves.",
      "id": "ep_58_ut_96"
    },
    {
      "end": 1975746,
      "speaker": "Dani Llugany Pearson",
      "start": 1975554,
      "text": "Right.",
      "id": "ep_58_ut_97"
    },
    {
      "end": 1983922,
      "speaker": "Moritz Stefaner",
      "start": 1975770,
      "text": "It's not about the GDP of some country they have never been to, but of course it's data that relates to them directly. Yeah.",
      "id": "ep_58_ut_98"
    },
    {
      "end": 1984774,
      "speaker": "Dani Llugany Pearson",
      "start": 1984058,
      "text": "Yeah.",
      "id": "ep_58_ut_99"
    },
    {
      "end": 1999736,
      "speaker": "Enrico Bertini",
      "start": 1985194,
      "text": "So this is a good time to stop for a moment and talk about our sponsor, click, which announced the general availability of a new version of Qlik Sense. It's Qlik Sense 2.0. And Moritz, did you try Qlik Sense 2.0?",
      "id": "ep_58_ut_100"
    },
    {
      "end": 2148544,
      "speaker": "Moritz Stefaner",
      "start": 1999840,
      "text": "Yeah. In fact, I've been to a conference from Qlik. I spent a whole day there and saw a presentation on the new features, and it's actually quite impressive. So they have a new self service data preparation tool, more or less smart load, and it helps users to access data from any source and also automatically join, for instance, different tables you have in the data. Like you have two or three different tables. They might have a few columns that can be used to join the data, and we'll find these relationships automatically. That's kind of amazing. And you can also load external data sets, for instance, like population data, world statistics, things like this. They are automatically available from within the tool. So you don't even need to download data tables for standard statistical data. There's also smart data compression. That's a new way of plotting results. So basically, if you have a scatterplot, but you would have tens or hundreds of thousands of points, it would become really slow. And also you wouldn't see that much if you have a lot of overlapping points. It's always the same problem. You just have this cloud. What they do is dynamically turn that into a heat map. So you have basically, if you're over a certain limit of points, you get this grid with colored cells. That shows you really nicely how the density of your data is in a binned fashion, like a two dimensional binned grid. And as you zoom in, it breaks up into the individual points. So it's really cool and it happens on the fly. You don't have to do anything for it, and it makes your standard overloaded scatterplot so much more helpful. And last, they acquired endprinting, a company that's focused on printing and PDF export and things like this. So this helps now quite a bit with exporting the charts that are typically web based. So Qlik sense is all browser based charts, which is great for like, you know, using on a tablet or in your browser or on the desktop. But in many cases, people also want to have a static image they can send by email or put into a PowerPoint. And now they have all these new export features that allow you to export static images from any given view, like with a single click. That's really kind of cool.",
      "id": "ep_58_ut_101"
    },
    {
      "end": 2149620,
      "speaker": "Enrico Bertini",
      "start": 2149164,
      "text": "Nice.",
      "id": "ep_58_ut_102"
    },
    {
      "end": 2150132,
      "speaker": "Dani Llugany Pearson",
      "start": 2149692,
      "text": "Yeah.",
      "id": "ep_58_ut_103"
    },
    {
      "end": 2160158,
      "speaker": "Enrico Bertini",
      "start": 2150228,
      "text": "So if you want to try Qlik sense, you can download it for free at www.Qlik.com/Datastories. Let's go back to the show.",
      "id": "ep_58_ut_104"
    },
    {
      "end": 2201046,
      "speaker": "Moritz Stefaner",
      "start": 2160326,
      "text": "Can I ask a practical thing? So the things you do, I mean, it's somewhat in between art and design, I guess. It's probably mostly commissioned works, but not in a sense that you know, somebody or it's commissioned, but it's not really like you develop a product or a website for somebody. So how does this play out on the financial side? Like how, how does this work? Many of the projects more or less break even and then you make some money with the big commissions or do you try to earn money on each project? How does this whole market work? Many people don't know how that is. Can you shed some light on that? It's always a bit difficult to talk about, but it's interesting.",
      "id": "ep_58_ut_105"
    },
    {
      "end": 2293094,
      "speaker": "Dani Llugany Pearson",
      "start": 2201150,
      "text": "No, no, no, it's okay. At the beginning, it was quite, quite hard. We had to invest a lot, a lot of hours, a lot of work. We've been working for long, long, long periods. And it's been strange and a bit difficult and hard to establish a path in this way because we didn't, at least here in Barcelona, we didn't have anything that was looking the same. So it was quite difficult to make people understand what we were doing. But once we started having different projects, that could actually say, okay, these guys aren't doing bad things or whatever. We started working with institutions. At the beginning it was, as I say, more difficult to get some finance. But from like after six, seven months, we started working and earning for each project. It depends when we work for companies and when we work for institutions or cultural museums, always the budgets are different. And somehow we try to balance a bit with everything we make. For example, if we have a bit more from here, we, like, try to put it into investigation. It depends.",
      "id": "ep_58_ut_106"
    },
    {
      "end": 2306642,
      "speaker": "Moritz Stefaner",
      "start": 2293834,
      "text": "But in principle, you first have to prove that what you are suggesting is actually, it actually works. And this is all you have to build up yourself. The first few cases, you have to demonstrate yourself with a new.",
      "id": "ep_58_ut_107"
    },
    {
      "end": 2307802,
      "speaker": "Dani Llugany Pearson",
      "start": 2306698,
      "text": "Exactly that.",
      "id": "ep_58_ut_108"
    },
    {
      "end": 2313658,
      "speaker": "Moritz Stefaner",
      "start": 2307818,
      "text": "It's actually cool. And then suddenly everybody wants to commission you. Right?",
      "id": "ep_58_ut_109"
    },
    {
      "end": 2343736,
      "speaker": "Dani Llugany Pearson",
      "start": 2313826,
      "text": "Yeah. At the beginning, it was hard, but after a few study cases, and also what we did is to scientifically demonstrate that some of our installations, what we did is to generate a paper where what happened is that we demonstrated that the installations had a real impact on people's thoughts and on people's behaviors. So that's a really good thing.",
      "id": "ep_58_ut_110"
    },
    {
      "end": 2349604,
      "speaker": "Enrico Bertini",
      "start": 2343800,
      "text": "Oh, that's really interesting. Can you explain that more in details? How do you do that?",
      "id": "ep_58_ut_111"
    },
    {
      "end": 2413524,
      "speaker": "Dani Llugany Pearson",
      "start": 2350584,
      "text": "Yeah, actually, we started the team like, we were. We had industrial designers, more interactive media designers. We had. I'm a designer. We've got people that are working on interiors. And after months of work, this guy came up, which his name is Axel, and Axel is a psychologist. And actually, he's been working with statistics for a long time, and he could start giving. He started giving us a new way of work where we could demonstrate scientifically all this information. We started to work in a more scientific way because the methods that we were using in terms of capturing and visualizing this data had, like, a truth background, and somehow. So that's been nice.",
      "id": "ep_58_ut_112"
    },
    {
      "end": 2494264,
      "speaker": "Enrico Bertini",
      "start": 2413824,
      "text": "Yeah, that's very, very interesting. So I've been working myself a little bit in this area, and I have to say it's incredibly hard, but at the same time, very interesting and impactful. So, for instance, I work quite a lot with one of my colleagues here at NYU, who is an expert in human rights, Meg Satterthwaite. And we discuss all the time, how can we use visualization as a way to, first of all, make people aware of some issues they may not be aware of? But also, how do we induce either behavioral change or more interestingly, how do we maximize the chance that people take action? Right. Action is the hardest part. And your work strikes me as an amazing way to get much, much closer to people, because, as we said before, they participate to your pieces. Right. And, yeah, so I guess there is a lot of potential there for using these installations for, quote, unquote, the good. Right. So I'm wondering if you. If you've ever thought about it.",
      "id": "ep_58_ut_113"
    },
    {
      "end": 2498800,
      "speaker": "Dani Llugany Pearson",
      "start": 2494344,
      "text": "I mean, I don't understand what you're meaning.",
      "id": "ep_58_ut_114"
    },
    {
      "end": 2528480,
      "speaker": "Enrico Bertini",
      "start": 2498832,
      "text": "Yeah. So what I mean is that. So from what I see from your project, it doesn't look to me like that you have a very strong kind of, like, activist stance. Right. So you create beautiful things. But as far as I understand, you're not trying to convince people of anything. Right. You are not trying to change your. Their behavior or inducing them to take action on something that you believe is important. Or maybe I'm mistaken, but actually.",
      "id": "ep_58_ut_115"
    },
    {
      "end": 2541956,
      "speaker": "Dani Llugany Pearson",
      "start": 2528632,
      "text": "Well, yeah, I just wanted to say, you. Now we're gonna. I don't know if I can say that, but we're starting a work with Oxfam Intermon. Oxfam, which is the Ngo, this big NGO.",
      "id": "ep_58_ut_116"
    },
    {
      "end": 2542604,
      "speaker": "Enrico Bertini",
      "start": 2542020,
      "text": "Oh, yeah. Okay.",
      "id": "ep_58_ut_117"
    },
    {
      "end": 2554332,
      "speaker": "Dani Llugany Pearson",
      "start": 2542644,
      "text": "And we are. We are actually working in an installation that will do that. What we are trying with that installation is to induce a change on the behavior of people.",
      "id": "ep_58_ut_118"
    },
    {
      "end": 2556140,
      "speaker": "Enrico Bertini",
      "start": 2554428,
      "text": "Oh, yeah. That's quite interesting.",
      "id": "ep_58_ut_119"
    },
    {
      "end": 2568944,
      "speaker": "Dani Llugany Pearson",
      "start": 2556252,
      "text": "Yes, we are doing so, and we are moving towards this kind of work also, because at the end, it's a way of communicating that actually works really well.",
      "id": "ep_58_ut_120"
    },
    {
      "end": 2584404,
      "speaker": "Moritz Stefaner",
      "start": 2569024,
      "text": "I also think it's a natural connection, and especially this point that something can touch you much more deeply if it's an actual object or something in the world. I think that makes it a natural fit to apply to all these important issues. Of course.",
      "id": "ep_58_ut_121"
    },
    {
      "end": 2609892,
      "speaker": "Dani Llugany Pearson",
      "start": 2585584,
      "text": "Exactly. It's been like kind of a natural path. What's been happening is that we've been, like, investigating and developing and trying and making until we realize that all this experience, this background, has lead us into a way that we can start communicating with people and we can start these dialogues between information and people.",
      "id": "ep_58_ut_122"
    },
    {
      "end": 2634068,
      "speaker": "Moritz Stefaner",
      "start": 2610028,
      "text": "On a formal side, I'm wondering, do you think there could be a successful combination of digital or. Yeah, or digital overlays with analog backgrounds or digital mechanics on concrete objects, you know, like its charm and. No, no, for sure. For sure.",
      "id": "ep_58_ut_123"
    },
    {
      "end": 2663490,
      "speaker": "Dani Llugany Pearson",
      "start": 2634116,
      "text": "For sure. Now, actually, we are internally working, working in the studio with projects that are half. Half. And it's also really interesting in the digital environment. We can work with kind of datasets, we can work with different aspects of information that we cannot work on the analogic environment. So. Yes, for sure.",
      "id": "ep_58_ut_124"
    },
    {
      "end": 2676460,
      "speaker": "Moritz Stefaner",
      "start": 2663642,
      "text": "I mean, a few of your projects went into that direction, I guess, already, like the sand falls and the drip by tweet, where there was some sort of mechanic aspect based on digital information. Right, exactly.",
      "id": "ep_58_ut_125"
    },
    {
      "end": 2677164,
      "speaker": "Dani Llugany Pearson",
      "start": 2676572,
      "text": "Exactly.",
      "id": "ep_58_ut_126"
    },
    {
      "end": 2694646,
      "speaker": "Moritz Stefaner",
      "start": 2677244,
      "text": "I think that's very fascinating also. Then there's, of course, 3d printing, lasing. So there are also all these new milling and so on. All these new construction methods that could feed processes that create objects. Right, exactly.",
      "id": "ep_58_ut_127"
    },
    {
      "end": 2699518,
      "speaker": "Dani Llugany Pearson",
      "start": 2694710,
      "text": "Yeah, yeah. We are not carried on using new materials. On using.",
      "id": "ep_58_ut_128"
    },
    {
      "end": 2701726,
      "speaker": "Moritz Stefaner",
      "start": 2699646,
      "text": "Not afraid of computers. Okay.",
      "id": "ep_58_ut_129"
    },
    {
      "end": 2703022,
      "speaker": "Dani Llugany Pearson",
      "start": 2701910,
      "text": "No, no, no.",
      "id": "ep_58_ut_130"
    },
    {
      "end": 2704194,
      "speaker": "Moritz Stefaner",
      "start": 2703198,
      "text": "Very good.",
      "id": "ep_58_ut_131"
    },
    {
      "end": 2712910,
      "speaker": "Dani Llugany Pearson",
      "start": 2706254,
      "text": "Not afraid of computants and not afraid of real life. Yeah.",
      "id": "ep_58_ut_132"
    },
    {
      "end": 2744020,
      "speaker": "Moritz Stefaner",
      "start": 2713022,
      "text": "But I think it's a very fascinating field, and I think what's, like, really not explored enough is this idea of a data space or this idea of, like, putting a chart actually into the world and then have it reveal itself spatially. I think that's something that's just so underappreciated. Of course, it's also super. Yeah. It's tough to build these things. You know, they need a lot of space and it's hard to develop them. But if it's done right, like, totally new things can happen. So I think that's very fascinating.",
      "id": "ep_58_ut_133"
    },
    {
      "end": 2745024,
      "speaker": "Dani Llugany Pearson",
      "start": 2744052,
      "text": "Yeah, yeah.",
      "id": "ep_58_ut_134"
    },
    {
      "end": 2761160,
      "speaker": "Moritz Stefaner",
      "start": 2746384,
      "text": "So what's next? You already said there might be an Oxfam project on the horizon. The yotta project was just open probably when we will be online soon. The documentation, any other new exciting things you're working on?",
      "id": "ep_58_ut_135"
    },
    {
      "end": 2797626,
      "speaker": "Dani Llugany Pearson",
      "start": 2761352,
      "text": "Yes, yes, yes. For sure now we are, like, working 24/7 here in the studio. We have a new installation on middle of August in San Francisco. We actually have running an installation in the California Academy of Sciences, also in San Francisco. On September, we are going into Holland, into a music festival to develop an art installation there. And then we are going back to Madrid for three times. Three different times. So until December, we are totally full of work.",
      "id": "ep_58_ut_136"
    },
    {
      "end": 2808346,
      "speaker": "Moritz Stefaner",
      "start": 2797750,
      "text": "Your travel plans are full. And do you also travel to the places to set everything up and develop the last part of the project as well? Right? Yeah, yeah.",
      "id": "ep_58_ut_137"
    },
    {
      "end": 2823654,
      "speaker": "Dani Llugany Pearson",
      "start": 2808370,
      "text": "It's a really nice thing about the work that we can. We've been traveling a lot. We've been traveling to more than eight or ten countries for the past year, actually developing more than 20 installations, which has been quite crazy.",
      "id": "ep_58_ut_138"
    },
    {
      "end": 2826760,
      "speaker": "Moritz Stefaner",
      "start": 2824864,
      "text": "Yeah, it's quite a bit, but.",
      "id": "ep_58_ut_139"
    },
    {
      "end": 2828644,
      "speaker": "Dani Llugany Pearson",
      "start": 2826792,
      "text": "Well, we are really happy about it.",
      "id": "ep_58_ut_140"
    },
    {
      "end": 2830720,
      "speaker": "Moritz Stefaner",
      "start": 2829144,
      "text": "Cool. Do we have more questions?",
      "id": "ep_58_ut_141"
    },
    {
      "end": 2855674,
      "speaker": "Enrico Bertini",
      "start": 2830752,
      "text": "Enrico, there are so many interesting projects. It's amazing. I just wanted to say that you do have some digital, let's say, part in your projects. I see here, for instance, or at least mechanical, I was taking a look at drip by tweet, for instance. So is that a robot that goes around?",
      "id": "ep_58_ut_142"
    },
    {
      "end": 2977492,
      "speaker": "Dani Llugany Pearson",
      "start": 2857294,
      "text": "Yeah. This was crazy to develop. It was like, really, really hard work. What we did is we have these awards here in Barcelona, which are the design and architecture awards from Barcelona in Spain, and they have this public audience award. And until last year, the audience award was working because of people voting in a simple tweet. And what we wanted to do is actually transform that tweet into something, into something else, into an experience. So what we did is we created this robot that actually translated each vote of the participants into a drop of gold, that that drop of gold went to the test tube that referred to the one of the 371 selected projects. So at the end, because of the participation of people during one month, like all the voting participation time, what happened is the different test tubes started to fill up, more or less showing a bar graph. And what was nice about this project was that people could refer their, like their action, their vote into something that had actually volume, that had a color, that had a shape. So they could say, okay, that drop is mine. Or when I'm doing the tweet, actually I'm moving all this thing and I'm participating in something. And at the end, another thing that happened that was really nice was that we were adding transparency into the voting system. And somehow, because normally how the voting works, the voting processes, they normally are totally closed to the public. But in this case, we placed that machine during one month in the design museum. And actually people could go there and see how it was evolving.",
      "id": "ep_58_ut_143"
    },
    {
      "end": 2980944,
      "speaker": "Moritz Stefaner",
      "start": 2977588,
      "text": "And how did you know beforehand how large to make the tubes?",
      "id": "ep_58_ut_144"
    },
    {
      "end": 3013262,
      "speaker": "Dani Llugany Pearson",
      "start": 2982004,
      "text": "Because we had this crazy and this funny story. We actually knew because of the installation that because of the last year that they had like more or less 4000 interactions. And we said, okay, we can make some math and we can make fit, I don't know, 1200 per test tube, something like that. And what happened is that it went so well that we had more than 20,000 interactions.",
      "id": "ep_58_ut_145"
    },
    {
      "end": 3014034,
      "speaker": "Moritz Stefaner",
      "start": 3013318,
      "text": "Oh, no.",
      "id": "ep_58_ut_146"
    },
    {
      "end": 3029822,
      "speaker": "Dani Llugany Pearson",
      "start": 3015854,
      "text": "But the hardest part was that we had 5000 interactions into one test tube. But then by coding we could solve that issue.",
      "id": "ep_58_ut_147"
    },
    {
      "end": 3033354,
      "speaker": "Moritz Stefaner",
      "start": 3029918,
      "text": "So you reduce the number of gold a bit on this one.",
      "id": "ep_58_ut_148"
    },
    {
      "end": 3048434,
      "speaker": "Dani Llugany Pearson",
      "start": 3033734,
      "text": "Yeah, no, but actually all these voting processes go into a database in order to have all the voting in case something happens. But, yeah, it was kind of a funny story.",
      "id": "ep_58_ut_149"
    },
    {
      "end": 3068850,
      "speaker": "Moritz Stefaner",
      "start": 3048554,
      "text": "Yeah. But this is often the hard things, like, to know beforehand if you build a physical system, like. Yeah. What the characteristics of that physical system should be. In a digital case, you can just rescale the axis and upload a new version or something. And in physical, the tube has this size, so you need to deal with it.",
      "id": "ep_58_ut_150"
    },
    {
      "end": 3074872,
      "speaker": "Dani Llugany Pearson",
      "start": 3068882,
      "text": "Yeah. You cannot ask the guy that is making the test tubes to re blow them in 20 minutes.",
      "id": "ep_58_ut_151"
    },
    {
      "end": 3090248,
      "speaker": "Moritz Stefaner",
      "start": 3074928,
      "text": "Exactly. Yeah, yeah. It's kind of exciting. But that also makes it very, I don't know, the whole process also more valuable and more precious because there is actually a risk to it and you can't change everything on the fly. Right. So that's kind of cool as well. Yeah.",
      "id": "ep_58_ut_152"
    },
    {
      "end": 3105734,
      "speaker": "Enrico Bertini",
      "start": 3090336,
      "text": "So I have another couple of questions. I'm wondering, first of all, if you ever thought or even done works together with scientists to help them, I don't know, making sense of some complex data sets that they have.",
      "id": "ep_58_ut_153"
    },
    {
      "end": 3106582,
      "speaker": "Moritz Stefaner",
      "start": 3105774,
      "text": "Quantum mechanics.",
      "id": "ep_58_ut_154"
    },
    {
      "end": 3122222,
      "speaker": "Enrico Bertini",
      "start": 3106678,
      "text": "Yeah, something like that. Right. I mean, there are. I mean, we all know that scientists are. Have so much interest in data, and some of them really need help. So did you think about using these physical visualization techniques to help them making sense of their data?",
      "id": "ep_58_ut_155"
    },
    {
      "end": 3166432,
      "speaker": "Dani Llugany Pearson",
      "start": 3122278,
      "text": "Totally. Yeah, totally. Now we are. We are starting a collaboration that will last for three years. I cannot say still the name of the university, but we will be working with a big team of scientists. And also we've been actually working with a scientist, a physicist, actually, for the sand falls installation. He was analyzing all the patterns that came up on the museum installation. And also, now we are still working and we are going to develop one project that we are going to work with scientists. But for now, I cannot say it online. So I'm sorry about that.",
      "id": "ep_58_ut_156"
    },
    {
      "end": 3170640,
      "speaker": "Enrico Bertini",
      "start": 3166448,
      "text": "I'm just curious if you were doing that because it looks like a natural step.",
      "id": "ep_58_ut_157"
    },
    {
      "end": 3198800,
      "speaker": "Dani Llugany Pearson",
      "start": 3170752,
      "text": "Yeah, we are doing so and totally. And it's really, really interesting, actually, it's one of our desired paths and something that we were really looking forward from the beginning. Because we believe that the work we do gets much better when we start to work with people that are not in the communication or design background. And they are more into, I don't know, all different files that can enrich the work.",
      "id": "ep_58_ut_158"
    },
    {
      "end": 3256170,
      "speaker": "Enrico Bertini",
      "start": 3198872,
      "text": "Yeah, I think this is what is really interesting of physical objects. They can much more easily be manipulated. They can be observed from different perspectives. They can be shared. And I think, as Morris was saying before, they seem to stimulate much more of a discussion. I don't know why, but I think people seems to be more prone to discussing something if they have a physical object in their hands and maybe sharing it and passing it around, even rather than having this 2d flat picture in front of a screen. I think also screens have this kind of. They communicate this idea that is something personal. I think. It's not a by chance that we call. We used to call these computers personal computers. So we believe that my screen is my screen. And if I'm looking over your shoulders, I'm intruding into your personal sphere. Right? So, which doesn't happen with physical objects.",
      "id": "ep_58_ut_159"
    },
    {
      "end": 3294506,
      "speaker": "Dani Llugany Pearson",
      "start": 3256202,
      "text": "I guess here you're saying something really interesting. I also wanted to ask that somehow we are like. I believe we are bored from being eight to 10 hours every day in front of the screen. So when we go out from the screen, the real life happens and things get more and more interesting. This is one of the parts. But you were also talking about this personal computer. And I like to add the thing that when you put something into a physical environment, people can compare it and people can discuss it. And this does not happen in front of a computer normally.",
      "id": "ep_58_ut_160"
    },
    {
      "end": 3295322,
      "speaker": "Enrico Bertini",
      "start": 3294610,
      "text": "Yeah.",
      "id": "ep_58_ut_161"
    },
    {
      "end": 3317136,
      "speaker": "Moritz Stefaner",
      "start": 3295498,
      "text": "And it just gets more weight. Something that has an object. And actually, there are actually psychological studies that relate the weight of information to the actual physical weight of the thing people hold in their hands. And people actually perceive information as more important when they have something heavy in their hand. It's an actual fact. And I think that's super interesting.",
      "id": "ep_58_ut_162"
    },
    {
      "end": 3402084,
      "speaker": "Dani Llugany Pearson",
      "start": 3317200,
      "text": "Totally, totally, totally. There is a great example, actually, in the Mundaneum museum where we were like two weeks ago, there is this guy called Polotlet, which what he did is. He's named as like the Google in paper, or kind of the Wikipedia in paper. What we. What he did, it was kind of a crazy guy that he classified like everything on paper. And actually, when you go across the room that it's full of and full and full and full of different. How do you call them? I don't know the word. Well, it's like plenty and plenty and plenty and plenty of archives that are on physical papers and you can see them, and it's crazy. And you relate that to what the Wikipedia, for example, and there is no point of comparison. When you see that information and you believe that that is much less than what the whole Wikipedia has, you then understand what's the capacity of information. And also there is this great example of this guy that what he's doing is right now, he's printing Wikipedia in different books.",
      "id": "ep_58_ut_163"
    },
    {
      "end": 3402540,
      "speaker": "Enrico Bertini",
      "start": 3402164,
      "text": "Oh, yeah.",
      "id": "ep_58_ut_164"
    },
    {
      "end": 3404620,
      "speaker": "Dani Llugany Pearson",
      "start": 3402572,
      "text": "As if it was a normal encyclopedia.",
      "id": "ep_58_ut_165"
    },
    {
      "end": 3432624,
      "speaker": "Moritz Stefaner",
      "start": 3404812,
      "text": "I saw that, too. It's like ten volumes. Like super large. Yeah. It's so interesting because on the one hand, overcoming all these physical obstacles has led to this huge information and knowledge explosion in the first place. Right. But now, in order to cope with it, we sort of. We need to come back to the physical world. So there's this really interesting tension. But if we had stayed in the physical world altogether, we would never have had all these huge data sets. So that's. I think that's.",
      "id": "ep_58_ut_166"
    },
    {
      "end": 3445284,
      "speaker": "Dani Llugany Pearson",
      "start": 3432664,
      "text": "This happens with humans. This has been happening with humans for a long time. When we have something, we don't want it and we don't. And when we don't have it, we want it again. So. Yeah, something really human, I believe.",
      "id": "ep_58_ut_167"
    },
    {
      "end": 3455554,
      "speaker": "Enrico Bertini",
      "start": 3447184,
      "text": "So. Another thing I wanted to ask you is, so now I really want to attend one of your installations. How do I do that?",
      "id": "ep_58_ut_168"
    },
    {
      "end": 3485294,
      "speaker": "Dani Llugany Pearson",
      "start": 3456014,
      "text": "Basically, on our website there is a place where you can see our upcoming installations, and you can see where they are now, as I said before, we will be having and hosting an installation in San Francisco. Now actually, there is one happening in San Francisco. Afterwards in the Netherlands. We try to travel a lot, so I believe we'll be. Or we'll try to be all around.",
      "id": "ep_58_ut_169"
    },
    {
      "end": 3486914,
      "speaker": "Enrico Bertini",
      "start": 3485374,
      "text": "Are you coming to the US?",
      "id": "ep_58_ut_170"
    },
    {
      "end": 3488798,
      "speaker": "Dani Llugany Pearson",
      "start": 3487374,
      "text": "Yes, yes, yes, yes, yes.",
      "id": "ep_58_ut_171"
    },
    {
      "end": 3490654,
      "speaker": "Enrico Bertini",
      "start": 3488846,
      "text": "Oh, you said San Francisco. Of course. Yes.",
      "id": "ep_58_ut_172"
    },
    {
      "end": 3492622,
      "speaker": "Moritz Stefaner",
      "start": 3490694,
      "text": "Sorry, wrong coast, though.",
      "id": "ep_58_ut_173"
    },
    {
      "end": 3501834,
      "speaker": "Enrico Bertini",
      "start": 3492718,
      "text": "Yeah. So this is. Can you. Can you tell everyone where to find this information in your website?",
      "id": "ep_58_ut_174"
    },
    {
      "end": 3512278,
      "speaker": "Dani Llugany Pearson",
      "start": 3502854,
      "text": "Yes, it's on the news place. There is an area where you can see the news and there you can see, like, all the upcoming events.",
      "id": "ep_58_ut_175"
    },
    {
      "end": 3513534,
      "speaker": "Enrico Bertini",
      "start": 3512366,
      "text": "Okay, nice.",
      "id": "ep_58_ut_176"
    },
    {
      "end": 3519954,
      "speaker": "Dani Llugany Pearson",
      "start": 3513654,
      "text": "And we will be happy if you fly all around to see our work. That could be great.",
      "id": "ep_58_ut_177"
    },
    {
      "end": 3523954,
      "speaker": "Enrico Bertini",
      "start": 3520934,
      "text": "Do you have any plans to do something on the east coast?",
      "id": "ep_58_ut_178"
    },
    {
      "end": 3526638,
      "speaker": "Dani Llugany Pearson",
      "start": 3524894,
      "text": "Not for now. Not for now.",
      "id": "ep_58_ut_179"
    },
    {
      "end": 3528182,
      "speaker": "Moritz Stefaner",
      "start": 3526726,
      "text": "So somebody should invite you.",
      "id": "ep_58_ut_180"
    },
    {
      "end": 3529294,
      "speaker": "Dani Llugany Pearson",
      "start": 3528238,
      "text": "But who know? Maybe.",
      "id": "ep_58_ut_181"
    },
    {
      "end": 3530194,
      "speaker": "Moritz Stefaner",
      "start": 3529414,
      "text": "Who knows?",
      "id": "ep_58_ut_182"
    },
    {
      "end": 3535878,
      "speaker": "Enrico Bertini",
      "start": 3532974,
      "text": "Yeah, cool things happen.",
      "id": "ep_58_ut_183"
    },
    {
      "end": 3536390,
      "speaker": "Dani Llugany Pearson",
      "start": 3536006,
      "text": "Yeah.",
      "id": "ep_58_ut_184"
    },
    {
      "end": 3539948,
      "speaker": "Moritz Stefaner",
      "start": 3536462,
      "text": "Who knows? I'm sure there will be some opportunity at some point.",
      "id": "ep_58_ut_185"
    },
    {
      "end": 3541352,
      "speaker": "Dani Llugany Pearson",
      "start": 3540086,
      "text": "Yeah, that for sure.",
      "id": "ep_58_ut_186"
    },
    {
      "end": 3549864,
      "speaker": "Moritz Stefaner",
      "start": 3541448,
      "text": "Great. I think we can wrap it up. That's been super fascinating, everybody. Check out the website. You need to see the photos, you need to see the videos. Then it all makes sense.",
      "id": "ep_58_ut_187"
    },
    {
      "end": 3551044,
      "speaker": "Dani Llugany Pearson",
      "start": 3549944,
      "text": "Thank you, Moritz.",
      "id": "ep_58_ut_188"
    },
    {
      "end": 3555720,
      "speaker": "Moritz Stefaner",
      "start": 3552184,
      "text": "Thanks so much for joining us. Danny, it's been fascinating. Thanks.",
      "id": "ep_58_ut_189"
    },
    {
      "end": 3556408,
      "speaker": "Enrico Bertini",
      "start": 3555912,
      "text": "Great.",
      "id": "ep_58_ut_190"
    },
    {
      "end": 3557104,
      "speaker": "Dani Llugany Pearson",
      "start": 3556496,
      "text": "Great.",
      "id": "ep_58_ut_191"
    },
    {
      "end": 3557720,
      "speaker": "Moritz Stefaner",
      "start": 3557264,
      "text": "Bye bye.",
      "id": "ep_58_ut_192"
    },
    {
      "end": 3558464,
      "speaker": "Dani Llugany Pearson",
      "start": 3557752,
      "text": "Thank you.",
      "id": "ep_58_ut_193"
    },
    {
      "end": 3584524,
      "speaker": "Enrico Bertini",
      "start": 3558624,
      "text": "Bye. Data stories is brought to you by Qlik, who allows you to explore the hidden relationships within data that lead to insights that ignite good ideas. Let your instincts lead the way to create personalized visualizations and dynamic dashboards with Qlik sense, which you can download for free at www. Dot clic dot de Datastories.",
      "id": "ep_58_ut_194"
    }
  ],
  "confidence": 0.926705672944415,
  "audio_duration": 3585,
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_status_code": null,
  "webhook_auth": false,
  "webhook_auth_header_name": null,
  "speed_boost": false,
  "auto_highlights_result": null,
  "auto_highlights": false,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_audio_quality": null,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "content_safety": false,
  "iab_categories": true,
  "content_safety_labels": {
    "status": "unavailable",
    "results": [],
    "summary": {}
  },
  "language_detection": false,
  "language_detection_threshold": null,
  "language_confidence": null,
  "custom_spelling": null,
  "throttled": false,
  "auto_chapters": true,
  "summarization": false,
  "summary_type": null,
  "summary_model": null,
  "custom_topics": false,
  "topics": [],
  "speech_threshold": null,
  "speech_model": "best",
  "chapters": [
    {
      "summary": "Data stories is brought to you by Qlik, who allows you to explore the hidden relationships within data. Let your instincts lead the way to create personalized visualizations and dynamic dashboards with Qlik sense.",
      "gist": "Qlik: Data Stories for Business",
      "headline": "Qlik allows you to explore hidden relationships within data that lead to insights",
      "start": 400,
      "end": 36624,
      "id": "ep_58_ch_0"
    },
    {
      "summary": "Enrico: Still busy with science and stuff. Fall is gonna be like big. On the one hand, I'm looking forward to going on vacation, but fall is going to be exciting. I just need a little bit of a break in between.",
      "gist": "Hi, How are you doing?",
      "headline": "Enrico: Summertime, quiet and busy. But I have a cool fall coming up",
      "start": 46444,
      "end": 105134,
      "id": "ep_58_ch_1"
    },
    {
      "summary": "Today's episode is with Dani Llugany Pearson. Dani and his colleagues took part in the data cuisine workshop we did as part of the big bang data exhibition at CCCB. Now he tells us a bit about what they are doing at domestic data streamers.",
      "gist": "Data Cuisinists",
      "headline": "Today we have a new episode with Dani Llugany Pearson",
      "start": 106314,
      "end": 204532,
      "id": "ep_58_ch_2"
    },
    {
      "summary": "Danny: We're a studio based here in Barcelona, and basically we design and develop new systems that work on capturing and visualizing data in new ways. Basically what we try to do is we go away from what's a digital visualization. We try to make things physical so people can feel them.",
      "gist": "Domestic Data Streamers",
      "headline": "Domestic data streamers is a studio based in Barcelona that works on data visualization",
      "start": 204628,
      "end": 683264,
      "id": "ep_58_ch_3"
    },
    {
      "summary": "In data string strings, every time you have a new person interacting, it's adding an element to the piece. What's nice about this kind of interactions is that you tend to generate synergies with people. This is really nice because at the end, like, placing the information somewhere in a public space allows people to generate discussion.",
      "gist": "How Do People Interact With Art?",
      "headline": "One thing I was wondering about all these projects is how people interact with them",
      "start": 683424,
      "end": 934914,
      "id": "ep_58_ch_4"
    },
    {
      "summary": "Sculptures represent data in object form. The aim is to create new ways for people to interact with data online and digitally. Each project adds one new facet to the general idea.",
      "gist": "Intersections: Sculptures and Data",
      "headline": "What makes working with these sculptures or these spaces different from digital media",
      "start": 935484,
      "end": 1323248,
      "id": "ep_58_ch_5"
    },
    {
      "summary": "We've been, like, one and a half years working on that. It's more depending on which is the solution that we have to give that we think in one path or another. Now we try to focus and understand really well.",
      "gist": "How Do You Approach New Projects?",
      "headline": "How do you approach new projects? Do you have a few ideas in the back",
      "start": 1323366,
      "end": 1390330,
      "id": "ep_58_ch_6"
    },
    {
      "summary": "Danny, I'm wondering if. you can quickly describe some of your interesting projects. Most of them are presented together with some video and really showing how it looks like in reality. I think it would be useful for our listeners to get a sense of what's the span of your projects that you have.",
      "gist": "Big Data in the Museum",
      "headline": "When I go to your website, I see so many interesting projects",
      "start": 1390442,
      "end": 1733402,
      "id": "ep_58_ch_7"
    },
    {
      "summary": "Does the golden age really exist? We wanted to see if people around thirties are happier than people around forties. This participatory aspect that people actually contribute into generating their own data point is beautiful. At the end, it's about the stories that come from those numbers.",
      "gist": "\"Does the golden age really exist?\"",
      "headline": "We wanted to see if people around thirties are happier than forties",
      "start": 1733538,
      "end": 1984774,
      "id": "ep_58_ch_8"
    },
    {
      "summary": "Qlik Sense 2.0 has a new self service data preparation tool. There's also smart data compression. And new export features that allow you to export static images. If you want to try Qlik sense, you can download it for free.",
      "gist": "Qlik Sense 2.0",
      "headline": "Click recently announced the general availability of a new version of Qlik Sense",
      "start": 1985194,
      "end": 2158598,
      "id": "ep_58_ch_9"
    },
    {
      "summary": "Barcelona-based artist uses visualization to inspire people to take action. His work is mostly commissioned, but does he earn money on each project? How does this whole market work?",
      "gist": "The Making of a Human Rights Installation",
      "headline": "Many of your projects break even or earn money on each project",
      "start": 2158726,
      "end": 2609892,
      "id": "ep_58_ch_10"
    },
    {
      "summary": "Do you think there could be a successful combination of digital overlays with analog backgrounds or digital mechanics on concrete objects? I think it's a very fascinating field. If it's done right, like, totally new things can happen.",
      "gist": "Digital vs Analog in the Studio",
      "headline": "Do you think there could be a successful combination of digital or. analog mechanics on concrete objects",
      "start": 2610028,
      "end": 2745024,
      "id": "ep_58_ch_11"
    },
    {
      "summary": "Until December, we are totally full of work. We've been traveling to more than eight or ten countries for the past year, actually developing more than 20 installations. So it's quite a bit, but. We are really happy about it.",
      "gist": "Working on the Oxfam project",
      "headline": "Your travel plans are full. And do you also travel to the places to develop the projects",
      "start": 2746384,
      "end": 2830720,
      "id": "ep_58_ch_12"
    },
    {
      "summary": "Enrico: This was crazy to develop. What we wanted to do was transform that tweet into something, into something else, into an experience. A robot that translated each vote of the participants into a drop of gold. How did you know beforehand how large to make the tubes?",
      "gist": "The Voting Machine in the Design Museum",
      "headline": "Enrico created robot that translates votes into gold tubes",
      "start": 2830752,
      "end": 3090248,
      "id": "ep_58_ch_13"
    },
    {
      "summary": "Scientists are using physical visualization techniques to help them make sense of their data. People seem to be more prone to discussing something if they have a physical object in their hands. We need to come back to the physical world to overcome all obstacles.",
      "gist": "Quantum mechanics and the Internet",
      "headline": "Did you think about using physical visualization techniques to help scientists make sense data",
      "start": 3090336,
      "end": 3445284,
      "id": "ep_58_ch_14"
    },
    {
      "summary": "Danny: On our website there is a place where you can see our upcoming installations. Do you have any plans to do something on the east coast? Not for now. But who know? Maybe.",
      "gist": "Datastories: Attend one of our installations",
      "headline": "Moritz: I really want to attend one of your installations",
      "start": 3447184,
      "end": 3584524,
      "id": "ep_58_ch_15"
    }
  ],
  "disfluencies": false,
  "entity_detection": false,
  "sentiment_analysis": false,
  "sentiment_analysis_results": null,
  "entities": null,
  "speakers_expected": null,
  "summary": null,
  "custom_topics_results": null,
  "episode_num": 58,
  "episode_metadata": {
    "speakers": [
      "Dani Llugany Pearson",
      "Enrico Bertini",
      "Moritz Stefaner"
    ],
    "WPid": "XXX",
    "url": "https://datastori.es/podlove/file/1072/s/webplayer/datastories-58.mp3",
    "episode_title": "Data Installations w/ Domestic Data Streamers"
  }
}