{
  "id": "9fc4e0a0-0c57-41fb-882d-1d9e56fa95b5",
  "language_model": "assemblyai_default",
  "acoustic_model": "assemblyai_default",
  "language_code": "en_us",
  "status": "completed",
  "audio_url": "https://datastori.es/podlove/file/435/s/feed/c/mp3/Datastories-39.mp3",
  "utterances": [
    {
      "end": 17182,
      "speaker": "Enrico Bertini",
      "start": 12040,
      "text": "Hi, everyone. Data stories number 39. Hi, Moritz. What's going on?",
      "id": "ep_39_ut_0"
    },
    {
      "end": 19206,
      "speaker": "Moritz Stefaner",
      "start": 17286,
      "text": "Hey, Enrico, how you doing?",
      "id": "ep_39_ut_1"
    },
    {
      "end": 26330,
      "speaker": "Enrico Bertini",
      "start": 19398,
      "text": "That was speed up. Speedier than usual. I'm good. And you?",
      "id": "ep_39_ut_2"
    },
    {
      "end": 36718,
      "speaker": "Moritz Stefaner",
      "start": 26950,
      "text": "Yeah, good, good, good. Scrambling to get everything together before I leave for holidays again in two weeks or so. I'm trying to pour everything out.",
      "id": "ep_39_ut_3"
    },
    {
      "end": 37782,
      "speaker": "Enrico Bertini",
      "start": 36734,
      "text": "Pour you. Poor you.",
      "id": "ep_39_ut_4"
    },
    {
      "end": 39782,
      "speaker": "Moritz Stefaner",
      "start": 37806,
      "text": "Yeah, it's a stressful life.",
      "id": "ep_39_ut_5"
    },
    {
      "end": 42610,
      "speaker": "Enrico Bertini",
      "start": 39886,
      "text": "But I am leaving as well soon. So.",
      "id": "ep_39_ut_6"
    },
    {
      "end": 49926,
      "speaker": "Moritz Stefaner",
      "start": 44190,
      "text": "Yeah, I think we will go on a summer break with data stories as well, right after this one. I think we'll take a month off.",
      "id": "ep_39_ut_7"
    },
    {
      "end": 54578,
      "speaker": "Enrico Bertini",
      "start": 50038,
      "text": "I think so. Right. We deserve it. We've been working hard this year.",
      "id": "ep_39_ut_8"
    },
    {
      "end": 55530,
      "speaker": "Moritz Stefaner",
      "start": 54694,
      "text": "Absolutely.",
      "id": "ep_39_ut_9"
    },
    {
      "end": 57590,
      "speaker": "Enrico Bertini",
      "start": 55650,
      "text": "Yeah. You guys cannot complain.",
      "id": "ep_39_ut_10"
    },
    {
      "end": 62750,
      "speaker": "Moritz Stefaner",
      "start": 59730,
      "text": "So what you doing? Any exciting stuff?",
      "id": "ep_39_ut_11"
    },
    {
      "end": 92410,
      "speaker": "Enrico Bertini",
      "start": 63450,
      "text": "Exciting stuff? Well, summary is here. It's exciting by itself. We just got notified that we had a few papers accepted at this. That's of course, pretty exciting for us. That's really, really good. And there are a couple of papers that I really am really looking forward to publish online and talk more about them because that's stuff that can be really interesting for our listeners, I guess.",
      "id": "ep_39_ut_12"
    },
    {
      "end": 94450,
      "speaker": "Moritz Stefaner",
      "start": 92750,
      "text": "So what are the topics?",
      "id": "ep_39_ut_13"
    },
    {
      "end": 108198,
      "speaker": "Enrico Bertini",
      "start": 94990,
      "text": "So we have one that has been. There is something that I've been looking into for many years, but never had enough courage to do some research. And it's on persuasion, actually.",
      "id": "ep_39_ut_14"
    },
    {
      "end": 109038,
      "speaker": "Moritz Stefaner",
      "start": 108334,
      "text": "Okay.",
      "id": "ep_39_ut_15"
    },
    {
      "end": 176858,
      "speaker": "Enrico Bertini",
      "start": 109174,
      "text": "So we started, we run a few studies trying to understand whether and when visualization is persuasive. And that's really interesting. We got some mixed results and I'm really, really excited about that. And then there is another, another thing that can be interesting for our listeners is I have a little collaboration with some guys at Indria and we've been working on visual literacy, which is actually another, another very important hot topic, I guess, because, yeah, we don't know what people understand when we show our visualizations. Right. So I think it's important to start understanding what people understand or can understand even. I mean, if you, if you go past beyond a few bar charts, which I guess for some people are still hard to understand, it's not clear what, what happens. Right. And it's not even clear how to measure that. There are no established methodologies out there. So I think that's really interesting too. But you will be at this as well, right? Your organization?",
      "id": "ep_39_ut_16"
    },
    {
      "end": 209072,
      "speaker": "Moritz Stefaner",
      "start": 176914,
      "text": "Yeah, I sort of have to. Somebody talked me into it. No, I handed in two proposals and they were both accepted. So we will, Dominicus, who we also had on the show for the moment, and I, we will do a tutorial on web based visualizations and we will treat everything except I like visualizing data, everything that needs to go around it. Like how do you promote the visualization, how does it need to work so it looks good on Facebook? How do you track your users?",
      "id": "ep_39_ut_17"
    },
    {
      "end": 210744,
      "speaker": "Enrico Bertini",
      "start": 209256,
      "text": "Oh, that's really interesting.",
      "id": "ep_39_ut_18"
    },
    {
      "end": 218328,
      "speaker": "Moritz Stefaner",
      "start": 210872,
      "text": "All the secret practical stuff, responsiveness and performance optimization. So everything except the D3 tutorial part.",
      "id": "ep_39_ut_19"
    },
    {
      "end": 220420,
      "speaker": "Enrico Bertini",
      "start": 218384,
      "text": "Oh, that's really cool. I like it.",
      "id": "ep_39_ut_20"
    },
    {
      "end": 248490,
      "speaker": "Moritz Stefaner",
      "start": 220720,
      "text": "And we thought that's a good thing to, to talk about. And we collected some experiences and we will share it in a tutorial. And the second one is a panel with all the big ngo's I've been working with like OECD, World Economic Forum, World bank and so on. And so we will talk a bit about the challenges for data visualization in these contexts, what it means for these organizations to put data out there and how they do it and how they could improve things like that.",
      "id": "ep_39_ut_21"
    },
    {
      "end": 249934,
      "speaker": "Enrico Bertini",
      "start": 248610,
      "text": "Oh, that's going to be cool.",
      "id": "ep_39_ut_22"
    },
    {
      "end": 253878,
      "speaker": "Moritz Stefaner",
      "start": 250042,
      "text": "Yeah. Yes. We'll see you in Paris.",
      "id": "ep_39_ut_23"
    },
    {
      "end": 275010,
      "speaker": "Enrico Bertini",
      "start": 254054,
      "text": "Yeah, Paris is going to be really, really cool. I'm so much looking forward to it. Yeah. Okay, let's move on to our special guest today we're gonna have an Italian show. Benvenuto to Paolo Cucciarelli from density design. Hi, Paolo. Ciao, Paolo.",
      "id": "ep_39_ut_24"
    },
    {
      "end": 276998,
      "speaker": "Paolo Ciuccarelli",
      "start": 275350,
      "text": "Hi, Enrico. Hi, Moritz.",
      "id": "ep_39_ut_25"
    },
    {
      "end": 278822,
      "speaker": "Enrico Bertini",
      "start": 277054,
      "text": "Hey, Paolo, how are you?",
      "id": "ep_39_ut_26"
    },
    {
      "end": 286948,
      "speaker": "Paolo Ciuccarelli",
      "start": 278926,
      "text": "I. Fine, fine. Is evening here is almost raining. Raining. Crazy weather here.",
      "id": "ep_39_ut_27"
    },
    {
      "end": 290868,
      "speaker": "Enrico Bertini",
      "start": 287004,
      "text": "Raining in Italy in July, end of July tv raining.",
      "id": "ep_39_ut_28"
    },
    {
      "end": 294924,
      "speaker": "Paolo Ciuccarelli",
      "start": 290964,
      "text": "We have a weather that is more similar to London or Paris.",
      "id": "ep_39_ut_29"
    },
    {
      "end": 296440,
      "speaker": "Moritz Stefaner",
      "start": 295052,
      "text": "I don't know what's happening.",
      "id": "ep_39_ut_30"
    },
    {
      "end": 310658,
      "speaker": "Paolo Ciuccarelli",
      "start": 297500,
      "text": "Evidences of this climate change and global warming phenomenon. Have you heard about it? It's coming. Really impressive. It's impressive. Nothing. Yeah, really strange.",
      "id": "ep_39_ut_31"
    },
    {
      "end": 312962,
      "speaker": "Enrico Bertini",
      "start": 310714,
      "text": "Yeah. We should visualize that, by the way.",
      "id": "ep_39_ut_32"
    },
    {
      "end": 330290,
      "speaker": "Paolo Ciuccarelli",
      "start": 313146,
      "text": "Yeah. Variation in temperature and everything. Yeah, it could be nice and useful, especially apart from that. It's going well. I'm here in my office and. Yeah. Waiting for this very special moment. Finally.",
      "id": "ep_39_ut_33"
    },
    {
      "end": 332050,
      "speaker": "Moritz Stefaner",
      "start": 330330,
      "text": "Finally we should say we've been chasing you.",
      "id": "ep_39_ut_34"
    },
    {
      "end": 348770,
      "speaker": "Enrico Bertini",
      "start": 332090,
      "text": "We've been chasing you for a long time. You are the busiest person ever. So you are apparently busier than what Ben Shneiderman and all the other guys we had here.",
      "id": "ep_39_ut_35"
    },
    {
      "end": 364502,
      "speaker": "Paolo Ciuccarelli",
      "start": 349310,
      "text": "I'm probably not as good as all these people in organizing my time and managing my stuff. I'm especially not good in saying no. So you know that it means creating.",
      "id": "ep_39_ut_36"
    },
    {
      "end": 367094,
      "speaker": "Enrico Bertini",
      "start": 364646,
      "text": "Yeah, I know this problem very well.",
      "id": "ep_39_ut_37"
    },
    {
      "end": 386160,
      "speaker": "Paolo Ciuccarelli",
      "start": 367262,
      "text": "Energy consuming activities. I mean, as you now, I'm in charge for different things in terms of, you know, institutional duties here at university. So yeah, it's more, more challenging and time consuming, energy consuming than I expected. So that's mainly the reason.",
      "id": "ep_39_ut_38"
    },
    {
      "end": 388028,
      "speaker": "Moritz Stefaner",
      "start": 386580,
      "text": "And you have a big family too.",
      "id": "ep_39_ut_39"
    },
    {
      "end": 391276,
      "speaker": "Paolo Ciuccarelli",
      "start": 388084,
      "text": "So we can have a family and some other.",
      "id": "ep_39_ut_40"
    },
    {
      "end": 393040,
      "speaker": "Enrico Bertini",
      "start": 391308,
      "text": "We all sympathize with that.",
      "id": "ep_39_ut_41"
    },
    {
      "end": 395548,
      "speaker": "Paolo Ciuccarelli",
      "start": 394820,
      "text": "Three kids.",
      "id": "ep_39_ut_42"
    },
    {
      "end": 400720,
      "speaker": "Moritz Stefaner",
      "start": 395604,
      "text": "Can you tell us a bit about like your background and what you do?",
      "id": "ep_39_ut_43"
    },
    {
      "end": 523359,
      "speaker": "Paolo Ciuccarelli",
      "start": 401740,
      "text": "Well, I'm currently associate professor at Politecnico di Milano here. It's a polytechnic university where there are three different areas, engineers and architects and designers. Actually, designers are the youngest in the middle, I would say, trying to merge the two worlds of engineers and architects. And I more or less, I never left university, I would say seriously in the sense I graduated here, polytechnic in architecture was long ago, 1996, and well, I had at that time, I had an agency, communication agency, with some friends, because communication has been always my passion, but I had always contacted the university, so I started with some contracts for research and then the time where the school of design has been created, I was there. So that was a very positive moment for being in university because a totally new branch opened. We started with product design and then after a couple of years with communication design, it was a new territory entirely. So that was my, I was lucky, I had to say, being the right moment in the right place, and there was a need of people teaching and doing research. And so that's how I came to university. Well, I always been there and I decided on a certain point to close this agency. And yeah, then I'm here, I'm now leading also the program of communication design on bachelor and master level. And all the time is, is here at university both on teaching and doing research with density design. And yeah, I live here 24 hours a day.",
      "id": "ep_39_ut_44"
    },
    {
      "end": 528939,
      "speaker": "Moritz Stefaner",
      "start": 525379,
      "text": "But did I get that right, that your original background is in architecture?",
      "id": "ep_39_ut_45"
    },
    {
      "end": 531307,
      "speaker": "Paolo Ciuccarelli",
      "start": 528979,
      "text": "Actually, yeah, it's architecture, yeah.",
      "id": "ep_39_ut_46"
    },
    {
      "end": 533479,
      "speaker": "Moritz Stefaner",
      "start": 531483,
      "text": "And have you ever built a house or.",
      "id": "ep_39_ut_47"
    },
    {
      "end": 640510,
      "speaker": "Paolo Ciuccarelli",
      "start": 534419,
      "text": "I did, I did two or three projects, but then I realized by practice that was not my, my job. I really like, and I'm really happy after 20 years from my background, I think it's really, really important. I mean, it's something that is really helping me in doing what I do today. And, you know, architecture is about space, it's about organizing things on space, real space, 3d space, and that's, I think, really important. When you do visualization, when you do data and information visualization, it's about organizing things in space basically at the first level. Then, then you work with all the other variables, but as a starting point, you have the space, the plane or the 3d space, and then you put things on that. So I think it's, and what is also important, I think, is the humanistic side of architecture, so that's very important. When you study phenomenon phenomena like cities or, you know, social phenomena, well, there is a lot, I think, in this kind of background. And I'm really happy, really. Even if I just did a couple of projects and just realized that was not my career, but I'm happy, definitely. And, you know, you realize after years the importance of what you do in university. That's what I always teach, say to my students, you will see, will realize once in some years that you are doing something important.",
      "id": "ep_39_ut_48"
    },
    {
      "end": 642110,
      "speaker": "Moritz Stefaner",
      "start": 640890,
      "text": "It works.",
      "id": "ep_39_ut_49"
    },
    {
      "end": 643610,
      "speaker": "Paolo Ciuccarelli",
      "start": 642450,
      "text": "Sometimes I come back.",
      "id": "ep_39_ut_50"
    },
    {
      "end": 688138,
      "speaker": "Enrico Bertini",
      "start": 643690,
      "text": "Yeah, I think it's true for in many cases, when you go to university, you learn stuff, right? You go through so many books and notes and lectures, but then these are just little seeds that you plan there. It's not who you're going to be, necessarily. Right? It's just these little seeds. There's so many ways to let these seeds blossom. And I think in a way it's true for myself as well. I mean, I've been doing so much. So I have a degree in computer engineering. I've been doing stuff like electronics, super hard stuff. I will never use this stuff again. Right. But in a way, you have these little seeds that grow inside you. And I don't know, I think there is a value to that.",
      "id": "ep_39_ut_51"
    },
    {
      "end": 894932,
      "speaker": "Paolo Ciuccarelli",
      "start": 688174,
      "text": "That, yeah. And more importantly, I would say it's starting. Architecture is one course in architecture that brought me to density design. So it's when I started, I don't know if it's the right topic in the right moment, but I think it's connected to my background. In fact, if today density design exists, it's because of a course I had in architecture. It was a course about architectural technologies, you know, technical stuff. But the professor decided to teach us something about the theory and the philosophy of complexity, something that was totally far from any technical element of architecture. But it was the time where I. The bibliography of the course was Edgar Moran and the method for complexity and Pregozin Capra, all these features of Capra, all these philosophers of complexity. And I was totally, I cannot say, excited by this new approach to the world. And it really changed my life. And that was the starting point for density design. When I started in 2004 with my studio, the name was density design. It was a course, it was a studio course in the master level. The starting point was complexity. And was the idea that maybe visualization, visual language, could be useful in trying to. Not to reduce too much complexity and to bring this complexity in the hands of decision makers, let's say. So I realized that the world is complex, and so what can we do with the competencies of designers to try to not to reduce this complexity, because it's a richness, and to bring this complexity in the hands of people that can do something on society. That was a starting point. There was nothing about data, nothing about information. I was not aware of the existence of data in 2004. And so it started from this kind of perception, this kind of approach to the world. And it was, for me, I was more impressed by. I remember the exact moment when I saw something that was called cyber geography or something like that. A website where you could find all the maps of the Internet, of the Internet. I know this one, the first maps of Internet. And I got fascinating by these visual shapes, and I said, okay, that's complexity. This is the visualization of complexity I can try to work with in order to make this complexity available, usable, accessible for a broader audience. So that was a starting point. And then after, and after I discovered data, I can't even remember why and how, but honestly, nobody does.",
      "id": "ep_39_ut_52"
    },
    {
      "end": 895920,
      "speaker": "Enrico Bertini",
      "start": 895036,
      "text": "Don't worry.",
      "id": "ep_39_ut_53"
    },
    {
      "end": 937448,
      "speaker": "Paolo Ciuccarelli",
      "start": 897100,
      "text": "I came to data, but it was really, at the beginning was about. I started with diagrams as conceptual and visual devices in order to, you know, explore the reality was something more kind of more philosophical, and was this. Using these visual shapes, these forms, these structures, in order to, you know, connect elements and to recreate the complexity of phenomena. So it was really, that was starting point and what else? This is a connection between what I am today and how density design started and my background.",
      "id": "ep_39_ut_54"
    },
    {
      "end": 940832,
      "speaker": "Enrico Bertini",
      "start": 937584,
      "text": "So density design started in 2004, you.",
      "id": "ep_39_ut_55"
    },
    {
      "end": 1084280,
      "speaker": "Paolo Ciuccarelli",
      "start": 940856,
      "text": "Said, as a course, it was the title that I gave to the course. And now, after years, I have also an explanation for the title. We want to hear that. That's something I learned in architecture, because you discovered that all the wonderful sketches that you see in the magazines that all have been drawn after, so they were not the starting point that the architects normally draw for, you know, for the magazines after, because it looks nice to have some sketches. Then you tell yourself, yeah, napkin. It was. I was drinking wine with friends and it was this. But no, it's. Yeah. The explanation is actually the density we are talking about is the relationship between the complexity that is growing in the sense that in the evidence is more and more evident that the world is complex. So it's growing in our perception, the complexity, but on the same time, we have less and less time to decide on that. So complexity is growing, time is shrinking, shrinking and multiplied by a factor to make it more complex, a factor that I. It's the cultural distance of all the stakeholders that are involved in decisions so likely the decision processes are opening, so you have more and more people involved. The table is growing, you have many people sitting around this table, but it makes the thing, the process more complex. So you have, you know, distances in terms of cultural background, strategic objectives and so on. So it makes multiply the relationship and the ratio between complexity and time. So this is the explanation I invented for. But it's true, you invented it after. After deciding on the name, certainly after, yes. All the people here say that I invent before the box and the label, and then I start thinking to the content, how to fill it. I'm a communication designer. I mean, I'm very close to branding and it's normal, probably.",
      "id": "ep_39_ut_56"
    },
    {
      "end": 1101030,
      "speaker": "Enrico Bertini",
      "start": 1084440,
      "text": "So is the main goal of density design actually developing? I don't know. I don't want to put words in your mouth, but actually creating tools to access this complexity or what. What's the vision there?",
      "id": "ep_39_ut_57"
    },
    {
      "end": 1211790,
      "speaker": "Paolo Ciuccarelli",
      "start": 1101730,
      "text": "Yeah, we try to keep, as much as possible, this vision alive, but you can understand, you can imagine, I mean, it's not always possible to start from this kind of philosophical level, then. Yeah, it depends on who is the person that you have in front of you. I mean, you can start talking about data visualization or infographics even, or if you have the right person talking about the complexity of the phenomenon they are managing and try to come to. But in any case, I try to really, in any case to convey the idea that we don't do really data visualization in the proper sense, because that's not something we are trained for. I mean, we are designers, so we don't do information and data visualization in the proper sense, in the literary sense, we are always in the middle. There is a need, there is a kind of need that is emerging and there is an opportunity that in our case is more or less often about data and information, and we are in the middle to try to merge these two poles and find kind of solutions. Creating interfaces, that's what we do. Yeah, but I often use the. A description that says, I mean, we are here to create interfaces and visual representation that makes the complexity of the phenomenon you are managing visible, accessible and usable. So that's something I say a lot. So it means that we have probably the right person on the other side. But yes, sometimes you can use it, even if it sounds a bit complicated.",
      "id": "ep_39_ut_58"
    },
    {
      "end": 1264100,
      "speaker": "Enrico Bertini",
      "start": 1212240,
      "text": "Yeah, I really like this idea, Paolo, because I think this way of looking at visualization as a tool to actually expose complexity of many phenomena to more people. Right. I think that for, I mean, looking into data is not a new thing. I mean, statisticians have been doing that for ages. But at the same time, as you were saying, I think that we've been growing into a culture of compressing this data down to a number or two. Right. And for the first time, the way I see it is that visualization is a tool that. Yeah, I really like what you said. It's a tool that actually allows people to open the box a little bit and let people look into it. Right.",
      "id": "ep_39_ut_59"
    },
    {
      "end": 1346184,
      "speaker": "Paolo Ciuccarelli",
      "start": 1265050,
      "text": "Yeah. And the interesting fact, and is that I really find, again, something about this idea in the projects we do very, very recently, for example, with the work we are doing with people from humanities, I find a lot of this issue. I think mostly all the issues and the problems they bring to us are these kind of problems. They see the phenomenon they are studying as a complex phenomenon. There are some dimensions of this phenomenon that are hidden behind the visualization tools they have. So they need something that can expose, that can make visible these dimensions that they don't see in the actual tools they are using. But maybe this is a topic we can deepen after. I don't know. But it's interesting for me that it was a kind of a vision started in a kind of a very intuitive way. And even after ten years, we will celebrate in autumn ten years of existence of the title, and after ten years, it's still there. And so probably it's something that makes sense.",
      "id": "ep_39_ut_60"
    },
    {
      "end": 1350580,
      "speaker": "Moritz Stefaner",
      "start": 1346272,
      "text": "It will stick around for a while. I think it's going to be around for a while.",
      "id": "ep_39_ut_61"
    },
    {
      "end": 1354140,
      "speaker": "Paolo Ciuccarelli",
      "start": 1351600,
      "text": "I have this also, this suspect.",
      "id": "ep_39_ut_62"
    },
    {
      "end": 1405452,
      "speaker": "Moritz Stefaner",
      "start": 1355160,
      "text": "I think it's very interesting. I always found it very interesting how the lab operates, because in one way it's a very, as you said, you're designers, so of course you research through doing practical works, because design is an applied thing. Right. But at the same time, we don't have these labs in Europe usually. So I wouldn't be aware of any other design, applied design research lab, you know, for instance, in Germany. So some companies have it. I feel. So I feel what you do is actually closer to what maybe a Google lab or an HP lab might do. You know, in spirits, like trying out stuff, working with stakeholders to solve specific problems. But on a visionary level, maybe. Is that a fair characterization or how would you see it?",
      "id": "ep_39_ut_63"
    },
    {
      "end": 1459202,
      "speaker": "Paolo Ciuccarelli",
      "start": 1405476,
      "text": "Sounds great. I think there is, I would say, a technical reason behind that. Yes, it's true that I search for similar models, even to get inspired, because after and after the lab grows. And sometimes, really, I felt like the need of searching for a model. So how can I. Should I manage this. This thing, I mean, what is it? Whatever it is, how should it work? I mean, what is it? So we decided on a certain point to call it a research lab, but in design, in fact, the problem is that, yeah, there is no one other school, I think, in Europe that has the same size as Politecnico. We have 3500 students in design. It's quite big.",
      "id": "ep_39_ut_64"
    },
    {
      "end": 1460172,
      "speaker": "Moritz Stefaner",
      "start": 1459266,
      "text": "Huge, yeah.",
      "id": "ep_39_ut_65"
    },
    {
      "end": 1475460,
      "speaker": "Paolo Ciuccarelli",
      "start": 1460306,
      "text": "And we have a PhD in design that is also again, quite unique. For example, in France it doesn't exist. A PhD in design in the country and in other countries you have a PhD in design, but it's very small.",
      "id": "ep_39_ut_66"
    },
    {
      "end": 1485536,
      "speaker": "Moritz Stefaner",
      "start": 1475840,
      "text": "In Germany it's difficult to. You have to basically do a philosophical degree or something like this with a design twist to it, something like this.",
      "id": "ep_39_ut_67"
    },
    {
      "end": 1563040,
      "speaker": "Paolo Ciuccarelli",
      "start": 1485688,
      "text": "In Italy we have this very peculiar PhD in design and it exists even before the school of design. So it's something that's been created in architecture before the existence of the school of design. And so it's, I think it has, I don't know, 25, 28 years of history. So it's very long, longer than design education in university. But this is. I mean, for me it's very important. I can't have a research lab without PhD students. And it's something that. It's a quite unique combination. And then I have also this master level in communication design where I have a studio, it's the final studio, so it's where people spend a lot of time in one specific project. So it's like an ecosystem that is difficult to replicate somewhere else. That's also why I sometimes feel like caged here, because I could move with this organization. It's very different. It has to be. Yeah, it has in a way, it has to be here. And at the moment I couldn't find any other place. I mean, maybe it's just a matter of searching better, but yeah, so far I have the same feeling, the same impression as you have.",
      "id": "ep_39_ut_68"
    },
    {
      "end": 1567440,
      "speaker": "Enrico Bertini",
      "start": 1563820,
      "text": "Yeah. And there is a long tradition of design at Politecnico.",
      "id": "ep_39_ut_69"
    },
    {
      "end": 1577970,
      "speaker": "Paolo Ciuccarelli",
      "start": 1568660,
      "text": "Yes, but all the, you know, the main. The masters of design, they're very known people in design are all architects. So design was.",
      "id": "ep_39_ut_70"
    },
    {
      "end": 1580710,
      "speaker": "Enrico Bertini",
      "start": 1578050,
      "text": "But I guess fashion is also big there, right?",
      "id": "ep_39_ut_71"
    },
    {
      "end": 1592190,
      "speaker": "Paolo Ciuccarelli",
      "start": 1581490,
      "text": "As an industry, yes. And we have also a fashion design degree since, I don't know, maybe five, six years. It's new, but it's working very well.",
      "id": "ep_39_ut_72"
    },
    {
      "end": 1602730,
      "speaker": "Enrico Bertini",
      "start": 1593490,
      "text": "It would be cool to have clothes with visualizations on top. Wearable is the next big thing, right?",
      "id": "ep_39_ut_73"
    },
    {
      "end": 1629948,
      "speaker": "Paolo Ciuccarelli",
      "start": 1602850,
      "text": "Yeah, but I started with. With jewelry. They're producing some very nice jewels that are produced with, you know, this 3d printings machine. Yeah. Printing with metals and so in jewelry, they started doing something like that. So you have basically data and a form that is created out of data. So that's. Yeah, I think we will work together later.",
      "id": "ep_39_ut_74"
    },
    {
      "end": 1649336,
      "speaker": "Enrico Bertini",
      "start": 1630004,
      "text": "It just occurred to me that you could actually wear monitor of some sort that gives some representation of your biological signals so people can see when you are angry or whatever. Right. It's kind of like very dangerous kind of device. But that would be interesting.",
      "id": "ep_39_ut_75"
    },
    {
      "end": 1652220,
      "speaker": "Paolo Ciuccarelli",
      "start": 1649368,
      "text": "Yeah, I can see some very dangerous drifts.",
      "id": "ep_39_ut_76"
    },
    {
      "end": 1657744,
      "speaker": "Enrico Bertini",
      "start": 1656160,
      "text": "Anyway, sorry for you.",
      "id": "ep_39_ut_77"
    },
    {
      "end": 1675120,
      "speaker": "Moritz Stefaner",
      "start": 1657752,
      "text": "When you're angry, they might have to use. No, but like variables or objects. I think it's super interesting. And maybe then your architectural education comes full circle, if you like, put it back into spaces and so on.",
      "id": "ep_39_ut_78"
    },
    {
      "end": 1746830,
      "speaker": "Paolo Ciuccarelli",
      "start": 1675200,
      "text": "Yeah. In fact, I have to say that it's something that we didn't do a lot. So I think there is space for something more in terms of physical things and creating something physical out of data. That's something we tried two, three times with students. We made some exercises. I think we can definitely do more, especially because if you want really to go public with data, I think there is nothing better than exhibition in a space where people can touch and really feel physically the data. I think that is really working. And we had a workshop this year with Carl DeSalvo. I don't know if you know him. He's a professor in Caltech, in Georgia Tech. And. Georgia Tech, sorry. It was really about putting data on giving data to the public. So really creating engaging situation for citizens. And it was everything naturally, I would say, became physical and tangible and interactive, and it was very interesting.",
      "id": "ep_39_ut_79"
    },
    {
      "end": 1757970,
      "speaker": "Enrico Bertini",
      "start": 1748350,
      "text": "So can you tell us a little bit more about how the lab works? So you have, I guess you have how many PhD students you have on average? Is it more?",
      "id": "ep_39_ut_80"
    },
    {
      "end": 1766558,
      "speaker": "Paolo Ciuccarelli",
      "start": 1758630,
      "text": "It depends. Now is two, because Giorgia Lupi just finished.",
      "id": "ep_39_ut_81"
    },
    {
      "end": 1767610,
      "speaker": "Enrico Bertini",
      "start": 1766614,
      "text": "Oh, yeah, sure.",
      "id": "ep_39_ut_82"
    },
    {
      "end": 1777518,
      "speaker": "Paolo Ciuccarelli",
      "start": 1768710,
      "text": "One of the PhD students I had in my lab, but I think the maximum I had in, you know, in parallel was for PhD students.",
      "id": "ep_39_ut_83"
    },
    {
      "end": 1782282,
      "speaker": "Enrico Bertini",
      "start": 1777574,
      "text": "Okay, but I guess you also have master's students. Must be a mix of students there.",
      "id": "ep_39_ut_84"
    },
    {
      "end": 1812698,
      "speaker": "Paolo Ciuccarelli",
      "start": 1782426,
      "text": "Well, basically I have PhD students, and then I have research contracts, people that do research and I pay with projects. We have. Then I have. There are interns, students that decide to spend their internship in the lab, and we start having also internship from abroad. And that's very interesting. So we had a, the last one was from Germany, from the Kohl International School of Design.",
      "id": "ep_39_ut_85"
    },
    {
      "end": 1813510,
      "speaker": "Moritz Stefaner",
      "start": 1812754,
      "text": "Oh, nice.",
      "id": "ep_39_ut_86"
    },
    {
      "end": 1835440,
      "speaker": "Paolo Ciuccarelli",
      "start": 1814250,
      "text": "People from students from France, from Portugal. And that's very interesting. Fertilization is very important. And then there is this integration with teaching. So in the studio we always bring some research topics and we challenge students with very level problems.",
      "id": "ep_39_ut_87"
    },
    {
      "end": 1845200,
      "speaker": "Enrico Bertini",
      "start": 1836340,
      "text": "So let's say I'm a student and I want to work with you. I want to come to Milan and work at density design. How does this work?",
      "id": "ep_39_ut_88"
    },
    {
      "end": 1880750,
      "speaker": "Paolo Ciuccarelli",
      "start": 1846140,
      "text": "You can apply for the PhD if it's a long relationship that you're searching for, or you can apply for an internship and that's another possibility. Or maybe that's for a student. But if you. There are also other ways. I think we didn't try with research contracts for people abroad, but this could be a way. I think it depends also on the salary. In Italy we are probably not as competitive as in other countries in terms of salary for research.",
      "id": "ep_39_ut_89"
    },
    {
      "end": 1886550,
      "speaker": "Enrico Bertini",
      "start": 1881170,
      "text": "Yeah, but we have good food, lots of good things.",
      "id": "ep_39_ut_90"
    },
    {
      "end": 1899456,
      "speaker": "Paolo Ciuccarelli",
      "start": 1887240,
      "text": "I can provide something else, some benefits that could be interesting. Yeah. At the moment I have more research contracts than PhD students.",
      "id": "ep_39_ut_91"
    },
    {
      "end": 1900620,
      "speaker": "Moritz Stefaner",
      "start": 1899648,
      "text": "Interesting.",
      "id": "ep_39_ut_92"
    },
    {
      "end": 1903820,
      "speaker": "Enrico Bertini",
      "start": 1901040,
      "text": "How does. Oh, sorry for interrupting.",
      "id": "ep_39_ut_93"
    },
    {
      "end": 1929730,
      "speaker": "Paolo Ciuccarelli",
      "start": 1904320,
      "text": "Since two years I have a research contract that is on a person that has a different background. So he's not a designer computer scientist. So that was new. But it's a very interesting, and I would say necessary integration. So it's working very well. And I think in the future we will have more of these profiles in the lab.",
      "id": "ep_39_ut_94"
    },
    {
      "end": 1981700,
      "speaker": "Moritz Stefaner",
      "start": 1930870,
      "text": "One practical question, especially in the beginning. So I've been following your work, I think for eight of these ten years or something. And in the beginning I think especially there was a very coherent style to the output of density design lab. And I was always sure it's only two or three people, like maximum, because it was so coherent visually. But then I learned it's, wow, it's ten people and it's all kinds of levels of qualifications and I found that very interesting. Did that emerge on its own or did you really try and coin a certain visual style first to establish a certain voice? I found that very striking and very unique, like you would see like a poster design from density and was immediately clear. Yeah, it's density design lab, right.",
      "id": "ep_39_ut_95"
    },
    {
      "end": 2009362,
      "speaker": "Paolo Ciuccarelli",
      "start": 1982880,
      "text": "Well, probably it's emerging on its own, so it's not planned at all. So there is nothing. I never probably, I never discuss anything about style or, you know, it's. There's never been a kind of a. An issue for us. So I think it's totally merging as a, you know, by, by itself. So there is. It's not. Not at all an issue, I would say.",
      "id": "ep_39_ut_96"
    },
    {
      "end": 2012674,
      "speaker": "Moritz Stefaner",
      "start": 2009506,
      "text": "So a self reinforcing process more or.",
      "id": "ep_39_ut_97"
    },
    {
      "end": 2041798,
      "speaker": "Paolo Ciuccarelli",
      "start": 2012682,
      "text": "Less, yeah, I think it's. It's part of the tacit knowledge inside the lab. So there is a kind of a continuity, but I think it's part of the, of some kind of imitation process inside. And maybe people that start working on a certain organization maybe, probably try to imitate, you know, to imitate what, what people do in this lab. I don't know, maybe. But in any case it's autonomous. So there is no strategy, no plan, no specific, there has never been a.",
      "id": "ep_39_ut_98"
    },
    {
      "end": 2044250,
      "speaker": "Moritz Stefaner",
      "start": 2041814,
      "text": "Style guide, no density design style guide.",
      "id": "ep_39_ut_99"
    },
    {
      "end": 2092226,
      "speaker": "Paolo Ciuccarelli",
      "start": 2044590,
      "text": "Absolutely no. But if you think, I mean, if you, I think that if you go in the website that is totally not updated, I mean, you can, you can still see some visualizations that are of probably on the opposite, if you see something of some of the recent works, on a certain point we started playing with very illustrative and very figurative visualizations and it was really, but it was an attempt, it was part of a certain period and we really tested the limit of these visual backgrounds that could serve as a context for data. But it was really, we produced something very, very, it was more like piece of art and illustration, like for the.",
      "id": "ep_39_ut_100"
    },
    {
      "end": 2095098,
      "speaker": "Moritz Stefaner",
      "start": 2092298,
      "text": "Wired, the wired future vision scenarios.",
      "id": "ep_39_ut_101"
    },
    {
      "end": 2131610,
      "speaker": "Paolo Ciuccarelli",
      "start": 2095234,
      "text": "Absolutely. This kind of stuff, we did that for, you know, for one, two years and it was, what is interesting is that this kind of visualization are still there and you still find people that search for us for these kind of things that we are no more able to do. And even I would say we don't want to do because it's so far from what we do today and especially because it was really linked to the competencies of a person that is no more working with us today. So. But you have, if you browse the website and you don't know anything, you really can.",
      "id": "ep_39_ut_102"
    },
    {
      "end": 2143874,
      "speaker": "Moritz Stefaner",
      "start": 2132870,
      "text": "I think the flickr stream should be the best source to understand the whole history. Right. Is it still like maintained the flicker feed because this is where most of the works were at least?",
      "id": "ep_39_ut_103"
    },
    {
      "end": 2161178,
      "speaker": "Paolo Ciuccarelli",
      "start": 2143922,
      "text": "Yeah. I'm not really happy of how we manage our communication tools and. Yeah, the website, the Flickr account, everything, it's totally, we have to do something on that. But you know how it works. Never have time for your own stuff.",
      "id": "ep_39_ut_104"
    },
    {
      "end": 2171450,
      "speaker": "Moritz Stefaner",
      "start": 2161274,
      "text": "Nobody's happy with that for themselves, I think. But for me, the Flickr stream has been a good reference always, like when looking for what has been done around the lab.",
      "id": "ep_39_ut_105"
    },
    {
      "end": 2177930,
      "speaker": "Paolo Ciuccarelli",
      "start": 2172150,
      "text": "Okay, that's an interesting feedback. Thank you.",
      "id": "ep_39_ut_106"
    },
    {
      "end": 2270910,
      "speaker": "Enrico Bertini",
      "start": 2179670,
      "text": "Yeah. But I really like the fact that that's the thing I like about designers doing visualization. The idea that. So I myself, I come from, my background is engineering, computer science. And it's been always so frustrating for me to see how a lot of good tools and visualizations out there just look so ugly that there's no way anyone is going to be attracted by it. Right. And what really worried me is also it's not just that, it's also the fact that there are a, that wear a lot of people out there saying, oh, but that's, that's just design. Right? I hate that this just design is, is so, I mean, I cannot say the word that I want to say. I mean it's, it doesn't make any sense. Right. And I think there is so much value in these on having people like you that actually come from a completely different kind of starting point. Right. So that's what I like of some of the visualizations that come from your lab, that they are really catchy, attractive, but in a way that is not just, let's put a thousand different colors here, right. It's not junk food. You can see that there is a design process out there behind that. And this is something that I don't know how to teach to people who have different backgrounds.",
      "id": "ep_39_ut_107"
    },
    {
      "end": 2393678,
      "speaker": "Paolo Ciuccarelli",
      "start": 2272220,
      "text": "Yeah, I think it's really a challenge and maybe it's not by chance that there is no, as far as I know, no specific programs that try to merge all these competencies. So for example, try to teach design to computer scientists or try to teach really computer science to design in a very specific way, especially for data visualization. I think there is a kind of a lack of, and maybe nobody still developed kind of a method for merging these two disciplines that have very different roots. I think it would be one of the challenges for education in this field. So how to merge effectively, it is to domain and to teach in a very effective way because we have one or two courses in computer science, let's say, or something like that, programming and. But they are not effective in the sense that students don't get the sense of it. They don't get the real meaning, the real spirit and the usefulness of these competencies. And it's really a pity because at the end they ate programming. For me it's a disaster because at the end I teach 50 students every year in this field and I hardly can find five, six of them that have an interest in something like programming. And out of this five or six, maybe one or two are really able to develop a real competence on that side. And so there is really luck and this is what actually the market is searching for. And, you know, so this is my institutional part of me that is talking about teaching programs and I really see a gap, a whole that should be I think filled. So I perfectly understand your feeling. And I have the same feeling on the other side, I think.",
      "id": "ep_39_ut_108"
    },
    {
      "end": 2403478,
      "speaker": "Moritz Stefaner",
      "start": 2393734,
      "text": "So maybe the faculties should give each other workshops. Right? So the computer scientists could give workshops for the designers and vice versa. I mean.",
      "id": "ep_39_ut_109"
    },
    {
      "end": 2469830,
      "speaker": "Enrico Bertini",
      "start": 2403654,
      "text": "Yeah, honestly. So I don't think that. Of course, I don't think that the solution is to make sure that everyone is. Is knowledgeable about everything. Because I don't think that's gonna work. I want designers to be designers and computer scientists to be computer scientists. Right. But at the same time, I think the challenge there. So I can tell you from my side, I would love to have something like design rules for computer scientists. Right. And conversely, programming for designers. Right? And I don't see that happening at any reasonable scale. And I would love to have that. And I don't know how to make it happen. Maybe me and you, Paolo and Moritz, as well, we should. We should, I don't know, find a solution to that. No, but seriously, very practically speaking, I. So next time, I'm gonna teach my students, I always think about, I want these people to create things that are a little more beautiful than they are. And I don't know how to do it because I don't have tools to do that. I don't know how to do it.",
      "id": "ep_39_ut_110"
    },
    {
      "end": 2490774,
      "speaker": "Paolo Ciuccarelli",
      "start": 2472250,
      "text": "Well, I'm thinking to what you say, but I think there is maybe something deeper than that. So it's not just about rules. I think there is a kind of a. From my side, there is a kind of a designerly way of programming. I don't know how to say, but I think.",
      "id": "ep_39_ut_111"
    },
    {
      "end": 2492530,
      "speaker": "Moritz Stefaner",
      "start": 2490942,
      "text": "No, I absolutely agree.",
      "id": "ep_39_ut_112"
    },
    {
      "end": 2550750,
      "speaker": "Paolo Ciuccarelli",
      "start": 2493350,
      "text": "So. And maybe that's. That's why. But that's something that is needed. It doesn't mean that you don't need programmers, real programmers and computer scientists, but together, they can really easily work together if they have the knowledge. But not only the knowledge, they know what it is. They do it with their own approach, but they do it. So on the other side, maybe there is also kind of a programmer's way of doing design. I don't know how, but that's your side. So it's up to you to think about as much from my side. I think there is this kind of, as I say, the designerly way of program, of coding that is not perfect, I'm sure, but it doesn't have to be perfect, because there are other people that will make it perfect. So that's my point at the moment. It's totally evolving.",
      "id": "ep_39_ut_113"
    },
    {
      "end": 2611200,
      "speaker": "Enrico Bertini",
      "start": 2551330,
      "text": "So let me ask this question to an expert in design. I've always wondered. So do you think that very honestly, do you think that there are people who just don't have any aesthetic sense at all and there's no way to. No, I mean, honestly, very practically speaking, I'm always wondering about that because, of course, you teach to 30 people and you can see that there are two of them who have a natural aesthetic sense, and that's great. Right. And then you have some other people who just don't get it. There's no way they don't get it. Right. And there's nothing wrong. I mean, each one of us has different kind of abilities. This, that's normal. Right. But how do you handle that? Or actually, no, I have a much more precise question. So if I don't have, so let's say that I don't have any aesthetic sense at all. Right. But, and I do understand that I don't have any aesthetic sense at all and I don't like it. Right. So what can I do?",
      "id": "ep_39_ut_114"
    },
    {
      "end": 2633672,
      "speaker": "Paolo Ciuccarelli",
      "start": 2611580,
      "text": "You are out of the way if you realize that you don't have an aesthetical. Well, I think you start with the basics. You start learning about history of art, history of architecture, and then you feed your mind with aesthetics. And so it's, I think you, I mean, for us, there is, there should be a way to teach it and to learn. Yeah.",
      "id": "ep_39_ut_115"
    },
    {
      "end": 2635496,
      "speaker": "Enrico Bertini",
      "start": 2633696,
      "text": "That's the reason why I'm asking.",
      "id": "ep_39_ut_116"
    },
    {
      "end": 2698492,
      "speaker": "Paolo Ciuccarelli",
      "start": 2635608,
      "text": "You are the, what I, what I can say is that the way we do it is by, you know, providing students courses about history of arts, history of communication, design, history of graphic design, history of whatever. So history going back and see what other people did, what were the reasons behind that. And so, and feeding the mind and, you know, the eyes and the mind of students with the images and the process behind them, I think that's the way. So learning and studying and seeing and reading and feeding yourself with aesthetics, I think that's the way. And it's not by chance that we have every year in our program, we have something and experience about it. So that's probably the only answer I can provide some talented people, but we can't rely only on that. We have to think to the other 45 that don't have this one thing.",
      "id": "ep_39_ut_117"
    },
    {
      "end": 2740610,
      "speaker": "Enrico Bertini",
      "start": 2698516,
      "text": "That I really like. So tell me if this is right or wrong. Okay, so one little strategy that I have myself, I think it's something that has been advocated by Tufte for a long time. First rule, try to do no harm. Right? I mean, I think that simplicity is the biggest thing here, because if you realize that. So I have a terrible aesthetic sense. The last thing I should do is, is play with stuff, right? So let's go back to the basics, right? Few colors, few variables out there. Let's make it simple, because the simpler it is, the less chances I have to make a huge mess. Does it make sense?",
      "id": "ep_39_ut_118"
    },
    {
      "end": 2746582,
      "speaker": "Paolo Ciuccarelli",
      "start": 2741150,
      "text": "Yes. Really?",
      "id": "ep_39_ut_119"
    },
    {
      "end": 2748730,
      "speaker": "Moritz Stefaner",
      "start": 2746726,
      "text": "The rule is also like, if you.",
      "id": "ep_39_ut_120"
    },
    {
      "end": 2753200,
      "speaker": "Enrico Bertini",
      "start": 2751560,
      "text": "Moritz, what's your take on that?",
      "id": "ep_39_ut_121"
    },
    {
      "end": 2764336,
      "speaker": "Moritz Stefaner",
      "start": 2753280,
      "text": "Yeah, no, I absolutely agree. It's sort of related to, if you don't have much to say, don't say it. It's also a good rule to follow.",
      "id": "ep_39_ut_122"
    },
    {
      "end": 2769500,
      "speaker": "Paolo Ciuccarelli",
      "start": 2764488,
      "text": "You are a smart guy, Enrico, don't you? You are doing right.",
      "id": "ep_39_ut_123"
    },
    {
      "end": 2808360,
      "speaker": "Moritz Stefaner",
      "start": 2770920,
      "text": "But I absolutely agree. I think there's a couple of very basic things that you need to be, that you have to have seen a few times, and you have to get it explained, maybe by a designer. And then you start seeing certain mechanisms again and again. And then you train your design sense, right? So often it's like you have to have a start in some way, like a certain way of thinking about design or observing design when it happens or when it works or doesn't work. But then it's a self reinforcing thing, because then you start to think about, how would I design that? Or what would be a good solution in that situation.",
      "id": "ep_39_ut_124"
    },
    {
      "end": 2832010,
      "speaker": "Paolo Ciuccarelli",
      "start": 2809310,
      "text": "Yeah. How could you have an aesthetic sense if you never came to art museums or you don't see exhibition? And you will never do that if you didn't have someone in your life that show you something at first time. So I think it's a kind of a process that has to be started somewhere and then you have to fit it constantly. So I think there is no other way.",
      "id": "ep_39_ut_125"
    },
    {
      "end": 2862710,
      "speaker": "Moritz Stefaner",
      "start": 2832950,
      "text": "But I mean, the other thing is you have to go beyond not doing any harm because just avoiding problems is not making you a good designer. Right. I mean, you have to take your own risk to be assertive. I think that's the big leap you make once you get into designing. You dare to make statements, right? So first phase is maybe avoid mistakes. Second is make statements and be assertive and be bold. Yeah.",
      "id": "ep_39_ut_126"
    },
    {
      "end": 2905010,
      "speaker": "Enrico Bertini",
      "start": 2864530,
      "text": "Yeah, yeah, yeah, yeah. But so another thing I'm wondering, so the way you guys are describing how design works looks to me that. So you're stressing a lot this idea that it's, you have to immerse yourself into design, right? So look at what others have done, try to sketch a lot of things by yourself. I think that's also the reason why you, you have studios, right? A studio, if I understand correctly, is having a bunch of students together with a designer going through a lot of examples and little projects. Right? Is that correct?",
      "id": "ep_39_ut_127"
    },
    {
      "end": 2965300,
      "speaker": "Paolo Ciuccarelli",
      "start": 2905550,
      "text": "Yeah. And do things. I mean, you learn by doing. That's basically a studio. So you have a brief, you have a project, and then you do it. You do it and you have reviews and you have discussion. And then according to the problem, I can show you something and we discuss about it. And you make advancements. Yes. It's learning by doing. Yeah. It's very important. So for designers, you can't have any design education without that. And that's a problem here because, I mean, it's more costly. So it costs more to have this kind of educational format, so it costs more to teach 50, 40 students. That's a lot with a studio than have 150 students that listen to a professor, mathematics, for example. But it's inevitable. We can't do any design education without this model.",
      "id": "ep_39_ut_128"
    },
    {
      "end": 2975260,
      "speaker": "Moritz Stefaner",
      "start": 2965760,
      "text": "It's an interesting point. It also might mean it doesn't scale to moocs or this online based education. Right. Or what's your take on that?",
      "id": "ep_39_ut_129"
    },
    {
      "end": 3049866,
      "speaker": "Paolo Ciuccarelli",
      "start": 2975680,
      "text": "That's an issue. As in any other university here, there is an excitement about massive online courses, but I really find difficult to imagine how can you teach design remotely. Right. For me, it's, you know, it's a kind of a contradiction. Well, I'm not the person that wants to come back to the, you know, this, the modeling, you know, that, this kind of old models. But on the other side, I think we can't do anything totally remotely. So there is something that you still learn by socializing the process in a way. So side by side. And that's, I don't know, that's my feeling. I know that there is an increasing amount of courses offered by, with this method, but I personally, I think will, I won't be involved in this kind of things soon. That's my feeling.",
      "id": "ep_39_ut_130"
    },
    {
      "end": 3074230,
      "speaker": "Enrico Bertini",
      "start": 3050058,
      "text": "But. So let me ask you something related again. So does it mean that, so I don't think that you guys imply, it doesn't imply that design doesn't have rules that you can teach, right. You can still give a lecture to students and say, look, these are the rules. Do you feel comfort, I mean, do you feel comfortable saying that there are some rules.",
      "id": "ep_39_ut_131"
    },
    {
      "end": 3077790,
      "speaker": "Paolo Ciuccarelli",
      "start": 3075970,
      "text": "Not rules, again, rules.",
      "id": "ep_39_ut_132"
    },
    {
      "end": 3081706,
      "speaker": "Moritz Stefaner",
      "start": 3079410,
      "text": "I mean, are there rules in computer science?",
      "id": "ep_39_ut_133"
    },
    {
      "end": 3085150,
      "speaker": "Paolo Ciuccarelli",
      "start": 3081818,
      "text": "I mean, I think, you know, there are no rules. Exactly.",
      "id": "ep_39_ut_134"
    },
    {
      "end": 3091724,
      "speaker": "Moritz Stefaner",
      "start": 3086570,
      "text": "There's heuristics and there's principles, but there's no, I don't know. I don't think there are rules in design.",
      "id": "ep_39_ut_135"
    },
    {
      "end": 3227030,
      "speaker": "Paolo Ciuccarelli",
      "start": 3091812,
      "text": "No, no. I don't know if you, if you ever seen this, this PDF that is circulating on the web, I can't remember the source, the person, but it's like, you know, the 99 models of design processes. I mean, it's. Yeah, you have 90, really 99 or something. Ten, 100, I can't remember. But it's 99, 100 models, diagrams that represent 99 different models of design or how to do design. Yeah, maybe it's not, but you have people that tried to make a model of the process, but it's still a model. So it's something that you can work on, but at the end, you have many, many models and many, many different ways of doing. And anytime that one of my students comes back from a different school, the first thing they notice is the differences in the model. And so now I know they start talking about methods, because here they don't realize there is a method, but they go abroad and they come back, they see, they say there is a different method, there's a different way of doing things. So I think that, well, the basic, very, very basic steps are always the same. I think there are three, four steps. You start doing some research that could be on field, that could be desk research, then you on the problem. So you have a problem that there's a person that tells you the problem, or maybe you discover your problem, or you have an idea and hypothesis, and you research on that. Then you have a first hypothesis, and then you start making some tests, some evaluation. Then you have refinements, and then you have delivery at the end. So there are some basic steps, but it's really, really a very rough skeleton. And then around that, you have many, many different interpretations, I think. What, design is an interpretive process. So, interpretative process. There are some pillars, but you play around it a lot. So that's my idea.",
      "id": "ep_39_ut_136"
    },
    {
      "end": 3236310,
      "speaker": "Enrico Bertini",
      "start": 3228890,
      "text": "Okay. And I have another question. I don't know.",
      "id": "ep_39_ut_137"
    },
    {
      "end": 3240150,
      "speaker": "Paolo Ciuccarelli",
      "start": 3236930,
      "text": "I'm not here to teach about design or whatever.",
      "id": "ep_39_ut_138"
    },
    {
      "end": 3322396,
      "speaker": "Enrico Bertini",
      "start": 3241410,
      "text": "I feel so much connection with another Italian that I'm behaving very Italian today. Maybe we should switch to Italian for a while. So let me tell you something about what I don't like of designers doing this most of the time. And I want to hear from you, if you agree, and in case you agree, what's the solution there? So the problem I see with lots of designers out there is that they are, they fall in love with the design itself, right. And because of that, sometimes they forget the receiver. Right. The people who's gonna read that, so they like the style, they fall in love with the style and go adrift with this thing without losing focus on the fact that you need to communicate information. And I see this problem happening from time to time. And so I'm curious to hear from you, if you agree with me, and in case you agree, what's the. How do you handle that? Because I'm sure that you are teaching things to your students in order to make sure that whatever they build is gone is going to be not only beautiful but effective as well it should be.",
      "id": "ep_39_ut_139"
    },
    {
      "end": 3323796,
      "speaker": "Paolo Ciuccarelli",
      "start": 3322428,
      "text": "I mean, there is no, I mean.",
      "id": "ep_39_ut_140"
    },
    {
      "end": 3329056,
      "speaker": "Enrico Bertini",
      "start": 3323868,
      "text": "And that's design, right? I mean, designers want things to be functional, right?",
      "id": "ep_39_ut_141"
    },
    {
      "end": 3428610,
      "speaker": "Paolo Ciuccarelli",
      "start": 3329168,
      "text": "That it has to be equally functional. And. But, I mean, there is no distinction. I really hate talking about distinctions about. No, no, that's, that's really obsolete. There is no more any, I mean, any distinction. And it's, it's quite clear. I mean, there are a lot of evidences and there's plenty of literature that talks about this kind of disappearance of the distinction between what is functional and what is aesthetical, what is pleasurable. And, you know, I mean, even people like Donald Norman at the end came with this idea that there is no distinction. So I think it's quite clear. So let's forget about it. But just, I mean, it's simply, I can simply say that if they do, if they act as you said, they're not good designers. I mean, probably there was something wrong in the education. They just, they didn't understand what people said, but what professors said or whatever, so they're just not. They're simply bad designers. So it's design. It's mostly about, you know, serving a need, exploiting the opportunities you have. And it starts from constraints. It starts from. From constraints that come from a user. It's fundamentally a user centered discipline. So there is no way to skip it. If you do it, it's your fault. You're just bad designer.",
      "id": "ep_39_ut_142"
    },
    {
      "end": 3431810,
      "speaker": "Enrico Bertini",
      "start": 3429470,
      "text": "Do you stress that in your courses?",
      "id": "ep_39_ut_143"
    },
    {
      "end": 3550460,
      "speaker": "Paolo Ciuccarelli",
      "start": 3432270,
      "text": "Yeah, absolutely. But, I mean, I think it's, the problem is that it's much more easy today to fall in love with the feature of a tool, with this certain style that you see. I think in a way it's normal because it's very seductive. It's very easy to do it. I can understand that you get excited by that, but if you understood what design is, you have immediately to stop this excitement and to go back to the basics and to play. I mean, if you think, I mean, when we do any project we do, it starts from data. And we always stress this point. We have to start from data, from the user. We spend a lot of time with people. I mean, it passes a lot of time before we really go into visualization. So this often, it's really 20, 30% of the work, and most of the time is spent in understanding, because how many times people come to you with a data set that they pretend represent the phenomenon they have in mind, simply discussing together, you discover that it's not. I mean, this data set is not the right one. Maybe if you want to see that, if you want to make a decision on this point, maybe it's better if you complement this data set with something else. And that's the most interesting part. And that's the profoundly designerly way of doing that. I think that that's where design starts. After it's just, you know, is. Yeah. Then there is a translation process. Yes.",
      "id": "ep_39_ut_144"
    },
    {
      "end": 3556740,
      "speaker": "Enrico Bertini",
      "start": 3555000,
      "text": "That's very different stories.",
      "id": "ep_39_ut_145"
    },
    {
      "end": 3559104,
      "speaker": "Moritz Stefaner",
      "start": 3558120,
      "text": "That's always something.",
      "id": "ep_39_ut_146"
    },
    {
      "end": 3561960,
      "speaker": "Paolo Ciuccarelli",
      "start": 3559192,
      "text": "Mezzore. So, no, for some Italian.",
      "id": "ep_39_ut_147"
    },
    {
      "end": 3562824,
      "speaker": "Enrico Bertini",
      "start": 3562040,
      "text": "That's nice.",
      "id": "ep_39_ut_148"
    },
    {
      "end": 3563600,
      "speaker": "Moritz Stefaner",
      "start": 3562952,
      "text": "I like it.",
      "id": "ep_39_ut_149"
    },
    {
      "end": 3565580,
      "speaker": "Paolo Ciuccarelli",
      "start": 3563680,
      "text": "Okay. It's nice.",
      "id": "ep_39_ut_150"
    },
    {
      "end": 3567570,
      "speaker": "Enrico Bertini",
      "start": 3566850,
      "text": "Come on.",
      "id": "ep_39_ut_151"
    },
    {
      "end": 3568590,
      "speaker": "Paolo Ciuccarelli",
      "start": 3567650,
      "text": "I'm sorry.",
      "id": "ep_39_ut_152"
    },
    {
      "end": 3572922,
      "speaker": "Moritz Stefaner",
      "start": 3570290,
      "text": "Are you being kicked out? Do you have to run to the street?",
      "id": "ep_39_ut_153"
    },
    {
      "end": 3602346,
      "speaker": "Paolo Ciuccarelli",
      "start": 3573026,
      "text": "No, they just wanted to see if there was someone inside. If not, they switch on the other security people going around. I say that I will be here for hour. So that's what I mean. It's a very basic error if you see that just, I mean, say to these people, you are not designers, and.",
      "id": "ep_39_ut_154"
    },
    {
      "end": 3625190,
      "speaker": "Enrico Bertini",
      "start": 3602378,
      "text": "Understanding people's needs is hard. Right. Because you have this whole idea of latent needs that people don't know they have. Right. Which is huge to me. I think being trained how to discover latent needs, I think that's another designing thing that is super hard to learn and teach. How do you teach that?",
      "id": "ep_39_ut_155"
    },
    {
      "end": 3672480,
      "speaker": "Paolo Ciuccarelli",
      "start": 3626530,
      "text": "Well, it's not my field, but there are people that just really focus on that. I mean, there are methods and tools to help users, to put outside, to explicit, make the needs explicit. And it's a lot about discussion. It's about, you know, interaction. It's about socialization. And, you know, there is a bit of sociology on that, a bit of, you know, anthropology and. But these are basic contents that you teach. When you do design, you have anthropology, you have a bit of sociology. You learn something about it. You learn something about people, about what they. How they behave and what they think, but it's something that you can't skim.",
      "id": "ep_39_ut_156"
    },
    {
      "end": 3688246,
      "speaker": "Moritz Stefaner",
      "start": 3672950,
      "text": "I think it's a good observation that these needs are not necessarily just designers fulfilling requests, but it's more about identifying deficiencies or moving things in a certain direction, or questioning mindsets and things like that.",
      "id": "ep_39_ut_157"
    },
    {
      "end": 3695246,
      "speaker": "Enrico Bertini",
      "start": 3688358,
      "text": "And I'm sure. Oh, sorry. I'm sure you, Moritz, must be doing that all the time with your clients as well, right?",
      "id": "ep_39_ut_158"
    },
    {
      "end": 3725270,
      "speaker": "Moritz Stefaner",
      "start": 3695358,
      "text": "It depends. I mean, sometimes I have situations where it's very clear cut, like what is to do and what's my reference frame, where to operate. And other times it's very open and I can sort of poke some holes somewhere and see what happens. Paolo, one thing I was wondering, how does it play out in the. So the last few years, you've been doing a lot of work in the digital humanities, so I know you're collaborating with Stanford on the Republic of Letters project. Is that still ongoing or.",
      "id": "ep_39_ut_159"
    },
    {
      "end": 3904050,
      "speaker": "Paolo Ciuccarelli",
      "start": 3725730,
      "text": "Well, it's a bit on standby, but I think it's like, I see it as the natural cycle of a process that started years ago, I think three years ago in that case, especially with a PhD student. But what happened is that nowadays, this PhD student, well, he got the PhD now is part of the Stanford Humanities Center. I think this is the, it's like, you know, the curve, because what happened, in fact, if you look to humanities, especially to digital humanities, that's the field we are working in. I mean, that it's clear that they need design, but it's not me saying that if you read papers about digital humanities, if you go to conferences about digital humanities, more explicit than not, you see references to design. So they talk about that and visualization and visualization and how. But I mean, just looking at, you know, the very famous book of Franco Moretti, you know, distant reading and, you know, graphs, trees, maps, you know, it's all about shapes, forms and. And visualization. So it's evident, but was evident also that they didn't have design at all. So they were trying to do something about design without designers, without having this kind of competencies. And so we started a process. We started a process of contamination, I would say. So we did small projects at the beginning, and then we spent some time together. We made bigger projects. And at the end, one of the recent tool is really an environment that followed their own specific process of inquiry. And then now at the end, I see really the conclusion they incorporated design as a competence. I know, I like it absolutely. It's really the cycle that is closed. I mean, it's. And I think that what is happening in many disciplines, I have the same feeling in many other fields now, we are working also since years with sociologists, and it's the same. I have two people from my lab that now works in two years in the media lab of science po in Paris. They are there. I mean, there was no design before, and now there are two designers inside. And, you know, I'm losing pieces, parts of the lab, but it's on the other side. I'm happy. I'm happy because it's, you know, there is a process of, you know, you start tasting each other and, you know.",
      "id": "ep_39_ut_160"
    },
    {
      "end": 3908274,
      "speaker": "Enrico Bertini",
      "start": 3904170,
      "text": "But you are planting seeds everywhere. I mean, that's, that's really nice.",
      "id": "ep_39_ut_161"
    },
    {
      "end": 3908650,
      "speaker": "Moritz Stefaner",
      "start": 3908362,
      "text": "Yeah.",
      "id": "ep_39_ut_162"
    },
    {
      "end": 3910754,
      "speaker": "Paolo Ciuccarelli",
      "start": 3908690,
      "text": "Lots of density design labs, a big.",
      "id": "ep_39_ut_163"
    },
    {
      "end": 3914646,
      "speaker": "Enrico Bertini",
      "start": 3910802,
      "text": "Tree planting seeds all over the place. Right.",
      "id": "ep_39_ut_164"
    },
    {
      "end": 3997750,
      "speaker": "Paolo Ciuccarelli",
      "start": 3914718,
      "text": "Yeah. When we are lucky, the link is still active. So sometimes it's really a connection. It's a very profound connection because you have someone there that really know what you do. And then we start doing projects together. So it's. We did a lot of projects and with Stanford is a bit on standby that we want to do something more. And so it's very, if I look from, you know, from an external point of view, it's very positive, is the discipline that is, and especially in humanities, really there is a. There are a lot of points of contact and between our respective processes. I mean, the. The PhD thesis of Giorgio Caviglia, that's the name of the person that is in the. Nowadays in Stanford, was really about the similarities between the inquiry process of the research process of a humanistic scholar and the design process. There are so many similarities between these two processes that it's, in a way, it's quite normal that they integrate this competence in their lab. So it's. Yeah, there are positive and negative aspects, but I'm totally happy with that.",
      "id": "ep_39_ut_165"
    },
    {
      "end": 4019270,
      "speaker": "Enrico Bertini",
      "start": 3999850,
      "text": "So should we talk about. So I think we are kind of like reaching the end of the episode, but before finishing, I would love to hear more about raw because that's, that's a. So we didn't touch upon that. And it's a super nice thing coming from your lab. I would love to hear more about it.",
      "id": "ep_39_ut_166"
    },
    {
      "end": 4038342,
      "speaker": "Paolo Ciuccarelli",
      "start": 4019990,
      "text": "Well, what is interesting is that raw is totally a lateral project, a side project that started by, you know, some people here, they started playing with. We did a first tool, I don't know if you remember, it was called.",
      "id": "ep_39_ut_167"
    },
    {
      "end": 4052040,
      "speaker": "Enrico Bertini",
      "start": 4038406,
      "text": "Fine, sorry, before you describe it, can you briefly. So just in case someone who's listening doesn't know what Raw is, can you describe the tool, what it does, what it is?",
      "id": "ep_39_ut_168"
    },
    {
      "end": 4274578,
      "speaker": "Paolo Ciuccarelli",
      "start": 4052940,
      "text": "Well, I love the description that has been given by. I think it was invisioli. I can't remember who wrote the post. The description was a tool by information designers. For information designers. I think it's true because it started as a tool for ourselves. I mean, we had needs on a certain point to produce some visualization patterns that were not produced by any tool available on the level that we needed. I mean when we started with Sankey diagrams, if you remember the first tool we did, Fineo, and there was no tool that was able to do that in the way we needed. So we started from us as users in a way. And then, I mean after Finair we saw that there was an interest for this kind of tools and we also learned a lot from this tool because there were so many limits that people pointed out. Exactly. And after that, I don't know, again maybe, I don't know why, but some people started here playing with this idea of having a tool that was more powerful and more open than Fineo and was also more updated in terms of technology, but still with the idea of serving a target of users very similar to designers. So to people that has this need of creating some rough visualizations, that need after a refinement process and, but it's a need that we discovered is not peculiar only of designers. There are journalists for example, that are using a lot low as a tool for creating visualizations. So it started as a, as again as a lateral project for ourselves. But you know, nowadays it's a very interesting phenomenon for us. It's growing, it's evolving and well basically it's an open source tool based on two very solid environments. One is angularjs and the other side is SD three. So it's very, very linked to the most updated environment. And it's basically you can put your data on the browser and this is one important point, everything stays on the browser so there is nothing to upload. When you close your browser, the data is safe. So that was one of the major complaining in Fineo. So you copy your data, you paste your data in the window and then you create, you choose your pattern and then you create your own visualization, then you can export in PNG, in SVG, in JSON and HTML. So that's basically what it does. And yeah, it's working, a lot of people are using it. Whenever you have here in Italy and an open data acetone or whatever, everybody is using this tool and they call us for doing workshop. So to explain people, it works to teach people and it's very, very, it's impressive. I mean we didn't have any expectation from that, but I think it's good. It's really a positive example on how a side project could evolve and become something more.",
      "id": "ep_39_ut_169"
    },
    {
      "end": 4311610,
      "speaker": "Moritz Stefaner",
      "start": 4274674,
      "text": "Yeah, and it's quite big now with like ten different chart types or something like this. So it's, I think a lot of work has gone into it. Right. But what I can also observe when I teach, so I like to show it when I teach because it's so, you know, you paste in some data and you immediately get results and you just start playing immediately with the data. And I think that's so great about it that it lowers the entry barrier for people who have maybe reservations or don't know how to code or for who Tableau would be, maybe also too complicated. And it's really like a gateway drug maybe to more complex things.",
      "id": "ep_39_ut_170"
    },
    {
      "end": 4422596,
      "speaker": "Paolo Ciuccarelli",
      "start": 4312070,
      "text": "And what I find interesting is that, I mean, it doesn't do something that is unique. I mean you have plenty of tools that do similar things. But I think again, what is important is the way in which it works. So how it works, so it's the user experience I think here is very important and I think will be more and more important. We are putting a lot of attention to that. In the last release, we changed something in the interface. I think it's one of the strong point is really more on the interface, it's more on how it works than what it does, I think. And that's again, maybe part of the design culture, designers develop tools. Maybe it's different from how computer scientists or journalists or whatever develop tools again. Yeah, maybe there is a designerly way of developing tools for other people. And maybe having always tacitly in mind the users, this kind of things, maybe, yeah, the user experience, I think it's a key point in this tool. And yeah, I love it. We will have the, very soon we will make a partnership with one of the major publishers here in Italy. They just want to support the tool, so they will give some money to us for developing the tool as an open source tool. Yes, it's good because people like it as an idea. I mean, it's more than as a tool. So it's a way also to increase a bit the culture of visualization here in Italy. And so I think we will still invest energy on that.",
      "id": "ep_39_ut_171"
    },
    {
      "end": 4423400,
      "speaker": "Moritz Stefaner",
      "start": 4422708,
      "text": "Cool.",
      "id": "ep_39_ut_172"
    },
    {
      "end": 4454800,
      "speaker": "Enrico Bertini",
      "start": 4425580,
      "text": "I think that one thing I really like about Raw is the fact that only recently I realized that. So we have lots of resources, visualization resources on the web, but not many tools. So if you think about it, there's plenty of examples, plenty of libraries, but there's nothing in between. Right. And I think that we should have many more tools out there.",
      "id": "ep_39_ut_173"
    },
    {
      "end": 4458996,
      "speaker": "Paolo Ciuccarelli",
      "start": 4458260,
      "text": "It's growing.",
      "id": "ep_39_ut_174"
    },
    {
      "end": 4468950,
      "speaker": "Moritz Stefaner",
      "start": 4459028,
      "text": "I mean, there's been a whole wave of startups around that. Like I think that's five, six different startups right now competing for that chart making, made simple thing.",
      "id": "ep_39_ut_175"
    },
    {
      "end": 4576340,
      "speaker": "Paolo Ciuccarelli",
      "start": 4469890,
      "text": "Yeah, honestly, I don't see really well, I'm not sure what could be the business model behind that. I mean, but we are like, again, we are in a privileged position. We can do open source projects and it's working because of that, I think. But how can you. Well, the most important tools you have, I think more or less they are all open source. I mean think to get networks, for example, thanks to data wrapper by Greg Reich. And it's open source and journalists are excited about it. And Raul, again, it's open source. I'm not sure there is. Well, there's Tableau, but that's another market, let's say. And then you have all the tools that create visualizations out of templates. So it's very, very is basic. And for people that doesn't have any in the middle, I'm not sure will designers pay for and how much for a tool that does, you know, or maybe they will simply be embedded into illustrator or whatever. So maybe that's. I don't know, I'm. Well, I'm not a good entrepreneur so maybe I just don't see the business model. But I'm not sure there is a market for this intermediate level. I mean many people say it's just a way role for accessing D3 in a simple way. So they maybe started with learning D3 and then they maybe find it a little complicated and then they came to raw as a way to intermediate the libraries. And that's interesting.",
      "id": "ep_39_ut_176"
    },
    {
      "end": 4610066,
      "speaker": "Moritz Stefaner",
      "start": 4578640,
      "text": "Yeah. And I think it can really get people started into moving beyond standard chart types, even if they are not into programming. And then I also observed when they use it, they're like, yeah, that's almost good. But now I need to move around the labels or now I'd like to rotate it. And then they get into this process of customizing it. That's the next step. And then at some point they will want to program their own charts. And so I think it's great just for getting people started and give them something quickly they can work with. I think it's fantastic.",
      "id": "ep_39_ut_177"
    },
    {
      "end": 4631960,
      "speaker": "Paolo Ciuccarelli",
      "start": 4610218,
      "text": "Yeah. We try to resist because people are asking for extension labels, customization title. You have to give the possibility to put a title. No, that's not, that's the second step. I mean that's not the purpose of the tools. Don't ask it.",
      "id": "ep_39_ut_178"
    },
    {
      "end": 4653680,
      "speaker": "Enrico Bertini",
      "start": 4634300,
      "text": "No, I am a big fan of simplicity myself. So I think that if so there are so many good software that then become super bloated and it's hard. It's hard, right. If you try to satisfy every single request, I think that's not the best way to go?",
      "id": "ep_39_ut_179"
    },
    {
      "end": 4662366,
      "speaker": "Paolo Ciuccarelli",
      "start": 4654350,
      "text": "Absolutely. Keep the focus on your user. And I mean, I think it's the best way. So no pie charts?",
      "id": "ep_39_ut_180"
    },
    {
      "end": 4663650,
      "speaker": "Enrico Bertini",
      "start": 4662518,
      "text": "No pie charts.",
      "id": "ep_39_ut_181"
    },
    {
      "end": 4666910,
      "speaker": "Moritz Stefaner",
      "start": 4664350,
      "text": "But if the users want it, yeah.",
      "id": "ep_39_ut_182"
    },
    {
      "end": 4669390,
      "speaker": "Paolo Ciuccarelli",
      "start": 4666950,
      "text": "They can add it. I mean, if you want to do it, do it.",
      "id": "ep_39_ut_183"
    },
    {
      "end": 4669886,
      "speaker": "Moritz Stefaner",
      "start": 4669430,
      "text": "You can do it.",
      "id": "ep_39_ut_184"
    },
    {
      "end": 4670630,
      "speaker": "Paolo Ciuccarelli",
      "start": 4669918,
      "text": "There is an option.",
      "id": "ep_39_ut_185"
    },
    {
      "end": 4671730,
      "speaker": "Moritz Stefaner",
      "start": 4670710,
      "text": "I'll write a plug.",
      "id": "ep_39_ut_186"
    },
    {
      "end": 4678810,
      "speaker": "Paolo Ciuccarelli",
      "start": 4674030,
      "text": "There is an option for adding new charts. Type I'm not against.",
      "id": "ep_39_ut_187"
    },
    {
      "end": 4682912,
      "speaker": "Enrico Bertini",
      "start": 4681320,
      "text": "I like pie charts.",
      "id": "ep_39_ut_188"
    },
    {
      "end": 4684192,
      "speaker": "Paolo Ciuccarelli",
      "start": 4683096,
      "text": "You can do it.",
      "id": "ep_39_ut_189"
    },
    {
      "end": 4689184,
      "speaker": "Moritz Stefaner",
      "start": 4684336,
      "text": "Please edit the Enrico pie chart.",
      "id": "ep_39_ut_190"
    },
    {
      "end": 4694656,
      "speaker": "Paolo Ciuccarelli",
      "start": 4689312,
      "text": "Yeah, you go on GitHub. There is all the documentation. You learn how to do it and you can do it.",
      "id": "ep_39_ut_191"
    },
    {
      "end": 4695416,
      "speaker": "Enrico Bertini",
      "start": 4694728,
      "text": "Sure.",
      "id": "ep_39_ut_192"
    },
    {
      "end": 4696592,
      "speaker": "Paolo Ciuccarelli",
      "start": 4695608,
      "text": "I expect it.",
      "id": "ep_39_ut_193"
    },
    {
      "end": 4697780,
      "speaker": "Moritz Stefaner",
      "start": 4696656,
      "text": "Time well spent.",
      "id": "ep_39_ut_194"
    },
    {
      "end": 4700520,
      "speaker": "Enrico Bertini",
      "start": 4699640,
      "text": "Nice channel.",
      "id": "ep_39_ut_195"
    },
    {
      "end": 4705950,
      "speaker": "Paolo Ciuccarelli",
      "start": 4700600,
      "text": "People will use it, I'm certain. There are so many requests. People will use it a lot.",
      "id": "ep_39_ut_196"
    },
    {
      "end": 4756040,
      "speaker": "Enrico Bertini",
      "start": 4707330,
      "text": "Yeah, but you know, I mean, I tend to be skeptical to the fact that. So that's another thing that happened to me recently. We've been telling people for ages and ages, rainbow color map is evil. Right? But it's also a reality that there are thousands or even more of quite clever scientists out there who keep using it. So I'm not saying that it's not that it's good, but I don't think that is as bad as we picture it. I think there are many things in visualization that we picture as evil. And I think we should be a little bit more careful because if a lot of people use them, there must be some value in it. At least that's my take. But. Yeah.",
      "id": "ep_39_ut_197"
    },
    {
      "end": 4798770,
      "speaker": "Paolo Ciuccarelli",
      "start": 4757740,
      "text": "No, I agree. But I think it's normal. It's easy to start from zero and one. So say that's good, that's bad. It's a way to simplify the issue. And then when you go deep into the problem, then you realize that there are all the nuances and the problem is more complex. And that is normal. It's our way, I think, to simplify things and to survive in this world. But I think it's always that you often come back to something that you conceived as a bad or good, and then you start learning the nuances. I mean, I think it's how it works.",
      "id": "ep_39_ut_198"
    },
    {
      "end": 4805490,
      "speaker": "Enrico Bertini",
      "start": 4799150,
      "text": "So should we wrap it up? Moritz? Yeah, I think it's been longer than usual today.",
      "id": "ep_39_ut_199"
    },
    {
      "end": 4807878,
      "speaker": "Moritz Stefaner",
      "start": 4806070,
      "text": "And we could still continue.",
      "id": "ep_39_ut_200"
    },
    {
      "end": 4809250,
      "speaker": "Enrico Bertini",
      "start": 4807974,
      "text": "We could still continue.",
      "id": "ep_39_ut_201"
    },
    {
      "end": 4812172,
      "speaker": "Paolo Ciuccarelli",
      "start": 4810900,
      "text": "We waited so long.",
      "id": "ep_39_ut_202"
    },
    {
      "end": 4823440,
      "speaker": "Moritz Stefaner",
      "start": 4812276,
      "text": "In the interest of our users, which are listeners in our case, think we need to wrap it up. Otherwise we would have to do a second episode. I mean, that would be acceptable too, but yeah.",
      "id": "ep_39_ut_203"
    },
    {
      "end": 4830600,
      "speaker": "Enrico Bertini",
      "start": 4823820,
      "text": "So we're gonna have a break. We said, until for sure, we are not going to record anything in August.",
      "id": "ep_39_ut_204"
    },
    {
      "end": 4832236,
      "speaker": "Moritz Stefaner",
      "start": 4831020,
      "text": "I think so, too. Yeah.",
      "id": "ep_39_ut_205"
    },
    {
      "end": 4832960,
      "speaker": "Enrico Bertini",
      "start": 4832308,
      "text": "Yeah.",
      "id": "ep_39_ut_206"
    },
    {
      "end": 4837718,
      "speaker": "Moritz Stefaner",
      "start": 4836590,
      "text": "But September, right?",
      "id": "ep_39_ut_207"
    },
    {
      "end": 4842518,
      "speaker": "Enrico Bertini",
      "start": 4837774,
      "text": "So sometime in September, we're gonna have some. Some new, special, special things.",
      "id": "ep_39_ut_208"
    },
    {
      "end": 4851126,
      "speaker": "Moritz Stefaner",
      "start": 4842694,
      "text": "Yeah. If listeners, if you have suggestions for guests, we're always open. We have a few lined up already, which we would like to have. But if you have any, any ideas.",
      "id": "ep_39_ut_209"
    },
    {
      "end": 4860366,
      "speaker": "Enrico Bertini",
      "start": 4851238,
      "text": "Any crazy idea is very welcome. Or if you want to spice it up with something, just let us know. Yeah, we're always open to suggestions or.",
      "id": "ep_39_ut_210"
    },
    {
      "end": 4865452,
      "speaker": "Moritz Stefaner",
      "start": 4860438,
      "text": "Yeah, send us any feedback or rate us on iTunes. That would be nice, too. So we can move up in the.",
      "id": "ep_39_ut_211"
    },
    {
      "end": 4875620,
      "speaker": "Enrico Bertini",
      "start": 4865606,
      "text": "In the ranking. That's always very good. Yeah. And criticism is good as well. So if there is anything you don't like, feel free to send a message.",
      "id": "ep_39_ut_212"
    },
    {
      "end": 4877540,
      "speaker": "Moritz Stefaner",
      "start": 4876640,
      "text": "I agree.",
      "id": "ep_39_ut_213"
    },
    {
      "end": 4882620,
      "speaker": "Enrico Bertini",
      "start": 4878120,
      "text": "Okay. Thanks a lot, Paolo. It's been great having you here finally.",
      "id": "ep_39_ut_214"
    },
    {
      "end": 4891528,
      "speaker": "Paolo Ciuccarelli",
      "start": 4883520,
      "text": "Thank you. Thank you. I mean, it's great. Great to be with you and talk about this stuff. I mean, I love it.",
      "id": "ep_39_ut_215"
    },
    {
      "end": 4892472,
      "speaker": "Enrico Bertini",
      "start": 4891704,
      "text": "Great.",
      "id": "ep_39_ut_216"
    },
    {
      "end": 4894628,
      "speaker": "Moritz Stefaner",
      "start": 4892656,
      "text": "Thanks, Paolo. Bye.",
      "id": "ep_39_ut_217"
    }
  ],
  "confidence": 0.918302733259212,
  "audio_duration": 4905,
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_status_code": null,
  "webhook_auth": false,
  "webhook_auth_header_name": null,
  "speed_boost": false,
  "auto_highlights_result": null,
  "auto_highlights": false,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_audio_quality": null,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "content_safety": false,
  "iab_categories": true,
  "content_safety_labels": {
    "status": "unavailable",
    "results": [],
    "summary": {}
  },
  "language_detection": false,
  "language_detection_threshold": null,
  "language_confidence": null,
  "custom_spelling": null,
  "throttled": false,
  "auto_chapters": true,
  "summarization": false,
  "summary_type": null,
  "summary_model": null,
  "custom_topics": false,
  "topics": [],
  "speech_threshold": null,
  "speech_model": "best",
  "chapters": [
    {
      "summary": "Hi, everyone. Data stories number 39. Scrambling to get everything together before I leave for holidays again in two weeks. I think we will go on a summer break with data stories as well, right after this one. We deserve it.",
      "gist": "Data stories #39",
      "headline": "Moritz: Speedier than usual this week with data stories",
      "start": 12040,
      "end": 57590,
      "id": "ep_39_ch_0"
    },
    {
      "summary": "We just got notified that we had a few papers accepted at this. There are a couple of papers that I really am really looking forward to publish online. We will do a tutorial on web based visualizations. And the second one is a panel with all the big ngo's on data visualization. We'll see you in Paris.",
      "gist": "A Week in the Life of Data Visualization",
      "headline": "We just got notified that we had a few papers accepted at this conference",
      "start": 59730,
      "end": 259610,
      "id": "ep_39_ch_1"
    },
    {
      "summary": "Special guest is Paolo Cucciarelli from density design. He talks about climate change and global warming phenomenon. Finally. we should say we've been chasing you for a long time. You are the busiest person ever.",
      "gist": "Density Design",
      "headline": "Benvenuto to Paolo Cucciarelli from density design",
      "start": 260070,
      "end": 395548,
      "id": "ep_39_ch_2"
    },
    {
      "summary": "Currently associate professor at Politecnico di Milano. Leading also the program of communication design on bachelor and master level. All the time is, is here at university both on teaching and doing research with density design. Says after years the importance of what you do in university.",
      "gist": "Density Design",
      "headline": "Edgar Moran's original background is in architecture; now he teaches communication design",
      "start": 395604,
      "end": 937448,
      "id": "ep_39_ch_3"
    },
    {
      "summary": "Density design started in 2004, as a course, it was the title that I gave to the course. Now, after years, I have also an explanation for the title. The explanation is the relationship between the complexity that is growing and time that is shrinking.",
      "gist": "What is density design?",
      "headline": "So density design started in 2004, you. But it's true, you invented it after",
      "start": 937584,
      "end": 1084280,
      "id": "ep_39_ch_4"
    },
    {
      "summary": "The main goal of density design is to create tools to access complexity. Designers don't do data visualization in the proper sense, in the literary sense. They want to create interfaces and visual representation that makes the complexity of the phenomenon visible, accessible and usable.",
      "gist": "What is the main goal of data visualization?",
      "headline": "So is the main goal of density design actually developing tools to access complexity",
      "start": 1084440,
      "end": 1350580,
      "id": "ep_39_ch_5"
    },
    {
      "summary": "There is no one other school in Europe that has the same size as Politecnico. We have 3500 students in design. And we have a PhD in design that is also quite unique. It's like an ecosystem that is difficult to replicate somewhere else.",
      "gist": "The Oxford Design Research Lab",
      "headline": "Politecnico doesn't have any other design, applied design research lab",
      "start": 1351600,
      "end": 1746830,
      "id": "ep_39_ch_6"
    },
    {
      "summary": "At the moment I have more research contracts than PhD students. There are interns, students that decide to spend their internship in the lab, and we start having also internship from abroad. In Italy we are probably not as competitive as in other countries in terms of salary for research.",
      "gist": "How does the lab work?",
      "headline": "So can you tell us a little bit more about how the lab works",
      "start": 1748350,
      "end": 1929730,
      "id": "ep_39_ch_7"
    },
    {
      "summary": "In the beginning there was a very coherent style to the output of density design lab. Did that emerge on its own or did you really try and coin a certain visual style first to establish a certain voice? I'm not happy of how we manage our communication tools. But for me, the Flickr stream has been a good reference always.",
      "gist": "The style of the density design lab",
      "headline": "There was a very coherent style to the output of density design lab",
      "start": 1930870,
      "end": 2443860,
      "id": "ep_39_ch_8"
    },
    {
      "summary": "From my side, there is a kind of a designerly way of programming. It doesn't mean that you don't need programmers, real programmers and computer scientists. Together, they can really easily work together if they have the knowledge. It's totally evolving.",
      "gist": "Ideas of programming and design",
      "headline": "There is a kind of a designerly way of programming. From my side, there is also programmer's way of doing design",
      "start": 2444160,
      "end": 2550750,
      "id": "ep_39_ch_9"
    },
    {
      "summary": "Do you think there are people who just don't have any aesthetic sense at all? Well, I think you start with the basics. You start learning about history of art, history of architecture, and then you feed your mind with aesthetics. There should be a way to teach it and to learn.",
      "gist": "Do you think that there are people without an aesthetic sense?",
      "headline": "So let me ask this question to an expert in design. Do you think there are people without aesthetic sense",
      "start": 2551330,
      "end": 2703124,
      "id": "ep_39_ch_10"
    },
    {
      "summary": "Enrico Moritz: First rule, try to do no harm. Second is make statements and be assertive and be bold. Just avoiding problems is not making you a good designer.",
      "gist": "The 3 Rules of Design",
      "headline": "Enrico: First rule is try to do no harm when designing",
      "start": 2703172,
      "end": 2865890,
      "id": "ep_39_ch_11"
    },
    {
      "summary": "It's learning by doing. You can't have any design education without that. It also might mean it doesn't scale to moocs or this online based education. That's an issue. I really find difficult to imagine how can you teach design remotely.",
      "gist": "How does design work?",
      "headline": "It's difficult to imagine how can you teach design remotely",
      "start": 2865930,
      "end": 3050790,
      "id": "ep_39_ch_12"
    },
    {
      "summary": "Are there rules in computer science? I think, you know, there are no rules. What, design is an interpretive process. There are some pillars, but you play around it a lot.",
      "gist": "None of the design rules",
      "headline": "Are there rules in computer science? I mean, there are no rules",
      "start": 3051210,
      "end": 3227030,
      "id": "ep_39_ch_13"
    },
    {
      "summary": "The problem I see with lots of designers out there is that they are, they fall in love with the design itself. And because of that, sometimes they forget the receiver. Design is fundamentally a user centered discipline. If you do it, it's your fault. You're just bad designer.",
      "gist": "The Fall in Love with Design",
      "headline": "The problem I see with lots of designers is that they fall in love with design",
      "start": 3228890,
      "end": 3663120,
      "id": "ep_39_ch_14"
    },
    {
      "summary": "You learn something about people, about what they. behave and what they think. It's something that you can't skim. These needs are not necessarily just designers fulfilling requests, but it's more about identifying deficiencies or moving things in a certain direction.",
      "gist": "Questions about the Needs of the Client",
      "headline": "Moritz: Sometimes it's very clear cut and other times it's open",
      "start": 3663420,
      "end": 3708980,
      "id": "ep_39_ch_15"
    },
    {
      "summary": "Paolo: I see it as the natural cycle of a process that started years ago. In humanities, especially to digital humanities, that's the field we are working in. Now they have incorporated design as a competence. There are positive and negative aspects, but I'm totally happy with that.",
      "gist": "The role of design in the humanities",
      "headline": "You've been doing a lot of work in the digital humanities",
      "start": 3709880,
      "end": 3997750,
      "id": "ep_39_ch_16"
    },
    {
      "summary": "Raw is an open source tool based on angularjs and the other side is SD three. It was started as a lateral project for information designers. It's growing, it's evolving and it's quite big now with like ten different chart types. It is a positive example on how a side project could evolve and become something more.",
      "gist": "Raw",
      "headline": "Raw is an open source tool for creating rough visualizations",
      "start": 3999850,
      "end": 4598806,
      "id": "ep_39_ch_17"
    },
    {
      "summary": "Moritz: I think it's great just for getting people started and give them something quickly they can work with. He says there are many things in visualization that we picture as evil. Moritz: Should we wrap it up? If you have suggestions for guests, we're always open.",
      "gist": "A note about the",
      "headline": "Enrico: I'm a big fan of simplicity myself",
      "start": 4598928,
      "end": 4877540,
      "id": "ep_39_ch_18"
    },
    {
      "summary": "Okay. Thanks a lot, Paolo. It's been great having you here finally. Great to be with you and talk about this stuff. I mean, I love it. Bye.",
      "gist": " Paolo on Talking to People",
      "headline": "Okay. Great. Thanks a lot, Paolo. It's been great having you here finally",
      "start": 4878120,
      "end": 4894628,
      "id": "ep_39_ch_19"
    }
  ],
  "disfluencies": false,
  "entity_detection": false,
  "sentiment_analysis": false,
  "sentiment_analysis_results": null,
  "entities": null,
  "speakers_expected": null,
  "summary": null,
  "custom_topics_results": null,
  "is_deleted": null,
  "episode_num": "39",
  "episode_metadata": {
    "speakers": [
      "Enrico Bertini",
      "Moritz Stefaner",
      "Paolo Ciuccarelli"
    ],
    "WPid": "197",
    "url": "https://datastori.es/podlove/file/435/s/feed/c/mp3/datastories-39.mp3",
    "episode_title": "DensityDesign w/ Paolo Ciuccarelli"
  }
}