{
  "id": "f1a3954e-8fac-4326-9ae5-ff65bbdadd72",
  "language_model": "assemblyai_default",
  "acoustic_model": "assemblyai_default",
  "language_code": "en_us",
  "status": "completed",
  "audio_url": "https://datastori.es/podlove/file/3456/s/feed/c/mp3/90-visualizing-without-drawing-with-brendan-dawes.mp3",
  "utterances": [
    {
      "end": 7634,
      "speaker": "Brendan Dawes",
      "start": 200,
      "text": "What's interesting, from a data point of view, it doesn't abstract the data into any other form. The data is the form.",
      "id": "ep_90_ut_0"
    },
    {
      "end": 54932,
      "speaker": "Moritz Stefaner",
      "start": 12094,
      "text": "Data stories is brought to you by click. Are you missing out on meaningful relationships hidden in your data? Unlock the whole story with Qlik sense through personalized visualizations and dynamic dashboards which you can download for free at Qlik Datastories. That's Qlik derivatives stories. Hey, everyone, it's a new data stories. Hi, Enrico.",
      "id": "ep_90_ut_1"
    },
    {
      "end": 56724,
      "speaker": "Enrico Bertini",
      "start": 55028,
      "text": "Hey, Moritz, how are you?",
      "id": "ep_90_ut_2"
    },
    {
      "end": 58376,
      "speaker": "Moritz Stefaner",
      "start": 56804,
      "text": "Good, good, how are you?",
      "id": "ep_90_ut_3"
    },
    {
      "end": 66696,
      "speaker": "Enrico Bertini",
      "start": 58500,
      "text": "Yeah, I'm good. Back from holidays, unfortunately, but I had a great time. I had a great time. Just getting some rest.",
      "id": "ep_90_ut_4"
    },
    {
      "end": 67328,
      "speaker": "Moritz Stefaner",
      "start": 66800,
      "text": "Very good.",
      "id": "ep_90_ut_5"
    },
    {
      "end": 79408,
      "speaker": "Enrico Bertini",
      "start": 67376,
      "text": "And enjoying New York a little bit. And yeah, I managed to work on a few side projects, which was really nice. A really good feeling.",
      "id": "ep_90_ut_6"
    },
    {
      "end": 80144,
      "speaker": "Moritz Stefaner",
      "start": 79496,
      "text": "Very cool.",
      "id": "ep_90_ut_7"
    },
    {
      "end": 83304,
      "speaker": "Enrico Bertini",
      "start": 80224,
      "text": "Yeah, yeah, that's good. Yeah. How about you?",
      "id": "ep_90_ut_8"
    },
    {
      "end": 89744,
      "speaker": "Moritz Stefaner",
      "start": 83384,
      "text": "Good. Having a good start back into the year and. Yeah, fairly stressless. And a few new projects, so I'm excited.",
      "id": "ep_90_ut_9"
    },
    {
      "end": 91194,
      "speaker": "Enrico Bertini",
      "start": 89824,
      "text": "Yeah, that's great.",
      "id": "ep_90_ut_10"
    },
    {
      "end": 93750,
      "speaker": "Moritz Stefaner",
      "start": 91694,
      "text": "We also have something new for data stories.",
      "id": "ep_90_ut_11"
    },
    {
      "end": 94766,
      "speaker": "Enrico Bertini",
      "start": 93862,
      "text": "Yep, yep.",
      "id": "ep_90_ut_12"
    },
    {
      "end": 106990,
      "speaker": "Moritz Stefaner",
      "start": 94830,
      "text": "So this next few weeks and months, we will try to make data stories a crowdfunded podcast. That means we used to have corporate sponsors and we want to have it sponsored by you, by our listeners.",
      "id": "ep_90_ut_13"
    },
    {
      "end": 152154,
      "speaker": "Enrico Bertini",
      "start": 107062,
      "text": "Yeah, that's a big change. And we are really hoping to make it happen over the next few weeks or even months. We started promoting the crowdsourcing on Twitter, Facebook and all of our channels, if you don't know. So we are doing that on Patreon. Patreon is a new platform that makes this kind of crowdfunding initiative way, way easier than they used to be. And basically one of the most important aspects of how Patreon works is that you basically pay only when we publish something. So it really does feel like painting for what we do. Right. So if we don't produce anything, you just don't pay, which I think it's a really good model. Right?",
      "id": "ep_90_ut_14"
    },
    {
      "end": 172774,
      "speaker": "Moritz Stefaner",
      "start": 152234,
      "text": "Yeah. And you also decide how much you pay. So it's basically like a voluntary subscription and. Yeah, totally voluntary. We don't threaten to stop anything. But yeah, if you enjoy our show and want to contribute and help us produce the show, then now you have a chance to contribute.",
      "id": "ep_90_ut_15"
    },
    {
      "end": 205464,
      "speaker": "Enrico Bertini",
      "start": 173274,
      "text": "I just want to point out that once we manage to switch to the crowdfunding source completely, we'll get rid of ads. But I also want to clarify that we never had a problem with any of the company that we advertise in the past. We've always been very free to talk about anything. So it's not because we received any pressure of any kind from these companies. Actually, that's a good opportunity to say thank you to all the companies that helped us. Right. I think that's important to point out.",
      "id": "ep_90_ut_16"
    },
    {
      "end": 210200,
      "speaker": "Moritz Stefaner",
      "start": 205504,
      "text": "Yeah, absolutely. No, no, and it's a model. We can also continue. This is more like an experiment.",
      "id": "ep_90_ut_17"
    },
    {
      "end": 211144,
      "speaker": "Enrico Bertini",
      "start": 210272,
      "text": "Exactly.",
      "id": "ep_90_ut_18"
    },
    {
      "end": 244510,
      "speaker": "Moritz Stefaner",
      "start": 211304,
      "text": "We just thought over the holidays, man, that would be the ideal setup if actually the listeners would carry the whole thing together with us. But if it doesn't happen, that's fine, too. So anyways, yeah, go to the website, there's the link to the Patreon page and you'll find more details there. Yeah, we would be happy if you contribute, but enough about us. Let's get into the show. And as usual, we have a special guest on the show this time around. It's Brandon Dawes from the north of England. A lovely British accent. Hello, Brandon.",
      "id": "ep_90_ut_19"
    },
    {
      "end": 245334,
      "speaker": "Enrico Bertini",
      "start": 244582,
      "text": "Hey, Brendan.",
      "id": "ep_90_ut_20"
    },
    {
      "end": 246646,
      "speaker": "Brendan Dawes",
      "start": 245414,
      "text": "Hello, Moritz. How are you?",
      "id": "ep_90_ut_21"
    },
    {
      "end": 248134,
      "speaker": "Moritz Stefaner",
      "start": 246710,
      "text": "Fantastic. How are you?",
      "id": "ep_90_ut_22"
    },
    {
      "end": 250902,
      "speaker": "Brendan Dawes",
      "start": 248294,
      "text": "I'm very well, Enrico. How are you? You good?",
      "id": "ep_90_ut_23"
    },
    {
      "end": 252054,
      "speaker": "Enrico Bertini",
      "start": 250958,
      "text": "I'm good, yeah.",
      "id": "ep_90_ut_24"
    },
    {
      "end": 260154,
      "speaker": "Brendan Dawes",
      "start": 252134,
      "text": "Lovely to be here. Thank you so much for inviting me on the show. I'm not sure what I'm doing here, really, but, you know, I'll try and give it a go.",
      "id": "ep_90_ut_25"
    },
    {
      "end": 277124,
      "speaker": "Enrico Bertini",
      "start": 260744,
      "text": "You know, Brendan, we love to have British voices on the show because we are always. So, at the beginning of the show, there was one person describing our show as something like beautiful or interesting exotic euro voices.",
      "id": "ep_90_ut_26"
    },
    {
      "end": 281176,
      "speaker": "Moritz Stefaner",
      "start": 278824,
      "text": "So that's your main qualification at this point.",
      "id": "ep_90_ut_27"
    },
    {
      "end": 293862,
      "speaker": "Enrico Bertini",
      "start": 281240,
      "text": "So this exotic euro voices, it's been there forever. So every time we have a British on the show, it's like we have a proper accent here going, well, I.",
      "id": "ep_90_ut_28"
    },
    {
      "end": 298274,
      "speaker": "Brendan Dawes",
      "start": 293878,
      "text": "Think yours sounds much more exotic than mine, both of you, actually, but, yeah.",
      "id": "ep_90_ut_29"
    },
    {
      "end": 300766,
      "speaker": "Enrico Bertini",
      "start": 299294,
      "text": "That's the funny thing.",
      "id": "ep_90_ut_30"
    },
    {
      "end": 303670,
      "speaker": "Moritz Stefaner",
      "start": 300910,
      "text": "Yeah, that's the thing with being exotic. It's different for everybody.",
      "id": "ep_90_ut_31"
    },
    {
      "end": 304674,
      "speaker": "Brendan Dawes",
      "start": 303702,
      "text": "Yeah, exactly.",
      "id": "ep_90_ut_32"
    },
    {
      "end": 311034,
      "speaker": "Moritz Stefaner",
      "start": 305454,
      "text": "So, Brendan, can you tell us a bit about who you are, what you do, what you're working on usually?",
      "id": "ep_90_ut_33"
    },
    {
      "end": 383984,
      "speaker": "Brendan Dawes",
      "start": 311574,
      "text": "Yeah, my name's Brendan. I'm a designer and I guess a bit of an artist. And I do lots of different things. I make physical electronic things. I do video installations, bits of software, things on the web, all sorts of stuff, really. And sometimes quite a lot of my work has been with using data as a material, I would say. So, yeah, I've become a little bit known for Dataviz work. I'm not super hardcore Dataviz person. That's just one of the things I do, but, yeah, and I used to be a director of an agency with 30 people many years ago and left that about five years ago now and was always doing things on my own and then decided to make a break from that because you end up just managing people when you've got an agency that big. So now, yeah, five years I left that, and it's been great. Very lucky to be able to do what I do and push some pixels around the screen and get paid for it. It's nice.",
      "id": "ep_90_ut_34"
    },
    {
      "end": 399012,
      "speaker": "Moritz Stefaner",
      "start": 385364,
      "text": "It's such an interesting development because I know very little people who did that step, like build up an agency, but then actually go back to freelance and working on themselves. And for you, it seemed to have worked out really well. So I think it's great to see that model work.",
      "id": "ep_90_ut_35"
    },
    {
      "end": 412344,
      "speaker": "Brendan Dawes",
      "start": 399108,
      "text": "Yeah, you are trying to get work all the time as well as, you know, you can't just put your feet up. But, yeah, so far, Touchwood, it's worked out well.",
      "id": "ep_90_ut_36"
    },
    {
      "end": 459154,
      "speaker": "Moritz Stefaner",
      "start": 414564,
      "text": "Yeah. You said you're not a hardcore data visualization person, but I think that's exactly the interesting thing because we have a lot of people on the show who are in the core data visualization area and think about charts and how to make better charts or think about data analysis. And I think you have a bit of a different perspective on data, and you work in a bit of different way with data. And I think that's very interesting. And maybe we just talk about a few of your projects and how you work and maybe then touch on a few wider themes and how it relates to the data visualization. So one absolute classic project from you is cinema redux, I guess. Is this probably your best known project? I would say your big hit?",
      "id": "ep_90_ut_37"
    },
    {
      "end": 587488,
      "speaker": "Brendan Dawes",
      "start": 459274,
      "text": "Yeah. Yeah, this is like. Yeah, this is like. Yeah, like you say, my triple gatefold sleeve album. This is. Yeah, this. And this was something that. It's weird. When I first did it, I mean, I don't think I ever thought of it as a piece of data visualization. And it came out of just playing around. Like all of us, we do, we play around with stuff, and this was just, I think it was a rainy winter Saturday afternoon, and I was just playing around with stuff. And I'm kind of obsessed with film, and so I was looking at how I could reinterpret film, and, and it's one of those things that you put it out there. You know, I didn't really think. I thought, oh, it's quite nice, you know, maybe there's something in it, and it's. I'm always surprised at what other people think and the reaction, you know, as you, as, you know, you. I don't know about you guys, but I always hate the work I do. Well, not hate is probably a strong word, but, you know, you only ever see the flaws. Right. So you put this work out there and you. Yeah, I think it's all right. And then you move on to the next thing. And then it seemed to get a bit of a, you know, a life going to it. It was featured on blogs, and it took a. It actually took a few years. You know, it's. Someone picked up on it straight away, and then it's, you know. And then it went away again. And then. Yeah, it got into moma, designing the elastic mind and the permanent collection eventually. And it's. It's still touring the world, I think. It's currently in Mexico City as we speak. So it's. Yeah, it's been. And that was developed a life off its own. Yeah. And that was 2004, when I first did it, and it's still going strong now. So, yeah, it's been. It's been a nice thing to. And also, the other nice thing is everyone seems to know it, and if someone does something similar, they refer to it as a cinema redux, which is quite nice. So maybe after I'm dead, at least there's someone who remember. Remember that, maybe. I don't know.",
      "id": "ep_90_ut_38"
    },
    {
      "end": 604824,
      "speaker": "Moritz Stefaner",
      "start": 587536,
      "text": "Yeah, maybe. For those who don't know it, let's describe it briefly. It's always difficult on a podcast. Check out the images because they are really striking and stunning. But what it does is basically, it's a summary of a movie in one picture, and it consists of still frames. Is it 1 /minute or.",
      "id": "ep_90_ut_39"
    },
    {
      "end": 690112,
      "speaker": "Brendan Dawes",
      "start": 604904,
      "text": "Yeah, it's. One row represents 60 seconds of the movie. So there's 60. 60. It samples it every second. And I guess what's interesting, from a data point of view, it doesn't abstract the data into any other form. The data is the form, which is quite different to a lot of how data visualization is done, of course. And I didn't really think about that at the time, but I guess that one is one interesting aspect. It does that for the entire film. You can see the ebb and flow of the editing process or the colors that are used, that kind of thing. And I think I also did it because, you know, we don't have things on our shelves anymore, really, like, you know, dvd's and things. And the idea was, how could you physicalize digital stuff so you could have this on your wall and have it in your house? And someone would come in and go, I didn't know you liked Hitchcock's vertigo. Maybe it would be a conversation starter or something. And I'm kind of obviously, a lot of times obsessed with that idea. So, yeah, that's how it, that's how it came about. And the reaction people, I don't know. I actually don't know why people love it, but they just seem to. Yeah, it's quite, you know, it's such a simple thing as well. It's from a code point of view, it's probably the simplest project I've ever done.",
      "id": "ep_90_ut_40"
    },
    {
      "end": 694232,
      "speaker": "Moritz Stefaner",
      "start": 690288,
      "text": "You know, loading the movie for loop export images.",
      "id": "ep_90_ut_41"
    },
    {
      "end": 694880,
      "speaker": "Brendan Dawes",
      "start": 694288,
      "text": "Exactly.",
      "id": "ep_90_ut_42"
    },
    {
      "end": 697240,
      "speaker": "Moritz Stefaner",
      "start": 694992,
      "text": "You could probably do it in ffmpeg. In a one line.",
      "id": "ep_90_ut_43"
    },
    {
      "end": 700454,
      "speaker": "Brendan Dawes",
      "start": 697272,
      "text": "Yeah, exactly. Yeah. Yeah. You could.",
      "id": "ep_90_ut_44"
    },
    {
      "end": 705898,
      "speaker": "Enrico Bertini",
      "start": 701074,
      "text": "You could even make a little app that turns any, any movie you like into.",
      "id": "ep_90_ut_45"
    },
    {
      "end": 717546,
      "speaker": "Brendan Dawes",
      "start": 706066,
      "text": "Yeah. The same that's being talked about. I think there was an app, someone did do an app that could do something similar, you know, and I think, great. That's a really nice thing. Yeah.",
      "id": "ep_90_ut_46"
    },
    {
      "end": 723706,
      "speaker": "Moritz Stefaner",
      "start": 717610,
      "text": "Maybe the iPhoto, the zoom out version on the iPhone, has, has a very similar thing. You zoom out of your photo.",
      "id": "ep_90_ut_47"
    },
    {
      "end": 724114,
      "speaker": "Brendan Dawes",
      "start": 723810,
      "text": "Yes.",
      "id": "ep_90_ut_48"
    },
    {
      "end": 725546,
      "speaker": "Moritz Stefaner",
      "start": 724154,
      "text": "Yeah, maybe it was inspired.",
      "id": "ep_90_ut_49"
    },
    {
      "end": 732264,
      "speaker": "Brendan Dawes",
      "start": 725650,
      "text": "Maybe. Maybe I'll take that. It probably wasn't, but yeah, I'll take it. Yeah.",
      "id": "ep_90_ut_50"
    },
    {
      "end": 756836,
      "speaker": "Enrico Bertini",
      "start": 733404,
      "text": "That's the aspect I like the most about the project, its simplicity and still how effective it is. Right. So I've been looking back at some of the images that you have in your, in your website. I just can't stop flipping through this. The movies is like, I think I keep comparing them. Right. And also trying to figure out why you have two or three rows that look different.",
      "id": "ep_90_ut_51"
    },
    {
      "end": 757396,
      "speaker": "Brendan Dawes",
      "start": 756980,
      "text": "Yeah.",
      "id": "ep_90_ut_52"
    },
    {
      "end": 764190,
      "speaker": "Enrico Bertini",
      "start": 757460,
      "text": "Then maybe there are just a couple of frames that are red. Yeah, it's fascinating. It's really fascinating.",
      "id": "ep_90_ut_53"
    },
    {
      "end": 792466,
      "speaker": "Brendan Dawes",
      "start": 764262,
      "text": "Yeah. Because it's obviously, you'll see, normally you're seeing them at 24 frames a second, and so you don't notice the odd, you know, maybe that full screen flash of red or whatever. Yeah. So. And I think that maybe that's what people like about it. And, you know, we have a gallery of them, and people tend to buy the ones that mean something to them. So, you know, like anything, you know, it's. That's the ones they want to purchase. Yeah.",
      "id": "ep_90_ut_54"
    },
    {
      "end": 794490,
      "speaker": "Enrico Bertini",
      "start": 792530,
      "text": "Is it permanent at MOMA?",
      "id": "ep_90_ut_55"
    },
    {
      "end": 834932,
      "speaker": "Brendan Dawes",
      "start": 794682,
      "text": "It's in the permanent collection, so it's not permanently on display. So they, they have it in their permanent collection. And so I think it was in another exhibition. They used it in Seoul, in Korea. They had a tiny exhibition visiting thing there, so, so they can use it whenever they want. And I think they've used it in MoMA, have used it in three exhibitions, but the main one that's been used in a lot is big bang data. So that continues to just go around the world, and it's nice to see it on Instagram. Suddenly a cinema redux pops up, especially people in front of it and looking at it. I really like those photographs.",
      "id": "ep_90_ut_56"
    },
    {
      "end": 855986,
      "speaker": "Moritz Stefaner",
      "start": 834988,
      "text": "Yeah, it's nice. And I think it's so interesting that you say you don't really know why exactly. This one caught on, probably. You have 100 experiments like this and some of them in your drawers, some of them published. Yeah, but one hits a nerve and develops this life of its own. But probably you couldn't have done just the one. You need to do the 99 other ones as well.",
      "id": "ep_90_ut_57"
    },
    {
      "end": 857802,
      "speaker": "Brendan Dawes",
      "start": 856050,
      "text": "Yeah, that's the thing.",
      "id": "ep_90_ut_58"
    },
    {
      "end": 858954,
      "speaker": "Moritz Stefaner",
      "start": 857858,
      "text": "Otherwise it would be easier.",
      "id": "ep_90_ut_59"
    },
    {
      "end": 895484,
      "speaker": "Brendan Dawes",
      "start": 859034,
      "text": "Well, that's it. That wasn't the first one I did. I did some other things, different treatments. And that's one of the great things about programming. You can change a few variables and get a totally different aesthetic. But the problem with that is when do you stop? You know, so commercially, that's usually because of budget or time and a combination of the two. So. But, yeah. And also you get bored, you know, you think, right, I'm kind of done with this now, so let's move on. So it was very much an iterative thing, and that was the one, I think, that struck a chord.",
      "id": "ep_90_ut_60"
    },
    {
      "end": 933384,
      "speaker": "Enrico Bertini",
      "start": 895564,
      "text": "Yeah, yeah. And it vaguely reminds me of. I don't know if you've ever heard of this idea of indexical visualization we had on the show, Dietmar Offenhuber, who's been talking about this idea, been, yeah. Researching this idea of indexical visualizations, which is basically, I still have to figure out what is the exact definition, but I think basically it's visualizations that you are visualizing the phenomenon by showing the phenomenon directly. The object itself displays the phenomenon that you want to visualize.",
      "id": "ep_90_ut_61"
    },
    {
      "end": 934464,
      "speaker": "Brendan Dawes",
      "start": 933504,
      "text": "Yeah, yeah.",
      "id": "ep_90_ut_62"
    },
    {
      "end": 938792,
      "speaker": "Enrico Bertini",
      "start": 934624,
      "text": "And there's a name, it strikes me like a similar. Similar example here.",
      "id": "ep_90_ut_63"
    },
    {
      "end": 962162,
      "speaker": "Brendan Dawes",
      "start": 938848,
      "text": "Yeah, yeah, yeah, yeah, that's it. It's. And I actually read, there was a guy who did a thesis on it and he mentioned it was. He picked up on that and I hadn't really thought about it. And it was only when I read it in this thesis was like, oh, yeah, it is. That's what that is. Yeah. So it's interesting. Yeah, that's great.",
      "id": "ep_90_ut_64"
    },
    {
      "end": 1001814,
      "speaker": "Moritz Stefaner",
      "start": 962298,
      "text": "So, yeah. And that, I think, also brings us to another big area of your work. You do a lot of very artistic, aesthetic data representations that are maybe not strictly charts or graphs or diagrams, but I think you think about data and how we can represent it in a totally different way. So you do a lot of interactive installations, I guess, where you might have live streams of data or some user generated data. I found the Doris Le Bot ( https://brendandawes.com/projects/dorislebot ) project very interesting, where you would generate a little creature, basically, for Twitter users. Can you explain how that works?",
      "id": "ep_90_ut_65"
    },
    {
      "end": 1200430,
      "speaker": "Brendan Dawes",
      "start": 1003634,
      "text": "That's one of my favorite projects, I have to admit. And it was done quite quickly. So a studio called Bright in France got in touch with me, and they were doing a marketing event for Twitter in Paris, and they wanted to. For someone to create a creative use of Twitter. And they were inviting all these marketing companies from across France to have this night of look. This is how Twitter can be used creatively in marketing campaigns, etcetera. So they showed me the venue, and the venue was this really cool space that had all these screens built into the walls. And they were kind of. They reminded me more of windows rather than screenshots. I said, well, what if we were looking through. Imagine it wasn't a screen, but we're looking through a window at some creatures swimming round. Or I said, not in a kind of cheesy aquarium screensaver kind of way, but maybe there's something we can do with that. So I created a system where people could tweet into it, and it took their Twitter profile, and we worked out some metrics, such as how, you know, how. How long have they been on Twitter? How active are they on Twitter? That kind of thing. How many followers did they have? How many people do they follow and use that as a kind of DNA for the. For the creature? So the main body shape is based off the Twitter profile id. I'll just use some little algorithm to create a shape. And then there's things like, if they have really big eyes, it means they're more voyeuristic. So that's if they're following more people than is following them, and their bodies are more colorful, if they actually are quite prolific on Twitter. And then we had bots. So we had these representations of bots that would really hassle the popular people, and there's these squares following them around. Anyway. So, yeah, it was just like a one night thing, and it worked really, really well. And the creatures, in the end, what happened was, because they're all generated in real time, and they're these 3d meshes. I got my friend at the local university, they've got a big 3d printing lab and full color one. So I took some of the models down and we printed them out as full color 3d prints and then gave some to the client. And so I always like doing stuff like that. That is not part of the brief and these little side effects come out of the project. So, yeah, that was, and I have to tell you, the money involved with that was not amazing. It wasn't great, but I've had lots of work off the back of it. So I think it's, you know, oftentimes it's about value. You know, how can you leverage value out of these things? It's not just about the money you paid, but I got quite a bit of pr out of it and it leads to all the work. So it's all good now you get.",
      "id": "ep_90_ut_66"
    },
    {
      "end": 1202382,
      "speaker": "Moritz Stefaner",
      "start": 1200462,
      "text": "Invited to a famous podcast and everything.",
      "id": "ep_90_ut_67"
    },
    {
      "end": 1206758,
      "speaker": "Brendan Dawes",
      "start": 1202438,
      "text": "Yeah, exactly. This is the pinnacle of that work right now.",
      "id": "ep_90_ut_68"
    },
    {
      "end": 1209278,
      "speaker": "Enrico Bertini",
      "start": 1206806,
      "text": "This moment, it all let us go.",
      "id": "ep_90_ut_69"
    },
    {
      "end": 1210754,
      "speaker": "Brendan Dawes",
      "start": 1209406,
      "text": "Yeah, exactly.",
      "id": "ep_90_ut_70"
    },
    {
      "end": 1227624,
      "speaker": "Moritz Stefaner",
      "start": 1212734,
      "text": "That's amazing. Yeah, but I think it's so. Yeah, and I think that there's a huge value in, like, just taking an idea and just running with it. I totally agree. But, yeah, at the same time, you have to think about when you do that. You can't do that every time. Right?",
      "id": "ep_90_ut_71"
    },
    {
      "end": 1269326,
      "speaker": "Brendan Dawes",
      "start": 1227744,
      "text": "Yeah, yeah. I've had, you know, people look at it. One of the projects I'm working on now is this 30 screen video thing, and they kept referencing Doris Le Bot ( https://brendandawes.com/projects/dorislebot ), and it was actually even used in their early press materials to say that I was going to be building this thing for them. And they used that in the press release because people, they really like it, and it's very simple to understand as well. It's like, that's a creature made from your Twitter profile. So, yeah, again, it's been another one that's been great for me. Really fun to work on. Timeline was really short, but you don't have time to overthink it, which I think is a good thing.",
      "id": "ep_90_ut_72"
    },
    {
      "end": 1283346,
      "speaker": "Moritz Stefaner",
      "start": 1269430,
      "text": "Yeah, I think what's interesting that what really shows is that you have, you do have a long background in tinkering and playing with code and also working in generative design and creative code in this processing type of world.",
      "id": "ep_90_ut_73"
    },
    {
      "end": 1284014,
      "speaker": "Brendan Dawes",
      "start": 1283410,
      "text": "Right.",
      "id": "ep_90_ut_74"
    },
    {
      "end": 1316796,
      "speaker": "Moritz Stefaner",
      "start": 1285354,
      "text": "So you have a certain toolkit or a certain mindset also that we could do something like swarm like, or something with creatures and particles and somebody who might more think about, okay, what data do we have and what's the best forum to represent that data might end up with something more chart like. But because you have this sort of mixed background, I think you immediately think in different terms and you can also come up with these types of things then quick, because you need to have this experience, of course, how to do these things.",
      "id": "ep_90_ut_75"
    },
    {
      "end": 1389504,
      "speaker": "Brendan Dawes",
      "start": 1316860,
      "text": "Yeah, I think it's more. Yeah, it's an attitude. To me, everything is numbers and I like to take those numbers and use them to generate things with. So it's just an attitudinal thing. And it's weird. I had someone on Instagram the other day. I think it was about the audio player thing I'd done. And he said to me, can I just ask, what industry did you study and what industry are you in? And I said, well, I'm completely uneducated. I never went to university, college, nothing. And I guess I said, and, you know, and I'm a designer by profession, but I said, I'm just curious. That's the number one thing to be, is just. I'm just curious about, you know, can I make that thing work? Or, you know, so that's what really drives me. It's not about what, how I've been educated or anything like that, but it's just strange how some people go. Their first question is, okay, what can I study to do that? I think you just have to be curious and interested in things.",
      "id": "ep_90_ut_76"
    },
    {
      "end": 1394284,
      "speaker": "Moritz Stefaner",
      "start": 1391164,
      "text": "But he didn't ask you what your day job is at least?",
      "id": "ep_90_ut_77"
    },
    {
      "end": 1397024,
      "speaker": "Brendan Dawes",
      "start": 1394444,
      "text": "No, your actual job.",
      "id": "ep_90_ut_78"
    },
    {
      "end": 1399864,
      "speaker": "Moritz Stefaner",
      "start": 1398244,
      "text": "That's good. That's a start.",
      "id": "ep_90_ut_79"
    },
    {
      "end": 1402664,
      "speaker": "Brendan Dawes",
      "start": 1400444,
      "text": "It's a bit hard to describe for one.",
      "id": "ep_90_ut_80"
    },
    {
      "end": 1427874,
      "speaker": "Moritz Stefaner",
      "start": 1404684,
      "text": "And one more question. You also have a couple more, let's say, data artwork pieces, like the digital city portraits, which I really like, and a few other ones. What's your like? Do you get a lot of visits from the data visualization police who say, like, you can't do that? It's, like, totally unreadable and we have to arrest you now, or do they mostly ignore you?",
      "id": "ep_90_ut_81"
    },
    {
      "end": 1592480,
      "speaker": "Brendan Dawes",
      "start": 1428414,
      "text": "They mostly ignore me. I don't really. Yeah, I have massive. You know what I had? I'll tell you a story. I had a massive sort of crisis of confidence working on a project just before Christmas. I was on a team that was working on some VR stuff, and they had. And I was brought into sort of make it look more beautiful, which is usually what I'm brought in to do. And they had this brilliant data guy on the team, data scientist, really knew his stuff. And when he was talking on this conference call, I was like, God, I don't know any of this stuff. It was methodologies and all this kind of stuff. I'm like, I don't know. I just. So I got off the corner. God, I don't know. I know nothing about data visualization. I know what makes me happy, and I think I know how to communicate something. And graphic design is my passion, and I like aesthetics and composition, and that's what I study. I don't I don't know anything about the science of Dataviz. Right. So it's a little bit, which is why I've never really communicated. It's like, I'll give you, you know, I did this James Bond kills thing, and it was, it was, it was, it was a tribute to Moritz Binder, who did the lot of the titles for James Bond, and he did the Doctor, no titles. And so I did it in the style of the Doctor, no title sequence. And there was someone online who said, this is terrible. It's like, it's a bar chart on, using different, you know, sizes of, on this bar chart, which is like, you just don't do that. And I said, it isn't a bar chart. You know, you're seeing it as a bar chart. I was, I wasn't trying to make a bar chart. Why? You know, so it's, it's that kind of, can be a little bit annoying. But you know what? I have total respect for people who are so, you know, the rigor of data visualization and, you know, the stories that reveal important stuff as well. So it's, that's just not me. I did, my brain doesn't work in that way, which is why I. Yeah, so I don't, I don't go on lots of Dataviz blogs or, you know, and I know what I like, you know, and which is why I sort of engage with your stuff. It's like, I think you've got the best strapline of any Dataviz person. Truth and beauty is like, what's better than that? You know, it's two beautiful things.",
      "id": "ep_90_ut_82"
    },
    {
      "end": 1593496,
      "speaker": "Moritz Stefaner",
      "start": 1592512,
      "text": "You can't say no to that.",
      "id": "ep_90_ut_83"
    },
    {
      "end": 1635594,
      "speaker": "Brendan Dawes",
      "start": 1593560,
      "text": "No, exactly. It just totally, totally sums up what you do. And so, yeah, so I've always been on the peripheries of that. And weirdly, I never get invited to speak at Dataviz conferences, ever, which is, you know, telling, I think, because I think they just think I'm a bit crap. So, you know, I don't mind that. I don't want to. I don't want to be a Dataviz person. You know, the stuff I'm working on right now, I mean, you could say, is some Dataviz things, but they're kind of, they're more about the beauty and aesthetics and the narrative rather than, you know, creating charts or something.",
      "id": "ep_90_ut_84"
    },
    {
      "end": 1673652,
      "speaker": "Moritz Stefaner",
      "start": 1635934,
      "text": "Yeah. And I think that also explains why you resonate in a much wider, wider context. But I think at the same time, you can bring a lot of really interesting perspectives also to the data visualization community. And I also noticed you don't show up at the typical conferences as speaker, but you speak a lot at, let's say, interaction design conferences, general design conferences, society related stuff. But it's interesting. But often I think it's also just more or less how things fall into place. And you have always had a background more in the creative coding and designs.",
      "id": "ep_90_ut_85"
    },
    {
      "end": 1719082,
      "speaker": "Brendan Dawes",
      "start": 1673708,
      "text": "I think what interests me is popular culture. I've always been. That's what's always, you know, people say to me, you go to a city and you go, are you going to go to that museum? I said, no, I've just been to the supermarket. It was brilliant, you know, because there's like all these amazing products. But it's. Isn't it weird how. And I read something recently about a lot of this is sort of intellectualizing things of it's all come from the grand. When people did the grand tour, you know, and that's so. And it's the same kind of idea that, well, in order to be intellectual, we have to go to museums and things like this. It's actually, you know what I like, going around a supermarket or, you know, I think they're just as interesting. That's not dissing the other stuff. It's all part of the mix.",
      "id": "ep_90_ut_86"
    },
    {
      "end": 1722090,
      "speaker": "Moritz Stefaner",
      "start": 1719138,
      "text": "But anyway, longer story.",
      "id": "ep_90_ut_87"
    },
    {
      "end": 1722894,
      "speaker": "Brendan Dawes",
      "start": 1722202,
      "text": "Yeah.",
      "id": "ep_90_ut_88"
    },
    {
      "end": 1761316,
      "speaker": "Moritz Stefaner",
      "start": 1723314,
      "text": "Third project direction. So, as you can see already, Brennan does a lot of different types of projects, but a third sort of, let's say, whole genre, where you do a lot of work is analog interfaces and tangible Uis and maybe something like hardware mashups, where you take known things but bring them together in really new and interesting ways. And I think that has become a big part of your work. And maybe your home, in a way, is this hardware tinkering. You just completed a project called Plastic Player, which is really nice, I think.",
      "id": "ep_90_ut_89"
    },
    {
      "end": 1810954,
      "speaker": "Brendan Dawes",
      "start": 1761340,
      "text": "Yeah. Cheers. Yeah, yeah, that was. That one was. I've had this idea in my sketchbooks for years and years and years. And let me just say as well, the idea of using NFC tags or RFID has been around for a long time to play music. Ido did something years ago. There's lots of great makers and stuff who do stuff with that. It's brilliant. So there's nothing new in that. I think as I get older, I'm making less things, but I'm trying to execute them better. It's really important for me to execute well rather than make a load of stuff I sometimes get frustrated with. You see a great project and it's filmed on an iPhone that's on a pogo stick. I don't know. Why do people do that?",
      "id": "ep_90_ut_90"
    },
    {
      "end": 1815446,
      "speaker": "Moritz Stefaner",
      "start": 1813534,
      "text": "Can you describe the project?",
      "id": "ep_90_ut_91"
    },
    {
      "end": 2030484,
      "speaker": "Brendan Dawes",
      "start": 1815630,
      "text": "The project is it's an analog interface for Spotify, essentially, or it could be any digital music service. So it's a white box, and it has loads of slots in it, and in the slots are 35 millimeter slide mounts. And each slide represents an album or a playlist. And you take a slide, you place it on the certain area within the interface, and it connects to a raspberry PI over the Wi Fi, and it tells it what Spotify playlist to play, and it's all done. I don't need a computer on or it's not connecting with a desktop computer or anything like that. And that's connected to my 50 year old Band and Olufsen that I got off eBay for, like, 40 quid years ago. So there's that really old technology which still works, which, you know, a lot of new technology won't be working in five years. I'm going to look forward to that. So, yeah, and you can put an album on, and then you take the slide off and it stops it. You can put it back on and it plays it again, and then. Or you can swap it for another one. There's next and previous buttons. So, you know, I can. The idea is that I'm not, because I've got vinyl as well, and I kind of, you know, I loved. I love vinyl, and I love when you put a vinyl record on, it's the. To me, it's that anticipation just before the needle drops. To me, that's exciting, and I kind of miss the physicality of it. And let me just say, also, I love digital music. I find so many new music through it, new bands, things. It's amazing and fabulous, but I also like the physicality of the vinyl. So this project was about trying to fuse those things together. I certainly don't want it to be rose tinted spectacles. Wasn't the past great? Because I think it's not about that for me. I see that a lot, and I don't want it to be that. But, yeah, again, I put this on the Internet, and it's done really, really well. It's had lots of tweets and featured in on blogs, like course 77. And, you know, so which for me is, I use these things as a. I think side projects are great if putting yourself out there and going, this is me for potential clients, if that's, you know, that's the direction you want to go. So these are very much like my sort of cv, the things I put out there to disrupt the status quo, to get people talking, maybe to annoy people occasionally. That's good as well, but it gets people's, you know, and it's also, it's also, I would also say as well, I could just say if you're, if people are doing, listening to this and thinking about side projects and doing side projects, make sure that they're photographed well and, you know, because people are more likely to feature them if they're photographed well and written well. And so I'd really encourage everyone, if they're going to do this kind of stuff or are doing this kind of stuff, to make sure that's part of the process, not like an add on.",
      "id": "ep_90_ut_92"
    },
    {
      "end": 2046990,
      "speaker": "Moritz Stefaner",
      "start": 2031904,
      "text": "Yes, that's a really good point. And it's one idea only, right. But as you say, it's executed really well. So, you know, the photos look great. The whole mechanics of the thing is just nice. You know, the choice of material is good. This is all there.",
      "id": "ep_90_ut_93"
    },
    {
      "end": 2092562,
      "speaker": "Brendan Dawes",
      "start": 2047062,
      "text": "But, you know, the slide mounts thing, I've had a box, these boxes, slide mounts in a drawer for ten years, right. And, you know, and I thought, I'm not going to throw them away because I know one day. And it's also, what interests me about technology is because I thought about doing this years ago and it's really only RFID that was available, but RFID is quite big and chunky, relatively. And now with NFC, you can get these just tiny thin stickers, so now you can't even see the magic sort of thing. So it seemed more, more doable now in the way I wanted to do it. So, yeah, I get a lot of requests going, where can I buy this? And where's the Kickstarter page? Yeah, no, and it's just by a.",
      "id": "ep_90_ut_94"
    },
    {
      "end": 2094374,
      "speaker": "Moritz Stefaner",
      "start": 2092578,
      "text": "Lot of slide modes on eBay.",
      "id": "ep_90_ut_95"
    },
    {
      "end": 2121053,
      "speaker": "Brendan Dawes",
      "start": 2095553,
      "text": "I mean, electronic projects on Kickstarter always go well, don't they? No problem. So, yes, and the thing is, I'm moving on and doing other things and I just like to put these things out there and get people to talk about them. So I'm more about that, really. I'm probably a rubbish businessman, to be honest, but there you go.",
      "id": "ep_90_ut_96"
    },
    {
      "end": 2125172,
      "speaker": "Enrico Bertini",
      "start": 2123004,
      "text": "Yeah, but I would totally bite it.",
      "id": "ep_90_ut_97"
    },
    {
      "end": 2125516,
      "speaker": "Brendan Dawes",
      "start": 2125228,
      "text": "Yes.",
      "id": "ep_90_ut_98"
    },
    {
      "end": 2126188,
      "speaker": "Enrico Bertini",
      "start": 2125580,
      "text": "Beautiful.",
      "id": "ep_90_ut_99"
    },
    {
      "end": 2132284,
      "speaker": "Brendan Dawes",
      "start": 2126276,
      "text": "Oh, thank you. Yeah, it's, it needs more iterations and stuff, but, yeah, and that kind of.",
      "id": "ep_90_ut_100"
    },
    {
      "end": 2141188,
      "speaker": "Enrico Bertini",
      "start": 2132324,
      "text": "Object that people enter in the room and say, what? What is that? And when you show them what it is and how it works, it's like, whoa, now I want one.",
      "id": "ep_90_ut_101"
    },
    {
      "end": 2151522,
      "speaker": "Brendan Dawes",
      "start": 2141276,
      "text": "Yeah, my brother was the same. My brother came in and visited and I said, oh, try this. And he was like, what? How does that work?",
      "id": "ep_90_ut_102"
    },
    {
      "end": 2152066,
      "speaker": "Moritz Stefaner",
      "start": 2151618,
      "text": "Magic.",
      "id": "ep_90_ut_103"
    },
    {
      "end": 2158402,
      "speaker": "Brendan Dawes",
      "start": 2152130,
      "text": "Yeah, it was like magic, which is, you know, it's nice when you can make something that has that kind of feeling, you know? Yeah.",
      "id": "ep_90_ut_104"
    },
    {
      "end": 2203372,
      "speaker": "Moritz Stefaner",
      "start": 2158418,
      "text": "And a lot of your projects, like, point in this or in this, or, like, pick up this idea that we take something tangible or something old and known and then bring it together with this digital world, which, you know, sometimes it fits great, and sometimes there's a clash. But you always think about, like, how. What does it actually mean? Like, you know, do we want to go back to physical albums? Like, putting up one album and listening to it completely, or how does it relate to playlists and accommodations? You also did the six Monkeys project for Mailchimp, for instance, looking at how we can interact with email, like having, for instance, an off switch for email in your apartment, which would be brilliant to have. Everybody would love to have that.",
      "id": "ep_90_ut_105"
    },
    {
      "end": 2303994,
      "speaker": "Brendan Dawes",
      "start": 2203508,
      "text": "And again, that's just a simple notion, but that's the one. That project went nuts. It was crazy the amount of pr I got from it. And it was even honoured in the fast company awards. And when I looked at who else was honored in the same category, it was like, ido, MIT, and I'm just some idiot in the north of England. The light switch for email was the one that a lot of people was like, I want this, and where can I buy this? And again, it's just the. It's thinking about, you know, we're surrounded by this stuff, and because we're surrounded by it constantly, we don't notice it as much. But if we just take a moment, you know, think about light switches, they give us permission to turn off the lights. You know, if we. If that wasn't there, it'd be very difficult. So, you know, you'd have to take a screw each light bulb out sort of thing. So that's what. Yeah, that's what I was thinking about with email and then the other things, there was, you know, five other objects that were all to do with physicalizing email and our relationship with email. And, yeah, that was, again, you know, great, great client, mailchimp. Fantastic. They just let me run with it, and it was. Yeah, and as I said, it got a lot of. It got a lot of attention. So it's about, I don't care who you are or how small your team is, how big your team is, it's about putting these. These ideas into the world that are maybe a little bit different. And anyone can do that with the right idea.",
      "id": "ep_90_ut_106"
    },
    {
      "end": 2328444,
      "speaker": "Moritz Stefaner",
      "start": 2304854,
      "text": "Can I ask you, practically speaking, how do you balance out these self initiated projects and these open explorations and the tinkering and playing with the actual commissions and the more goal directed work? Do you first do a few weeks of explorations and then a few weeks of commercial projects, or is it always a mix? How does this work for you? What's a good balance?",
      "id": "ep_90_ut_107"
    },
    {
      "end": 2451118,
      "speaker": "Brendan Dawes",
      "start": 2328524,
      "text": "I think a lot of it is dictated to by how many projects I've gotten commercially and the deadlines. But I also try and use my time well. So I might be working on a commercial project and just think, I'm not feeling it today. So I'm going to watch a film or work out some code and how to do this. And a lot of the way I work is I have probably, like, you have these little experiments and you code it up and then you think, right, I might use that on something in the future. So I use any spare time like that. And I'm also. I tend to do, because I have a library of. From a code point of view, I have a library of stuff that I use a lot. I can make prototypes very, very quickly from a software point of view, and then from an electronic point of view, I know how to glue certain things together to make them quite quickly or proof of concepts I don't spend. So I can do things quite quickly. And it's just really. Yeah, it's just that balance of knowing, okay, I've got a deadline for this tomorrow, so I really need to crack on with that. You know, you have to be, you know, it's that rigor of. You just have to be a responsible person and know that. Okay, I can meet that deadline, but I can take a few hours off, you know, and whatever, and still meet it. Yeah. So it's, it's, it's just. I guess that's how it works for me. You know, I might have two months where I've got no workout. So rather than go, the world's ended and be depressed, getting bored. Yeah, I try. Okay, how can I use this time? So I'd make like, the plastic player or, I don't know, whatever, you know. Nice.",
      "id": "ep_90_ut_108"
    },
    {
      "end": 2459134,
      "speaker": "Moritz Stefaner",
      "start": 2451246,
      "text": "It's a great model. I think it's great if that works. And then these two directions can always inspire each other.",
      "id": "ep_90_ut_109"
    },
    {
      "end": 2460206,
      "speaker": "Brendan Dawes",
      "start": 2459214,
      "text": "Yeah, absolutely.",
      "id": "ep_90_ut_110"
    },
    {
      "end": 2461398,
      "speaker": "Moritz Stefaner",
      "start": 2460310,
      "text": "That's how it keeps going.",
      "id": "ep_90_ut_111"
    },
    {
      "end": 2462834,
      "speaker": "Brendan Dawes",
      "start": 2461486,
      "text": "Yeah, yeah, definitely.",
      "id": "ep_90_ut_112"
    },
    {
      "end": 2471074,
      "speaker": "Enrico Bertini",
      "start": 2463814,
      "text": "Brendan, do you have any specific process you follow to generate new ideas or they just happen?",
      "id": "ep_90_ut_113"
    },
    {
      "end": 2616186,
      "speaker": "Brendan Dawes",
      "start": 2472254,
      "text": "I think. No, I don't know if I have a specific. I think just being open to things, open minded about things, I don't think you can force it I think if, you know, as you know, the worst thing is like sitting in front of a computer or a sketchbook and going, right, think of idea. And it just doesn't, you know, as we know, it just doesn't work like that. And I think that's why, you know, the often sighted thing of in the shower or, you know, having a shave or whatever is. I think what happens is, and I'm sure there's lots of science behind this, but your brain switches off because you're doing a task that is very automated. So, you know, for me, it's like, you know, I'm having a shave and. But my brain then starts to think about things and it's not thinking about shaving because it's automatic. So your brain goes into this kind of thing that it does that thinks about these other things that have been festering there. So I really like, I think that's important. So essentially, you know, switching off and doing something. That's why people say, go for a walk. Or, you know, oftentimes, you know, you either wake up and you go, that's why that code doesn't work. I'm an idiot. And it's a really simple solution. Or you go out and you've been trying to solve something for 3 hours or 4 hours, and then you just go out. And it's happened to me so many times, I've just gone out and come back and go. You sit down and you do it in seconds because it clears your mind. So, yeah, Enrico, I guess that's my process. If it is a kind of. I did have a great process diagram that I show at conferences. I don't know if you've seen, but it's essentially chaos. Like a scribbly line and then a circle at the other end. And it's. And that's when I show that people, they. God, that's my process as well. Yes, you have to draw a. No. And you're trying to get to this like, perfect form, you know, a circle which you never can get to. It's like this, you know, perfection is like this cruel joke that you're trying to get to. And no one ever gets to it because all you can see is the things that are wrong with it. But it's a good goal to have.",
      "id": "ep_90_ut_114"
    },
    {
      "end": 2627266,
      "speaker": "Moritz Stefaner",
      "start": 2616210,
      "text": "I think I just realized the hardware and software tinkering might be good too. Because if you work on hardware tinkering, you get manual. And then you could maybe in the back of your mind, solve software tasks. Right?",
      "id": "ep_90_ut_115"
    },
    {
      "end": 2628014,
      "speaker": "Brendan Dawes",
      "start": 2627370,
      "text": "Yeah.",
      "id": "ep_90_ut_116"
    },
    {
      "end": 2632866,
      "speaker": "Moritz Stefaner",
      "start": 2628314,
      "text": "This combination seems to be promising too. So not computer all day.",
      "id": "ep_90_ut_117"
    },
    {
      "end": 2645680,
      "speaker": "Brendan Dawes",
      "start": 2632930,
      "text": "Yeah, yeah, I often do that. I think, right, I'm going to do something, make something with my hands. If I'm doing some software installation or something, you know, just, just for an hour or something. It's. Yeah, or draw or whatever. Yeah, yeah.",
      "id": "ep_90_ut_118"
    },
    {
      "end": 2659712,
      "speaker": "Enrico Bertini",
      "start": 2645752,
      "text": "So you've been mentioning coding quite, quite, quite a bit during the interview. And I'm wondering if your default mode is always to start from code or this just one of the many, many instruments that you have.",
      "id": "ep_90_ut_119"
    },
    {
      "end": 2733622,
      "speaker": "Brendan Dawes",
      "start": 2659808,
      "text": "Yeah, I like to start coding quite early on. I mean I always start, we know. I think a pencil and a piece of paper is still just a lovely, you know, it's a great way to think because the page doesn't really. I know it can be quite frightening, but it doesn't really. You've got permission to make mistakes. That's what I like where computer is a bit more judgmental, do you know what I mean? So, yeah, but I always, I like to start making these little code coded things with every project that I work on, commercial or not, I make black and white little experiments and I share them with a client and to me they are things to criticize, they are things to start a conversation. But because I have a library and one of my libraries is available for processing, so I can make a grid or I can make a Vogel spiral or all these kind of things very quickly. It allows me to think in a visual way and just play around with stuff because I think when you're playing with code, things can come out of that process that you didn't know was there.",
      "id": "ep_90_ut_120"
    },
    {
      "end": 2734314,
      "speaker": "Enrico Bertini",
      "start": 2733678,
      "text": "Yeah.",
      "id": "ep_90_ut_121"
    },
    {
      "end": 2750452,
      "speaker": "Brendan Dawes",
      "start": 2736494,
      "text": "The unexpected stuff. Or maybe you're tilting the 3d camera in a certain way and. Oh wow, that's an interesting composition. So those kind of things. Yeah, I tend to code very, quite early on. Yeah.",
      "id": "ep_90_ut_122"
    },
    {
      "end": 2753876,
      "speaker": "Enrico Bertini",
      "start": 2750508,
      "text": "And processing is your favorite environment or.",
      "id": "ep_90_ut_123"
    },
    {
      "end": 2780862,
      "speaker": "Brendan Dawes",
      "start": 2753940,
      "text": "Yeah, I guess I have two processing and open frameworks I really love as well. It depends on the project, I think, you know, my go to tool is processing because it's hard one to describe. I find it a lot more freer in some ways where open frameworks feels a bit. And I love open frameworks, but it feels a little bit more heavier. Do you know, I see it more.",
      "id": "ep_90_ut_124"
    },
    {
      "end": 2781902,
      "speaker": "Moritz Stefaner",
      "start": 2780958,
      "text": "Different libraries.",
      "id": "ep_90_ut_125"
    },
    {
      "end": 2876474,
      "speaker": "Brendan Dawes",
      "start": 2781998,
      "text": "Yeah, exactly. Yeah. And sometimes you press that build button and you pray that it's going to say build succeeded, you know, and I know you get lots of errors in processing as well, but it feels more. And I guess it's because that's the words come from. They're called sketches, so it feels more sketch like to me and oftentimes. So the Doris Le Bot ( https://brendandawes.com/projects/dorislebot ) thing that started out in processing and then when it got to a certain point and I didn't plan this, the frame rate was really starting to drop. And I think two days before it went live, I recoded it all in open frameworks. Wow. Which is not, I wouldn't suggest people do that and follow that as a methodology because it's not, it's scary, but yeah. So sometimes, you know, you need the beefy processing power of open frameworks, you know, for print pieces. Processing is definitely better, without a doubt, because open frameworks being OpenGL is more 3d stuff I think, a lot of the time, but yeah, so it's a combination of two. Starting to get into touch designer, which is kind of crazy nuts. I used to do a lot of node based node as in graphical programming years ago, so I'm starting to get back into that again. So we'll see. But I'm up for using anything really that allows me to manifest my ideas, I think.",
      "id": "ep_90_ut_126"
    },
    {
      "end": 2902056,
      "speaker": "Moritz Stefaner",
      "start": 2877814,
      "text": "And yeah, we have to wrap up soon unfortunately. But I think, I hope people took a bit of inspiration from your approach and especially in data visualization where everybody always says you need to start with the data, you need to start with a question. Maybe it's also refreshing sometimes to just start with experimentation and ideas and sketches and charming little mechanisms and then see how they fit the data. Maybe that's a valid approach to me.",
      "id": "ep_90_ut_127"
    },
    {
      "end": 2902844,
      "speaker": "Brendan Dawes",
      "start": 2902080,
      "text": "Yeah, yeah.",
      "id": "ep_90_ut_128"
    },
    {
      "end": 2909570,
      "speaker": "Moritz Stefaner",
      "start": 2903384,
      "text": "So what's next for you? What are you working on? Can you give us a little teaser of things to come, maybe?",
      "id": "ep_90_ut_129"
    },
    {
      "end": 3078518,
      "speaker": "Brendan Dawes",
      "start": 2909722,
      "text": "I've got, one of the main projects is for a 30 screen video wall that's in the foyer. It forms the foyer of a new building in Manchester. So it's like a co working space. And I'm doing a piece for that, that there's a Microsoft connect involved. So it monitors the activity in the foyer. I bring in Twitter feeds, I bring in the weather. And so the idea is called Fermata. So Fermata is for the musicians that are listening will know that it's a musical notation that represents a note that is held longer than is normal. So I liked that idea of, okay, well all these people are passing through the foyer, let's take them and extend them beyond the normal timeframe. So it's very abstract, you can't actually see people. So it creates these moments on screen and then creates these ribbons and then there's a background of abstract Twitter data. The wind alters how the particles move. So you got the interaction of the building outside. So I've just done. It was going to launch at the end of January, but the. The building is still being built. There's some floors that aren't quite ready. And we're doing a big launch night, a big cocktail party thing. So that's now been moved back to the end of March. But I just done a teaser. We just installed a teaser on the screen so it looks really. I'm really pleased with it. And the other thing I'm working on is again, another giant video thing. It's a 360 video projection and it's in one of these igloo things that has like six or seven, I think maybe five projectors. And I can't really say too much about that, but it's for a thing in central London. And let's just say right now I am learning all about oil tanker routes and shipping routes. And again, the client came to me and said, we want something little bit more abstract, you know, and a bit more crazy, rather than just, you know, charts and things. So, yeah, I just did one of the iterations yesterday and had a phone call about that and it's all going well, so. And then I'm doing a sound thing, visualizing thing for a sound design company. And then hopefully doing a collaboration with Gary Hustwit of Helvetica fame. They're in New York and. Yeah, we'll see what that gets. But that's equally exciting. Yeah, it's been, it's been a.",
      "id": "ep_90_ut_130"
    },
    {
      "end": 3079646,
      "speaker": "Moritz Stefaner",
      "start": 3078646,
      "text": "Not getting boring?",
      "id": "ep_90_ut_131"
    },
    {
      "end": 3085834,
      "speaker": "Brendan Dawes",
      "start": 3079750,
      "text": "No, it's fantastic start to the new year. I just need more people because there's no one here to help. So.",
      "id": "ep_90_ut_132"
    },
    {
      "end": 3090950,
      "speaker": "Moritz Stefaner",
      "start": 3088894,
      "text": "You need to make a little bot army.",
      "id": "ep_90_ut_133"
    },
    {
      "end": 3098954,
      "speaker": "Brendan Dawes",
      "start": 3091022,
      "text": "Yeah, I don't even have enough. Yeah, it's not even any pets, you know, so I can't even have a dog do something, so. Yeah.",
      "id": "ep_90_ut_134"
    },
    {
      "end": 3102470,
      "speaker": "Moritz Stefaner",
      "start": 3100774,
      "text": "I'm sure you'll figure it out.",
      "id": "ep_90_ut_135"
    },
    {
      "end": 3103794,
      "speaker": "Brendan Dawes",
      "start": 3102502,
      "text": "Yeah, I'll get there.",
      "id": "ep_90_ut_136"
    },
    {
      "end": 3118254,
      "speaker": "Moritz Stefaner",
      "start": 3104294,
      "text": "Yeah. Thanks so much. That sounds all amazing. We're much looking forward to checking these new projects out. You can find Brennan's work on brennandawes.com dot. We'll link it in the post, of course. And yeah, thanks so much, Brennan, for coming on the show.",
      "id": "ep_90_ut_137"
    },
    {
      "end": 3119630,
      "speaker": "Enrico Bertini",
      "start": 3118334,
      "text": "Thanks a lot, Brandon.",
      "id": "ep_90_ut_138"
    },
    {
      "end": 3124456,
      "speaker": "Brendan Dawes",
      "start": 3119782,
      "text": "Listen, thank you for having me. It's been a pleasure. Thank you. Thank you very much.",
      "id": "ep_90_ut_139"
    },
    {
      "end": 3125148,
      "speaker": "Moritz Stefaner",
      "start": 3124630,
      "text": "Thank you.",
      "id": "ep_90_ut_140"
    },
    {
      "end": 3125604,
      "speaker": "Enrico Bertini",
      "start": 3125196,
      "text": "Thank you.",
      "id": "ep_90_ut_141"
    },
    {
      "end": 3126984,
      "speaker": "Brendan Dawes",
      "start": 3125644,
      "text": "Bye bye bye.",
      "id": "ep_90_ut_142"
    },
    {
      "end": 3141540,
      "speaker": "Enrico Bertini",
      "start": 3133964,
      "text": "Hey, guys, thanks for listening to data stories again. Before you leave, here are a few ways you can support the show and get in touch with us.",
      "id": "ep_90_ut_143"
    },
    {
      "end": 3156260,
      "speaker": "Moritz Stefaner",
      "start": 3141612,
      "text": "First, we have a page on Patreon where you can contribute an amount of your choosing per episode. As you can imagine, we have some costs for running the show and we would love to make it a community driven project. You can find the page@patreon.com Datastories and.",
      "id": "ep_90_ut_144"
    },
    {
      "end": 3166904,
      "speaker": "Enrico Bertini",
      "start": 3156292,
      "text": "If you can spend a couple of minutes rating us on iTunes, that would be extremely helpful for the show. Just search us in iTunes store or follow the link in our website.",
      "id": "ep_90_ut_145"
    },
    {
      "end": 3190992,
      "speaker": "Moritz Stefaner",
      "start": 3167244,
      "text": "And we also want to give you some information on the many ways you can get news directly from us. We are of course on Twitter twitter.com Datastories but we also have a Facebook page@Facebook.com, datastoriespodcast and we also have a newsletter. So if you want to get news directly into your inbox, go to our homepage data stories and look for the link that you find in the footer.",
      "id": "ep_90_ut_146"
    },
    {
      "end": 3212612,
      "speaker": "Enrico Bertini",
      "start": 3191128,
      "text": "And finally, you can also chat directly with us and other listeners. Using slack again, you can find a button to sign up at the bottom of our page and we do love to get in touch with our listeners. So if you want to suggest a way to improve the show or know amazing people you want us to invite or projects you want us to talk about, let us know.",
      "id": "ep_90_ut_147"
    },
    {
      "end": 3240204,
      "speaker": "Moritz Stefaner",
      "start": 3212708,
      "text": "That's all for now. See you next time, and thanks for listening to data stories data stories is brought to you by click. Are you missing out on meaningful relationships hidden in your data? Unlock the whole story with Qlik sense through personalized visualizations and dynamic dashboards, which you can download for free at Qlik deries. That's Qlik deries.",
      "id": "ep_90_ut_148"
    }
  ],
  "confidence": 0.921265596455348,
  "audio_duration": 3240,
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_status_code": null,
  "webhook_auth": false,
  "webhook_auth_header_name": null,
  "speed_boost": false,
  "auto_highlights_result": null,
  "auto_highlights": false,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_audio_quality": null,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "content_safety": false,
  "iab_categories": true,
  "content_safety_labels": {
    "status": "unavailable",
    "results": [],
    "summary": {}
  },
  "language_detection": false,
  "language_detection_threshold": null,
  "language_confidence": null,
  "custom_spelling": null,
  "throttled": false,
  "auto_chapters": true,
  "summarization": false,
  "summary_type": null,
  "summary_model": null,
  "custom_topics": false,
  "topics": [],
  "speech_threshold": null,
  "speech_model": "best",
  "chapters": [
    {
      "summary": "Data stories is brought to you by click. Are you missing out on meaningful relationships hidden in your data? Unlock the whole story with Qlik sense through personalized visualizations and dynamic dashboards.",
      "gist": "Qlik Data Stories",
      "headline": "Are you missing out on meaningful relationships hidden in your data",
      "start": 200,
      "end": 28510,
      "id": "ep_90_ch_0"
    },
    {
      "summary": "Enrico: We will try to make data stories a crowdfunded podcast. That means we used to have corporate sponsors and we want to have it sponsored by you, by our listeners. Once we manage to switch to the crowdfunding source completely, we'll get rid of ads.",
      "gist": "Data Stories",
      "headline": "Qlik derivatives stories will try to become a crowdfunded podcast on Patreon",
      "start": 28662,
      "end": 232074,
      "id": "ep_90_ch_1"
    },
    {
      "summary": "As usual, we have a special guest on the show this time around. It's Brandon Dawes from the north of England. A lovely British accent. We love to have exotic euro voices.",
      "gist": "Exotic Euro Voices",
      "headline": "As usual, we have a special guest on the show this time around",
      "start": 232534,
      "end": 304674,
      "id": "ep_90_ch_2"
    },
    {
      "summary": "Brendan is a designer and a bit of an artist. He used to be a director of an agency with 30 people many years ago. He left that about five years ago now and now works freelance. So far, Touchwood has worked out well.",
      "gist": "Meet the Freelance Designers",
      "headline": "Brendan used to be a director of an agency before becoming freelance",
      "start": 305454,
      "end": 415060,
      "id": "ep_90_ch_3"
    },
    {
      "summary": "Cinema redux is a summary of a movie in one picture, and it consists of still frames. From a data point of view, it doesn't abstract the data into any other form. I'm always surprised at what other people think and the reaction. We'll talk about a few of your projects and how you work.",
      "gist": "The Art of Data Visualization",
      "headline": "You said you're not a hardcore data visualization person",
      "start": 415132,
      "end": 729196,
      "id": "ep_90_ch_4"
    },
    {
      "summary": "The project has been used in several exhibitions, including at MOMA. It's an example of indexical visualization, where the object itself displays the phenomenon that you want to visualize. One of the great things about programming is that you can change a few variables and get a totally different aesthetic.",
      "gist": "In the Elevator With Big Bang Data",
      "headline": "I like how simple this visualization is and how effective it is",
      "start": 729220,
      "end": 963066,
      "id": "ep_90_ch_5"
    },
    {
      "summary": "The Doris Le Bot ( https://brendandawes.com/projects/dorislebot ) project was where you would generate a little creature, basically, for Twitter users. The money involved with that was not amazing, but he's had lots of work off the back of it. He says there's a huge value in taking an idea and just running with it.",
      "gist": "In the Elevator With Twitter's Creatures",
      "headline": "Doris Le Bot ( https://brendandawes.com/projects/dorislebot ) has been working on how Twitter can be used for marketing",
      "start": 963090,
      "end": 1402664,
      "id": "ep_90_ch_6"
    },
    {
      "summary": "Graphic design is my passion, and I like aesthetics and composition, and that's what I study. I never get invited to speak at Dataviz conferences, ever. The stuff I'm working on right now are more about the beauty and aesthetics than data visualization.",
      "gist": "Democracy in Data: The Design of Data",
      "headline": "You also have a couple more, let's say, data artwork pieces",
      "start": 1404684,
      "end": 1722090,
      "id": "ep_90_ch_7"
    },
    {
      "summary": "Brennan: Third project direction. Where you take known things but bring them together in really new and interesting ways. You just completed a project called Plastic Player, which is really nice, I think. Side projects are great if putting yourself out there for potential clients.",
      "gist": "Bradley Brennan on His Side Projects",
      "headline": "Third project direction is hardware mashups, where you take known things",
      "start": 1722202,
      "end": 2125516,
      "id": "ep_90_ch_8"
    },
    {
      "summary": "The six Monkeys project for Mailchimp looked at how we can interact with email. It was crazy the amount of pr I got from it, and it was even honoured in the fast company awards. It's about putting these ideas into the world that are maybe a little bit different.",
      "gist": "The Light Switch for Email",
      "headline": "You also did the six Monkeys project for Mailchimp",
      "start": 2125580,
      "end": 2303994,
      "id": "ep_90_ch_9"
    },
    {
      "summary": "How do you balance these self initiated projects and these open explorations and the tinkering and playing with the actual commissions and the more goal directed work? Do you first do a few weeks of explorations, then afew weeks of commercial projects, or is it always a mix?",
      "gist": "How Do You Balance Out Self-Started Projects and Commercial Projects",
      "headline": "How do you balance self initiated projects and commercial projects",
      "start": 2304854,
      "end": 2462834,
      "id": "ep_90_ch_10"
    },
    {
      "summary": "Brendan, do you have any specific process you follow to generate new ideas or they just happen? I think just being open to things, open minded about things, I don't think you can force it.",
      "gist": "Brendan on Generating Ideas",
      "headline": "Brendan, do you have any specific process to generate new ideas",
      "start": 2463814,
      "end": 2645680,
      "id": "ep_90_ch_11"
    },
    {
      "summary": "I like to start coding quite early on. My go to tool is processing because it's hard one to describe. I find it a lot more freer in some ways where open frameworks feels a bit heavier. I'm up for using anything really that allows me to manifest my ideas.",
      "gist": "How to Start Writing in Code",
      "headline": "You've been mentioning coding quite a bit during the interview",
      "start": 2645752,
      "end": 2902844,
      "id": "ep_90_ch_12"
    },
    {
      "summary": "Brennan: What's next for you? What are you working on? Can you give us a little teaser of things to come? Other thing I'm working on is another giant video thing. Here are a few ways you can support the show and get in touch with us.",
      "gist": "Brennan on New Year's Projects",
      "headline": "Brennan is working on some interesting projects ahead of the new year",
      "start": 2903384,
      "end": 3240204,
      "id": "ep_90_ch_13"
    }
  ],
  "disfluencies": false,
  "entity_detection": false,
  "sentiment_analysis": false,
  "sentiment_analysis_results": null,
  "entities": null,
  "speakers_expected": null,
  "summary": null,
  "custom_topics_results": null,
  "episode_num": 90,
  "episode_metadata": {
    "speakers": [
      "Brendan Dawes",
      "Moritz Stefaner",
      "Enrico Bertini"
    ],
    "WPid": "841",
    "url": "https://datastori.es/podlove/file/3456/s/feed/c/mp3/90-visualizing-without-drawing-with-brendan-dawes.mp3",
    "episode_title": "Beyond the Chart with Brendan Dawes"
  }
}