{
  "id": "decdd1c1-57c8-46ca-81f3-6fc6868792eb",
  "language_model": "assemblyai_default",
  "acoustic_model": "assemblyai_default",
  "language_code": "en_us",
  "status": "completed",
  "audio_url": "https://datastori.es/podlove/file/334/s/feed/c/mp3/Datastories-33.mp3",
  "utterances": [
    {
      "end": 12200,
      "speaker": "Enrico Bertini",
      "start": 11680,
      "text": "Hi everyone.",
      "id": "ep_33_ut_0"
    },
    {
      "end": 17278,
      "speaker": "Moritz Stefaner",
      "start": 12286,
      "text": "Data stories number 33. Hi, Moritz. How are you doing?",
      "id": "ep_33_ut_1"
    },
    {
      "end": 19678,
      "speaker": "Jon Schwabish",
      "start": 17294,
      "text": "Hi, Rico. Good, good, good. How are you?",
      "id": "ep_33_ut_2"
    },
    {
      "end": 22382,
      "speaker": "Moritz Stefaner",
      "start": 19774,
      "text": "Good, good. 33 is a nice number.",
      "id": "ep_33_ut_3"
    },
    {
      "end": 23370,
      "speaker": "Enrico Bertini",
      "start": 22566,
      "text": "Yep.",
      "id": "ep_33_ut_4"
    },
    {
      "end": 24718,
      "speaker": "Jon Schwabish",
      "start": 23790,
      "text": "Pretty round.",
      "id": "ep_33_ut_5"
    },
    {
      "end": 27930,
      "speaker": "Moritz Stefaner",
      "start": 24854,
      "text": "Pretty round. Yeah. What's going on?",
      "id": "ep_33_ut_6"
    },
    {
      "end": 71538,
      "speaker": "Jon Schwabish",
      "start": 29550,
      "text": "Lots of stuff. I had a super exciting week. We launched the Selfie City project, which I sort of gave a sneak peek at visualized conference. But now we put it on the web and yeah, it's been a big launch and a great response. It's been posted everywhere and now we're busy like answering emails and coping. No, but it's been fun. It's a fun project. So we looked at, it's been together with Lev Mandela and his team and actually a big team, eight people. And we looked at selfies and analyzed selfie pictures from five cities across the world. And it's a crazy piece of, I don't know, art, science, research. I don't even know what it is actually.",
      "id": "ep_33_ut_7"
    },
    {
      "end": 73458,
      "speaker": "Moritz Stefaner",
      "start": 71674,
      "text": "It's a mashup of everything.",
      "id": "ep_33_ut_8"
    },
    {
      "end": 92288,
      "speaker": "Jon Schwabish",
      "start": 73634,
      "text": "Yeah. And I think it's an interesting way to talk about such a topic. Like to have an artistic angle on it. An analytic one, a theoretical one. We have some really like small bite sized findings and we have a really big exploratory tool. And so I think it's a nice mixture.",
      "id": "ep_33_ut_9"
    },
    {
      "end": 96608,
      "speaker": "Moritz Stefaner",
      "start": 92464,
      "text": "Great. And I think, I guess you're making quite some noise with this one this time.",
      "id": "ep_33_ut_10"
    },
    {
      "end": 107168,
      "speaker": "Jon Schwabish",
      "start": 96704,
      "text": "I think so also. I mean, it's so cheap because selfies, of course, is a topic that, you know. Yeah, it's sexy in a way, and so. But we have a lot of traction and it's been covered a lot.",
      "id": "ep_33_ut_11"
    },
    {
      "end": 109580,
      "speaker": "Moritz Stefaner",
      "start": 107224,
      "text": "Yeah, yeah. And I was visualized.",
      "id": "ep_33_ut_12"
    },
    {
      "end": 128064,
      "speaker": "Jon Schwabish",
      "start": 110120,
      "text": "It was fantastic. I think it was a great conference. I was a bit skeptical about the format, like only 15 minutes or 20 per speaker, and then you have the full day full of 20 different speakers. But overall it was really great. I think it's been one of the best conferences I've been to.",
      "id": "ep_33_ut_13"
    },
    {
      "end": 133456,
      "speaker": "Moritz Stefaner",
      "start": 128152,
      "text": "Great, great to hear that. It was great having you here.",
      "id": "ep_33_ut_14"
    },
    {
      "end": 139020,
      "speaker": "Jon Schwabish",
      "start": 133648,
      "text": "Yeah, I spent the whole week in New York. I love the city, as you know. And so I'll try to make it back.",
      "id": "ep_33_ut_15"
    },
    {
      "end": 140386,
      "speaker": "Moritz Stefaner",
      "start": 139330,
      "text": "We should do it more often.",
      "id": "ep_33_ut_16"
    },
    {
      "end": 141538,
      "speaker": "Jon Schwabish",
      "start": 140458,
      "text": "As soon as possible.",
      "id": "ep_33_ut_17"
    },
    {
      "end": 141762,
      "speaker": "Enrico Bertini",
      "start": 141594,
      "text": "Yes.",
      "id": "ep_33_ut_18"
    },
    {
      "end": 145898,
      "speaker": "Moritz Stefaner",
      "start": 141786,
      "text": "And have more face to face recordings. That would be fun.",
      "id": "ep_33_ut_19"
    },
    {
      "end": 153470,
      "speaker": "Jon Schwabish",
      "start": 146034,
      "text": "No, it's true. And also one feedback we got from a listener was that it's the first podcast that is really in sync. Really?",
      "id": "ep_33_ut_20"
    },
    {
      "end": 155178,
      "speaker": "Enrico Bertini",
      "start": 154770,
      "text": "Yeah.",
      "id": "ep_33_ut_21"
    },
    {
      "end": 166850,
      "speaker": "Jon Schwabish",
      "start": 155234,
      "text": "Of course you have a little lag if you do it over Skype. And. Yeah, it's nice to be in the same room. Yeah. So if we find a good sponsor who will fly me in for every episode. I'm all gaming. Yeah.",
      "id": "ep_33_ut_22"
    },
    {
      "end": 169550,
      "speaker": "Moritz Stefaner",
      "start": 166890,
      "text": "If you guys want to sponsor that, we are.",
      "id": "ep_33_ut_23"
    },
    {
      "end": 175170,
      "speaker": "Jon Schwabish",
      "start": 169910,
      "text": "If you're a billionaire, give us a call. How was your time?",
      "id": "ep_33_ut_24"
    },
    {
      "end": 176630,
      "speaker": "Moritz Stefaner",
      "start": 175590,
      "text": "Good. Good.",
      "id": "ep_33_ut_25"
    },
    {
      "end": 177438,
      "speaker": "Enrico Bertini",
      "start": 176790,
      "text": "Yeah.",
      "id": "ep_33_ut_26"
    },
    {
      "end": 192262,
      "speaker": "Moritz Stefaner",
      "start": 177574,
      "text": "Yeah. A lot of work as usual. Doing research, teaching. And it's quickly getting the hot season because the submissions for this are coming up soon. So everyone is working on that.",
      "id": "ep_33_ut_27"
    },
    {
      "end": 194174,
      "speaker": "Jon Schwabish",
      "start": 192366,
      "text": "So you have to make up some research now?",
      "id": "ep_33_ut_28"
    },
    {
      "end": 206328,
      "speaker": "Moritz Stefaner",
      "start": 194262,
      "text": "We have to do some research from time to time. Yeah, my students are working hard and I'm doing my best to help them. Hopefully.",
      "id": "ep_33_ut_29"
    },
    {
      "end": 209336,
      "speaker": "Jon Schwabish",
      "start": 206384,
      "text": "Looking forward to see what you have in the pockets.",
      "id": "ep_33_ut_30"
    },
    {
      "end": 213864,
      "speaker": "Moritz Stefaner",
      "start": 209448,
      "text": "Yeah. I'm not sure if I can talk about this before publishing this stuff.",
      "id": "ep_33_ut_31"
    },
    {
      "end": 218100,
      "speaker": "Jon Schwabish",
      "start": 213912,
      "text": "No, no. But once you have handed it in, it'll be super interesting.",
      "id": "ep_33_ut_32"
    },
    {
      "end": 235526,
      "speaker": "Moritz Stefaner",
      "start": 218640,
      "text": "But actually we had a notification for a paper accepted at Euroviz this year. Well, preliminary accepted and that was a very long work done with a group of climate scientists. And that's really, really interesting. So I will talk more about this work once it is fully accepted.",
      "id": "ep_33_ut_33"
    },
    {
      "end": 238678,
      "speaker": "Jon Schwabish",
      "start": 235678,
      "text": "Sounds good. Shall we briefly go to listener feedback?",
      "id": "ep_33_ut_34"
    },
    {
      "end": 277521,
      "speaker": "Moritz Stefaner",
      "start": 238774,
      "text": "Yeah, I think we got some at least one comment last week that was from Samuel Dittaker. I hope I pronounced it well. Sorry if not so Samuel said that was real fun because he said, I've listened to every episode within one month. Congratulations. Maybe two episodes on the train from and to work. They're all great. Thanks a lot, Samuel. That's. That's great to hear. But now he says, but now I have always to wait so long for a new episode. Yeah, I mean, doing more episodes, we would love to, but it's really.",
      "id": "ep_33_ut_35"
    },
    {
      "end": 278977,
      "speaker": "Jon Schwabish",
      "start": 277585,
      "text": "Daily show is not an option.",
      "id": "ep_33_ut_36"
    },
    {
      "end": 296572,
      "speaker": "Moritz Stefaner",
      "start": 279073,
      "text": "Daily show is not an option. Weekly show is not an option. From time to time, me and Moritz discuss about having an episode twice every two weeks. But I don't know. We don't want to promise that and then break the rules. So I think we are trying to.",
      "id": "ep_33_ut_37"
    },
    {
      "end": 305156,
      "speaker": "Jon Schwabish",
      "start": 296596,
      "text": "Target, but we might get some support with audio editing now. So if that happens, that's the thing. Be able to be a bit more regular.",
      "id": "ep_33_ut_38"
    },
    {
      "end": 349542,
      "speaker": "Moritz Stefaner",
      "start": 305228,
      "text": "So we are trying to scale up the old thing, but in order to scale it up, we need help. So I think I. This gives the chance actually to say, if you guys want to help us in some way, either by doing some work for us for free or donating something to us, we are happy to scale the episode, the show up with your help. Otherwise, we basically have to stick to the one month kind of schedule because we are, of course, busy with other things. So we have another, of course, another special guest today we have Jon Schwabish. Hi, John. How are you?",
      "id": "ep_33_ut_39"
    },
    {
      "end": 351430,
      "speaker": "Enrico Bertini",
      "start": 349606,
      "text": "Hey, Enrico Moritz. How you doing?",
      "id": "ep_33_ut_40"
    },
    {
      "end": 353862,
      "speaker": "Moritz Stefaner",
      "start": 351510,
      "text": "Hey, John, it's great having you here.",
      "id": "ep_33_ut_41"
    },
    {
      "end": 364810,
      "speaker": "Enrico Bertini",
      "start": 353966,
      "text": "Yeah, thanks for having me. It's exciting. I have listened to all 32 episodes myself. I didn't binge listen in one week or what? I've spaced it out over time.",
      "id": "ep_33_ut_42"
    },
    {
      "end": 369172,
      "speaker": "Moritz Stefaner",
      "start": 366670,
      "text": "Did you listen to every single episode?",
      "id": "ep_33_ut_43"
    },
    {
      "end": 370456,
      "speaker": "Enrico Bertini",
      "start": 369326,
      "text": "Every single episode.",
      "id": "ep_33_ut_44"
    },
    {
      "end": 370928,
      "speaker": "Moritz Stefaner",
      "start": 370488,
      "text": "Oh, come on.",
      "id": "ep_33_ut_45"
    },
    {
      "end": 372220,
      "speaker": "Enrico Bertini",
      "start": 370944,
      "text": "From beginning to end.",
      "id": "ep_33_ut_46"
    },
    {
      "end": 381232,
      "speaker": "Jon Schwabish",
      "start": 372760,
      "text": "That should be a new requirement for guests because, of course, you know, it's a saga. You cannot just, like, jump in in the middle. You have to understand what has happened.",
      "id": "ep_33_ut_47"
    },
    {
      "end": 382152,
      "speaker": "Enrico Bertini",
      "start": 381336,
      "text": "Just jump in.",
      "id": "ep_33_ut_48"
    },
    {
      "end": 383936,
      "speaker": "Moritz Stefaner",
      "start": 382216,
      "text": "Yeah, yeah.",
      "id": "ep_33_ut_49"
    },
    {
      "end": 388088,
      "speaker": "Jon Schwabish",
      "start": 384048,
      "text": "All the character development, you know. Remember Enrico two years ago?",
      "id": "ep_33_ut_50"
    },
    {
      "end": 391120,
      "speaker": "Enrico Bertini",
      "start": 388144,
      "text": "I mean, it's like watching the wire. You can't just jump in the middle.",
      "id": "ep_33_ut_51"
    },
    {
      "end": 397426,
      "speaker": "Jon Schwabish",
      "start": 391240,
      "text": "Right? So what was your favorite episode? Now that we are on the topic of our great podcast?",
      "id": "ep_33_ut_52"
    },
    {
      "end": 410090,
      "speaker": "Enrico Bertini",
      "start": 397568,
      "text": "Well, you know, I just, I listened to the Georgia episode yesterday, so that one was really good. One of the early ones with Andy Kirk was good when he. When the first one he was on was a really nice episode about teaching.",
      "id": "ep_33_ut_53"
    },
    {
      "end": 413894,
      "speaker": "Jon Schwabish",
      "start": 410510,
      "text": "Yeah, that was a great one. Andy is so entertaining.",
      "id": "ep_33_ut_54"
    },
    {
      "end": 414582,
      "speaker": "Enrico Bertini",
      "start": 414022,
      "text": "Yeah, yeah.",
      "id": "ep_33_ut_55"
    },
    {
      "end": 415550,
      "speaker": "Jon Schwabish",
      "start": 414606,
      "text": "I love this guy.",
      "id": "ep_33_ut_56"
    },
    {
      "end": 427224,
      "speaker": "Enrico Bertini",
      "start": 415670,
      "text": "And, you know, when Ben Shneiderman was on, that was fun. You know, Ben. Ben's a character, so that was fun. It was interesting to listen to him move from sort of the strict computer science part to the data art. That was. That was interesting.",
      "id": "ep_33_ut_57"
    },
    {
      "end": 427880,
      "speaker": "Moritz Stefaner",
      "start": 427312,
      "text": "Yeah.",
      "id": "ep_33_ut_58"
    },
    {
      "end": 428832,
      "speaker": "Enrico Bertini",
      "start": 428000,
      "text": "Top hits.",
      "id": "ep_33_ut_59"
    },
    {
      "end": 429620,
      "speaker": "Moritz Stefaner",
      "start": 428936,
      "text": "Yeah.",
      "id": "ep_33_ut_60"
    },
    {
      "end": 433888,
      "speaker": "Jon Schwabish",
      "start": 430920,
      "text": "One day there will be like a top hits collection.",
      "id": "ep_33_ut_61"
    },
    {
      "end": 434696,
      "speaker": "Enrico Bertini",
      "start": 433944,
      "text": "That's right.",
      "id": "ep_33_ut_62"
    },
    {
      "end": 438620,
      "speaker": "Jon Schwabish",
      "start": 434848,
      "text": "So what do you do, John? Why. Why are you even on this podcast?",
      "id": "ep_33_ut_63"
    },
    {
      "end": 445112,
      "speaker": "Enrico Bertini",
      "start": 440680,
      "text": "Well, because I think you needed to add an American voice to the exotic voices. Right?",
      "id": "ep_33_ut_64"
    },
    {
      "end": 446660,
      "speaker": "Jon Schwabish",
      "start": 445176,
      "text": "Native speaker for once.",
      "id": "ep_33_ut_65"
    },
    {
      "end": 591328,
      "speaker": "Enrico Bertini",
      "start": 449360,
      "text": "Well, so my day job is I'm an economist at the Congressional Budget office here in DC, and I've been here for about nine years. And before that, I was in New York City working at a nonprofit, and before that, I was in graduate school doing my PhD at Syracuse University. And so I started at CBO. I was working in the long term model, doing micro simulation model on Social Security finances. And then I started branching out, and I was doing economic research on immigration and food stamps and inequality and disability. I did a bunch of stuff with data measurement issues. And then a couple years ago, I became interested in data visualization. Sort of stumbled upon the field, you know, found you guys and found Steven few and found Andy and all these different people. And so then I sort of helped launch a variety of different data visualization efforts at CBO. We started doing infographics. We did some one off charts that we call snapshots. We did a new publication type called a chart book. And then we of course, were improving what we were doing in our regular publications. So that was all great. And then I started branching out and giving talks at other agencies and talking to policy shops and think tanks and sort of trying to teach them how to do data visualization in a better way and talking to economists about how to present their work in a better way. And oh, I should probably mention for listeners who don't know, the CBO is the budget Office of us Congress. So probably people overseas may not know what we do. It was founded in the mid seventies. It's now about 225 people. And it's a strictly nonpartisan agency. We conduct objective analysis for members of Congress. But I should also note that everything I'm talking about today is going to be my own views and not those of CBO. So we'll talk about my own work, which I started about a year ago. I launched my own site called Policyviz. And the site at the time was really just a way to give information about the workshops I was conducting on data visualization and presentation techniques. And then I kind of figured like, Andy Kirk shouldn't be the only person allowed to be doing workshops and teaching data visualization. How did she do it again, there.",
      "id": "ep_33_ut_66"
    },
    {
      "end": 594632,
      "speaker": "Jon Schwabish",
      "start": 591344,
      "text": "Was also J. Thorpe, but I think he stopped doing that.",
      "id": "ep_33_ut_67"
    },
    {
      "end": 603096,
      "speaker": "Enrico Bertini",
      "start": 594696,
      "text": "Yeah, and his was sort of on processing in New York. I figured if Andy could let me have DC, then, you know, he could have the rest of the world and I could just have DC.",
      "id": "ep_33_ut_68"
    },
    {
      "end": 606920,
      "speaker": "Jon Schwabish",
      "start": 603208,
      "text": "So did you also do like full day, one day or two day workshop type things?",
      "id": "ep_33_ut_69"
    },
    {
      "end": 682160,
      "speaker": "Enrico Bertini",
      "start": 606960,
      "text": "Yeah, I was doing full day workshops. I would sort of do like talk about best practices and strategies and then do hands on tutorials in sort of the programs that most people I know work with, which tends to be economists tend to use Excel as the main graphics program people use. And then for the analytic side, it's things like Stata and SAS and SPSs. And the micro simulation model I worked on was written in Fortran, so there's not a lot of graphics capabilities in Fortran, so they're a full day workshop. And then about two months ago, I relaunched the site to be more of a blog because I had this list of things I wanted to talk about and sort of wanted to get out there. And I didn't have a good podium to do that. So I've been writing a lot more recently. And then in December I launched the HelpMeViz site, which was a project I had been sort of toying around with for about six or nine months and finally got up the courage to actually do it and sort of took me a while to figure out the best way to do it. I had two very long conversations to Robert Kosara about the best approach. So, and it's been out for about, since early December. It's been great so far. Yeah, very exciting.",
      "id": "ep_33_ut_70"
    },
    {
      "end": 715756,
      "speaker": "Jon Schwabish",
      "start": 682200,
      "text": "I think it hit the ground running right. Like there was immediately, like, traffic and people coming there. And so I think that clearly, clearly filled a need. But coming back to the policy thing. So what's your experience? Like, how is this world, let's say, of budget office visualizations or visualizations for policymakers? How's that different, maybe from what, you know, from flowing data type, web design y data visualization? Is there a difference or is it similar?",
      "id": "ep_33_ut_71"
    },
    {
      "end": 783560,
      "speaker": "Enrico Bertini",
      "start": 715908,
      "text": "I think so. I mean, a lot of the people that I talk to it, you know, I talked to a lot of agencies, you know, the Census Bureau, Congressional Research Service, Department of Commerce, Department of Labor. I mean, all of these groups, they seem to have sort of the same sorts of challenges, which is they're mostly economists who haven't thought about how to present their work visually. So when I went through grad school, I was never taught how to write. I was never taught how to give a presentation, how to actually talk to people in an audience, never taught how to make good graphics. And so that's sort of the first hurdle. Most people are really interested in learning how to do a better job of doing that because they're working for a long time, often years, on a research project. And then they put it out and it goes into the journal and it disappears. Even if they have really exciting stuff to show, they're burying it in tables or they're putting in a graph. That's really hard to sort of find the story. So most people I'm talking to, they want to know how to do, mostly it's just the static stuff. They want to know how to just do the static stuff. How do I make, what type of graphs can I use? What type of tools can I use to make these different things?",
      "id": "ep_33_ut_72"
    },
    {
      "end": 796150,
      "speaker": "Jon Schwabish",
      "start": 784900,
      "text": "But they think more in terms of, okay, I have my paper report anyways, and there is a figure 2.1 that shows the decline of something. How can I make that better?",
      "id": "ep_33_ut_73"
    },
    {
      "end": 816810,
      "speaker": "Enrico Bertini",
      "start": 796190,
      "text": "Right? Yeah. How can I make that better? How can I make that clear? And everybody seems to realize now, and, you know, I don't think this was the case a few years ago. Right. Everybody realizes now, to get more people to read your research, it needs to sort of get out there on the Internet, right. And that's how people are gonna find it. And these visual images are the things that are getting out there, and that's how people are becoming attracted to the research.",
      "id": "ep_33_ut_74"
    },
    {
      "end": 846658,
      "speaker": "Jon Schwabish",
      "start": 817710,
      "text": "So I have this suspicion, like, when I talk to scientists, sometimes that design is still seen as something you don't do because a good study doesn't need to be dressed up in quotation marks, right? So the results speak for themselves. So why would I need to give it flashy colors, right? Do people in the policy scene have the same types of reservations, or is that maybe a thing of the past? It's already being overcome.",
      "id": "ep_33_ut_75"
    },
    {
      "end": 892314,
      "speaker": "Enrico Bertini",
      "start": 846794,
      "text": "I think it's starting to be overcome. It's not so much about the fancy colors and the fancy icons. I think people are starting to recognize that a simple line chart or a good column chart, if the content is good and the chart is clear, then it will gain attention. People are excited about the infographics thing, and some places are moving beyond that and doing the interactive. But at least on the static stuff, you are seeing a lot more. People just put out static charts and they're having more of these graphic elements. And so what you see a lot in these agencies is you see sort of like the analysts or the economists in this silo over here and then the graphic designers in this silo over here, and, like, never the two shall meet. And so.",
      "id": "ep_33_ut_76"
    },
    {
      "end": 892978,
      "speaker": "Jon Schwabish",
      "start": 892362,
      "text": "Right, right.",
      "id": "ep_33_ut_77"
    },
    {
      "end": 966832,
      "speaker": "Enrico Bertini",
      "start": 893074,
      "text": "You know, there's like one agency where I know a lot of economists just sort of through my other work, and they always complain to me. They're like, well, I've made my poster for this conference, or I've made my research report, graphite, and I gave it to the graphic designers, and it came back and everything was moved around, and it was all different. And I said, well, you could just go talk to them. They're probably nice people. So what you sort of need is the graphic folks who have an interest in the analytics, and then the analytic folks who have some interest in the design side so that you can sort of piece these two worlds together. You mentioned in the last and data stories 32 with Georgia. She does the graphics part and not so much on the coding part. And so I think there's this big question about, should people be sort of a mile wide and an inch deep, or should they stick into the places where they're a mile deep? And I think we have this sort of desire that everybody should be like a unicorn. Everybody should be able to do all these great things. And I don't really think that's the case. And I think if you just have, like, the desire to do these things. I think that sort of can go a long way.",
      "id": "ep_33_ut_78"
    },
    {
      "end": 985648,
      "speaker": "Jon Schwabish",
      "start": 967016,
      "text": "Yeah. But of course, the first step is to recognize, like, that you might not be great at something. That's the first thing. And the other thing is to just understand that there's a big value in maybe, like, for the designer to understand there's a big value in what an analyst can bring in. And for an analyst to understand there's a big value a designer can bring in.",
      "id": "ep_33_ut_79"
    },
    {
      "end": 986864,
      "speaker": "Enrico Bertini",
      "start": 985744,
      "text": "Yeah, absolutely.",
      "id": "ep_33_ut_80"
    },
    {
      "end": 989132,
      "speaker": "Jon Schwabish",
      "start": 986912,
      "text": "Yeah. Enrico, you had a question?",
      "id": "ep_33_ut_81"
    },
    {
      "end": 1018814,
      "speaker": "Moritz Stefaner",
      "start": 989236,
      "text": "Yeah, I have a few questions, so I'm curious to hear more in details. So these people who come to you and say, look, I need to make these charts better, what do they exactly mean? I mean, I think so. They have a feeling or a sense that something is wrong with the way they make charts right. Is it more that they feel like that they didn't convey the message right or effectively enough, or it's more that they really want to make it pre tier or both?",
      "id": "ep_33_ut_82"
    },
    {
      "end": 1096298,
      "speaker": "Enrico Bertini",
      "start": 1018942,
      "text": "No, it's usually, it's usually the former. They usually, people come to me and say, I've made this chart, but it's not telling the story that I want to tell. It's not reflecting the research in the right way. And I don't know how or they've heard me talk about. Sometimes it's on the, I guess you might call it making it prettier, but it's not like, what's a good color palette? It's, they'll say, I've heard you talk about lightening this gridline or getting rid of this tick mark. How do I do that? Why should I do that? That sort of thing. But most people want to know what's a better way to present their data. So one I get probably the most often is people not recognizing that they can make a scatter plot out of a column chart that has multiple columns and there's some correlation. And I think what happens is they've probably made that scatter plot on their desktop when they've been analyzing the data, but they sort of feel like people may not be able to understand a scatter plot. And I think we've moved to the point now where scatter plots are sort of mainstream and people sort of get that. And of course, it varies whether people are writing for an academic journal publication or they're writing for the public or members of Congress or what have you. Yeah.",
      "id": "ep_33_ut_83"
    },
    {
      "end": 1104914,
      "speaker": "Moritz Stefaner",
      "start": 1096354,
      "text": "So from your experience, what kind of skills these people lack the most, why do they feel that they cannot do it? Why do they feel that they need some help for doing that.",
      "id": "ep_33_ut_84"
    },
    {
      "end": 1173260,
      "speaker": "Enrico Bertini",
      "start": 1105002,
      "text": "I think they feel like they're not thinking visually. So a lot of people, they have a bunch of text and then they have a table. And I think now people are starting to recognize that it's the graphics and the visuals that are gaining attention. And, you know, any sort of, you know, you know, any sort of economics blogger or, you know, blog in the newspapers, wonk blog or Nate silver stuff, you know, even those sort of single charts, those are capturing attention. Whereas before people that I tend to come to talk to me are, you know, they're usually making those in tables. And so I think it's just recognition that the visual graphics are ways to get their research more visible. And, you know, and once they sort of settled on a visual, then it's like, okay, so how do I go to the next step of making this attractive, but not so much like, give me sort of a neat color palette? It's like, well, how do I, show me how to make the data more visible or how do I make these? How do I place the labels on the chart? I need to know how to do that in excel, easily. And which points should I label and why?",
      "id": "ep_33_ut_85"
    },
    {
      "end": 1221356,
      "speaker": "Moritz Stefaner",
      "start": 1173340,
      "text": "Yeah, I actually have a similar experience. I've been working for many months with a group of climate scientists, as I mentioned before, and again, we've been analyzing a very large number of publications, of charts coming from their publications. And I think what is really interesting there is that one of the problems is that scientists cannot really distinguish between the charts they use for analysis and the chart they use for presenting the information that comes out of their analysis. Basically what they end up creating is screenshots from the charts that they have created through their analytical process. Right. And I don't know if you ever, if you have a similar experience with your, with your clients, but it's definitely true with, with the people I've been interacting with.",
      "id": "ep_33_ut_86"
    },
    {
      "end": 1265856,
      "speaker": "Enrico Bertini",
      "start": 1221428,
      "text": "Yeah, absolutely. And I, and I tell people that the, the graph you make when you're analyzing your data or constructing your model or, or what have you in the analytics phase, that can be the same chart you put in your, in your publication, in your research paper, on your blog. But there are two totally different things. The one is for you to understand your data, and the other is to convince your reader that your models. Right, or your projections are accurate or what have you. And so the color and the annotation and all the sort of chart clutter that may fill up the default graph. That stuff needs to be addressed when you're trying to present it to an audience. So I agree. I see that a lot. It's the same exact chart, but they need to have completely different looks because they have two different purposes.",
      "id": "ep_33_ut_87"
    },
    {
      "end": 1286620,
      "speaker": "Jon Schwabish",
      "start": 1265968,
      "text": "But isn't it also often related to what even goes into the chart? Like there's often a tendency to try and show everything and everything's important and often an external person can say, listen, we don't need all of that. Your main story is here, and why not do a graphic that's centered around that single data point in a way.",
      "id": "ep_33_ut_88"
    },
    {
      "end": 1342106,
      "speaker": "Enrico Bertini",
      "start": 1287840,
      "text": "There's also this thing that I sort of call the slideshow effect. Jonathan Coram at the Times calls it the figure one problem where basically people in my field, and probably most science in the sort of sciences, they have a graph and they put it on the page and they surround it by a bunch of texts and then the text sort of narrates what happens in the figure. It's not thought of as something that's an additional thing or something that can glean greater insight that the reader can get more insight from. It's just sort of this thing. Well I've talked about the unemployment rate, so I need a figure. So here's figure one. And you know, my hope is that, you know, people will recognize the value of having more visuals that have more meaning and more content as opposed to, you know, here's the unemployment rate and so here's a line chart. And now let's move on to figure two. Right? I mean, yeah, yeah, yeah, absolutely.",
      "id": "ep_33_ut_89"
    },
    {
      "end": 1342910,
      "speaker": "Moritz Stefaner",
      "start": 1342238,
      "text": "Sure.",
      "id": "ep_33_ut_90"
    },
    {
      "end": 1350030,
      "speaker": "Jon Schwabish",
      "start": 1345690,
      "text": "Shall we talk about help me with. Yeah, I think we're halfway there anyways already.",
      "id": "ep_33_ut_91"
    },
    {
      "end": 1355042,
      "speaker": "Moritz Stefaner",
      "start": 1351850,
      "text": "Yeah, but this stuff is super interesting. I could keep talking for another.",
      "id": "ep_33_ut_92"
    },
    {
      "end": 1376610,
      "speaker": "Jon Schwabish",
      "start": 1355146,
      "text": "I know, yeah, yeah. It could be an extra thing. I was also at a workshop about like data visualization and policymaking and we debated for two days and only scratched the surface of, you know, how complex this is like with all different requirements, all different types of context where you might want to use information. And it's a big topic for sure.",
      "id": "ep_33_ut_93"
    },
    {
      "end": 1440290,
      "speaker": "Enrico Bertini",
      "start": 1377310,
      "text": "It's not only difficult because of the sort of, well in my experience, the analysts who are sort of trying I think to learn, you've also got, and this is not just government, I think this is all sorts of places where the skill set that they don't have, the skill set that they need to do these sorts of things. There's not an emphasis on hiring designers or UX people or JavaScript people. Those skill sets aren't there yet. So it's sort of hard to move from a place where you have 1000 or 2000 economists to a place where you need to have a team of graphics or a communications team to do this sort of thing. So it's both on the individual side and then it's also on the sort of institution side. And that can be, there are a lot of think tanks in DC that I talked to and they're starting to recognize that they need a sort of dedicated communications team that focuses on the visual aspect of research and analysis. But yeah, we could talk about this. I could talk about this for hours. Data storage 33.5 exactly.",
      "id": "ep_33_ut_94"
    },
    {
      "end": 1457184,
      "speaker": "Moritz Stefaner",
      "start": 1441110,
      "text": "No, let me ask one last thing, because I'm really curious about that. So when you run your workshops, so I guess most of the participants are people coming from economy or related fields, right?",
      "id": "ep_33_ut_95"
    },
    {
      "end": 1457720,
      "speaker": "Enrico Bertini",
      "start": 1457352,
      "text": "Yeah.",
      "id": "ep_33_ut_96"
    },
    {
      "end": 1510602,
      "speaker": "Moritz Stefaner",
      "start": 1457760,
      "text": "So how do they react to the information that you give to them? So I'm curious to hear first if they immediately recognize the benefits of. So I see, for instance, you have a very nice paper where you, where you describe a lot of charts coming from the, from economics where you redesign these charts and show how, how much better a chart could be right when it's redesigned. So I'm wondering how do they react when you show them charts that come from their own field and you redesign them? And of course, for people like us, it's immediately clear that this kind of redesign charts are much better. But I'm curious to hear how do they react? I mean, do they see the value of redesigning these charts in a certain way or I, or sometimes they are skeptical about the results.",
      "id": "ep_33_ut_97"
    },
    {
      "end": 1577204,
      "speaker": "Enrico Bertini",
      "start": 1510746,
      "text": "Yeah. Well, I mean, the first point is that it's a select sample. Right. So people are coming to the workshop because they feel like they want to do a better job. But. Yeah, I think so. Most people are. Most people see the value pretty immediately. And of course, a lot of things that I'm redesigning. You mentioned the article. You know, a lot of those redesigns were, I mean, for us are pretty obvious. But I think when you show sort of anybody, it's pretty obvious that you should, you know, the darkest line on the, on the chart should not be the, you know, the x axis. It should be the data line. Right. I think the one that I always find the funniest is when I show people a column chart where each column is labeled, it's a city. And so the x axis labels all have that vertical orientation. So you have to turn your head a little bit. And I tell people, well, you could rotate the labels to 45 degrees, but you still have the same problem. Or you can make it horizontal so they won't all fit. And I say, well, what if you just rotated the chart and just made it like a horizontal bar chart? Because then you have the chart, it's the same, you know, same visual. And now all your labels sort of sits horizontally. It's easy to read. And people, I'm always surprised when people are like, oh, my God.",
      "id": "ep_33_ut_98"
    },
    {
      "end": 1578320,
      "speaker": "Jon Schwabish",
      "start": 1577292,
      "text": "Mind blown.",
      "id": "ep_33_ut_99"
    },
    {
      "end": 1654216,
      "speaker": "Enrico Bertini",
      "start": 1578900,
      "text": "That's genius. So for the most part, people are really receptive to it. And, you know, what I try to do when I do the workshops is have a lot of conversation about why does this choice make sense versus some other choice? And a lot of it is subjective. Should you have. The one in my head is, I think, the first figure in that article you mentioned, Enrico, which is four panels put together. You could argue whether you should have four sets of x axis labels and four sets of y axis labels. Those sorts of things are the sort of things that come into play the most in terms of debate. But for the most part, people are really receptive once they realize that once you strip out all this other stuff, you see the data and you see the story so much more clearly. Once you get rid of all the thick grid lines and you get rid of your 3d pie chart, the data is just much more clearer once you think about a different way of presenting it. Yeah, I find most people are really receptive to it. And the article that you mentioned, I just asked the publisher a few days ago, I think it has ten times as many hits as any other article in that particular issue, which not totally, totally surprising.",
      "id": "ep_33_ut_100"
    },
    {
      "end": 1695072,
      "speaker": "Moritz Stefaner",
      "start": 1654408,
      "text": "Yeah, I just discovered it by chance when I was looking at your profile, and I think it's extremely useful. If only I discovered it a little bit earlier, I would use it in my class because I really wanted to have a long list of examples of redesigned charts. If you think about it, there are not many examples out there. The only webpage I know that is similar in spirit is from Stephen Few. He has a very nice page where he has the original chart and the redesigned chart. And of course, I think. Yeah, and your paper is the only other source that I know where this happens. And of course, your new blog. So this nicely introduces the next topic.",
      "id": "ep_33_ut_101"
    },
    {
      "end": 1695672,
      "speaker": "Enrico Bertini",
      "start": 1695176,
      "text": "Help me.",
      "id": "ep_33_ut_102"
    },
    {
      "end": 1696620,
      "speaker": "Jon Schwabish",
      "start": 1695736,
      "text": "Finally.",
      "id": "ep_33_ut_103"
    },
    {
      "end": 1704360,
      "speaker": "Moritz Stefaner",
      "start": 1701280,
      "text": "Getting nervous. You cannot see face, but.",
      "id": "ep_33_ut_104"
    },
    {
      "end": 1707516,
      "speaker": "Enrico Bertini",
      "start": 1707100,
      "text": "We should.",
      "id": "ep_33_ut_105"
    },
    {
      "end": 1712308,
      "speaker": "Moritz Stefaner",
      "start": 1707548,
      "text": "Turn into video podcast mod so people could see your face.",
      "id": "ep_33_ut_106"
    },
    {
      "end": 1718880,
      "speaker": "Jon Schwabish",
      "start": 1712404,
      "text": "Absolutely. I'll just post a few screenshots from you. I think that's just as good.",
      "id": "ep_33_ut_107"
    },
    {
      "end": 1724040,
      "speaker": "Moritz Stefaner",
      "start": 1719380,
      "text": "Yeah, that would be disgusting. Go ahead. Sorry, John.",
      "id": "ep_33_ut_108"
    },
    {
      "end": 1766690,
      "speaker": "Enrico Bertini",
      "start": 1724900,
      "text": "No. So I was gonna say, you know, the only. So I. So. Well, one thing I wanna say about the article is that I got a lot of great feedback about it. And some, you know, some people who weren't pleased that I focused so much on Excel, but that's a separate topic. But the emails I got that I was most excited about were from professors saying, this is great. You know, I'm assigning as, you know, as mandatory reading for my class. You know, that's, and that's where, that's how things sort of change when you start getting students and graduate students thinking about this as they work on their research, you know, from the get go. So, so that's sort of what I was most excited about. But the other point is, yeah, the sort of only other site that has these sort of alternatives is HelpMeViz, so. Or it's, there's your segue.",
      "id": "ep_33_ut_109"
    },
    {
      "end": 1775070,
      "speaker": "Jon Schwabish",
      "start": 1772390,
      "text": "So what is helpiviz all abad?",
      "id": "ep_33_ut_110"
    },
    {
      "end": 1912528,
      "speaker": "Enrico Bertini",
      "start": 1775190,
      "text": "What is all about? Help me biz. Yeah, so help me biz is a, so it's a place where people can post visualizations that they're either having trouble with or they want feedback on or they just want general help with. And then the community at large can comment in and provide ideas and options. And I had some, when I designed it, I had like, I'd say probably four key elements that I needed to have when I was building it. And I should say I wasn't sure how I was going to build it first. So, you know, I was sort of playing with other existing sites like Pinterest and Flickr and GitHub and stack exchange and all these different places, but they were all sort of missing like one key thing that I needed. So, okay, so here are my four things. So first, it needed to be easily accessible for people. So I didn't want something where you had to like join and be a member, like be Hance or dribble were on my list. But you have to join. And, you know, so I wanted to be like, you know, Joe Shmo analysts could just show up one day and, you know, provide some advice. So that was the first one. The second one was that the people who are commenting had to be able to post images with their, with their comments. So I wanted people to be able to, you know, provide alternatives, not just to try to describe it. So that ruled out a bunch of other sites. And then the comments needed to be in depth. That was sort of the whole reason I started it, was that I was realizing that people make comments on Twitter that are, you know, they can be construct, they can be constructive, but they tend to be just criticisms, but they're really short. Like, that's the way it has to be. And so you, you know, you see this sort of back and forth. We've seen it. You know, a couple days ago there was this Twitter conversation about this map of splitting GDP growth in the US. Right, right. It's sort of hard to follow that conversation when they're, you know, 140 characters at a time, so. And then the fourth thing was that I wanted it to be open to just anybody and they could post easy, simple charts, you know, a single pie chart or a single line chart all the way to more complex charts, to, you know, interactive visualizations, to, you know, network diagrams, to anything. So I wanted to sort of Spanish, I wanted to make it as broad as I can. So that's why it ended up being a website as opposed to using one of these sort of existing services and.",
      "id": "ep_33_ut_111"
    },
    {
      "end": 1922008,
      "speaker": "Jon Schwabish",
      "start": 1912544,
      "text": "Something like stack exchange or stack overflow. That model wouldn't have worked because there's no real conversation or quora or so.",
      "id": "ep_33_ut_112"
    },
    {
      "end": 1932862,
      "speaker": "Enrico Bertini",
      "start": 1922184,
      "text": "Yeah. See the problem with a lot of these is, well, I felt, and others probably disagree, but I felt that like stack exchange and GitHub and those sorts of things, I didn't think they were as easily accessible for people.",
      "id": "ep_33_ut_113"
    },
    {
      "end": 1933774,
      "speaker": "Jon Schwabish",
      "start": 1932926,
      "text": "Yeah, that's true.",
      "id": "ep_33_ut_114"
    },
    {
      "end": 1940918,
      "speaker": "Enrico Bertini",
      "start": 1933902,
      "text": "They sort of have this view, they have this look of being pretty technical and sort of harder to get into.",
      "id": "ep_33_ut_115"
    },
    {
      "end": 1941646,
      "speaker": "Jon Schwabish",
      "start": 1940974,
      "text": "Right.",
      "id": "ep_33_ut_116"
    },
    {
      "end": 1945010,
      "speaker": "Enrico Bertini",
      "start": 1941838,
      "text": "Whereas a comment box at the bottom of a web page is.",
      "id": "ep_33_ut_117"
    },
    {
      "end": 1948390,
      "speaker": "Jon Schwabish",
      "start": 1946470,
      "text": "So you set it up in WordPress, probably.",
      "id": "ep_33_ut_118"
    },
    {
      "end": 1949998,
      "speaker": "Enrico Bertini",
      "start": 1948510,
      "text": "Yeah, it's set up in WordPress, yeah.",
      "id": "ep_33_ut_119"
    },
    {
      "end": 1954902,
      "speaker": "Jon Schwabish",
      "start": 1950134,
      "text": "And just use the blogging system and customize it so it fits for your purpose.",
      "id": "ep_33_ut_120"
    },
    {
      "end": 1989458,
      "speaker": "Enrico Bertini",
      "start": 1955006,
      "text": "Right, right, exactly. Yeah. The other thing was, I was still sort of worried about, but not quite yet, is the, is, you know, the moderation. So, you know, we've had, I've had so I don't know, like we have. So there's 15 visualizations that are currently up there and there's about 250 comments all told, something like that. And you know, I was, when I started, I was sort of worried that I was gonna have to be moderating all these comments. And so far I haven't really had to do that, which is, which has been good, you know, and ideally, hopefully one day that will become a problem where there'll be so many commas, I'll have to worry about it.",
      "id": "ep_33_ut_121"
    },
    {
      "end": 2021518,
      "speaker": "Jon Schwabish",
      "start": 1989554,
      "text": "You need employees for managing the flood of comments. Yeah, that would be nice. But the way it works is so you have a data visualization problem or you post your current situation. That's the chart I'm having here with the data which can be found there. And do people have specific problems. They say, I don't like this specific aspect about the chart, or do they more say like I'm at a total loss. I have no idea what to do here. What is the typical question?",
      "id": "ep_33_ut_122"
    },
    {
      "end": 2104590,
      "speaker": "Enrico Bertini",
      "start": 2021694,
      "text": "I think the typical one I've gotten so far is I have this chart but I'm not happy with it. And oftentimes they're not sure why they're not happy with it. Something's wrong, something's wrong and they're not exactly sure why. I mean, that's the most common one. I think there have been a few where people say, I have this data and I don't know how to show it. Then there's been a couple ones that have been technical. I know I want to make this particular chart, but I am an Excel user and I don't know how to make it so far. I think the Excel ones have actually gotten the most number of comments because it's just more excel users. There was one a couple weeks ago, John Peltier actually ended up doing a separate tutorial on his website to show people how to do it. That sort of thing is great. You know, we've had some where there's the data but no visualization. People sometimes email me the visualization but no data. And that was the other thing I wanted to make sure that, you know, and I tell people, like, you can send it to me anonymously if you have, you know, your employer doesn't want it to be put out or the client doesn't want it to be put out, you know, just send it to me anonymously or, you know, sort of add some random components to the data or just make up the data. But, you know, the idea is just to get people to talk about sort of best presentations. And it's been interesting to see some of the comments on a few of these posts going back and forth between the different ways in which you could present data.",
      "id": "ep_33_ut_123"
    },
    {
      "end": 2134622,
      "speaker": "Jon Schwabish",
      "start": 2105290,
      "text": "Yeah, that's always the most surprising fact. Also, I think if you're stuck in one tool and, you know, five chart types and then somebody comes with a new tool like Tableau or D3, that has pretty much unlimited possibility is how many different perspectives you can gather on the same data set and also how important it is to look at them and contrast them against each other and say, oh, this one highlights this fact. This one seems to show maybe the overview a bit better and so on.",
      "id": "ep_33_ut_124"
    },
    {
      "end": 2190218,
      "speaker": "Enrico Bertini",
      "start": 2134726,
      "text": "Right? Yeah, there's one that's recent that was, I think it was a bar chart. Someone saying, here's how you could build this in Excel, and there was all this sort of back and forth about how to build it. Someone said, well, why are you building this as a bar chart? It doesn't show the data in the right way. Show it as a line chart, and all of a sudden you see this big change in the. See the big change that you wanted to show. You see it much more clearly as a line chart. And then there's this whole separate next discussion about how to modify the line chart so that it highlights the data in a different way. So those are the sorts of things that I'm most excited about, seeing people going down one path and then branching off into another path and seeing how that goes. So that's the part that I'm most excited about, is all these branching and forking off of different places and people learning how to not just how to make these things, but how to think about these things in different ways.",
      "id": "ep_33_ut_125"
    },
    {
      "end": 2207846,
      "speaker": "Jon Schwabish",
      "start": 2190314,
      "text": "Yeah. Yeah. That's nice. Is there a way for the authors to mark a question at some point as resolved, or, like, hand out, like, a little badge to the guy or who came up with a really brilliant solution, or is it more or less just. I mean, you can always comment, like, thanks. That totally.",
      "id": "ep_33_ut_126"
    },
    {
      "end": 2224718,
      "speaker": "Enrico Bertini",
      "start": 2207878,
      "text": "You can always comment for the ones that are anonymous. I write back to most of the people who originally submitted, and I said, you know, I hope you found it helpful. If you resolved it, you know, let me know and I'll post it back up. Yeah, so we've done that. I think I've only had to do that once. Yeah, but that's on my list.",
      "id": "ep_33_ut_127"
    },
    {
      "end": 2240350,
      "speaker": "Jon Schwabish",
      "start": 2224814,
      "text": "Yeah. Like badges, right? Badges, yeah, totally. And were there. Were there also, like, some questions that were totally unsolvable or way the discussion went nowhere, or do all of them sort of resolve?",
      "id": "ep_33_ut_128"
    },
    {
      "end": 2262452,
      "speaker": "Enrico Bertini",
      "start": 2241130,
      "text": "Some of them don't resolve, and I think it's hard because people have sent me stuff, and I'm not sure they were totally invested in the process, so they were sort of hoping there'd be a real simple answer, and all of a sudden there's like four questions without any work. Right, yeah, and there's like four questions, and the commenters are like, well, what are you trying to do with this? And then they're sort of like, well, I'll just stick with the pie chart. It's fine.",
      "id": "ep_33_ut_129"
    },
    {
      "end": 2266004,
      "speaker": "Jon Schwabish",
      "start": 2262516,
      "text": "Right? Yeah, worth a shot. Yeah.",
      "id": "ep_33_ut_130"
    },
    {
      "end": 2268760,
      "speaker": "Enrico Bertini",
      "start": 2266052,
      "text": "Right. Maybe there's a simple answer I didn't see. Yeah, yeah.",
      "id": "ep_33_ut_131"
    },
    {
      "end": 2273836,
      "speaker": "Jon Schwabish",
      "start": 2269140,
      "text": "Which is fine, too. I mean, then at least, you know, okay. There's no obvious way of how to improve it. I mean.",
      "id": "ep_33_ut_132"
    },
    {
      "end": 2274180,
      "speaker": "Enrico Bertini",
      "start": 2273868,
      "text": "Right.",
      "id": "ep_33_ut_133"
    },
    {
      "end": 2274612,
      "speaker": "Jon Schwabish",
      "start": 2274260,
      "text": "That's fine.",
      "id": "ep_33_ut_134"
    },
    {
      "end": 2275760,
      "speaker": "Enrico Bertini",
      "start": 2274636,
      "text": "Too. Yeah. Yeah.",
      "id": "ep_33_ut_135"
    },
    {
      "end": 2320988,
      "speaker": "Jon Schwabish",
      "start": 2276900,
      "text": "What I like about also the way the questions are posted, it's always with a context. So, you know, I'm a bit tired of people discussing good or bad charts without actually taking the original task or, you know, the briefing or the use context into account. So that's also such a Twitter effect. Like, people pass around a picture and then they say, ah, green. I don't like green. It should be red. Yeah. You know, in a way it's like that. And I think every design is, like, totally unjudgeable without having the context, like, both organizationally and how much resource is available, but also how it's gonna be used, what it's good for.",
      "id": "ep_33_ut_136"
    },
    {
      "end": 2321436,
      "speaker": "Enrico Bertini",
      "start": 2321084,
      "text": "Right.",
      "id": "ep_33_ut_137"
    },
    {
      "end": 2334972,
      "speaker": "Jon Schwabish",
      "start": 2321508,
      "text": "And I think people specify that quite well on your side, and I like that. So they really try to present you with that situation they're in, and then we can debate together how to move on.",
      "id": "ep_33_ut_138"
    },
    {
      "end": 2335780,
      "speaker": "Enrico Bertini",
      "start": 2335116,
      "text": "Right.",
      "id": "ep_33_ut_139"
    },
    {
      "end": 2336932,
      "speaker": "Jon Schwabish",
      "start": 2335940,
      "text": "That's the right way.",
      "id": "ep_33_ut_140"
    },
    {
      "end": 2379930,
      "speaker": "Enrico Bertini",
      "start": 2337036,
      "text": "And there's a lot of back and forth I have with people who submit things, usually a lot of back and forth before it goes up, because they'll send me, here's a chart and here's the data, can you put it up? And I'll say, well, we need that context, or I'll get things that are totally unclear. I find it's pretty funny how people send me emails where I can't figure out what you're doing. So imagine that lots of people are going to read this and how would you rewrite it? Yeah, the context is important. You know, some, there have been a couple up there where it's been. Here's my data. I don't know what to do with it. And that's, those are the ones, I think, that haven't gotten as much response because of this exact reason. So if I don't know what you're trying, what story you're trying to tell, it's really hard for me to give you alternatives.",
      "id": "ep_33_ut_141"
    },
    {
      "end": 2380758,
      "speaker": "Jon Schwabish",
      "start": 2380350,
      "text": "Right.",
      "id": "ep_33_ut_142"
    },
    {
      "end": 2400674,
      "speaker": "Moritz Stefaner",
      "start": 2380814,
      "text": "Yeah. But I think that's, that's super important. And at the same time, my feeling is that there are a lot of people out there who suddenly realize that they have lots of data and they should be doing something with it, and then they contact you and say, look, I have this whole bunch of data. I want to do something, but I don't know exactly what. Right. This happens all the time.",
      "id": "ep_33_ut_143"
    },
    {
      "end": 2480050,
      "speaker": "Enrico Bertini",
      "start": 2400762,
      "text": "And there's a little bit of a tension there between putting something up where someone is basically getting free services versus going out and hiring someone or contracting with someone to actually get the work. So this is the one thing that I'm still a little sort of uneasy about. And I've had some requests for help where it sort of feels like this is some agency or group or firm that sort of doesn't want to go down the road of finding someone to contract with and they just sort of want to get the free service. And those I'm a little less confident about. I mean, I think a lot of the ones that are up there right now have been one offs from researchers or places where they're like, you know, I really don't know how to fix this. And I'm giving a presentation, you know, sort of help me how to do it. The ones where it feels more professional to me, where they're saying, we have this publication that we're putting out and we need, you know, the graphic for the front cover. Yeah. You know, how do we do that? You know, you know, those are, I'm a little more wary about those because, you know, there are people who are doing this for a living and, you know, so there's a fine line. I don't know where the line is yet. I'm sure. I'm sure I'll find out at some point, someone will be angry enough with me that I'll find out.",
      "id": "ep_33_ut_144"
    },
    {
      "end": 2494490,
      "speaker": "Jon Schwabish",
      "start": 2480550,
      "text": "Yeah, but I mean, or did you have, like, concrete cases of posts that you did which you held back because you said, like, that's too obviously commercial or too obviously, like, trying to get free labor?",
      "id": "ep_33_ut_145"
    },
    {
      "end": 2534564,
      "speaker": "Enrico Bertini",
      "start": 2494830,
      "text": "Yeah. I had one where an organization was doing a big publication and the request was general and broad enough that I wasn't really comfortable putting it up. And the writer, the person who asked said, I'm not really sure if this is appropriate, so you let us know. But basically they have some big report and they do it every year or something like that. And would it be okay if they asked for comments or suggestions about how to do the graphs in this report? That was like, I'm not really sure, but I think. No, yeah, probably not.",
      "id": "ep_33_ut_146"
    },
    {
      "end": 2534860,
      "speaker": "Jon Schwabish",
      "start": 2534612,
      "text": "Yeah.",
      "id": "ep_33_ut_147"
    },
    {
      "end": 2535100,
      "speaker": "Enrico Bertini",
      "start": 2534900,
      "text": "Right.",
      "id": "ep_33_ut_148"
    },
    {
      "end": 2563066,
      "speaker": "Jon Schwabish",
      "start": 2535140,
      "text": "But it's a good question. I mean, on the one hand, there's nothing bad about it. On the other hand, yeah, as you say, there are people who make a living out of that. And it's also maybe let's compare it to, like, health sides. So, I mean, it's okay to post on a forum if, you know, if you have a certain cuff, if that's, if other people have experience with that, if you have a real problem, you should go see a real doctor. Right. So that's my stance on that.",
      "id": "ep_33_ut_149"
    },
    {
      "end": 2585900,
      "speaker": "Enrico Bertini",
      "start": 2563218,
      "text": "And I think it's one thing to say, here's one chart I need help with. One chart. You know, I have a pie chart. I don't know what else to do with it. Or I have a scatterplot, but it's totally unclear. And I don't know how to, like, you know, strip out all the extra information. It's another thing to say, we have a book that we have to do every year. You know, we'd help. So I think maybe that's the line. I don't know. People, people will tell me what the line is. So trial and error, I think.",
      "id": "ep_33_ut_150"
    },
    {
      "end": 2598608,
      "speaker": "Jon Schwabish",
      "start": 2586840,
      "text": "And how is the debate culture like, is it usually like a lot of back and forth, or is it more like one suggestion dominating the discussion, or how do these threads evolve in your experience?",
      "id": "ep_33_ut_151"
    },
    {
      "end": 2704112,
      "speaker": "Enrico Bertini",
      "start": 2598784,
      "text": "So, so far, the threads have been. They haven't. There hasn't been sort of a few, like, I mean, there are a few people who comment a lot, right? They're just, they're just high, high frequency people, but they don't sort of dominate the conversation, which is what I've. Which is nothing I can control. But something that I think is really great so far about the site is that it really is a bunch of different people coming in and adding their two cent. And the comments have ranged from, I don't like the colors that such and such put in the redesign because you shouldn't put red and green together. If that's a comment, that's fine. I don't think people should feel like their comments have to be redesigning an entire chart. If there's, like, one aspect of the chart they think is particularly wrong or egregious, then they should be happy to do that. So it hasn't been dominated by particular people yet, which has been nice. And it's been really, so far, it's been really positive, which is the other thing that you can't really control human behavior, especially on the Internet. So there's this concern that people are going to be really negative and they're, you know, they're going to say, this is garbage. You should never come back to this site again. But so far, people have been, try this or try this. People have put things into Tableau visualizations just as a try, but it's in Tableau public, so you can go in and play with it. So all those sorts of things I think, are all positive. And then you have people saying, here's a lengthy criticism. It might be two or three paragraphs, and here are the things you should consider. I'm not going to give you an alternative because I don't understand the data, I don't understand the full story, but here are some sort of constructive criticism about things you want to think about, which is the whole point, to sort of go beyond the 140 character critique. Right?",
      "id": "ep_33_ut_152"
    },
    {
      "end": 2704760,
      "speaker": "Jon Schwabish",
      "start": 2704216,
      "text": "Yeah.",
      "id": "ep_33_ut_153"
    },
    {
      "end": 2708512,
      "speaker": "Moritz Stefaner",
      "start": 2704880,
      "text": "So do you participate in the discussion or you let the others?",
      "id": "ep_33_ut_154"
    },
    {
      "end": 2741808,
      "speaker": "Enrico Bertini",
      "start": 2708616,
      "text": "Yeah, I participate when I can. I participate as myself. So I participate as John. I don't participate as the moderator of the site because then it would show up as help me vis. And that's a little. I want it to be sort of me. This is my idea. These are my comments. Right? Yeah. So I try to chime in when I can, but right now I'm just trying to put as much content on the site as possible. So I spend, when I'm working with regards to the site, when I'm working on that, I'm really just trying to get people to send me information. So that's where I spend most of my time right now.",
      "id": "ep_33_ut_155"
    },
    {
      "end": 2747230,
      "speaker": "Moritz Stefaner",
      "start": 2741864,
      "text": "Sure. Sure. So what's next then?",
      "id": "ep_33_ut_156"
    },
    {
      "end": 2793324,
      "speaker": "Enrico Bertini",
      "start": 2747350,
      "text": "Yeah, I've got a lot, I've got a lot of my, I've got a lot of ideas, but, you know, we'll see where it goes. So I've got. So there are 15 visualizations up there. It's been up for about two and a half months. So we're averaging about one a week. Obviously, the more content the better. But there's a whole list of things I like to do. So, Moritz, you mentioned badges. I think that would be great to sort of give frequent or good commenter sort of a shout out. It'd be great to have contests or sponsors. I can imagine, you know, an actual formal, you know, like visualizing.org does their contest where they're asking for sort of original work. But I can imagine a contents, a contest of revising an existing visualization.",
      "id": "ep_33_ut_157"
    },
    {
      "end": 2794844,
      "speaker": "Jon Schwabish",
      "start": 2793412,
      "text": "Sure. No, absolutely. Yeah.",
      "id": "ep_33_ut_158"
    },
    {
      "end": 2817200,
      "speaker": "Enrico Bertini",
      "start": 2794892,
      "text": "You know, I can imagine people doing tutorials on the site. You know, John Peltier did his tutorial. He put it on his own site. But it would be nice to, someone said, I don't know how to build this interactive map in D3, and it could be cross posted with boss doc site or whatever, or GitHub or what have you, but it'd be nice to have tutorials where people could learn directly from the site.",
      "id": "ep_33_ut_159"
    },
    {
      "end": 2860876,
      "speaker": "Moritz Stefaner",
      "start": 2817980,
      "text": "Sorry if I interrupt you. Speaking of contests, I think that one interesting aspect here is that most contests out there, they basically provide some data set and sometimes, hopefully some questions. And then the way the entries are judged is basically by visualization experts. Right. Rather than domain experts, I have seen very rarely contests where the final judgment is given by the end user. I think here you have an opportunity to do that because every single chart, if I understand well, comes from a person who has a real problem in his own domain and wants to create a chart that solves this problem. Right?",
      "id": "ep_33_ut_160"
    },
    {
      "end": 2861652,
      "speaker": "Enrico Bertini",
      "start": 2861028,
      "text": "Absolutely right.",
      "id": "ep_33_ut_161"
    },
    {
      "end": 2909432,
      "speaker": "Moritz Stefaner",
      "start": 2861676,
      "text": "And that's a pretty unique feature of your blog. Right. I think the only contest that comes into my mind that does something similar to that is the vast challenge. I think we talked about the vast challenge a few episodes back, and it's really, really interesting what they do there, because they have real world analysts using these tools for real and trying to discover interesting information by using these tools. And these are the people who provide the original data sets. Okay, so you have people from, I don't remember, I think, for instance, intelligence analysts providing some data, then waiting for the submissions to come, and then judging the results on their own data sets. And I think that's pretty cool.",
      "id": "ep_33_ut_162"
    },
    {
      "end": 2927692,
      "speaker": "Enrico Bertini",
      "start": 2909506,
      "text": "Yeah. It'd be great to have not just the person asking for help be a judge, but also people they work with and also their target audience. You know, I can imagine a person who says, you know, I have to do this report, and here's my audience. So we'll get, you know, someone that acts as that audience to be the judge or, you know, be on the panel.",
      "id": "ep_33_ut_163"
    },
    {
      "end": 2929628,
      "speaker": "Moritz Stefaner",
      "start": 2927796,
      "text": "Yeah. Yeah, yeah, yeah, yeah.",
      "id": "ep_33_ut_164"
    },
    {
      "end": 3006880,
      "speaker": "Enrico Bertini",
      "start": 2929764,
      "text": "You know, I think that. I think. I think that gets back to putting everything in context and not just, you know, what's the coolest visualization or what looks the best or, you know, who's taking the best selfie, you know, let's, you know, let's. Let's. Let's think about the context. Let's think about the purpose. Think about whether it's actually telling the story we want it to tell. And, yeah, it'd be great to sort of have a, you can imagine a contest where it's a. The judges are a combination of the original designer, you know, experts in the visualization field and also the end user. So you could have all of that spanning. So, yeah, I mean, there's, there's, there. I think there's a lot of places it can go. And like I said, it'll really be determined by the amount of content that goes up there and whether, and whether people continue to comment on it. You know, you got, it was mentioned, I think, in a few episodes back when you have Robert and Andy on, you know, these sorts of things with, you know, this, this site and the thumbs up viz site and the WTF viz site, those are all based on content, but they sort of only work if people sort of participate, and I'm optimistic that people will. It's been really great so far, so I'm excited about it.",
      "id": "ep_33_ut_165"
    },
    {
      "end": 3030040,
      "speaker": "Jon Schwabish",
      "start": 3006960,
      "text": "Cool. Yeah, I think that's the best challenge, as you said, keeping the community grow and active at the same time. And this is also something you can sort of garden that, but in a way, it's also out of your hand. So you just also have to get lucky or provide the right environment and just help things grow. But of course, it lives off the user's comments. The whole thing.",
      "id": "ep_33_ut_166"
    },
    {
      "end": 3077100,
      "speaker": "Enrico Bertini",
      "start": 3030080,
      "text": "Right. The whole thing lives off the users, and you just sort of let people do it. And, you know, I've made the point of saying the point of this is to be constructive. And, you know, we haven't had any sort of the things that I feared, which is, which I think speaks to who's working in this field. Right. That people are willing to sort of take their time, take time out of their day and make some positive comments and make some changes to these things that, you know, they don't have anything, anything to gain except from playing with data and experimenting with new. With new approaches, which is really cool. I think that's a really unique aspect of the Dataviz community of people wanting to help. I think that was part of the other impetus. Right. Is people really do want to help people figure out how to do a better job of presenting their data.",
      "id": "ep_33_ut_167"
    },
    {
      "end": 3087040,
      "speaker": "Jon Schwabish",
      "start": 3077260,
      "text": "Right. Right. Do you have, like, one favorite thread or like one favorite discussion or one that found the most attention or the most redesigns?",
      "id": "ep_33_ut_168"
    },
    {
      "end": 3088844,
      "speaker": "Enrico Bertini",
      "start": 3088300,
      "text": "Yeah.",
      "id": "ep_33_ut_169"
    },
    {
      "end": 3092348,
      "speaker": "Jon Schwabish",
      "start": 3088932,
      "text": "What should people check out? If they check out only one post, which one would it be?",
      "id": "ep_33_ut_170"
    },
    {
      "end": 3094008,
      "speaker": "Enrico Bertini",
      "start": 3092444,
      "text": "Well, they should check out all the posts.",
      "id": "ep_33_ut_171"
    },
    {
      "end": 3095660,
      "speaker": "Jon Schwabish",
      "start": 3094124,
      "text": "Yeah. Which one first?",
      "id": "ep_33_ut_172"
    },
    {
      "end": 3144444,
      "speaker": "Enrico Bertini",
      "start": 3098000,
      "text": "Well, so I have a couple favorites. So I think one of my favorites is the pie chart triplet. So there's three pie charts. And for experts in the dataviz field, the things that you would expect were on there. But it was really interesting to see the variety of possibilities. And it sort of spanned from column charts, line charts, and I think the last one was sort of like a mosaic plot. So that one was really, that one was, I thought that one was really cool. And then the other one was someone posted a chart where they had sort of column charts combined with line charts in excel. And there was, I think there were like 20 or 30 comments on it. And the variety of.",
      "id": "ep_33_ut_173"
    },
    {
      "end": 3150580,
      "speaker": "Jon Schwabish",
      "start": 3144572,
      "text": "Sounds like a bad idea sounds like something you should comment on.",
      "id": "ep_33_ut_174"
    },
    {
      "end": 3216684,
      "speaker": "Enrico Bertini",
      "start": 3150660,
      "text": "Right. But I think it was, you know, Peltier did a did a, did a tutorial, and then I think Joe Mako did a pretty cool revision using a. It's hard to explain, but, you know, people go find it. But it's, you know, sort of lines with gradient, using gradient colors. And that was pretty neat. And that sort of spurred a whole other conversation about, you know, whether that was a, you know, a good way to present it and that sort of thing. So, yeah, so those two are probably my favorites, but there's a lot of good stuff out there. And I'm hoping again that things sort of branch off into, like recently, the one that's up now. Someone said, well, redesign this, and here are the colors that you said. And someone said, well, don't use red and green because you shouldn't use red and green. Right. And he said, well, we sort of have to use red and green because that's what the client, the client wants and that's what the client expects. And so I'm hoping that sort of conversation sort of branches off into a longer conversation about discussions about color, discussions about when you should sort of push back on a client to say, this is why you shouldn't use this color palette or whatever.",
      "id": "ep_33_ut_175"
    },
    {
      "end": 3238002,
      "speaker": "Jon Schwabish",
      "start": 3216732,
      "text": "So there's a lot of places you could actually turn. I just had this idea, turn it into these before and after studies, but providing all that context, like, in some form, condense all these longer discussions into, like, what turned out to be the best solution, maybe, or perceived best solution and document that a bit. So that could be another book project or something.",
      "id": "ep_33_ut_176"
    },
    {
      "end": 3246026,
      "speaker": "Enrico Bertini",
      "start": 3238106,
      "text": "Yeah, no, it would be nice, you know, it would be nice to have the original posters come back and say, this is what we ended up doing. And a lot of this.",
      "id": "ep_33_ut_177"
    },
    {
      "end": 3255320,
      "speaker": "Jon Schwabish",
      "start": 3246058,
      "text": "Oh, yeah, that would be the third step. Like first is like the original, then the proposal and then what actually works and there. Give it context again. Right. Or how it transforms.",
      "id": "ep_33_ut_178"
    },
    {
      "end": 3256756,
      "speaker": "Moritz Stefaner",
      "start": 3255450,
      "text": "Totally. Buy this book.",
      "id": "ep_33_ut_179"
    },
    {
      "end": 3258200,
      "speaker": "Jon Schwabish",
      "start": 3256868,
      "text": "Yeah, that's super cool.",
      "id": "ep_33_ut_180"
    },
    {
      "end": 3262628,
      "speaker": "Enrico Bertini",
      "start": 3260140,
      "text": "I'll put it on my list and recall more things.",
      "id": "ep_33_ut_181"
    },
    {
      "end": 3263640,
      "speaker": "Jon Schwabish",
      "start": 3262804,
      "text": "More work.",
      "id": "ep_33_ut_182"
    },
    {
      "end": 3265524,
      "speaker": "Enrico Bertini",
      "start": 3264660,
      "text": "That's right.",
      "id": "ep_33_ut_183"
    },
    {
      "end": 3266840,
      "speaker": "Jon Schwabish",
      "start": 3265652,
      "text": "Not getting bored.",
      "id": "ep_33_ut_184"
    },
    {
      "end": 3287870,
      "speaker": "Moritz Stefaner",
      "start": 3268220,
      "text": "No, but seriously, I think so. I am a super big fan of case studies. I think we don't have enough case studies out there. And I think that people could learn a lot by having more case studies because from case studies you can learn a lot. So the more, the better. The more organized they are, the better.",
      "id": "ep_33_ut_185"
    },
    {
      "end": 3293338,
      "speaker": "Jon Schwabish",
      "start": 3288570,
      "text": "But they need all this extra documentation, like on the process and on the requirements and so on.",
      "id": "ep_33_ut_186"
    },
    {
      "end": 3344372,
      "speaker": "Moritz Stefaner",
      "start": 3293434,
      "text": "Yeah, I think they are, of course, much, much harder to digest. But if you are serious about learning visualization, that's one of the way to go. If you just want to flip through a series of images, well, who cares, right? But if you really want, I mean, just do it, I don't care. But if you really want. No, seriously. Okay, I'm okay with it. But if you want to learn how to do this thing properly, I think going through a lot of case studies is the best way to go. And I can tell you, me as a teacher, I have a very hard time explaining things to my students without having case studies because visualization theory doesn't magically materialize into being an expert in visualization. The only way to go is to do it for real or see a lot of good examples. So I think that's the reason why. Help me. This is a great, great, great thing. Well, great.",
      "id": "ep_33_ut_187"
    },
    {
      "end": 3346260,
      "speaker": "Enrico Bertini",
      "start": 3344396,
      "text": "Well, I hope your students will use it, Enrico.",
      "id": "ep_33_ut_188"
    },
    {
      "end": 3347880,
      "speaker": "Moritz Stefaner",
      "start": 3346380,
      "text": "Yeah, sure, sure.",
      "id": "ep_33_ut_189"
    },
    {
      "end": 3352396,
      "speaker": "Jon Schwabish",
      "start": 3348460,
      "text": "Oh, you should send them over and have, like, have them drop a few comments.",
      "id": "ep_33_ut_190"
    },
    {
      "end": 3394590,
      "speaker": "Moritz Stefaner",
      "start": 3352428,
      "text": "Absolutely. As I told you at the beginning, there are not many, many resources like that out there, right? Yeah. And actually, one thing I wanted to ask you is how do you expect people to consume the information that you're putting there, especially in the future right now? I think you still have, I don't remember how many charts you said you have, but I think it's still feasible to go through the old list and quickly seep through them. But as the site will be growing, you might want to switch to a modality where people can quickly focus on something or be guided through some kind of thread. The way you are organizing information right now, if I understand correctly, is by chart type.",
      "id": "ep_33_ut_191"
    },
    {
      "end": 3396298,
      "speaker": "Enrico Bertini",
      "start": 3394680,
      "text": "Yeah, it's by chart type and tool.",
      "id": "ep_33_ut_192"
    },
    {
      "end": 3404858,
      "speaker": "Moritz Stefaner",
      "start": 3396434,
      "text": "So I'm wondering if you are satisfied with that, if you plan to change it in the future, as you have more examples, I'm curious to hear, what are your thoughts on that?",
      "id": "ep_33_ut_193"
    },
    {
      "end": 3446080,
      "speaker": "Enrico Bertini",
      "start": 3404954,
      "text": "Yeah, that's a good question. So I'm not exactly sure. So right now I've been tagging everything with the type of visualization and the tool that's being used. But yeah. So right now, sort of an infinite scroll situation where you can just sort of look through this entire library and I don't know how the down the road you have however many different visualizations. I don't know what the best way to start to organize these things. You can imagine doing one where it's ones that are solved, which would be nice if you just wanted to see the case study of how something went from beginning to the end. That would be one way to do it.",
      "id": "ep_33_ut_194"
    },
    {
      "end": 3453210,
      "speaker": "Jon Schwabish",
      "start": 3447310,
      "text": "That need an answer still. I mean, that could be the adverse the inverse situation.",
      "id": "ep_33_ut_195"
    },
    {
      "end": 3478308,
      "speaker": "Enrico Bertini",
      "start": 3454310,
      "text": "Yeah, I mean, that is definitely the thing on here that if you go to the site, it is right now it's sort of unclear. Right now. Everything is still open. But in three months from now, the person who posted the first graph isn't going to care because hopefully he solved the problem. But it's not clear the way I've set it up yet that those things have been addressed or not. So that's a good question. I don't know the answer yet, but.",
      "id": "ep_33_ut_196"
    },
    {
      "end": 3514094,
      "speaker": "Jon Schwabish",
      "start": 3478324,
      "text": "I mean, you can just, you know, tackle that problem once it presents itself. Just let it grow and see what's happening. Yeah, yeah. I'd like to add also, like the mention for the policy Viscom blog that still you're writing that. And now for the visualize conference, you had a few, like a whole series of posts that were really nice, that summarized the whole conference. And also the, the rest of the blog is really nice. So I just wanted to mention that so it makes good reading if you're into that type of thing, as we all are, obviously.",
      "id": "ep_33_ut_197"
    },
    {
      "end": 3514750,
      "speaker": "Enrico Bertini",
      "start": 3514182,
      "text": "Yes.",
      "id": "ep_33_ut_198"
    },
    {
      "end": 3521606,
      "speaker": "Jon Schwabish",
      "start": 3514870,
      "text": "Yeah. Anything else, Enrico? You have more questions?",
      "id": "ep_33_ut_199"
    },
    {
      "end": 3523718,
      "speaker": "Moritz Stefaner",
      "start": 3521798,
      "text": "We should meet sometime soon. John.",
      "id": "ep_33_ut_200"
    },
    {
      "end": 3525414,
      "speaker": "Enrico Bertini",
      "start": 3523854,
      "text": "Yes, we should.",
      "id": "ep_33_ut_201"
    },
    {
      "end": 3526970,
      "speaker": "Jon Schwabish",
      "start": 3525462,
      "text": "That's a good question. Yeah.",
      "id": "ep_33_ut_202"
    },
    {
      "end": 3537656,
      "speaker": "Enrico Bertini",
      "start": 3528470,
      "text": "I have questions for you, Enrico, about, about your challenges with teaching. I'm looking forward to more of your posts about teaching data visualization.",
      "id": "ep_33_ut_203"
    },
    {
      "end": 3564010,
      "speaker": "Moritz Stefaner",
      "start": 3537848,
      "text": "Honestly, I think we had one episode on data stories on teaching, but I think I would like to do more because I've been thinking we could have another episode. I've been thinking about teaching quite a lot recently, as you can imagine, and it's damn hard. I think it's not clear how to teach visualization, and it's a real challenge. So I think that people like you or Andy and Moritz from time to time gives some teaching, too.",
      "id": "ep_33_ut_204"
    },
    {
      "end": 3564274,
      "speaker": "Jon Schwabish",
      "start": 3564050,
      "text": "Yeah.",
      "id": "ep_33_ut_205"
    },
    {
      "end": 3574058,
      "speaker": "Moritz Stefaner",
      "start": 3564322,
      "text": "Right. So there are a few people out there who are teaching, but I think we don't discuss enough about what's the best way to teach visualization. And I think it's really, really hard.",
      "id": "ep_33_ut_206"
    },
    {
      "end": 3579066,
      "speaker": "Enrico Bertini",
      "start": 3574154,
      "text": "Yeah. And it's also being taught in so many different areas.",
      "id": "ep_33_ut_207"
    },
    {
      "end": 3599790,
      "speaker": "Moritz Stefaner",
      "start": 3579218,
      "text": "Absolutely. There are so many ways to teach visualization, and there are so many different kind of people wants to learn visualization for completely different kind of purposes. So probably there's no, no single best way to teach it. Right? So, but there is material for another episode. So maybe we will call you back with some other people to have an episode only on teaching.",
      "id": "ep_33_ut_208"
    },
    {
      "end": 3632786,
      "speaker": "Enrico Bertini",
      "start": 3599870,
      "text": "Yeah, yeah. I mean, I've talked to a lot of people, you know, in journalism schools and policy schools and economics departments. I mean, in those all have different. If you're teaching data journal data visualization in those different departments, they have different needs. And so that's what I think makes it even harder, sort of figure out, you know, if you teach data visualization to a journalism, to students in a journalism class, they have different needs than if you teach data journalism or data visualization to economists or computer scientists or, you know, any other group. So, yeah, I think it's a real challenge.",
      "id": "ep_33_ut_209"
    },
    {
      "end": 3634050,
      "speaker": "Moritz Stefaner",
      "start": 3632858,
      "text": "Yeah, it is.",
      "id": "ep_33_ut_210"
    },
    {
      "end": 3635258,
      "speaker": "Enrico Bertini",
      "start": 3634170,
      "text": "And it's an important one.",
      "id": "ep_33_ut_211"
    },
    {
      "end": 3635626,
      "speaker": "Moritz Stefaner",
      "start": 3635314,
      "text": "Sure.",
      "id": "ep_33_ut_212"
    },
    {
      "end": 3650496,
      "speaker": "Jon Schwabish",
      "start": 3635698,
      "text": "You know, it's also hard to answer generally, as you say, because it's so different. Whatever. Like what everybody expects to get out of it and what everybody's background is, you know, it's such a mess.",
      "id": "ep_33_ut_213"
    },
    {
      "end": 3656900,
      "speaker": "Enrico Bertini",
      "start": 3650688,
      "text": "Yeah. You've got such a wide variance in skill sets. That's hard class to teach.",
      "id": "ep_33_ut_214"
    },
    {
      "end": 3667120,
      "speaker": "Jon Schwabish",
      "start": 3658280,
      "text": "Yeah. It might be worthwhile to have a whole episode of that. It's a good idea. Cool. But I think we can wrap up this one.",
      "id": "ep_33_ut_215"
    },
    {
      "end": 3667984,
      "speaker": "Moritz Stefaner",
      "start": 3667240,
      "text": "Absolutely.",
      "id": "ep_33_ut_216"
    },
    {
      "end": 3670624,
      "speaker": "Jon Schwabish",
      "start": 3668072,
      "text": "Thanks, John. That's been super interesting.",
      "id": "ep_33_ut_217"
    },
    {
      "end": 3671784,
      "speaker": "Enrico Bertini",
      "start": 3670752,
      "text": "Yeah, this is a lot of fun.",
      "id": "ep_33_ut_218"
    },
    {
      "end": 3683688,
      "speaker": "Jon Schwabish",
      "start": 3671872,
      "text": "Yeah. And I really like to. I'm really looking forward to see how, help me with evolves. I've been browsing through a few of the threads, and it's super instructive. So I'm really looking forward to see that baby grow.",
      "id": "ep_33_ut_219"
    },
    {
      "end": 3688536,
      "speaker": "Moritz Stefaner",
      "start": 3683784,
      "text": "Yeah, same here. I agree. Very, very nice initiative. Thanks for doing that, John.",
      "id": "ep_33_ut_220"
    },
    {
      "end": 3688808,
      "speaker": "Enrico Bertini",
      "start": 3688568,
      "text": "Great.",
      "id": "ep_33_ut_221"
    },
    {
      "end": 3691340,
      "speaker": "Moritz Stefaner",
      "start": 3688864,
      "text": "I think it's a great service to the community.",
      "id": "ep_33_ut_222"
    },
    {
      "end": 3694072,
      "speaker": "Enrico Bertini",
      "start": 3691880,
      "text": "Well, thanks for having me. This is a lot of fun.",
      "id": "ep_33_ut_223"
    },
    {
      "end": 3695320,
      "speaker": "Jon Schwabish",
      "start": 3694256,
      "text": "Thanks, John. Bye bye.",
      "id": "ep_33_ut_224"
    },
    {
      "end": 3696112,
      "speaker": "Moritz Stefaner",
      "start": 3695360,
      "text": "See you soon. Bye.",
      "id": "ep_33_ut_225"
    }
  ],
  "confidence": 0.929873960073868,
  "audio_duration": 3703,
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_status_code": null,
  "webhook_auth": false,
  "webhook_auth_header_name": null,
  "speed_boost": false,
  "auto_highlights_result": null,
  "auto_highlights": false,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_audio_quality": null,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "content_safety": false,
  "iab_categories": true,
  "content_safety_labels": {
    "status": "unavailable",
    "results": [],
    "summary": {}
  },
  "language_detection": false,
  "language_detection_threshold": null,
  "language_confidence": null,
  "custom_spelling": null,
  "throttled": false,
  "auto_chapters": true,
  "summarization": false,
  "summary_type": null,
  "summary_model": null,
  "custom_topics": false,
  "topics": [],
  "speech_threshold": null,
  "speech_model": "best",
  "chapters": [
    {
      "summary": "Data stories number 33. Hi, Moritz. How are you doing? Hi, Rico. 33 is a nice number. Pretty round.",
      "gist": "33",
      "headline": "Data stories number 33 is a nice number",
      "start": 11680,
      "end": 26558,
      "id": "ep_33_ch_0"
    },
    {
      "summary": "We launched the Selfie City project. We looked at selfies and analyzed selfie pictures from five cities across the world. I spent the whole week in New York. If we find a good sponsor who will fly me in for every episode, I'm all gaming.",
      "gist": "Selfie City: The Selfie City Project",
      "headline": "We launched the Selfie City project and it's been hugely successful",
      "start": 26734,
      "end": 172570,
      "id": "ep_33_ch_1"
    },
    {
      "summary": "How was your time? A lot of work as usual. Doing research, teaching. We had a notification for a paper accepted at Euroviz this year. I will talk more about this work once it is fully accepted.",
      "gist": "A week in the life of science",
      "headline": "The submissions for this are coming up soon. So everyone is working on that",
      "start": 173790,
      "end": 236526,
      "id": "ep_33_ch_2"
    },
    {
      "summary": "Shall we briefly go to listener feedback? Yeah, I mean, doing more episodes, we would love to, but it's really. Daily show is not an option. Be able to be a bit more regular. In order to scale it up, we need help.",
      "gist": "Thank you for listening!",
      "headline": "We would love to do more episodes, but it's really not an option",
      "start": 236638,
      "end": 336070,
      "id": "ep_33_ch_3"
    },
    {
      "summary": "Jon Schwabish has listened to all 32 episodes myself. Did you listen to every single episode? Every single episode. From beginning to end. That should be a new requirement for guests. You cannot just, like, jump in in the middle.",
      "gist": "Jon Schwabish",
      "headline": "We have another special guest today we have Jon Schwabish",
      "start": 339970,
      "end": 391900,
      "id": "ep_33_ch_4"
    },
    {
      "summary": "One of the early ones with Andy Kirk was good when he. was on. And, you know, when Ben Shneiderman was on, that was fun. One day there will be like a top hits collection.",
      "gist": "Favorite Podcast Episodes",
      "headline": "So what was your favorite episode on our great podcast",
      "start": 393040,
      "end": 434696,
      "id": "ep_33_ch_5"
    },
    {
      "summary": "John Sutter is an economist at the Congressional Budget office in DC. He became interested in data visualization a couple years ago. Sutter recently launched his own blog and workshops on data visualization. Everything he talks about today is going to be his own views and not those of CBO.",
      "gist": "John Hussman on Data Visualization",
      "headline": "John Sutter is an economist at the Congressional Budget Office",
      "start": 434848,
      "end": 691624,
      "id": "ep_33_ch_6"
    },
    {
      "summary": "Many economists haven't thought about how to present their work visually. Do people in the policy scene have the same reservations, or is that maybe a thing of the past? It's already being overcome. People are starting to recognize that a simple line chart or a good column chart will gain attention.",
      "gist": "Post-Budget Office Graphics",
      "headline": "Many economists still haven't thought about how to present their work visually",
      "start": 691752,
      "end": 987420,
      "id": "ep_33_ch_7"
    },
    {
      "summary": "Most people want to know what's a better way to present their data. One thing I get most often is people not recognizing that they can make a scatter plot. People are starting to recognize that it's the graphics and the visuals that are gaining attention.",
      "gist": "What Do Scientists Need to Do to Make Their Charts Better?",
      "headline": "People often come to you and say they need help making charts better",
      "start": 987560,
      "end": 1342910,
      "id": "ep_33_ch_8"
    },
    {
      "summary": "Data visualization and policymaking is a big topic for sure. There's not an emphasis on hiring designers or UX people or JavaScript people. Think tanks in DC are starting to recognize that they need a dedicated communications team that focuses on the visual aspect of research.",
      "gist": "What Data Visualization Can Help Me With",
      "headline": "Data visualization and policymaking is a big topic for sure",
      "start": 1345690,
      "end": 1440290,
      "id": "ep_33_ch_9"
    },
    {
      "summary": "Most people see the value pretty immediately. Once you get rid of all the thick grid lines, the data is just much more clearer once you think about a different way of presenting it. So for the most part, people are really receptive to it.",
      "gist": "A few thoughts on the redesign of charts",
      "headline": "So when you run your workshops, most of the participants are from economy",
      "start": 1441110,
      "end": 1695072,
      "id": "ep_33_ch_10"
    },
    {
      "summary": "Help me. You cannot see face, but. We should Turn into video podcast mod so people could see your face. Absolutely. I'll just post a few screenshots from you. Yeah, that would be disgusting.",
      "gist": "The article on Excel",
      "headline": "John: I got a lot of great feedback about the article",
      "start": 1695176,
      "end": 1760158,
      "id": "ep_33_ch_11"
    },
    {
      "summary": "Help me biz is a place where people can post visualizations that they're either having trouble with or they want feedback on. And then the community at large can comment in and provide ideas and options. There's 15 visualizations currently up there and there's about 250 comments all told.",
      "gist": "A place to discuss and comment on visualizations",
      "headline": "Help me biz is a place where people can post visualizations",
      "start": 1760174,
      "end": 2191770,
      "id": "ep_33_ch_12"
    },
    {
      "summary": "Is there a way for the authors to mark a question at some point as resolved, or, like, hand out a little badge to the guy or who came up with a brilliant solution? The way the questions are posted, it's always with a context.",
      "gist": "Is there a way for the authors to mark a question at some",
      "headline": "Is there a way for the authors to mark a question as resolved, or",
      "start": 2191930,
      "end": 2566442,
      "id": "ep_33_ch_13"
    },
    {
      "summary": "John Moritz: The site has been up for about two and a half months. There are 15 visualizations up there. So far, so far, it's been really positive, he says. Moritz wants to have contests or shout-outs for good commenters.",
      "gist": "John on the Data Visualizations",
      "headline": "So far, the comments on the site have been really positive",
      "start": 2566506,
      "end": 2819076,
      "id": "ep_33_ch_14"
    },
    {
      "summary": "Most contests out there, they basically provide some data set and sometimes, hopefully some questions. The way the entries are judged is basically by visualization experts. It'd be great to have a contest where it's a combination of the original designer, experts in the visualization field and also the end user.",
      "gist": "The Visions Contest",
      "headline": "Most visualization contests are judged by domain experts rather than end users",
      "start": 2819108,
      "end": 3006880,
      "id": "ep_33_ch_15"
    },
    {
      "summary": "The challenge is keeping the community grow and active at the same time. The whole thing lives off the users, and you just sort of let people do it. The point of this is to be constructive. People really do want to help people figure out how to do a better job of presenting their data.",
      "gist": "Dataviz Community's Growth",
      "headline": "Keeping the Dataviz community grow and active at the same time is challenging",
      "start": 3006960,
      "end": 3078240,
      "id": "ep_33_ch_16"
    },
    {
      "summary": "Enrico: What should people check out? If they check out only one post, which one would it be? He says people could learn a lot by having more case studies. Enrico says the only way to go is to go for real visualization.",
      "gist": "What should people learn about visualization?",
      "headline": "Do you have, like, one favorite thread or like one favorite discussion",
      "start": 3078620,
      "end": 3357956,
      "id": "ep_33_ch_17"
    },
    {
      "summary": "John: The way you are organizing information right now, if I understand correctly, is by chart type and tool. As the site will be growing, you might want to switch to a modality where people can quickly focus on something or be guided through some kind of thread.",
      "gist": "How to organize the Viscom library?",
      "headline": "How do you expect people to consume the information that you're putting there",
      "start": 3358028,
      "end": 3526970,
      "id": "ep_33_ch_18"
    },
    {
      "summary": "John: I'm looking forward to more of your posts about teaching data visualization. I think it's not clear how to teach visualization, and it's a real challenge. Maybe we will call you back with some other people to have an episode only on teaching.",
      "gist": "Teaching Data Visualization",
      "headline": "John: I'm looking forward to more posts about teaching data visualization",
      "start": 3528470,
      "end": 3696112,
      "id": "ep_33_ch_19"
    }
  ],
  "disfluencies": false,
  "entity_detection": false,
  "sentiment_analysis": false,
  "sentiment_analysis_results": null,
  "entities": null,
  "speakers_expected": null,
  "summary": null,
  "custom_topics_results": null,
  "is_deleted": null,
  "episode_num": "33",
  "episode_metadata": {
    "speakers": [
      "Enrico Bertini",
      "Moritz Stefaner",
      "Jon Schwabish"
    ],
    "WPid": "159",
    "url": "https://datastori.es/podlove/file/334/s/feed/c/mp3/datastories-33.mp3",
    "episode_title": "HelpMeViz w/ Jon Schwabish"
  }
}