{
  "id": "1b6d1591-5724-40f8-a27c-6cbe2b14eedc",
  "language_model": "assemblyai_default",
  "acoustic_model": "assemblyai_default",
  "language_code": "en_us",
  "status": "completed",
  "audio_url": "https://datastori.es/podlove/file/166/s/feed/c/mp3/Datastories-15.mp3",
  "utterances": [
    {
      "end": 17470,
      "speaker": "Enrico Bertini",
      "start": 3080,
      "text": "I think we can start, right? Yeah. Hi, everyone. Data stories number 15. Enrico here and Moritz on the other side of the ocean. Hi, Moritz.",
      "id": "ep_15_ut_0"
    },
    {
      "end": 19294,
      "speaker": "Moritz Stefaner",
      "start": 17582,
      "text": "Hi, Enrico. How are you doing?",
      "id": "ep_15_ut_1"
    },
    {
      "end": 20822,
      "speaker": "Enrico Bertini",
      "start": 19414,
      "text": "Good, good. And you?",
      "id": "ep_15_ut_2"
    },
    {
      "end": 22566,
      "speaker": "Moritz Stefaner",
      "start": 20998,
      "text": "Good, can't complain.",
      "id": "ep_15_ut_3"
    },
    {
      "end": 28554,
      "speaker": "Enrico Bertini",
      "start": 22710,
      "text": "Yeah, we made it up to 15. It's crazy. I don't even remember what we did so far.",
      "id": "ep_15_ut_4"
    },
    {
      "end": 36932,
      "speaker": "Moritz Stefaner",
      "start": 29644,
      "text": "I think we did a lot. I just looked before we did our first episode mid February. So it's only ten.",
      "id": "ep_15_ut_5"
    },
    {
      "end": 44068,
      "speaker": "Enrico Bertini",
      "start": 36988,
      "text": "Oh, it's gonna be one year soon. Yeah, well, not so soon, but we're getting there.",
      "id": "ep_15_ut_6"
    },
    {
      "end": 45340,
      "speaker": "Moritz Stefaner",
      "start": 44196,
      "text": "Baby is growing up.",
      "id": "ep_15_ut_7"
    },
    {
      "end": 52304,
      "speaker": "Enrico Bertini",
      "start": 45412,
      "text": "Yes, growing up. Yeah. We should make a party, right? At some point. So what's up?",
      "id": "ep_15_ut_8"
    },
    {
      "end": 83754,
      "speaker": "Moritz Stefaner",
      "start": 53044,
      "text": "Yeah, just working. We finally launched the Spindy globe I have been talking about for half a year. So that was that FIFA project. So that's online. And just today I pushed out excellence mapping.net dot it quote s about comparing research institutions in different fields. So I was collaborating there with a statistician and somebody really into citation analysis and so we made a few world maps.",
      "id": "ep_15_ut_9"
    },
    {
      "end": 88504,
      "speaker": "Enrico Bertini",
      "start": 83914,
      "text": "Oh, I should play with this one. Do you have computer science there?",
      "id": "ep_15_ut_10"
    },
    {
      "end": 100756,
      "speaker": "Moritz Stefaner",
      "start": 88844,
      "text": "Yeah, but it's not so, you know, it always depends a lot on which data set you have access to for the publications. And it's not so much in computer science, but yeah, there's a bit.",
      "id": "ep_15_ut_11"
    },
    {
      "end": 105748,
      "speaker": "Enrico Bertini",
      "start": 100820,
      "text": "Yeah, well, you know, computer science is more anyway compared to.",
      "id": "ep_15_ut_12"
    },
    {
      "end": 119092,
      "speaker": "Moritz Stefaner",
      "start": 105796,
      "text": "It's a smaller field than you think. Exactly. If you look at biology or medicine, it's economics. Yeah, economics is not so big either. But yeah, the life sciences, they publish much more.",
      "id": "ep_15_ut_13"
    },
    {
      "end": 121144,
      "speaker": "Enrico Bertini",
      "start": 119268,
      "text": "Okay, good, good.",
      "id": "ep_15_ut_14"
    },
    {
      "end": 130364,
      "speaker": "Moritz Stefaner",
      "start": 121524,
      "text": "And how are you? How is New York? Are you like all like gangster now? Og Enrico. Original gangster style.",
      "id": "ep_15_ut_15"
    },
    {
      "end": 133436,
      "speaker": "Enrico Bertini",
      "start": 130444,
      "text": "Yeah. There are lots of Italians around here.",
      "id": "ep_15_ut_16"
    },
    {
      "end": 134860,
      "speaker": "Moritz Stefaner",
      "start": 133620,
      "text": "So you have your family?",
      "id": "ep_15_ut_17"
    },
    {
      "end": 180244,
      "speaker": "Enrico Bertini",
      "start": 134972,
      "text": "Yeah, yeah, yeah, yeah. Well, it's incredibly warm, actually. That's really surprising to me. And apart from that, well, it's been totally crazy so far. And I think last week has been the last. The first time I could actually see them, my office and say, what should I do next? Yeah, so it's been totally crazy for one month, one month and a half. And now it's getting better. Better. And I'm really excited. I think there are lots of people I would like to meet in the area. I already have some few contacts and a couple of weeks ago I attended a meetup on data visualization. I met some folks there. It's interesting. So I think there is a lot of potential and I'm really, really looking forward to see what can happen here.",
      "id": "ep_15_ut_18"
    },
    {
      "end": 182592,
      "speaker": "Moritz Stefaner",
      "start": 180354,
      "text": "Yeah, but you're just getting started, right?",
      "id": "ep_15_ut_19"
    },
    {
      "end": 207544,
      "speaker": "Enrico Bertini",
      "start": 182688,
      "text": "I'm just getting started. And of course here at the university there are lots of things to do, lots of things to set up. I don't even have my own computer right now and it's crazy, but I think it's normal. It takes a little time. It's okay. Sure. I think it's gonna be very good soon. Just. Just a matter of time. And I will be teaching information visualization next semester. That's a big thing.",
      "id": "ep_15_ut_20"
    },
    {
      "end": 208200,
      "speaker": "Moritz Stefaner",
      "start": 207664,
      "text": "Yeah.",
      "id": "ep_15_ut_21"
    },
    {
      "end": 212360,
      "speaker": "Enrico Bertini",
      "start": 208312,
      "text": "So I. Undergraduates or graduates? Sorry?",
      "id": "ep_15_ut_22"
    },
    {
      "end": 214408,
      "speaker": "Moritz Stefaner",
      "start": 212512,
      "text": "Undergraduates or graduates?",
      "id": "ep_15_ut_23"
    },
    {
      "end": 231792,
      "speaker": "Enrico Bertini",
      "start": 214496,
      "text": "It's actually both. Both. Yeah. Yeah, I think it's gonna be fun. Yeah. Lots of. Lots of things to do and. But it's good. It's good. And as I said, weather is good. And if the weather is good, I feel good and the rest is fine.",
      "id": "ep_15_ut_24"
    },
    {
      "end": 233124,
      "speaker": "Moritz Stefaner",
      "start": 231968,
      "text": "Exactly.",
      "id": "ep_15_ut_25"
    },
    {
      "end": 235436,
      "speaker": "Enrico Bertini",
      "start": 233304,
      "text": "How is it in Germany snowing since.",
      "id": "ep_15_ut_26"
    },
    {
      "end": 238868,
      "speaker": "Moritz Stefaner",
      "start": 235500,
      "text": "Oh yeah, we had first snow on. On Sunday.",
      "id": "ep_15_ut_27"
    },
    {
      "end": 240668,
      "speaker": "Enrico Bertini",
      "start": 239036,
      "text": "On Sunday for the first time.",
      "id": "ep_15_ut_28"
    },
    {
      "end": 243572,
      "speaker": "Moritz Stefaner",
      "start": 240796,
      "text": "First snow. That was nice. And now it's all wet.",
      "id": "ep_15_ut_29"
    },
    {
      "end": 246356,
      "speaker": "Enrico Bertini",
      "start": 243628,
      "text": "Yeah, I think I saw a picture from, from Facebook.",
      "id": "ep_15_ut_30"
    },
    {
      "end": 257460,
      "speaker": "Moritz Stefaner",
      "start": 246500,
      "text": "Yeah. Yeah, it was like for half an hour it was there, but it was nice. Yeah, it was, yeah. Now it's officially winter, I guess when. When the first snow comes.",
      "id": "ep_15_ut_31"
    },
    {
      "end": 258108,
      "speaker": "Enrico Bertini",
      "start": 257612,
      "text": "Yeah.",
      "id": "ep_15_ut_32"
    },
    {
      "end": 258864,
      "speaker": "Moritz Stefaner",
      "start": 258196,
      "text": "Yeah.",
      "id": "ep_15_ut_33"
    },
    {
      "end": 268674,
      "speaker": "Enrico Bertini",
      "start": 259194,
      "text": "Anyway, I think we are digressing a bit. And we have a special, special guest here today. We have Robert Kosara. Hi, Robert.",
      "id": "ep_15_ut_34"
    },
    {
      "end": 270778,
      "speaker": "Robert Kosara",
      "start": 268714,
      "text": "Hello. Hi, Enrico. Hey, Mark.",
      "id": "ep_15_ut_35"
    },
    {
      "end": 271546,
      "speaker": "Enrico Bertini",
      "start": 270826,
      "text": "Hi, how are you?",
      "id": "ep_15_ut_36"
    },
    {
      "end": 272418,
      "speaker": "Moritz Stefaner",
      "start": 271570,
      "text": "Hey, Robert.",
      "id": "ep_15_ut_37"
    },
    {
      "end": 297008,
      "speaker": "Enrico Bertini",
      "start": 272586,
      "text": "Do we need to introduce Robert? I mean, maybe not. So how do we introduce Robert? So a lot of people know him because he has one of the most famous, or maybe the most famous blog on visualization on the web. And he was a professor until a few what? Weeks. Months ago, Robert.",
      "id": "ep_15_ut_38"
    },
    {
      "end": 299312,
      "speaker": "Robert Kosara",
      "start": 297136,
      "text": "Months ago, yeah, until mid September.",
      "id": "ep_15_ut_39"
    },
    {
      "end": 307684,
      "speaker": "Enrico Bertini",
      "start": 299408,
      "text": "Until mid September. And now he's at Tableau software. So lots of things you wear lots of hats, Robert, right.",
      "id": "ep_15_ut_40"
    },
    {
      "end": 310724,
      "speaker": "Robert Kosara",
      "start": 309424,
      "text": "Always have. Actually.",
      "id": "ep_15_ut_41"
    },
    {
      "end": 313564,
      "speaker": "Enrico Bertini",
      "start": 312064,
      "text": "It's good. How is it going?",
      "id": "ep_15_ut_42"
    },
    {
      "end": 335542,
      "speaker": "Robert Kosara",
      "start": 314064,
      "text": "It's great. Yeah, it's a lot of fun. And so far I'm very, very happy with my decisions. Yeah, it's working out great. I'm not sure if my blog is really the most famous, but it's certainly well known in the field, in academics tend to read it and a lot of people outside as well, so that's nice.",
      "id": "ep_15_ut_43"
    },
    {
      "end": 336474,
      "speaker": "Enrico Bertini",
      "start": 335718,
      "text": "Yeah.",
      "id": "ep_15_ut_44"
    },
    {
      "end": 342182,
      "speaker": "Moritz Stefaner",
      "start": 336894,
      "text": "And you've been around for a long time with the blog, so I remember it must be five or six years, right?",
      "id": "ep_15_ut_45"
    },
    {
      "end": 349542,
      "speaker": "Robert Kosara",
      "start": 342318,
      "text": "Yeah, I think it's six years now. Yeah, it's in the 6th year. I think actually that's where we are.",
      "id": "ep_15_ut_46"
    },
    {
      "end": 360326,
      "speaker": "Enrico Bertini",
      "start": 349718,
      "text": "I think what I know for sure that if it weren't for Robert's blog. I would never start a blog. So you've been there for quite some time, right?",
      "id": "ep_15_ut_47"
    },
    {
      "end": 408648,
      "speaker": "Robert Kosara",
      "start": 360430,
      "text": "Well, I'm trying to get more people to start blogging because I think it's important to get more of our work out and for people to see. People don't like it when I say see more of the really good visualization work, but it's true. I mean, there's so much stuff out there that's just pretty pictures and those get a lot of eyeballs. But I think there is a lot more to be said about understanding how the visualization works and critiquing what works, what doesn't work, and talking about the background. Why do you do certain things? Why do certain color schemes work or don't work? Or why is three d a good idea or a bad idea? And so there's a lot more depth that I hope I can bring, certainly, to this discussion. And I'm thinking that more people could add more to that if you could get more people to blog.",
      "id": "ep_15_ut_48"
    },
    {
      "end": 440444,
      "speaker": "Enrico Bertini",
      "start": 408796,
      "text": "Yeah, I think that's still very much needed. I mean, having more people blogging, doing this kind of blogging, I think is super, super useful. And unfortunately, I see more, more and more people doing this kind of showcase kind of blogs, which is good to some extent, but I mean, I think it's a lot harder to find a niche or to compete with flowing data or info statics in this area rather than trying to say something new or different. Right?",
      "id": "ep_15_ut_49"
    },
    {
      "end": 497794,
      "speaker": "Robert Kosara",
      "start": 441554,
      "text": "Yeah, I'm not so sure. I mean, I actually think it's fairly easy to do this because exactly what you're saying. There are so many people who just repost what's done somewhere else and without really a whole lot of reflection and discussion. And if you go in and you expect to have a million readers in a year, you're not going to get there. But you have to be in there for years and you get people to read it and they will appreciate it. And a lot of people actually appreciate more depth and more, more reflection because they want to learn more. And there isn't a whole lot of information out there about visualization. That's actually really good. And so that's why. And with good, I mean, that takes you a bit further than just a few examples and being able to click on things. So people appreciate that. And I think, yeah, so anyway, I think there's certainly a lot of room for that. Which of course, reminds me, how's your blog doing in Ricoh?",
      "id": "ep_15_ut_50"
    },
    {
      "end": 503934,
      "speaker": "Enrico Bertini",
      "start": 501074,
      "text": "That's the episode about Robert Kosara, right.",
      "id": "ep_15_ut_51"
    },
    {
      "end": 506174,
      "speaker": "Moritz Stefaner",
      "start": 504394,
      "text": "It's alive and kicking?",
      "id": "ep_15_ut_52"
    },
    {
      "end": 514290,
      "speaker": "Enrico Bertini",
      "start": 507834,
      "text": "No, I have some plans, but I don't want to say anything and I don't want to promise anything. I have some plans, I have some.",
      "id": "ep_15_ut_53"
    },
    {
      "end": 522026,
      "speaker": "Moritz Stefaner",
      "start": 514322,
      "text": "Ideas, but the thing is, data stories is so good. You don't need a blog anymore. That's the only answer to that.",
      "id": "ep_15_ut_54"
    },
    {
      "end": 563726,
      "speaker": "Enrico Bertini",
      "start": 522210,
      "text": "I have to confess that at some point I was thinking, or maybe I'm still thinking, should I. Should I keep doing it or not? I mean, I want to make sure that if I keep doing it, it's really worth it for me and for the readers. That's the point that so far I haven't been able to add stuff that I would be proud of. I think mostly because I've been super, super, super busy with the moving, but also because I felt completely, completely, I don't know, empty in one way or another. And so I actually really much prefer to don't write anything rather than writing something that is not good enough. But. Yeah, yeah.",
      "id": "ep_15_ut_55"
    },
    {
      "end": 570670,
      "speaker": "Moritz Stefaner",
      "start": 563750,
      "text": "But it's interesting because you had some really nice momentum going on. And also this, the dialogue with, with the audience worked really well, I think.",
      "id": "ep_15_ut_56"
    },
    {
      "end": 575554,
      "speaker": "Enrico Bertini",
      "start": 570742,
      "text": "Yeah, yeah, yeah, yeah. Sure. I know the problem at some point then. Sure.",
      "id": "ep_15_ut_57"
    },
    {
      "end": 578266,
      "speaker": "Moritz Stefaner",
      "start": 576054,
      "text": "It sort of. Yeah, you sort of worked.",
      "id": "ep_15_ut_58"
    },
    {
      "end": 579034,
      "speaker": "Robert Kosara",
      "start": 578390,
      "text": "Sure.",
      "id": "ep_15_ut_59"
    },
    {
      "end": 583734,
      "speaker": "Enrico Bertini",
      "start": 579194,
      "text": "Well, let's go back to Robert, much more interesting.",
      "id": "ep_15_ut_60"
    },
    {
      "end": 601602,
      "speaker": "Moritz Stefaner",
      "start": 584514,
      "text": "I think we should talk about the research background a bit, because I think that that's something that not everybody might be so familiar with. But I think it would be really interesting, Robert, if you could briefly tell us a bit about the main research themes you have been looking into. Sure.",
      "id": "ep_15_ut_61"
    },
    {
      "end": 727348,
      "speaker": "Robert Kosara",
      "start": 601738,
      "text": "So, yeah, I'm going to give you a brief, kind of an overview of a number of different things I've done, and I'm trying to. That's what I was seeing earlier. I've always tried to wear different hats. I like to do different things. And so some of the work that I've done has been more on the theoretical side. So we've been doing some work that's actually the more recent work with Caroline Simkiewicz on the visual metaphors and the perception and kind of the cognitive side of visualization, and how different visual metaphors and how different visual structures change the way we understand data, and how asking a question where the linguistic metaphor is compatible and not compatible with the visual metaphor actually changes how well you can respond to the question, how fast you are and how accurate and so on. That's had been more on the theory side. We've also done some more practical work, like the parallel sets program, which is a technique that I developed with a student and Helvig Hauser in 2005 or so for showing categorical data, because there really are very few techniques that work well for that kind of data. And so that's one of them. I think that works very well and it's fairly interactive. And I also tried to push that as an actual application, though I haven't really worked on that in a while. And so I like obviously also the practical side of things. And then I did some work in a long time ago for my PhD thesis on blur and sharpness to guide people's attention. Originally I wanted to make it into an actual visualization dimension, into a retinal variable, but that didn't quite work out because it turns out that blur is basically binary, so things are either in focus or out of focus. It's very hard for us to tell how much out of focus they are. And people also don't like looking at blur. So if you show people things that are more or less blurry, they really start hitting you for that. So that was interesting, actually, we found that in our studies. We didn't really, or I didn't quite expect that.",
      "id": "ep_15_ut_62"
    },
    {
      "end": 733064,
      "speaker": "Moritz Stefaner",
      "start": 727436,
      "text": "It's also good if you want to, you know, you want to distract a bit from the actual numbers, you make a graphic.",
      "id": "ep_15_ut_63"
    },
    {
      "end": 793202,
      "speaker": "Robert Kosara",
      "start": 734364,
      "text": "That's true. Well, and then we've done some work. A completely different type of work, again, is on privacy in visualization. So with Aritra Descubta, we tried to figure out how we can do privacy preserving data visualization differently than by just running the usual data cleansing algorithms over the data and then visualizing that, because that ends up being pretty useless because you basically destroy all the structure in the data that's of any interest. And we've done some early work on that, but there's certainly a lot more that can be done there. And so I'm trying to span this gamut of from theory to practical things, from perception to modeling and so on, because I think it's all important. There's a lot of work that needs to be done there, and it's kind of nice to have different things to work on and just pursuing different ideas.",
      "id": "ep_15_ut_64"
    },
    {
      "end": 807374,
      "speaker": "Moritz Stefaner",
      "start": 793338,
      "text": "Yeah, and I think that's great. Enrico, do you know any other researcher who had such a broad portfolio in info? I couldn't think of anyone. I think that's really. Yeah, you know, a few.",
      "id": "ep_15_ut_65"
    },
    {
      "end": 832552,
      "speaker": "Enrico Bertini",
      "start": 807904,
      "text": "Well, actually, I think it's not too rare in infovis to have such a broad set of. I mean, of course you can find those researchers who always do the same thing for ages, but. But I think there is a broad set of people in our community who really like to do a lot of different stuff, and I think this is due to the interdisciplinary nature of the field itself, probably.",
      "id": "ep_15_ut_66"
    },
    {
      "end": 842046,
      "speaker": "Moritz Stefaner",
      "start": 832608,
      "text": "Yeah. And often you solve maybe an algorithm problem, but along the way, you run into perceptual issues or. Yeah. And so you. Naturally, you come from one thing to the other.",
      "id": "ep_15_ut_67"
    },
    {
      "end": 856314,
      "speaker": "Enrico Bertini",
      "start": 842070,
      "text": "You have people who can easily jump from core computer science to more artistic endeavors or more analyzing the human side of it. I think it's pretty broad, so.",
      "id": "ep_15_ut_68"
    },
    {
      "end": 859094,
      "speaker": "Moritz Stefaner",
      "start": 856614,
      "text": "Yeah, but still, I think Robert is especially broad.",
      "id": "ep_15_ut_69"
    },
    {
      "end": 878226,
      "speaker": "Enrico Bertini",
      "start": 859214,
      "text": "Yeah. But I actually wanted to take the chance to. To ask to Robert something I never had the chance to ask him. How did you actually start into infovis? How did you get in touch with this field originally? I think your background is computer science, right?",
      "id": "ep_15_ut_70"
    },
    {
      "end": 879614,
      "speaker": "Robert Kosara",
      "start": 878370,
      "text": "Yeah. Okay.",
      "id": "ep_15_ut_71"
    },
    {
      "end": 881466,
      "speaker": "Enrico Bertini",
      "start": 881154,
      "text": "Yeah.",
      "id": "ep_15_ut_72"
    },
    {
      "end": 1049473,
      "speaker": "Robert Kosara",
      "start": 881490,
      "text": "It's a long story. I'm trying to make it short, but the way I got into this was. So I had studied, or I was still studying computer science. I was doing my masters in Vienna, and I had always been interested in graphics or in graphical things, in creating images, also photography and things like that. So I've got a. I'm really more on the visual side of things than the algorithmic side, for example. And I also, at some point, actually, along the way, I had gotten bored with computer science and had studied medicine for two years. Medicine, which I then. Which I then gave up again, because it just ended up being a bit more work than I thought it would be. But I was like. I was actually, at some point, I was thinking I could try and do both, but. Yeah, not quite, but anyway, because I was looking for applications, I wanted to do things that actually made a difference. And I thought bringing computer science into medicine would be a really good idea. And it turned out other people had had that idea before me. And so there were some projects going on at the university, at Vienna, University of Technology, especially in the Sylvia mix group, that were. Where she was dealing with therapy planning in medicine. So, basically, the idea of modeling very complex kinds of therapies, like for cancer or for diabetes and other things, and recording those in a way that would then guide the physician or the nurses through the whole process. And for some things, like for cancer, that can be very, very precise, you have to administer certain drugs at certain times, and it's very, very crucial it's done at. At those particular times, and that you monitor all the different signs, whether there is an adverse reaction or not, and so on. There's a lot of information. And so at some point, we got talking, and I started working on what you might call a visualization, but more of like a user interface, essentially, to create these treatment plans, because the way they were written were in language that was a bit like Lisp. So it was lots of parentheses and lots of keywords and stuff, and no physician would be able to write that. And so I wrote this little application that lets you basically create the structure of these plans visually by having little metaphors and being able to put them together and change them and rename them and so on, and defining different conditions. And that's really how I got into this. And it wasn't really a visualization at this point. It was more really a user interface. But that's when I started looking into, you know, that field, into reading books, Tufte and others, and reading papers and stuff, to really understand what's going on there. And that's then how I kind of got into the actual data visualization side as well.",
      "id": "ep_15_ut_73"
    },
    {
      "end": 1051965,
      "speaker": "Moritz Stefaner",
      "start": 1051333,
      "text": "Cool.",
      "id": "ep_15_ut_74"
    },
    {
      "end": 1058597,
      "speaker": "Enrico Bertini",
      "start": 1052069,
      "text": "Cool. And then you did what? And this was at the time of your master or thesis or this was.",
      "id": "ep_15_ut_75"
    },
    {
      "end": 1059525,
      "speaker": "Robert Kosara",
      "start": 1058605,
      "text": "Still a master's thesis.",
      "id": "ep_15_ut_76"
    },
    {
      "end": 1060285,
      "speaker": "Enrico Bertini",
      "start": 1059589,
      "text": "Master thesis.",
      "id": "ep_15_ut_77"
    },
    {
      "end": 1140874,
      "speaker": "Robert Kosara",
      "start": 1060349,
      "text": "And then from a PhD, I was working in that same project on a variety of different things, but my actual Research topic was blur. I called this semantic depth of field. So the idea was to take the idea of depth of field from photography, where you can focus on one object or one person, for example, and then blur the rest so that you can guide the person's attention to that thing or that person. So it's clear that the viewer's attention, I mean, so it's clear what the subject is in the picture, and to use it in a way that's not tied to physical distance, but to semantics. So if I want you to look at a certain part of a visualization, of a chart or of any kind of image, I can just blur the rest, which is now a bit more common to do. There's this thing that's called tilt shift, which isn't really the same thing, but people do all these little apps that can blur part of the image, and then those become kind of the background, and the in focus parts become the foreground, the important part. That was basically the idea, but doing that based on what you wanted the user to look at. So maybe you had a certain thing that stood out, or you were doing a search, for example, and the search result would be highlighted by blurring everything else, and the thing that you had found would be in focus.",
      "id": "ep_15_ut_78"
    },
    {
      "end": 1149124,
      "speaker": "Enrico Bertini",
      "start": 1141974,
      "text": "Okay, and when was the time when you actually decided to open eager eyes? That was much later, right?",
      "id": "ep_15_ut_79"
    },
    {
      "end": 1175604,
      "speaker": "Robert Kosara",
      "start": 1149254,
      "text": "Yeah, that was later. So I would, I think I actually got the domain, I think, in 2004 even, or 2005, and I kind of tinkered around for a long time with my own content management system and just doing lots of stupid things. And then I ended up settling on an actual, you know, something that actually worked really random. So I decided in 2006, I think that actually was well in the making.",
      "id": "ep_15_ut_80"
    },
    {
      "end": 1196684,
      "speaker": "Enrico Bertini",
      "start": 1177884,
      "text": "Yeah. I was curious to hear, how did you come with the idea, come up with the idea of opening a blog and about visualization. And I think, I guess I'm almost sure that the idea you had originally then turned into different kind of formats and other ideas.",
      "id": "ep_15_ut_81"
    },
    {
      "end": 1293160,
      "speaker": "Robert Kosara",
      "start": 1196764,
      "text": "Oh, yeah. Now my original idea actually was I wanted to do something that was like many eyes, and this was before, long before many eyes actually started. I wanted to basically build something where people could, because I saw that there weren't really many good tools out there to visualize your data. So I figured why not build some kind of website where you could upload your data and then build a couple of visualization techniques and have people play around with them just to get a sense of what they'd be like. I didn't really think about the whole social aspect or anything, but that was the idea. And then write articles about that. So basically you have the techniques there and the tools and the writing about. So you, you could go between them, you could see a pie chart, for example, and then there could be articles about pie charts. And then when you're in the pie chart article, you could go back and see actual examples and play with them. That was the original idea, actually. But over time I figured that this was just way too much work. So I ended up creating, turning it into a blog and just basically keeping the article side of it. And that's also why it took so long to actually get started, was because I had this idea of making it basically like a wiki. So I would write something, and then if you didn't agree with me, you could then go in and basically write a criticism and write your own posting on the same site. And then there would be links between them and stuff. But that also didn't work out because I ended up not building my crazy scheme for a content management system myself, but just settled on something that was ready.",
      "id": "ep_15_ut_82"
    },
    {
      "end": 1296914,
      "speaker": "Enrico Bertini",
      "start": 1293192,
      "text": "Yeah, and you could spend ages doing this kind of stuff right away.",
      "id": "ep_15_ut_83"
    },
    {
      "end": 1311694,
      "speaker": "Robert Kosara",
      "start": 1296954,
      "text": "And at the end you give every single one that existed out there at that time, every last one. It was just such a waste of time. That's why I tell people not to do that now, because don't make the same mistakes.",
      "id": "ep_15_ut_84"
    },
    {
      "end": 1313938,
      "speaker": "Moritz Stefaner",
      "start": 1312594,
      "text": "Just make a normal blog.",
      "id": "ep_15_ut_85"
    },
    {
      "end": 1314866,
      "speaker": "Enrico Bertini",
      "start": 1313986,
      "text": "Start writing.",
      "id": "ep_15_ut_86"
    },
    {
      "end": 1315474,
      "speaker": "Robert Kosara",
      "start": 1315010,
      "text": "Exactly.",
      "id": "ep_15_ut_87"
    },
    {
      "end": 1318774,
      "speaker": "Enrico Bertini",
      "start": 1315514,
      "text": "That's the best way. Just start writing.",
      "id": "ep_15_ut_88"
    },
    {
      "end": 1345920,
      "speaker": "Moritz Stefaner",
      "start": 1320594,
      "text": "I also remember the blog from these early days, I must say. And for me, it was quite fascinating to read about the reason. But I also have to say I was a bit scared of you because you were always so harsh and I was always hoping he wouldn't pick up on me, destroy my work. You had strong positions at that time. I mean, I think that's.",
      "id": "ep_15_ut_89"
    },
    {
      "end": 1387194,
      "speaker": "Robert Kosara",
      "start": 1345992,
      "text": "Well, I think I still have them. I think it's important to have a point to make because if we're all nice and we all link to each other, that's great. But if we can't discuss things, if you all agree on everything, then there's nothing to talk about. So there needs to be. And I certainly have different ideas than other people. And so that's the whole point of having my blog and not just having other people write for me, basically. I mean, or write stuff that I just agree with. But because there are other things that are there things that I think should be done differently and that I think are stupid and need to be criticized. That's why I write. That's a big part of what I'm doing. And, yeah, I can. I can see your point.",
      "id": "ep_15_ut_90"
    },
    {
      "end": 1398434,
      "speaker": "Moritz Stefaner",
      "start": 1388974,
      "text": "Sometimes I just kind of understand which side are you on and, you know, to fight data art and it's not good for anybody.",
      "id": "ep_15_ut_91"
    },
    {
      "end": 1400118,
      "speaker": "Robert Kosara",
      "start": 1399014,
      "text": "No, but. Right, but that's.",
      "id": "ep_15_ut_92"
    },
    {
      "end": 1413834,
      "speaker": "Moritz Stefaner",
      "start": 1400166,
      "text": "But I think you're right. I mean, it sort of propelled a certain discussion that wouldn't have happened otherwise. And I think in the end, we all have sort of a bit more differentiated view on all these fields. But it was good to just.",
      "id": "ep_15_ut_93"
    },
    {
      "end": 1415094,
      "speaker": "Robert Kosara",
      "start": 1414694,
      "text": "Yeah.",
      "id": "ep_15_ut_94"
    },
    {
      "end": 1428806,
      "speaker": "Moritz Stefaner",
      "start": 1415134,
      "text": "To define the different views you can have on infowars and the different genres there are and the sub genres and so on, instead of just saying it's all data, visualization isn't that great. So I can relate to that. Yeah, yeah.",
      "id": "ep_15_ut_95"
    },
    {
      "end": 1500966,
      "speaker": "Enrico Bertini",
      "start": 1428990,
      "text": "I think from this point of view, we all. I feel like we all evolved a lot in this kind of understanding how different. How visualization can serve completely different purposes. And we are much more open than before. At least that's my feeling. I don't know if you feel the same way. Yeah, I don't know, but I remember myself trying to. I think what Robert said is important. I think it's true that it's really important to find the right voice when you write and trying to be yourself. But at the same time, I have seen people doing the opposite actually being. Being critical for the sake of it. And that's bad, too, right? I mean, that's very dangerous as well. So I've been people fighting, fighting on very fine points and details that in the end, don't even matter. So it's. I think it's not easy to find the right balance between the two things. I mean, between having your own voice, but at the same time, not being overly critical for the sake of it. Right, right.",
      "id": "ep_15_ut_96"
    },
    {
      "end": 1621296,
      "speaker": "Robert Kosara",
      "start": 1500990,
      "text": "But I think that's actually the same thing. So I see what you mean about. And certainly, I probably should go back to some early stuff and really get a better sense of how angry I sounded, but I would certainly get worked up over things that I just thought were wrong. And so I felt like, you know, this comic, this XKCD comic, there's somebody wrong on the Internet, and you have to do something about it. That's really, that was a big part of the motivation. I mean, somebody has to do something about it. And so that's where this came from. But in a more civilized way, of course. Finding your voice is really important, as you're saying, Enrico, I totally agree. And I think a big part of that is because you're looking for what is it that you care about. I don't think that that's compatible at all with just being angry and just being against other people's stuff. I mean, that's how I don't think anybody works that way. So you have to understand where you are and where the other people are and what the differences are. And, of course, you can try. And, you know, as Moritz was saying, kind of, let let's all be friends and let's just keep everything under one big, you know, roof. But that's not always that helpful because it doesn't help you understand how things actually work. And so drawing lines between different ideas and different ways of doing things is very important. And it doesn't mean that we have to hate each other between the two sides of each of those lines, but simply that we understand why those are different and what the differences are, and we can start playing with those, because once you understand those differences, you can start looking at, okay, now, what does this mean? How can we find new ideas that we can take from this point and from that area and then combine those in new ways? So I think it's actually really helpful to do that. But first, you have to understand the breakdown, how the different fields differ and how different people's work differs. And so I'm hoping to help do some of that, at least I do.",
      "id": "ep_15_ut_97"
    },
    {
      "end": 1622924,
      "speaker": "Moritz Stefaner",
      "start": 1621320,
      "text": "Think it was helpful in the end.",
      "id": "ep_15_ut_98"
    },
    {
      "end": 1634880,
      "speaker": "Enrico Bertini",
      "start": 1626344,
      "text": "So you've been riding eager eyes for how many years now? Like kind of five years? Five, six.",
      "id": "ep_15_ut_99"
    },
    {
      "end": 1636170,
      "speaker": "Robert Kosara",
      "start": 1634952,
      "text": "Five or six years.",
      "id": "ep_15_ut_100"
    },
    {
      "end": 1655982,
      "speaker": "Enrico Bertini",
      "start": 1636312,
      "text": "So how do you see eager eyes evolving in the future? I guess it evolved already a lot. Right. As you are saying, starting from the very beginning, you had a completely different idea, and then it evolved in many different ways. So how do you see the future of eager eyes? I know that's hard to answer.",
      "id": "ep_15_ut_101"
    },
    {
      "end": 1806744,
      "speaker": "Robert Kosara",
      "start": 1656118,
      "text": "Yeah, it's not something I really thought about all that much recently. What I tried to do this year is just to block more. And actually I started that last year, I think is to be more consistent with my posting and really try to write one every week. And right now I actually write them, usually on a Sunday and then post them Sunday night, my time. And so that's helpful. And I have a long list of things I want to write, and I just kind of go into that and keep reordering stuff and then just kind of be more methodical about it, which I think is really important. So if you have just have a schedule, I think it's really important because then you just keep doing stuff, even if not everything is great. So as you were saying earlier, if you don't feel like writing, and sometimes some of my postings I really hate because it was just painful writing them, even if they're just like two or three paragraphs, but I just wanted to get something out. And sometimes those turned out to be not for me, but other people like them. And so I get people to say, well, okay, this was interesting, or no, you're wrong, whatever, but I get a response. And so being consistent is good. The other thing, of course, is that I'm posting bigger things and smaller things. And that was another thing. And that's why I keep saying it's not actually a blog, it's more of a website. It's because I don't just like blogging small things that live for a day or two and then they're no longer interesting. But I'm also writing these technique postings and stuff where I'm trying to talk about things that I hope people will find useful and will find by googling for. I just wrote one on affordances, so if somebody googles for affordances, maybe they'll find my posting and find that useful because it talks about something that maybe others don't talk about. So it becomes more of a resource. And so I haven't really figured out yet how those fit together, how the blogging part and the current thing, I mean, there is a blogging or a blog category, but I don't think anybody uses those categories. So it just looks like one big stream of stuff. So I might try to get back to that point where I had, where the site layout also is a bit more structured that way. So there is kind of the stream, the blog, and then there are the categories for the different other things, which the site structure kind of does right now, but it's not very obvious because there are these categories that I'm using, like criticism and theory and techniques and a few others, but they're all basically just part of the URL right now. But yeah, so that's one of the things I want to maybe do more and.",
      "id": "ep_15_ut_102"
    },
    {
      "end": 1809192,
      "speaker": "Enrico Bertini",
      "start": 1808424,
      "text": "Yeah, yeah.",
      "id": "ep_15_ut_103"
    },
    {
      "end": 1860154,
      "speaker": "Robert Kosara",
      "start": 1809208,
      "text": "And just keep going. I mean, that's the thing. I mean, the big thing about a blog is you need to keep it up. And I think that's really, really important and just kind of keep talking about things that I think are important and just keeping that voice out there, because maybe I can get more people to disagree with me and then start their own things and that's going to be helpful. And maybe we'll get to the point that I was hoping to get started a few years ago, where there are a dozen blogs like mine out there, which would be awesome, and not just out there, but actually alive, and people posting at least once a month and doing that for years because there are people out there. There are blogs out there, Ricoh, of course, and others, but many of them are mostly abandoned. And that's really too bad. And of course, I'm talking about visualization blogs here. There are obviously tons and tons of blogs out there, but with blogs there aren't that many.",
      "id": "ep_15_ut_104"
    },
    {
      "end": 1882794,
      "speaker": "Enrico Bertini",
      "start": 1860494,
      "text": "Yeah. So how do we convince more people writing good visualization blocks, which, and by the way, I think there are many other formats that people could explore and never did. Actually, that's another thing that there are. So if you think about the old set of visualization blocks, there are basically two or maybe three kind of formats, and I think there are many, many more that people could explore and never did.",
      "id": "ep_15_ut_105"
    },
    {
      "end": 1917664,
      "speaker": "Moritz Stefaner",
      "start": 1884134,
      "text": "And also, I actually think these typical, I just linked to project blocks, they pretty much migrated to Tumblr and to Pinterest, which I think. Yeah, exactly, because these are services, they are really focused on that. They also help you. I mean, Tumblr doesn't help you with the archiving, but Pinterest has all these nice overviews and the boards, so it's pretty good for visual bookmarking. And so I think that that opens space again and sharing and repinning and so on. But I think that opens space, again for the blogging world to be more focused on writing and editing.",
      "id": "ep_15_ut_106"
    },
    {
      "end": 1946298,
      "speaker": "Robert Kosara",
      "start": 1917984,
      "text": "Right, exactly. Yeah. That's the great thing, actually, about Tumblr, because you can mix the different types. You can have picture postings, you can have text postings, and so you can just point to, and you have links as an actual type of posting, which I think is a really awesome idea. And so you just link to a couple of things, and then you write your own thought, and then you have another image or whatever. So you can mix the different types very nicely. And it's just very easy to get started. And it takes like a minute, literally a minute to get started.",
      "id": "ep_15_ut_107"
    },
    {
      "end": 1964466,
      "speaker": "Moritz Stefaner",
      "start": 1946466,
      "text": "And that also takes the whole problem away, basically, because in a tumblr, it's clear what the gesture is. It's just a quick repost or a quick bookmark, and then it's fine. But I mean, you're right, it's not so much happening in the area. I mean, we have the y axis, of course.",
      "id": "ep_15_ut_108"
    },
    {
      "end": 1965690,
      "speaker": "Robert Kosara",
      "start": 1964650,
      "text": "Right. That's really good.",
      "id": "ep_15_ut_109"
    },
    {
      "end": 1967018,
      "speaker": "Moritz Stefaner",
      "start": 1965722,
      "text": "Yeah. You know? Yeah.",
      "id": "ep_15_ut_110"
    },
    {
      "end": 1967754,
      "speaker": "Robert Kosara",
      "start": 1967186,
      "text": "And there are.",
      "id": "ep_15_ut_111"
    },
    {
      "end": 1980866,
      "speaker": "Moritz Stefaner",
      "start": 1967794,
      "text": "We could have him on the shows. Yeah, yeah. And. But, yeah, it's basically the ones that have been around a few years already. They're still around and not much new stuff happening. Yeah, yeah.",
      "id": "ep_15_ut_112"
    },
    {
      "end": 1986842,
      "speaker": "Enrico Bertini",
      "start": 1980930,
      "text": "And I think Stephen Thew is still kind of, from time to time, blogging something. Right.",
      "id": "ep_15_ut_113"
    },
    {
      "end": 2002886,
      "speaker": "Moritz Stefaner",
      "start": 1986978,
      "text": "I think he's also bored of his own stuff, but he's definitely, like, reduced the friction of it. Can I ask both of you how you think blogging has helped or hindered your academic career? Because I think that's a really interesting.",
      "id": "ep_15_ut_114"
    },
    {
      "end": 2004542,
      "speaker": "Enrico Bertini",
      "start": 2002910,
      "text": "Oh, that's. That's a huge topic.",
      "id": "ep_15_ut_115"
    },
    {
      "end": 2008870,
      "speaker": "Moritz Stefaner",
      "start": 2004598,
      "text": "Yeah. Is it like, overall beneficial or not so much so.",
      "id": "ep_15_ut_116"
    },
    {
      "end": 2122174,
      "speaker": "Robert Kosara",
      "start": 2008942,
      "text": "Well, I can tell you about me. It's been great because a lot more people know who I am, so they end up checking out my work because that's also what I'm doing. You know, what I use my blog for is to post about my papers. And so a lot of people see that, and so I get more people to, to read my papers than maybe otherwise would because it would just be hidden in the other stuff that's coming out. And I actually, in my tenure case, my blog was a big part. So I talked about how I'm reaching people and how making connections, and I was able to get a lot of interesting people to write letters for me because they know me through my blog. So it's been very helpful for me. Of course, it depends very much on where you are. Some schools and some universities think it's all a waste of time. So you have to figure out what the other people think because they make the ultimate decision. But at UNC Charlotte and in the computer science department there, people were very open to this and they really thought this was a good thing. And also the people who wrote my letters actually apparently mentioned those, mentioned my blog as well. So if you have the combination of you yourself making the case, people thinking it's a good thing or at least not being against it, and then having your references just be positive about it and mentioning it, I think is very strong, and then you're going to get a good feedback loop in there and people will buy it and it will help you. So that's my story. Of course, this is also very different in different departments. I don't want to make this sound like it's going to be the same for everybody, but at least for getting your name out, I think there's probably no better way of doing it if you're doing it right. But also just in terms of that whole thing about external service and outreach and stuff like that, again, if people aren't against it, it's the best way of reaching lots and lots of people that you would never reach otherwise.",
      "id": "ep_15_ut_117"
    },
    {
      "end": 2138374,
      "speaker": "Moritz Stefaner",
      "start": 2122474,
      "text": "Yeah. And did nobody maybe think that you're throwing out ideas too easily or being too, let's say, too loose or too casual in the discussion? Because that's sort of my image that maybe it's not expected of a scientist to.",
      "id": "ep_15_ut_118"
    },
    {
      "end": 2186592,
      "speaker": "Robert Kosara",
      "start": 2138754,
      "text": "No, but actually that's a really good point because I think that's a big misconception, the way science used to work. And maybe I have a bit of a naive picture here, but there used to be a lot more exchange between scientists. I mean, actual direct exchange letters being written and actual, you know, disputes where they would get up on stage and they would argue and then people would watch that. And so this is actually a really useful way of doing science or doing whatever we're doing, which is probably not a science, but it's, you know, it's something that's kind of similar. And so the. I think this is pretty very helpful. And for me, I don't feel like, you know, every tiny little idea that I have have to protect forever because if I, if I tell it to anybody, it's going to be gone and I won't have another idea.",
      "id": "ep_15_ut_119"
    },
    {
      "end": 2188200,
      "speaker": "Moritz Stefaner",
      "start": 2186648,
      "text": "You will never have an idea again.",
      "id": "ep_15_ut_120"
    },
    {
      "end": 2232364,
      "speaker": "Robert Kosara",
      "start": 2188312,
      "text": "Yeah. Right. I mean, I don't know why people think that. It's just, you know, and other people can't really pick those things up. That easily. And also the other thing is, of course, that I'm not all that obvious in what I'm writing about. So I'm writing about like the affordances example. So I actually did some research on affordances earlier this year, and I'm not going to tell you what it's actually for, but I did that research. I can tell you that without giving anything away. And so now I wrote something about affordances and maybe I'll write something about color next because maybe I did something on color. And you're not going to steal my idea because of that, because I'm just writing about things that are somewhat related to what I'm doing, but not the exact thing. Of course, if I'm going to lay out my entire research in front of you, it's going to be a problem.",
      "id": "ep_15_ut_121"
    },
    {
      "end": 2248358,
      "speaker": "Enrico Bertini",
      "start": 2232934,
      "text": "But it's, it's never the idea. It's never. The idea itself is more the way you implement it that really makes a difference. Right. So if I just tell you the idea, you're not gonna to develop this idea the same way I do, and that's where the difference is, I think.",
      "id": "ep_15_ut_122"
    },
    {
      "end": 2250534,
      "speaker": "Robert Kosara",
      "start": 2248406,
      "text": "Exactly. Yeah, yeah.",
      "id": "ep_15_ut_123"
    },
    {
      "end": 2252902,
      "speaker": "Moritz Stefaner",
      "start": 2250694,
      "text": "I mean, ideas are super overvalued and.",
      "id": "ep_15_ut_124"
    },
    {
      "end": 2253910,
      "speaker": "Enrico Bertini",
      "start": 2252958,
      "text": "Yeah, absolutely.",
      "id": "ep_15_ut_125"
    },
    {
      "end": 2259794,
      "speaker": "Moritz Stefaner",
      "start": 2253982,
      "text": "No, and then there's the startup that gets sold for a billion and everybody says, I had that idea ten years ago.",
      "id": "ep_15_ut_126"
    },
    {
      "end": 2264186,
      "speaker": "Enrico Bertini",
      "start": 2260614,
      "text": "This whole idea thing, it's a myth. It's never the idea itself.",
      "id": "ep_15_ut_127"
    },
    {
      "end": 2278374,
      "speaker": "Moritz Stefaner",
      "start": 2264250,
      "text": "Right. You know, Kyle MacDonald, he's like a hacker and artist from New York, and he keeps posting these project ideas on Twitter. So whenever he has a project idea, he just posted to Twitter, sort of hoping that somebody does it because he cannot realize them all.",
      "id": "ep_15_ut_128"
    },
    {
      "end": 2279218,
      "speaker": "Robert Kosara",
      "start": 2278674,
      "text": "Exactly.",
      "id": "ep_15_ut_129"
    },
    {
      "end": 2287578,
      "speaker": "Moritz Stefaner",
      "start": 2279266,
      "text": "Yeah. And then when somebody does it, actually, he's genuinely happy that it's out of the way, you know, it's done. Oh, excellent. Thanks for that.",
      "id": "ep_15_ut_130"
    },
    {
      "end": 2317984,
      "speaker": "Robert Kosara",
      "start": 2287626,
      "text": "Well, you have a lot more ideas than you can ever do. I mean, there are so many projects I would like to be able to do, so many things. I'm never going to get anywhere near that. So, you know, there's no harm. Of course, if you're a grad student and you're working on a particular project and you've invested a lot of time in it and you're about to publish it or you haven't published it yet and you're working on your final studies, don't tell the whole world exactly what you're doing because that's a bad idea, obviously, but, you know, being intelligent about it, it's not that hard to figure this out.",
      "id": "ep_15_ut_131"
    },
    {
      "end": 2340084,
      "speaker": "Moritz Stefaner",
      "start": 2319344,
      "text": "And I was thinking also more about this. Doesn't like old academia, if this thing exists. Maybe my head is full of cliches, but doesn't maybe old academia think you are a bit too lightweight if you communicate in this way and quickly throw out comments about stuff?",
      "id": "ep_15_ut_132"
    },
    {
      "end": 2352456,
      "speaker": "Enrico Bertini",
      "start": 2341024,
      "text": "Well, first of all, I think it's not quickly throwing out comments. Right? I mean, you can have a short blog post, but you maybe spend a lot, a lot of time thinking about it before writing even one single line. Right?",
      "id": "ep_15_ut_133"
    },
    {
      "end": 2353224,
      "speaker": "Moritz Stefaner",
      "start": 2352520,
      "text": "Yeah, yeah, yeah.",
      "id": "ep_15_ut_134"
    },
    {
      "end": 2366164,
      "speaker": "Enrico Bertini",
      "start": 2353264,
      "text": "So I don't think Robert or myself, I'm not. I can tell what I do. I never. I almost never write something down that I think is totally shallow. I try to spend some time thinking about it, and I think it's the same for Robert. Right.",
      "id": "ep_15_ut_135"
    },
    {
      "end": 2422120,
      "speaker": "Robert Kosara",
      "start": 2366504,
      "text": "Well, and the other thing is, I mean, all of us have Twitter accounts and we tweet stuff, and I don't always think all that hard about my tweets, but I think that should be, you know, I don't think there is some kind of code of ethics that all your thoughts have to be really deep, and. And you can never go back and say, oh, that was actually wrong. So I don't see this as a problem. And if you're really nasty, there's also a line between being critical and being. And just, you know, being able to criticize things and saying something is not good, and being nasty and being. Being really going to the point where you're really starting to hurt people. And that, obviously, is something that you don't want to cross. But I don't think I do that, and neither on my blog nor on Twitter. So I don't feel like I have to be super careful with what I'm saying, because I just don't think those nasty, horrible thoughts. So I don't think I'm going to write them.",
      "id": "ep_15_ut_136"
    },
    {
      "end": 2440398,
      "speaker": "Enrico Bertini",
      "start": 2422312,
      "text": "And actually, I would put it the other way around. So if you are in academia today, in the world we live in today, there's so much information around and so much noise that actually, to any academics, I would like to ask, do you have a strategy to actually advertise your own work? Because nobody's gonna notice it if you're.",
      "id": "ep_15_ut_137"
    },
    {
      "end": 2441478,
      "speaker": "Robert Kosara",
      "start": 2440406,
      "text": "Gonna have a strategy.",
      "id": "ep_15_ut_138"
    },
    {
      "end": 2497434,
      "speaker": "Enrico Bertini",
      "start": 2441606,
      "text": "So this could be a blog, could be Twitter, could be a webpage, could be, I don't know, whatever. But if you don't have a strategy on how to put your voice out and let some people hear it, you are basically. I mean, you might be lost, right? Or, I mean, you can keep writing paper after paper, but then ten people are gonna read it and that's it. If you are happy with it, fine. But what is the. I mean, I mean, if you think about. If you think about how academia evolved during the last, I don't know, I think 1020 or even 30 years, the image of the scientist in a lab doing his own thing. And there are, I don't know, another maybe 20 people around the world doing, doing similar stuff. And that's it. That's, that's gone forever. Right now you have so many researchers and so many competing people and ideas and environments that it doesn't make sense. Right, exactly.",
      "id": "ep_15_ut_139"
    },
    {
      "end": 2499234,
      "speaker": "Robert Kosara",
      "start": 2497474,
      "text": "Well, in collaboration too. And you just want.",
      "id": "ep_15_ut_140"
    },
    {
      "end": 2500858,
      "speaker": "Enrico Bertini",
      "start": 2499274,
      "text": "And collaboration too. Sure.",
      "id": "ep_15_ut_141"
    },
    {
      "end": 2521654,
      "speaker": "Robert Kosara",
      "start": 2501026,
      "text": "And get things out there and just really make. Make it available to people because that's, in the end, that's what you do it for. It's not just to have another item on your, on your cv, but, yeah, to get it out there and get people to actually see it and, you know, maybe it ends up going nowhere, but at least it had a chance. And it was just one paper out of 10,000 that are published every year. You know, no one's gonna see it or very few people are gonna see it.",
      "id": "ep_15_ut_142"
    },
    {
      "end": 2529886,
      "speaker": "Enrico Bertini",
      "start": 2523454,
      "text": "Yeah. I think we could actually make an entire episode on this academics, because I'm.",
      "id": "ep_15_ut_143"
    },
    {
      "end": 2532790,
      "speaker": "Moritz Stefaner",
      "start": 2529990,
      "text": "Very convinced that the whole publishing business has to change.",
      "id": "ep_15_ut_144"
    },
    {
      "end": 2533910,
      "speaker": "Enrico Bertini",
      "start": 2532862,
      "text": "It's flawed.",
      "id": "ep_15_ut_145"
    },
    {
      "end": 2555616,
      "speaker": "Moritz Stefaner",
      "start": 2534102,
      "text": "I think that should be part of it. This engaging, like this continuous integration sort of thing that you spit out research results in much smaller portions and use that to get in touch with people and refine everything together and so on. Yeah, I really like that. So, yeah, maybe that could be an extra episode. Absolutely, yeah.",
      "id": "ep_15_ut_146"
    },
    {
      "end": 2576008,
      "speaker": "Enrico Bertini",
      "start": 2555640,
      "text": "I mean, honestly, we all grew up as researchers in this mindset where what really counts is publishing papers. Right. And it still is like that because you are evaluated according to these metrics. But what really matters is impact in the end. Right? So you want to have an impact and that's what really matters in the long term.",
      "id": "ep_15_ut_147"
    },
    {
      "end": 2576880,
      "speaker": "Moritz Stefaner",
      "start": 2576136,
      "text": "Yeah. Right.",
      "id": "ep_15_ut_148"
    },
    {
      "end": 2579016,
      "speaker": "Enrico Bertini",
      "start": 2576912,
      "text": "So, yeah, anyway, let's.",
      "id": "ep_15_ut_149"
    },
    {
      "end": 2583564,
      "speaker": "Robert Kosara",
      "start": 2579120,
      "text": "You don't want to blog instead of writing papers, but you want to use a blog.",
      "id": "ep_15_ut_150"
    },
    {
      "end": 2588432,
      "speaker": "Enrico Bertini",
      "start": 2585024,
      "text": "So why don't we move to your recent stuff?",
      "id": "ep_15_ut_151"
    },
    {
      "end": 2589704,
      "speaker": "Moritz Stefaner",
      "start": 2588528,
      "text": "Yeah, the real story.",
      "id": "ep_15_ut_152"
    },
    {
      "end": 2617004,
      "speaker": "Enrico Bertini",
      "start": 2589824,
      "text": "The real story. Originally, we really wanted to talk with you about your, your big move to Tableau out of academia. So I don't know what's the story behind that. I know you wrote a blog post about it, but it would be nice to hear it from you. I mean, I think it's really, really uncommon having somebody leaving academia for going to after tenure and going to actually.",
      "id": "ep_15_ut_153"
    },
    {
      "end": 2649014,
      "speaker": "Robert Kosara",
      "start": 2617084,
      "text": "You would be surprised so I'm in touch with a woman who's writing a story right now for the Chronicle of higher education. And she was asking on Twitter for people who had left academia and had left tenured positions to go into, into industry. And she's overwhelmed by the response. So she's got a lot of people to respond to her, which is interesting. So he's back. I'm still here. Can you hear me? I'm here. I'm here. Hello?",
      "id": "ep_15_ut_154"
    },
    {
      "end": 2653810,
      "speaker": "Enrico Bertini",
      "start": 2650634,
      "text": "Yeah, sure, sure. We can hear you.",
      "id": "ep_15_ut_155"
    },
    {
      "end": 2655730,
      "speaker": "Moritz Stefaner",
      "start": 2653922,
      "text": "We can hear you. It was just a little lag.",
      "id": "ep_15_ut_156"
    },
    {
      "end": 3083642,
      "speaker": "Robert Kosara",
      "start": 2655802,
      "text": "Yeah, just a little. All right. Okay. So, and so it's interesting that, and actually, when I told people, when people found out that I had moved to Tableau, a few people actually said to me that there's some kind of trend now of people doing that, which is interesting. I hadn't really thought about that. So apparently there are quite a few people who have done this. And I was trying to kind of summarize some of the ideas or some of the reasons for that move in my blog posting. But this was just a small part of it. There isn't a single reason for doing this. It's all just a number of small things. And just the timing was right. So I was doing my sabbatical at Tableau software starting in January. And my plan was not to stay here. My plan was to just do my sabbatical, do my one year, do a lot of interesting research, and talk to lots of people and figure out what I'm going to be doing after, because that was certainly also part of this year, is to figure out, okay, now, post tenure, there's this kind of lull. You've worked for a long time to get that. And now what? And so I wanted to figure out what will be my next research direction, what kinds of grant proposals can I write and stuff like that. And so over the first half of the year or so, I actually traveled quite a bit and talked to lots of people. And at some point in the summer, I started thinking, and people actually here at Tableau started asking me whether I was actually going to really go back or whether I was going to stay. And without really much of a thought, think. But I kind of started thinking about this. And over the summer, Chuck McKinney started building this research group, and I talked to a whole bunch of people, and I enjoyed the work here. And so I started talking to chalk and Pat Hanrahan and others, Chris Dalte, about potentially staying here. And that's what I ended up doing. And so by the end of. Well, actually it was the beginning of the semester, basically. So late August, early September, I essentially switched over to being full time at Tableau. And so some of the reasons for doing this are certainly that it's much easier to. So one thing I really enjoy doing is being able to actually do my own research, because at the university what you end up doing very much, very often is. Yeah, I know, but that's perhaps the biggest thing is that you end up being a manager of your students because you tell them what to do, you help them with their little problems, you guide them. You spend a lot of time either teaching or advising students and then of course, meetings. But the two big things for me were always teaching, which is just this big chunk of time that's eaten up by it, and advising. And I enjoy doing both. I enjoy teaching and I enjoy advising students. But the problem is that at the end of the day or at the end of the week, I have a few hours for the whole week that I actually left to do actual work myself other than administrative stuff. And so here at Tableau, I was able to just for the first few weeks, I had not a single meeting and my calendar was completely empty, morning till night, nothing. I could just do whatever I wanted. And it was such a new idea, a new feeling of freedom, unbelievable. And piece of being able to really get back and really get my hands dirty and actually do my own research, do my own, actually read lots of papers again and not just rely on the students doing that and hacking, doing lots of prototyping and things like that. That's just really good to be able to do that. And so I enjoy that. The other thing, so that's really one big reason. And the other thing is that I also like having impact, and that's something I'm really missing at the university, being able to do things that end up making a difference. And I feel like I can do that a lot more here because from almost, from the beginning here I was talking not just to Chuck, but to developers here who are very interested in research. They all want to know what I'm working on and how they can improve the product and their own different things, and to the program managers and to all kinds of different people, and just very quickly getting involved in development essentially in a way that I really enjoy, which is not actually having to do all the small things like all the development work actually myself, but being able to think about how else could this be done or how could we do blah differently or whatever, being able to work on different levels both on this visionary, high level thing and then also talk about features, talk about individual little things that we can do is really interesting. And then being able to get it into a product in a time span that's not decades, but that's a year or so or even just a few months perhaps, is really exciting. And being able to then see how people actually use it, because we have a very good relationship with lots of our customers, so we can get a lot of feedback from them. And so being able to actually test things, not just by having, forcing some students in the lab to actually click some buttons, but to actually have real users really use the thing for their actual work with their own actual data that they know that they care about makes a big difference. And so understanding or being able to build things and develop and design things that will become features and it will hopefully be useful, and finding out how useful they will be, or maybe not. Maybe they will be. Hopefully. Obviously they will be. It's really exciting. And so being able to do that is just something that I was really missing at the university. Those are just two things. Perhaps there are couple, there are lots of other things, but those are really the main things, the main reasons. And I mean, I can also tell you if you want to hear more about the research here at Tableau. So there is a research group that was just restarted in the summer that Chuck McKinley is running as part of another group that's doing a lot of user experience design, user interface design. And we have four researchers now, me being one of them. Well, the person who you might know from the visualization conferences is Anushka anand. She started in the summer. And then there are the folks who are here as well. And so we're all doing different things. And we actually, the nice thing about this group is that we're not actually working together as a group so much as we each working with developers, with program managers and others kind of outside. So it's not a little bubble of research that's not talking to the rest of the company, but we're very much in the middle of it all. So we're talking to everybody and are involved in the actual development and everything, which is great and testing and everything. So it's really nice to be able to be involved and actually be hands on and build things.",
      "id": "ep_15_ut_157"
    },
    {
      "end": 3093594,
      "speaker": "Moritz Stefaner",
      "start": 3083778,
      "text": "Can you tell us a bit what you're working on, what, your research pursuit? Yeah, we also had that question on Twitter from Lynn Journey, and I'm interested, too.",
      "id": "ep_15_ut_158"
    },
    {
      "end": 3126422,
      "speaker": "Robert Kosara",
      "start": 3094694,
      "text": "So my research, and this is actually still basically the same thing that I set out to do for my sabbatical is to work on storytelling in visualization. So how can we tell stories more effectively using data or about data and using visual means? And so what I've been trying to do is try and figure out basically how do stories work that are in the news media or that people just kind of build for different purposes for presentations.",
      "id": "ep_15_ut_159"
    },
    {
      "end": 3128862,
      "speaker": "Moritz Stefaner",
      "start": 3126518,
      "text": "Presentations, yeah.",
      "id": "ep_15_ut_160"
    },
    {
      "end": 3340026,
      "speaker": "Robert Kosara",
      "start": 3128958,
      "text": "And how do you tell the stories? Some of those stories are told like Hans rosing style with a presenter there, and you're basically using the visuals and explaining what's going on and maybe jumping around and making it really interesting. And many of those are more like the New York Times does these things where you click through some, you could call it a slideshow, but it's not necessarily a slideshow, but you have basically steps that you click a sequence, a sequence of different configurations, basically, and you see different things. And it's also interesting actually to look at how the news visualizations work, because not all of those, actually, a lot of those are not stories. They're just supporting data and the actual story is in the written part. But some of them are really very nice stories that actually take you through a sequence. They tell you something without you having to read the actual article, or they are just completely self contained. That's what I'm interested in, is how do you present data and how is it different from analyzing data? And one of the things that's really different there, which is something I realized and that I'm still trying to convince people that this is important, is that memory actually plays a role, because in analysis you don't really care about memory. You care about because your machine is your memory. It has all the data and you can just access it. And that's actually the point of the visualization. You basically externalize the memory to the machine, which is great, but when you're trying to get a point across, what you want is, or when you want to tell a story, like about, I just write this thing about subsidies for different industries in different states that the New York Times is running right now. And so you want to, you want people to remember something, there's a takeaway. And so if they don't remember anything, then you haven't communicated to them because they didn't retain anything. And if you show them the same, the same bar chart with the same color bars and everything for five different stories, they're not going to remember anything. That's that study from, from a few years ago that compared the Nigel Holmes type graphics to bar charts or to other kinds of charts, simple charts, very bare charts. And so the question is, how do you get people to remember things without maybe going overboard and or without having to create things that you just won't be able to do easily, like drawing a completely new, very specific infographic about your data. And there are some ideas there about how you sequence things, what kinds of ways there are to lead people through a visualization. And I'm actually, I've got a paper that's kind of the review, so maybe I won't talk about this too much, but about how you, how you can do that and how the. And some of those techniques are fairly general. They can be used for, not just for really storytelling, but also just for, or a display, maybe like a poster, to give you a sense of what's important or what's the hierarchy between different parts of the data. So basically trying to go, because there's this whole thing about how visualization includes exploration, analysis and presentation. But the first two things we know fairly well now, there are lots of techniques, but presentation is still very poor. We have a very poor understanding of what it actually is. Assume we can use the same things.",
      "id": "ep_15_ut_161"
    },
    {
      "end": 3374072,
      "speaker": "Moritz Stefaner",
      "start": 3340170,
      "text": "Yeah, or this general idea that people, that the visualization is not just the end product, but plays a bigger role in a workflow in a social setting that is being passed on. And sometimes you might want to have a very abbreviated version just for the meeting, but you might have a different version that is much more in detail for a different purpose. And all these workflows and the social role of visualization, I think that's just being realized now. How much is missing there or how much better it could be if the tools would support that really well, I.",
      "id": "ep_15_ut_162"
    },
    {
      "end": 3385324,
      "speaker": "Enrico Bertini",
      "start": 3374088,
      "text": "Think what is really interesting here is that research in infovis has been focused on exploratory tasks for ages until, I don't know, a couple of years ago.",
      "id": "ep_15_ut_163"
    },
    {
      "end": 3389164,
      "speaker": "Moritz Stefaner",
      "start": 3385864,
      "text": "I mean, that's where it came from, Tuque and so on, you know, that's like.",
      "id": "ep_15_ut_164"
    },
    {
      "end": 3390380,
      "speaker": "Enrico Bertini",
      "start": 3389884,
      "text": "Yeah, sure.",
      "id": "ep_15_ut_165"
    },
    {
      "end": 3393132,
      "speaker": "Moritz Stefaner",
      "start": 3390412,
      "text": "I mean, it's clear that this has been the focus.",
      "id": "ep_15_ut_166"
    },
    {
      "end": 3421884,
      "speaker": "Enrico Bertini",
      "start": 3393268,
      "text": "Yeah. But this whole idea that Robert mentioned, how do you go beyond that? And how do you actually use visualization to let a specific message or piece of information stick into people's mind? That's totally new, and it's really fascinating. And there are many other aspects of visualization or visualization uses that have never been researched in depth, that I think there is a whole spectrum of things to research there is really, really interesting.",
      "id": "ep_15_ut_167"
    },
    {
      "end": 3434512,
      "speaker": "Moritz Stefaner",
      "start": 3423904,
      "text": "And the knowledge in this area is much more like practical or implicit, that some people are just good at it. And I think there's little really structure.",
      "id": "ep_15_ut_168"
    },
    {
      "end": 3475100,
      "speaker": "Robert Kosara",
      "start": 3434528,
      "text": "It's really hard to tease out, actually, because you can see things like the New York Times folks, they just do a really good job at it. Then you're like, okay, how did they do that? Why is this one so much better than the other one? And it's actually quite hard to figure this out. And I'm still working on this. This is not in any way finished, but there are some really interesting ideas that we can glance, and I think that also, or we can glean rather, and then also things that I think we can actually take a lot further because I think we're at the point now where we're starting to do this and do it well. But I think there's a lot more out there that we can, can do. And so trying to kind of push the envelope a bit here to figure out what else is there, what other ideas are there out there or how to tell stories.",
      "id": "ep_15_ut_169"
    },
    {
      "end": 3488492,
      "speaker": "Enrico Bertini",
      "start": 3475252,
      "text": "My guess, Robert, is that there is also a technological component here. Right. So the actual tools we have today are not really tailored into making this whole process easy to do. Right, exactly.",
      "id": "ep_15_ut_170"
    },
    {
      "end": 3488788,
      "speaker": "Robert Kosara",
      "start": 3488548,
      "text": "Yeah.",
      "id": "ep_15_ut_171"
    },
    {
      "end": 3499300,
      "speaker": "Enrico Bertini",
      "start": 3488836,
      "text": "And I guess that's one aspect that really interests. I mean, I think what is really interesting from the Tableau point of view is how to make these tools. Right, right, exactly.",
      "id": "ep_15_ut_172"
    },
    {
      "end": 3544014,
      "speaker": "Robert Kosara",
      "start": 3499452,
      "text": "So how do we enable users to tell better stories and some of that? And it's not all going to be about features, because features can help, certainly, and there will have to be features at some point, but it's also about how you give people a starting point because I think that's, and get them to think in those terms, and that's going to be actually pretty difficult to figure out. But because technology is relatively straightforward once it's done, I mean, it's still a lot of work and everything, but the other side is just showing people a different way of thinking. And I think that's really going to be very exciting to see how well that works and what people can come up with, because once those tools are out there, it's going to be really awesome to see what people will build with them.",
      "id": "ep_15_ut_173"
    },
    {
      "end": 3553744,
      "speaker": "Moritz Stefaner",
      "start": 3544954,
      "text": "Yeah, I guess that would be the best. Just to roll out something quickly and then just see how people use it. I think. I think this will be the best inspiration, probably. Yeah.",
      "id": "ep_15_ut_174"
    },
    {
      "end": 3554708,
      "speaker": "Robert Kosara",
      "start": 3554284,
      "text": "Cool.",
      "id": "ep_15_ut_175"
    },
    {
      "end": 3578364,
      "speaker": "Moritz Stefaner",
      "start": 3554756,
      "text": "Sounds great. I mean, we do have a few more listener questions, so we could go through these briefly, if you like. Yeah, just quick answer. So Jan Willem asks, so there are rumors that there will be a Tableau for Mac, which would be super awesome. And he wants to have the details here.",
      "id": "ep_15_ut_176"
    },
    {
      "end": 3604456,
      "speaker": "Robert Kosara",
      "start": 3579304,
      "text": "Yeah. So I think this was announced at the Tableau customer conference that there will be a Tableau for Mac, I believe, and I'm not actually sure, but I think this was announced to be next year. But I can't tell you anything more specific about the date. But what I can tell you is that a lot of people are asking about it. And so this will be a huge event.",
      "id": "ep_15_ut_177"
    },
    {
      "end": 3606478,
      "speaker": "Enrico Bertini",
      "start": 3604520,
      "text": "I think that's a request number one.",
      "id": "ep_15_ut_178"
    },
    {
      "end": 3618434,
      "speaker": "Moritz Stefaner",
      "start": 3606526,
      "text": "For, and I think parallels, you know, the virtualization software will like stop being sold immediately because I think it's the only reason to buy parallel run on your Mac.",
      "id": "ep_15_ut_179"
    },
    {
      "end": 3629086,
      "speaker": "Robert Kosara",
      "start": 3619894,
      "text": "Yeah, well, that's true. I mean, it's really important to get that out, but it's not going to happen right away. So we will be releasing table zero zero eight in the first quarter of next year.",
      "id": "ep_15_ut_180"
    },
    {
      "end": 3629510,
      "speaker": "Moritz Stefaner",
      "start": 3629150,
      "text": "Nice.",
      "id": "ep_15_ut_181"
    },
    {
      "end": 3639564,
      "speaker": "Robert Kosara",
      "start": 3629582,
      "text": "And I think, I hope it's safe to say that it's not going to be released with that version. But it will be a bit later. But it's coming.",
      "id": "ep_15_ut_182"
    },
    {
      "end": 3641924,
      "speaker": "Moritz Stefaner",
      "start": 3640304,
      "text": "That will make a big difference.",
      "id": "ep_15_ut_183"
    },
    {
      "end": 3642936,
      "speaker": "Enrico Bertini",
      "start": 3642224,
      "text": "Yeah, I think so.",
      "id": "ep_15_ut_184"
    },
    {
      "end": 3650240,
      "speaker": "Moritz Stefaner",
      "start": 3642960,
      "text": "For opening to new users and just getting quite a few new people into the product.",
      "id": "ep_15_ut_185"
    },
    {
      "end": 3655684,
      "speaker": "Robert Kosara",
      "start": 3650432,
      "text": "Oh, and there are tons of the Tableau customer conference you saw. Lots, lots of people with Macs. So.",
      "id": "ep_15_ut_186"
    },
    {
      "end": 3685428,
      "speaker": "Moritz Stefaner",
      "start": 3657384,
      "text": "They feel the pain that all their keyboard shortcuts don't work. And it's all. But I have to say, I mean, I worked on the Emoto, on the Olympics thing also with Tableau quite a bit. And I was actually working on 12 million tweets and then metadata in inside parallels on my Mac. And it worked. I mean, it was like super fast, but it was doable. Yeah. And that's quite amazing. I mean, more crazy times.",
      "id": "ep_15_ut_187"
    },
    {
      "end": 3694674,
      "speaker": "Enrico Bertini",
      "start": 3685556,
      "text": "I know you are Moritz, I know you are a big fan of Tableau. Are there. Did you ever have a project where you didn't use Tableau at all?",
      "id": "ep_15_ut_188"
    },
    {
      "end": 3702022,
      "speaker": "Moritz Stefaner",
      "start": 3696014,
      "text": "Yeah, it depends. I mean, the amount to which I use it depends a bit, you know, if I have a network data set or a hierarchy.",
      "id": "ep_15_ut_189"
    },
    {
      "end": 3704662,
      "speaker": "Enrico Bertini",
      "start": 3702078,
      "text": "Okay. Yeah, that's another. Another big thing.",
      "id": "ep_15_ut_190"
    },
    {
      "end": 3707190,
      "speaker": "Moritz Stefaner",
      "start": 3704758,
      "text": "Yeah, yeah, that's. That's another topic.",
      "id": "ep_15_ut_191"
    },
    {
      "end": 3711478,
      "speaker": "Enrico Bertini",
      "start": 3707302,
      "text": "Yeah, but you don't want this kind of tool that do everything because then I don't know.",
      "id": "ep_15_ut_192"
    },
    {
      "end": 3721482,
      "speaker": "Moritz Stefaner",
      "start": 3711526,
      "text": "I mean, probably. Yeah, but I mean, it wouldn't hurt if there was like support for hierarchies. I mean, that wouldn't take away anything from the core product. I think it's. Yeah.",
      "id": "ep_15_ut_193"
    },
    {
      "end": 3724418,
      "speaker": "Robert Kosara",
      "start": 3721578,
      "text": "Right. It just needs to be done well, so that's.",
      "id": "ep_15_ut_194"
    },
    {
      "end": 3751586,
      "speaker": "Moritz Stefaner",
      "start": 3724586,
      "text": "Yeah, the second big thing. I have an issue with is if you have one field that can have multiple values, like tags, very hard to work with that because you need to sort of expand it into rows that have duplicates in all other fields, and then you have to, like, count unique and ba ba ba. And so that's, it's also, it's not part of the core concept that one. There might be multiple values in one field.",
      "id": "ep_15_ut_195"
    },
    {
      "end": 3756962,
      "speaker": "Robert Kosara",
      "start": 3751730,
      "text": "Right. That's really not what a tabular dataset usually has, because each value. I mean, each.",
      "id": "ep_15_ut_196"
    },
    {
      "end": 3757354,
      "speaker": "Moritz Stefaner",
      "start": 3757018,
      "text": "Exactly.",
      "id": "ep_15_ut_197"
    },
    {
      "end": 3764234,
      "speaker": "Robert Kosara",
      "start": 3757394,
      "text": "Yeah. It's not a column, so that makes it a bit tricky. Yeah, but there are workarounds.",
      "id": "ep_15_ut_198"
    },
    {
      "end": 3770254,
      "speaker": "Moritz Stefaner",
      "start": 3764314,
      "text": "Exactly. I have these python loops that expand everything, like blow up the whole table.",
      "id": "ep_15_ut_199"
    },
    {
      "end": 3782460,
      "speaker": "Robert Kosara",
      "start": 3772074,
      "text": "But I guess you can use blending also to maybe if you have to have tags in a different table than the original data, then you can actually connect them. There might be some tricks that might make this easier.",
      "id": "ep_15_ut_200"
    },
    {
      "end": 3783180,
      "speaker": "Moritz Stefaner",
      "start": 3782612,
      "text": "Yeah.",
      "id": "ep_15_ut_201"
    },
    {
      "end": 3788356,
      "speaker": "Robert Kosara",
      "start": 3783292,
      "text": "Might be the parsing you will have to do by hand. I don't think there's a way around.",
      "id": "ep_15_ut_202"
    },
    {
      "end": 3805464,
      "speaker": "Moritz Stefaner",
      "start": 3788420,
      "text": "Extra table is a good idea, though. Yeah. Might want to keep that in mind. Cool. Next question. John Kelly says we should ask you about Cleveland Gate. So what is Cleveland's guide and why is it important?",
      "id": "ep_15_ut_203"
    },
    {
      "end": 3899544,
      "speaker": "Robert Kosara",
      "start": 3805924,
      "text": "Well, so I was trying to. So this started Justin Talbot, who's also now one of our researchers. He was a student of Pat Hanrahan at Stanford. Well, he still actually is. He's still finishing up his PhD. He did a very interesting study on the idea of this idea that's called banking to 45 degrees, which is an idea that comes from Cleveland, Bill Cleveland, who wrote, I think, in one of his books about a study that he did or had done in the early eighties about what the average angle or the average slope of the lines in the line chart should be so that people can read the difference between two lines. Well, and there's lots of details here, but there was a paper that he had at Infovis, which I thought was really, really awesome, that basically questions some of the assumptions. Well, so, first of all, they tried to replicate that study, and they found that there were some issues because the parameter space that they, that Cleveland had explored wasn't actually complete, but they had, I think he had only started the slopes that he was comparing at 45 degrees and then went higher but not lower. And so he ended up having this model that said, well, the accuracy increases down to 45 degrees, but then his basically, it bumps against the end of the data. And so maybe you wonder what happens afterwards. Right. So. And then the assumption was it would go back up, but it wasn't actually borne out by the data.",
      "id": "ep_15_ut_204"
    },
    {
      "end": 3899984,
      "speaker": "Moritz Stefaner",
      "start": 3899624,
      "text": "Oh, wow.",
      "id": "ep_15_ut_205"
    },
    {
      "end": 3979594,
      "speaker": "Robert Kosara",
      "start": 3900024,
      "text": "So they did this study that added more comparisons and more angles, more slopes, and ended up showing that that was actually not entirely true, that the model actually, that line kind of continues and that lower angles, lower slopes are actually better. But, of course, those lead to very, very kind of hard. Those are big charts that end up having other issues. So the. Because if you get. If you get very narrow or very shallow kind of lines, it's also hard to see differences. So that's not what you want to do either. But that's kind of an interesting. So what I was trying to do with Cleveland Gate was basically to play this up into a big scandal, to say that this assumption that we've known is wrong. Right. For decades, it's not actually true. And people just kind of never asked. You never question it, but now we see that it's all wrong. But, of course it's not wrong. It's just that some of the basic assumptions aren't entirely correct, which is fine. This is not actually invalidating it. And now the question is, actually, what do we do from here? Because the question is now the trade off between the things that Justin found and basically trying to figure out how high your or how steep lines need to be so that you can read things well when not comparing. And so they're basically trade offs between different types of tasks in a chart.",
      "id": "ep_15_ut_206"
    },
    {
      "end": 3984898,
      "speaker": "Moritz Stefaner",
      "start": 3979674,
      "text": "Yeah, but I always love that when these simple truths get a bit debug.",
      "id": "ep_15_ut_207"
    },
    {
      "end": 3985610,
      "speaker": "Robert Kosara",
      "start": 3984946,
      "text": "Yeah, exactly.",
      "id": "ep_15_ut_208"
    },
    {
      "end": 4013524,
      "speaker": "Moritz Stefaner",
      "start": 3985682,
      "text": "It's the same about the golden ratio. Everybody knows golden ratio looks good until they did empirical studies, and actually, nobody cares. It's like roughly two to three is fine, or two thirds that looks fine, but it's this 0.61. Nobody cares. And I always love it when these comment truths get debunked by just looking at.",
      "id": "ep_15_ut_209"
    },
    {
      "end": 4015324,
      "speaker": "Robert Kosara",
      "start": 4013564,
      "text": "But that makes what the actual response is.",
      "id": "ep_15_ut_210"
    },
    {
      "end": 4016116,
      "speaker": "Moritz Stefaner",
      "start": 4015404,
      "text": "Yeah, yeah, yeah.",
      "id": "ep_15_ut_211"
    },
    {
      "end": 4023748,
      "speaker": "Robert Kosara",
      "start": 4016220,
      "text": "Right. Because it's asking such a deep and fundamental question that a lot of people never think about. So this is really interesting.",
      "id": "ep_15_ut_212"
    },
    {
      "end": 4024396,
      "speaker": "Moritz Stefaner",
      "start": 4023836,
      "text": "Yeah.",
      "id": "ep_15_ut_213"
    },
    {
      "end": 4032654,
      "speaker": "Robert Kosara",
      "start": 4024540,
      "text": "But, yeah, it didn't quite work out. I wanted to make this into a big scandal, but maybe I'll find something else that I can get people worked up about.",
      "id": "ep_15_ut_214"
    },
    {
      "end": 4043924,
      "speaker": "Enrico Bertini",
      "start": 4033384,
      "text": "I think one could very, very well build our old PhD thesis by redoing what Cleveland did and expanding on top of it. There is so much stuff out there.",
      "id": "ep_15_ut_215"
    },
    {
      "end": 4052128,
      "speaker": "Robert Kosara",
      "start": 4044664,
      "text": "And I think that paper is a good starting point. If anybody's looking for a PhD topic, this is probably a really good way of getting started.",
      "id": "ep_15_ut_216"
    },
    {
      "end": 4052888,
      "speaker": "Enrico Bertini",
      "start": 4052296,
      "text": "I agree.",
      "id": "ep_15_ut_217"
    },
    {
      "end": 4068764,
      "speaker": "Robert Kosara",
      "start": 4052976,
      "text": "Looking at some of Cleveland's books and papers and looking for those boundary issues and then trying to figure out what the trade offs could be and then running a couple of studies that would be very useful and highly valuable and would make an awesome PhD. Yeah, absolutely. Maybe even more than one.",
      "id": "ep_15_ut_218"
    },
    {
      "end": 4080296,
      "speaker": "Enrico Bertini",
      "start": 4069184,
      "text": "I think that actually, I think the same is true for Bertin. If you take the semiology of graphics and you try to do the same, you have so much material there that, and it's not, that's the type of.",
      "id": "ep_15_ut_219"
    },
    {
      "end": 4082824,
      "speaker": "Moritz Stefaner",
      "start": 4080320,
      "text": "PhDs that take ten years and drive you nuts.",
      "id": "ep_15_ut_220"
    },
    {
      "end": 4100294,
      "speaker": "Enrico Bertini",
      "start": 4082864,
      "text": "Well, you could actually take a segment of it and focus on that. And there are so many starts, starting points there. You could very well build a whole career on top of it, I think. Anyway, let's move to. I think we have more questions. Right?",
      "id": "ep_15_ut_221"
    },
    {
      "end": 4111574,
      "speaker": "Moritz Stefaner",
      "start": 4100914,
      "text": "Yes. Andy Kirk, visualizing data asks. Yeah. Does Robert see a future for word clouds as the final slide of PowerPoint presentations?",
      "id": "ep_15_ut_222"
    },
    {
      "end": 4133023,
      "speaker": "Robert Kosara",
      "start": 4112594,
      "text": "Yeah, that was a more common thing, I think, this year at the conference. I don't think it's a bad idea. I mean, word clouds have all kinds of issues with perception and word length making a difference in how big a word appears and everything. But as illustrations, why not? I don't have an issue with that.",
      "id": "ep_15_ut_223"
    },
    {
      "end": 4137043,
      "speaker": "Moritz Stefaner",
      "start": 4134203,
      "text": "So you do see a bright future for word cloud?",
      "id": "ep_15_ut_224"
    },
    {
      "end": 4141103,
      "speaker": "Robert Kosara",
      "start": 4137083,
      "text": "Yeah, I guess so. I mean, and they're pretty. So, you know, put them on their slides.",
      "id": "ep_15_ut_225"
    },
    {
      "end": 4144724,
      "speaker": "Moritz Stefaner",
      "start": 4141603,
      "text": "Will Tableau have a word cloud plugin tab thing?",
      "id": "ep_15_ut_226"
    },
    {
      "end": 4155516,
      "speaker": "Robert Kosara",
      "start": 4144804,
      "text": "But we actually, we do have a new, this is a feature for Tableau eight is that they're in our word clouds as a feature. Oh, man. Yeah, you can build them directly in Tableau, I hope.",
      "id": "ep_15_ut_227"
    },
    {
      "end": 4159724,
      "speaker": "Moritz Stefaner",
      "start": 4155540,
      "text": "The nice ones where, you know, everything is like, you can have words inside words and stuff.",
      "id": "ep_15_ut_228"
    },
    {
      "end": 4163796,
      "speaker": "Robert Kosara",
      "start": 4159764,
      "text": "No, no, they're not wordless.",
      "id": "ep_15_ut_229"
    },
    {
      "end": 4166384,
      "speaker": "Moritz Stefaner",
      "start": 4163980,
      "text": "Exactly. Yeah, wordles sort of killed it.",
      "id": "ep_15_ut_230"
    },
    {
      "end": 4188804,
      "speaker": "Robert Kosara",
      "start": 4167324,
      "text": "No, they really, their work that they're, I don't know exactly how the layout works, but it's not overlapping the words, that's for sure. And they're not inside each other. Exactly. So there are also. No, they aren't rotated or anything. They're just all facing the same direction and they're just sized and you can color them and everything. And it works pretty well, actually.",
      "id": "ep_15_ut_231"
    },
    {
      "end": 4193716,
      "speaker": "Moritz Stefaner",
      "start": 4188844,
      "text": "But I bet that must have been super sought after. Like, why can't I build tags?",
      "id": "ep_15_ut_232"
    },
    {
      "end": 4197920,
      "speaker": "Robert Kosara",
      "start": 4193820,
      "text": "Oh, yeah, yeah. But the other thing is also tree maps. That's a new feature also in Tableau.",
      "id": "ep_15_ut_233"
    },
    {
      "end": 4198936,
      "speaker": "Moritz Stefaner",
      "start": 4198052,
      "text": "That's nice.",
      "id": "ep_15_ut_234"
    },
    {
      "end": 4208164,
      "speaker": "Robert Kosara",
      "start": 4199120,
      "text": "Those are also, and they're actually really useful because you can do multiples of tree maps and you can connect them to other kinds of charts. And they have a lot of really cool uses.",
      "id": "ep_15_ut_235"
    },
    {
      "end": 4229804,
      "speaker": "Moritz Stefaner",
      "start": 4209224,
      "text": "Nice. So next question. Andy Codgrave asks his influences. Robert's influencer series is great. So you have on your blog, you always ask a few legends of infovis what their main influences were. And so Andy's question now is, what are your influences?",
      "id": "ep_15_ut_236"
    },
    {
      "end": 4339002,
      "speaker": "Robert Kosara",
      "start": 4231144,
      "text": "Yeah, this is an interesting question, because my early influences were mostly, weren't actually necessarily the usual things you would think. It was mostly individual papers that I read. Like Ben Shneiderman certainly was a big influence. His taxonomy, his dice habit, a task by the other type, taxonomy, authorization, I forget exact title. And the readings in Infoviz book that Chuck McKinley did with Ben Shneiderman and Stu cart that now is kind of dated. But at that time, this was around 99, 2000. That was just when it had come out. It was really good, and it was still good because there's a lot of interesting thinking in between. But there's certainly more recent work that isn't in there. One thing that I found really fascinating, and that may have also, I think that actually changed my thinking quite a bit, is Rudolf Arnheim and his books on perception in art. So he was an art psychologist, and he was doing a lot of interesting. He had books, the power of the center and a few other books that I forget the titles of that are really interesting because he talks about composition in abstract art, for example, and why certain things are certain ways. And it's really interesting to see that because a lot of the same ideas actually come back in visualization, which is also kind of a bit like abstract art because you can pick whatever you want as your layout, but there are certain rules that you still need to follow to make it easier to understand what's going on.",
      "id": "ep_15_ut_237"
    },
    {
      "end": 4342218,
      "speaker": "Moritz Stefaner",
      "start": 4339058,
      "text": "And did that inspire sort of the implied dynamics research?",
      "id": "ep_15_ut_238"
    },
    {
      "end": 4354250,
      "speaker": "Robert Kosara",
      "start": 4342386,
      "text": "Not directly, no, but we certainly did. So we didn't. We certainly went back to read Arnheim and other things because there's a lot of interesting work in there. But we didn't quite start there. But that was important.",
      "id": "ep_15_ut_239"
    },
    {
      "end": 4383704,
      "speaker": "Moritz Stefaner",
      "start": 4354322,
      "text": "Yeah, but I think that's so under research. So before you wrote, and it was only one paper, actually, or two, maybe you published right before, I always said like, like research is ignoring this whole emergent dynamics that come from that sort of happen. When you put visuals together, you have a center of gravity and you have a direction in which you read them and all these things. And I was always saying research is totally ignoring that. And to a degree it's still true, I guess.",
      "id": "ep_15_ut_240"
    },
    {
      "end": 4401298,
      "speaker": "Robert Kosara",
      "start": 4384684,
      "text": "Well, and the other thing is. So actually, that's another research topic if anybody's looking for PhD thesis topics. There's a lot of work to be done, lots of gold magazines and metaphors and I mean, the really, the deeper questions about how visual metaphors work, there's a lot of stuff to be done there.",
      "id": "ep_15_ut_241"
    },
    {
      "end": 4403450,
      "speaker": "Moritz Stefaner",
      "start": 4401346,
      "text": "Visualization between the lines, you know.",
      "id": "ep_15_ut_242"
    },
    {
      "end": 4404146,
      "speaker": "Robert Kosara",
      "start": 4403562,
      "text": "Oh yeah.",
      "id": "ep_15_ut_243"
    },
    {
      "end": 4405842,
      "speaker": "Moritz Stefaner",
      "start": 4404250,
      "text": "Thesis title. Thesis title done.",
      "id": "ep_15_ut_244"
    },
    {
      "end": 4407694,
      "speaker": "Robert Kosara",
      "start": 4405898,
      "text": "Yeah, yeah, I like that.",
      "id": "ep_15_ut_245"
    },
    {
      "end": 4416694,
      "speaker": "Moritz Stefaner",
      "start": 4410834,
      "text": "Yeah. But Rudolf Anaheim sounds great, so I'll definitely follow up on that. I'm not familiar with him, so.",
      "id": "ep_15_ut_246"
    },
    {
      "end": 4418674,
      "speaker": "Robert Kosara",
      "start": 4416994,
      "text": "Oh yeah, you should. Definitely. He was very good.",
      "id": "ep_15_ut_247"
    },
    {
      "end": 4430034,
      "speaker": "Moritz Stefaner",
      "start": 4418714,
      "text": "Yeah, sounds good. Last question. Lane Harrison asks how much work was it to prepare parallel sets for release and was it worth it?",
      "id": "ep_15_ut_248"
    },
    {
      "end": 4432554,
      "speaker": "Robert Kosara",
      "start": 4430774,
      "text": "That's a lonely question. Yeah.",
      "id": "ep_15_ut_249"
    },
    {
      "end": 4436006,
      "speaker": "Moritz Stefaner",
      "start": 4433934,
      "text": "Did you count the hours? Probably not.",
      "id": "ep_15_ut_250"
    },
    {
      "end": 4527076,
      "speaker": "Robert Kosara",
      "start": 4436070,
      "text": "No. It was a lot of work because we ended up rewriting a lot of the code, actually. So I had some students work on kind of an implementation that was a different one than the original one, one that we had done way back at the vrvs. And because this was done in Java, and then I did a lot of work to clean up the code, to rework some of the data model and so on. So that was a lot of work that went into that also. Caroline Sincavich did a lot of work on that also to work on performance and so on. So this took several months of quite intense work. And actually, I think I spent most of my Christmas break, 2006 or zero seven, I forget hacking and then to get it out. And was it worth it? I think so. I mean, I think a lot of people got to use something that otherwise they would never have even heard about. And that page actually gets quite a bit of traffic still. Of course, now it's kind of outdated. It needs an update, that's for sure. And I'm not sure when I'm going to get around to that. I really don't know. I feel guilty for not having done that. But it's something that the problem is not so much. Well, of course, initial work was a lot of work, but then also keeping it up to date and keep adding features is a ton of work. And that's hard to really have that time to do that. But yeah, I think it was worth it. I think it's always worth it to get stuff out there and have people play with it and see it and hopefully like it and find use.",
      "id": "ep_15_ut_251"
    },
    {
      "end": 4536544,
      "speaker": "Enrico Bertini",
      "start": 4527250,
      "text": "So, Robert, you never had somebody picking up from where you left from where you stopped and trying to do something on top of your code? I guess the code is open source, right?",
      "id": "ep_15_ut_252"
    },
    {
      "end": 4537272,
      "speaker": "Robert Kosara",
      "start": 4536624,
      "text": "It's open source.",
      "id": "ep_15_ut_253"
    },
    {
      "end": 4538044,
      "speaker": "Enrico Bertini",
      "start": 4537328,
      "text": "Okay.",
      "id": "ep_15_ut_254"
    },
    {
      "end": 4552778,
      "speaker": "Robert Kosara",
      "start": 4538464,
      "text": "Not that I'm aware of. No. There are a couple of papers that reference the work and where people have apparently used to program. But I'm not aware of anybody actually building stuff on top of it. Which is too bad, because I think there's actually a lot of. There's a lot of stuff to be done there as well.",
      "id": "ep_15_ut_255"
    },
    {
      "end": 4561154,
      "speaker": "Enrico Bertini",
      "start": 4552816,
      "text": "Well, not even. Not even private companies interested in using it for their own purposes or stuff like that. No.",
      "id": "ep_15_ut_256"
    },
    {
      "end": 4570526,
      "speaker": "Robert Kosara",
      "start": 4562094,
      "text": "This company, and I forget their name in Sweden, they wanted to add the technique to their toolbox. But I'm not aware of any of them actually having done it, so.",
      "id": "ep_15_ut_257"
    },
    {
      "end": 4571166,
      "speaker": "Enrico Bertini",
      "start": 4570630,
      "text": "Okay.",
      "id": "ep_15_ut_258"
    },
    {
      "end": 4571854,
      "speaker": "Robert Kosara",
      "start": 4571230,
      "text": "I can't say.",
      "id": "ep_15_ut_259"
    },
    {
      "end": 4577354,
      "speaker": "Enrico Bertini",
      "start": 4571934,
      "text": "Okay, good. Robert, I think we could keep talking for ages.",
      "id": "ep_15_ut_260"
    },
    {
      "end": 4579694,
      "speaker": "Moritz Stefaner",
      "start": 4578694,
      "text": "We just started.",
      "id": "ep_15_ut_261"
    },
    {
      "end": 4580874,
      "speaker": "Enrico Bertini",
      "start": 4579814,
      "text": "We just started.",
      "id": "ep_15_ut_262"
    },
    {
      "end": 4581966,
      "speaker": "Robert Kosara",
      "start": 4581414,
      "text": "I mean.",
      "id": "ep_15_ut_263"
    },
    {
      "end": 4595394,
      "speaker": "Enrico Bertini",
      "start": 4582030,
      "text": "Yeah. Yeah. Sometimes it happens. We are talking for some time and it feels like we've been talking only for a few minutes and it's 1 hour and a half. Yeah. It's been great having you here.",
      "id": "ep_15_ut_264"
    },
    {
      "end": 4598982,
      "speaker": "Robert Kosara",
      "start": 4596094,
      "text": "Well, thanks for having me. It was great chatting with you.",
      "id": "ep_15_ut_265"
    },
    {
      "end": 4600486,
      "speaker": "Moritz Stefaner",
      "start": 4599158,
      "text": "Yeah. Super interesting.",
      "id": "ep_15_ut_266"
    },
    {
      "end": 4621414,
      "speaker": "Enrico Bertini",
      "start": 4600590,
      "text": "So we are looking forward to hear what are your next. To actually see what are your next steps. And I'm sure you will be blogging about it. And yeah, I hope to have you again as an host in the future and see. Maybe keep discussing about these whole things.",
      "id": "ep_15_ut_267"
    },
    {
      "end": 4623294,
      "speaker": "Robert Kosara",
      "start": 4622274,
      "text": "Absolutely.",
      "id": "ep_15_ut_268"
    },
    {
      "end": 4630866,
      "speaker": "Moritz Stefaner",
      "start": 4624234,
      "text": "Okay. Let's hope Tableau for Mac with that storytelling component is like, out in summer.",
      "id": "ep_15_ut_269"
    },
    {
      "end": 4633734,
      "speaker": "Enrico Bertini",
      "start": 4631010,
      "text": "Yeah. I would really, really love to have.",
      "id": "ep_15_ut_270"
    },
    {
      "end": 4636224,
      "speaker": "Robert Kosara",
      "start": 4634764,
      "text": "I'm not making any promise.",
      "id": "ep_15_ut_271"
    },
    {
      "end": 4641144,
      "speaker": "Moritz Stefaner",
      "start": 4637084,
      "text": "It takes time. I can see that. But we are looking forward.",
      "id": "ep_15_ut_272"
    },
    {
      "end": 4643204,
      "speaker": "Enrico Bertini",
      "start": 4642604,
      "text": "Okay.",
      "id": "ep_15_ut_273"
    },
    {
      "end": 4644644,
      "speaker": "Moritz Stefaner",
      "start": 4643284,
      "text": "Yeah. It was great having you.",
      "id": "ep_15_ut_274"
    },
    {
      "end": 4645628,
      "speaker": "Enrico Bertini",
      "start": 4644724,
      "text": "Thanks a lot.",
      "id": "ep_15_ut_275"
    },
    {
      "end": 4646764,
      "speaker": "Moritz Stefaner",
      "start": 4645756,
      "text": "Yeah, thanks.",
      "id": "ep_15_ut_276"
    },
    {
      "end": 4649524,
      "speaker": "Enrico Bertini",
      "start": 4646884,
      "text": "Bye, Robert. Bye bye. Take care. Bye.",
      "id": "ep_15_ut_277"
    }
  ],
  "confidence": 0.923824632148596,
  "audio_duration": 4655,
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_status_code": null,
  "webhook_auth": false,
  "webhook_auth_header_name": null,
  "speed_boost": false,
  "auto_highlights_result": null,
  "auto_highlights": false,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_audio_quality": null,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "content_safety": false,
  "iab_categories": true,
  "content_safety_labels": {
    "status": "unavailable",
    "results": [],
    "summary": {}
  },
  "language_detection": false,
  "language_detection_threshold": null,
  "language_confidence": null,
  "custom_spelling": null,
  "throttled": false,
  "auto_chapters": true,
  "summarization": false,
  "summary_type": null,
  "summary_model": null,
  "custom_topics": false,
  "topics": [],
  "speech_threshold": null,
  "speech_model": "best",
  "chapters": [
    {
      "summary": "Enrico and Moritz share data stories from their lives in New York. Enrico will be teaching information visualization next semester. Moritz says New York is incredibly warm. Both say there is a lot of potential in the area.",
      "gist": "Data stories #15",
      "headline": "Enrico and Moritz discuss data visualization at a New York conference",
      "start": 3080,
      "end": 233124,
      "id": "ep_15_ch_0"
    },
    {
      "summary": "We had first snow on. On Sunday for the first time. That was nice. And now it's all wet. Now it's officially winter, I guess when. When the first snow comes.",
      "gist": "First snow of the year in Germany",
      "headline": "We had first snow on Sunday for the first time",
      "start": 233304,
      "end": 258864,
      "id": "ep_15_ch_1"
    },
    {
      "summary": "We have a special, special guest here today. We have Robert Kosara. Hi, Enrico. Hey, Mark. How are you?",
      "gist": "Robert Kosara on CNN",
      "headline": "We have a special guest here today. We have Robert Kosara",
      "start": 259194,
      "end": 271546,
      "id": "ep_15_ch_2"
    },
    {
      "summary": "Robert has one of the most famous blogs on visualization on the web. He's trying to get more people to start blogging. He says there is a lot more to be said about understanding how visualization works. More blogging is useful, he says.",
      "gist": "A Minute with Robert's",
      "headline": "Robert Gentry has one of the most famous blogs on visualization on the web",
      "start": 271570,
      "end": 494942,
      "id": "ep_15_ch_3"
    },
    {
      "summary": "How's your blog doing in Ricoh? It's alive and kicking? No, I have some plans, but I don't want to say anything. The thing is, data stories is so good. You don't need a blog anymore. Should I keep doing it or not?",
      "gist": "How's My Blog doing?",
      "headline": "How's your blog doing in Ricoh? It's alive and kicking",
      "start": 495078,
      "end": 579034,
      "id": "ep_15_ch_4"
    },
    {
      "summary": "Robert Kohn: Could you briefly tell us a bit about the main research themes you have been looking into. Some of the work has been more on the theoretical side. A completely different type of work is on privacy in visualization. Kohn is trying to span this gamut of from theory to practical things.",
      "gist": "The Cognitive Science of Data Visualization",
      "headline": "Robert Schiller has done a number of research projects on data visualization",
      "start": 579194,
      "end": 795174,
      "id": "ep_15_ch_5"
    },
    {
      "summary": "Enrico: Do you know any other researcher who had such a broad portfolio in info? I think this is due to the interdisciplinary nature of the field itself, probably. You have people who can easily jump from core computer science to more artistic endeavors.",
      "gist": "Bob's Broad Portfolio",
      "headline": "Infovies have people who can jump from computer science to more artistic endeavors",
      "start": 795914,
      "end": 859094,
      "id": "ep_15_ch_6"
    },
    {
      "summary": "Infovis talks to Robert Kohn, founder of infovis. Kohn's background is computer science. He wanted to bring computer science into medicine. How did he get into the field?",
      "gist": "In the World of Data Visualization in Medicine",
      "headline": "Robert's background is computer science, but he also studied medicine",
      "start": 859214,
      "end": 1052565,
      "id": "ep_15_ch_7"
    },
    {
      "summary": "My actual Research topic was blur. I called this semantic depth of field. The idea was to take the idea from photography and blur the rest. When was the time when you actually decided to open eager eyes? That was much later, right?",
      "gist": "Blurring in the Web",
      "headline": "Semantic depth of field is used to guide the viewer's attention",
      "start": 1052669,
      "end": 1175604,
      "id": "ep_15_ch_8"
    },
    {
      "summary": "How did you come up with the idea of opening a blog and about visualization. Originally had this idea of making it basically like a wiki. Told people not to do that now, just make a normal blog.",
      "gist": "A New Dimension in Data Science: The Blog",
      "headline": "Robert: I started blogging about visualization long before many eyes actually started",
      "start": 1177884,
      "end": 1553384,
      "id": "ep_15_ch_9"
    },
    {
      "summary": "So you have to understand where you are and where the other people are and what the differences are. Once you understand those differences, you can start looking at, okay, now, what does this mean? Think it was helpful in the end.",
      "gist": "Drawing lines in the sand",
      "headline": "Drawing lines between different ideas and ways of doing things is very important",
      "start": 1553464,
      "end": 1622924,
      "id": "ep_15_ch_10"
    },
    {
      "summary": "How do you see eager eyes evolving in the future? I guess it evolved already a lot. What I tried to do this year is just to block more. Being consistent is good. The big thing about a blog is you need to keep it up.",
      "gist": "Exhaustive Eyes: A Year in the Life",
      "headline": "How do you see eager eyes evolving in the future",
      "start": 1626344,
      "end": 1996150,
      "id": "ep_15_ch_11"
    },
    {
      "summary": "Can I ask both of you how you think blogging has helped or hindered your academic career? Of course, it depends very much on where you are. Some schools and some universities think it's all a waste of time. But at UNC Charlotte, people were very open to this.",
      "gist": "Blogging and your academic career",
      "headline": "Can I ask both of you how blogging has helped or hindered your academic career",
      "start": 1996342,
      "end": 2424736,
      "id": "ep_15_ch_12"
    },
    {
      "summary": "Do you have a strategy to advertise your own work? Because nobody's gonna notice it if you don't. I think we could actually make an entire episode on this academics. The whole publishing business has to change. It's flawed. What really matters is impact in the end.",
      "gist": "How to advertise your own work",
      "headline": "Do academics need a strategy to advertise their own work today",
      "start": 2424800,
      "end": 2579016,
      "id": "ep_15_ch_13"
    },
    {
      "summary": "Originally, we wanted to talk with you about your, your big move to Tableau out of academia. Can you hear me? I'm here. We can hear you. The real story.",
      "gist": "You're Not Alone in Leaving Academia",
      "headline": "Originally, we wanted to talk about your, your big move out of academia",
      "start": 2579120,
      "end": 2657834,
      "id": "ep_15_ch_14"
    },
    {
      "summary": "In January, I was doing my sabbatical at Tableau software. By late August, early September, I essentially switched over to being full time at Tableau. There isn't a single reason for doing this. It's all just a number of small things.",
      "gist": "A year on sabbatical at Tableau",
      "headline": "Chuck was doing a sabbatical at Tableau before switching full time",
      "start": 2657994,
      "end": 3083642,
      "id": "ep_15_ch_15"
    },
    {
      "summary": "My research is to work on storytelling in visualization. How can we tell stories more effectively using data or about data and using visual means? How do you get people to remember things without maybe going overboard?",
      "gist": "Working on Story in Visualization",
      "headline": "Tu: My research focuses on storytelling in visualization",
      "start": 3083778,
      "end": 3561844,
      "id": "ep_15_ch_16"
    },
    {
      "summary": "There are rumors that there will be a Tableau for Mac, which would be super awesome. We will be releasing table zero zero eight in the first quarter of next year. That will make a big difference for opening to new users.",
      "gist": "Tableau: A Mac version?",
      "headline": "There are rumors that there will be a Tableau for Mac",
      "start": 3561924,
      "end": 3792184,
      "id": "ep_15_ch_17"
    },
    {
      "summary": "Cleveland Gate is an idea that comes from Bill Cleveland. It's about what the average angle or the average slope of the lines in a line chart should be. A new study questions some of the assumptions. What do we do from here?",
      "gist": "Cleveland's Guide: A Lesson",
      "headline": "Cleveland Gate is an idea that comes from Bill Cleveland",
      "start": 3793484,
      "end": 4094814,
      "id": "ep_15_ch_18"
    },
    {
      "summary": "Robert: Does Robert see a future for word clouds as the final slide of PowerPoint presentations? Will Tableau have a word cloud plugin tab thing? Also tree maps. That's a new feature also in Tableau.",
      "gist": "Word Clouds in Tableau 8",
      "headline": "Robert sees a future for word clouds as the final slide of PowerPoint presentations",
      "start": 4096314,
      "end": 4209964,
      "id": "ep_15_ch_19"
    },
    {
      "summary": "Robert: What are your influences? Andy Codgrave asks his influences. Ben Shneiderman certainly was a big influence. Rudolf Arnheim and his books on perception in art. Did that inspire implied dynamics research? Not directly.",
      "gist": "Influencers",
      "headline": "Andy Codgrave asks what are your early influences",
      "start": 4211424,
      "end": 4419894,
      "id": "ep_15_ch_20"
    },
    {
      "summary": "Lane Harrison asks how much work was it to prepare parallel sets for release. Robert: Was it worth it? I think so. I think it's always worth it to get stuff out there and have people play with it and see it and hopefully like it and find use.",
      "gist": "Preparation of Parallel Sets for release",
      "headline": "Lane Harrison asks how much work was it to prepare parallel sets for release",
      "start": 4421094,
      "end": 4573518,
      "id": "ep_15_ch_21"
    },
    {
      "summary": "Robert, I think we could keep talking for ages. It's been great having you here. Let's hope Tableau for Mac with that storytelling component is like, out in summer. We are looking forward to hear what are your next steps.",
      "gist": "A Taste of Storyboarding",
      "headline": "Robert, I think we could keep talking for ages. We just started. Yeah. We are talking for some time and it feels like",
      "start": 4573686,
      "end": 4649524,
      "id": "ep_15_ch_22"
    }
  ],
  "disfluencies": false,
  "entity_detection": false,
  "sentiment_analysis": false,
  "sentiment_analysis_results": null,
  "entities": null,
  "speakers_expected": null,
  "summary": null,
  "custom_topics_results": null,
  "episode_num": 15,
  "episode_metadata": {
    "speakers": [
      "Enrico Bertini",
      "Moritz Stefaner",
      "Robert Kosara"
    ],
    "WPid": "96",
    "url": "https://datastori.es/podlove/file/166/s/feed/c/mp3/datastories-15.mp3",
    "episode_title": "With Robert Kosara"
  }
}