{
  "id": "d4a4ae55-b97c-46cb-ae64-91a0c7a359d2",
  "language_model": "assemblyai_default",
  "acoustic_model": "assemblyai_default",
  "language_code": "en_us",
  "status": "completed",
  "audio_url": "https://datastori.es/podlove/file/222/s/feed/c/mp3/Datastories-01.mp3",
  "utterances": [
    {
      "end": 3814,
      "speaker": "Enrico Bertini",
      "start": 280,
      "text": "Hi everyone, this is Enrico and I'm here together with Moritz.",
      "id": "ep_1_ut_0"
    },
    {
      "end": 5910,
      "speaker": "Moritz Stefaner",
      "start": 3982,
      "text": "Hi everyone, this is Moritz.",
      "id": "ep_1_ut_1"
    },
    {
      "end": 35018,
      "speaker": "Enrico Bertini",
      "start": 6070,
      "text": "And here is our first episode of the Data Stories podcast, a podcast about data visualization that me and Moritz are doing together. And I think we are going to follow more or less always the same kind of outline. We have a number of plans and I really hope that you will enjoy it. And of course we are always waiting for comments and feedback about what we propose we do it. Moritz, how are you?",
      "id": "ep_1_ut_2"
    },
    {
      "end": 36790,
      "speaker": "Moritz Stefaner",
      "start": 35194,
      "text": "Yeah, I'm doing great, thanks.",
      "id": "ep_1_ut_3"
    },
    {
      "end": 42122,
      "speaker": "Enrico Bertini",
      "start": 37730,
      "text": "How is it going? What happened during the last week or couple of weeks?",
      "id": "ep_1_ut_4"
    },
    {
      "end": 92010,
      "speaker": "Moritz Stefaner",
      "start": 42266,
      "text": "Good, good. I mean, for me, the years, it's now slowly starting again. We moved houses in the beginning of January, so that of course consumed a lot of time. And now I'm back at the desk doing data with stuff. So this week, what did I do? Oh, I analyzed a muesli network. So which ingredients people use in Muesli's together. Wow. It's a little side project because I have this data set of customized muesli orders. I work on a spinny globe, like a 3d globe, which I usually try to avoid, but this time it's a good idea. And so we try to make that nice. And then I have a data set for working on web traffic and how people navigate on the web, but that's very much in the early stages.",
      "id": "ep_1_ut_5"
    },
    {
      "end": 96834,
      "speaker": "Enrico Bertini",
      "start": 92370,
      "text": "Okay, so it looks like you have no shortage of projects as usual.",
      "id": "ep_1_ut_6"
    },
    {
      "end": 100550,
      "speaker": "Moritz Stefaner",
      "start": 96882,
      "text": "No, and this week it was really lots of data, so I enjoy that.",
      "id": "ep_1_ut_7"
    },
    {
      "end": 101698,
      "speaker": "Enrico Bertini",
      "start": 100850,
      "text": "Yeah. Great.",
      "id": "ep_1_ut_8"
    },
    {
      "end": 102870,
      "speaker": "Moritz Stefaner",
      "start": 101754,
      "text": "What are you up to?",
      "id": "ep_1_ut_9"
    },
    {
      "end": 165990,
      "speaker": "Enrico Bertini",
      "start": 103210,
      "text": "Oh, this is a busy period during of the year. People start getting anxious about submissions to this week, I mean people in research, so you can feel it. Here in Konstanz, for instance, everyone starts being more time closed into their rooms and we discuss less and less and people are getting nervous. But I think it's normal, it happens every year. And I think in a week or so we are going to have a number of presentations about our projects for this week. And me personally, I have a number of projects and I'm really, really excited about them and I really hope that everything will go right. And I really like it because I'm collaborating, collaborating as usual with many different people. This is of course a lot of a big challenge because I have to keep track of everything. But I really like to work with many people and. Yeah, and I like to work with fantastic people and many of them are really, really fantastic. It's great.",
      "id": "ep_1_ut_10"
    },
    {
      "end": 175290,
      "speaker": "Moritz Stefaner",
      "start": 167090,
      "text": "And so you internally, you pitch your ideas first and present them and people critique them and then you try to work that into the papers.",
      "id": "ep_1_ut_11"
    },
    {
      "end": 203950,
      "speaker": "Enrico Bertini",
      "start": 175410,
      "text": "Yeah. To tell you the truth, I always wanted to have this kind of pitches a little bit before, because now it's a little bit late. You have to be in a stage of the project where you already have some initial results, some initial tests. So it's a little bit late, in my opinion. But we never managed to do it before, so it's better later than never. So it's still fine. It's still fine.",
      "id": "ep_1_ut_12"
    },
    {
      "end": 247878,
      "speaker": "Moritz Stefaner",
      "start": 204530,
      "text": "Cool. Maybe we should explain that a bit, because you did an interview with me half a year ago or so, and we thought it would be nice to continue that conversation because, I mean, you work as a visualization researcher, really, at a university, and you write papers and do science, and I represent more the practical side of infovys. So I have clients, I make jobs I sometimes close to advertisement also, and so we thought that would be nice to have that, and everybody agrees these two sides should have a dialogue and collaborations and so on. So we thought it could be nice to just make that a regular conversation. Right?",
      "id": "ep_1_ut_13"
    },
    {
      "end": 278610,
      "speaker": "Enrico Bertini",
      "start": 247974,
      "text": "Yeah, yeah. And the more I think about it, the more I think it's really, really useful. We really need to have more channels to let people from academia and from industry or design or similar fields talk to each other, because we are really experiencing a kind of explosion of visualization everywhere. You can really see it. If you have been into visualization during the last five or six years, like us, you can really see it. I think you agree Moritz, right?",
      "id": "ep_1_ut_14"
    },
    {
      "end": 279402,
      "speaker": "Moritz Stefaner",
      "start": 278690,
      "text": "Absolutely.",
      "id": "ep_1_ut_15"
    },
    {
      "end": 323140,
      "speaker": "Enrico Bertini",
      "start": 279506,
      "text": "It's really exploding. But at the same time, I think there is still quite a big divide between people and we need to talk and we need to clarify many things. And I think that these kind of exchanges is mutually beneficial. And regarding the idea of the podcast, I think when we did this interview, I think it was really nice. We had a lot of fun, and as you said, we had lots of good feedback and people seemed to like our perspectives and our discussions, and I think it would be really, really nice. And as far as I know, there are no podcasts around about data visualization and. Yeah, and I hope we will have a lot of competition, actually.",
      "id": "ep_1_ut_16"
    },
    {
      "end": 325610,
      "speaker": "Moritz Stefaner",
      "start": 324270,
      "text": "Yeah, that would be nice.",
      "id": "ep_1_ut_17"
    },
    {
      "end": 362950,
      "speaker": "Enrico Bertini",
      "start": 326750,
      "text": "So this is, I think it's also an invitation to people to do more and to try to discuss more about visualization, because my feeling is that we have lots of visualizations around, some are good, some are medium, some are bad, but we are not discussing enough about the core issues that we have in visualization. And I really hope that this podcast will be a way to, together with our blogs or other blogs, would be a way to let people think more about how to do visualization and how to make it even better in the future.",
      "id": "ep_1_ut_18"
    },
    {
      "end": 474666,
      "speaker": "Moritz Stefaner",
      "start": 363610,
      "text": "Yeah, absolutely. So we also, our idea for the podcast is that we have one central theme per episode, or maybe two sometimes, where we would gather some material and also maybe ask our listeners for opinions or so. And this week, one thing I came across, it was on, let's say, two days in a row, I think Wednesday and Thursday, we had two quite similar visualizations. One was the deluge visualization. It's mapping moves within Norway, like where people moved from which city to where else. And the other one was a GE installation by Ben Fry studio fathom. And they did two very, let's say, ambient visualizations for the lobby of different GE relevant activities. Like, I think the one was about worldwide scans, CT scans, and the other one was about power turbines and so on. And both of them were like extremely shiny and animated, and particles were flying around. And on Twitter I was referring to them as exuberant data kitsch, because I think this is what it is in the end. But I also had to admit, it's hard to not be impressed by that. It is mesmerizing and enjoyable to see these flying particles. And so there is a big attraction going out from these things. But at the same time, I often think like, ah, it's, you watch it for three minutes, there's some nice music in the background, and you see lots of things moving, and you have a positive impression of the process because you think, oh, it's so organic and cool. But then in the end, the big question is obviously, what have you learned? Right? What have we learned?",
      "id": "ep_1_ut_19"
    },
    {
      "end": 490898,
      "speaker": "Enrico Bertini",
      "start": 474818,
      "text": "Yeah. And these are not the only examples. There are many others that are basically using the same technique. Right. There is a very nice article from Andy Kirk from visualizing. What's the name of this block? Sorry.",
      "id": "ep_1_ut_20"
    },
    {
      "end": 491754,
      "speaker": "Moritz Stefaner",
      "start": 491034,
      "text": "Visualizing data.",
      "id": "ep_1_ut_21"
    },
    {
      "end": 559900,
      "speaker": "Enrico Bertini",
      "start": 491802,
      "text": "Visualizing data, yeah. And. Yeah. And it looks like there are many, many examples around. And people love it. I mean, of course. I mean, I love it, too. I have your same concerns, but I cannot help but say wow, when I see some of them. So I think we have this kind of tension between the beauty of it and I, the need of communicating some kind of information out of it. I mean, I think we have three kind of layers. We normally have a debate between, or maybe we have visualizations whose main purpose is to communicate something, and some other visualizations that are more for data analysis and exploration. But I think here we have also our third kind of visualization that is more really like to impress people. Of course, it's more on the side of communication, but some of them don't really communicate anything special other than, wow, that's cool, that's beautiful.",
      "id": "ep_1_ut_22"
    },
    {
      "end": 632982,
      "speaker": "Moritz Stefaner",
      "start": 560020,
      "text": "Yeah, I mean, if you put it negatively, it's a request I get often is just show how much we are doing. So often this is the briefing for a visualization. Just show how much we're doing or how much revenue we make or how much, how much, how much. And obviously, if you're just focusing on, we want to show that there's a lot of things we are selling or there's a lot of things we are doing. Of course you end up with a visualization where you have lots of particles flying around and it's just an impressive mass of something. Right. But I mean, the positive thing is, I mean, if, I mean, Aaron Koblin and his flight patterns, he did maybe in 2003, four or five, something like this, and he mapped all the flights within the US. And there was really, it's the same principle, it's just particles flying around, but because they had trails and because he rendered them very high res, you had both that sense of, okay, it's amazing, it's so organic, and you have that bird's eye view, you know, over such a big data set. That's such a wonderful feeling. But at the same time you could zoom in and see individual patterns. And he highlighted them quite nicely on.",
      "id": "ep_1_ut_23"
    },
    {
      "end": 770140,
      "speaker": "Enrico Bertini",
      "start": 633006,
      "text": "The page, I must say that. So, for instance, you sent to me some examples in preparation for this podcast, and I went through them for a while. And I must say that even within just exploring those visualizations that use this same technique, some of them are better than others. And yeah, I'm sorry to say that, but as usual, I think that the results that come from research can help us understanding what's the best way of doing things. And I must say that at least looking at them, those that use some kind of 3d visualization seems to be less informative than those that use 2d visualization. So, for instance, if you take the one about how is it called about the spread of Walmart in the United States, this is a pretty basic visualization. Nothing really too fancy. It's two d and you still get this wow effect. But I think it's also a lot more informative than other kind of visualizations that use this same technique. And yeah, I think you can see it also. What was it? The visualization about the turbines. And that one is really, really cool. There is some nice music behind and you can really, you are very much involved and impressed by the visualization, but I couldn't really get anything out of it. Nothing? Yeah, I mean, it's 3d timed series arranged in a strange manner around in a circular layout or something. And I couldn't really get anything other than, wow, this is a graphic that is based on some data. And again, don't get me wrong, I really liked it, it's beautiful. But if I have to compare the same technique used in different visualizations, then I would say that again, you can see a difference between where the technique is used, taking into account some design principles and others that seem to be less careful in this respect. What do you think?",
      "id": "ep_1_ut_24"
    },
    {
      "end": 878320,
      "speaker": "Moritz Stefaner",
      "start": 770440,
      "text": "Oh, absolutely. And I mean, there's also a difference in what data set you use, and often you see it used for geospatial networks. So we had an example with microloans, where people from one country would lend money to people from other countries, or the deluge, where we have people moving from one place to the other. And I think that's a bit different than, for instance, than what Nathan yo. From flowing data did with the Walmart spread, because they just have intensities for different places at a given time. And I think for the toughest part is really these networks, these geospatial networks, because there you have the map and things are moving across the map and you don't know where they start and where they end, and you just get the general sense of things flying around. That makes it even harder. But then again, these things are, I mean, that's the hardest thing anyway, is mapping a network onto the world. You cannot do that, right? Basically, whatever you try. And so I'll take it easy on these ones. But just for instance, for the moving, I did a visualization one and a half years ago. It's called map your moves. And I really tried to avoid showing all the lines or showing all the movements of individual people and thought more about, okay, let's look at each district or each county or so, and look at how many people move in and out. So you can just take the problem abstracted on one level and say, I'm not interested in the individual move and how far it was at the same time for all of them, but in the beginning, maybe more in the sums and the averages, and then once you zoom in or you drill in, then you can show all the individual moves, right?",
      "id": "ep_1_ut_25"
    },
    {
      "end": 976450,
      "speaker": "Enrico Bertini",
      "start": 880060,
      "text": "Yeah. I think that another interesting aspect that came into my mind while watching this, these movies, is that as far as I understand or as far as I know, nobody tried so far to use animation in a way that it can be used interactively or in the context of a more explorative kind of tool. So kind of animation on demand or something like that. Especially I was thinking about those visualization with particles that show people or goods moving from one country to another. I think this is really, really effective in conveying the direction of the flow, which normally is not easy to represent. I've been doing some research on that with a student I'm collaborating with in Switzerland, and we tried many different kind of mappings. And I must say that animation, in terms of using this particle animation, in the sense of using it as a way to show the direction of the flows, is really, really effective. So what I think is that there is also a lack of exploration of some of these animation tricks in more interactive environments and more controlled environments, because all these examples are basically visualizations that are used for communication purposes. So you press play and you see the animation. But my feeling is that animation itself could be used in a more interesting and complex way in interactive environments.",
      "id": "ep_1_ut_26"
    },
    {
      "end": 985966,
      "speaker": "Moritz Stefaner",
      "start": 977910,
      "text": "So it wouldn't just show development over time, but also some other parameters or. What do you have in mind there?",
      "id": "ep_1_ut_27"
    },
    {
      "end": 1019370,
      "speaker": "Enrico Bertini",
      "start": 986158,
      "text": "I have in mind something like, I would call it something like user controlled animation in a way that users can not only, of course, the basic, the basic functionality would be to start and stop the animation. Okay, but this is trivial. But you can imagine things like, I don't know, mapping different kinds of attributes to the animation or speeding up or slowing down the animation, or, I don't know.",
      "id": "ep_1_ut_28"
    },
    {
      "end": 1023402,
      "speaker": "Moritz Stefaner",
      "start": 1019530,
      "text": "I think maybe also to go more in the direction of a simulation. Really?",
      "id": "ep_1_ut_29"
    },
    {
      "end": 1023818,
      "speaker": "Enrico Bertini",
      "start": 1023506,
      "text": "Yeah.",
      "id": "ep_1_ut_30"
    },
    {
      "end": 1057454,
      "speaker": "Moritz Stefaner",
      "start": 1023874,
      "text": "There was, a few years ago, there was a really interesting Kai video. So it was a research project presented at Kai, the interaction conference. And they made movie controls where you wouldn't control a slider to tell the movie where to jump to, but you could manipulate the objects in the scene. So maybe there was a car and was parked somewhere, and you don't know when the car leaves the parking spot, but you could grab the car and drag it out of its parking spot, and the movie would jump to the position where the car started moving, you know?",
      "id": "ep_1_ut_31"
    },
    {
      "end": 1058314,
      "speaker": "Enrico Bertini",
      "start": 1057532,
      "text": "Yeah, yeah, yeah, sure.",
      "id": "ep_1_ut_32"
    },
    {
      "end": 1073922,
      "speaker": "Moritz Stefaner",
      "start": 1058362,
      "text": "And so you could grab a data point and say, let's, I want to see when this one drops. Right. And then, so you would make it drop and then sort of the rest of the simulation. Or the movie would jump to the right state, sort of. That's an interesting approach.",
      "id": "ep_1_ut_33"
    },
    {
      "end": 1074634,
      "speaker": "Enrico Bertini",
      "start": 1074106,
      "text": "Yeah.",
      "id": "ep_1_ut_34"
    },
    {
      "end": 1083202,
      "speaker": "Moritz Stefaner",
      "start": 1074722,
      "text": "What else can you do to avoid these flying particle exuberant data kitsch, shininess well, I've been.",
      "id": "ep_1_ut_35"
    },
    {
      "end": 1138888,
      "speaker": "Enrico Bertini",
      "start": 1083306,
      "text": "I must say that this is a topic that really attracts me from the research point of view. I've actually been doing some kind of research on this topic recently, again together with this student and another colleague in Switzerland. And we have been working mainly on flow maps. And we started investigating how to compare animated version of flow maps with static version of flow maps. The obvious, or maybe not so obvious alternative is to use small multiples. This is always true, right? Every time you have an animation, you can either. Every time you have something that develops through, over time, you can either animate it or use small multiples by taking still pictures at regular intervals, right?",
      "id": "ep_1_ut_36"
    },
    {
      "end": 1144510,
      "speaker": "Moritz Stefaner",
      "start": 1138944,
      "text": "Yeah. It's like taking a snapshot of your movie every second or so and put them in a row, right?",
      "id": "ep_1_ut_37"
    },
    {
      "end": 1396890,
      "speaker": "Enrico Bertini",
      "start": 1144590,
      "text": "Yeah, exactly. And what is really interesting is that actually, as soon as I started doing research in this area, I realized that there is a lot of research already done in the past, and some, some papers are really, really interesting. So one thing I can say is that after reading this large literature, it looks like animation is really, really tough topic because the different papers come to different conclusions. So in some cases, animation seems to be better. In some other cases, it seems to be very bad. And lots of people compared basically animation to, basically to small multiples or other forms of static visualizations and. Yeah, and there are a number of papers. There are, I want to mention at least three of them, which are really, really nice. So there is a very famous one that is called animation. Can it facilitate by Tversky and other people from Stanford. And this is a paper from 2002, and it summarizes a lot of research around animation. So I must say that this paper is not focusing only on animation and visualization. Is animation in, I would say, user interfaces or any visual depiction of complex processes. And from their point of view, it looks like animation is really bad. So it looks like there is a lot of research demonstrating that animation just doesn't work. So, for instance, there are lots of studies about using animation to explain to people how a complex process works or how to, I don't know, how to build something, you know, this kind of instructions that you have from IKEA, how to build a chair out of these pieces. And it looks like that animation just doesn't work as well as you might think. Okay. But then there are a number of studies that are more focused on animation as when used for visualization. So there are a number of studies demonstrating that visualization is really sorry, that animation is really, really good when you use it for observing the transition of the visualization from one state to another? Yes, of course, in this case, it helps a lot to connect one state of the visualization to another when you have some kind of changes, when you change a view, for instance, or maybe you change a layout, in this case, it's really, really useful. But then as soon as you try to use visualization with the purpose of getting some kind of insights out of data. So animation is actually used to represent some aspects of the data, then there are some controversies. It's not clear. So there is a very nice paper from 2008 published, I think this was an infovis paper and by Robertson and another people, another bunch of people. And this was about, it's called effectiveness of animation in trend visualization. And again, here it looks like animation is not really good. And this study is particularly nice because they compare some visualizations that are similar to Hans Rosling kind of visualizations. And again, it looks like the animation is not that good in this respect. I think if I remember well, I hope I'm not wrong. I would have to check it. They have one study that is more on how to use animation to detect some trends for exploratory purposes, and another study is more for presentation purposes, which is closer to the way Ans Rosalind used animation in his talks. Right. And if I remember well, in that case, animation has an advantage.",
      "id": "ep_1_ut_38"
    },
    {
      "end": 1430536,
      "speaker": "Moritz Stefaner",
      "start": 1398550,
      "text": "That was my hunch, too, that, I mean, it is strongly connected to that idea. I mean, our podcast is called data stories, right? And this whole discussion about narratives and about telling the stories in the data, it is an important one because a story is a powerful device to transport something. And if you look at, for instance, the Walmart map, it is exciting. You know, you have in the beginning the void, the empty map, and then a few dots pop up and you're just excited to see how will it go on. Right.",
      "id": "ep_1_ut_39"
    },
    {
      "end": 1431080,
      "speaker": "Enrico Bertini",
      "start": 1430688,
      "text": "Yeah.",
      "id": "ep_1_ut_40"
    },
    {
      "end": 1479430,
      "speaker": "Moritz Stefaner",
      "start": 1431120,
      "text": "And you don't have, and that's the story part that you're sort of, you're taking part in that journey through time and you don't know what comes next. And of course, if you have. Yeah. That's experiencing a story. Right. And if you have the small multiples or the trails or any other principle that shows you everything at once already, and you can go back and forth and you have the perfect overview, it's like spoiling the end of a joke, of a joke, you know? Yes, there's no more excitement. It's all there. It's just the cold, naked truth. And so I think part of the attraction really, of these animated maps. Is this. How will it end? You know, this feeling?",
      "id": "ep_1_ut_41"
    },
    {
      "end": 1547606,
      "speaker": "Enrico Bertini",
      "start": 1480250,
      "text": "Yeah, yeah. And I think, yeah. I just wanted to mention one last piece of research which actually complement what I said before, because so far I mentioned only studies that are actually against animation. But there is another one that is really, really fascinating that is called, let me see. It's a long title, a comparison of an animated maps with static, small, multiple maps for visually identifying space time clusters and what is. Okay, it's a little bit complex, but I'll try to make it simple. So what these people tried to do was to come up with some kind of animated maps, but it's more abstract than simple maps. And they artificially inject some clusters on top of these maps and they can actually control the speed with which these clusters change their position and shape and how distinguishable they are from the background. Okay.",
      "id": "ep_1_ut_42"
    },
    {
      "end": 1548510,
      "speaker": "Moritz Stefaner",
      "start": 1547758,
      "text": "Okay.",
      "id": "ep_1_ut_43"
    },
    {
      "end": 1608404,
      "speaker": "Enrico Bertini",
      "start": 1548670,
      "text": "And what is really remarkable of this study is that they demonstrated that some specific patterns can be detected a lot better, or even only by using animation. So the intuition here is that when the goal is to detect some specific changes in time, then it looks like our brain or our eyes are particularly tuned to see differences only when these differences are animated. And I think this is really, really fascinating. And I think there is a lot of. There is a lot of research to do in this area. And you can see some of it in these examples, in these animated visualizations, because sometimes you have some strange things that pops up somewhere and you immediately notice it. And I'm not sure if you would notice if you have a small multiple equivalent of this visualization.",
      "id": "ep_1_ut_44"
    },
    {
      "end": 1636450,
      "speaker": "Moritz Stefaner",
      "start": 1608572,
      "text": "For instance, if you have something like periodic patterns, but the period is not what you chose for your small multiple interval. Right. Then you would immediately see it in the visualization. Something splinking there or something like this. You would immediately see that in the animation, but you wouldn't see it maybe in the more condensed multiples version. So in the end, it will depend a lot on your data set, as always.",
      "id": "ep_1_ut_45"
    },
    {
      "end": 1656680,
      "speaker": "Enrico Bertini",
      "start": 1637070,
      "text": "But I think we shouldn't. I think we should keep encouraging people doing animated visualizations. I think it's really nice. Sometimes it looks like eye candy, right, as usual. But it's not just animation. You can have other kinds of visualizations that are a little bit of eye candy, right?",
      "id": "ep_1_ut_46"
    },
    {
      "end": 1672200,
      "speaker": "Moritz Stefaner",
      "start": 1656840,
      "text": "Sure. Yeah, yeah, yeah. But I mean, my tendency is. I mean, for instance, when I teach or so, and people come to me with their plan of a world map where lights appear and disappear, I usually say, go on thinking, this is not the end yet.",
      "id": "ep_1_ut_47"
    },
    {
      "end": 1706734,
      "speaker": "Enrico Bertini",
      "start": 1673340,
      "text": "Yeah, yeah. But, you know, there are a number of traditional controversies in visualization. So I can name animation versus static and I think researchers are pretty much consistently against animation, but I'm not convinced. I think there is much more to do in this direction. And the other classic is 3d versus 2d. Right. This is even more outrageous. I think if you ask to any researchers in the field, this person would say, ah, 3D is. Is bullshit. Right?",
      "id": "ep_1_ut_48"
    },
    {
      "end": 1718862,
      "speaker": "Moritz Stefaner",
      "start": 1706782,
      "text": "Yeah, yeah. Now, if you, if you publish a 3d visualization that is not on a 3d data set, I think you will lose your job if you have a traditional researchers job. Right. And I think that you will be fired. Yeah, yeah.",
      "id": "ep_1_ut_49"
    },
    {
      "end": 1723400,
      "speaker": "Enrico Bertini",
      "start": 1718886,
      "text": "The best you can do is to try to publish an animated 3d visualization.",
      "id": "ep_1_ut_50"
    },
    {
      "end": 1727484,
      "speaker": "Moritz Stefaner",
      "start": 1724780,
      "text": "You should do that. Yeah. And a different name, maybe.",
      "id": "ep_1_ut_51"
    },
    {
      "end": 1748280,
      "speaker": "Enrico Bertini",
      "start": 1727612,
      "text": "But again, who knows? Maybe there are cases, there are cases where I don't like to be too orthodox. Right. I mean, I think we should be open to cases where some solutions might actually work and maybe there is some space somewhere for animated 3d visualizations. Right?",
      "id": "ep_1_ut_52"
    },
    {
      "end": 1770742,
      "speaker": "Moritz Stefaner",
      "start": 1750110,
      "text": "Yeah. And it's really an interesting case because it's something that everybody loves who is not in the research field. And it's really something where you approach a researcher and say, listen, I made this animated world map. And they go like, uh huh. So it's. Yeah, it's in a sense a classical topic. You're right about that.",
      "id": "ep_1_ut_53"
    },
    {
      "end": 1786640,
      "speaker": "Enrico Bertini",
      "start": 1770806,
      "text": "Yeah, yeah, yeah. And I think there is also a lot to do in terms of the power of engaging people with animation. I mean, it's evident that animation has super powers in terms of engagement. Right?",
      "id": "ep_1_ut_54"
    },
    {
      "end": 1787772,
      "speaker": "Moritz Stefaner",
      "start": 1787020,
      "text": "Absolutely.",
      "id": "ep_1_ut_55"
    },
    {
      "end": 1788172,
      "speaker": "Enrico Bertini",
      "start": 1787836,
      "text": "Yeah.",
      "id": "ep_1_ut_56"
    },
    {
      "end": 1794000,
      "speaker": "Moritz Stefaner",
      "start": 1788236,
      "text": "You can't stop watching. It's the same for me. I want to watch that. Yeah, of course.",
      "id": "ep_1_ut_57"
    },
    {
      "end": 1804800,
      "speaker": "Enrico Bertini",
      "start": 1794980,
      "text": "I think maybe we humans have a natural tendency towards animated, towards tv or maybe just towards tv, who knows?",
      "id": "ep_1_ut_58"
    },
    {
      "end": 1817756,
      "speaker": "Moritz Stefaner",
      "start": 1806140,
      "text": "Information tv. Yeah. But I think that's the danger really, is that it's just, you know, entertaining you and not much more is happening, but. Yeah, yeah.",
      "id": "ep_1_ut_59"
    },
    {
      "end": 1819560,
      "speaker": "Enrico Bertini",
      "start": 1817788,
      "text": "But entertaining is not bad.",
      "id": "ep_1_ut_60"
    },
    {
      "end": 1821640,
      "speaker": "Moritz Stefaner",
      "start": 1820060,
      "text": "It's a good start, at least.",
      "id": "ep_1_ut_61"
    },
    {
      "end": 1837790,
      "speaker": "Enrico Bertini",
      "start": 1823300,
      "text": "I'm not against entertainment, as long as it's clear this is for entertaining. But if you try to sell something, if you do something that is entertaining and not informative, and then you sell it as informative, then we have a problem. Right?",
      "id": "ep_1_ut_62"
    },
    {
      "end": 1842290,
      "speaker": "Moritz Stefaner",
      "start": 1837830,
      "text": "Yeah. So do we have a new genre here, data entertainment?",
      "id": "ep_1_ut_63"
    },
    {
      "end": 1843966,
      "speaker": "Enrico Bertini",
      "start": 1842670,
      "text": "Sorry, I couldn't hear you.",
      "id": "ep_1_ut_64"
    },
    {
      "end": 1847966,
      "speaker": "Moritz Stefaner",
      "start": 1843998,
      "text": "Do we have a new genre here? Data entertainment?",
      "id": "ep_1_ut_65"
    },
    {
      "end": 1853070,
      "speaker": "Enrico Bertini",
      "start": 1848158,
      "text": "Why not? We have data art and we could have data entertainment.",
      "id": "ep_1_ut_66"
    },
    {
      "end": 1859108,
      "speaker": "Moritz Stefaner",
      "start": 1853190,
      "text": "Yeah, it's a new profession. In ten years you can study data entertainment. Who knows?",
      "id": "ep_1_ut_67"
    },
    {
      "end": 1866288,
      "speaker": "Enrico Bertini",
      "start": 1859254,
      "text": "Yeah, I'm not against it. I'm not necessarily against it. As long as it is clear and well crafted, of course. Right?",
      "id": "ep_1_ut_68"
    },
    {
      "end": 1891892,
      "speaker": "Moritz Stefaner",
      "start": 1866344,
      "text": "Sure. Yeah. Cool. Yeah, it's interesting. I'm always torn apart as well. It's like I love them and I hate them, but then there's something to it, probably. Yeah. One other thing. Should we get to the next topic? Because we have one, let's say half topic still in the back burner, and we want to keep the first one short and sweet so I don't have to do so much audio editing work. Hopefully we are all newbies.",
      "id": "ep_1_ut_69"
    },
    {
      "end": 1953644,
      "speaker": "Enrico Bertini",
      "start": 1892036,
      "text": "Yeah. I think we should just introduce this topic and maybe we will discuss it more in depth during our next episode. So this could also be a way to get more feedback from the, from the listeners and hoping that there will be some. I hope so. So if you are listening to this podcast, please show up and let us know that you are listening. And if you want to send some feedback and questions, we would really, really love to get some. So our one thing that we wanted to start discussing, at least in this episode, is. Yeah, what's the matter with these visualization contests and marathons or similar stuff? I think here again, we have some mixed feelings, I think. I think. I don't know, Moritz. I think we both agree that there are some good and bad aspects and we would like to discuss more these kind of processes.",
      "id": "ep_1_ut_70"
    },
    {
      "end": 2001160,
      "speaker": "Moritz Stefaner",
      "start": 1953692,
      "text": "I mean, the whole contest idea, I think it just came up a year ago or maybe two years. Can't remember even what the first visualization contest was. I mean, there have always been the vast challenges in the academic world, but the first, let's say, popular visualization contest, so it's not that long ago. And then over the last year, we saw announcements every two weeks, literally. I mean, not just, you know, I'm not exaggerating, but there's, every two weeks there's like a contest. And it was interesting to see, like how the different contests fared and how, how different the outcomes were. And often, of course, if you have that much contests, you have, the quality is sometimes nothing. That's great. But still, people get a gold medal and thousands of dollars or whatever.",
      "id": "ep_1_ut_71"
    },
    {
      "end": 2005920,
      "speaker": "Enrico Bertini",
      "start": 2003260,
      "text": "Do you think we are in a contest overload?",
      "id": "ep_1_ut_72"
    },
    {
      "end": 2026428,
      "speaker": "Moritz Stefaner",
      "start": 2007780,
      "text": "Yeah, I think so, if you ask me that directly. But I mean, who does it hurt? I mean, you know, it's not that it would affect me personally, but if you ask me, if I had, if I could like, reduce the number of contests to the half and increase the quality, I would do that in a.",
      "id": "ep_1_ut_73"
    },
    {
      "end": 2061097,
      "speaker": "Enrico Bertini",
      "start": 2026444,
      "text": "Snap, I must say. A few days ago, I tweeted something about the last prize given the visualizing. Visualizing marathons. And I actually regret it because I did it a little bit in a hurry. I have to learn to wait before tweeting something that is even slightly bad. But I was really impressed. This was kind of, I was a little bit involved in these visualizing marathons. For one of the marathons, the one in Berlin, I think you were involved as well, right?",
      "id": "ep_1_ut_74"
    },
    {
      "end": 2063601,
      "speaker": "Moritz Stefaner",
      "start": 2061113,
      "text": "You were a speaker, you were a judge. So, yeah.",
      "id": "ep_1_ut_75"
    },
    {
      "end": 2088358,
      "speaker": "Enrico Bertini",
      "start": 2063665,
      "text": "And yeah, maybe I will tell something about the process during the next episode, but I just want to tell that then I saw the result from the. So they published the result that comes from the best of the best. So they decided which visualization was the best among all the marathons that they had. I think they had how many? Five or six marathons around the world.",
      "id": "ep_1_ut_76"
    },
    {
      "end": 2089530,
      "speaker": "Moritz Stefaner",
      "start": 2088374,
      "text": "Oh, yeah, yeah, yeah.",
      "id": "ep_1_ut_77"
    },
    {
      "end": 2168592,
      "speaker": "Enrico Bertini",
      "start": 2089830,
      "text": "And this is, this is supposed to be the best of the best. So I clicked. I was really curious. And the first impression is like, oh, 3d cubes to represent demographic data or something like that. And it was kind of, yeah, I don't know, because I don't know. On the one hand. So what actually happened is that. But after a few seconds, I tweeted something like, if this is the best we can get out of more than 300 students in six countries, we have a problem here. And then I received some criticism and also some appreciation, but I think that's not the point. And so I don't know. I think that these people from visualizing.org, comma, they are doing a very, very interesting job and I'm really supportive of their job. But at the same time, I have some concerns and I think this is true for any other kind of marathon or contest. I think we are in this state where we have a little bit of overload of, as we said, a little bit of contest overload, and it's not clear whether, what are the benefits? And I don't know. So far the results seems to be a little bit disappointing. I don't know.",
      "id": "ep_1_ut_78"
    },
    {
      "end": 2189696,
      "speaker": "Moritz Stefaner",
      "start": 2168736,
      "text": "Yeah, I mean, there's many sides to that and probably we could actually really discuss the whole episode just about it, but I think it's hard to judge a contest just based on the winner. So, because there's always a jury and there's always a certain process to how they got to the result. And you don't, you don't always know how it went, right?",
      "id": "ep_1_ut_79"
    },
    {
      "end": 2190320,
      "speaker": "Enrico Bertini",
      "start": 2189808,
      "text": "Yeah, yeah.",
      "id": "ep_1_ut_80"
    },
    {
      "end": 2207982,
      "speaker": "Moritz Stefaner",
      "start": 2190360,
      "text": "And so, but what we can judge is the process. If the process of selection is, you know, is okay or is it. It's a bit like an election, like a democratic election, you cannot say, I don't like the president. So this election sucks. But you can at least look at if the election goes okay.",
      "id": "ep_1_ut_81"
    },
    {
      "end": 2209446,
      "speaker": "Enrico Bertini",
      "start": 2208046,
      "text": "Yeah, yeah, yeah.",
      "id": "ep_1_ut_82"
    },
    {
      "end": 2262822,
      "speaker": "Moritz Stefaner",
      "start": 2209598,
      "text": "But, yeah. And the other thing is really, I mean, these contests, I think the way they are, they are set up. It's targeting really only a small number of people, which is students who are, let's say, proficient enough to do visualizations in like days or hours sometimes, but still have the time to do that. And so they're not like close to their graduation or they don't have a job. And for me, it doesn't work usually, you know, to spend like days and weeks on a dataset and for the vague prospect of maybe winning a book or something. And so I, maybe that's also a problem. It's really, it's focused on a very small demographic, actually, you know, who can take part in these things. And then, of course, you get the same submissions, the same styles of submissions all over, and then things get a bit boring.",
      "id": "ep_1_ut_83"
    },
    {
      "end": 2303516,
      "speaker": "Enrico Bertini",
      "start": 2262886,
      "text": "Yeah, yeah, yeah. I don't want to spoil the next, the next episode. But another thing I can say, I can tell is that many, so, of course, I shared this, some of my criticisms with some people out there, and some of them, they say, yeah, but you have to take into consideration that these are students and they have to do this thing in 24 hours. And of course, it's hard to come up with something sophisticated. And I fully agree. I understand. It's fine. But I don't know. Let's take this. What was named the grand prize winner?",
      "id": "ep_1_ut_84"
    },
    {
      "end": 2304560,
      "speaker": "Moritz Stefaner",
      "start": 2303648,
      "text": "I think so.",
      "id": "ep_1_ut_85"
    },
    {
      "end": 2331100,
      "speaker": "Enrico Bertini",
      "start": 2307740,
      "text": "Librum, something like that. What was the name of this visualization? I don't remember. Okay. It doesn't take much time to, it actually doesn't take any time to know that using a cube is not the best way to visualize data. Or at least it's not. Shouldn't be the first idea that comes into your mind, right?",
      "id": "ep_1_ut_86"
    },
    {
      "end": 2348752,
      "speaker": "Moritz Stefaner",
      "start": 2331720,
      "text": "Yeah, but did you see the video, the explanatory video? So there's a story behind the cube. You know, it's like a Rubik's cube, but it's, the idea is you have to balance it. Right? Otherwise it falls, stuff like that. So there's sort of a, there's a, let's say a metaphorical reasoning behind the cube. Metaphor.",
      "id": "ep_1_ut_87"
    },
    {
      "end": 2349808,
      "speaker": "Enrico Bertini",
      "start": 2348856,
      "text": "Okay. Yeah, it's possible.",
      "id": "ep_1_ut_88"
    },
    {
      "end": 2353800,
      "speaker": "Moritz Stefaner",
      "start": 2349864,
      "text": "So I can see how they, I can see why they did it. So.",
      "id": "ep_1_ut_89"
    },
    {
      "end": 2365012,
      "speaker": "Enrico Bertini",
      "start": 2353880,
      "text": "Okay. Yeah, sure, sure. Maybe we can discuss it more during our next episode. It's possible that it was even too superficial. I don't know. But the first impression from my side was bad. I have to say that it was bad.",
      "id": "ep_1_ut_90"
    },
    {
      "end": 2424972,
      "speaker": "Moritz Stefaner",
      "start": 2365116,
      "text": "And I mean, a winning visualization, you're right. I mean, out of 300 people award, I mean, you should look at it and say, wow, that's amazing, before you even understand what it is. And if you say what cubes, maybe something is wrong about it. What I was just thinking is maybe we shouldn't have experts evaluating the results and five people sitting in one room, but more really test visualizations and maybe also contest submissions to how well they actually work. No idea how that works logistically, but I mean, we're just always talking about the theoretical, you know, impact or how it according to principles. But I mean, the interesting story would be what happens if you show that to 50 people and if you show the animated movie to 50 people, what have they actually learned? Or nothing. Maybe that should be the criterion. I don't know how to measure that without like spending weeks, but maybe it's.",
      "id": "ep_1_ut_91"
    },
    {
      "end": 2435676,
      "speaker": "Enrico Bertini",
      "start": 2425076,
      "text": "Yeah, yeah. The point is always going beyond the wow effect, right. So the first impression is always wow or cool and, or stuff like that.",
      "id": "ep_1_ut_92"
    },
    {
      "end": 2458166,
      "speaker": "Moritz Stefaner",
      "start": 2435868,
      "text": "And I'm just thinking Andrew Vande Moere, he does some research on, or he, you know, over the last few years he has been trying to quantify, or at least not necessarily quantify, but factor in the aesthetic effect of visualizations. So, yeah. We could have an episode with him discussing absolutely the difficulties there.",
      "id": "ep_1_ut_93"
    },
    {
      "end": 2463350,
      "speaker": "Enrico Bertini",
      "start": 2458358,
      "text": "Yeah. I cannot think of a better person to talk about aesthetics than.",
      "id": "ep_1_ut_94"
    },
    {
      "end": 2468446,
      "speaker": "Moritz Stefaner",
      "start": 2463390,
      "text": "Yeah, true. Absolutely. Absolutely. Cool. Cool.",
      "id": "ep_1_ut_95"
    },
    {
      "end": 2486860,
      "speaker": "Enrico Bertini",
      "start": 2468638,
      "text": "I think we can stop here. It's more than 40 minutes. I think it's fine. And I just want to repeat once again that our next episode. No, actually we didn't say that we plan to have episodes every two weeks. Right?",
      "id": "ep_1_ut_96"
    },
    {
      "end": 2490056,
      "speaker": "Moritz Stefaner",
      "start": 2487200,
      "text": "Yeah, yeah. So that's the plan.",
      "id": "ep_1_ut_97"
    },
    {
      "end": 2500048,
      "speaker": "Enrico Bertini",
      "start": 2490208,
      "text": "That's the plan. And again, if you are listening to the podcast, we would really, really love to get your feedback, even if it's bad. So please, if there is anything you.",
      "id": "ep_1_ut_98"
    },
    {
      "end": 2501216,
      "speaker": "Moritz Stefaner",
      "start": 2500064,
      "text": "Don't like, especially if it's bad.",
      "id": "ep_1_ut_99"
    },
    {
      "end": 2516420,
      "speaker": "Enrico Bertini",
      "start": 2501248,
      "text": "Yeah, I think especially if it's bad, please feel free to say, oh, it doesn't work. We want things differently, or you are just sucks, you guys suck so much.",
      "id": "ep_1_ut_100"
    },
    {
      "end": 2529758,
      "speaker": "Moritz Stefaner",
      "start": 2516800,
      "text": "Stop sucking. But we really have no big experience with podcasts and it's always hard to judge yourself. And so, any tips for improvements? We are happy.",
      "id": "ep_1_ut_101"
    },
    {
      "end": 2566588,
      "speaker": "Enrico Bertini",
      "start": 2529854,
      "text": "Yeah. And we would really love to receive not only feedback, but also questions or any kind of inspiration for follow up episodes. So if you have anything to say about these marathons and contests that we are going to discuss during our next episode, please feel free to to send a message. And also, if you have any ideas about things that you would like us to discuss during any of the following episodes, please feel free to suggest. We are really, really open to suggestions. Let's go back to work.",
      "id": "ep_1_ut_102"
    },
    {
      "end": 2571172,
      "speaker": "Moritz Stefaner",
      "start": 2566644,
      "text": "Absolutely. Lots of muslim networks waiting for me.",
      "id": "ep_1_ut_103"
    },
    {
      "end": 2580750,
      "speaker": "Enrico Bertini",
      "start": 2571276,
      "text": "Yeah. And me. A bunch of papers to read. Yeah. Have a good weekend and same to you. Yeah. See you.",
      "id": "ep_1_ut_104"
    },
    {
      "end": 2582554,
      "speaker": "Moritz Stefaner",
      "start": 2581410,
      "text": "Bye bye, everybody.",
      "id": "ep_1_ut_105"
    },
    {
      "end": 2584550,
      "speaker": "Enrico Bertini",
      "start": 2582642,
      "text": "Bye. Bye. Bye.",
      "id": "ep_1_ut_106"
    }
  ],
  "confidence": 0.931268429280021,
  "audio_duration": 2672,
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_status_code": null,
  "webhook_auth": false,
  "webhook_auth_header_name": null,
  "speed_boost": false,
  "auto_highlights_result": null,
  "auto_highlights": false,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_audio_quality": null,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "content_safety": false,
  "iab_categories": true,
  "content_safety_labels": {
    "status": "unavailable",
    "results": [],
    "summary": {}
  },
  "language_detection": false,
  "language_confidence_threshold": null,
  "language_confidence": null,
  "custom_spelling": null,
  "throttled": false,
  "auto_chapters": true,
  "summarization": false,
  "summary_type": null,
  "summary_model": null,
  "custom_topics": false,
  "topics": [],
  "speech_threshold": null,
  "speech_model": "best",
  "chapters": [
    {
      "summary": "This is the first episode of the Data Stories podcast. It is a podcast about data visualization that Enrico and Moritz are doing together. We have a number of plans and I really hope that you will enjoy it.",
      "gist": "Data Stories: The Podcast",
      "headline": "This is the first episode of the Data Stories podcast about data visualization",
      "start": 280,
      "end": 36790,
      "id": "ep_1_ch_0"
    },
    {
      "summary": "How is it going? What happened during the last week or couple of weeks? I analyzed a muesli network. I have a data set for working on web traffic and how people navigate on the web. It's very much in the early stages.",
      "gist": "Back at the desk again",
      "headline": "How is it going? What happened during the last week or couple of weeks",
      "start": 37730,
      "end": 92010,
      "id": "ep_1_ch_1"
    },
    {
      "summary": "This is a busy period during of the year. People start getting anxious about submissions to this week. And me personally, I have a number of projects and I'm really, really excited about them. It's a little bit late, in my opinion, but it's better later than never.",
      "gist": "A busy period for research projects",
      "headline": "People start getting anxious about submissions to this week, I mean research",
      "start": 92370,
      "end": 203950,
      "id": "ep_1_ch_2"
    },
    {
      "summary": "Moritz: We really need to have more channels to let people from academia and from industry or design or similar fields talk to each other. We are really experiencing a kind of explosion of visualization everywhere. Our idea for the podcast is to have one central theme per episode, where we would gather some material and also ask listeners for opinions.",
      "gist": "The Future of Data Visualization: Podcast",
      "headline": "The podcast aims to let people from academia and industry discuss data visualization",
      "start": 204530,
      "end": 709960,
      "id": "ep_1_ch_3"
    },
    {
      "summary": "There's also a difference in what data set you use, and often you see it used for geospatial networks. The hardest thing anyway, is mapping a network onto the world.",
      "gist": "The visualization of the wind turbines",
      "headline": "Different techniques can be used to visualize different data sets. But if I have to compare the same technique",
      "start": 711340,
      "end": 880460,
      "id": "ep_1_ch_4"
    },
    {
      "summary": "Animation itself could be used in a more interesting and complex way in interactive environments. I would call it something like user controlled animation in a way that users can not only start and stop the animation. I think maybe also to go more in the direction of a simulation.",
      "gist": "Exploring the interactive possibilities of animation",
      "headline": "Nobody has tried to use animation in a way that it can be used interactively",
      "start": 880500,
      "end": 1073922,
      "id": "ep_1_ch_5"
    },
    {
      "summary": "The topic of animation is a topic that really attracts me from the research point of view. In some cases, animation seems to be better, in some other cases, it's very bad. There are studies that are more focused on animation as when used for visualization. But as soon as you try to use visualization with the purpose of getting insights out of data, there are controversies.",
      "gist": "Let's talk animation in data visualization",
      "headline": "There is a lot of research on whether animation works when used for visualization",
      "start": 1074106,
      "end": 1403622,
      "id": "ep_1_ch_6"
    },
    {
      "summary": "A story is a powerful device to transport something. And so I think part of the attraction really, of these animated maps is this. How will it end?",
      "gist": "Data Stories: Exploring the Data",
      "headline": "Data stories are powerful devices to transport something",
      "start": 1403806,
      "end": 1482850,
      "id": "ep_1_ch_7"
    },
    {
      "summary": "Researchers are consistently against animation, but I'm not convinced. Some specific patterns can be detected a lot better by using animation. I think we should keep encouraging people doing animated visualizations. There is a lot of research to do in this area.",
      "gist": "Animation in Data Visualization",
      "headline": "There are some studies that are actually against animation in visualization",
      "start": 1482890,
      "end": 1838490,
      "id": "ep_1_ch_8"
    },
    {
      "summary": "Do we have a new genre here? Data entertainment? Why not? In ten years you can study data entertainment. As long as it is clear and well crafted, of course.",
      "gist": "Data Entertainment: Is It a New Genre?",
      "headline": "Do we have a new genre here, data entertainment",
      "start": 1839430,
      "end": 1878696,
      "id": "ep_1_ch_9"
    },
    {
      "summary": "One other thing. Should we get to the next topic? Because we have one, let's say half topic still in the back burner. And if you want to send some feedback and questions, we would really, really love to get some.",
      "gist": "Hello, How Do You Like This Podcast?",
      "headline": "We have one topic still in the back burner, and we want to keep it short",
      "start": 1878808,
      "end": 1924300,
      "id": "ep_1_ch_10"
    },
    {
      "summary": "What's the matter with these visualization contests and marathons or similar stuff? Do you think we are in a contest overload? If I could reduce the number of contests to the half and increase the quality, I would do that in a Snap.",
      "gist": "What's the Matter With Visualization Contests?",
      "headline": "What's the matter with these visualization contests and marathons",
      "start": 1924720,
      "end": 2029308,
      "id": "ep_1_ch_11"
    },
    {
      "summary": "A few days ago, I tweeted something about the last prize given the visualizing. Visualizing marathons. I was really impressed. But I have some concerns and this is true for any other kind of marathon or contest. It's not clear whether, what are the benefits?",
      "gist": "The best of the best",
      "headline": "A few days ago, I tweeted something about the last prize given in a visualization contest",
      "start": 2029404,
      "end": 2430436,
      "id": "ep_1_ch_12"
    },
    {
      "summary": "Andrew Vande Moere has been trying to quantify the aesthetic effect of visualizations. We could have an episode with him discussing absolutely the difficulties there. I cannot think of a better person to talk about aesthetics than.",
      "gist": "Aesthetic Impact of Visualizations",
      "headline": "Andrew Vande Moere studies aesthetics of visualizations",
      "start": 2430588,
      "end": 2465730,
      "id": "ep_1_ch_13"
    },
    {
      "summary": "We would really love to receive not only feedback, but also questions or any kind of inspiration for follow up episodes. If you have anything to say about these marathons and contests that we are going to discuss during our next episode, please feel free to to send a message.",
      "gist": "PODCAST: A Two Week Plan",
      "headline": "We would really, really love to get your feedback on this podcast",
      "start": 2466830,
      "end": 2584550,
      "id": "ep_1_ch_14"
    }
  ],
  "disfluencies": false,
  "entity_detection": false,
  "sentiment_analysis": false,
  "sentiment_analysis_results": null,
  "entities": null,
  "speakers_expected": null,
  "summary": null,
  "custom_topics_results": null,
  "is_deleted": null,
  "multichannel": false,
  "audio_channels": null,
  "episode_num": "1",
  "episode_metadata": {
    "speakers": [
      "Enrico Bertini",
      "Moritz Stefaner"
    ],
    "WPid": "110",
    "url": "https://datastori.es/podlove/file/222/s/feed/c/mp3/datastories-01.mp3",
    "episode_title": "Exuberant Animated Data Kitsch"
  }
}